{"TopicId":100086,"ForumId":51,"TopicTitle":"Developing Duna (pic heavy) - ^_^ with Part 11 ^_^","CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-02-19T07:40:20Z","PageNum":2,"Articles":[{"CreatedByName":"Wabbit","CreatedById":110502,"CreatedDateTime":"2015-02-23T22:55:07Z","Content":"Also, you gotta remember to bring plenty of Science! experiments. Goo-Dudes!"},{"CreatedByName":"macdjord","CreatedById":5630,"CreatedDateTime":"2015-02-23T23:35:48Z","Content":"\u003E \n\u003E How do your boosters engage the parachutes when they are outside the 2.5km load limit when you have your payload focused? Or do you normally use the Stage Recovery mod to get their money back? I am not using it currently, but now that I have a 55t rated booster that costs 150k, I am considering options on how to save kerbucks.\n\nHe\u0027s not playing in Career mode. The \u0027savings\u0027 he\u0027s talking about are purely theoretical. He designs his ships such that the boosters *could* be recovered *if* the game followed them down - but when he actually does his launches, the game despawns them and he just pretends they were recovered."},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2015-02-24T00:21:33Z","Content":"Well its good to see kurt, nelemy and aldenr going back on a mission. Is Thombles going to?\n\nAnd will we hear from the Laythe base?"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-02-24T01:14:17Z","Content":"And you had to do this as I was mid-duna mission. Now I have to read this.\n\n![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-02-27T05:01:46Z","Content":"Yes! Awesome! Duna! Can\u0027t wait. Been reading Long Term Laythe since around mid 2013."},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2015-02-27T05:05:01Z","Content":"He\u0027s at it again ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) Nice job."},{"CreatedByName":"Sojuice","CreatedById":118719,"CreatedDateTime":"2015-03-01T18:45:09Z","Content":"Can\u0027t wait until the next part!!!"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-03-01T23:38:50Z","Content":"**Developing Duna - Part 2** \n\n**Placing Payloads 1**\n\nThe past couple weeks of my KSP time has mostly been taken up with boosting various mission equipment into Kerbin orbit, and lots of rendezvous and docking maneuvers. A thankless task, but somebody has to do it. And if I have to do it, you get to hear about it. Also, I\u0027ll introduce the Duna mission crew as I go along in this episode.\n\nIn episode 1, we got the Duna Base payload boosted into orbit and mated with its Big Advanced Nuclear Tug, BANT 1. There was also a little refueling going on.\n\nThis episode I\u0027m starting with some Double BANT Adapters, which are used to tie two Tugs together into one ship. I do this to cut down the number of ships that have to be handled separately during the transfer of the armada between planets. I previously launched this kind of adapter oriented horizontally, with the parts hanging out in the breeze, but in the spirit of this mission (\u0022try to make payloads that would fit inside launch fairings\u0022) two of the adapters were oriented with their long axes along the longitudinal axis of the rocket. \n\n![gT9YEzr.jpg](http://i.imgur.com/gT9YEzr.jpg)\n\nThese adapters contain fuel (since the old-style Reusable Rocket had the lift capacity anyway) and a probe core and reaction wheels so the adapters can be oriented for easy docking. They do not have propulsion built in.\n\n![Q3AYQQq.jpg](http://i.imgur.com/Q3AYQQq.jpg)\n\nOnce in orbit, the adapters were separated from the core (they were attached by Standard docking ports on their center tanks, and with struts).\n\n![4nj9Y3l.jpg](http://i.imgur.com/4nj9Y3l.jpg)\n\nIt wasn\u0027t clear how the long boom on the front would affect the stability of the sustainer stage when it was returned to KSC, so the sustainer\u0027s parachutes were used to augment the engine during landing...which was successful.\n\n![JgwQROv.jpg](http://i.imgur.com/JgwQROv.jpg)\n\nA double adapter, of course, requires a couple Tugs. So the next two launches (which I\u0027m scheduling roughly two weeks apart) were of the Kerbodyne Launch Consortium\u0027s BARR lifter, each with a Big Advanced Nuclear Tug.\n\n![EcaOslO.jpg](http://i.imgur.com/EcaOslO.jpg)\n\nThe Tugs were each docked to the adapter in turn. Ooops...I see that while being very careful to align the Tugs so that they fit well, I cleverly faced both of their high gain antennas inward toward each other. Well, at least there will be excellent communication between the two Tugs. And their payloads will have high gain antennas, so it really doesn\u0027t matter (not that the antennas really matter anyway, but I like to consider such details in a cursory way).\n\n![lm13T03.jpg](http://i.imgur.com/lm13T03.jpg)\n\n![6Go95Ce.jpg](http://i.imgur.com/6Go95Ce.jpg)\n\nThe next payload lofted is an important one indeed (next image below). The stack fits within the 6-meter diameter I\u0027m imposing with the BARR lifter. From the top down, below the aerodynamic nose cone we have:\n\n1) Standard-to-Senior Port Adapter Mini-Tug (hiding in the shadow of the nose cone). This can be docked to one of the BANTs (which all have Senior ports) in case the Nuclear Tug is needed to haul around a ship with only Standard docking ports.\n\n2) Interplanetary Transfer Habitat, with a 2-kerbal control cabin, and two Hitchhiker modules -- designed to comfortably house a crew of four for trips between planets. One of the Hitchhikers is surrounded by fuel tanks to provide a \u0022radiation cellar\u0022 to shelter the kerbals in case of any gigantic Kerbol-flares -- and the sleeping quarters are in there for general protection against cosmic rays (we don\u0027t want our four kerbals suddenly developing super powers...that would be too fantastic).\n\n3) Duna Space Stations compact core. This has one Hitchhiker module, two large RCS storage tanks, and two tiers of interdigitated docking ports...Standard and Senior. Large fuel tanks from the BANTs (which have docking ports at both ends) will be docked to the Senior ports once in Duna orbit.\n\n4) Communication Satellites (4) surround the Station core. These will be deployed in Duna orbit. Again...I don\u0027t mess with the details of a communications mod, but I like to have a reasonable number of comsats in place.\n\n5) Gas Station module that can be landed on the surface of Duna wherever it may be needed.\n\n![2IQdpjC.jpg](http://i.imgur.com/2IQdpjC.jpg)\n\n![y8v0dVO.jpg](http://i.imgur.com/y8v0dVO.jpg)\n\nBelow: After dumping the Duna Station payload into orbit, the BARR\u0027s sustainer was deorbited for landing at KSC. Then the Double-Tug maneuvered to intercept the Duna Station payload and dock it to one of the double-adapter ports.\n\n![agblTob.jpg](http://i.imgur.com/agblTob.jpg)\n\nThe next payload launched was the Duna Landers ship, although it also has another Interplanetary Transfer Habitat (so that all eight of the Duna crew members can be on the same Double-Tug ship). The Landers will serve as reusable transportation between Duna orbit and the surface. They also will serve as exploration hab/lab outposts that can be hopped to various locations on Duna in support of rover exploration teams. All this is enclosed in a 6.5 meter fairing (you can see it if you squint really hard with your imagination).\n\n![OpxLhsj.jpg](http://i.imgur.com/OpxLhsj.jpg)\n\nBelow are a few random pics from the flight: Separation of the \u0027recoverable\u0027 boosters just before turnover; separation of the payload into orbit; return of the sustainer.\n\n![aufX3Ek.jpg](http://i.imgur.com/aufX3Ek.jpg)\n\nAt this point, the Duna Landers payload was  **NOT** docked with the Double-Tug. It did not seem efficient to try to maneuver the currently-unbalanced Double-Tug around...so another workhorse was called into action (which was going to be needed for multiple jobs). There was a old-style (2.5 meter) Double-Tug named \u0022SP Tug A\u0022 that had previously been used to haul a spaceplane to Laythe...after which it was returned to Kerbin. It was mostly empty of fuel, so the next launch in this mission was by an old Reusable Rocket with a Tug Refueler payload (this launch was subcontracted by Kerbodyne to the Rockomax Launch Alliance).\n\n![ou4dgjl.jpg](http://i.imgur.com/ou4dgjl.jpg)\n\nThe Tug Refueler rendezvoused and docked with SP Tug A, and then transferred almost all of its fuel to the Tug (which was still not fully refueled at this point). The Refueler saved a little bit of fuel for its deorbit burn...but it turned out to be not enough, so I had to complete the deorbit burn using RCS. Then the Refueler successfully landed at KSC, ready for re-use, of course.\n\n![eVtv9ka.jpg](http://i.imgur.com/eVtv9ka.jpg)\n\nThe partially refueled SP Tug A then headed off to rendezvous with the Duna Landers payload, docked with it, then tugged it over for a rendezvous with the Double-BANT Tugs. Good little tug! Have a cookie!\n\n![kJE6cZZ.jpg](http://i.imgur.com/kJE6cZZ.jpg)\n\nThen our plucky tug lined up the Duna Landers payload with a Double-BANT docking port, and then separated from the payload and moved off to the side. The Double-BANT then eased forward to dock with the Duna Landers payload.\n\n![eE89FoV.jpg](http://i.imgur.com/eE89FoV.jpg)\n\nFinally, its current mission completed, SP Tug A fired its engines to move off to a safe orbit. Note that the Double-BANT ship is still not quite ready to go to Duna -- you may recall from last episode that the BANTs are launched with less-than-full rear tanks (because of the payload capacity of the BARR), so some topping off of the tanks is going to be needed. Also, a couple tons of fuel was transferred from one of the Rockomax X200-8 fuel tanks of the double-adapter (the one under the Landers payload) into the two Tugs to balance the masses of the payloads. The adapter structure connecting the two Tugs may look kind of flimsy, but if the payload masses are balanced, the structure really doesn\u0027t do much except keep the Tugs in lockstep, so the structure is sufficient.\n\n![u9akETY.jpg](http://i.imgur.com/u9akETY.jpg)\n\n**Crew Casting 1**\n\nBut let\u0027s leave the rest of the payload launches for later while we meet some of our Duna Mission Crew. The Mission Commander is  **Thompbles Kerman** (first kerbal to land on Bop; first Commander of Minmus Base; Commander of the Laythe Expedition; circumnavigated Pol). Let\u0027s eavesdrop on the conversation he\u0027s having with Bill Kerman in the KSC Astronaut Complex:\n\n![ekKS3CI.jpg](http://i.imgur.com/ekKS3CI.jpg)\n\nThompbles: \u0022Bill, I want to talk to you about our launch dates...\u0022\n\nBill: \u0022Yes, yes...I know. You had the launch dates scheduled for months ahead of time...but Jebediah\u0027s new mission to Eve has an earlier transfer window, so he needs some of them. You\u0027ll still have time if we bump yours down six weeks.\u0022\n\nThompbles: \u0022Barely. Assuming nothing goes wrong. Why the big rush about getting Desdin back from Eve, anyway? Can\u0027t it wait?\u0022\n\nBill: \u0022Oh, well...the whole Blutonium refining thing is apparently a bust. And the new Eve Return ship apparently has some problem with the 48-7S engines. Those were some of the first 48-7S engines off the line, and Rockomax says it may eventually be unsafe to use them at full thrust...so we want to use them while they\u0027re still good.\u0022\n\nThompbles: \u0022Fine. But Jeb\u0027s mission plan is inefficient. He doesn\u0027t need all those launches. Elon had his boys look over the plan, and they say it can be done with a lot fewer launches...especially the refueling launches.\u0022\n\nBill: \u0022Eh? It takes a lot of fuel to refill that Eve Lander after it boosts into orbit.\u0022\n\nThompbles: \u0022I know. But look...at this modified plan. First, the Eve Lander itself doesn\u0027t need to use the main pad. It\u0027s designed as a stand-alone ship. We can prep it in the SPH and launch it from the runway.\u0022\n\n![FcXRtWx.jpg](http://i.imgur.com/FcXRtWx.jpg)\n\nThompbles: \u0022Also, this is just a simple mission to pick up Desdin. Jeb doesn\u0027t need a new Hab ship launched for that...he can use one of the Hab ships from our Laythe expedition. Just grab it off from the Grey Havens Express. And all the Tugs he\u0027ll need are sitting in orbit.\u0022\n\nBill: \u0022Hmmm. Yes. But that will need consumables refilled...\u0022\n\nThompbles: \u0022Do it with flights of the Passenger Pigeon spaceplane. It\u0027s built to haul ten kerbals...just haul up the snacks and transfer air, water, and scrubbers.\u0022\n\nBill: \u0022But what about all the fuel for the Eve Lander and the Tugs?\u0022\n\nThompbles: \u0022Use the stores we already have in orbit in the Space Station and the old Tanker Station 1.\u0022\n\nBill: \u0022But that fuel is up there for contingency purposes...\u0022\n\nThompbles: \u0022And this is the contingency we need it for. It\u0027s been sitting up there for years...it\u0027s time we used it. Elon says he\u0027ll provide rockets at discount prices to carry your replacement fuel up next year when there will be plenty of open launch dates.\u0022\n\nBill: \u0022Yes, it could work. But why don\u0027t YOU guys use the fuel in orbit instead of all these refueler flights you have scheduled?\u0022\n\nThompbles: \u0022Elon says that would be fine with him...but these refueler flights were subcontracted to Rockomax to keep them happy about Kerbodyne getting the bulk of the lift for this mission. I don\u0027t think you want to mess with that political can of worms.\u0022\n\nBill: \u0022Ah. Yes. OK, I\u0027ll talk to Jeb. I think we can do this.\u0022\n\nSuch is the life of a Mission Commander. Also, there was a problem that the Space Station is somewhat old, and has no Senior Docking ports (it was built before those came out), so it would be difficult to refuel newer Tugs or the Eve Lander, which have Senior ports. But it turns out (below) that a Standard-to-Senior docking adapter can be mounted on the back of the Passenger Pigeon for upgrading the Space Station, so that problem was solved as well. So the Duna launches could keep to the original schedule (and I get to do my Eve Return mission before 48-7S engines get nerfed).\n\n![E9r8Ies.jpg](http://i.imgur.com/E9r8Ies.jpg)\n\nThe Deputy Commander for the Duna Mission, by the way, will be  **Adly Kerman** (Commander of the first Moho mission...where he got stranded in Kerbol orbit for years; visited Magic Boulder; only kerbal so far to RETURN from the surface of Eve; and, until recently, Commander of the Guardian Asteroid Redirect project). Adly was one of the \u0022New Nine,\u0022 the second group of kerbalnauts hired, so he has been on active duty for a long time.\n\n**Placing Payloads 2**\n\nOK...back to placing payloads into orbit. There were TWO double-tug adapters put into orbit during the first launch of this episode, so let\u0027s put that second adapter to use...Which means, of course, two more BANTs need to be boosted into orbit. Here\u0027s BANT 4\u0027s launch (sorry for the night launch...but rendezvous timing and all...):\n\n![qT0ubGx.jpg](http://i.imgur.com/qT0ubGx.jpg)\n\n...and here\u0027s BANT 5\u0027s launch:\n\n![PjxsaaJ.jpg](http://i.imgur.com/PjxsaaJ.jpg)\n\nThey both docked to the remaining double-BANT adapter, of course. We\u0027ll skip that picture and get on to the payloads. The next two launches had identical payloads: Two Fuel Stations (top and bottom) and two Fuel Fido rovers (in the middle). All of which fits inside the 6-meter limit...so you can picture the 6.5-meter fairings there, if you\u0027d like. Hopping all around Duna is going to require lots of fuel, and these Fuel Stations (and the orbiting Space Station) will provide that fuel. And the Fuel Fidos are how the fuel gets moved around.\n\n![TjqtDvj.jpg](http://i.imgur.com/TjqtDvj.jpg)\n\nAs before, the first Fuel Fido/Fuel Station stack was hunted down and grabbed by the second set of Double-BANTs...\n\n![1pbUXk1.jpg](http://i.imgur.com/1pbUXk1.jpg)\n\nThen the second Fuel Fido/Fuel Station stack was retrieved and tugged around by the plucky SP Tug A, which brought the payload to the Double-BANT, lined it up for docking, then separated and scooted itself off to the side so that the Double-BANT could slide in for the final docking (below). I only wish it went as fast to DO as it does to READ about it.\n\n![VhFquua.jpg](http://i.imgur.com/VhFquua.jpg)\n\n**Crew Casting 2**\n\nThe previous payloads involved rovers...and so will the next payload. So let\u0027s pause our prolonged payload pushing project to meet a couple of the kerbals who\u0027ll be driving those rovers all over Duna:\n\n **Kurt \u0022Jaymak\u0022 Kerman** (first kerbal to land on Moho...yay!; one of the kerbals stranded at Moho for years...boo!; Commander of the Magic Boulder mission; Commander of the Eve Ascent Test mission; member of Laythe Expedition; circumnavigated Pol) was also a member of the \u0022New Nine\u0022 class of kerbalnauts, so he\u0027s a long-timer.\n\n **Nelemy Kerman** (first kerbal to land on Pol; first Minmus Base crew; Laythe Expedition crew; second kerbal to land on Tylo; explored Bop). Nelemy is related to aerospace industry bigwigs, so he gets to go on good missions.\n\nKurt and Nelemy we in charge of testing out the Duna rovers (both the Fuel Fido refueling rover, and the Duna Fido exploration rover). Below we see them racing around the KSC. They did a lot of that.\n\n![JgUpOoB.jpg](http://i.imgur.com/JgUpOoB.jpg)\n\nKurt: \u0022Hey! Why are you using your rocket engines? This is supposed to be a tanks-full race.\u0022\n\nNelemy: \u0022Dude, I\u0027m just trying to better simulate Duna\u0027s lower gravity. Don\u0027t be a sore loser.\u0022\n\nThe overhead view shows that although these rovers use my favored eight-wheel design, they have be radically reshaped so that they can be part of a 6-meter diameter payload stack. I could have put my older, rectangular arrangement rovers in the 6-meter fairing by standing them up on end...but that didn\u0027t pack nearly as well. Below, the rovers can successfully traverse the crawler-way tracks...although Nelemy did blow a tire by driving too fast there. The Duna Fido has all those tanks, engines, parachutes, and RCS quads because its designed to be a \u0027hopper\u0027 as well as a rover, and can even fly from Duna surface to orbit.\n\n![prEhsxz.jpg](http://i.imgur.com/prEhsxz.jpg)\n\nThe months of rover testing were very stressful to everyone at KSC...at least until Kurt and Nelemy got banned from driving around the buildings.\n\n![YUkFH6Q.jpg](http://i.imgur.com/YUkFH6Q.jpg)\n\nKurt proved to be a very skillful and relatively careful driver. The videos he posted to the Kerbal-Wide-Web proved to be quite popular. Luckily, Nelemy generally drove in the Duna Fido rover prototypes that had a cockpit with a crash tolerance of 45.\n\n![YjZZgj5.jpg](http://i.imgur.com/YjZZgj5.jpg)\n\nNelemy: \u0022Hahahahaha..oop...WIPEOUT!\u0022\n\nKurt: \u0022You OK back there?\u0022\n\nNelemy: \u0022Yeah, Dude. Um...I\u0027m going to need a ride back to the hanger again.\u0022\n\n**Placing Payloads 3**\n\nBack to the payloads. The next launch was the Duna Rovers payload, and it contained (from the top):\n\n1) A four-pack of un-kerballed Science Lander Probes. These would be dropped on Duna to gather SCIENCE that the crew would later retrieve.\n\n2) Three Duna Fidos. These are the exploration rovers. They can also hop long distances (even up to orbit) if you get bored with roving.\n\n3) One more Duna Lander. You can never have too many. Buy the complete set!\n\n![aBOsh4N.jpg](http://i.imgur.com/aBOsh4N.jpg)\n\nAnd where there\u0027s a payload, there must be a Tug. Below is the final BANT launch of this episode. Boost, separate, rendezvous, dock (Ooooo...with the Lazer Docking Cam mod, which I really like). \n\n![IgKeL1N.jpg](http://i.imgur.com/IgKeL1N.jpg)\n\nOne more payload assembled! But, alas, not yet fully fueled. But later for that.\n\n![x1vFpcC.jpg](http://i.imgur.com/x1vFpcC.jpg)\n\nSooooo many payloads. Soooo many rendezvous and dockings. And it didn\u0027t help that KSP would freeze up on me often, usually during scene changes. Gah! That bug (be it memory leak or whatever) really sucks the fun out of the game for me. But...I was looking forward to the next payload. First, some more crew...\n\n**Crew Casting 3**\n\nDuring the Laythe Expedition, the real workhorse for exploring that moon was the BirdDog rover/plane. With the BirdDog (and its associated GasStations to refuel it), you could fly to areas of interest, rove around to explore the surface in detail, and fly off to a new spot when you got bored. The plane handled well and could reliably land in all sorts of Laythe terrain.\n\nBut would aircraft be useful for exploring Duna, which lacks the substantial atmosphere and lovely, lovely oxygen of Laythe? Engineering studies were not promising. Rocket engines just don\u0027t give you much range. And landing is a nightmare. But Elon\u0027s boffins came up with something that just might work: The DunaDog rover/rocket-plane.\n\nBefore we meet the plane, lets meet the pilots:\n\n **Aldner \u0022Buzz\u0022 Kerman** (second kerbal to land on Dres; first Minmus Base crew; BirdDog test pilot and primary BirdDog explorer of the Laythe Expedition; explored Tylo and Bop). Aldner is unusually popular with female kerbals who want celestial landmarks named after them.\n\n **Emilynn \u0022Hawk\u0022 Kerman** (KSC flight instructor; Commander of the Vall Expedition; addition to Laythe Expedition; explored Bop and Pol). She was a female kerbalnaut back before it was cool to be one.\n\nFor the plane, two versions were designed. One was a tri-plane (bi-canard) version of the BirdDog with rocket motor and ion thruster power. The other was the same plane, but with a mono-wing of equivalent lift in a high aspect ratio, which was designed to fold up for transport.\n\nThe high aspect ratio wing varient is something you\u0027d see in reality...Just like you can see fold-up wings in reality. Unfortunately, KSP does not provide us with fold-up wings...so I will be using the compact tri-plane version. Both designs performed the same in testing. Both float like butterflies in Kerbin\u0027s atmosphere.\n\n![hR1slLD.jpg](http://i.imgur.com/hR1slLD.jpg)\n\nThe DunaDog has a downward-facing engine on its belly to assist with take off and landing. Horizontal landings MIGHT be attempted on Duna...but the DunaDog is equipped with a parachute-augmented vertical landing system, which is expected to be its primary mode of landing.\n\nBelow are some pictures of one of Aldner\u0027s test flights of the DunaDog prototype on Kerbin. The idea was to fly up above 8 km altitude where the air pressure on Kerbin is the same as the air pressure near Duna\u0027s surface, then see how the plane handled.\n\nAldner: \u0022Take off was at 38 meters per second. Rocket engine and four ions working good. I resisted buzzing the tower.\u0022\n\nEmilynn (CAPCOM): \u0022Roger, Buzz. Good boy.\u0022\n\nAldner: \u0022Climb rate ten. 50 meters per second airspeed. Altitude 400. A turbojet would sure improve this bird.\u0022\n\nEmilynn: \u0022Roger. But it wouldn\u0027t be useful where we\u0027re going.\u0022\n\nAldner: \u00222500 meters. I\u0027m cutting the rocket engine. I\u0027ve used about half that fuel. Speed dropping. So slow.\u0022\n\nAldner: (14 minutes later) \u00224,400 meters. Still doing the big lazy spiral climb. Airspeed is increasing with altitude...but still so slow. If I got out and walked it might be faster than this.\u0022\n\nEmilynn: \u0022I doubt it. If you do a good job, we\u0027ll take up some K-38s later to satisfy your need for speed.\u0022\n\nAldner: (35 minutes after takeoff) \u0022OK, Hawk...I\u0027m up over 8,000. Xenon down to 59%. The speed got up to a blazing 102 meters per second for a while there. Be still, my racing heart. I\u0027ll see how slow I can get this bird to fly.\u0022\n\n![ApjCfjV.jpg](http://i.imgur.com/ApjCfjV.jpg)\n\nHappily, I spent less than 35 minutes flying the climb, since I was doing it at 2x physical time warp. The problem with landing horizontally on Duna is that the plane will need to be moving fairly fast to maintain lift...and tests had shown that the plane is very unstable rolling along at 80 m/s on the ground, and would likely flip out and crash. So Aldner was trying to \u0022land\u0022 as slowly as possible at the 8,000-meter level to see if the fears of the engineers were true.\n\nAldner: \u0022Whoa. OK, I stalled and she rolled. Falling now.\u0022\n\nEmilynn: \u0022Hang on to her, Buzz.\u0022\n\nAldner: (30 seconds later and 1,800 meters lower) \u0022OK. I\u0027ve got in a stable dive. Pulling up.\u0022\n\nEmilynn: \u0022Roger. I knew we could count on you, Buzz.\u0022\n\nAldner: \u0022Bottomed out at 6,000. Arrggh...now I have to do the slow climb again.\u0022\n\n![8XLkj5k.jpg](http://i.imgur.com/8XLkj5k.jpg)\n\nAnd so the tests continued. Using the belly rocket engine during \u0022landings\u0022 at 8,000 meters looked promising...but you have to be careful, or pitching up can bleed off too much speed as the engine\u0027s jet points more forward. This led to another flip out...from which Aldner recovered only because he was high in the sky -- not something you\u0027d want to happen when you\u0027re trying to land.\n\nAldner landed the DunaDog in the hills West of KSC, then did some roving tests. Like the BirdDog design, when the nose gear is raised, the two rover wheels at the front settle onto the ground and the plane makes a passable rover, reaching speeds of over 40 m/s on the drive back to the hanger.\n\n![RI0ygjd.jpg](http://i.imgur.com/RI0ygjd.jpg)\n\n**Placing Payloads 4**\n\nBoosting the DunaDog into Kerbin orbit proved to be a bit of a challenge. For the original BirdDog (and its later bi-wing Airedale variation), the plane was simply put on the top of a rocket and boosted to space. But engineering tests showed that the DunaDog, with all that wing and canard area, could not be launched that way because it made the rocket unstable.\n\nSo the DunaDogs (two of them) were launched on the sides of the rocket, Space Shuttle style. Because the masses of the planes were low, a special two-booster version of the old-style Reusable Rocket was used:\n\n![AkXTuM6.jpg](http://i.imgur.com/AkXTuM6.jpg)\n\nThe side booster separation went well (the positions of the sepatrons had been changed to prevent them from causing any damage to the DunaDogs. The press to orbit on the sustainer went fine, and the rocket reached orbit with more than enough fuel left for returning the sustainer to KSC.\n\n![5AlT1Ya.jpg](http://i.imgur.com/5AlT1Ya.jpg)\n\n![9CdZ7jY.jpg](http://i.imgur.com/9CdZ7jY.jpg)\n\nThe original idea was to have the DunaDogs attached to the sides of the booster by docking ports, and to carry up an adapter structure on the nose of the rocket. The DunaDogs would then separate and dock with the adapter, which would later be docked to a Tug for transport to Duna. But the DunaDogs have no RCS system (they are not spaceplanes), and this would leave the planes attached to the Tug via wobbly docking ports...so the method below was chosen instead:\n\nThe DunaDogs are attached via separators and struts to one of the X200-32 Fuel Tanks of the sustainer, which was connected to the top and bottom parts of the sustainer by Senior docking parts. Once in orbit, the ship was aligned Normal, then the front part of the rocket separated (it had RCS) and moved forward. Then the tank with the DunaDogs separated and moved forward (the tank had RCS mounted on it), and then slid off to the side. Finally, the front part of the rocket moved back down to dock with the bottom part (which had a probe core with SAS to keep it stable). VoilÃƒÂ¡! The two DunaDogs were still firmly strutted to their tank (which even had some fuel left in it from boost) that could be docked to a Tug.\n\n![w8YQVUF.jpg](http://i.imgur.com/w8YQVUF.jpg)\n\nThe re-connected sustainer had a full rear tank, and returned to KSC without any problems.\n\n![pzR5gAc.jpg](http://i.imgur.com/pzR5gAc.jpg)\n\nThe job of pushing the relatively light DunaDog payload to Duna would go to our plucky SP Tug A, which rendezvoused and docked with the DunaDog stack.\n\n![Suq2a26.jpg](http://i.imgur.com/Suq2a26.jpg)\n\nOK...we are almost done with the payloads...we just need to top off the tanks of the Tugs and the armada will be ready to go. This required three more Reusable Refueler launches on old Rockomax Reusable Rockets.\n\n![Zy1RBBG.jpg](http://i.imgur.com/Zy1RBBG.jpg)\n\nOne Refueler went to the SP Tug A with the DunaDogs payload and topped off its tanks...then the Refueler returned to KSC. The second Refueler went to the BANT 2 \u0026 3 ship, topped off its fuel, and then returned to KSC. The third Refueler docked with the BANT 4 \u0026 5 ship, fed it yummy propellant, then returned to KSC.\n\n![W8w4rSZ.jpg](http://i.imgur.com/W8w4rSZ.jpg)\n\nBy this time I had gotten pretty bored with routine rendezvous and dockings, so I was trying out MechJeb\u0027s automatic rendezvous autopilot. If a Hohmann transfer to the target will not be available soon, MechJeb boosts the ship into a higher orbit, circularizes it, then waits for a Hohmann transfer back to the target orbit. This seems wasteful compared to what I normally do. If I need a phasing orbit for rendezvous, I boost the ship into an elliptical orbit, tweak the periapsis of the ellipse to the target orbit, then wait the necessary number of orbits until intercept (perhaps adjusting the apoapsis on the last pass to make intercept). This saves delta-V by not bothering to circularize the phasing orbit. But one can tolerate some silliness for the convenience of automation, I suppose.\n\nWhat is painful to watch, however, is MechJeb\u0027s docking autopilot at work: wandering the wrong direction, then retracing steps...all the while wasting RCS rotating the ship (when there are perfectly good reaction wheels on board). I only use the RCS for translations during docking, not for rotations. Ugh.\n\nThere was one more refueling to be done. In episode 1, a Refueler had been sent to the first payload (Duna Base, etc.) and had used a little less than half of its fuel topping off the Duna Base ship. That Refueler was moved to the BANT 6 ship with its Duna Fido payload, and it topped off the Tug...then the Refueler returned to KSC.\n\n![2orfXcc.jpg](http://i.imgur.com/2orfXcc.jpg)\n\n**Crew Casting 4**\n\nThe Duna Armada was complete! All it needed was the crew, but there was no point in sending them up until shortly before the transfer window to Duna. But let\u0027s meet the two final members of our crew: The Scientists:\n\n **Hellou \u0022Chickadee\u0022 Kerman** (Vall Expedition; addition to Laythe Expedition; explored Bop and Pol). Along with Emilynn, Hellou was one of the two first female kerbalnauts. She has a Ph.D. in Geology (or whatever Kerbals call that science, since they wouldn\u0027t use the Geo prefix that means Earth).\n\n **Kelby \u0022Rockhound\u0022 Kerman** (first docking test missions; first kerbal to land on Duna; long duration flights in Kerbin orbit). Kelby was one of the \u0022New Nine\u0022 class of kerbalnauts, and he later took up the space agency\u0027s offer to send any kerbalnauts to University for advanced science degrees. He always had an interest in geology, so he got a Ph.D. in that, hoping to use his new skills on a return mission to Duna -- and that time has finally come.\n\nRather than put all their kerbalnaut eggs in one basket and have the mission get messed up at this late date in case of an accident, the Mission Controllers decided to launch the crew on two flights. The basic mission could be handled by four of the main crew (with four backup crew filling in). So Thompbles, Aldner, Kurt, and Hellou were sent up in a Crew Carrier 6d SSTO rocket piloted by Bill Kerman.\n\n![Xpltvg1.jpg](http://i.imgur.com/Xpltvg1.jpg)\n\nPardon me while I make notes on this boost for my future reference: Pitch over to 20Ã‚Â° from vertical at 5 km. Pitch to 45 degrees at 15 km. Pitch to 25Ã‚Â° from horizontal at 20 km. Switchover of the six RAPIERs occurred at 25 km at just under 800 m/s. The ship reached a 90 x 100 km orbit with 1153 m/s of delta-V remaining for orbital maneuvers and landing.\n\n![4eb7rxE.jpg](http://i.imgur.com/4eb7rxE.jpg)\n\nThe Crew Carrier docked to one of the Standard docking ports on the Duna Transfer ship (BANT 2 \u0026 3 ship) and the four crew members transferred over to one of the Habitat modules.\n\n![L2KLydf.jpg](http://i.imgur.com/L2KLydf.jpg)\n\nThe remaining crew menbers, Adly, Emilynn, Nelemy, and Kelby, were carried up in a Passenger Pigeon SSTO spaceplane piloted by Ludger and Bobgan Kerman. The spaceplane also carried a docking port adapter on its back that Ludger and Bobgan would drop off at the Space Station after delivering the Duna Crew to their ship.\n\nAlong for the ride was the first kerbal tourist: Elon Kerman himself. As long as he was helping bankroll this Duna Expedition, he decided to come along to bid farewell to the crew in orbit.\n\n![ZMAlTu5.jpg](http://i.imgur.com/ZMAlTu5.jpg)\n\nThe Passenger Pigeon climbed at a 45Ã‚Â° angle of pitch, then leveled off starting at 20 km and finishing at 30 km to build up speed. The view rotated at 37 km and 2180 m/s when the periapsis exceeded 19 km. Ludger nursed the plane along through several flameouts and lowering of the throttle until it was over 40 km going 2370 m/s at 1/8 throttle. Then he kicked in the rocket engines to push the apoapsis up above 100 km. A few additional bursts of the engines later resulted in the plane coasting out of the atmosphere with an apoapsis of 95.8 km.\n\n![GLpcxO5.jpg](http://i.imgur.com/GLpcxO5.jpg)\n\n![sEpx2nb.jpg](http://i.imgur.com/sEpx2nb.jpg)\n\nThe Passenger Pigeon required a 55 m/s burn to circularize at about 95.7 km, and had 533 m/s of delta-V remaining.\n\n![5LWVJgy.jpg](http://i.imgur.com/5LWVJgy.jpg)\n\nThe Passenger Pigeon rendezvoused with the Duna ship and docked to one of the Duna Station hub\u0027s Standard ports. The the Duna crew and Elon Kerman transferred over to the ship.\n\n![z3q0N68.jpg](http://i.imgur.com/z3q0N68.jpg)\n\nLudger and Bobgan then separated the Passenger Pigeon and headed off to the Kerbin Space Station to apply another docking port upgrade to it. After that (below) they returned for a dawn landing at the KSC airstrip.\n\n![i3akVUC.jpg](http://i.imgur.com/i3akVUC.jpg)\n\nAfter spending a couple days with the crew as they checked over the spacecraft systems, Bill and Elon transferred to the Crew Carrier and separated for return to KSC.\n\nBill: \u0022Would you like to land the ship, Elon?\u0022\n\nElon: \u0022Me?\u0022\n\nBill: \u0022Unlike launches, the landings of the Crew Carier are pretty automatic. I just sit here and look important while the ship does the work. All you need to do to land the ship is press this button.\u0022\n\nElon: \u0022OK! Do I get flight pay for the work?\u0022 \\*press\\*\n\nBill: \u0022Not unless you budget it yourself.\u0022\n\n![yOi8n9M.jpg](http://i.imgur.com/yOi8n9M.jpg)\n\nThe Crew Carrier containing one of the \u0022First Five\u0022 kerbalnauts and the Trillionaire Space Tourist landed safely at KSC.\n\n![UxUcjKb.jpg](http://i.imgur.com/UxUcjKb.jpg)\n\nThat\u0027s it for this episode. I was hoping to also send the ships off to Duna in this episode, but I\u0027ve been fiddling with my Eve mission, and I still need to handle the ComSat Upgrade ship for Laythe before I can get to that.\n\n.\n\n**Edited \u003Ctime datetime=\u00222015-03-04T22:06:46Z\u0022 title=\u002203/04/2015 10:06  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 4, 2015\u003C/time\u003E by Brotoro**"},{"CreatedByName":"The Error","CreatedById":58941,"CreatedDateTime":"2015-03-02T01:05:35Z","Content":"Agreeing with Aldner, personally: gotta go fast. But slow has its advantages.\n\nNice to see The Crew get together for another run. Plus one, it seems.\n\n(I muwt say, the DunaDog roverplanes are .... as hell.)"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-03-02T09:48:43Z","Content":"Still loving the mission rapportage, Brotoro! Entertaining and insightful as always. I also like it how you roleplay certain restrictions to your space programme. How are you finding the 6.5 metre fairing restriction? Do you find it adds to the fun or not? I thought the remodled rovers with the circular sillouhette was a very elegant solution to the fairing limitation, though I would guess it makes them slightly less stable during...ehm... \u0022atmospheric and ground-impact tolerance testing\u0022. It will be interesting to see. \n\nI\u0027m curious - does the BANT fit inside the fairing, or does it have four smaller fairings specially designed for the engine nacelles?"},{"CreatedByName":"Redhaze","CreatedById":137633,"CreatedDateTime":"2015-03-02T10:38:27Z","Content":"Another nicely narrated piece of what would otherwise be routine jobs, Brotoro. Reminds me I still have some similar work to do. ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif)"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-03-02T11:30:42Z","Content":"Yaaaay new chapter!"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-03-02T14:19:47Z","Content":"Aww. I was hoping for a nice publicity photo of Elon Kerman and the crew ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Oh well...maybe later on Duna? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-03-02T14:41:14Z","Content":"Very nice little missions and story there. Like the designs and your launch options. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-03-02T17:13:17Z","Content":"\u003E \n\u003E Still loving the mission rapportage, Brotoro! Entertaining and insightful as always. I also like it how you roleplay certain restrictions to your space programme. How are you finding the 6.5 metre fairing restriction? Do you find it adds to the fun or not? I thought the remodled rovers with the circular sillouhette was a very elegant solution to the fairing limitation, though I would guess it makes them slightly less stable during...ehm... \u0022atmospheric and ground-impact tolerance testing\u0022. It will be interesting to see. \n\u003E I\u0027m curious - does the BANT fit inside the fairing, or does it have four smaller fairings specially designed for the engine nacelles?\n\nYes, the newer rovers are less stable than the older models. Not having the wheels out at the corners makes a big difference in their cornering abilities (although it may be the larger collection of the propellant tanks raising the center of mass that is making things worse...or, more likely, both effects). But I think they will be stable enough. The challenge of fitting things in a 6-meter diameter was interesting, and gave me a chance to use the new offset tool more than I had before...but in the end I think it makes me unsatisfied by emphasizing KSP\u0027s lack of any folding structures that we have in real life for dealing with the problem.\n\nThe BANT was designed before the 6-meter diameter restriction, but it would not be effecient to put a big fairing around the whole thing when the four nacelles are fairly aerodynamic in themselves with just their parachute and radiation shield hanging out in the airstream. The radiation shields could be shaped more nosecone-like to help. But putting a fairing around the whole Tug would give the BANT a lot more frontal area than simply streamlining the four nacelles. I did move the RCS tanks and other stuff in under the main nose cone to get them out of the breeze. Short cylindrical fairings to enclose the gaps under the front nose and between the tanks would be nice, but I don\u0027t know if we are getting \u0027interstate\u0027-type fairings from Squad. Also, to make the nacelles really aerodynamic, you would like to have rear-pointing fairings around the nukes with their wide end attached to the bottom of the radiation shields to give the nacelles a teardrop shape...but I don\u0027t expect rear-pointing fairings to be an option we get. In any case, I\u0027d be surprised if the new aerodynamics model takes into account such attempts to reduce base drag...it will probably just calculate the drag based on the frontal silhouette of the ship at whatever angle of attack it\u0027s flying. But that\u0027s just a guess.\n\n**Edited \u003Ctime datetime=\u00222015-03-02T20:09:35Z\u0022 title=\u002203/02/2015 08:09  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 2, 2015\u003C/time\u003E by Brotoro**"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2015-03-03T23:37:26Z","Content":"Nice update ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nJust a suggestion: for flavor, the highest mountain on Kerbin has 6763 m and a flatish area at around 6500m. You could mount a Duna acclimatation/ R\u0026D center there ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nAnd yeah, the lack of folding abilities will surely bite a lot of people in 1.0, not only the ones that want to put planes up there. Given that parts having 2 states are in the game for quite a while, the lack of hinges is baffling, TBH..."},{"CreatedByName":"Redhaze","CreatedById":137633,"CreatedDateTime":"2015-03-04T09:48:09Z","Content":"Just an idle thought, which I should try out some time. Why not design a high-aspect-ratio aircraft, where the wing with a short nose and integrated engines is launched sideways, left- or right side up and have the tail dock to it with three or two jr clampotrons on deployment?"},{"CreatedByName":"Wabbit","CreatedById":110502,"CreatedDateTime":"2015-03-04T14:06:27Z","Content":"Kurt! Aldner! Emmilyn! Hellou! Thompbles! Nelemy-dude! (Soon the Duna landscape will be littered with snack wrappers and half eaten nut bars...)\n\nHehe... Elon Kerman. And an ion plane. This is looking great!\n\n**Edited \u003Ctime datetime=\u00222015-03-04T14:09:45Z\u0022 title=\u002203/04/2015 02:09  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 4, 2015\u003C/time\u003E by Wabbit**"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-03-13T21:24:10Z","Content":"**Developing Duna - Part 3**\n\n**Departing for Duna**\n\nIt has been a busy few weeks at the KSC. Jebediah\u0027s mission to Eve to pick up Desdin Kerman left Kerbin orbit two weeks ago, and the final checkout of the five Duna ships in orbit around Kerbin has been completed. Now it\u0027s time to send off our brave explorers to the Red Planet!\n\nBelow is the trajectory the ships will be following, with a trans-Duna-injection maneuver of about 1074 m/s required to send the craft off to Duna. Duna was relatively close to its orbital node with Kerbin (and its orbit is not too highly inclined) so Duna encounters were showing up with one maneuver. The second maneuver node on the trajectory is located at the Descending Node where a small burn of 10 to 11 m/s will be made to match Duna\u0027s orbital plane.\n\n![t56Rdb4.jpg](http://i.imgur.com/t56Rdb4.jpg)\n\nThe burns to Duna would take between 11 and 13 minutes for the various ships in the armada. These could be done with single burns, but for longer burns I prefer the two-burn method because it is more efficient. By spending more time firing the engines when the ship is closer to the planet and moving faster, less fuel is needed to get the same delta-V (because of the Oberth effect that we all know and love).\n\nThe first ship sent off was the BANT D1 Tug with the Duna Base payload. A little over half of the injection burn was made, then the engines were cut. The intermediate orbit had an apoapsis of around 2000 km, so there was no problem with encountering the MÃƒÂ¼n.\n\n![bLXIhRB.jpg](http://i.imgur.com/bLXIhRB.jpg)\n\nThe next ship up was the BANT D2 \u0026 D3 Double Tug carrying our eight heroes.\n\nThompbles: \u0022How\u0027s everything looking, Kurt?\u0022\n\nKurt: \u0022KSC reports that the Base ship\u0027s first burn was good. All of our systems are fine.\u0022\n\nAldner: \u0022Well, since they went through all the trouble of sending off a Base for us, I guess we should chase it.\u0022\n\nThompbles: \u0022OK. Duna Explorer to KSC. We are ready for TDI-one.\u0022\n\nLudger (KSC CAPCOM): \u0022Roger, Duna Explorer, you are go for TDI-one. Have a good trip. Bring me back a present.\u0022\n\n![go2QDXR.jpg](http://i.imgur.com/go2QDXR.jpg)\n\nThe first burns for the BANT D4 \u0026 D5 ship carrying the Fuel Fidos and Fuel Stations, the BANT D6 ship bringing the Fido rovers, and the SP Tug A ship with the DunaDog planes also went well.\n\nWell, I say that in one sentence, but it still represents a couple hours of work. Sure, the burns were only about six minutes each, but some of the payloads (especially the crew ship, fuel ship, and rover ship) are very laggy...so one second in game time was up to three seconds in real life. Also, some of the ships did not tolerate physical time warp well at all, wobbling around above 1x. Other ships could tolerate the warp, but too much warp caused the nuke nacelles to splay outward, wasting fuel with angled thrust. So things took a while. I only mention this so you\u0027ll feel sorry for me and tell me that I deserve ice cream for doing this.\n\n![O7EXVRc.jpg](http://i.imgur.com/O7EXVRc.jpg)\n\nYou can see the preliminary orbits after the first parts of the TDI maneuvers below, with the five payloads spaced out nicely along their ellipses.\n\n![Re6HGGK.jpg](http://i.imgur.com/Re6HGGK.jpg)\n\nThompbles: \u0022Take a good look at the planet, boys and girls. This is the last good view of Kerbin we\u0027re going to get for several years.\u0022\n\nNelemy: \u0022Dude, won\u0027t we see it as we head off to Duna?\u0022\n\nHellou: \u0022No, Nelemy. We\u0027ll be heading outward from the dark side, so we\u0027ll only see it as a crescent as it gets smaller. It\u0027s such a beautiful world. If only the rocks out in space weren\u0027t calling me so insistently.\u0022\n\nKelby: \u0022I can agree with that. Hmmm...I don\u0027t recall that the clouds looked this impressive when I left for my first Duna mission. I guess that\u0027s because we did a one-burn TDI back then.\u0022\n\n![iNJ5aYY.jpg](http://i.imgur.com/iNJ5aYY.jpg)\n\nApproximately two game-hours after their first burns, each ship came back to periapsis for the second part of their TDI burn...an example trajectory plot is below. It\u0027s easier to plot these because you just put the maneuver node at the periapsis point. You can see that an intercept was showing up even without the plane shift figured in.\n\n![Yfw5Qre.jpg](http://i.imgur.com/Yfw5Qre.jpg)\n\nThe second part of each burn went fine (if somewhat slowly for the laggy ships). You can see the burns below in the ever-popular artsy backlit motif.\n\n![4MwO7m5.jpg](http://i.imgur.com/4MwO7m5.jpg)\n\nHere is where I sing the praises of the Kerbal Alarm Clock mod. When I sent my first armada of ships out to Jool, I didn\u0027t have KAC, and keeping track of all the things happening at once was nerve-frazzling. Also, I recently began using the KAC feature where it will automatically set an alarm for any and all ships that are going to be crossing a Sphere of Influence boundary, and I highly recommend this (because carefully-planned trajectories can get messed up (sometimes wildly messed up) if a ship crosses an SOI boundary at high time warp.\n\nThe plot below shows all five ships heading away from Kerbin on hyperbolic trajectories...with those wonderful automatic SOI-Change Alarms set. You can also see that I was following the two ships of Jeb\u0027s Eve mission at the same time.\n\n![8SbJgB8.jpg](http://i.imgur.com/8SbJgB8.jpg)\n\nAs each alarm went off for a ship leaving Kerbin\u0027s SOI, I clicked the Jump to Ship button and then carefully nursed each ship across the SOI boundary at 1x speed. Once each ship passed out into interplanetary space, I had KAC set an alarm to warn me when the ship would approach the Descending Node of its trajectory relative to Duna\u0027s orbit. KAC is my friend.\n\n![QKezXM1.jpg](http://i.imgur.com/QKezXM1.jpg)\n\nAt the Descending Node, a maneuver was plotted that would not only match planes with Duna (which typically took 10 to 11 m/s of delta-V), but the fine targeting of the Duna intercept was also done by tweaking the prograde and radial components of the burn as needed. Below we see my important tools of the trade for doing this:\n\nI use the Precise Node mod to allow fine tweaking of the burn. I also would get MASSIVELY frustrated without Precise Node\u0027s feature of being able to reopen collapsed maneuver nodes by pressing the \u0022o\u0022 key (since the damn things always collapse on me at the most inopportune times). I REALLY hope SQUAD makes this a standard keystroke in the game.\n\nI use Conics Mode 3 (which is happily the default nowadays) and focus on the target (using the Tab key repeatedly) to zoom in and see in detail what the trajectory is doing there. In the plot below you can see that I\u0027ve shifted the original trajectory (that orange line in the bottom-right corner...I think it\u0027s orange) over close to Duna. My other vital tool when I\u0027m targeting planets with atmospheres where I want to aerocapture is MechJeb\u0027s \u0022Show landing predictions\u0022 setting of its Landing Guidance feature (part of that dialog box is shown in the image below). In the bad old days I\u0027d have to use F5 and F9 and multiple tries to get a desired aerocapture -- this is SO much nicer.\n\n![nda6Tcx.jpg](http://i.imgur.com/nda6Tcx.jpg)\n\nBelow, the plane-shift and fine-targeting burn of the Duna Explorer.\n\nAdly: \u0022Kurt, how was the burn?\u0022\n\nKurt: \u0022A little bit off...but that\u0027s to be expected from this distance. A tiny bit of delta-V makes a big change at the target. I\u0027m fixing the trajectory with small bursts from the RCS thrusters now.\u0022\n\nAdly: \u0022We didn\u0027t have these fancy aerocapture computer predictions back when I last made an interplanetary voyage.\u0022\n\nKurt: \u0022You gotta move with the times, Adly. Argh...too high. Too low. At this distance, even the tiniest burts of RCS thrust cause too big of a change. Ah ha! A 547 kilometer apoapsis after aerocapture..that\u0027s close enough for now.\u0022\n\n![y1Gs3yc.jpg](http://i.imgur.com/y1Gs3yc.jpg)\n\nThree of the ships in the armada were targeted for capture into equatorial orbits at Duna, but two of the ships (the Fuel Fido/Fuel Station payload, and the Fido rovers/Small Science Landers payload) were targeted for capture into polar orbits. The maneuvers of the unkerballed ships of the armada would be handled by Kurt as well (since the final RCS tweaking is easier without lightspeed delays from the KSC).\n\n![sBvqNNe.jpg](http://i.imgur.com/sBvqNNe.jpg)\n\nAfter the plane-shift/targeting maneuvers, the plot below showed all five ships on target for Duna in a tight pattern. Nice shootin\u0027, Tex! (And we can see from the Kerbal Alarm Clock list that the next thing I had to take care of was Jeb\u0027s mission arriving at Eve...but I\u0027ve already posted that little adventure in the update to my Exiting Eve thread.)\n\n![jbjLET9.jpg](http://i.imgur.com/jbjLET9.jpg)\n\nOK! That gave us five ships on optimal trajectories for Duna. Now the crew had nothing to do but wait as they coasted through interplanetary space.\n\nNelemy: \u0022Bored now.\u0022\n\nAldner: \u0022Already? We\u0027ve only been out a couple weeks.\u0022\n\nNelemy: \u0022A couple BORING weeks, Dude. Hey, Hellou-Dude...did you bring along a book that I could read?\u0022\n\nHellou: \u0022I have lots of books on my Kindle.\u0022\n\nNelemy: \u0022Nah, Dude...I like to hold real books. And I\u0027m boycotting companies that give all their products names starting with \u0027K\u0027...I mean, enough of that already! I hate names starting with K.\u0022\n\nAldner: \u0022I\u0027ll let Kurt know that.\u0022\n\nNelemy: \u0022No, Dude... Anyway...did you bring a book, Hellou?\u0022\n\nHellou: \u0022As a matter of fact, I did. I have it here in my personal effects bag. Here you go: Herbert Kerman\u0027s *Duna*. A classic novel.\u0022\n\n![ySJPBa6.jpg](http://i.imgur.com/ySJPBa6.jpg)\n\nNelemy: \u0022Whoa, cool! Um...Is that thing on the cover what I think it is?\u0022\n\nHellou: \u0022Do you think it\u0027s a giant sandworm?\u0022\n\nNelemy: \u0022Um...no.\u0022\n\nHellou: \u0022Then, no. It\u0027s a great book. I think you\u0027ll like it.\u0022\n\nAldner: \u0022I brought along a book, too.\u0022\n\nNelemy: \u0022Dude! Really? Can I read it?\u0022\n\nAldner: \u0022Sure. Here it is: Erb Kerman\u0027s *Karter Kerman, Warlord of Duna*.\u0022\n\n![g2FHoIh.jpg](http://i.imgur.com/g2FHoIh.jpg)\n\nAldner: \u0022Just be careful with it...I don\u0027t want you to ruin its collectable value.\u0022\n\nHellou: \u0022Did you just bring it along so you could sell it later? That\u0027s against the rules, you know.\u0022\n\nAldner: \u0022Ah, but it\u0027s not against the rules to GIVE it away for...personal considerations.\u0022\n\nHellou: \u0022Is this your way around the rule about you not naming any landmarks on Duna after your female kerbal friends?\u0022\n\nNelemy: \u0022Dude...Why is this book printed on such crappy paper?\u0022\n\nHellou: \u0022Huh? Oh, WOW! You have one of the pulp first editions! Those are really rare! I figured you\u0027d buy one of the newer editions with the smutty cover art. But this copy is awesome!\u0022\n\nAldner: \u0022Don\u0027t drool on it, geek girl. I have big plans for that book.\u0022\n\n**Dropping in to Duna**\n\nFifty-two days later, the ships of the armada started dropping into the Duna system. I hadn\u0027t planned it deliberately, but the arrivals were all spaced out nicely a day or two apart, so there wouldn\u0027t be any hectic handling of multiple ships at once. Lucky!\n\nThe first of the ships to reach Duna was the ship carrying the Duna Base payload, targeted for an equatorial orbit. After sneaking it across the SOI at 1x, the targeting was still intact for an aerocapture that would leave the ship in an elliptical orbit with a 1000 km apoapsis.\n\n![36HlQwN.jpg](http://i.imgur.com/36HlQwN.jpg)\n\nBelow is a picture of the aerocapture pass. If you were expecting exciting flames, you\u0027ll be disappointed -- the thin atmosphere of Duna simply doesn\u0027t perform in a flaming way with the trajectories used in this mission.\n\n![ytUwE7h.jpg](http://i.imgur.com/ytUwE7h.jpg)\n\nOnce the ship left Duna\u0027s atmosphere after the aerocapture, MechJeb\u0027s aerobraking prediction showed that it would enter and land on the next pass. This was not desired, of course, so at apoapsis a small 1.34 m/s prograde burn was made to raise the periapsis a little so that the post-aerobraking orbit would have a 120 km altitude (see below).\n\nThe ships were initially captured into elliptical orbits with high apoapses in order that: 1) aerocapture heating would be minimized (good practice for KSP 1.0), and 2) if an orbital plane shift is needed, it\u0027s cheapest to do far from the planet. As it happened, this first ship was close enough to equatorial that a plane-shift burn wasn\u0027t needed.\n\n![RdjVKEI.jpg](http://i.imgur.com/RdjVKEI.jpg)\n\nAfter the second pass through Duna\u0027s atmosphere, the aerobraking prediction again showed a landing for the next orbit...but a 54 m/s burn at apoapsis put the ship safely into a nearly circular parking orbit. That\u0027s one ship done!\n\n![JrjGWsv.jpg](http://i.imgur.com/JrjGWsv.jpg)\n\nThe second ship into the Duna system happened to be the last ship sent out from Kerbin (the transfer trajectories varied in duration), the DunaDogs payload. It got the same treatment as the first ship.\n\n![et8x41Z.jpg](http://i.imgur.com/et8x41Z.jpg)\n\nThe DunaDog ship did require a plane-shift burn to bring it closer to equatorial. This was done at the node furthest from the planet (and required 12.6 m/s of delta-V).\n\n![YXyI7vf.jpg](http://i.imgur.com/YXyI7vf.jpg)\n\nThe third ship in to Duna was the BANT D6 with the Fido rovers and small Science landers. This ship came in over the north pole of Duna. The ship was placed into a polar orbit so that its payloads could potentially be dropped at any latitude on Duna.\n\nThe clouds of the Environmental and Visual Enhancement mod look a bit strange right over the pole.\n\n![09tVUer.jpg](http://i.imgur.com/09tVUer.jpg)\n\nThe next ship in, carrying the Fuel Fidos and Fuel Stations, was also captured into a polar orbit (since those fuel stores may need to be dropped anywhere on Duna in support of the surface exploration program). The second half of the image below shows the ship\u0027s orbit is still hyperbolic (before aerocapture).\n\n![4LJlAwS.jpg](http://i.imgur.com/4LJlAwS.jpg)\n\nThe final circularization burn of the Fuel ship was over one of Duna\u0027s polar caps:\n\n![jzU6o6m.jpg](http://i.imgur.com/jzU6o6m.jpg)\n\nThe last ship into Duna was the Duna Explorer carrying our heroic crew, seen with Duna and Ike in the background below. No, Ike is not that large compared to Duna...it just happens to be fairly close.\n\nSide Note: Maneuvering around into or out of the Duna system always carries with it the danger of unwanted encounters with Duna\u0027s moon Ike because Ike has such a large SOI relative to its distance from Duna. When plotting the ship trajectories into the Duna system, I avoided Ike encounters by adjusting the prograde and radial components of the targeting burn as needed to arrive at times when Ike was not in the way. Making small changes to those components simultaneously allows you adjust both the arrival time and the periapsis distance of your ship\u0027s trajectory.\n\n![7AMeRTR.jpg](http://i.imgur.com/7AMeRTR.jpg)\n\nHellou: \u0022Hey, everybody... We\u0027re going to get an eclipse of Kerbol by Ike if you want to watch.\u0022\n\nNelemy: \u0022Cool.\u0022\n\nKelby: \u0022You\u0027ll get to see plenty of eclipses from the surface of Duna -- Ike is pretty big as seen from the surface. I saw one when I landed on Duna long ago.\u0022\n\nNelemy: \u0022Umm...but aren\u0027t Ike and Duna tidally locked, Dude?\u0022\n\nKelby: \u0022Sure...So Ike will hang in the sky at about the same place all the time as seen from any particular point on Duna where it\u0027s visible...but our Base will be near the equator, so Kerbol will pass behind it every Duna-day.\u0022\n\nHellou: \u0022Don\u0027t rain on our parade...it\u0027s the first one for the rest of us.\u0022\n\n![NIxrBaJ.gif](http://i.imgur.com/NIxrBaJ.gif)\n\nThe aerocapture pass of the Duna Explorer was similarly lacking in exciting flames as the passes of the previous ships.\n\n![h98TK3C.jpg](http://i.imgur.com/h98TK3C.jpg)\n\nThe post-capture maneuvers for the Duna Explorer were different from the previous ships. First, as the ship was headed out to its 1500 km apoapsis, a tiny plane-shift burn was made to be sure its orbit was equatorial. Then, at apoapsis, a prograde burn of 9 m/s was made to raise the orbit\u0027s periapsis completely out of Duna\u0027s atmosphere.\n\n![FmrfBHm.jpg](http://i.imgur.com/FmrfBHm.jpg)\n\nKurt: \u0022Burn complete...the periapsis it out of the atmosphere. But stay strapped in everybody...there\u0027s more maneuvers to come immediately.\u0022\n\nNelemy: \u0022Dude, I thought we were going to aerobrake to a lower orbit.\u0022\n\nAldner: \u0022You need to read the mission plan more carefully, Little Buddy. OK, Kurt. The four comsats are decoupled. Shake \u0027em loose.\u0022\n\nKurt: \u0022Roger. A little pitch...a little roll...and away they go.\u0022\n\nAldner: \u0022Extending solar panels and antennas. OK...all four read green on all deployments.\u0022\n\nKurt: \u0022Roger. Pointing retrograde. Are any of those things back in the retro direction?\u0022\n\nAldner: \u0022Negative. You are free and clear to navigate, Mr. Kerman.\u0022\n\nKurt: \u0022Acceleration warning. Four second burn in one minute.\u0022\n\n![ds0yfac.jpg](http://i.imgur.com/ds0yfac.jpg)\n\n![6zN3BHb.jpg](http://i.imgur.com/6zN3BHb.jpg)\n\nSo, with the comsats dropped off into non-decaying orbits, the Duna Explorer made a 7.8 m/s burn to dip its periapsis back into Duna\u0027s atmosphere for another non-flamey aerobraking pass, leaving its apoapsis near 100 km. Then a 48.6 m/s prograde burn circularized the orbit...and all five ships (and four comsats) were safe a sound in Duna orbits.\n\n![SG3PaQQ.jpg](http://i.imgur.com/SG3PaQQ.jpg)\n\nWhen the first comsat came back around to its 1500 km apoapsis, a 172 m/s burn by its 48-7S engine circularized its orbit, and it took up station as Duna Comsat 1. The other three comsats were allowed to continue coursing along in their elliptical orbits until one of them reached apoapsis when Comsat 1 was about 120 degrees around the planet from there...and then that comsat circularized its orbit to take up station as Duna Comsat 2. Similarly, Duna Comsat 3 was placed in the same 1500 km circular orbit 120 degrees from the first two comsats. VoilÃƒÂ¡! A perfect three-point communication satellite arrangement. Well, it could be better if it was out at synchronous orbit distance, I suppose...but then I\u0027d feel like I owed royalties to Arthur C. Clarke.\n\n![22w5rPU.jpg](http://i.imgur.com/22w5rPU.jpg)\n\nThe fourth comsat did a different maneuver: At apoapsis it both circularized and did a 90-degree plane shift maneuver (simultaneously to conserve fuel), and was placed into a polar orbit so that there would be better comsat coverage (at least occasionally) at the poles of Duna. This big maneuver nearly depleted the propellants from the comsat\u0027s four Oscar B tanks.\n\n![uRFoaR4.jpg](http://i.imgur.com/uRFoaR4.jpg)\n\nBelow is the completed Duna comsat constellation. There are several other orbits there that you might be wondering about -- those are ships and transfer stages from various previous missions to the Duna system (including Kelby\u0027s old Duna lander, and Adly\u0027s ship around Ike from the Magic Boulder mission). Also note: I don\u0027t employ any communications mods because that\u0027s a level of detail I don\u0027t want to bother with...but I like to have a realistic set of communications satellites in place.\n\n![dhltBvL.jpg](http://i.imgur.com/dhltBvL.jpg)\n\n**Down to Duna!**\n\nDuna operations began with rearranging some of the components of the Duna Explorer ship into the basic structure of Duna Space Station. First, the RCS mini-Tug/docking port adapter (with a Senior port on one end and a Standard port on the other) was moved from the top of one of the Interplanetary Transfer Habitats and docked to one of the four Standard ports in the top tier of docking ports of the Station core (just to get it out of the way). Then the two Duna Landers separated with the other interplanetary Hab and docked it to the top of the other Hab. These Habs will eventually be used to return crew members to Kerbin...but for now they are part of the long axis of Duna Station.\n\n![UZiroS5.jpg](http://i.imgur.com/UZiroS5.jpg)\n\nNext, the two big Tugs were separated and docked butt-first to opposite Senior ports of the Station core\u0027s bottom tier of docking ports. When the Tugs eventually leave, their rear tanks will be left behind as part of Duna Station. This has the advantages of: 1) giving the Station lots of volume for storing propellant, and 2) providing Senior docking ports further out from the hub of the station to make docking easier (the tanks have docking ports at both ends). Also, these tanks have some Junior docking ports on their sides to accomodate craft with only Junior docking ports.\n\n![NpnoDJC.jpg](http://i.imgur.com/NpnoDJC.jpg)\n\nThere is the start of Duna Space Station. Other Tugs will drop off additional tanks and fuel before returning to Kerbin for re-use. One of the Tugs still has the Double-Tug-Adapter (currently empty) hanging off of it in an ugly way...but that adapter could be useful in tying Tugs together in the future. Also, there is still a Surface Fuel Station docked to the bottom of the Space Station that will be dropped to some handy location on Duna when needed in the future.\n\n![vyBWfnG.jpg](http://i.imgur.com/vyBWfnG.jpg)\n\nBut let\u0027s start the actual landings! First down will be the Duna Base. But before that, there is a rack of Small Science Landers on top of it that needs to be moved. These COULD be simply left floating free in equatorial orbit, but keeping them with the Tug would keep more options open. The rack of Science Landers was separated, and then the Tug flipped around and docked them to the rear end. All this freed up the Duna Base to separate and move away (well...the TUG moved away...the Base doesn\u0027t have RCS).\n\n![wyIXdV4.jpg](http://i.imgur.com/wyIXdV4.jpg)\n\nTwo 48-7S engines on the underside of the Base drew fuel from two FL-T100 tanks on the top to perform the retro burn, and the Base headed down. In the past I have included little heat shields to protect rover wheels on ships...but I decided to take the amazing temperature resistance numbers listed by SQUAD as given (and I expected entries at Duna to be mild anyway), so no heat shields were included.\n\nFor you fans of flaming entries, I\u0027m sorry to have to disappoint you again...but there were no entry flames visible during any of the Duna landings.\n\n![gmkGwCr.jpg](http://i.imgur.com/gmkGwCr.jpg)\n\nBelow, the eight parachutes deployed in the reefed state and the landing legs deployed after I figured any serious heating would be over. Then the chutes opened fully, and the Base descended gently with a little rocket engine braking before touchdown, depleting most of the remaining fuel. The landing legs are there to protect the wheels.\n\nI\u0027m not used to landing on Duna, and I was kind of surprised how easy it was to land things because the atmosphere and parachutes do a lot of the work for you. Surprised, because I was thinking in terms of Mars, with its much thinner atmosphere. (I saw a video where a Mars entry and landing engineer was saying that Mars\u0027 atmosphere is the worst of both worlds: Too thick to ignore when dropping in at interplanetary speeds, but too thin to be useful in landing. NASA would LOVE to have Duna\u0027s atmosphere to work with.)\n\n![ecfIbWb.jpg](http://i.imgur.com/ecfIbWb.jpg)\n\nBelow: Duna Base, which can easily accomodate the whole expedition crew in its four slightly-overlapping Hitchhiker modules, safely down on Duna. The base has docking ports on the sides to allow for future expansion. The elevation of the Base landing site is 640 meters. I was aiming for 42° East longitude, just south of the equator...so not bad. Besides...it can be moved around, if desired.\n\n![LcAoEHC.jpg](http://i.imgur.com/LcAoEHC.jpg)\n\nNext, the Fuel Fido 1 surface refueling rover was separated from the Tug and sent down to the Base site. It has two 24-7S engines on its bottom for the retro burn (those four other things tucked onto the underside are Xenon tanks, in case you didn\u0027t recognize them).\n\n![gPWblCe.jpg](http://i.imgur.com/gPWblCe.jpg)\n\nAgain, no flames as the Fuel Fido descended into the nice, \u0027thick\u0027 air of the lowlands. The Fuel Fido has six chutes to assist in landing.\n\n![lq4IwyH.jpg](http://i.imgur.com/lq4IwyH.jpg)\n\nThe Fuel Fido\u0027s tanks are fully loaded with propellants (or were when it separated from the Tug), so the two 48-7S engines had to do more work in slowing this payload down for a soft landing...but when you have the parachutes to get you heading down vertically, landing is a piece of cake. Mmmmm...cake. With ice cream. Mmmm. The rover landed 280 meters from the Base...but that credit goes to MechJeb\u0027s targeting during retro burn (MJ isn\u0027t used for the actual landing).\n\n![xggdyZg.jpg](http://i.imgur.com/xggdyZg.jpg)\n\nThe third item off the stack was the Surface Fuel Station, equipped with four 24-77 engines, eight parachutes, and a whole mess o\u0027 propellants.\n\n![FxnVpqd.jpg](http://i.imgur.com/FxnVpqd.jpg)\n\nAgain, this payload is pretty heavy, so the engines do important work in soft-landing it. The Fuel Stations will provide propellants for the Landers, hopper rovers, and DunaDogs. It is used in conjunction with the Fuel Fido rover that actually moves the propellant to the thirsty vehicles.\n\n![KDpJmoa.jpg](http://i.imgur.com/KDpJmoa.jpg)\n\nAnd now for the kerbals! They would be my first kerbals to land on the sorely-ignored Duna in 25 game years (those are Earth years, since that\u0027s what we were using way back in the days of KSP 0.18 when I started this savegame). The expedition has two redundant teams...just in case...and each team would land in a separate lander. Gold Team in Duna Lander 1 consisted of Thompbles (commander), Aldner (piloting), Kurt (engineer/pilot), and Kelby (scientist/pilot). Duna Lander 1 separated from Duna Space Station and used its two Rockomax Mark 55 Radial Mount Liquid Engines to perform the retro burn. I used the long-ignored Mk 55 engines because they have recently gotten a buff...and I\u0027m hoping they won\u0027t be hit as hard by the Nerf Hammer when KSP 1.0 rolls out.\n\n![zTI42Yp.jpg](http://i.imgur.com/zTI42Yp.jpg)\n\nAldner: \u0022Oooo, the view out the window is fun...zipping along so fast and low. I like it.\u0022\n\nThompbles: \u0022Keep your mind on the job. Sight-see later.\u0022\n\nAldner: \u0022No problem, Fearless Leader. We are...Ooo! Is that a squirrel?\u0022\n\nThompbles: \u0022Stay on task.\u0022\n\nAldner: \u0022Nope...just a rock that looked like a squirrel. 4000 meters...deploying the chutes.\u0022\n\nKurt: \u0022Three thousand meters. Twenty-five hundred. Fifteen hundred...\u0022\n\nAldner: \u0022Brace for the Big Yank, boys...\u0022\n\nKurt: \u0022Unh. Six good chutes, fully open.\u0022\n\nAldner: \u0022Braking...hardly any throttle needed at all...annnd...touchdown. Engines safed. You may now move around the cabin, but remember that luggage in overhead bins may have shifted position during flight. We hope you choose to fly with Duna Air for all your future travel needs.\u0022\n\n![Y1fwN8m.jpg](http://i.imgur.com/Y1fwN8m.jpg)\n\nThompbles: \u0022We\u0027re ready for the first EVA. Kelby...you\u0027ve had experience with this...perhaps you\u0027d like to show us how it\u0027s done.\u0022\n\nKelby: \u0022Thanks, Thompbles. Hatch open. I\u0027m extending the ladder. Climbing down. I\u0027ll step onto the surface now. That\u0027s one small step for a kerbal...One heck of a 25-year-wait to return for me!\u0022\n\nThompbles: \u0022Here...have a flag. I know they hadn\u0027t developed space-rated flag technology the last time you were here.\u0022\n\nAldner: \u0022Hey, wait for me before you plant it. I\u0027m repacking the lander\u0027s parachutes.\u0022\n\nKurt: \u0022Wait for me, too...I\u0027ve got the camera. Wow, it sure is red out here. Such magnificent...crimson..lation..ness.\u0022\n\nKelby: \u0022Yep. But this site is certainly not as flat as my first landing site...which isn\u0027t too far East of here.\u0022\n\n![qeBnunf.jpg](http://i.imgur.com/qeBnunf.jpg)\n\nBelow is a overview showing Duna Lander 1\u0027s landing spot relative to the three previous landers. Not bad, but I was trying to get it into the triangle formed by the other three ships.\n\n![zxbyopV.jpg](http://i.imgur.com/zxbyopV.jpg)\n\nKurt hoofed it the 290 meters over to the Fuel Fido to check out the rover. He deployed the ladders and activated the Claws. He repacked its chutes for the sake of neatness...not that they expected to ever hop this rover...but it could happen. The Fuel Fido has two oppositely-facing seats on top.\n\n![F5ASUZM.jpg](http://i.imgur.com/F5ASUZM.jpg)\n\nKurt: \u0022Hey, Thompbles...Would you like a ride over to the Base?\u0022\n\nThompbles: \u0022That would be great. Thanks.\u0022\n\nAldner: \u0022Wow...Taxi service already on Duna. All the modern conveniences.\u0022\n\nKelby: \u0022The neighborhood sure has improved in 25 years.\u0022\n\n![rgmJO12.jpg](http://i.imgur.com/rgmJO12.jpg)\n\nThompbles got on board the Base, went to the central shaft to take the ladder up to the command cabin on top, then retracted the landing legs. The Base settled onto its wheels with no problem. He then drove it slowly over near Lander 1. The Base isn\u0027t meant to be a long-distance exploration rover, but it seems to trundle around just fine on the relatively flat terrain of the landing site.\n\n![6YHzpQF.jpg](http://i.imgur.com/6YHzpQF.jpg)\n\nBelow: The view out of Thompbles\u0027s window:\n\n![K0Z2G4e.jpg](http://i.imgur.com/K0Z2G4e.jpg)\n\nThompbles: \u0022Duna Base to Duna Station.\u0022\n\nEmilynn: \u0022Go ahead Duna Base.\u0022\n\nThompbles: \u0022The real estate looks good. Bring down Blue Team.\u0022\n\nEmilynn: \u0022Roger. We\u0027re on our way.\u0022\n\nBlue Team consisting of Adly (commander), Emilynn (piloting), Nelemy (pilot...who also took a few quickie engineering courses before launch), and Hellou (scientist) separated their Duna Lander 2 ship from the Station and followed the Gold Team down to the surface. The landing was without incident.\n\n![ibdjZdF.jpg](http://i.imgur.com/ibdjZdF.jpg)\n\nIt was getting later in the afternoon by the time Blue Team landed, setting down close to the Fuel Station. The picture below shows the view looking West with Lander 2 and Ike in the photo (Ike is fairly high overhead from this site). Emilynn deployed the high gain antenna after landing.\n\n![jSs057l.jpg](http://i.imgur.com/jSs057l.jpg)\n\nWith all eight of the crew safely down, there was still more hardware to deliver. Up in polar orbit, the remotely controlled BANT D6 separated its rack of four Small Science Landers and then flipped the around 180 degrees to redock those landers to the rear docking port. This freed up the stack of Fido rovers...the first of which separated in preparation for landing at the Duna Base site the next morning.\n\n![zGPLWEd.jpg](http://i.imgur.com/zGPLWEd.jpg)\n\n![8xsw2H1.jpg](http://i.imgur.com/8xsw2H1.jpg)\n\nA polar orbit gives you the ability to land anywhere on the planet...but it can involve waiting a while for the right time to deorbit. In the images below, you can see the orbital plane of the Fido rover (the smaller of the two polar orbits, being seen nearly edge on). The position of the Duna Base site is marked with an arrow on each image...and you can see that by the next orbit, the Base site will be under the Fido\u0027s orbital plane. Time to land!\n\n![gR7IaXF.jpg](http://i.imgur.com/gR7IaXF.jpg)\n\nThe Fido rover has a Junior docking port on top...and landing maneuvers are much easier if you choose to control from there. The retro burn took place over Duna\u0027s southern polar cap.\n\n![VyMWOi1.jpg](http://i.imgur.com/VyMWOi1.jpg)\n\nThe Map view below shows the Fido\u0027s incoming trajectory, slightly leading the Base site markers to account for the extra rotation motion Duna will make during the descent of the Fido. How much lead is required? If MechJeb\u0027s Landing Guidance is turned on, it will display a red marker at the target point you specify, and a blue marker where the ship will land (the position of the blue marker ACCOUNTS for rotation of the planet). So you just need to line up those markers. The Fido is equipped with RCS, so that can be used for fine tweaking of the targeting after retro burn. If the target is NOT going to be right under the ship\u0027s orbital plane when the lander gets to that point, the ship would need to do some normal or antinormal burn in its orbit 90 degrees away from landing site to shift the trajectory plane as needed.\n\n![XdPfUvf.jpg](http://i.imgur.com/XdPfUvf.jpg)\n\nThe Fido exploration rovers have two 48-7S engines and four parachutes to assist in landing.\n\n![Zi332qe.jpg](http://i.imgur.com/Zi332qe.jpg)\n\nThe targeting wasn\u0027t as precise on this landing, and the Fido touched down about 400 meters from Duna Lander 1 and Duna Base (which were visible because they are on top of a low ridge...the other ships were beyond the ridge).\n\n![fwGOqxC.jpg](http://i.imgur.com/fwGOqxC.jpg)\n\nBut a little distance doesn\u0027t matter for the Fido because it\u0027s a ROVER...so the control point was switched from the top port to the cockpit, and rover was remotely controlled the drive it over to the Base.\n\nBecause of the lower traction available with the chosen wheels in Duna\u0027s low gravity, it\u0027s necessary to disable the SAS (if you drive with it normally on...which I do) to make tight turns. Holding down the \u0022f\u0022 key during turns works fine. Also...it takes a fair distance to come to a stop, so that must be kept in mind. I used the older wheels since they worked well for me back when I did the circumnavigation of Duna with an unmanned Fido (back when rovber wheels first came out in KSP 0.19)...but the grippier wheels (or a mix) might be better here.\n\n![TWRn17Q.jpg](http://i.imgur.com/TWRn17Q.jpg)\n\nDuna Fido 2 was similarly dropped into the Base area a Duna-day later in the morning. It would have been possible to land it half a day earlier when the Base site was passing under the other side of the orbit, but the lighting was a little better under the northward-moving side of the orbit.\n\n![IBd5nhe.jpg](http://i.imgur.com/IBd5nhe.jpg)\n\n![UM3lGw3.jpg](http://i.imgur.com/UM3lGw3.jpg)\n\n**Playing with Planes**\n\nTime to attempt flying a plane in Duna\u0027s atmosphere...Not a full fledged test, but just enough to get the DunaDog plane safely down to the Base area. With Aldner at the remote controls and Emilynn monitoring as backup, DunaDog 1 was separated from the SP Tug A in equatorial orbit.\n\nEmilynn: \u0022Separation looks good, Buzz. I\u0027m moving the Tug away.\u0022\n\nAldner: \u0022OK. Rocket engine 1 is activated. Ship is pointed retrograde. Give me a count to the retro fire point.\u0022\n\nEmilynn: \u0022One minute. Thirty seconds. Five...four...three...two...one...mark.\u0022\n\nAldner: \u0022Retro burn. Positive function. Attitude holding. Annnnd cut.\u0022\n\nEmilynn: \u0022You were a few tenths short on that burn.\u0022\n\nAldner: \u0022No matter...it\u0027s a plane...I have lots of leeway.\u0022\n\n*...Several minutes later...*\n\nAldner: \u0022Eight thousand meters. Starting to get some bite.\u0022\n\nEmilynn: \u0022Looks like it\u0027s going to overfly at about five klicks.\u0022\n\nAldner: \u0022OK. Pitching down more.\u0022\n\n![QfsoTvW.jpg](http://i.imgur.com/QfsoTvW.jpg)\n\nEmilynn: \u0022The plane is coming overhead at four point five klicks.\u0022\n\nAldner: \u0022OK. Banking it right. Hmmm. The response is sluggish...but getting at lot better as it drops. Twenty-eight hundred meters...I\u0027ve got it in a level turn now. Good bite.\u0022\n\nEmilynn: \u0022Speed is dropping. Two hundred. One seventy.\u0022\n\nAldner: \u0022Let\u0027s see how well these ion engines work. Rocket engine 1 is deactivated. Activating the ions.\u0022\n\nEmilynn: \u0022Four ions are hot, reading green.\u0022\n\n![pvRbgZ9.jpg](http://i.imgur.com/pvRbgZ9.jpg)\n\nEmilynn: \u0022Two of the ions are flickering.\u0022\n\nAldner: \u0022OK...reducing throttle. The plane is pointed at the Base. Heading three five five. I\u0027ll buzz the tower at two hundred meters. Her she comes. Speed one hundred.\u0022\n\nEmilynn: \u0022Looking hot, Buzz.\u0022\n\nAldner: \u0022As always. The plane\u0027s nice, too. OK...ions off. I\u0027ll plop her down north of Base.\u0022\n\n![llZiLdm.jpg](http://i.imgur.com/llZiLdm.jpg)\n\nEmilynn: \u0022DunaDog is clear of the base.\u0022\n\nAldner: \u0022Pulling up. Slowing down. Eighty. Seventy. Popping the chutes!\u0022\n\n![aOQqq9M.jpg](http://i.imgur.com/aOQqq9M.jpg)\n\nEmilynn: \u0022Big pitch up, there.\u0022\n\nAldner: \u0022Pitching down. I\u0027ve got her. Belly engine activated.\u0022\n\n![5ddTmVf.jpg](http://i.imgur.com/5ddTmVf.jpg)\n\nEmilynn: \u0022Descending at twelve. Four forward. Four forward.\u0022\n\nAldner: \u0022Belly engine on!\u0022\n\nEmilynn: \u0022Slowing. Eight down. Contact!\u0022\n\nAldner: \u0022OK. Engine stop.\u0022\n\nEmilynn: \u0022Fuel at 87 percent. Xenon over 97 percent. Good work, Buzz.\u0022\n\nAldner: \u0022Thanks, Hawk. All engine arm circuits are off. Let\u0027s drive on over and check her out.\u0022\n\n![p9OmhhO.jpg](http://i.imgur.com/p9OmhhO.jpg)\n\n![b7OJYoa.jpg](http://i.imgur.com/b7OJYoa.jpg)\n\nEmilynn gave Aldner a ride over to his DunaDog in the Fido. Aldner climbed into the cockpit...after repacking the chutes (you don\u0027t want to realize that you forgot to repack the chutes AFTER takeoff)... and after hauling the kerbal-sized bag of supplies out of the cockpit and over to the rover (never miss an opportunity to send down extra supplies in empty ships).\n\n![vpxDQ37.jpg](http://i.imgur.com/vpxDQ37.jpg)\n\nThe DunaDog, like its Laythe BirdDog inspiration, converts to surface-rover mode by raising the nose gear to drop the rover wheels to the surface.\n\n![xoY7Y0r.gif](http://i.imgur.com/xoY7Y0r.gif)\n\nAldner drove the DunaDog over to Lander 2 to visit the rest of Blue Team. (Ooops...I notice from the picture that I forgot to repack Lander 2\u0027s parachutes after landing -- that was a serious breech of protocol. Let me add that to my list of important things to do.)\n\n![NBQRrRc.jpg](http://i.imgur.com/NBQRrRc.jpg)\n\nJust as was done with DunaDog 1, DunaDog 2 was separated from the SP Tug A and brought down to Duna, this time with Emilynn in remote control of the plane. The image below shows the landing trajectory -- the targeting on this is less critical than for normal landers, since the plane can fly around to get to its designated landing spot once it hits thicker air.\n\n![x2LzIFm.jpg](http://i.imgur.com/x2LzIFm.jpg)\n\nEmilynn initially overflew the Base area at only 1500 meters. She was hoping to make a landing using less fuel than Aldner, but her DunaDog was getting too low and slow, so she needed to kick in the ions for the turn.\n\n![VTLNarA.jpg](http://i.imgur.com/VTLNarA.jpg)\n\nEmilynn brought the DunaDog 2 around for a second flyover heading north at only 150 meters.\n\n![a7zQ8M2.jpg](http://i.imgur.com/a7zQ8M2.jpg)\n\nEmilynn: \u0022Ions off. Belly engine activated. Pitching up.\u0022\n\nAldner: \u0022Speed seventy-five. Seventy-three. Seventy-t...\u0022\n\nEmilynn: \u0022Chutes out. Whoa, settle down, girl! \u0022\n\nAldner: \u0022Thirteen down...\u0022\n\nEmilynn: \u0022Throttling up!\u0022\n\nAldner: \u0022Twelve down. Eleven...contact.\u0022\n\nEmilynn: \u0022Hmm. That landing looked a bit hard. I was a might late with the belly thrust. I hope I didn\u0027t bend anything.\u0022\n\nAldner: \u0022We live and learn. A minimum of 200 meters may be best for popping the chutes. Telemetry reports all systems green. Want me to drive you over?\u0022\n\nEmilynn: \u0022Nah...I\u0027ll drive it over here remotely. Raising the front gear.\u0022\n\n![WO0TSPQ.jpg](http://i.imgur.com/WO0TSPQ.jpg)\n\nThe DunaDog 2 seemed no worse for the slightly hard landing. Emilynn brought it over near Lander 2, then went over and climbed on top of the plane to repack the parachutes.\n\n![wd2d7QC.jpg](http://i.imgur.com/wd2d7QC.jpg)\n\nThat\u0027s it for this episode. All the initial equipment is safely down at Duna Base. In fact, things are getting a bit laggy there -- it will be nice to get some of these vehicles sent out on testing and exploration missions...but that\u0027s for later.\n\n**Edited \u003Ctime datetime=\u00222016-02-20T19:15:52Z\u0022 title=\u002202/20/2016 07:15  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 20, 2016\u003C/time\u003E by Brotoro**"},{"CreatedByName":"Snarfster","CreatedById":80347,"CreatedDateTime":"2015-03-13T22:19:59Z","Content":"Great, as always!"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-03-13T22:25:52Z","Content":"Awesome chapter ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) So much work done, but you do have a very nice looking Duna Base now. But best of all was the book discussion ^^Yes, i did a double-take at the \u0022Duna\u0022 cover - what a mighty huge worm \\*cough\\* ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-03-14T04:36:13Z","Content":"Arrgh. I re-read these things and find typos.\n\nAll. The. Time.\n\nArrgh."},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-03-14T07:53:44Z","Content":"That\u0027s really nicely done! How come I never thought of the Duna/Dune similarity? We need sandworms on Duna!"},{"CreatedByName":"Redhaze","CreatedById":137633,"CreatedDateTime":"2015-03-14T17:41:41Z","Content":"Dang, brotoro, you\u0027re on a roll! New chapters released so fast, and with a lot of stuff happening in them as well! 0.0 Thanks for the rep, btw. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2015-03-14T22:18:57Z","Content":"Hum, shouldn\u0027t the Herbert Kerman book be called \u0022Mars\u0022? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nI have to salute your dedication to driving rovers in this save. I\u0027ve done my fair share of rovering and it is definitely the more grating experience you can have in KSP ( not that I have to tell you that after your Pol experience, right ? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif) ). Most players would have simply reverted everything to rocket/ion planes and gone out with it ..."}]}