{"TopicId":102529,"ForumId":51,"TopicTitle":"Project Vagabond (RSS/RO Unmanned Mars mission, Viking-a-like)","CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-03-23T14:29:42Z","PageNum":1,"Articles":[{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-03-23T14:29:42Z","Content":"Loads of mods, all the RSS/RO/RP-0 realism stuff,FAR/DRE/RT w delay. Inspired by the Viking program I launch an unmanned mission to Mars. The vehicles are not reproductions, just similar solutions using real hardware available to me at the appropriate point in a career game. This is launched after I achieved Lunar orbit but before any Lunar landings, so pretty early tech, though a few bits of hardware are available that i\u0027ve chased down and might not have been in service at the time (I have nice SRBs). My vehicles are quite a bit heavier than Viking, im still getting used to designing for interplanetary RSS, this thing turns out a little over-fueled.\n\nVagabond I\n\n1,800 tonnes!\n\n11,632 dV Atmos / 18,199 Vac\n\n99,000 Kredits, all lost.\n\n91 parts inc clamps and stagerecovery chutes (which are insufficient anyway)\n\nAll seemed set for [Project Prometheus](https://forum.kerbalspaceprogram.com/threads/112862-Project-Prometheus-RSS-RO-Lunar-Direct-Ascent), as the Kerbals had dubbed their nascent Lunar program.\n\nThe engineers began to design a small scientific probe lander that could make the first touchdown off Earth in preparation for a manned follow-up.\n\nIt would carry a shortranged aerial for communications with the Lunar ring alongside a series of experiments; the ubiquitous thermometer, a magnetometer and a new device developed especially for the mission, a Dynamic Albedo of Neutrons designed to detect traces of Hydrogen on the surface.\n\nA small backup battery provides power through the Lunar night and a cluster of flat surface panels allow for recharging.\n\nThe lander was fueled with Aerozine50/NTO running through three 1kN orbital thrusters. The new throttling descent engine was not utilised as the engineers found it bulky and difficult to design around. Descent-plan therefore would be a series of arrested falls.\n\nA canister of MMH/NTO was included as an RCS system with significant performance gains over the older HTP systems.\n\nFinally a quartet of landing legs allow touchdown without risking the delicate engines.\n\nThe lander comes out within the range of acceptable payloads for a Maul launcher, calculations indicate that a 2.5 ton transfer stage is needed to get the payload in low lunar orbit without touching its fuel and the vehicle is modified slightly to account for this.\n\nHowever, as the Kerbals set about constructing the Lunar Lander they notice that Mars is coming into alignment...\n\nThe mission is hastily redesignated to Vagabond I. New profile, unmanned Martian landing, this is deemed far more scientifically interesting as Mars is a much better candidate for the DAN.\n\nThe Lunar lander is repurposed, very few changes are made beyond the addition of an array of parachutes, both drogue and main. The engines dont make TWR 1.0 on Mars, not until nearly empty, but should be able to cushion what the chutes dont deal with. Or thats the idea.\n\nThe Lander module is now also accompanied by an Orbiter.\n\nThis carries a fixed high-gain dish and an omni-directional antenna for its role as relay, in addition to a RADAR altimeter to map the Martian surface in preperation for landing. It also features independant RCS, battery and solar power in order to be sustainable after Lander seperation.\n\nThe Orbiter section, like the Lander, uses Aerozine50/NTO as fuel, burned in a AJ10-118K service module engine.\n\nMission profile calls for the two craft to arrive at the red planet together, where the Orbiter establishes a stable highly-inclined orbit.\n\nWhile both craft run science experiments from this situation the RADAR maps and landing sites are selected.\n\nThe craft separate and the Landing module de-orbits, parachutes and soft lands. Surface Science.\n\nIt is hoped that the Orbiter will have enough fuel at this point to perform a flyby of one of the Martian moons before returning to its relay position. (ed: while the craft is all mine, built with what I have available, this is basically a copy/paste of NASA\u0027s Viking mission profile. The DAN experiment also went to Mars in reality, though not until Curiosity.)\n\nCombined weight of the Orbiter/Lander is a staggering 21 tonnes, the pad-weight of the old Javelin 4\u0027s. Maul has a fit even at the idea of launching Vagabond I, a new launch vehicle is needed.\n\nRather than factor in a dedicated transfer stage for Martian Injection it is decided to use a combination of the launch vehicle topstage and the Orbiter dV to accomplish this burn. The Orbiter has been designed with 4k dV but probably only needs 1250 or so to capture around Mars.\n\nThe old RL10 topstage of previous vehicles is discarded as underpowered, the new J2 engine, which performs in the same role is selected in its place, still burning cryogenic Hydrolox.\n\nThis is stretched until it covers both final circularisation at Earth and 75% of the Martian Injection (Geosynch give-or-take) at which point the Orbiter itself will take over.\n\nLifting the J2 is the tried and tested LR-87-7 burning hypergolics assisted by two of the largest SRBs ever concieved, ATK L.S.G 5-segment LRSRMs. (ed: lengthened Shuttle SRB, as used in the SLS).\n\nThe SRBs are somewhat overpowered, even with this load to push and the LR-87-7 is lit on the pad, shut down around 20km and then not relit until SRB burnout (shortly after reaching vacuum). This manages SRB burnout Gs and stretches the delta-V overall.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/YNwYp)\n\n![FC3WfFc.jpg](http://i.imgur.com/FC3WfFc.jpg)\n\nVagabond I lifts off from Canaveral into a 5.2 degree incline to match the calculated Martian window. \n\nLaunch is incident free, the SRB stage is ridiculously overpowered, the LR-87-7 is shutdown early at 12km to avoid excessive heating on ascent.\n\nAs the craft pops free of the atmosphere the solids drop and the core stage relights. (The SRBs survive re-entry but hit at 45ms and are lost, chutes too small) Having been idle for most of the ascent its a little underpowered (over-fueled) but the Kerbals compensate by lofting the payload a little higher to buy time.\n\nThe 87-7 finally exhausts its hypergolics and falls away to burn up, the J2 ignites to finish the orbit at 350x350.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/1G3Fb)\n\nWith the craft now in stable orbit the planners begin crunching trajectories, trying to get an intercept. They are not able to plot the theoretical window the craft has launched for, but manage to find a viable alternate departing in 4 days.\n\nSomewhat concerned about Hydrolox boiloff they stare at their screens as time ticks by and the planets lumber into position. Finally it is time! \n\nThe J2 upperstage fires up its ullage motors, it takes several minutes and a quarter of the propellant to stablise the fuelflow to the massive engine, but at last it lights.\n\nThe transfer stage has lost some 450 dV to boil-off during the wait for alignment in orbit, hasty recalculations show the plan should still be viable.\n\nThe J2 exhausts its supply somewhat short of Lunar orbit (the Kerbals are a little surprised it made it that far, but are not great at estimating fuel-loads), it drops and the Orbiter lights to make the final kick for Mars.\n\nAfter a further 8 minutes the Orbiter reports intercept trajectory. Its burned a bit more fuel than anticipated, but reserves look good. Numbers still appear solid for successful primary mission resolution.\n\n\u002B6d18h Vagabond I leaves Earth Space\n\n\u002B54d20h The Orbiter engine makes a slight plane change to fix arrival trajectory. 52 second signal-delay necessitates having the computer perform the burn.\n\n\u002B241d06h Vagabond I becomes the highest artificial object over the sun as Pathfinder I passes it on its way to periapsis.\n\n\u002B325d12h Final course adjustment for very gentle aerobrake. Signal delay 710 seconds.\n\n\u002B326d03h Mars encounter.\n\n\u002B327d18h First loss of signal due to Mars occlusion.\n\n\u002B327d19h Signal Reacquired. 95x200,680km orbit with an orbital period of over 2 weeks. Probe flight computer has shut its fragile components for a high atmosphere pass, then redeployed and lit its vacuum engine as it re-emerged into space to get itself stable.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/gvlZg)\n\n\u002B1y98d Orbiter/lander pair brakes until the orbit crosses Phobos. Lander detaches, opens link through the Orbiter and burns 540 of its 2,100ms dV for Phobos flyby. Orbiter continues to aerobrake. Lowering from initial capture has taken only a small amount of RCS propellant to maintain aerobrake altitude, but has taken a long time. A range of southern hemisphere upper atmospheric and low space readings are taken during successive 6 minute passes at 85km above the midlands, major craters, lowlands and olympus mons. A band of the southern hemisphere is RADAR mapped. \n\n\u002B1y120d Lander flyby of Phobos. The Lander module performs a very high-speed flyby of the innermost satellite, the two passing each other in opposite directions. The magnetometer proves the the small moon is not in fact a hollow iron sphere launched by Martians. (ed: a serious theory once, discredited by the time of Viking which finally laid it to rest. Phobos is a clump of rubble. I only got one magnetometer reading from high over Phobos, everything else missed its tiny SoI since I was timing them to account for the delay and encounter lasted about 2 seconds)\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/JpY7m)\n\n\u002B1y206d Lander arrives in stable low orbit with 170 degree inclination. Orbiter still braking at 140 degrees with apoapsis of 4,000 km.\n\n\u002B1y304d Despite incomplete mapping (Orbiter still too high to see Northern hemisphere) a landing site is selected. 41 deg 19 min S, 61 deg E. This area comprises a cluster of fairly major impact craters, it is hoped that the lower ground altitude in the crater bottoms will assist the parachutes.\n\n\u002B2y1d Orbiter finally stabilises at correct mapping height. Deorbit burn sent to Vagabond Lander. Techs examine the resulting trajectory and begin programming the descent sequence for transmission.\n\nDe-orbit \u002B12m First half of landing sequence received. Lander is still holding retro since burn. Parachutes are armed, legs extend.\n\nDe-orbit \u002B14m Second half of landing sequence received. A sequence of 4 timed full throttle burns designed to power-brake through the atmosphere and minimise heating as well as several more to cushion chute deployment are queued up.\n\nDe-orbit \u002B16m Additional landing sequence received. As an afterthought the Lander switches to its short-ranged omni-aerial and retracts the more fragile one for the atmospheric flight. Results in immediate link drop, Vagabond is on its own and has just touched the edge of the atmosphere.\n\nDe-orbit \u002B2h Orbiter lowers its periapsis over the southern hemisphere to account for the shorter aerial running on Lander. Link established. Lander is down and sending! It is far west of expected position.\n\n![MqC5xxZ.jpg](http://i.imgur.com/MqC5xxZ.jpg)\n\nThe project is a resounding success. Orbiter continues to map the Martian surface and provide a daily relay window for the little Lander module to squirt packets back to Earth. The orbiter retains 1,100 ms dV in the service module and a small amount of RCS (it can seperate its service module but doesnt have enough biprop to ointunue much further).\n\nOver the next few days a great deal is learned about our neighbour and its history, with DAN detecting traces of hydrogen in the surface layers.\n\nThe Landing craft is queried for its flight-log and the engineers pour over the data to see how their unattended landing script fared.\n\nAfterall, Lander is down, must have been coded correctly, right? (ed: landing as a \u0027spectator\u0027 thanks to 12m signal delay is an odd experience. While theres a valid link you can actually have MechJeb take over with real-time control, but wheres the fun in that?![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) I swear I aged a decade watching this unfold and I dropped the link intentionally so that I wouldnt be tempted by MJ)\n\nLog Excerpt:\n\n70km, The craft is holding retrograde fine, it starts to make short burn cycles with the trio of Orbital Thrusters, the landing program is looking good.\n\n45km, A bit fast perhaps, needs more aggressive burns in the early stages.\n\n35km, hot ship. Mistimed the burns somewhat, with no heatshield things get a bit warm.\n\n30km, finally, a burn cycle. TWR is still below 1, but it takes the edge off and nothing bursts into flames yet. Still looking good.\n\n29km, disaster. RCS depleted. With no attitude control the Lander flips 180 hard and begins to barrel-in prograde, spinning like a rifle bullet.\n\n25-20km, not helping things here... The last two braking burns fire prograde and try to turn Lander into Impactor. Thankfully the wussy atmosphere of Mars prevents them making things too much worse.\n\n18km, yeah, this wont go well. Lander begins to tumble end over end at about 1 rev per second. Landing program is finished for what its worth... Burns are badly-timed. Descent took longer than expected.\n\n12km Its a dead-stick, how in the world does this thing end up on its feet?\n\n6km Pre-armed chute semi-deployment by the 4 radials. Nose-chute has not been armed. Lander stops tumbling and stabilises prograde, speed isnt changing much.\n\n2.4km Radial chutes full-deploy, Lander flips 180 and holds retrograde. Craft starts to decelerate.\n\n0km Touchdown at 13.3ms, craft bounces a little and one leg is damaged but has been fortunate enough to come down on a pretty flat plain.\n\n(ed: lucky as anything, the fact that my burns ran anyway lightened the craft enough to get it down dead-stick with 4/5 chutes. Cant believe I forgot to arm the nosechute. RealChutes is awesome. Science gains from the entire mission amount to almost 3,000. By making so many atmospheric passes with the combined ship I was able to run full suites on the upper atmosphere of almost the entire southern tropical band. I got no atmospheric readings in flight during landing however as I forgot to program them into the descent routine, and would have missed anyway based on my timing. The landing itself yields around 600, Phobos flyby and various high/low Mars adds its chunk and I end up with a 55% RADAR map which yields a bit more. Busts open the mid-section of my tech-tree and gives me the docking ports I so longed for. My main regret is not taking screenshots of the landing chaos. Even though I wasnt flying and had plenty of time I just plain forgot, though it was also night. I have a persistant backup in orbit so might try and run it again at some point for extra pictures.)\n\n**Edited \u003Ctime datetime=\u00222015-03-23T14:34:28Z\u0022 title=\u002203/23/2015 02:34  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 23, 2015\u003C/time\u003E by celem**"},{"CreatedByName":"CitizenAerospace","CreatedById":107486,"CreatedDateTime":"2015-04-26T10:56:55Z","Content":"Wow this is awesome ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-04-26T11:23:39Z","Content":"Very cool read and one of the more interestingly shaped craft I\u0027ve ever seen. And how did you manage boil off to make the Mars injection? Not sure if I read that right. Or did you only use the cryogenic stage for the ejection and aerobraked in?\n\n**Edited \u003Ctime datetime=\u00222015-04-26T11:29:22Z\u0022 title=\u002204/26/2015 11:29  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 26, 2015\u003C/time\u003E by Motokid600**"}]}