{"TopicId":105037,"ForumId":51,"TopicTitle":"Parzr Jool 5","CreatedByName":"parzr","CreatedById":115059,"CreatedDateTime":"2015-04-26T15:32:21Z","PageNum":1,"Articles":[{"CreatedByName":"parzr","CreatedById":115059,"CreatedDateTime":"2015-04-26T15:32:21Z","Content":"My latest attempt.\n\nSeeing the space station challenge I wanted to try a few things that had been on my mind.\n\nMy intent was to make my craft 1/3 the weight of my first super mission. Then we got .90 and Kerbals needed EXP and dedicated crew for each skill. We also got more Bioms.\n\n so I ended up at 1/2 the weight of my first mission to Jool but a stock Detachable rover and room for many science. [This being my second time through, regrettably once my rovers proof of concept was realized, I stopped collecting Science. But lets assume the Kerbals didn\u0027t find it boring and just forgot to take pictures.]\n\nThe other aim of this mission was to illustrate the need for the resources page and many screen shots. Hopefully future submissions to Jool5 (and other challenges) will have them more.\n\n--Launch while clean took 3 attempts to find the sweet spot for shutting down main engines for the LVNs.\n\n-- Tylo took 6 attempts total the first having to revert back to Laythe to better manage my separation and the rest a low altitude suicide burn with a steep learning curve.\n\n--Vall took around 10 attempts to land on a mountain with a low altitude suicide burn (good thing I learned on Tylo?)\n\n--at Pol I tired to get a gravity assist to leave but couldn\u0027t get Tylo on the correct side.\n\nId love any advice on reducing Delta V (without long gravity assists) if anyone wants to offer them.\n\n[http://imgur.com/a/Yyg2H#0](http://imgur.com/a/Yyg2H#0)\n\nVersion: .90\n\nMods: MechJeb and TAC Fuel\n\n10 Kerbals\n\n1 Launch\n\n0 Refueling\n\neveryone slept comfortably, even kept 2 seats empty for the Scientists in the lab.\n\nIf I where to redo this mission, I\u0027d Put Science equipment on my tanks that where left in orbit. regrettably this was not done.\n\n**Edited \u003Ctime datetime=\u00222015-04-26T15:53:36Z\u0022 title=\u002204/26/2015 03:53  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 26, 2015\u003C/time\u003E by parzr**"},{"CreatedByName":"HANNIBALLA","CreatedById":129997,"CreatedDateTime":"2015-04-28T21:32:06Z","Content":"The Dv and fuel all checks out. Loved your lander, and the rover on laythe was cool as hell. This one satisfies all the requirements for a sucsessful Jool 5 in my opinion."},{"CreatedByName":"parzr","CreatedById":115059,"CreatedDateTime":"2015-04-28T22:46:00Z","Content":"\u003E \n\u003E The Dv and fuel all checks out. Loved your lander, and the rover on laythe was cool as hell. This one satisfies all the requirements for a sucsessful Jool 5 in my opinion.\n\nThanks! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"}]}