{"TopicId":110290,"ForumId":51,"TopicTitle":"The Kerbollo Applications Program","CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-21T21:52:23Z","PageNum":1,"Articles":[{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-21T21:52:23Z","Content":"Here I shall be documenting the progress of Rhomphaia Heavy Industries\u0027 attempts to put Kerbals on the Mun and beyond For GregroxMun\u0027s [Apollo Aplications Program challenge](https://forum.kerbalspaceprogram.com/threads/121201-The-Apollo-Applications-Program-1-0-Edition)\n\n**Phase 1: Project Kerbollo**\n\nNow it is time to take longer strides... Time to commit ourselves to achieving the goal of landing a Kerbal on Mun and returning them safely to Kerbin.\n\n![jGuGXBh.png](http://i.imgur.com/jGuGXBh.png)\n*The Little Billy-Bobfred II, Ninurta IB and Ninurta V rockets used by the Kerbollo Program*\n\n[Kerbollo 4 \u002B 6](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=1962452\u0026viewfull=1#post1962452)\n\n[Kerbollo 7](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=1965566\u0026viewfull=1#post1965566)\n\n[Kerbollo 8](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=1969535\u0026viewfull=1#post1969535)\n\n[Kerbollo 9](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=1984836\u0026viewfull=1#post1984836)\n\n[Kerbollo 10](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=1993515\u0026viewfull=1#post1993515)\n\n[Kerbollo 11](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=1996747\u0026viewfull=1#post1996747)\n\n[Kerbollo 13](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=1999178\u0026viewfull=1#post1999178)\n\n[Kerbollo 15](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=2001957\u0026viewfull=1#post2001957)\n\n[Kerbollo 17](https://forum.kerbalspaceprogram.com/threads/122490-The-Kerbollo-Applications-Program?p=2026067\u0026viewfull=1#post2026067)\n\n**Edited \u003Ctime datetime=\u00222015-06-19T05:02:03Z\u0022 title=\u002206/19/2015 05:02  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 19, 2015\u003C/time\u003E by Rhomphaia**"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-05-22T11:54:02Z","Content":"That\u0027s some good Saturn-esque hardware. I see you clipped in some ore tanks for the stripes on the Ninurta IB?"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-22T12:12:53Z","Content":"**1.1 Unmanned testing**\n\nTo test and Kerbal rate all critical hardware.\n\n**Abort tests**: Testing of the Launch Escape System both on the launchpad and in flight\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/a35C4)\n\n**Kerbollo 4**:Full test of Ninurta V rocket including N-IVB re-ignition, test of Service Propulsion System, and test of Command Module re-entry under simulated Munar return conditions.\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/T4HzBwums2c?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/ltumZ)\n\n**Kerbollo 5**: Full test of Ninurta IB rocket, Test of Munar Escursion module descent and ascent engines including a \u0022Fire in the Hole\u0022 Abort test. Final orbit was set to deliberately re-enter the atmosphere ensuring destruction of all hardware.\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/VQvaqiOOcxE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nShortly after the Abort sequence test it was noted that the MEM was not responding correctly to heading inputs. Attempts to re-initialize the guidance computer resulted in severe rotation. The exact cause of the malfunction was undetermined, however it is believed likely that it was the result of a malfunction in the OKTO2 control unit installed for this mission only and therefor unlikely to impact future missions.\n\n**Edited \u003Ctime datetime=\u00222015-06-19T04:56:27Z\u0022 title=\u002206/19/2015 04:56  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 19, 2015\u003C/time\u003E by Rhomphaia**"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-23T17:37:58Z","Content":"**1.2 Kerballed Testing**\n\n**Kerbollo 7**\n\n![cSA9kh0.png](http://i.imgur.com/cSA9kh0.png)\n\nCommander: Bill Kerman\n\nCommand Module Pilot: Allison Kerman\n\nMunar Module Pilot/Ballast: Admund Kerman\n\nTest flight of the Kerbollo CSM in LKO launched with a Ninurta IB rocket.\n\nMission Highlights: \n\nOn attaining orbit it was noted that the LES had failed to jettison, as this would obstruct the docking port the mission was delayed to allow the spacecraft to orient retrograde before jettisoning the LES, it was hoped that this would ensure that it de-orbited.\n\nDuring docking practice it was noted that the Fairing between the CSM and (simulated LM) obstructed the view of the docking target. This would be redesigned for later missions.\n\nShortly after docking it was noted that all the fuel had leaked out of the Service Modules tanks. Ground crew muttered about how no-one read their engineers reports and something about docking ports used as decouplers. They then suggested that the missing fuel would likely be found in the N-IVB stage. It was and had to be siphoned out\n\nAt the end of the first day in Orbit, after separation from the N-IVB, the Service Propulsion System was ignited to boost the CSM into a higher orbit.\n\nAfter the Second day of systems tests, the crew prepared to practice Rendezvous using the N-IVB as a target.\n\nThe CSM was then docked to the N-IVB and the SPS was used to push it into a re-entry trajectory to simulate pushing the LM. After separation the CSM returned to stable orbit.\n\n3days 1hour 5minutes and 55seconds into the mission the SPS was fired one last time to de-orbit the CSM. 3 minutes 16 seconds later the Service Module was Jettisoned.\n\nThe command module safely splashed down at 0Ã‚Â°30\u002727\u0022W 94Ã‚Â°5\u002729\u0022W\n\nGallery\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/0FUvf)"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-05-24T12:11:09Z","Content":"That\u0027s definitely an interesting test flioght, I like the use of the historically-inaccurate-but-original probe."},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-25T06:49:05Z","Content":"**Kerbollo 8**\n\n![f3yB1v2.png](http://i.imgur.com/f3yB1v2.png)\n\nCommander: Ardolin Kerman\n\nCommand Module Pilot: Jebedaih Kerman\n\nMunar Module Pilot/Ballast: Samxie Kerman\n\nExcerpt from preflight mission transcript:\n\nJebediah: Stop the countdown, I think there\u0027s something wrong with the Munar Module!\n\nMission Control: There can\u0027t be anything wrong with the Munar Module. You are not carrying a Munar Module. \n\nJ:So how am I meant to land? Balancing the Service Module on its engine bell?\n\nMC: You are not supposed to land, this is an orbit only mission.\n\nJ: But...\n\nMC: Look we are running out of time. I will make you a deal, do this one right and I\u0027ll shuffle the roster around to get you on the earliest possible landing mission.\n\nMC: It won\u0027t be the first one, probably not the second either, but you will get to be Commander too.\n\nGallery:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/vT7AK)"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-31T01:13:01Z","Content":"![57i5AiA.png](http://i.imgur.com/57i5AiA.png)\n**Kerbollo 9**\n\nCommander: Geofdin Kerman\n\nCommand Module Pilot: Ronmore Kerman\n\nMunar Module Pilot: Haimie Kerman\n\nFirst flight of the complete Kerbollo spacecraft and first manned flight of the Munar Module. First EVA in the Kerbollo program\n\nCommand module splashed down 0Ã‚Â°3\u002745\u0022N 68Ã‚Â°1\u00273\u0022W at T\u002B1h28m. All other hardware deliberately burned up on re-entry.\n\nMission Gallery:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/PRdcz)"},{"CreatedByName":"CaptainApollo","CreatedById":145000,"CreatedDateTime":"2015-05-31T03:20:50Z","Content":"Wow, Rhomphaia! This is amazing! I was always very interested in the old space programs, and my favourite was Apollo! This is so exact, it is great! I want to try something like this once I am less of a newbie! Is it all stock, or do you use mods?"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-01T02:34:53Z","Content":"\u003E \n\u003E Wow, Rhomphaia! This is amazing! I was always very interested in the old space programs, and my favourite was Apollo! This is so exact, it is great! I want to try something like this once I am less of a newbie! Is it all stock, or do you use mods?\n\nIt\u0027s stock. Have Hyperedit installed but not using it for this, also Kerbal Konstucts so I can launch Soyuz from KSC2 when I eventually get to ASTP.\n\nWould have considered using mods for 5m tanks to make a more realistic Saturn replica, but it is not really neccesary."},{"CreatedByName":"CaptainApollo","CreatedById":145000,"CreatedDateTime":"2015-06-01T16:16:31Z","Content":"Wow, good job! Career mode or Sandbox?"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-03T18:46:42Z","Content":"![b9E9OSt.png](http://i.imgur.com/b9E9OSt.png)\n**Kerbollo 10**\n\nCommander:Lery Kerman\n\nCM pilot: Freddin Kerman\n\nMM pilot: Neie Kerman\n\nThe \u0022dress rehearsal\u0022 for the Munar landings, the mission contains all elements of the later missions except for the landing itself.\n\nMission succesfully splashed down 0Ã‚Â°44\u002727\u0022N 72Ã‚Â°39\u002749\u0022W \n\nMission duration: T\u002B2d1h50m\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/yKBpW)"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-04T23:49:15Z","Content":"![3Oys5Jd.png](http://i.imgur.com/3Oys5Jd.png)\n**Kerbollo 11**\n\nCommander:Hilanda Kerman\n\nCM pilot Wilyin Kerman\n\nMM pilot: Munbles Kerman\n\nThe Crew omitted their names from the patch intending it to commemorate all those who had played a part in getting them to Mun\n\nMunar landing occurred at approximately T\u002B1d1h30m Landing site 0Ã‚Â°32\u002755\u0022N 22Ã‚Â°44\u002750\u0022E\n\nAfter 42 minutes on the surface the MM ascent stage headed back to the CSM, once the crew transfered across, the MM was jettisoned and lated impacted the Munar surface.\n\nA delay in separation of the Service Module led to some worrying moments during re-entry, but the command module safely splashed down 2d5h7m into the mission at 0Ã‚Â°5\u002724\u0022N 12Ã‚Â°58\u002759\u0022E\n\nMission Gallery:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/tIp3w)"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-06T00:13:44Z","Content":"![3SUNBwj.png](http://i.imgur.com/3SUNBwj.png)\n**Kerbollo 13**\n\nCommander:Jebediah Kerman\n\nCM Pilot: Agavy Kerman\n\nMM Pilot: Orrey Kerman\n\nTranscript of pre-launch CM recording:\n\nJebediah: Finally, we\u0027re going to Mun, not just orbiting, this time we will land. Everybody ready?\n\nAgavy: Commander, I have a couple of questions.\n\nJ: Fire away.\n\nA: First, why is there a crate of sepratrons in the service bay?\n\nJ: Well, the MMUs they gave us are useful and all, but they don\u0027t pack much of a kick. I\u0027m going to upgrade mine and really show the folks at home a giant leap.\n\nA: I thought it might be something like that. Second question, why are they wired up to the staging sequence?\n\nJ: Well, you might not know this but if you try to take anything that could possibly be staged on a rocket, the construction team will wire it up, there is just no stopping them\n\nOrrey: Isn\u0027t that rather dangerous?\n\nJ: Don\u0027t worry, that\u0027s why I put them in the Service Bay rather than in the MM for the launch, the service bays are isolated from the staging sequence, as long is the doors are closed nothing can possibly go wrong.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/tfyAq)\n\n\u003E [http://i.imgur.com/Mv1T2zw.png](//imgur.com/a/%28)\n\u003E )\n\u003E \n\u003E Excerpt from Post-TMI burn Transmission\n\u003E \n\u003E CAPCOM: Trajectory looks good for the intended landing site. How are thing on your end?\n\u003E \n\u003E Agavy: Everything checks out fine. The CM is a bit low on snacks though, I could use some more when I am orbiting around on my own.\n\u003E \n\u003E C: There are more in the service bay, someone will have to EVA out to get them. AG1 to open the doors.\n\u003E \n\u003E A: Copy that, opening Service Bay doors.\n\u003E \n\u003E Jebediah:Wait! Action Group One? thats...\n\u003E \n\u003E ![v3SwShi.png](http://i.imgur.com/v3SwShi.png)\n\u003E \n\u003E Agavy: Ok Kerbin, I think...\n\u003E \n\u003E Orrey: WE\u0027RE ALL GOING TO DIE!\n\u003E \n\u003E CAPCOM: this is Kerbin say again please\n\u003E \n\u003E Jebediah: Kerbin, we\u0027ve had a problem. Hi gain antenna is off-line, SPS is gone and we are reading zip from the SM fuel cells.\n\u003E \n\u003E ![tGtLOfY.png](http://i.imgur.com/tGtLOfY.png)\n\u003E \n\u003E CAPCOM: We\u0027re thinking about the MM Lifeboat.\n\u003E \n\u003E Orrey: We\u0027re thinking about that too, but there isn\u0027t room for us all.\n\u003E \n\u003E Jebediah:You two go. If anyone is going down with this ship, it\u0027s me. Before you seal it up pass me all the MMU backpacks. I\u0027ll see If I can jury-rig something up.\n\u003E \n\u003E [imgur]qb9U6\u0022\u003EJavascript is disabled. View full album\n\nAgavy:Kerbin, We\u0027ve had another problem. An anomalous G-Force spike as we crossed the SOI boundary. The commander was thrown from the ladder. We are attempting to manually pilot a rescue. Track our trajectory and advise of any corrections we need once we have him back.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/qtNQR)"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-07T09:12:58Z","Content":"![rMQlhmP.png](http://i.imgur.com/rMQlhmP.png)\n**Kerbollo 15**\n\nCommander: Ronmore Kerman\n\nCM Pilot: Leah Kerman\n\nMM Pilot: Erigela Kerman\n\nFirst flight of the Extended Munar Module, first deployment of the Munar Rover and Munar Subsatellite\n\nMission highlights:\n\n1 day 1 hour 18 minutes after launch, the MM detaches from the Command module and begins its decent to the surface, touching down 11m20s later at 0Ã‚Â°37\u002757\u0022N 324Ã‚Â°32\u002718\u0022E.\n\nShortly after landing, the DPS was fired again to allow the MM to perform a \u0022pirouette\u0022 maneuver to allow for safe deployment of the Rover (9m50s on the video)\n\nAfter 2 and a half days on the Munar surface the Ascent stage separated and began its journey back to orbit (12m00s on video) after docking the crew transferred back to the CM and the MM was jettisoned to impact. (13m25s on video)\n\nShortly before leaving Munar orbit a Subsatellite was released into orbit (Ap 31230m Pe 28768m) (13m35s)\n\n4 days into the mission the SPS was fired one last time to send crew back to Kerbin, Splashdown occurred at 0Ã‚Â°3\u002722\u0022N 22Ã‚Â°57Ã‚Â°01\u0022W after a total MET of 5 says 3 hours and 55 minutes\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/PZsNGFyeXcU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n**Edited \u003Ctime datetime=\u00222015-06-07T09:20:04Z\u0022 title=\u002206/07/2015 09:20  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by Rhomphaia**"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-18T12:33:25Z","Content":"![XP241BM.png](http://i.imgur.com/XP241BM.png)\n**Kerbollo 17**\n\nCommander: Neie Kerman\n\nCM Pilot: Theoely Kerman\n\nLM Pilot: Bob Kerman\n\nMunar Landing: 8Ã‚Â°44\u002721\u0022N 251Ã‚Â°45\u002741\u0022W\n\nSplashdown: 4Ã‚Â°15\u002711\u0022S 71Ã‚Â°26\u002744\u0022W\n\nMission duration: 2d4h20m\n\nFirst Night launch of the Ninurta V. Also the first Kerbollo mission to have a professional scientist aboard. I decided to honor this by flying the Munar Module without SAS (even though scientists can use SAS in Sandbox)\n\nLaunch gallery\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/KGQOh)\n\nLanding went rather well.\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/VEMefmYEI7o?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nI ran a couple of test flights of the landing in another save. In both of those I got the lander down intact but not upright. Had that happened here I would have flown Kerbollo 18 as a rescue mission.\n\nJebediah would have commanded as the pilot with the most disaster experience, Munbles would have flown as MM pilot (Only BadS MM pilot to have made a landing, Ronmore is also BadS but never flew as MM pilot) \n\nJebediah would have flown one of the stranded crew back to the closest CSM on the prototype Lunar Landing Escape System, Munbles would have flown the other back in Kerbollo 18 ascent stage.\n\nLuckily that was not required here. and Kerbollo 17 was able to make its own ascent\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/nViz41OUFFQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nThis was not quite so textbook, a brief loss of control shortly after liftoff, and a bit of confusion over the nav-ball mode. But we got to a rendezvous in the end. \n\nCut from the video is around 5 minutes of playing with maneuver nodes to get there and 25 minutes of failed docking attempts. Eventually the CSM had to help out by pointing at the MM and moving slowly towards it, then all the MM had to do was hold the correct attitude.\n\nSo everyone got home OK\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/JBv11)"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-19T10:45:43Z","Content":"**Kerbollo 18**\n\nCommander: Jebediah Kerman\n\nCM Pilot: Munbles Kerman\n\nMM Pilot: Sanbeth Kerman\n\n![SnFGoO9.png](http://i.imgur.com/SnFGoO9.png)\n\nCapcom: Jebediah you and your crew can stand down now, since Kerbollo 17 made it home safely we no longer need a rescue mission.\n\nJebediah: Not a chance, if this is the last Ninurta V rocket, there is no way I\u0027m letting you dissasemble my only chance at a Mun landing just to make some Kerbin orbital space station.\n\nCapcom: The Kerbollo program is still going ahead, We\u0027ve ordered new, uprated Ninurtas, there will be other Mun landings\n\nJebediah: The trust is gone, Ever since you told me I would be in the first crew to go to Mun and I never even got to land.\n\nCapcom:OK, OK, Ive just got word from the mission director, the KORL is suffering some setbacks, He\u0027s decided to delay it until the new Ninurta V rockets enter production, and given you the green light for thiGAH...\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/EYjO7)\n\nCapcom: I don\u0027t know how you hot-wired the launch sequence, and I don\u0027t want to. Thats for the Investigation team to determine. Count yourself lucky I didn\u0027t hit the remote Abort. Anyway as I was about to say, since we know you will be doing most of the flying anyway and this is no longer a rescue mission, Sanbeth is being re-assigned as MM pilot. Munbles is almost as crazy as you and we want to split the two of you up. Your mission Parameters are now to land within 1km of a previous landing site and inspect that descent stage for any damage caused by debris kicked up by your landing, we have plotted a free return trajectory that should make any of the earlier landing sited a possibility.\n\nJebediah: And the LLES I designed?\n\nCapcom: If I tell you no, you\u0027ll probably end up crashing deliberately so you need it. So yes you can tesGAH...\n\n![y1NDlfc.png](http://i.imgur.com/y1NDlfc.png)\n\nCapcom:WHAT HAPPENED? YOU ARE BURNING TOO EARLY!\n\nJebediah: Relax, I\u0027ve got this. You owe me two landings, So I\u0027m taking them. Munbles, Upload the new Mission Insignia\n\n![Sm1ajXV.png](http://i.imgur.com/Sm1ajXV.png)\n\nThe Minmus landing was flown with both ascent and decent being performed by the Descent Propulsion System, after Re-docking the Service module effected a Hohmann transfer from Minus to Mun.\n\nFuel was transfered from the Ascent stage to the Descent stage to allow for Munar landing, within 1km of Kerbollo 15 landing site.\n\nOnce on the suface, the LLES was deployed. Not pictured is the explosion of the LLES landing legs due to a combination of part clipping and being deployed downhill.\n\nWhile Sanbeth conducted the inspection of Kerbollo 15, Jebediah inspected the LLES and determined that it would be usable, with the reaction wheels providing enough control to orient it for launch.\n\nUpon Rendezvous with the CSM, Jebediah and Sanbeth EVA\u0027d across. Not pictured - As jebediah left his seat he was flung away, and had to use his MMU to return to the CSM. The LLES was flung less violently, but had to perform some small manuevers to stabalize with the CSM, there were no issues when Sanbeth left her seat. the LLES was rated as needing some adjustments befor it could enter full service.\n\nGallery\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/QuwXE)\n\nMinmus landing: 1Ã‚Â°3\u002719\u0022S 10Ã‚Â°18\u00277\u0022W\n\nMun Landing: 0Ã‚Â°29\u002711\u0022N 324Ã‚Â°25\u00277\u0022E\n\nSplashdown: 0Ã‚Â°50\u002736N\u0022 163Ã‚Â°42\u002726\u0022E\n\nMission duration: 20d 2h"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-25T07:03:25Z","Content":"![yNhTu6N.png](http://i.imgur.com/yNhTu6N.png)\n**Kerbollo - Lukovitsa test project**\n\nLukovitsa\n\nCommander: Valentina Kerman\n\nFlight Engineer: Eriet Kerman\n\nKerbollo \n\nCommander: Lery Kerman\n\nCM Pilot: Mary Kerman\n\nDM Pilot: Tanpond Kerman\n\nIn the middle of a temporary shortage of launch vehicles, we have arranged a friendly game of tag with our competition.\n\n![YWtiz5T.png](http://i.imgur.com/YWtiz5T.png)\n\nThey will launch the Lukovitsa spacecraft from the Inland space center. We will launch a Kerbollo CSM from the Kerbal Space Center using a Ninurta IB rocket, rendezvouz with the Lukovitsa and dock using an adapter to ensure compatibility.\n\n![C3pwiWv.png](http://i.imgur.com/C3pwiWv.png)\n\n*2.5m Docking adapter*\n\n![GrZufiG.png](http://i.imgur.com/GrZufiG.png)\n\n*0.625m adapter*\n\n![i01c0Xa.png](http://i.imgur.com/i01c0Xa.png)\n\n*Universal Docking Adapter*\n\n![4FMJXXV.png](http://i.imgur.com/4FMJXXV.png)\n\n*Kerbollo CSM creates an artificial eclipse*\n\nFull Gallery\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/FoloB)\n\nLukovitsa landing: 18Ã‚Â°11\u002735\u0022N 227Ã‚Â°23\u002727\u0022E\n\nKerbollo splashdown: 0Ã‚Â°7\u002712\u0022N 139Ã‚Â°27\u00278\u0022E\n\n**Edited \u003Ctime datetime=\u00222015-06-25T07:17:04Z\u0022 title=\u002206/25/2015 07:17  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 25, 2015\u003C/time\u003E by Rhomphaia**"}]}