{"TopicId":110895,"ForumId":51,"TopicTitle":"Banzai! A Circumnavigation of Kerbin (Elcano Challenge)","CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T13:55:03Z","PageNum":1,"Articles":[{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T13:55:03Z","Content":"![tumblr_np8v4lAlPv1r0o48lo1_1280.png](https://41.media.tumblr.com/9be38d8a12a4b15a47589c3075fda964/tumblr_np8v4lAlPv1r0o48lo1_1280.png)\n\n(Made with the help of Kronal Vessel Viewer)\n\n(Note: I had previously started the Elcano Challenge with a different craft, which turned out to be wholly unsuited to the task, instead it is now continuing its journey as far as the South Pole, where it will set up base camp, hopefully the Banzai! will meet up with it and we can change crew and refuel there, to follow that mission, and get some background on this one [head over here](https://forum.kerbalspaceprogram.com/threads/123015-The-Polar-Mission-Setting-up-a-base-on-the-South-Pole?p=1970057#post1970057))\n\nSo the Polar Explorer has been pulled off it\u0027s mission, Val is not impressed, but more than anything she is jealous of Jeb getting go do the mission in something that actually *gets somewhere*. and annoyed she\u0027s going to be stuck at the South Pole doing menial work that any 2nd rate pilot could handle...\n\nBack at KSC:\n\nJeb and Bill are picking their team to take with them to circumnavigate Kerbin, they\u0027ve been told they must take two scientists to be dropped off at the South Pole base, and 2 Engineers to assist Bill in any work that needs doing to the Banzai! after looking into the achievements of their fellow Kerbinauts, they decide any old Kerbal will do and pick Tanuna, Olivia, Luden and Sigely.\n\nThe Banzai! itself is one of the stragest crafts Jeb has ever seen, he has his doubts, but when he\u0027s told it\u0027s the fastest ground vehicle ever developed all those doubts disappear.\n\n-------------\n\n\u003E \n\u003E I named the Banzai! as such for two reasons, one after the Japanese phrase meaning \u0022Ten Thousand Years\u0022, in part because it is an exclamation of good luck and fortune, and also because while I was making it I thought that was how long it was likely to take to complete this mission. The other reason is after the \u0022Banzai Charge\u0022 a technique used by Japanese soldiers where they would charge out in the face of innumerable odds, which I thought was fitting considering the task at hand.\n\u003E \n\u003E ![tumblr_noykan3c781r0o48lo3_1280.png](https://41.media.tumblr.com/939f0a997d08ddaa10b791bdcc7f85e1/tumblr_noykan3c781r0o48lo3_1280.png)\n\u003E \n\u003E ![tumblr_noykan3c781r0o48lo4_1280.png](https://41.media.tumblr.com/96a596e9423ac62321d7a65217b7e2f9/tumblr_noykan3c781r0o48lo4_1280.png)\n\u003E \n\u003E ![tumblr_noykan3c781r0o48lo5_1280.png](https://40.media.tumblr.com/7f250e2e2e3aa40f67c493243b33f98a/tumblr_noykan3c781r0o48lo5_1280.png)\n\u003E \n\u003E ![tumblr_noykan3c781r0o48lo2_1280.png](https://40.media.tumblr.com/b0929f0b549f9e21647e35abd550967d/tumblr_noykan3c781r0o48lo2_1280.png)\n\u003E \n\u003E It utilizes 3 jet engines, with one angles slightly downward to keep the nose out of the water and (I think) to help keep the wheels on the ground while accelerating. using two floaties with wheels on the underside spread wide out it manages to traverse ground and water pretty effectively, I have taken it up to 115m/s on ground (though it wound up driving along on just one set of wheels at almost 90 degrees to the ground, miraculously didn\u0027t crash but I haven\u0027t tried it again since) but it will cruise happily at 60-70m/s. It can also go at about 35-40m/s on water. the only mods it uses are KAS and KIS (theres a KIS storage in the cargo hold) and firespitter for FSFuelSwitch module (although as you can see there are some tanks i forgot to switch and so I am carrying 550 Oxidizer which I will have to drain)\n\u003E \n\u003E \n\nThe plan is to do a polar circumnavigation starting in the opposite direction to the Polar Explorer (so we\u0027re going North) \n\n-------------\n\n\u003E \n\u003E As it reaches midday, Jeb and Bill drive the Banzai! over to the Astronaut Complex to pick up Tanuna, Olivia, Luden and Sigely, in order to commence their journey, having been specifically told that they would never recieve clearance to plant a flag on the concrete outside the complex, and that there was already a perfectly good, bigger flag there anyway, Jeb naturally ignored this warning and planted one anyway:\n\u003E \n\u003E ![tumblr_noykvyLha91r0o48lo2_1280.png](https://41.media.tumblr.com/f7d6c2e44107280d4102363b655cdbaa/tumblr_noykvyLha91r0o48lo2_1280.png)\n\u003E \n\u003E ![tumblr_noykvyLha91r0o48lo1_1280.png](https://41.media.tumblr.com/3cee8b5197a0da524ce76128f4d34a40/tumblr_noykvyLha91r0o48lo1_1280.png)\n\u003E \n\u003E After the obligatory photo op. they board the vessle and set off\n\u003E \n\u003E ![tumblr_noykvyLha91r0o48lo3_r1_1280.png](https://40.media.tumblr.com/b274ce8abc9b5b9f23a9a48a6f1bd56f/tumblr_noykvyLha91r0o48lo3_r1_1280.png)\n\u003E \n\u003E ![tumblr_noykvyLha91r0o48lo4_r1_1280.png](https://41.media.tumblr.com/2b517530cd6bfa06cd694f2bb2e5f1d6/tumblr_noykvyLha91r0o48lo4_r1_1280.png)\n\u003E \n\u003E quickly they realize they have been heading straight for the mountains, and quickly plan an alternate route:\n\u003E \n\u003E ![tumblr_noykvyLha91r0o48lo5_r1_1280.png](https://40.media.tumblr.com/499e04a1f3be80a05d285b209491184f/tumblr_noykvyLha91r0o48lo5_r1_1280.png)\n\u003E \n\u003E as they start along their corrected course they come across a startling discovery, trees on Kerbin don\u0027t obey the laws of gravity! if only Kerbals had discovered this hundreds of years ago rocketry would have never even been *needed* all they would have had to do was develop a tree powered anti-gravity craft and all their problems would have been solved\n\u003E \n\u003E ![tumblr_noykvyLha91r0o48lo7_r1_1280.png](https://41.media.tumblr.com/ca06b3d304ea2cd62797646b3f84e592/tumblr_noykvyLha91r0o48lo7_r1_1280.png)\n\u003E \n\u003E The weirdness didn\u0027t end there for them though, while travelling through the highlands they came across a lone cactus standing in the middle of a barren patch of land\n\u003E \n\u003E ![tumblr_noykvyLha91r0o48lo6_r1_1280.png](https://41.media.tumblr.com/935acf5eb669bc4bb48b46d1573f4355/tumblr_noykvyLha91r0o48lo6_r1_1280.png)\n\u003E \n\u003E Luden and Olivia were overjoyed at the amount of scientific discoveries they had made within the first hour of their journey, what else could lie in wait for them?\n\u003E \n\u003E ![tumblr_noydv3keni1r0o48lo3_r1_1280.png](https://40.media.tumblr.com/1280b23684c4c16fd204da81eecc9f4f/tumblr_noydv3keni1r0o48lo3_r1_1280.png)\n\u003E \n\u003E This time Bill is the one to plant the flag, as they take a break under a tree and observe the map to see how far they have come\n\u003E \n\u003E ![tumblr_noydn2Wa3x1r0o48lo6_r1_1280.png](https://40.media.tumblr.com/3572e4fa50af15c6838b7d6e0e3801e3/tumblr_noydn2Wa3x1r0o48lo6_r1_1280.png)\n\u003E \n\u003E (the dotted line is their projected path, and pretty much the path they ended up taking)\n\u003E \n\u003E that\u0027s a long way for less than 2 hours driving! the sun is getting lower in the sky but they decide to head for the waters edge before night fall, where they will set up for the night, to continue across water a short distance in order to avoid the mountains, and also to properly test the amphibious properties of the craft.\n\u003E \n\u003E so after a short bit of extra driving our crew of intrepid Kerbinauts come across a small cove, with a nice pool and hills on all sides top protect it from the wind and decide it is a good place to set up a flag and set up camp for the night:\n\u003E \n\u003E ![tumblr_noydn2Wa3x1r0o48lo2_r1_1280.png](https://40.media.tumblr.com/b856615b8c1b9ead82aa67428038505c/tumblr_noydn2Wa3x1r0o48lo2_r1_1280.png)\n\u003E \n\u003E ![tumblr_noydn2Wa3x1r0o48lo4_r1_1280.png](https://40.media.tumblr.com/03fda2790b1c98abba898af660c809fa/tumblr_noydn2Wa3x1r0o48lo4_r1_1280.png)\n\u003E \n\u003E ![tumblr_noydn2Wa3x1r0o48lo5_r1_1280.png](https://40.media.tumblr.com/c645e89383a8416d91dbb449f34fd63d/tumblr_noydn2Wa3x1r0o48lo5_r1_1280.png)\n\u003E \n\u003E Hey Jeb the camera is this way!\n\u003E \n\u003E \n\nJeb and Bill ( and Tanuna, Olivia, Luden and Sigely) have made amazing progress on their first day of travelling, they will be recieving a midnight supply drop of a KIS container with some lights in it (i forgot to add any, and spares are always good too) and I will take along an empty oxidizer container to drop down for them to drain their unused and useless oxidizer, not quite a refueling, more an unfueling, in fact this craft is amazingly fuel efficient, over that whole first day they only used less than 275 units of fuel out of 4450 that they are carrying! I suspect I will be at least half way around Kerbin before I am in need of fuel, and even then I might not need it, the ideal would be to make it to the South Pole and refuel at the base I hope to have set up by then.\n\n-------------\n\n\u003E \n\u003E It\u0027s midnight at the KSC when Jebs mum barges into mission control shouting \u0022its a disaster! its critical! Jeb as forgotten is spare underwear!\u0022, mission controll erupts in a fluffy of activity, last time this happened during a long voyage one astronaut was nearly killed by the smell. a hasty operation was put together, and a new drone designed for the purpose.\n\u003E \n\u003E  Mission Control saw this as a perfect opportunity to send lights and a Scansat BTDT that they had neglected to add to the Banzai! initially, as well as drop off a container for unused oxidizer to be offloaded into to lighten the load.\n\u003E \n\u003E and so the Sparrowhawk was born:\n\u003E \n\u003E ![tumblr_noytu989zd1r0o48lo1_1280.png](https://40.media.tumblr.com/fd10cec1b0b7ebd3aaaeaf301c8c9bf8/tumblr_noytu989zd1r0o48lo1_1280.png)\n\u003E \n\u003E ![tumblr_noytu989zd1r0o48lo2_1280.png](https://36.media.tumblr.com/74713f7a02cdf0965674a010233196f8/tumblr_noytu989zd1r0o48lo2_1280.png)\n\u003E \n\u003E ![tumblr_noytu989zd1r0o48lo3_1280.png](https://40.media.tumblr.com/5c90e3d89184bb03ad12e42ec657a846/tumblr_noytu989zd1r0o48lo3_1280.png)\n\u003E \n\u003E ![tumblr_noytu989zd1r0o48lo4_1280.png](https://36.media.tumblr.com/2576a50642615e3b5b6870f99724d442/tumblr_noytu989zd1r0o48lo4_1280.png)\n\u003E \n\u003E Flying with its two pieces of precious cargo: a KIS container and an empty fuel tank, the Sparrowhawk unmanned drone makes its way to Juans Cove where the Banzai! has settled for the night, Mission Control radios them to explain the situation, and they begin to prepare themselves for the packages arrival\n\u003E \n\u003E ![tumblr_noytu989zd1r0o48lo5_1280.png](https://41.media.tumblr.com/713f336e4429b0140d9264802ce4a2d6/tumblr_noytu989zd1r0o48lo5_1280.png)\n\u003E \n\u003E ![tumblr_noytu989zd1r0o48lo9_1280.png](https://41.media.tumblr.com/1728583262407845eef617e280b0bb19/tumblr_noytu989zd1r0o48lo9_1280.png)\n\u003E \n\u003E the packages are dropped, unfortunately landing on top of the hill, some 1.6Km away from the Banzai! \n\u003E \n\u003E And so Jeb, now fully awake and thoroughly embarrassed after the radio message, in which his mother could be heard in the background saying \u0022he gets awfully grumpy without a change of underwear\u0022 and having endured every joke his crew could come up with, fires up the engines and turns the Banzai! around to go and collect the packages\n\u003E \n\u003E ![tumblr_noyu73eCPg1r0o48lo1_1280.png](https://40.media.tumblr.com/8e29c340269420c0de207988222a627a/tumblr_noyu73eCPg1r0o48lo1_1280.png)\n\u003E \n\u003E ![tumblr_noyu73eCPg1r0o48lo2_1280.png](https://41.media.tumblr.com/1d047b5628d08eb70ca2f302bcad3fa8/tumblr_noyu73eCPg1r0o48lo2_1280.png)\n\u003E \n\u003E as Bill opens the Container everything seems to be in order, until he realizes what is missing, they forgot to pack the underwear, a sense of dread fills his heart. *He* was the astronaut who nearly died, it was his first mission with Jeb, and it still gave him nightmares. but for now he put those thoughts aside and gets to attaching the new lights:\n\u003E \n\u003E ![tumblr_noyu73eCPg1r0o48lo3_1280.png](https://40.media.tumblr.com/a1448314c51424c14d6fc869217a90f3/tumblr_noyu73eCPg1r0o48lo3_1280.png)\n\u003E \n\u003E and then finally Jeb, in a fowl mood after the news, drives them over to the second package in order to siphon off the Oxidizer\n\u003E \n\u003E ![tumblr_noyu73eCPg1r0o48lo4_1280.png](https://40.media.tumblr.com/75d3b833f5c256f14272a0636cba0d41/tumblr_noyu73eCPg1r0o48lo4_1280.png)\n\u003E \n\u003E ![tumblr_noyu73eCPg1r0o48lo5_1280.png](https://41.media.tumblr.com/980823d12c21ad98626e894af296d0a7/tumblr_noyu73eCPg1r0o48lo5_1280.png)\n\u003E \n\u003E Once this is done, they return to Juans Cove to settle back down for the night, Bill reminds himself to find a way of swapping seats with one of the lucky people in the passenger cabin as Jebs mood, and smell, worsens.\n\u003E \n\u003E ![tumblr_noyu73eCPg1r0o48lo6_1280.png](https://41.media.tumblr.com/658892984f6d0b754623946f65257bbf/tumblr_noyu73eCPg1r0o48lo6_1280.png)\n\u003E \n\u003E \n\nNext they will face the ocean for the first time, here is a projected path that they will probably be taking over the next leg of the journey:\n\n![tumblr_noyuu19Tsq1r0o48lo1_1280.png](https://40.media.tumblr.com/ca0976d3bd7792b98fa8b25617c1628e/tumblr_noyuu19Tsq1r0o48lo1_1280.png)\n\n-------------\n\n\u003E \n\u003E As the crew wake up after their first night in the Banzai! they realize that today marks the first time they will have to cross water, knowing how treacherous and soupy the water on Kerbin is due to its high density this is met with trepidation from the crew. However during the night Mission Control radioed them again to inform them they were sending a little bit of extra help, the drone that had dropped off their supplies the night before had been retrofitted as a long range recon drone, and had been flown out to the projected landing site on the opposite shore during the night to serve as a guide.\n\u003E \n\u003E So after focusing their targeting systems on the Sparrowhawk MkIII the Banzai! enters the water for the first time, and Bill immediately notices it is sitting rather low in the water\n\u003E \n\u003E \n\u003E \n\u003E ![tumblr_nozzzdPqYm1r0o48lo2_1280.png](https://40.media.tumblr.com/ced8e31498c3b749811502449a9fd9a9/tumblr_nozzzdPqYm1r0o48lo2_1280.png)\n\u003E \n\u003E \n\u003E \n\u003E Thankfully this is overlooked as a minor issue, things never go as planned and it seems this is just one of those times, the ship still seems to move as fast as it did during testing, and so it\u0027s generally seen to be \u0022not a big deal\u0022\n\u003E \n\u003E until they start moving that is.\n\u003E \n\u003E once they get up to speed, they radio to Mission Control for permission to use the physical time warp, permission is granted and the world speeds up, and not more than a few seconds after that the Banzai! spins out of control!\n\u003E \n\u003E Luckily this time Tanuna has an idea of what has caused it, when she saw the Banzai! during testing she noted that it did not have the steerable wheels at the front of its pontoons, she assumed these must not have been set up correctly and were causing strange drag effects in the water, so she gets out to move them out of the water\n\u003E \n\u003E ![tumblr_nozzzdPqYm1r0o48lo3_1280.png](https://36.media.tumblr.com/e2e64db9cf9daff03dcfa1b6c78c3e14/tumblr_nozzzdPqYm1r0o48lo3_1280.png)\n\u003E \n\u003E everyone generally agrees that she has saved the day, even Bill is staring at her in admiration, since he had been stumped by what was causing the issue, and he makes a note to remember Tanuna\u0027s name and her skills. and to give her the honor of planting the flag when they reach the shore.\n\u003E \n\u003E Which they do, in just a few minutes of physical time warp they are across the small ocean inlet and back on land, ready to reattach the wheels and plant a flag, and Tanuna gets out to plant it, Bill shouts down \u0022call it Tanuna Beach, it\u0027s probably the only time you\u0027ll get the chance to name a place after yourself!\u0022\n\u003E \n\u003E ![tumblr_nozzzdPqYm1r0o48lo4_1280.png](https://36.media.tumblr.com/0aa8afdeb3f3ffb3acdaa0d497bf97d7/tumblr_nozzzdPqYm1r0o48lo4_1280.png)\n\u003E \n\u003E ![tumblr_nozzzdPqYm1r0o48lo5_1280.png](https://41.media.tumblr.com/1d9b32110b6497ab28cc4be6df34139f/tumblr_nozzzdPqYm1r0o48lo5_1280.png)\n\u003E \n\u003E Setting off again, the Banzai! goes to meet up with the Sparrowhawk in order to attach a light to the front, and input the coordinates for the lake they saw on the map, deciding that it seemed like a good place to stop off for lunch.\n\u003E \n\u003E ![tumblr_np00ng1nn61r0o48lo2_1280.png](https://40.media.tumblr.com/756bb876e0387c769e27d62898376812/tumblr_np00ng1nn61r0o48lo2_1280.png)![tumblr_np00ng1nn61r0o48lo3_1280.png](https://41.media.tumblr.com/c07168b5b7f45a9a81d55cb87e7671d8/tumblr_np00ng1nn61r0o48lo3_1280.png)\n\u003E \n\u003E having received confirmation that the Sparrowhawk had reached its destination, the Banzai! set off once more at speed, the ground seemed flat at a glance, but after lifting off into the air a bit more vigorously than they would have liked, they are told by mission control to cut their speed to a maximum of 50 m/s\n\u003E \n\u003E ![tumblr_np00ng1nn61r0o48lo4_1280.png](https://36.media.tumblr.com/2e977cb6ca34f24a3b729fa78bd40173/tumblr_np00ng1nn61r0o48lo4_1280.png)\n\u003E \n\u003E Everything is going well and the crew get to talking, but when they look back, there are suddenly trees everywhere! they were all convinced that these trees had not been there before, and they start to grow worried, as they have all been told the tales of the Kraken Trees, which suddenly appeared out of nowhere and crashed the universe.\n\u003E \n\u003E ![tumblr_np00ng1nn61r0o48lo5_1280.png](https://40.media.tumblr.com/ccd974e3302fb30e22f6772f8e43d9f9/tumblr_np00ng1nn61r0o48lo5_1280.png)\n\u003E \n\u003E These fears turn out to be nothing more than superstition, and the mission progresses as planned and there were some beautiful mountain landscapes to look at off to the east, made sweeter by the though that, because of the route they had taken, they did not need to cross over them.\n\u003E \n\u003E As the sun reaches its highest point in the sky the crew catch sight of the Sparrowhawk, landed in a clearing not far from a beautiful lake. Jeb makes the decision that since the Sparrowhawk has an abundance of fuel, and the Banzai! used up an alarming amount during the water crossing, they would rendezvous with it and siphon some fuel from its tanks.\n\u003E \n\u003E ![tumblr_np00ng1nn61r0o48lo6_1280.png](https://40.media.tumblr.com/6c6943332dbaea354e8cede9bf3411dc/tumblr_np00ng1nn61r0o48lo6_1280.png)\n\u003E \n\u003E Once Sigely has finished this the Sparrowhawk takes off in search of the natural marina that marks their next waypoint in the journey, and the Banzai! turns around to find a nice spot near the lake to stop for lunch and plant a flag.\n\u003E \n\u003E After some discussion, the decision is made to call the lake \u0022Geschosskopf Lake\u0022 after an explorer who was attempting a mission not dissimilar to theirs, and who had been the first to document the existance of Kraken Trees.\n\u003E \n\u003E ![tumblr_np00ng1nn61r0o48lo7_1280.png](https://41.media.tumblr.com/88c5f4b1b7ccbb40329711bc2281b1ed/tumblr_np00ng1nn61r0o48lo7_1280.png)\n\u003E \n\u003E *(As always, Jeb fails to look the right way as the camera takes its shot.)*\n\u003E \n\u003E after a short lunch break by the side of the lake, everyone agrees it is time to get moving again, and heads of to meet up with the Sparrowhawk yet again, realizing that after this, the next leg of their journey would be a long haul over water.\n\u003E \n\u003E the going is relatively easy, and the views of the huge mountain range that they have successfully navigated around grew ever more spectacular, but filled them with the dread that the Banzai! was woefully ill-equipped for handling such terrain, and there may yet be a point in their journey where they are left with no choice but to attempt a dangerous assent.\n\u003E \n\u003E As evening begins to creep up on the Banzai! the crew begin to grow less observant, the long journey was beginning to sap at their energy and being woken up during the night for a supply drop had left them with less sleep than they would have liked, the meeting with the Sparrowhawk drifts past without much notice, and the Sparrowhawk departs for the far shores, the only thing that grabs their attention and brings them back into reality fully for a short while is images from the Sparrowhawks onboard camera which shows them an aerial view of the natural marina they have reached, as well as the size of the water crossing they are about to attempt.\n\u003E \n\u003E ![tumblr_np01plBQsP1r0o48lo2_1280.png](https://40.media.tumblr.com/9854eca3527441b06731cae8adb9c539/tumblr_np01plBQsP1r0o48lo2_1280.png)\n\u003E \n\u003E ![tumblr_np01plBQsP1r0o48lo1_1280.png](https://40.media.tumblr.com/304387d07fb4fd5bcff18f3432160d9e/tumblr_np01plBQsP1r0o48lo1_1280.png)\n\u003E \n\u003E The spectacle fills them with wonder and worry, the Banzai! had been sitting rather low in the water during their first crossing, and so they were weary of enduring one that was even longer.\n\u003E \n\u003E As it turned out though, the water was the least of their worries, a tired and unobservant Jeb (me) was what they should have truly feared.\n\u003E \n\u003E As the Banzai! descends down to the beach Jeb forgets to put on the breaks, and they go flying over a sand dune and land rather more heavily than they would have liked, they hear a massive crash from the back of the craft, and once they get out to look, they realise that the back of one of the pontoons has sheared, off. Thankfully this does not seem to be a major problem, and they continue into the water, but shortly after entering the water (and spinning out of control again because someone forgot to remove the steerable wheels from the pontoon) they hear yet another crash from the back of the Banzai! this time the damage is rather more severe, one of the jets has fallen off!\n\u003E \n\u003E To make matters worse, the sun is beginning to set, and they will have to complete the rest of the crossing in the dark, thankfully the Banzai! still handles well despite loosing an engine (somewhat of a miracle!) but how will the crew overcome this problem?\n\u003E \n\u003E ![tumblr_nozagpcSOf1r0o48lo1_1280.png](https://41.media.tumblr.com/55cef29e0ff3f3c732ccf4d51be7bd06/tumblr_nozagpcSOf1r0o48lo1_1280.png)![tumblr_nozagpcSOf1r0o48lo2_1280.png](https://40.media.tumblr.com/17c8123c893614358254e32628ad31c6/tumblr_nozagpcSOf1r0o48lo2_1280.png)![tumblr_nozb2qMaq21r0o48lo1_1280.png](https://41.media.tumblr.com/67cbe32ded85ed8bdc3b75022389ead0/tumblr_nozb2qMaq21r0o48lo1_1280.png)\n\u003E \n\u003E ---------------------------\n\u003E \n\u003E I do apologize, this stretch of the journey was filled with things happening, and so I feel my descriptions of it got a bit long winded, but when I tried to think of things I could cut out, I couldn\u0027t find any, a lot of things happened in a short period of time! this will be the end of the current part of the journey, when we return to the Banzai! we will see how they managed to deal with the damage and they will begin their final stretch over land to reach the North Pole.\n\u003E \n\u003E Also the bay in which the pontoon broke was named Shipwreck Bay, but I forgot to take screenshots of the flag being planted! silly me.\n\u003E \n\u003E I am really enjoying this mission a whole lot more than I ever thought I would, and it is going a lot faster too, the Banzai! has its quirks, but for the most part it is a brilliant craft and I never expected it to perform quite so well as it has.\n\u003E \n\u003E ---------------------------\n\u003E \n\u003E \n\nAnd so, at the end of that part of the voyage, the Banzai! has stuck pretty much perfectly to the path on the map above. the projected path the Banzai! should take over the next leg of the journey is as follows:\n\n![tumblr_np02ovjiD21r0o48lo1_1280.png](https://36.media.tumblr.com/f09384f70afa096213bf9edb486b2a14/tumblr_np02ovjiD21r0o48lo1_1280.png)\n\n-------------\n\n\u003E \n\u003E As the light left the sky, the damaged Banzai! travelled the final stretch of sea to meet up with the Sparrowhawk on the beach, as the craft lumbers out of the water Sigley gets out to assess the damage and radio the KSC for help. after much discussion, the decision is reached to send out a plane with the parts needed directly attached, the reason being that the small KIS containers won\u0027t fit a jet engine, but the large ones are huge! no one wants to send a 2.5m aircraft just for a quick repair job!\n\u003E \n\u003E Unfortunately in the rush to put together the aircraft attention is not payed to making it able to return to the KSC after it has resupplied the Banzai!, and so as it sets off, Zely, the pilot selected for the task, quickly realizes she has agreed to a one way trip, and unless she can hitch a ride on the Banzai! to be picked up at the next resupply drop is going to find herself stranded where she lands, for this reason, she decides to name the aircraft the Martyr-1, for its sacrifice to the Banzai!\u0027s cause.\n\u003E \n\u003E ![tumblr_np0o5oVEIl1r0o48lo1_1280.png](https://36.media.tumblr.com/161fdbfcc6165afebb9593c8d8194604/tumblr_np0o5oVEIl1r0o48lo1_1280.png)\n\u003E \n\u003E ![tumblr_np0o5oVEIl1r0o48lo2_1280.png](https://40.media.tumblr.com/038b07a16c15cd2da52b82d1be5849f9/tumblr_np0o5oVEIl1r0o48lo2_1280.png)![tumblr_np0o5oVEIl1r0o48lo3_1280.png](https://40.media.tumblr.com/ed1656d4eb403b046d2cf38f489f2878/tumblr_np0o5oVEIl1r0o48lo3_1280.png)\n\u003E \n\u003E as she arrives, Bill and Sigley run over and immediately get work work cannibalizing the craft for the good of the Banzai!, Zely, accepting that this is the only way things are going to work, gets out and begins to help them, since lifting the jet engine up to attach it was proving to be too much for just 2 kerbals alone. After some hard work, and Sigley nearly getting crushed by the engine as it failed to attach, the ship is repaired, and Zely asks if she there is any way she can hitch a ride. Unfortunately there are no spare seats, however Bill has an idea, he grabs one of the spare ladder segments from the storage container in the cargo bay and attaches it to the front of the Banzai!. \n\u003E \n\u003E \u0022you can be our figurehead\u0022 he tells her jokingly.\n\u003E \n\u003E She doesn\u0027t laugh.\n\u003E \n\u003E ![tumblr_np0o5oVEIl1r0o48lo4_1280.png](https://40.media.tumblr.com/8916e5e16979844abea744cbbe80dffe/tumblr_np0o5oVEIl1r0o48lo4_1280.png)\n\u003E \n\u003E ![tumblr_np0o5oVEIl1r0o48lo5_1280.png](https://40.media.tumblr.com/54b50e54f652fd63abf133c94807033e/tumblr_np0o5oVEIl1r0o48lo5_1280.png)\n\u003E \n\u003E Unfortunately after attempting to roll up the hill towards the spot they had chosen to camp at they soon realize this isn\u0027t a viable option, she can\u0027t keep her grip with the speed the Banzai! is moving at, even when it\u0027s going slowly, she falls off and for a second they fear for the worst, but she stands up and shouts back that she\u0027d rather just sit in the Martyr and wait for rescue, and so she turns around runs back to the Martyr, and decides to plant a flag, naming this place \u0022Martyrs Rest\u0022.\n\u003E \n\u003E Come morning the crew sets out again, the Sparrowhawk had moved on to scout the new location in the early hours of the morning, so once again Jeb sets up his targeting systems and heads out.\n\u003E \n\u003E The going is monotonous, but safe, stopping every 30km or so to plant a flag, soon they come across fir trees, signifying that they have indeed entered the far north of Kerbin. Olivia and Luden start looking out for floating trees to gather information for the report they intend to present upon returning to the KSC, and it\u0027s not long before they find plenty.\n\u003E \n\u003E ![tumblr_np0ou24cnR1r0o48lo1_540.png](https://40.media.tumblr.com/46c26fb625148d8f8ea4f5b036b84b26/tumblr_np0ou24cnR1r0o48lo1_540.png)\n\u003E \n\u003E *Jeb for the last time the camera is behind you!*\n\u003E \n\u003E ![tumblr_np0ou24cnR1r0o48lo2_1280.png](https://41.media.tumblr.com/d27604fa214e7c68770ba1b21cd00ebf/tumblr_np0ou24cnR1r0o48lo2_1280.png)\n\u003E \n\u003E ![tumblr_np0ou24cnR1r0o48lo4_1280.png](https://40.media.tumblr.com/9e75cd2a5a93d464ef14eb2dbe92fe20/tumblr_np0ou24cnR1r0o48lo4_1280.png)\n\u003E \n\u003E After travelling like this for a while they eventually reach their destination, rendevous with their Recon Drone and get out for a good flag planting and some lunch. it is decided that from there they will head off to a lake marked on the map that appears to be on the divide between the tundra and the grasslands, so they punch in the coordinates to Sparrowhawks flight computer and prepare to head off themselves.\n\u003E \n\u003E ![tumblr_np0ou24cnR1r0o48lo5_1280.png](https://36.media.tumblr.com/31aabe6b15db19003a1e2cd3d2cba1c8/tumblr_np0ou24cnR1r0o48lo5_1280.png)![tumblr_np0ou24cnR1r0o48lo3_1280.png](https://41.media.tumblr.com/99c7ab2d695f6c103a9fdc280bf3cead/tumblr_np0ou24cnR1r0o48lo3_1280.png)*Jeb you are beyond help.*\n\u003E \n\u003E *Here is the map with flags and location names marked:*\n\u003E \n\u003E ![tumblr_np0pm1HuLa1r0o48lo1_540.png](https://40.media.tumblr.com/100fae2eccd38ef53c0c93be54657e4d/tumblr_np0pm1HuLa1r0o48lo1_540.png)\n\u003E \n\u003E Finally, after more monotonous but thankfully disaster free driving the Banzai! reached the lake, Olivia planted her flag, getting to name a location after herself at last.\n\u003E \n\u003E As the crew settle down for the evening, content with the progress they have made today, they get contact on the radio from the KSC, an anomalous signal has been detected, not much more than 100km away from their location, back at they KSC they have already taken remote control of the Sparrowhawk and are sending it there to investigate....\n\u003E \n\u003E Upon the Sparrowhawks arrive they quickly see the source of the signal, it seems to be some kind of... saucer? They are unsure of why that thought comes into their head, could be anything, but they get the feeling it is a spaceship, and decide to send the crew of the Banzai! there to investigate. Jeb jumps at the opportunity, an unidentified object? finally the day was getting interesting, he was bored to death of the same scenery over and over all day, and now he had the chance to have some real fun.\n\u003E \n\u003E ![tumblr_np0py8SsfV1r0o48lo1_1280.png](https://41.media.tumblr.com/be53e11897d9f58c24a9a672798d72cf/tumblr_np0py8SsfV1r0o48lo1_1280.png)\n\u003E \n\u003E *Nearly Jeb, you\u0027re getting better at this at least...*\n\u003E \n\u003E ![tumblr_np0py8SsfV1r0o48lo2_1280.png](https://40.media.tumblr.com/c9e404bbfaaf784bb2ab673c54a142ef/tumblr_np0py8SsfV1r0o48lo2_1280.png)\n\u003E \n\u003E *but what could it be???*\n\u003E \n\u003E ![tumblr_np0py8SsfV1r0o48lo3_1280.png](https://40.media.tumblr.com/5e43f6b68b82831e0a2b20d38f3e0734/tumblr_np0py8SsfV1r0o48lo3_1280.png)\n\u003E \n\u003E *Jeb this isn\u0027t a plane, please don\u0027t try and make it fly!*\n\u003E \n\u003E \n\u003E \n\u003E Unfortunately, Jebs impatience to reach the UFO winds up causing problems, after cruising along the flats of the Ice Caps at 120m/s he becomes too used to the high speeds, so when the flats end, he fails to slow down enough, leading to a catastrophic disaster....\n\u003E \n\u003E ![tumblr_np0py8SsfV1r0o48lo4_1280.png](https://41.media.tumblr.com/1528e2c2f420f8ae3d76f670502602ca/tumblr_np0py8SsfV1r0o48lo4_1280.png)\n\u003E \n\u003E As Jeb crests a hill at 80m/s the back wheels explode, flipping the craft over and smashing it down hard into the ground, its a miracle the cockpit and passenger pod survived the impact, but as the smoke clears it becomes clear the Banzai! cannot continue, we\u0027re going to need to ship out a replacement. unfortunately this incarnation of the Banzai! never made it to the anomaly, but the Sparrowhawk registered the shockwaves of the explosion through the ground, and sent a report back to the KSC, help should be on its way soon, right?\n\u003E \n\u003E ----------------------------------\n\u003E \n\u003E Ok so a bit of background on this, the FIRST time this crash happened, I was going at 80m/s, i actually reloaded, told myself I was just being silly, and went at it at a far more reasonable 25m/s (pretty much the slowest i\u0027ve gone for the whole journey) and yet even then, *the exact same thing happened.* so I decided to just say \u0022yep, that\u0027s it, the Banzai! has been wrecked\u0022.I get the feeling the terrain was a bit glitched out, because the initial explosion happened before I even got to the crest of the hill, and there was no noticeable protrusion, however with the texture of the poles it is hard to see that well.\n\u003E \n\u003E I am currently making some minor alterations, i think in order to ship a new one out there i will just whack some decouplers on the side, stick some wings on them and maybe some fuel and some OTS ScreamJets, put parachutes on the Banzai! MkII and fly it out there...\n\u003E \n\u003E I could have just reloaded, and pretended it never happened, but as the first real crash that wasn\u0027t a result of some glitch or microsoft popping up to tell me my version of windows is not legit at the wrong moment (it certainly is but I don\u0027t seem to be able to stop them telling me it\u0027s not) I thought I couldn\u0027t reasonably do that and feel like I wasn\u0027t cheating, and since I can only call it a miracle that something like this hadn\u0027t happened sooner, well, it just didn\u0027t seem right, besides, disaster makes it so much more entertaining, right? right??\n\u003E \n\u003E ------------------------------------\n\u003E \n\u003E \n\nYes the first true disaster of the voyage has struck, time to see if i can fly another Banzai! out there without crashing it\n\nI forgot to add a map of the progress made after Olivia\u0027s Lake or the intended destination, so here it is now:\n\n![tumblr_np2ir6zXtU1r0o48lo1_540.png](https://40.media.tumblr.com/eff45550af474901bd7c18582301cc66/tumblr_np2ir6zXtU1r0o48lo1_540.png)\n\n-------------\n\n\u003E \n\u003E After the Sparrowhawk\u0027s sensors pick up the explosion, the KSC takes remote control with the intention of sending it out there to investigate, but that was unneccesary, Bill predicted what would happen and had set up radio contact with the Sparrowhawk using his EVA Suits short range comms, and is quickly patched through to Mission Control.\n\u003E \n\u003E after some communication MC is reassured that everyone has survived, and that the problem seems to have been ultimately caused by a lack of wheels on the rear of the pontoons, Bill lists off a few other minor changes that are required, and the Engineering Department back at KSC get hard at work designing a new craft ASAP.\n\u003E \n\u003E After some work, they manage to outfit the Banzai! MkII to be flight capable, although the journey is slow, it makes it there eventually, although on the way something unexpected becomes apparent: there are two hitchhikers on the supposedly unmanned vessel.\n\u003E \n\u003E Because of the nature of the KSC crew roster, whenever a new craft is commissioned, seats are filled in the roster by an automated computer program, this illogical method for crew selection, and an oversight on behalf of the head of the KSC (me) meant that two pilots had wound up on the flight, with no way to return.![tumblr_np2j3r3OVK1r0o48lo2_1280.png](https://41.media.tumblr.com/815c26561466ad732d5d901d51b805aa/tumblr_np2j3r3OVK1r0o48lo2_1280.png)\n\u003E \n\u003E By the time this is realized, they are already well into their flight, and turning back is not an option, so the two unfortunate pilots resign themselves to sitting in the wreckage of the original Banzai to wait rescue, or be transferred over to the planned science base around the newly discovered anomaly.\n\u003E \n\u003E After a flight lasting almost two hours, the wreckage of the Banzai! comes into sight, so automated systems on the Banzai! MkII detonates the decouplers, separating the wings, and activates the parachutes to float down, landing not more than 500m away. \n\u003E \n\u003E The crew, overjoyed to see another Banzai! floating down towards them, attempt to get out, but because they rolled over during the crash their doors are blocked, the Banzai! MkII notices this and quickly responds, giving the wreckage a gentle nudge to roll it over. shortly later, the crew had transferred and the unfortunate pilots had began to settle down into the wreckage, thankfull that the passenger cabin and crew cabin were still in good shape.\n\u003E \n\u003E ![tumblr_np2j3r3OVK1r0o48lo1_1280.png](https://40.media.tumblr.com/64684fa9c5b060fd923e0095b1c77bc2/tumblr_np2j3r3OVK1r0o48lo1_1280.png)\n\u003E \n\u003E ![tumblr_np2j3r3OVK1r0o48lo3_1280.png](https://40.media.tumblr.com/3d3325ba8a2e70bd99244939633f982e/tumblr_np2j3r3OVK1r0o48lo3_1280.png)\n\u003E \n\u003E ![tumblr_np2j3r3OVK1r0o48lo4_1280.png](https://40.media.tumblr.com/ae33f292bca53a7877454f650853bd17/tumblr_np2j3r3OVK1r0o48lo4_1280.png)\n\u003E \n\u003E ![tumblr_np2j3r3OVK1r0o48lo3_1280.png](https://40.media.tumblr.com/3d3325ba8a2e70bd99244939633f982e/tumblr_np2j3r3OVK1r0o48lo3_1280.png)\n\u003E \n\u003E A short drive later, the Banzai! arrives at the Sparrowhawks location, and see\u0027s the anomaly they had been called out to view for the first time.\n\u003E \n\u003E No one could quite make sense of it, they had been told it showed signs of being some kind of spacecraft by Mission Control but could not figure out how anyone had come to that conclusion.\n\u003E \n\u003E Jeb was unperturbed by it however and quickly jumped out of the Banzai! and onto the anomaly, he had driven at 120m/s, wrecked an expensive vehicle and caused untolds amount of grief for the people back and KSC just to get to this spacecraft as fast as possible and he wasn\u0027t about to let it\u0027s odd appearance get him down.\n\u003E \n\u003E ![tumblr_np2j3r3OVK1r0o48lo5_1280.png](https://41.media.tumblr.com/b705cce914c7062bc75d7aa28ff574fe/tumblr_np2j3r3OVK1r0o48lo5_1280.png)\n\u003E \n\u003E *Finally Jeb! you faced the right way!!!*\n\u003E \n\u003E After Jeb finally calms down, the crew get to work radioing the KSC to call for an airdrop, if a base is going to be constructed, they need resources and a Science Lab before they can get started.\n\u003E \n\u003E ------\n\u003E \n\u003E quick note: I\u0027m going to omit a lot of the base building process, I did at lot of it at about 4am and so messed a lot of things up, didn\u0027t take many screenshots and generally did a bad job of documenting it and I figure since the focus of this is the voyage it\u0027s not so important anyway.\n\u003E \n\u003E -----\n\u003E \n\u003E ![tumblr_np2jxrlJGT1r0o48lo1_1280.png](https://41.media.tumblr.com/3af05cac342d3e98670a675441cebb12/tumblr_np2jxrlJGT1r0o48lo1_1280.png)\n\u003E \n\u003E ![tumblr_np2jxrlJGT1r0o48lo2_1280.png](https://40.media.tumblr.com/f1b6be63955ca9b365112a372053bf8a/tumblr_np2jxrlJGT1r0o48lo2_1280.png)\n\u003E \n\u003E with a cruising speed of 1Km/s and a payload bay large enough to fit a small city, the Barracuda Super Heavy Lifter is hugely overkill for the task at hand, but everyone generally agreed it looked cool, so who cares.\n\u003E \n\u003E with 12 Turbo Ramjets and 2 MkII Afterburner\u0027s the Barracuda chugs down fuel at a peak rate of 18/s, and it becomes apparent rather quickly that while it will make it to the poles, the chances of a return flight are slim.\n\u003E \n\u003E As the Barracuda approaches its destination, the cargo bays open and it prepares to drop its payload. The Pilot quickly realises that releasing both of them at the same time was a bad idea however, since the Science Lab\u0027s wide body gave it moderate amounts of lift, causing it to float off course by about 2.5km\n\u003E \n\u003E ![tumblr_np2jxrlJGT1r0o48lo3_1280.png](https://41.media.tumblr.com/4e5b4a0a7610e18a9044a76a22498519/tumblr_np2jxrlJGT1r0o48lo3_1280.png)\n\u003E \n\u003E ![tumblr_np2jxrlJGT1r0o48lo4_1280.png](https://40.media.tumblr.com/50c97c0fd2e012d55c404161a5ef0c22/tumblr_np2jxrlJGT1r0o48lo4_1280.png)\n\u003E \n\u003E ![tumblr_np2jxrlJGT1r0o48lo5_1280.png](https://40.media.tumblr.com/95623f47103e0cd1ead848a63291497c/tumblr_np2jxrlJGT1r0o48lo5_1280.png)\n\u003E \n\u003E Thankfully at least the Storage \u0026 Power unit landed in the vicinity of the base camp, and the Banzai! edges towards it, Sigley gets out, fishes some landing gear out from inside it and gets to work removing the legs and attaching the gear, once this is done, he hooks it up to the Banzai! using a pipe (since the winch proved rather ineffective) and held on to the Banzai!\u0027s side ladder while it was ferried up to the camp, the gear was removed, the legs and solar panels reattached, at the building was completed.\n\u003E \n\u003E ![tumblr_np2kbzHkQs1r0o48lo1_1280.png](https://41.media.tumblr.com/378095f4ddc0605e709babfd40d1b0e6/tumblr_np2kbzHkQs1r0o48lo1_1280.png)\n\u003E \n\u003E ![tumblr_np2kbzHkQs1r0o48lo2_1280.png](https://41.media.tumblr.com/3c2f2b68bb92e695c09963639ef3ca8d/tumblr_np2kbzHkQs1r0o48lo2_1280.png)\n\u003E \n\u003E ![tumblr_np2kbzHkQs1r0o48lo3_1280.png](https://41.media.tumblr.com/68c9bd169b5979a49c1d90db93cc7bc0/tumblr_np2kbzHkQs1r0o48lo3_1280.png)\n\u003E \n\u003E Happy with the job they had done, they moved on to the Science Lab, but it quickly became apparent the Banzai! was not fit for the task of dragging it back to the camp. Due to its inability to reverse without the aid of gravity the Banzai! was unable to back up to the Lab in order to get ready to tow it, and so after much disagreement and discussion, the decision was made to leave it where it was, and call for another supply drop.\n\u003E \n\u003E As Olivia and Luden were preparing to transfer over to the Lab and await the supply drop, another oversight on the part of the Engineering Lab was noticed, there were no ladders to get up to the entrance to the Lab, and none back in the storage container, and so one had to be removed from the side of the Banzai! in order to enable access, luckily Sigley got stuck in and had it done in a matter of minutes, and soon Olivia and Luden were settling in, popping their heads out to say one last goodbye\n\u003E \n\u003E ![tumblr_np2kza4cys1r0o48lo1_1280.png](https://41.media.tumblr.com/e9b11f9de804f67b8bc7e9451b8fe81a/tumblr_np2kza4cys1r0o48lo1_1280.png)\n\u003E \n\u003E ![tumblr_np2kza4cys1r0o48lo2_1280.png](https://41.media.tumblr.com/747551424138f4cbade3e029a4449c97/tumblr_np2kza4cys1r0o48lo2_1280.png)\n\u003E \n\u003E Leaving behind a mysterious light spot as they exit, they see Olivia and Luden run out of the Lab to go and investigate, and realize that they are going to be just fine on their own, it is the crew of the Banzai!, now down to just 4, who start to feel lonely, although the mission has only gone on for 4 days, they already started to feel a sense of attachment to each other, and the journey had transformed them into a close-knit group faster than they ever would have thought.\n\u003E \n\u003E Despite their reservations about leaving those two behind, Jeb feels a guilty sense of enjoyment being back on the road, cruising along at 100m/s towards the Sparrowhawk once more, which had relocated itself to the North Pole.\n\u003E \n\u003E ![tumblr_np2kza4cys1r0o48lo3_1280.png](https://41.media.tumblr.com/7dd92e1382c48adee978e55f0f2bd6b5/tumblr_np2kza4cys1r0o48lo3_1280.png)\n\u003E \n\u003E The flat terrain stretched on for miles, and its emptiness held a certain profound beauty, with just the sound of the jet engines and the snoring from the crew, who by now had been awake and working for over 24 hours, Jeb chugged down an energy drink and turned his attention back onto the \u0022road\u0022m appreciating the tranquility and lack of... anything. \n\u003E \n\u003E After a while, Jeb realizes that with everyone else asleep, there\u0027s nothing to stop him having a quick break, jumping out and planting a flag.\n\u003E \n\u003E ![tumblr_np2kza4cys1r0o48lo4_1280.png](https://40.media.tumblr.com/3ea9f01b24751ea28e0f31c4f744b5aa/tumblr_np2kza4cys1r0o48lo4_1280.png)\n\u003E \n\u003E *Dammit Jeb, you got it right last time! I\u0027m starting to think you\u0027re just doing this on purpose.*\n\u003E \n\u003E A short while later they come across the north pole, Jeb puts on the breaks, and suddenly experiences a strange pheomenon, the engines cut, the computers showed that there was no air entering the intakes. it becomes apparent that there are some strange goings on at the Poles... Jeb quickly removes the breaks, and hopes he can manage to coast until the Intakes fill with air again, otherwise they will be stranded with no method of propulsion\n\u003E \n\u003E they are crawling along at 2m/s before the engines finally spark back to life, Jeb cuts them, wakes everyone up, and they all put on their EVA suits to go and investigate the Pole.\n\u003E \n\u003E ![tumblr_np2kza4cys1r0o48lo7_1280.png](https://41.media.tumblr.com/11cd1bf8ed89054cb103de17ec692a5d/tumblr_np2kza4cys1r0o48lo7_1280.png)![tumblr_np2kza4cys1r0o48lo8_1280.png](https://36.media.tumblr.com/4a82ac93513f052f6c9a83f57f35d687/tumblr_np2kza4cys1r0o48lo8_1280.png)\n\u003E \n\u003E They discover that the Pole is marked by what appears to be intersecting fault lines, leading to a bottomless pit, possibly even going all the way to the core, and when one stands at the intersection, gravity goes *weird.*\n\u003E \n\u003E after agreeing that this probably isn\u0027t something they are going to be able to research on their own, they get back to the Banzai! and radio Olivia at the Lab to inform her that when she gets a chance, the pole is definitely worth researching.\n\u003E \n\u003E *Back on the road, the crew quickly fall asleep, and Jeb takes the opportunity to plant another flag before continuing on to the next waypoint, at the end of the Ice Caps, they are faced with mountains, not large ones, but treacherous none-the-less.*\n\u003E \n\u003E *Jeb has not slept in almost 36 hours by this point, and is feeling like he is going to pass out, so he stumbles out of the Banzai! places a flag, and then crawls back up the ladder to get some much deserved sleep.*\n\u003E \n\u003E ![tumblr_np2kza4cys1r0o48lo5_1280.png](https://41.media.tumblr.com/1b5e7b08d667f80171fd799017dd85f1/tumblr_np2kza4cys1r0o48lo5_1280.png)\n\u003E \n\u003E *Jeb at the Southern North Pole (facing the right way!)*\n\u003E \n\u003E ![tumblr_np2kza4cys1r0o48lo9_1280.png](https://40.media.tumblr.com/0c4f1b0757539ef7e8073f5067eeb310/tumblr_np2kza4cys1r0o48lo9_1280.png)\n\u003E \n\u003E *Jeb at base camp (right way again! you\u0027re on a roll Jeb)*\n\u003E \n\u003E *-------------------------*\n\u003E \n\u003E This was a long section of their journey, and they are over a quarter of the way around Kerbin already! The base building was a bit of a disaster, but like all disasters in KSP, it was good fun anyway, and I got to learn a lot about using KIS and KAS, which will be usefull later on I\u0027m sure. The crew are now going to sleep for at least 12 hours, probably more like 24, and will resume their voyage after nightfall, in the meantime I\u0027m going to try to get the Polar Explorer closer to the South Pole to set up base in preparation for the Banzai\u0027s arrival and probably test out some methods of support (I\u0027m thinking instead of just plane old refueling, i\u0027ll set down a probe with an ISRU refinery and drill and see if I can make a refueling station, just because.\n\u003E \n\u003E *------------------------*\n\u003E \n\u003E \n\nAnd so at the end of that leg of the journey I think it\u0027s time to show a map with their over-all progress up until now, looking at it, they have come a really long way, it\u0027s been a helluva ride, and I\u0027ve enjoyed every second of it, even the bits that have gone horribly wrong (in fact, especially those points, they always make me laugh)\n\n![tumblr_np2m8zXprs1r0o48lo1_1280.png](https://41.media.tumblr.com/1c5d9a9faf672594776fe2ceba9cc43e/tumblr_np2m8zXprs1r0o48lo1_1280.png)\n\n(because of how Kebal Maps is displayed the north and south pole are very stretched, so I didn\u0027t actually travel even nearly that far west, I\u0027m sure I\u0027ll upload a map of flags soon too so that might show the actual route a little better)\n\nJust a quick overview of the changes between the MkI and MkII of the Banzai!\n\n- Removed Gigantor Solar Array\u0027s from the sides (no idea why I put them there, just extra part count causing lag)\n\n- Removed Linear RCS thrusters \u0026 Monoprop Tanks (I did this in the field on the MkI, they proved pretty useless at helping me turn in water and rinsed through the RCS)\n\n- Removed 2/4 if the RTG\u0027s (2 is enough to power my subsystems, the Banzai! doesnt really need much electricity apart from when moving, at which point the turbo\u0027s alternators provide all I need)\n\n-switched all tanks over to pure liquid fuel, getting rid of 550 oxidizer that was unneeded and adding it as bonus liquidfuel\n\n-added wheels to the rear of the pontoons - this is the important one, i suspect the lack of wheels here is what caused my crash, and what caused the damage way back at shipwreck bay, since adding these going up and down hills has felt a lot safer, though I can\u0027t say for sure if it\u0027s really had much effect yet.\n\n-reinforced pontoons with struts - I noticed they were sagging a lot, and while to an extent this added some extra suspension, i couldn\u0027t help feeling like it would be a problem if left for too long, it made it seem more fragile, whether it was in reality, who knows.\n\n-moved the pontoons back very slightly - I noticed the balance wasn\u0027t quite spot on, they were only moved about 10-20cm back but it seems to have made some difference\n\nand it\u0027s it! really not a lot got changed, more things were removed than added (I was getting a bit of time slowing, and the reduced part count has reduced that noticeably), I thought the MkI was already a pretty capable beast, having got that far without incident is evidence of this, these minor tweaks should hopefully make it better than ever!\n\n-------------\n\n\u003E \n\u003E As the sun began to rise on the 2nd day of their rest stop, the crew of the Banzai! decided that they had recovered enough, and prepared to leave the camp, which they had named Tranquility Point, because of the serene feeling the place gave them. nestled in between the foothills of the tundra to the south, and the seemingly endless expanse of the ice caps to the north, the place was quiet and calming, a perfect place to recover after the near death experience of the crash and followed almost immediately by the hard work of attempting to construct the polar base.\n\u003E \n\u003E As they prepared to leave, they radioed Mission Control to receive information on the status of various support craft and missions. They are informed that the Sparrowhawk has been flown about 100km south of their location, to a flat expanse just before the end of the tundra, they are to rendevous with it there and us it to scout out the next leg of the journey, it seemed there was a large inland sea, which could either be crossed or avoided, but the decision was ultimately left up to them.\n\u003E \n\u003E As well as this the KSC informed them that the Sparrowhawk was beginning to run low on fuel, and while it could make it down to the equator, it was unlikely to get much further, so they had arranged an ISRU Probe to land further down their intended route, to begin extracting fuel ready for when they reached it.\n\u003E \n\u003E Finally they were informed that Val and Bob, along with the rest of the crew of the Polar Explorer had managed to get closer to the South Pole, but had run out of fuel yet again about 200km away from their planned landing site and were awaiting another Hummingbird for assistance.\n\u003E \n\u003E And so, setting out from camp, the Banzai! began to navigate through the foothills of the tundra, going was slow, not reaching more than 40m/s and even then only on the flatter areas, Jeb was too worried about crashing the Banzai! again, he wasn\u0027t sure he\u0027d still have his job if he lost two of them in one week.\n\u003E \n\u003E ![tumblr_np4kokpS4j1r0o48lo6_1280.png](https://41.media.tumblr.com/2daa133eaa848b6c55a574432a52b3a7/tumblr_np4kokpS4j1r0o48lo6_1280.png)\n\u003E \n\u003E ![tumblr_np4kokpS4j1r0o48lo3_1280.png](https://40.media.tumblr.com/27bca0e184c4713f8df5318cc650eba7/tumblr_np4kokpS4j1r0o48lo3_1280.png)\n\u003E \n\u003E After a while they come across some mountains, free of snow on top, this is the first sign that they are approaching the end of the tundra, and coming down onto the opposite side of the planet from the KSC, as the mountains draw closer, they realize they are some of the strangest they have ever seen, everyone stares at them as they drive past, even Jeb, who forgets to take his hand off the throttle and almost causes them to crash.\n\u003E \n\u003E ![tumblr_np4kokpS4j1r0o48lo7_1280.png](https://40.media.tumblr.com/7343e4607ad2d45f8ac223b9351979a2/tumblr_np4kokpS4j1r0o48lo7_1280.png)\n\u003E \n\u003E Soon they reach the Sparrowhawk, and take remote control to scout out the landscape, they soon find out that they are only about 2Km away from the end of the snow, but hills were obscuring their view from the ground.\n\u003E \n\u003E as the snowy expanse ends it is replaced with a rough hilly landscape, with sharp peaks and deep indents, it looks like there was once a river running down there, but on closer inspection they discover it was most likely a glacier, and the lake was the meltwater from it.\n\u003E \n\u003E the decision is made that the landscape looks far to dangerous, those sharp ridges at the tops of the hill were likely to spell the end of the Banzai! if they tried to go over them, and the lakes edge was covered in appealing looking bays and islets, seeming almost like a tropical paradise after the time spent at the pole, although it was likely still incredibly cold.\n\u003E \n\u003E ![tumblr_np4kokpS4j1r0o48lo1_1280.png](https://41.media.tumblr.com/b0dbbebd287bfb11f24079ecbdfadb80/tumblr_np4kokpS4j1r0o48lo1_1280.png)\n\u003E \n\u003E ![tumblr_np4kvuTIPp1r0o48lo1_1280.png](https://40.media.tumblr.com/d11c8c8d8310dc6d48c9985e6ab6f6be/tumblr_np4kvuTIPp1r0o48lo1_1280.png)![tumblr_np4kvuTIPp1r0o48lo2_1280.png](https://40.media.tumblr.com/6dbde3cec8b3e1e72422d308e24d94ec/tumblr_np4kvuTIPp1r0o48lo2_1280.png)\n\u003E \n\u003E Setting out again, it doesn\u0027t take long at all for them to reach the hill that marks the end of their snowy excursion, they plant a flag, naming this place the \u0022Gateway to the New World\u0022. shortly after they begin their descent, and head towards the edge of the lake. Upon entering the water Tanuna gets out and performs the usual pre-water procedures, removing the steerable wheels, but this time also has to remove the bottom ladder, since there was now only one of them, the increased drag to one side would cause them to edge to one side over time.\n\u003E \n\u003E ![tumblr_np4kokpS4j1r0o48lo8_1280.png](https://41.media.tumblr.com/5f1c542f9d252a2c59c8be322eeb53af/tumblr_np4kokpS4j1r0o48lo8_1280.png)![tumblr_np4kokpS4j1r0o48lo4_1280.png](https://41.media.tumblr.com/66ff3b8608d835cf6c25c0926a526396/tumblr_np4kokpS4j1r0o48lo4_1280.png)\n\u003E \n\u003E As they get moving and start to look around, they are taken aback by how beautiful the place is, for the 4 remaining members of the crew this mission has been an eyeopener into the wonders of their home planet, and they begin to wonder just what it was that fueled the Kerbal obsession with interplanetary travel, when their own was this picturesque? \n\u003E \n\u003E ![tumblr_np4kokpS4j1r0o48lo2_1280.png](https://40.media.tumblr.com/2d2a0cd79f9421ec2e24e0cfe5f8d7b9/tumblr_np4kokpS4j1r0o48lo2_1280.png)![tumblr_np4liwOxdP1r0o48lo1_1280.png](https://40.media.tumblr.com/ccdfee8844e8755d2e9db6650fa0af2b/tumblr_np4liwOxdP1r0o48lo1_1280.png)\n\u003E \n\u003E As they neared the bay that the Sparrowhawk had landed next to, they notice a tiny islet inside it, and decide to land there and plant a flag, so that they can name it after the comrades who they left behind at the Pole, unfortunately none of them are very creative with naming, so they end up setting for \u0022Ludlivia Island\u0022 and promise never to speak of it again.\n\u003E \n\u003E after a short extra hop over water they reach the Sparrowhawk, which takes off once more into the skies to scout out the next waypoint, the crew make the decision that there should be just enough sunlight left for them to make a final stretch that day , and set off.\n\u003E \n\u003E however they are wrong, because they are so far north the sun sets a lot earlier, and stays a lot lower in the sky, and soon the light is leaving their side of Kerbin, and the final stretch of the drive must be done in the dark, Jeb comes close to crashing on multiple occasions, mostly due to an ingrained determination to go as fast as possible, but thankfully they make it to the waypoint unharmed, submit a mission report to the KSC, and settle down for the night, in the morning they will continue off to find the ISRU Probe that has been left along their path, to refuel for what should hopefully be the last time before reaching the South Pole, and the base that is planned to have been constructed for their arrival.\n\u003E \n\u003E ![tumblr_np4liwOxdP1r0o48lo3_1280.png](https://41.media.tumblr.com/79937e3bf476b76c2495199fc1ba08f4/tumblr_np4liwOxdP1r0o48lo3_1280.png)![tumblr_np4liwOxdP1r0o48lo4_1280.png](https://41.media.tumblr.com/1145e354c649cd9e824dbc218fea1817/tumblr_np4liwOxdP1r0o48lo4_1280.png)\n\u003E \n\u003E -----------------------------\n\u003E \n\u003E So from the viewers point of view, it probably looks like not a lot happened in this installment of my journey, but for me, it was one of the most enjoyable bits, the scenery was just beautiful, the going enjoyable, while I loved the ice caps, too much of the same thing begins to get boring, especially when it is a perfectly flat expanse in all directions, so it made a welcome change to drive over some different landscapes.\n\u003E \n\u003E while the crew were sleeping I got a lot of background stuff done, as was mentioned above, what wasn\u0027t mentioned is that I also sent a plane around to rescue all the kerbals who had been ditched along the way (Zely, the pilots of the Barracuda and the pilot of the other supply ship for the polar base that I never showed you guys). I also didn\u0027t mention how glad I am that I am not attempting this challenge with my initial entry, the Polar Explorer, over the space of 8 hours of game time the thing used up 4500 units of liquid fuel, and only moved **100km** . that is the slowest I think I have ever gone on KSP.\n\u003E \n\u003E I also didn\u0027t mention that during that last stretch the game crashed about 10 times, it seems something is causing memory problems with the Banzai! itself, I have cut down my mod list, moved the save over to a fresh install and am hoping and praying this has fixed the issue, I believe it is something to do with moving a lot of items around it with KIS, but I can\u0027t be sure, once it is mornign again I will drive it and find out I guess!\n\u003E \n\u003E ----------------------------\n\u003E \n\u003E \n\nso we have made it a long way by now! I thought it was time to add a map of all my flags:\n\n![tumblr_np4mbgwhjf1r0o48lo1_1280.png](https://41.media.tumblr.com/5fa7b8f3a557b56742f7b71cb1f31f0f/tumblr_np4mbgwhjf1r0o48lo1_1280.png)\n\nit\u0027s funny you can see the patch where I didn\u0027t lay any flags up by the pole, that is when I was rushing to get to the anomaly, I got a bit too into Jebs mindset and didn\u0027t pay attention, lay no flags, and then crashed at the end of it, the first flag after that is where the wreckage of the Banzai! MkI is.\n\n-------------\n\n\u003E \n\u003E That next morning marked the 7th day of the Banzai! excursion. and a huge amount of progress had been made, especially when considering the 3 days spent on the Ice Caps.\n\u003E \n\u003E As the Sparrowhawk took to the skies again in search of the ISRU Probe ahead of them the Banzai set off, driving for a short while before coming across two small lakes in an indent in the terrain. they stopped for a short while and planted a flag, naming it Twin Lake Point.\n\u003E \n\u003E ![tumblr_np60x8X39a1r0o48lo2_1280.png](https://36.media.tumblr.com/6c67bddbd56bb41429fb736f4282823f/tumblr_np60x8X39a1r0o48lo2_1280.png)\n\u003E \n\u003E *I just noticed Minmus is there as a dot in the background*\n\u003E \n\u003E ![tumblr_np60x8X39a1r0o48lo1_1280.png](https://40.media.tumblr.com/ae587ee895d6ae90d7065e109b3eac9a/tumblr_np60x8X39a1r0o48lo1_1280.png)\n\u003E \n\u003E Shortly after leaving the lakes Jeb\u0027s concentration wavers, and he takes the top of a slope at speed, exploding one of the steerable wheels up front, while the steering seems largely unaffected, and there is no tendency to edge in one direction, Tanuna decides to remove the remaining wheel on the other side in solidarity with the one that was lost.\n\u003E \n\u003E ![tumblr_np60x8X39a1r0o48lo5_1280.png](https://41.media.tumblr.com/7429072ddaded50d6ed85bfc905b75d1/tumblr_np60x8X39a1r0o48lo5_1280.png)after another half a day\u0027s driving the Banzai! rolls into sight of the ISRU Probe and the Sparrowhawk, and it quickly becomes apparent that the KSC has not thought this plan through, the probe is unable to operate both drills at the same time, and even if it could, it would be days before it had gathered enough fuel, the problem with dropping a mining probe down by parachute it seemed was that the concentration of ore at the landing site could not be guaranteed.\n\u003E \n\u003E The crew decide that since they would have to radio Mission Control anyway to request a replacement wheel, this would be a good chance to also notify them of the ISRU\u0027s failure and request a more conventional refueling.\n\u003E \n\u003E After they had initiated radio contact and explained the situation, Gene Kerman laughs and admits to them that the whole thing was just an experiment anyway, and they were the guinea pigs, they had known from the start that there was a high likelyhood of faliure, but wanted to test the technique out in a \u0022live-fire\u0022 situation.\n\u003E \n\u003E after a short conversation it is agreed that a craft would be shipped out, containing replacement wheels, fuel, an extra reaction wheel to help with control in water and 2 new crew members to accompany them to the South Pole base. since Ludley and Olivia had been assigned to the science team there, but had instead been reassigned to UFO observation on the other side of the planet, 2 new scientists were required for the base, and it was decided they would be taken there in the Banzai!\n\u003E \n\u003E ![tumblr_np60x8X39a1r0o48lo6_1280.png](https://41.media.tumblr.com/360bf7ee5f304841b6b79e8c238527c0/tumblr_np60x8X39a1r0o48lo6_1280.png)\n\u003E \n\u003E ![tumblr_np61ornHc11r0o48lo2_1280.png](https://41.media.tumblr.com/9b2e00e8c629bb84b3b198a27f21b064/tumblr_np61ornHc11r0o48lo2_1280.png)\n\u003E \n\u003E ![tumblr_np61ornHc11r0o48lo1_1280.png](https://40.media.tumblr.com/aa279d14c2dbdb5475590bfdff772a52/tumblr_np61ornHc11r0o48lo1_1280.png)\n\u003E \n\u003E The new crew introduced themselves as Gweniella and Soning, freshly graduated from the Academy.\n\u003E \n\u003E Finally the Sparrowhawk took to the skies once more to find their final destination for the day, and picked a spot nestled at the foot of a nearby mountain, the Banzai!s drive there was relatively uneventful and soon they had reached their destination just as night was falling.\n\u003E \n\u003E The crew awoke at first light, feeling refreshed, they decided to get an early start and headed out just as the sun started to rise over the mountain.\n\u003E \n\u003E they made incredibly good time on this stretch of the voyage, the landscape being mainly flat grassland, with just some mountains in the distance to add some intrigue to the horizon. After around 150km they reached a lake, and decided to stop for a group photo with the new crew members of the team.\n\u003E \n\u003E ![tumblr_np61xjDEFG1r0o48lo4_1280.png](https://40.media.tumblr.com/4849ea9097a59bf4db09e6f6172c449f/tumblr_np61xjDEFG1r0o48lo4_1280.png)\n\u003E \n\u003E ![tumblr_np61xjDEFG1r0o48lo1_1280.png](https://36.media.tumblr.com/454ef476997e4f2d958a3610003fad22/tumblr_np61xjDEFG1r0o48lo1_1280.png)*I don\u0027t even have any expectations for you any more Jeb...*\n\u003E \n\u003E the next section of the drive goes past quicly, a huge distance is covered, perhaps more than on any other day of the journey, until...\n\u003E \n\u003E *Jeb isn\u0027t paying attention, it has grown darker in the sky and he has caught sight of Minmus in the sky, ever since he was a kid he\u0027s loved staring up at the tiny moon and wondering if he\u0027d ever get to go there. as he looses himself in thought , his hand stays on the throttle, and the Banzai! continues to accelerate, climbing a hill, cresting it at speed, and flying into the air. The force brings Jeb out of his daydream, he feels the craft flipping over, if they land on their heads this will be the end for all of them, and so, flipping on the SAS, he throws all his weight into the joystick control, attempting a roll. the Banzai! begins to tilt back the right way up, but a pontoon hits the ground, shearing away from the main vessel, and exploding behind them, they flip over again, and land on their rear, the backs of the pontoons both explode, they flip again, and miraculously land back on the remaining wheels.*\n\u003E \n\u003E ![tumblr_np61xjDEFG1r0o48lo2_1280.png](https://40.media.tumblr.com/bfa0cf2be2f583a3bb90b079b67923f0/tumblr_np61xjDEFG1r0o48lo2_1280.png)\n\u003E \n\u003E after a quick systems check, they discover that the Banzai! is still driveable, and continue on their journey... Night falls shortly afterwards, and the going is slow, eventually, still 70km away for their rendevous with the Sparrowhawk, they decide to call it a night. As they are preparing to radio KSC to ask for assistance, Jeb stops them, he has turned a pasty yellow colour, and begs them not to tell them about the Banzai!, it is still driveable, and he is convinced that if they find he\u0027s broken another Banzai! within a few days of the first they will fire him, or at least take him off the mission.\n\u003E \n\u003E after some persuasion, the crew agree, they will travel as far as they can in the damaged Banzai!, but once they reach water, or encounter some other problem, Mission Control must be notified, and a replacement must be sent out. Jeb agrees, relieved to not have to face Gene\u0027s wrath tonight....\n\u003E \n\u003E *------------------*\n\u003E \n\u003E *sooooooo I broke another Banzai!*\n\u003E \n\u003E yes I know, that\u0027s 2 broken now, however we have made it to the equator! that means we are at the half way point, if we keep going like this we\u0027ll loose another one at the start of the South Pole and yet another moments before reaching the KSC ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) but hopefully that will not be the truth of it, I am going to be more careful in future....\n\u003E \n\u003E still though, its a miracle the thing still drives, its lost over half of the right pontoon, 2/3 air intakes, and one of the airbrakes, but nothing that is absolutely vital is broken.\n\u003E \n\u003E ------------------\n\u003E \n\u003E \n\nafter those two days of travel the Banzai! Has reached the equator!\n\nhere\u0027s the map:\n\n![tumblr_np63pjQqHl1r0o48lo1_1280.png](https://40.media.tumblr.com/58f11b17306ed6967540b95425b5337b/tumblr_np63pjQqHl1r0o48lo1_1280.png)\n\n-----------------\n\n\u003E \n\u003E As a new day dawns the crew of the Banzai! are in low spirits, they had made such good time the day before, but with the day ending in disaster, and knowing that they were going to have to continue on with half of their vehicle trashed today, things did not seem good.\n\u003E \n\u003E however as they set out, they realized that a broken craft added its own strange sense of enjoyment to the journey. Soon they were joking and laughing about the whole thing, and found that while they were not moving at nearly the speed they had been previously, the fact that they were moving at all was incredible in itself.\n\u003E \n\u003E ![tumblr_np8ef06kVy1r0o48lo1_1280.png](https://41.media.tumblr.com/00c6d45eea8ae24037dcdb769a403432/tumblr_np8ef06kVy1r0o48lo1_1280.png)\n\u003E \n\u003E After about an hour they finally reached the Sparrowhawk, sitting at the edge of a lake that they had planned to cross.\n\u003E \n\u003E Looking at the Banzai! , none of the crew thought for a second it would float, but the only other option was to travel over ground so rough it would almost certainly destroy the Banzai! in its current state, so the decision was made to attempt a crossing.\n\u003E \n\u003E Edging into the water, Jeb tried to ease the Banzai! in in such a way that he might still have some chance of getting it back out again if something were to go wrong. And yet, miraculously, the thing floats! It was sitting low in the water, and clearly was so asymetrical that moving in a straight line would be a struggle, but an extra reaction wheel had recently been added, and the crossing was not so large that they had to move at full thrust, so there was hope yet.\n\u003E \n\u003E ![tumblr_np8ef06kVy1r0o48lo2_1280.png](https://40.media.tumblr.com/889eb9c1483b7bb290d87951d083f356/tumblr_np8ef06kVy1r0o48lo2_1280.png)\n\u003E \n\u003E The going is slow, maxing out at 10m/s, but having heard Valentina\u0027s accounts of the Polar Explorer they know that this is the max speed of the Explorer while it is fully functional, so they count their blessings.\n\u003E \n\u003E reaching the other bank, the find that it is really rather steep, and have to put some real engine power in just to rise up the slope. but they persevere,\n\u003E \n\u003E however the sun is already getting low in the sky, and they have made almost no progress today, and the water crossing used a lot of fuel.\n\u003E \n\u003E after a short drive they decide it is too dangerous to continue driving at night and make camp, naming the pace Munwatch Point because of how clear the Mun was in the sky. \n\u003E \n\u003E ![tumblr_np8ef06kVy1r0o48lo3_1280.png](https://41.media.tumblr.com/77d7b880bef0bb2ab6635f116dfbc4ca/tumblr_np8ef06kVy1r0o48lo3_1280.png)*and yet I managed to take the screenshot from the wrong direction to include the Mun, sometimes I wonder about myself...*\n\u003E \n\u003E \n\u003E \n\u003E When the new day dawned, the crew discussed their options. Jeb refused to drop his \u0022lets not tell anyone\u0022 stance, Bill, Sigley and Tanuna all agreed from an engineering standpoint that continuing in the Banzai! with it in this state was suicide, and Gweniella \u0026 Soning decide they will go with which ever decision gave them the best chance of survival.\n\u003E \n\u003E After what seemed like hours of Jeb pleading, they agreed to continue, but only until they met the Sparrowhawk, from there they would call the KSC and request a new Banzai!\n\u003E \n\u003E The going was tough, and they rarely reached speeds greater than 25m/s but after half a day they were there. The Sparrowhawk had set down in the middle of 3 lakes, and the scene was so picturesque they almost forgot about their worries.\n\u003E \n\u003E Those worries did not stay forgotten for long however, the way down to the lake was steep and attempting to break caused the Banzai! to swerve. It took all of Jebs concentration to keep the Banzai! headed straight while still bleeding off enough speed to not crash at the bottom. after a while they make it, and Call the KSC, who are not nearly as angry as Jeb has expected, it seems they were prepared for the eventuality that many more Banzai!s than this might be destroyed, which did nothing to instill confidence in the crew.\n\u003E \n\u003E ![tumblr_np8ef06kVy1r0o48lo4_1280.png](https://40.media.tumblr.com/b8660dd578b21c2061f33109ba01f567/tumblr_np8ef06kVy1r0o48lo4_1280.png)\n\u003E \n\u003E ![tumblr_np8ef06kVy1r0o48lo6_1280.png](https://40.media.tumblr.com/d2bded41480d5b59cada2b650540251c/tumblr_np8ef06kVy1r0o48lo6_1280.png)\n\u003E \n\u003E as the Banzai! MkIII came into view over head their spirits were raised, and everyone stared hooting and running around, but as the wings decoupled to initiate decent, it was clear things were not going right, the wings stayed spiralling around dangerously close to the Banzai!, and they were convinced a collision was imminent.\n\u003E \n\u003E \n\u003E \u003E [Javascript is disabled. View full album](//imgur.com/a/a80PN)\n\u003E \n\u003E \n\u003E Crisis averted (just!) the \u0027chutes deploy, and the second issue with the landing becomes apparent: the banzai is heading down fast and at an angle still, with the engines pointing towards the ground, the Remote Control Unit\u0027s systems try to cut \u0027chutes to even it out, which helps some what, but speeds them up more, and soon they crash into the ground, loosing an engine.\n\u003E \n\u003E Thankfully their injured Banzai! still had all 3 of its engines, and so Tanuna transfers one onto the new craft, helped out by Soning with some of the heavy lifting.\n\u003E \n\u003E ![tumblr_np8ef06kVy1r0o48lo7_1280.png](https://40.media.tumblr.com/9f0ac0d4b3a982624c7a17df0027fb87/tumblr_np8ef06kVy1r0o48lo7_1280.png)![tumblr_np8ef06kVy1r0o48lo8_1280.png](https://40.media.tumblr.com/f0aa26389ab4d709841ad237ab2e5df3/tumblr_np8ef06kVy1r0o48lo8_1280.png)\n\u003E \n\u003E With everyone transferred, they drive off, and quickly see the advantages of the new craft, it is lower to the ground which gives it vastly improved balance, and they are travelling at speeds they wouldn\u0027t have even considered in the damaged MkII, as they drive off, they know the improvements are going to be of great help to them in the journey ahead....\n\u003E \n\u003E ![tumblr_np8ef06kVy1r0o48lo10_1280.png](https://40.media.tumblr.com/94211a51994cee5f68625d5f31bed98b/tumblr_np8ef06kVy1r0o48lo10_1280.png)\n\u003E \n\u003E ---------------\n\u003E \n\u003E I should note that the real reason I chose that moment to change the Banzai! was that something glitched with my FSfuelswitch after I reloaded the database back at the KSC ( while adding karbonite) which resulted in all my tanks reverting to LiquidFuel/Oxidizer, even after multiple restarts.\n\u003E \n\u003E The new Banzai! is lower to the ground, has more reaction wheels, and some air intakes on the pontoons for added buoyancy, the changes may seem minor, but in testing they made a huge difference! hopefully less crashing will happen there (I just jinxed it didn\u0027t I?)\n\u003E \n\u003E --------------\n\u003E \n\u003E \n\nSoooo we are off again in the new Banzai! still just past the equator though even after 2 days of driving, but we will be making better time now (except that a detour is coming up!)\n\n![tumblr_npbopy4kO91r0o48lo1_1280.png](https://40.media.tumblr.com/b49c30bebc7c2456aa09028e2771c7ca/tumblr_npbopy4kO91r0o48lo1_1280.png)\n\n----------------\n\n\u003E \n\u003E Setting off in the morning, the was feeling excited about the day ahead of them, their planned detour destination was approaching, and they had be informed of it\u0027s beauty over the past few days.\n\u003E \n\u003E It doesn\u0027t take long for them to reach it, cresting a hill they see a lake feeding into a river than runs through a ravine between two gigantic mountain ranges. the view blows them away, and it takes them a while to remember what they are here to do.\n\u003E \n\u003E Setting out again, they descend the steep hill hill towards the lake, having to go incredibly slowly to avoid tipping head over heels since the slope is in the region of 60-70 degrees.\n\u003E \n\u003E ![tumblr_npbp1eFQJG1r0o48lo3_1280.png](https://40.media.tumblr.com/b3c9920a72a377ad43c9a0478c1181f2/tumblr_npbp1eFQJG1r0o48lo3_1280.png)\n\u003E \n\u003E ![tumblr_npbp1eFQJG1r0o48lo2_1280.png](https://40.media.tumblr.com/5a621890b919de924b4f747b798c07c8/tumblr_npbp1eFQJG1r0o48lo2_1280.png)\n\u003E \n\u003E setting off into the water, they set the Banzai! to head for the shore opposite and further towards the river\u0027s start, where they take remote control of the Sparrowhawk and enjoy flying it through the canyon, in awe of the beauty of the place.\n\u003E \n\u003E ![tumblr_npbp1eFQJG1r0o48lo5_1280.png](https://36.media.tumblr.com/399a0b753cb4cab0b0e293862d2092d3/tumblr_npbp1eFQJG1r0o48lo5_1280.png)\n\u003E \n\u003E ![tumblr_npbp1eFQJG1r0o48lo6_1280.png](https://36.media.tumblr.com/2f80eb54f41d371a564a8cbeb1b4f72a/tumblr_npbp1eFQJG1r0o48lo6_1280.png)\n\u003E \n\u003E Setting the Sparrowhawk down on an low outcropping of land the crew decide that it is time they navigated the canyon themselves. They are surprised to find the river thins out and goes underground for a short while, forcing them to go over a land bridge instead, having heard stories of a \u0022freshwater kraken\u0022 that lived in the lake, they decide to name the patch of land the \u0022Great Kraken Barrier\u0022 and prayed that it did it\u0027s job.\n\u003E \n\u003E Boating through the canyon was spectactular, but upsettingly shortlived, and soon they were out the other side and setting off on land again. They headed towards a small pass through the mountains, that marked the only passable terrain along the entire range, the going was relatively easy and they were soon there, naming it \u0022Vacuous Plateu\u0022 after the craft that had recently completed a similar circumnavigation, but by sea instead.\n\u003E \n\u003E From there they headed down out of the mountains and towards the coast, deciding to follow along it until nightfall, where they would rest for the night and then head across the sea to the poles.\n\u003E \n\u003E ![tumblr_npbpgnh4MU1r0o48lo3_1280.png](https://41.media.tumblr.com/1de9b0b1fc738e1f58f06e93f5997d17/tumblr_npbpgnh4MU1r0o48lo3_1280.png)\n\u003E \n\u003E *Departing the mountains*\n\u003E \n\u003E ![tumblr_npbpgnh4MU1r0o48lo2_1280.png](https://40.media.tumblr.com/6037a1fe5b0415cab56dc24e0b9e875d/tumblr_npbpgnh4MU1r0o48lo2_1280.png)\n\u003E \n\u003E *Bill posing for the camera at Vacuous Plateau*\n\u003E \n\u003E ![tumblr_npbpgnh4MU1r0o48lo1_1280.png](https://40.media.tumblr.com/23cbb8bfaa9dc355d8b52734e13e883a/tumblr_npbpgnh4MU1r0o48lo1_1280.png)\n\u003E \n\u003E *Departure Bay, the final bit of solid land before the poles.*\n\u003E \n\u003E \n\u003E \n\u003E That night, during their usual report back to Mission Control, Gene informs them that the Sparrowhawk has scouted out a major problem they will have to overcome: the ice cap is raised over 30 meters out of the water, a solid cliff face of ice stretching for hundreds of kilometers. He informs them not to worry too much however, they have formulated a plan and were going to begin implementing it that night, hoping to have it complete by the time they arrived there.\n\u003E \n\u003E And so, come morning they set out for the largest sea voyage of their mission so far, the going is easy and uneventful, until they begin to get closer to the ice caps and begin to wonder just what is this solution to climbing the cliff face Mission Control has come up with? \n\u003E \n\u003E Those thoughts are put aside shortly afterwards though as they find they have a more pressing issue: they are running out of fuel, by their calculations they will have just about enough to make it to the ice cap, but crossing it to the base on the other side to refuel is another matter.\n\u003E \n\u003E As they arrive at the caps they begin to realize just what this plan Gene has come up with is as they see a large crane erected on the edge of the cliff, with two winches set up off to one side. \n\u003E \n\u003E After shouting up to the engineer at the top called Hermes, they are told to wait until final preparations are finished. Night begins to fall, and it is a while until Hermes shouts back down to get in position under the crane to begin magnetic capture and assent.\n\u003E \n\u003E \n\u003E \u003E [Javascript is disabled. View full album](//imgur.com/a/RYx9A)\n\u003E \n\u003E \n\u003E The way up is terrifying, and they are left hanging on the crane for a good 5 minutes as hermes attaches up the winches and begins drawing them in over the edge of the cliff, as they approach they notice the frontal winch structure bowing worryingly, and it nearly snaps, but just as it is about to, they are over the edge! Deploying the wheels they quickly accelerate away from the edge before they are dragged back over due to the slippery surface.\n\u003E \n\u003E After things have settled down, they decide that was plenty enough excitement for one day and settle down to sleep.\n\u003E \n\u003E ------------------------------\n\u003E \n\u003E So this was the most fun I think I have had on the whole journey (and that\u0027s saying something!) the beautiful scenery of the canyon combined with the engineering intrigue of building a device to lift the Banzai! up the cliff just made it perfect, but not without its difficulties and glitches. Building that setup was a nightmare, surface attachment parts have a tendency to explode when dropped on the floor with KIS and a lot of the parts were too big to carry so they had to be leapfrogged from the plane to the edge of the cliff since the plane couldn\u0027t go near the cliff without being sucked off the edge by what I assume is the game simulating slippery ice.\n\u003E \n\u003E but it got done! we are here! now onwards to the proper south pole and then to the base I have set up (this was what the Polar Explorer\u0027s mission was, but you will see that that did not come to pass, the Polar Explorer glitched horrendously and it took me an hour of trying to salvage the mission before I decided to just recover it from the tracking station)\n\u003E \n\u003E -----------------------------\n\u003E \n\u003E \n\nWE\u0027RE AT THE POLE!\n\nRunning low on fuel (both the Sparrowhawk and the Banzai!) I think I\u0027m going to have to try ballancing fuel between the two because i reckon between them they have pretty much exactly enough to get the the base on the other side of the poles (which will be interesting to see in itself), all of that will be updated when I can next be bothered, along with a map of the progress, for now I am exhausted and just writing this was difficult so it\u0027ll all have to wait.\n\n**Edited \u003Ctime datetime=\u00222015-06-02T15:43:00Z\u0022 title=\u002206/02/2015 03:43  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 2, 2015\u003C/time\u003E by Squiggsy**"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-26T14:00:24Z","Content":"Good luck on this new venture. I quite like your vehicle."},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T14:33:47Z","Content":"\u003E \n\u003E Good luck on this new venture. I quite like your vehicle.\n\nthank you! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) I think it\u0027s my favorite stock craft that I\u0027ve built apart from maybe the hummingbird refueler from my previous attempt (because purposfully blowing apart an aeroplane mid flight as a method of landing is just the most kerbal thing ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif))\n\nand good luck on yours, I have been enjoying reading through your logs, you\u0027ve got a nice little voyage going on there\n\nedit: haha that reminded me to read your 6th installment and I see I have a shoal named after me! I feel blessed you\u0027ll have to give me the coordinates so I can go visit it sometime if possible?"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-26T14:38:49Z","Content":"Hullo, fellow circumnavigator! Watch out for glitches... They\u0027ll get you... Over and over and over..."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-05-26T14:41:12Z","Content":"Beware the NaNo virus! It loves mountains. Just a word of advice."},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-26T14:43:34Z","Content":"Circumnavigators stick together! Good luck on your journey!"},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T14:43:54Z","Content":"\u003E \n\u003E Hullo, fellow circumnavigator! Watch out for glitches... They\u0027ll get you... Over and over and over...\n\nhaha thats why I gave up on the old craft I was using and started afresh, so far I have done a lot better at dodging the glitches, my Polar Explorer was just not designed well enough and a lot of the glitches were my own fault (things put in silly places) though many of them seem to be related to buoyancy and loading craft that are splashed down (they seem to like to glitch to 900m underwater then float back to the surface, breaking apart horribly on the way up)\n\nIt is something I hope the devs get the chance to address one day, though i understand its going to be low down on the priority since this is a game about space travel, we just happen to be doing crazy and possibly silly things instead ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\n\u003E \n\u003E Beware the NaNo virus! It loves mountains. Just a word of advice.\n\nso far I have avoided mountains like the plague, though I\u0027m sure there will come a time when I have no choice, i\u0027ve noticed the other thing that happens on mountains (from my experience doing the Mt Keverest challenge) is that the game suddenly goes \u0022No! up is down and down i up! you are going to accelerate up this hill even while you are trying to break! and then spin out of control, because reasons!\u0022, honest I think there are weird gravitational forces at work in Kerbins mountain ranges....\n\n\u003E \n\u003E Circumnavigators stick together! Good luck on your journey!\n\nyes! nice to see that there are so many people attempting circumnavigation, it\u0027s certainly one of the most interesting things I have done in the game, so far in this save I haven\u0027t even entered orbit, I have just explored kerbin and i must say it\u0027s been really rewarding\n\nEDIT: funny I say about having avoided glitches, start up my resupply drone to drop of the lights I forgot to attach in the SPH and a way of siphoning off my oxidizer, try to target the Banzai! and the game crashes, reload, try to target, happens again... seems I\u0027m going to have to navigate there by eye, in the dark...\n\n**Edited \u003Ctime datetime=\u00222015-05-26T14:59:40Z\u0022 title=\u002205/26/2015 02:59  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by Squiggsy**"},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T16:54:10Z","Content":"Part two is up! just a quick interlude, felt like having some fun and testing out a resupply drone, came up with an excuse"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-26T17:33:07Z","Content":"\u003E \n\u003E edit: haha that reminded me to read your 6th installment and I see I have a shoal named after me! I feel blessed you\u0027ll have to give me the coordinates so I can go visit it sometime if possible?\n\nThere are at least 2 pics of the coordinates ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif). Squiggsy Shoal, 40^ 20\u0027 1\u0022 N, 269^ 17\u0027 48\u0022 W.\n\nNOTE: Longitude in KSP is totally hosed, as neither E nor W longitude can exceed 180^ and here we have a 269^. In fact, as I\u0027ve gone around Kerbin, I\u0027ve had my longitude swap back an forth between calling itself E or W and giving very different numbers as the mood strikes it. I\u0027ve got 2 flags on the same headland way back near the start of the trip, not 30km apart, one saying 130^W and the other 230^E. Latitude, however, is reliable. So, what I recommend is to find the western shore of the big Inland Ocean and follow it up to 40^N.\n\n- - - Updated - - -\n\n\u003E \n\u003E Beware the NaNo virus! It loves mountains. Just a word of advice.\n\nWhat is this NaNo virus I keep hearing of?"},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T19:15:00Z","Content":"\u003E \n\u003E There are at least 2 pics of the coordinates ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif). Squiggsy Shoal, 40^ 20\u0027 1\u0022 N, 269^ 17\u0027 48\u0022 W.\n\u003E NOTE: Longitude in KSP is totally hosed, as neither E nor W longitude can exceed 180^ and here we have a 269^. In fact, as I\u0027ve gone around Kerbin, I\u0027ve had my longitude swap back an forth between calling itself E or W and giving very different numbers as the mood strikes it. I\u0027ve got 2 flags on the same headland way back near the start of the trip, not 30km apart, one saying 130^W and the other 230^E. Latitude, however, is reliable. So, what I recommend is to find the western shore of the big Inland Ocean and follow it up to 40^N\n\nThanks for the info ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) I have decided to use this save to give Kerbin back to the Kerbals, like a stock version of KerbinSide, I am going to build bases and airstrips around kerbin, I may not be able to launch from them, but I think it\u0027ll make for a very interesting and different KSP experience, I\u0027ve done so much in this game already in outer space but have hardly spent any time exploring Kerbin!"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-26T20:22:28Z","Content":"\u003E \n\u003E Thanks for the info ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) I have decided to use this save to give Kerbin back to the Kerbals, like a stock version of KerbinSide, I am going to build bases and airstrips around kerbin, I may not be able to launch from them, but I think it\u0027ll make for a very interesting and different KSP experience, I\u0027ve done so much in this game already in outer space but have hardly spent any time exploring Kerbin!\n\nSquiggsy Shoal, sad to say, is probably best suited to being a seismological monitoring outpost as an exile for under-achieving grad students ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)."},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T22:31:12Z","Content":"The first bit of damage has been done!!\n\nThe Banzai! flew after going over the edge of a drop a bit too fast\n\n![tumblr_nozagpcSOf1r0o48lo1_1280.png](https://41.media.tumblr.com/55cef29e0ff3f3c732ccf4d51be7bd06/tumblr_nozagpcSOf1r0o48lo1_1280.png)\n\nluckily the damage is minor and I can carry on as I was, though I will bring a replacement part in the next resupply mission (so glad I chose to use KIS and KAS)\n\n![tumblr_nozagpcSOf1r0o48lo2_1280.png](https://40.media.tumblr.com/17c8123c893614358254e32628ad31c6/tumblr_nozagpcSOf1r0o48lo2_1280.png)\n\nTis but a scratch!\n\nAlso I have added OTS spaceplane parts and MKII stockalike expansion to my modlist in order to design my refueler, which will do a suborbital hop and should be able to get to the Banzai! for the first refueling mission within about 10 minutes! though I still haven\u0027t proofed it for water landings so I sure hope I don\u0027t run out of fuel half way across the stretch I\u0027m about to cross.\n\nanyway I\u0027ll update the OP with the rest of the story tomorrow morning.\n\nEDIT: ouch, no more than a few minutes after the first loss of part, we loose another, rather more vital part:\n\n![tumblr_nozb2qMaq21r0o48lo1_1280.png](https://41.media.tumblr.com/67cbe32ded85ed8bdc3b75022389ead0/tumblr_nozb2qMaq21r0o48lo1_1280.png)\n\nsomehow the thing moves in a better straight line in the water than it was before!\n\n**Edited \u003Ctime datetime=\u00222015-05-26T22:43:29Z\u0022 title=\u002205/26/2015 10:43  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by Squiggsy**"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-26T22:35:48Z","Content":"\u003E \n\u003E Tis but a scratch!\n\nTis but a scratch until suddenly, tis but a smoldering pile of rubble. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nHang in there!"},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T22:50:52Z","Content":"\u003E \n\u003E Tis but a scratch until suddenly, tis but a smoldering pile of rubble. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\u003E Hang in there!\n\nshhhh! I\u0027m trying not to think about the words \u0022bad things happen in 3\u0027s\u0022 but they keep hanging around at the back of my mind"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-26T22:53:49Z","Content":"Oh, boy. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nYou are floating really low on the water, is that normal?\n\nIn my experience with sled-rovers, the next bit to go is usually some gear, a segment of, or an entire sled.\n\nEdit:\n\n![XKKfXo9.jpg](http://i.imgur.com/XKKfXo9.jpg)\n\nI never rode so low..."},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-26T22:59:08Z","Content":"\u003E \n\u003E Oh, boy. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\u003E You are floating really low on the water, is that normal?\n\nyeah for some reason while I was testing it it floated fine, then as soon as I set out, reached my first stretch of water and entered, it sat like this :\\ , although i think it has got worse since loosing that nosecap at the back, and i get occasional loud splashes from that side, but for the most part it runs fineeeeee , its fineee, don\u0027t think about it and it\u0027ll be fineeeee."},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-27T00:52:59Z","Content":"Next part of the journey is up! this one was rather a bit longer than the others, a lot happened in a short space of time, I didn\u0027t put everything into this part I decided to split it up, I\u0027ll continue my voyage and post another update this evening/tomorrow ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n**Edited \u003Ctime datetime=\u00222015-05-27T08:46:10Z\u0022 title=\u002205/27/2015 08:46  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Squiggsy**"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-05-27T10:35:51Z","Content":"\u003E \n\u003E Next part of the journey is up! this one was rather a bit longer than the others, a lot happened in a short space of time, I didn\u0027t put everything into this part I decided to split it up, I\u0027ll continue my voyage and post another update this evening/tomorrow ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nDo you have a night shift driver? Or are there no lights [or not enough] on your vehicle? Then again, I\u0027ve heard that the NaNo virus kinda likes the dark..."},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-27T12:04:03Z","Content":"\u003E \n\u003E Do you have a night shift driver? Or are there no lights [or not enough] on your vehicle? Then again, I\u0027ve heard that the NaNo virus kinda likes the dark...\n\nNah there are plenty of lights for if they don\u0027t reach their intended destination before nightfall, but only Jeb is qualified to drive the Banzai! and he needs his beauty sleep ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nIn all honestly I\u0027ve done it like this because then I have the night free to navigate support craft around (you\u0027ll see some of that in the next part) such as refuelers and the Sparrowhawk and try to squeeze a bit of extra distance out of the Polar Explorer to try to get them to the South Pole and start setting up a base in time for the Banzai!\u0027s arrival. I\u0027m currently approaching the North Pole so I\u0027m still half a world away, but the Polar Explorer moves VERY slowly, I am so glad I changed over to the Banzai!, it picks up quite some speed\n\n![tumblr_np0c3sxkX81r0o48lo1_1280.png](https://41.media.tumblr.com/67d2e99601b2afdf942ea10a7892578f/tumblr_np0c3sxkX81r0o48lo1_1280.png)\n\nalthough I had a VERY scary moment shortly after that, and limited myself to 60m/s max (which I have found it stays safe at even on rough terrain)\n\n![tumblr_np0c3sxkX81r0o48lo2_1280.png](https://41.media.tumblr.com/54c2dd5861084ae6bb011084a275435e/tumblr_np0c3sxkX81r0o48lo2_1280.png)\n\n*THE TREE, WATCH OUT FOR THE TREE!*\n\nboy am I glad you can\u0027t crash into trees"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-27T15:11:47Z","Content":"Honored to have a lake named after me, and glad the Kraken Trees didn\u0027t ruin your day."},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-27T15:48:31Z","Content":"\u003E \n\u003E Honored to have a lake named after me, and glad the Kraken Trees didn\u0027t ruin your day.\n\nhaha after the kraken trees arrival i couldn\u0027t have named it anything else! yeah for me the opposite happened to with you, the game was glitching and lagging and eventually crashed, when I reloaded, suddenly trees! and the game was running just fine\n\nI\u0027m going to put the next section up shortly, in the first bit, which was the last stuff i did last night, lots happens, then most of today was pretty tedious going over grassland at about 60m/s, planting flags every 30km or so to pass the time, but from there on... well things are getting interesting that\u0027s for sure!\n\nhonestly I am enjoying this adventure so much more than I expected to when I started it\n\n**Edited \u003Ctime datetime=\u00222015-05-27T15:51:03Z\u0022 title=\u002205/27/2015 03:51  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Squiggsy**"},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-27T17:33:32Z","Content":"[The new part of my journey is up](https://forum.kerbalspaceprogram.com/threads/123141-Banzai%21-A-Circumnavigation-of-Kerbin-%28Elcano-Challenge%29?p=1972696\u0026viewfull=1#post1972696), and I have finally met true disaster (it was only a matter of time) the Banzai! is wrecked at the North Pole, thankfully (and quite miraculously) all crew survived, and I am working on finding a way to ship a replacement out there, we were so close to the Saucer at the pole too!\n\nI find it quite funny that this post comes after my \u0022hey look at how fast the Banzai! can go without crashing!!!\u0022 it seems I got too used to the speed and carried it over to hilly terrain, that was never going to end well..."},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-27T20:23:57Z","Content":"Oh, no! You\u0027ve lost one!\n\nLemme see... I\u0027ve lost, oh, five?\n\nMaybe more in the testing. In any case, building a plane around the Banzai! will probably be your best bet. I\u0027m my case it was easier, because the *Dawn Racer* can fly under its own power. All I did was put extra fuel, some engines and two wings on a radial decoupler attached to the top of the ship.\n\nLanding afterwards is the real challenge. I\u0027m planning on separating the rover at around 1,000 meters, and gliding down as slow as I can. If that doesn\u0027t work... well. ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-05-27T20:32:20Z","Content":"You pretty much described exactly what I\u0027m doing!\n\n![tumblr_np0zj1t6UC1r0o48lo1_1280.png](https://36.media.tumblr.com/86ebd8199ebcc108d8f1518abc02599d/tumblr_np0zj1t6UC1r0o48lo1_1280.png)\n\nI\u0027m using the jets because testing with turbo jets just didn\u0027t work, you need to get over mach 1 for the turbos to be efficient enough to justify them, and the drag of the Banzai! is just too much to ever hope to reach that speed (seriously, i tried with 6 turbojets and couldn\u0027t even get close) so now I am trundling along with 4 jets along with the two straight firing jets from the Banzai! itself.\n\nThe only problem is that this means I am travelling at 150m/s the whole way, which is only 2/3 times faster than I went over land. Although now I\u0027m going as the.. kerbal flies, instead of the wiggly route around the mountains I went before, should be there by daybreak!\n\nedit: oh I am using parachutes though, advantage of KIS is that I can just remove them once it lands so it wont bump my part count up at all\n\nedit again: ahahahahahahaha as I look down into the bottom corner of my screen I realize something important, I forgot to remove the crew, I have me 2 kerbals who have hitchhiked along for the ride, thankfully I planned to set up a base at the UFO and leave Olivia and Luden there to do science stuff anyway so I guess they can be the replacements? not sure how i\u0027m going to get them from the wreck to the UFO though, might have to work some KAS magic if possible\n\n**Edited \u003Ctime datetime=\u00222015-05-27T21:01:52Z\u0022 title=\u002205/27/2015 09:01  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Squiggsy**"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-28T03:01:36Z","Content":"Too bad about Banzai #1, just glad nobody was hurt.\n\nI have installed but not really messed with KAS/KIS so was fascinated by your ability to replace a lost engine. Were you able to snap it on the nodes or did you have to eyeball it?\n\nAnyway, your solution to delivering the replacement is the same as my own contingency plan should I need another VACUOUS. Bolt on some wings and stuff until it flies ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)."}]}