{"TopicId":112688,"ForumId":51,"TopicTitle":"Mad Max War Rig Style Elcano Attempt","CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-11T17:57:12Z","PageNum":1,"Articles":[{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-11T17:57:12Z","Content":"So, I saw Mad Max: Fury Road and figured the war rig in it would be a pretty good basis for an Elcano Challenge submission. Turns out it probably wasn\u0027t, but I\u0027m trying anyway:\n\n**The Plan**\n\nI\u0027m going for a polar circumnavigation to avoid all water crossings and because I want an excuse to go to the south pole. This will all be in stock because my computer crashes enough as it is without any mods installed.\n\n**The Craft**\n\nMeet the LandVoyager 1, 90 tonnes of rocket fuel and exploding wheels:\n\n![ekOVaQU.jpg](http://i.imgur.com/ekOVaQU.jpg)\n\nIt\u0027s comprised of a truck for engines and steering, a service module with lab, comms (pointless, seeing as I\u0027m in sandbox) and fuel for the fuel cells, a habitation module with plenty of space for the 8 crew, and a trailer to carry the missions recon plane. \n\nIn all it comes to 239 parts, 24 wheels, and a whole bunch of structural failures.\n\nI\u0027ve designed it to be as self sufficient as possible so it has ladders that allow kerbals to go between modules and engineers to fix wheels without the truck even stopping.\n\nIt turned out to be even more of a brick than I expected, turns are difficult and stopping is not advised. The Klaws like to fall off and the wheels, despite their listed 150m/s impact tolerance, keep exploding everywhere.\n\n**The Crew**\n\nI took 8 crew so the drivers could take shifts and my stupidly big habitation module would seem less useless.\n\nPilots:\n\nJebediah Kerman\n\nValentina Kerman\n\nMauvy Kerman\n\nEngineers:\n\nBill Kerman\n\nTirigh Kerman\n\nHiltina Kerman\n\nScientists:\n\nBob Kerman\n\nMiredith Kerman\n\nThere is a Mk2 passenger cabin for every two kerbals and two hitchhikers for imaginary recreation/excercise.\n\n- - - Updated - - -\n\n(Reserved for progress update type things)"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-06-11T18:06:33Z","Content":"Epic rover, good luck! Be sure to get screens of all the explosions. Will you be using the plane to scout?"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-11T18:24:25Z","Content":"\u003E \n\u003E Epic rover, good luck! Be sure to get screens of all the explosions. Will you be using the plane to scout?\n\nYeah, I was originally planning to pretty much just leave it to drive itself but the rover is so uncooperative I\u0027m going to have to put in a lot more actual piloting than I thought so there\u0027ll be lots of screenshots. The plane is there partly for scouting but mainly for when I get bored of just driving around for ages and for fancy birds-eye screenshots.\n\nI don\u0027t suppose you know a way around the no quicksaving when moving over the surface rule? Having to stop every time I want to save makes all the bug-induced exploding all the more painful."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-06-11T19:34:38Z","Content":"\u003E \n\u003E I don\u0027t suppose you know a way around the no quicksaving when moving over the surface rule? Having to stop every time I want to save makes all the bug-induced exploding all the more painful.\n\n No, i don\u0027t... though I\u0027ve heard tell of scripts that auto-copy your persistence file every so often, which would give you some protection."},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-06-11T19:44:51Z","Content":"\u003E \n\u003E No, i don\u0027t... though I\u0027ve heard tell of scripts that auto-copy your persistence file every so often, which would give you some protection.\n\nNot really. Autosaves only happen in stable situations; no acceleration or surface movement. You still have to stop for safety from time to time.\n\nI hope you do know that neither a pure land nor a pure water circumnavigation is not possible on Kerbin."},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-11T19:53:29Z","Content":"\u003E I hope you do know that neither a pure land nor a pure water circumnavigation is not possible on Kerbin.\n\nWait, does that include a very indirect polar one? I thought I saw a completely dry route but I might have missed a bit\n\n- - - Updated - - -\n\n\u003E \n\u003E No, i don\u0027t... though I\u0027ve heard tell of scripts that auto-copy your persistence file every so often, which would give you some protection.\n\nThanks, that would be exactly what I want if it works, I\u0027ll try one of those scripts next time I do more of this mission"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-11T20:35:58Z","Content":"Well, here\u0027s leg 1 of the trip, which it turns out or may or may not be possible. Oh well, Jeb\u0027s so excited for a road trip I might as well try anyway.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/%5B/color%5DM6WgP%5Bcolor=#333333%5D)"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-06-11T20:47:16Z","Content":"That is the most amazing rover I have ever seen. Good luck!"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-11T20:48:31Z","Content":"\u003E \n\u003E That is the most amazing rover I have ever seen. Good luck!\n\nThanks!!"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-11T22:46:14Z","Content":"\u003E \n\u003E Wait, does that include a very indirect polar one? I thought I saw a completely dry route but I might have missed a bit\n\nLook at [KerbalMaps](http://www.kerbalmaps.com/).\n\nThere are neither water-free nor land-free circumnavigation routes on Kerbin, strange as that may sound. The issue is that Kerbin only has 1 super-continent which is draped over the north pole, from which 3 huge subcontinents extend southward. Only 1 of these reaches the south polar ice and KSC isn\u0027t on this one. Thus, you can cover the full distance and see both poles while keeping your feet totally dry, but you have to traverse the same subcontinent twice to do it instead of actually circumnavigating Kerbin. As for going by boat, this same pole-to-pole subcontinent has to be crossed at some point.\n\nAnyway, good luck. Love the War Rig ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-12T15:52:17Z","Content":"\u003E \n\u003E Look at [KerbalMaps](http://www.kerbalmaps.com/).\n\u003E There are neither water-free nor land-free circumnavigation routes on Kerbin\n\nOh, I see the problem now, although I could get all the way around kerbin without water crossings it wouldn\u0027t really be a circumnavigation. I have a new plan though:\n\nI want to fly out a new truck (just the truck bit, not all the trailers) at some point anyway because the current one is fragile and hard to drive, so if I make the replacement amphibious and with space for all the crew I can do as much as possible without water crossing, then ditch the trailers and take the truck across the unavoidable water crossing, maybe hitching up a new (simplified) trailer afterwards. I might also replace the plane with an amphibious, hopefully VTOl one.\n\nAny feedback on this idea?"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-13T00:44:25Z","Content":"\u003E \n\u003E Any feedback on this idea?\n\nWell, that\u0027s a good plan as several others have successfully used that same general strategy ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif). And it\u0027s flexible enough to offer quite a choice of routes. The final choice depends on how much of the trip you\u0027d rather spend ashore or afloat, how many times you want to cross water and for how far, and how many detours you want to make.\n\nThe recon plane doesn\u0027t need to be amphibious unless you plan on stopping for a fairly long time (like overnight) in the open sea, which I really don\u0027t advise doing for several glitchy reasons. When making a water crossing, the terrain is perfectly flat so all you need to scout is the place you plan to come ashore and the immediate area inland to make sure you\u0027re not totally blocked off by mountains. Then the plane can land on the beach and await the truck splashing its way across."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-06-13T01:05:10Z","Content":"Thinking about this has me wondering how long a bridge one could build..."},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-13T06:12:01Z","Content":"\u003E \n\u003E Thinking about this has me wondering how long a bridge one could build...\n\n2.5km I\u0027m sure is the limit and I can\u0027t think of any water crossing that short.\n\nHOWEVER, you might could make a \u0022track-laying\u0022 pontoon bridge. Have 4 or 5 large ships, perhaps built with [Fengist\u0027s Maritime Pack](https://forum.kerbalspaceprogram.com/threads/125063-Maritime-Pack-Alpha-Release), with road sections laid on their decks. You park the ships adjacent so the road sections line up and drive the rover to the farthest ship. Then cast off the ships already driven over and move them around to be in front of the rover again. In this way, the rover drives across the sea without being ferried by boats, thus staying within the challenge rules. All of which sounds like way more trouble than just making an amphibious rover."},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-06-13T14:27:47Z","Content":"\u003E \n\u003E 2.5km I\u0027m sure is the limit\n\nI thought Squad had increased the physics distance to 22Km in version 1.0?"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-13T15:21:00Z","Content":"\u003E \n\u003E I thought Squad had increased the physics distance to 22Km in version 1.0?\n\nThat\u0027s only in the atmosphere. For stuff on the ground, it\u0027s still just 2.5km and thankfully so."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-06-13T15:28:49Z","Content":"\u003E \n\u003E 2.5km I\u0027m sure is the limit and I can\u0027t think of any water crossing that short.\n\u003E HOWEVER, you might could make a \u0022track-laying\u0022 pontoon bridge. Have 4 or 5 large ships, perhaps built with [Fengist\u0027s Maritime Pack](https://forum.kerbalspaceprogram.com/threads/125063-Maritime-Pack-Alpha-Release), with road sections laid on their decks. You park the ships adjacent so the road sections line up and drive the rover to the farthest ship. Then cast off the ships already driven over and move them around to be in front of the rover again. In this way, the rover drives across the sea without being ferried by boats, thus staying within the challenge rules. All of which sounds like way more trouble than just making an amphibious rover.\n\nRight, or if I could park enough disconnected pontoon sections together and drive over the gaps I could certainly make it... perhaps one could come up with an arrangement of girders that would lock the parts together but still keep each section a separate craft. Hm..."},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-13T16:48:04Z","Content":"\u003E \n\u003E Right, or if I could park enough disconnected pontoon sections together and drive over the gaps I could certainly make it... perhaps one could come up with an arrangement of girders that would lock the parts together but still keep each section a separate craft. Hm...\n\nThe part count though... worth a try though, would be an interesting KSP challenge actually. Like, how far can you go over the sea without getting wet or something. \n\nAlso I can confirm it is 2.2km load distance and 2.5km unload for grounded craft, as that is when the wall of lag hits/ends when flying to/from my truck."},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-14T16:51:36Z","Content":"Second part taking ages due this kind of thing:\n\n![9HzK6Ee.jpg](http://i.imgur.com/9HzK6Ee.jpg)\n\n![K4QqifA.jpg](http://i.imgur.com/K4QqifA.jpg)\n\nBoth times down to Attack of the Klaw, that thing is just one big bug, but there\u0027s no other real way to do what I\u0027m trying to do. On the bright side I did get a chance to try airdropping in a rover to rescue everyone ready for an attempt in a new truck (quicksave was screwed up):\n\n![yau8Mm6.jpg](http://i.imgur.com/yau8Mm6.jpg)\n\nAny feedback on ways to avoid things like this and improve the mission in general?"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-06-14T17:26:36Z","Content":"I know you want to get there in that thing, but the pictures of you NOT getting there in that thing are spectacular!"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-14T17:49:40Z","Content":"\u003E \n\u003E I know you want to get there in that thing, but the pictures of you NOT getting there in that thing are spectacular!\n\nThanks, I couldn\u0027t believe that one with the plane in the air when it happened, I was just driving along and it just leapt in the air, taking half the trailer with it, and promptly disintegrated. This kind of thing is why I love KSP.\n\nEDIT: Somewhat relatedly, I tried making the Pursuit Special, also from Mad Max:\n\n![OBTOo6a.jpg](http://i.imgur.com/OBTOo6a.jpg)\n\nIt explodes too:\n\n![203mZTe.jpg](http://i.imgur.com/203mZTe.jpg)\n\n**Edited \u003Ctime datetime=\u00222015-06-14T18:02:01Z\u0022 title=\u002206/14/2015 06:02  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 14, 2015\u003C/time\u003E by BlueCanary**"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-14T18:09:41Z","Content":"\u003E \n\u003E This kind of thing is why I love KSP.\n\nHehehe, and so many people rage-quit over that ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif). Nice Interceptor.\n\nBTW, I\u0027m a fireman and \u0022blue canary\u0022 is our name for a cop at a hazmat incident. We come around the bend in our big, slow truck and see an overturned tanker truck leaking stuff some distance ahead. Beside the wreck is a police car that got there first, with the cop lying motionless on the ground nearby. \u0022The blue canary has confirmed that\u0027s hazmat down there, lads. We\u0027ll stop here and await reinforcements.\u0022 Does that scenario have any bearing on your handle? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-14T18:14:27Z","Content":"\u003E \n\u003E Hehehe, and so many people rage-quit over that ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif). Nice Interceptor.\n\u003E BTW, I\u0027m a fireman and \u0022blue canary\u0022 is our name for a cop at a hazmat incident. We come around the bend in our big, slow truck and see an overturned tanker truck leaking stuff some distance ahead. Beside the wreck is a police car that got there first, with the cop lying motionless on the ground nearby. \u0022The blue canary has confirmed that\u0027s hazmat down there, lads. We\u0027ll stop here and await reinforcements.\u0022 Does that scenario have any bearing on your handle? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nNah, my name\u0027s from this song:\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/NhjSzjoU7OQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n by they might be giants. I can see a lot of overturned tanker trucks in the future of this circumnavigation though, but I guess since they\u0027re kerbals I\u0027ll have \u0022green canaries\u0022."}]}