{"TopicId":115762,"ForumId":51,"TopicTitle":"Ussari Space Program! A highly [unstable] modded 64K career from behind the iron kertain!","CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-07-13T01:47:40Z","PageNum":4,"Articles":[{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-10-19T01:32:29Z","Content":"\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Obsolete ethanol technology has been retired in favor of safe, powerful kerosene fuel! Until domestic production can reach full capacity, a number of complete launch vehicles have been sourced from KSC to continue advance into space! Behold, new Krasniyy Ivan-series booster!\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Greetings Comrades! Is dawn on brand new day! In wake of previous minor launch irregularity, Imperium has declared new policy of DÃƒÂ©tente! No more shall we engage in open competition with industrious but misguided foreigners, now we engage in trade! McKerbal\u0027s opens in Kermangrad! Solpugids play \u0027Wind of Change\u0027 in Crimson Square! We shall export ethanol, political rhetoric, and internet videos of bad drivers! We shall import blue jeans, cowboy hats, and ridiculously unhealthy snack foods! And rocket engines...\n\u003E \u003E\n\u003E \n\nSpoiler\n\n![4tJ0jrH.png](http://i.imgur.com/4tJ0jrH.png)\n\nSpoiler\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Krasniyy Ivan based on simplicity and reliability, no more reliance on inefficient, antiquated solid rocket boosters!\n\u003E \n\n![3VDTDfE.png](http://i.imgur.com/3VDTDfE.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Inaugural launch shall lift Director Kermanev Memorial Space Telescope plus inert test mass, totaling over 6.5 tonnes, well beyond capabilities of Stolitsa launcher\n\u003E \n\n![Pc9q9sH.png](http://i.imgur.com/Pc9q9sH.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Krasniyy Ivan fully powered by kerosene/liquid oxygen fuel mixture. Primary thrust comes from four LV-T30 engines. New engines are so powerful, output has been detuned to 90%!\n\u003E \n\n![jbr5DgP.png](http://i.imgur.com/jbr5DgP.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Non-gimballing main engines are augmented by four Coxwain vernier engines for attitude control\n\u003E \n\n![Ewytlzj.png](http://i.imgur.com/Ewytlzj.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E When main fuel tank reaches 60% at approximately 15km altitude, two of four main engines automatically shut down to maintain proper thrust-to-weight ratio for control.\n\u003E \n\n![d8MeSqt.png](http://i.imgur.com/d8MeSqt.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Stages are separated by ullage motors before single LV-T45, also running on kerolox, ignites.\n\u003E \n\n![1Xq2gU3.png](http://i.imgur.com/1Xq2gU3.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Fairings are jettisoned at 90km, revealing advanced new Kermanev telecope on top of 4-ton test mass!\n\u003E \n\n![4aQ4oo9.png](http://i.imgur.com/4aQ4oo9.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Payload is placed into 145x104km orbit at 43\\* inclination. With considerable fuel still remaining, second stage is discarded with de-orbit motors. First launch of Krasniyy Ivan is complete success!\n\u003E \n\n![QCVbikL.png](http://i.imgur.com/QCVbikL.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Kermanev telescope then proceeds under own power to final 1300km orbit, and immediately sends back first orbital picture of Sun..\n\u003E \n\n![Fivri9W.png](http://i.imgur.com/Fivri9W.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E ...possibly burning out sensitive camera equipment.\n\u003E \n\n**Edited \u003Ctime datetime=\u00222015-12-01T05:30:56Z\u0022 title=\u002212/01/2015 05:30  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 1, 2015\u003C/time\u003E by CatastrophicFailure**\n  \ntest"},{"CreatedByName":"PanzerAce","CreatedById":142172,"CreatedDateTime":"2015-10-19T03:28:50Z","Content":"This and Manley\u0027s RP-0 play through are making me seriously consider giving it a crack...."},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-10-19T05:43:57Z","Content":"Wow mentioned in the same breath as Scott Manley ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif)\n\nBut yes, I really can\u0027t recommend the upscaled mods enough if you\u0027re looking for more challenge in the \u0022easy things\u0022 (and I use the term loosely) like just getting into orbit. I\u0027m thinking of having a go at RP-0 myself once 1.1 comes out."},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-10-21T05:11:40Z","Content":"\u003E \n\u003E \n\u003E \n\u003E Extra launch added to the manifest just for GarrisonChisholm\n\u003E \n\u003E \n\u003E ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Greetings Comrades! Maiden flight of Krasniyy Ivan was complete success, but Imperious Academy of Sciences has decided more testing is necessary before booster can be committed to kerballed launch.\n\u003E \n\nSpoiler\n\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Second launch of Krasniyy Ivan occurs shortly after dawn on Year 2, Day 228. Launch clamps release after main engines are verified to be running properly.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![4IfZOWA.gif](http://i.imgur.com/4IfZOWA.gif)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Payload for launch is Technology Demonstrator 2 package. Rocket is outfitted with numerous sensors and new science payloads to verify performs. Onboard camera provides stunning view of eastern Ussari and Nihacima!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![F8JCU1h.png](http://i.imgur.com/F8JCU1h.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Fairings are jettisoned just before staging at 89 kilometers. Flight profile is still being dialed in with powerful new lifter! Booster will mostly burn up in atmosphere and land in unpopulated area. Probably.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![B9cWrH4.gif](http://i.imgur.com/B9cWrH4.gif)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Here we see upper stage of TDEM-2 assembly. At top is long-term research satellite being launched under contract. Below that is re-entry probe to test landing systems for future Eve mission. Below that is 1-ton lead test mass, and beneath that is 500kg Communication from High Altitude Orbit system.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![mBiKhjc.png](http://i.imgur.com/mBiKhjc.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Here is shown CHAOS equipment bay and dust collection experiment package attached directly to Krasniyy Ivan second stage.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![PXOUd9x.png](http://i.imgur.com/PXOUd9x.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Upper stage burns to initial 185x160km orbit at 50\\* inclination. Kermangrad Cosmodrome launches will now insert into higher, 50 degree inclination, rather than previous 43 degrees, to avoid downrange population centers and Gytepian territory.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![D4tDzX0.png](http://i.imgur.com/D4tDzX0.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E After initial system check out and science experiments, second stage re-ignites to boost orbit to 650km as specified by contract.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![VshQzFh.png](http://i.imgur.com/VshQzFh.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Once proper circular orbit is achieved, Kraniyy Ivan spins up for stability, research satellite is released and communications verified.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![Nejej6J.png](http://i.imgur.com/Nejej6J.png)\n\u003E \n\u003E \n\u003E \n\u003E ![9vDmAau.gif](http://i.imgur.com/9vDmAau.gif)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Upper stage has limited hydrazine attitude control fuel and so must maneuver conservatively. After satellite release, engine is refired again and perikee dropped to 200km. Results from science experiments are loaded into experimental data-return hard drive in re-entry probe for recovery on Kerbin. Re-entry maneuver is calculated, and Krasniyy Ivan moves to proper attitude before again spinning up and releasing return probe. Return probe will fire small de-orbit motors at proper time.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![D3LaBPq.gif](http://i.imgur.com/D3LaBPq.gif)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Meanwhile, at lowest latitude of 50 degree orbit, second stage engine fires for fourth time and burns remaining fuel to exhaustion, resulting in 1500x200km orbit with apokee high over northern hemisphere. High inclination and long range omnidirectional antenna will provide excellent communication coverage for future missions, including coverage of Kerbin\u0027s north pole. Lightweight CHAOS system will be launched aboard all flights with available payload mass for minimal cost over initial launch price. Due to high inclination of launch site, orbits will naturally be of much greater variety than equatorial launches, so space debris is of minor concern. High-altitude pseudo-kolinaya oribts also more efficient than massive cost of geostationary network.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![kGh1Mb1.png](http://i.imgur.com/kGh1Mb1.png)\n\u003E\n\n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Unfortunately, re-entry probe developed problems shortly after separation and contact was lost. Engineers are currently pouring over limited data returns, but are suspecting a NullReferenceException error lead to a Critical Existence Failure. With primary goals accomplished, mission is still considered impressive success.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\n**Edited \u003Ctime datetime=\u00222015-12-01T05:32:15Z\u0022 title=\u002212/01/2015 05:32  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 1, 2015\u003C/time\u003E by CatastrophicFailure**\n  \nARGH IMGUR!"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-10-21T05:30:01Z","Content":"\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E Extra launch added to the manifest just for GarrisonChisholm\n\u003E \u003E ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\u003E \n\n...wow, that was.. so awesome. ...like a Boston-creme doughnut to a diabetic... ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) - Thank you!"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-10-23T07:51:01Z","Content":"\u003E \n\u003E \u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/ALb9ti0lZKM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n...I just had to watch this again. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) -- too good.\n\nonly 1 more day of night-shift!"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-10-23T18:21:22Z","Content":"I am pretty happy with how that turned out, actually. I usually lack the patience (and skill) for videos, but maybe I\u0027ll have to throw the odd one in the mix. I\u0027m going in to the doctor to get declawed in a few hours, then I\u0027m off for a full week, so I\u0027m hoping for lots of updates then!"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-10-25T22:04:46Z","Content":"I love what you are doing here. The designs are inspiring and the wacky setting is endearing.\n\nI hope you keep this up and help populate the x6.4 report section. I mean, it\u0027s only one step away from RSS, where the big boys play ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-04T00:06:56Z","Content":"\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Greetings Comrades! Today we gather to celebrate historic flight of Tercella Kerman, first Ussari in orbit! Old technology has been left by side of road, brave Tercella\u0027s spacecraft has been mounted to modern, reliable, Krasniyy Ivan booster!\n\u003E \n\nSpoiler\n\n![Upxp8Xf.png](http://i.imgur.com/Upxp8Xf.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E As always, pair of engines shut down at 60% kerosene remaining, to maintain proper TWR for control in middle atmosphere.\n\u003E \n\n![VnSnqqY.png](http://i.imgur.com/VnSnqqY.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Once fully depleted, first stage separates at approximately 70 kilometers. Flight profile has been optimized for single LV-T45 Swivel engine and low (.90) initial TWR.\n\u003E \n\n![RM5nLM9.png](http://i.imgur.com/RM5nLM9.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Once free of atmosphere, heavy launch escape tower is jettisoned.\n\u003E \n\n![EnMlKkG.png](http://i.imgur.com/EnMlKkG.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Despite challenge and adversity, after flawless launch Ussari Space Program has finally achieved goal of putting Kerbal in space!\n\u003E \n\n![3w1FWvy.gif](http://i.imgur.com/3w1FWvy.gif)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Brave Tercella\u0027s pod is placed into final orbit of 151x118km at 43\\* inclination and mission is cleared for at least five orbits! After battery of initial science experiments and diplomatic exchange as craft passes near Kerbal Space Center, fearless Tercella prepares for next milestone!\n\u003E \n\n![H1n2Z0W.png](http://i.imgur.com/H1n2Z0W.png)\n\n![6wf1TBG.png](http://i.imgur.com/6wf1TBG.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E During next pass over Kermangrad Cosmodrome, Tercella embarks on record-setting extra-vehicular activity, remaining outside of capsule for some twenty minutes and performing numerous highly successful experiments and equipment tests. Television footage from on-board camera beamed back to Kerbin will no doubt become famous historical document!\n\u003E \n\n![cB3vIax.gif](http://i.imgur.com/cB3vIax.gif)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E After numerous successes during historic EVA, brave Tercella begins planned reentry procedure on third orbit while passing over traitorous rebel province of South Erakonia\n\u003E \n\n![3dcwaOr.gif](http://i.imgur.com/3dcwaOr.gif)\n\n![FbPGE3H.gif](http://i.imgur.com/FbPGE3H.gif)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Following uneventful reentry, stalwart Tercella lands softly on bank of Vulgar River, not far from Cosmodrome!\n\u003E \n\n![xFWSNsu.png](http://i.imgur.com/xFWSNsu.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Having surmounted great challenges, dream of putting Ussari in space and returning them safely to Kerbin has finally been realized! From this humble beginning Glorious Ussari Union will no doubt maintain status as world leader of space innovation!\n\u003E \n\u003E \n\u003E In very short time, brave Dibella Kermanov shall continue to set records by becoming first Kerbal to fly in space twice, on endurance-testing three-day flight!\n\u003E \n\n**Edited \u003Ctime datetime=\u00222015-12-01T05:33:25Z\u0022 title=\u002212/01/2015 05:33  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 1, 2015\u003C/time\u003E by CatastrophicFailure**"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-11-05T00:26:41Z","Content":"Too, too cool. Many thumbs up. (meta-hominid)\n\n\\*gifts billions of *Krubles* to Ussari Cosmodrome for accelerated production of fascinating documentary videos\\*"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-05T06:10:47Z","Content":"\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Greetings, Comrades! Only simple release tonight, for even Glorious Ussari Union must fulfill mundane contracts by deadline!\n\u003E \n\u003E \n\u003E Yet another reliable Krasniyy Ivan launch puts payload into standard parking orbit.\n\u003E \n\nSpoiler\n\n![PbdeeTZ.png](http://i.imgur.com/PbdeeTZ.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Payload is navigational satellite to be deployed under contract, along with another test re-entry pod and now-standard CHAOS package. Contract satellite deployed soon after reaching orbit.\n\u003E \n\n![3OXK0Ec.png](http://i.imgur.com/3OXK0Ec.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Navsat burns to circular 2800km orbit using onboard hypergolic engine.]/quote]\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![ZghdxO4.png](http://i.imgur.com/ZghdxO4.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Hitching ride on propulsion unit are several components of next-generation crewed spacecraft, tentatively dubbed \u0022Zarya,\u0022 for in-space testing.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![kzW5fFr.png](http://i.imgur.com/kzW5fFr.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E NavSat is flawlessly deployed to proscribed orbit, completing contract.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![Auc9BJ8.png](http://i.imgur.com/Auc9BJ8.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Meanwhile, Krasniyy Ivan upper stage burns remaining fuel to high-altitude eccentric orbit over north pole.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![fON5Dyu.png](http://i.imgur.com/fON5Dyu.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Extremely long dwell time above horizon and long-range omnidirectional antennae will ensure excellent communication with future launches. Increasing numbers of asteroids have been noticed wandering into Kerbin SOI. These may be targets for further investigation. To check for proper papers.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![Awm6nCK.png](http://i.imgur.com/Awm6nCK.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Re-entry capsule is able to initiate de-orbit burn this time, only to inexplicably loose contact again. Capsule is later recovered on ground with science data intact. This, too, will require further investigation.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![lGXhmdT.png](http://i.imgur.com/lGXhmdT.png)\n\u003E\n\ntest\n\n**Edited \u003Ctime datetime=\u00222015-12-01T05:35:43Z\u0022 title=\u002212/01/2015 05:35  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 1, 2015\u003C/time\u003E by CatastrophicFailure**"},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-11-05T17:37:25Z","Content":"Wow, that is certainly an asteroid invasion you have there, is that 5 of them? or are some of those elliptical grey traces craft/debris leaving Kerbin SOI?\n\nI use custom asteroids and have yet to even get a single rock approach Kerbin SOI, do you use custom asteroids or are you on the stock spawner?"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-05T18:59:21Z","Content":"\u003E \n\u003E I love what you are doing here. The designs are inspiring and the wacky setting is endearing.\n\u003E I hope you keep this up and help populate the x6.4 report section. I mean, it\u0027s only one step away from RSS, where the big boys play ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nMany thanks. I finally got caught up on your own series only to find it\u0027s ending ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\n\u003E \n\u003E Too, too cool. Many thumbs up. (meta-hominid)\n\u003E \\*gifts billions of *Krubles* to Ussari Cosmodrome for accelerated production of fascinating documentary videos\\*\n\n![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif) I\u0027ve a bit of a backlog ATM so there\u0027s lots ahead, and some truly annoying frustrations. ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif)\n\n\u003E \n\u003E Wow, that is certainly an asteroid invasion you have there, is that 5 of them? or are some of those elliptical grey traces craft/debris leaving Kerbin SOI?\n\u003E I use custom asteroids and have yet to even get a single rock approach Kerbin SOI, do you use custom asteroids or are you on the stock spawner?\n\njust stock \u0027roids. Think I\u0027m up to 6 or 7 now. If I find one wandering thru the system I tend to track \u0026 keep it if it\u0027s gonna stick around. Much easier than trying to chase one down from escape velocity. ![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-08T19:35:19Z","Content":"\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E Greetings, Comrades! Today, we return to MÃƒÂ¼n with pair of cutting edge missions!\n\u003E \n\u003E \n\u003E First, MÃƒÂ¼na 8 blasts off on prototype enhanced Krasniyy Ivan launch vehicle! Main engines have been tuned to produce 100% rated thrust, and core fuel tank has been stretched from 12.8 to 16 meters, raising cargo capacity to LKO to around 7 tonnes.\n\u003E \n\nSpoiler\n\n![GyJ1bPx.png](http://i.imgur.com/GyJ1bPx.png)\n\n\u003E \n\u003E \n\u003E Comrade Political Officer said:\n\u003E \n\u003E \n\u003E What happened to MÃƒÂ¼na 7, you ask? This, we do not speak of.\n\u003E \n\u003E \n\u003E But if we did, we would say that we are on tight contract deadline and MÃƒÂ¼na 8 was simply completed first.\n\u003E \n\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E KI-E first stage performs flawlessly!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![61dEjIX.png](http://i.imgur.com/61dEjIX.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E MÃƒÂ¼na 8 is placed into typical 148x121 parking orbit at 50\\* inclination. Various experiments and sensors are now deployed, and another reentry test pod is released.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![lfvinC5.png](http://i.imgur.com/lfvinC5.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E However, once again, reentry test pod quickly suffers critical existence failure, this time leading to quantum singularity in fabric of space-time that comes within RatSquirrelFish\u0027s whisker of completely annihilating reality and corrupting save file. Once Universe is is recovered, engineer responsible is sent to especially nasty part of Kerberia!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Meanwhile, a maneuver is planned that will perfectly insert MÃƒÂ¼na 8 into orbit assigned by contract.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![Q8MzQiO.png](http://i.imgur.com/Q8MzQiO.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Standard Krasniyy Ivan upper stage burns remaining fuel to provide initial impulse to MÃƒÂ¼na 8!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![OnVEMZa.png](http://i.imgur.com/OnVEMZa.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Then efficient on-board hypergolic engine fires to complete burn. It is noted at this time that on-board engine, while efficient, is somewhat lacking in thrust...\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![Bod3IIJ.png](http://i.imgur.com/Bod3IIJ.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Still burning...\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![YF3kuIS.png](http://i.imgur.com/YF3kuIS.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Still burning......\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![ZYVPaSB.png](http://i.imgur.com/ZYVPaSB.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E STILL burning.........\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![t1nSesK.png](http://i.imgur.com/t1nSesK.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E After nearly 15 minutes of low TWR burning, MÃƒÂ¼na 8 is now on course for MÃƒÂ¼nar intercept, but capture orbit is completely wrong and will require several days of complex maneuvering to reach contract-specified orbit. More engineers shall be relocating.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![zTj99Gr.png](http://i.imgur.com/zTj99Gr.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E After long lesson in orbital mechanics, MÃƒÂ¼na 8 finally achieves proper orbit, completing contract!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![jVd44VY.png](http://i.imgur.com/jVd44VY.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Yet we shall not be stymied by minor technical difficulties, good Comrades! While MÃƒÂ¼na 8 was still maneuvering, MÃƒÂ¼na 7 lifted off from Kermangrad Cosmodrome in record turn-around!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![OYKBSpG.png](http://i.imgur.com/OYKBSpG.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E KI-E booster again performs flawlessly, and upper stage finishes insertion. MÃƒÂ¼na 7 is heavy lander intended for long-term research on MÃƒÂ¼nar surface!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![wxKeeYc.png](http://i.imgur.com/wxKeeYc.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Efficient Cryogenic Transfer Stage boosts MÃƒÂ¼na 8 to intercept much more quickly!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![wGuGxHs.png](http://i.imgur.com/wGuGxHs.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Final systems check as lander departs Kerbin.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![0PF841U.png](http://i.imgur.com/0PF841U.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E MÃƒÂ¼na 7 soon settles into temporary parking orbit around MÃƒÂ¼n to await proper window for descent.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![dlTS2Ld.png](http://i.imgur.com/dlTS2Ld.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Featuring much more powerful engine than MÃƒÂ¼na 6, MÃƒÂ¼na 7 makes easy, uneventful landing deep in Far Side Crater.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![vAKjiM8.png](http://i.imgur.com/vAKjiM8.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E After again waiting for MÃƒÂ¼nar noon, lander beams back high-quality pictures from surface and begins collection of scientific data.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![s1YxQQ8.png](http://i.imgur.com/s1YxQQ8.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E MÃƒÂ¼n is much less flat and boring here!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![SJdzo4Y.png](http://i.imgur.com/SJdzo4Y.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Only small amount of data is initially returned, however. MÃƒÂ¼na 7 has been designed to store science for eventual collection by robotic sample return mission!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Meanwhile, MÃƒÂ¼na 8 has one more task. Autonomous propulsion stage is decoupled at apomÃƒÂ¼n and burns remaining fuel to establish collision course with MÃƒÂ¼n!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![mBY5QzZ.png](http://i.imgur.com/mBY5QzZ.png)\n\u003E \n\u003E \n\u003E \n\u003E ![ZotHU7L.png](http://i.imgur.com/ZotHU7L.png)\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Half a ton slams into MÃƒÂ¼nar surface at two kilometers per second! Waiting MÃƒÂ¼na 8 records seismic disturbance and returns science to Kermangrad.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![XfUNLJ0.png](http://i.imgur.com/XfUNLJ0.png)\n\u003E\n\n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Comrade Political Officer said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E However, energy released by impact is insufficient to fulfill contract. With less than 20 days remaining until contract expires, solution must be quickly found!\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\n**Edited \u003Ctime datetime=\u00222015-12-01T05:36:27Z\u0022 title=\u002212/01/2015 05:36  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 1, 2015\u003C/time\u003E by CatastrophicFailure**"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-11-09T00:09:23Z","Content":"When will ussari comrades claim the Mun with their red boots?!\n\nAlso, engineer relocation program seems to be very very effective...\n\nI have a feeling these contracts are being bound by some General back in HeadQuarters and failing them will mean that the Space Center team is going to be recycled... Literally ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-10T04:58:56Z","Content":"Boots on the MÃƒÂ¼n will... take some time. Despite the successes of the robotic space program, the crewed program [continues to suffer setbacks....](https://forum.kerbalspaceprogram.com/threads/126545-Whispers-of-the-Kraken-%28Chapter-26-Night-and-Day%29?p=2038277\u0026viewfull=1#post2038277)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-17T02:39:22Z","Content":"[quote name=\u0027Comrade Political Officer\u0027]Greetings, Comrades! After minor under-performance of previous seismic impact test, our brilliant engineers have worked long nights to bring solution before contract expiration. Behold, first released footage of new heavy-lift Ussari launch vehicle, Krasniyy Ivan Ultra! In development for some time, what was to be experimental launch carrying useless test mass becomes gambit to fulfill contract! CHAOS hardware has been quickly adapted to provide necessary guidance to impact MÃƒÂ¼n with nearly 10 tonnes! Footage has been compiled here to traditional Ussari Naval hymn!  \n  \n[https://www.youtube.com/watch?v=UjZ7xTsS_j8](https://www.youtube.com/watch?v=UjZ7xTsS_j8)  \n\n[quote name=\u0027Comrade Political Officer\u0027]Initial analysis of data confirms that Krasniyy Ivan Ultra will be capable of placing over 20 tonnes in LKO, 6.5 tonnes to TMI, and smaller payloads beyond Kerbin SOI without use of extra transfer stage!  \n\n[quote name=\u0027Comrade Political Officer\u0027]It is mixed bag however, good Comrades. As planned, Krasniyy Ivan Ultra upper stage successfully impacts MÃƒÂ¼n with 9.5 tonnes of mass remaining, traveling at over 3 kilometers per second only hours before contract expires. But upon searching for carrier signal from MÃƒÂ¼na 8 on surface to begin seismic data transmission, all is silent. Both Tracking Station and orbiting MÃƒÂ¼na 7 are unable to find any trace of lander. It is as if MÃƒÂ¼na 8 has completely disappeared. Further study of this aberration will have to wait, however, as now we must focus on upcoming historic three-day flight of brave Dibella Kermanov!\n\n**Edited \u003Ctime datetime=\u00222015-12-01T05:39:09Z\u0022 title=\u002212/01/2015 05:39  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 1, 2015\u003C/time\u003E by CatastrophicFailure**"},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-11-20T18:30:43Z","Content":"20 tonnes to LKO? Wow ..... somebody just put the big boy trousers on!!  \n\nAs ever another beautiful video, I dont know how long it takes you to do all the camera shots and that (also the custom graphics too) but it is definitely worth the effort! one impressed reader here :)  \n\nLooking at that craft on the pad I would have expected serious wobble between the core and the two boosters flapping about like wings, yet the vid shows them rock steady. The only connections I can see are the separators and a pair of struts at the top, what kind of magic is this??  \n\nWhere is your impact experiment coming form? I know Interstellar had one but you are not running that, crashing stuff into stuff is something even I can do!"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-21T01:08:57Z","Content":"I spent waaaay to long on that. Took days to collect all the footage (since, like the title says, highly unstable and I get maybe one launch per crash), was worried I wouldn\u0027t have enough. Probably could have used the whole song after all. And thanks :cool:  \n\nI use KJR and some upgraded struts from Stock Revamp (I think). At some point Squad fixed their wobbly joints too I thought. More details on the new launcher will come with its next payload.   \n\nImpactor contracts come from the [URL=\u0022http://forum.kerbalspaceprogram.com/threads/114087-1-0-Impact!-impact-science-and-contracts-v1-2-0-With-Asteroids-7-9-15\u0022]Impact![/URL] mod. Works with asteroids too!"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-30T05:26:02Z","Content":"\u003E \n\u003E \n\u003E Quote\n\u003E \n\u003E \n\u003E Comrade Political Officer: \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E This is a test! This is only a test!\n\u003E \n\n![FHuSiXO.png](http://i.imgur.com/FHuSiXO.png)\n\n\u003E \n\u003E \n\u003E Quote\n\u003E \n\u003E \n\u003E Comrade Political Officer:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ... and title fixing.... and sig work... and bugrit but there\u0027s gotta be an easier way to post pics....\n\u003E"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-11-30T19:07:51Z","Content":"This is a really sad development- with the forum changes, I can no longer see images while at work (the time when it is oddly most convenient for me to check the forums).  I will check from time-to-time to see if the situation amends itself..."},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-30T19:15:48Z","Content":"Are they blocked or something? They do seem slow to load to me. How about this latest one from last nite?"},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-11-30T19:39:21Z","Content":"Got there in the end, but boy did it take a long time to load them all. Well all except your 17th Nov post anyway that one is still showing the code line rather than youtube vid (garrisons youtube link is displayed)\n\nPictures came out ok, but unless we reduce quality/number of posts per page then this isnt really going to work ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022)\n\nThis forum update is displaying more posts per page, so that would account for a decent chunk of extra loading time.\n\n**Edited \u003Ctime datetime=\u00222015-11-30T19:59:43Z\u0022 title=\u002211/30/2015 07:59  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by Shania\\_L**"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-11-30T19:55:38Z","Content":"\u003E \n\u003E \n\u003E 44 minutes ago, CatastrophicFailure said:\n\u003E \n\u003E \n\u003E Are they blocked or something? They do seem slow to load to me. How about this latest one from last nite?\n\u003E \n\nAlas no, just as Shania said, the only imagery I can see is the YouTube link for the video of yours that I re-posted.\n\nI used to have to jump through a little hoop to see images at work; some posters would show a link called \u0022Java Script Disabled\u0022, and when I clicked that link my PC would prompt me for 20 minutes of \u0022personal time\u0022, which when accepted would then show All the images on any forum page that I then loaded.  Now however I have been unable to find that magic extension anywhere.  :\\\n\n**Edited \u003Ctime datetime=\u00222015-11-30T19:56:54Z\u0022 title=\u002211/30/2015 07:56  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by GarrisonChisholm**"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-11-30T22:59:03Z","Content":"Wow, yeah now that the forum otherwise seems to be running \u0022normally,\u0022 the pic load time is pretty obnoxious. I\u0027ve got another update to post tonight, I\u0027ll see if maybe using the spoiler option helps. I reeeeeeaaly don\u0027t want to have to resort to imgur albums ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif \u0022:mad:\u0022)"}]}