{"TopicId":116561,"ForumId":51,"TopicTitle":"Odin Munar Progam - Odin 20 Part 1","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-22T12:10:03Z","PageNum":4,"Articles":[{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2015-09-23T11:58:15Z","Content":"Nice work once again. Looks like your Munar Rover got a little \u0022air\u0022 time on the drive? ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nEdit: here\u0027s a video of the \u0022Lunar Grand Prix\u0022 16mm footage of Charlie Duke demonstrating the LRV and probably the best footage of the rover. The camera jammed on A15 and as A17 was the last, they didn\u0027t bother repeating it.\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/7o3Oi9JWsyM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n**Edited \u003Ctime datetime=\u00222015-09-23T12:05:15Z\u0022 title=\u002209/23/2015 12:05  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 23, 2015\u003C/time\u003E by Clipperride**"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-23T12:04:35Z","Content":"Can I suggest putting a non-roman numeral number of the mission somewhere in the thing of it? It gets very confusing.\n\nP.S. what are you going to do for Odin 18?"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-23T13:06:50Z","Content":"Ah! My two faithfull readers ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Yes, the MRV got extentive air time during this trip. Wait for part two - where a few minor things go wrong because I got too cocky ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nI saw that Grand Prix video while doing some research for this mission and found it quite fascinating. Especially these \u0022dust-clounds\u0022 the wheels kick up. \n\nI will try to sneak in some non-roman numerals. Odin XVI ist number sixteen. However, the math-teacher in me would really like to encourage you to [learn roman numerals](http://www.artofmanliness.com/2014/08/27/even-when-not-in-romeyou-should-know-your-roman-numerals/). It\u0027s really not that hard, especially since we won\u0027t go into numbers [like this](https://images.gutefrage.net/media/fragen/bilder/wie-heisst-diese-zahl-bzw-das-datum/0_big.jpg?v=1315664366000). You know, since they pop up here and there it can be usefull to decypher them at least up to 100 or so."},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-23T13:08:28Z","Content":"Eh I might give it a try, I\u0027d love to see the Soyuz 19 you come up with.\n\nOh, and once this series is finished, try it in RSS!"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-23T13:32:37Z","Content":"Do try it - it\u0027s really not that bad. Ah, since you asked about Odin 18:\n\nAfter completing Odin 17, I will do skylab. Since it and Apollo are inextricably linked, using the same hardware and using the last Saturn V. Then I\u0027ll try Apollo-Soyuz, although I\u0027m a little nevous about the Soyuz craft. I found that KSP stock parts lend themself much better to american-styled crafts, than the sometimes oddly shaped russian ones. \n\nFor Odin 18, I willl probably go with LMP Harrison Schmitt\u0027s proposal to do a landing on the farside of the mun, after deploying a few com-satellites around it. It\u0027s mentioned [here](https://en.wikipedia.org/wiki/Tsiolkovskiy_%28crater%29). Although I\u0027d like to send them there usingone of my Naglfar-Logi rockets. We\u0027ll see. \n\nIt\u0027s kinda awesome to have a handfull of tested boosters at hand and not having to build each rocket from scratch. One of the things I learned doing this whole thing.\n\nI\u0027m not exactly sure what you meant by RSS."},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-23T13:34:32Z","Content":"Real Solar System mod, once you finish OMP then it needs to be done in RSS! As for the Soyuz maybe try installing Tantares."},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-23T13:50:54Z","Content":"Ah, well - we will see. Even though the end of the apollo-recreation era is comming in sight, there is still quite a lot to do. And these later mission are really elaborate. And then I will spent some time with the apollo applications program. They had stuff planned like 6 men/180 days mission to the moon. \n\nI guess this will keep me busy for quite some time."},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2015-09-23T14:26:18Z","Content":"Looking forward to the next mission report. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThe \u0022rooster tail\u0022 dust kicked up by the Rover is my go to footage when confronted by folks that aren\u0027t 100% sure Apollo really went to the Moon (I find, however, that people who are 100% sure Apollo *didn\u0027t* go to the Moon won\u0027t be swayed by mere evidence!)\n\nMy apologies for nit picking (but the Apollo geek in me has to ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) ). Skylab used the last Saturn V to be launched but there were 3 left over which are now on display. Although, only one is built of entirely flight quality parts. NASA couldn\u0027t find the money to run the last 3 missions despite the hardware having already been built and paid for. Things were so bad in the late 1970s that they also switched off the ALSEPs left behind so they didn\u0027t have to process the returned data. I\u0027m not sure how long the nuclear fuel source would have lasted (Voyagers is doing rather well), but they were still going strong when switched off."},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-23T15:27:04Z","Content":"Well, all conspiracy-nuts allready know the truth and are not swayed by facts ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) But that is another discussion.\n\nHah, well, you are obviously right - actually a stupid mistake, considering I stood next to the one at Kennedy Space Center as a boy ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) But to nitpick you nit picking ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif) - at least according to wiki there are only two left: SA-514 and SA-515. SA-500D still exists too, but it was never intended to fly."},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-23T15:33:17Z","Content":"Xeldrak, maybe you could do a mini-series recreating Mercury or Gemini?"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-23T16:14:41Z","Content":"I did consider a mercury or gemini program. However most of the things they did were IVA, wich is basically non-existent in KSP.\n\nMaybe I\u0027ll do it when I\u0027m bored, but right now I have my hand full with Odin ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-23T16:39:09Z","Content":"Yep, and we wouldn\u0027t want it any other way."},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2015-09-23T16:51:28Z","Content":"Well nit picked Sir! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif). As its number is 500D then, as you say, it was for ground tests of some sort. Thinking about it, they built a flight ready Skylab 2, which must have reused some parts from the cancelled missions."},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-23T16:56:38Z","Content":"This part contains a major (structural) deviation from the real Apollo 16. But after all it\u0027s Odin 16 - a few differences are allowed ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nRead Part one [here](https://forum.kerbalspaceprogram.com/threads/129457-Odin-Munar-Progam-ODIN-XVI-The-Hilbert-Highlands?p=2207528\u0026viewfull=1#post2207528).\n\n* * *\n\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/HJlBG/embed?background=ffffff\u0026text=1a1a1a\u0026link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\nAfter a good nap John and Charles donned their spacesuits and left the MEM to head to the target of their second and\n\nlongest EVA: the Gauss crater.\n\nThe first station was the northern one of the twin peaks formed by the rims of Laplace and Leibniz. The other one would be visited during EVA3. Once ontop of the peak, John left the MRV to collect some samples and make pictures of the surrounding area. He also used the view to chart out their further course towards Gauss. From the there John drove the MRV down into Laplace and from here over the two lowered ridges into Leibniz. Halfway between Laplace and Riemann the Kerbonauts stopped to collect several samples of Leibniz rocks. They continued into Rieman, an impressive crater inside Leibniz. Once the samples from there were bagged, they left toward their main target.\n\nOn the small stretch between the two craters John was able to push the MRV to [45.5 m/s](https://www.wolframalpha.com/input/?i=45.5\u002Bm%2Fs\u002Bin\u002Bkph\u002Band\u002B45.5\u002Bm%2Fs\u002Bin\u002Bmph), a new speed record, before jumping into the Gauss crater. During the 2000 meter descent the MRV accelerated to [71.2 m/s](https://www.wolframalpha.com/input/?i=71.2\u002Bm%2Fs\u002Bin\u002Bkph\u002Band\u002B71.2\u002Bm%2Fs\u002Bin\u002Bmph). At this point the guys at mission control got the key for the locker with the pre-written obituaries. But to everyones surprise John, Charles and the MRV survived the landing on the bottom of the crater. However the MRV lost all it\u0027s wheels, so while Charles collected a few samples from the surrounding area John replaced their tires so they could head back to the MEM.\n\nBut first it was time for some science! After all this daring jump wasn\u0027t done to entertain the kerbonauts. Close to their landing spot John and Charles found indentations, similar to the clusters on the highlands. They stopped and collected several samples for later analysis. Next stop where two big craters within Gauss. Driving the MRV along the crater, Charles collected several samples of ejecta before heading to the northern ridge of Gauss. In a small accident the MRV lost two wheels, but the two Kerbonauts where by now used to replace them. While one collected a few interesting samples of stone, the other one repaired the MRV wheels.\n\nOnce John and Charles started climbing the ridge of Gauss they realized, just as Val and Bob did on Odin XV, that the MRV suffers from low torque. Progress was painfully slow and they had to stop several times to reload the batteries. At mission control people were starting to get worried. Maybe they would have to shorten EVA3.\n\nWhen the MRV reached an altitude of 2000 meters above zero, it had only 35% fuel left in it\u0027s tank and it was using it up fast. The engineers at mission control became very worried while consulting their slide rules. The MEM was waiting for the Kerbonauts at an altitude of 5000 meters. EVA3 would have to be scrubbed, there would be not enough fuel left in the MRV.\n\nOnce John and Charles reached 3000 meters above zero, only 13% fuel remained. Mission control informed them that EVA3 would have to be scrubbed. Actually the engineers on the ground were not sure if the two kerbonauts could make it back to the MEM with the MRV.\n\nThe tough, little mun buggy carried the kerbonauts to 4081 meters before giving up. While the machine had held up admirably, mission morale was at a low point. John and Charles went through their collected samples and picked the most important ones before abbandoning the MRV six kilometers off the MEM. They activated their jetpacks and headed back.\n\nThey entered the MEM and sorted through their remaining samples before eating some snacks - hoping to ease the gloom.\n\n![Nk3HhOA.png](http://imgur.com/Nk3HhOA.png)\n\n**Edited \u003Ctime datetime=\u00222015-11-30T17:22:33Z\u0022 title=\u002211/30/2015 05:22  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by Xeldrak**"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-23T17:30:21Z","Content":"Woohoo!"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-26T04:38:26Z","Content":"Sorry for keeping you guys waiting so long, but I don\u0027t have just as much free time on my hands as in the last few weeks. Also I was bummed about the MRV.\n\n* * *\n\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/gEeyZ/embed?background=ffffff\u0026text=1a1a1a\u0026link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\nWhile John and Charles took a nap in the MEM the guys at mission control thought what do about EVA 3. Since the MRV had to be abbandoned the kerbonauts mobility was severely limited. But they came up with something and once the men on the mun had eaten their morning-snacks they donned their space suits and left the MEM.\n\nThey headed to Laplace by foot and collected a few samples on the ridge of the crater before activating their jetpacks. They jumped right across the crater to the southern one of the twin peaks. Once they had assembled ontop of the peak, John started to make pictures of the view while Charles collected samples.\n\nWithout the MRV they soon had to return to the MEM. Using their jetpacks they jumped back across the Laplace crater. After collecting a few further samples along the way they climbed back into the lander. Once safe inside the lander they stored the remaining samples, ate the last snacks and prepared the MEM for liftoff.\n\nThe MEM fired it\u0027s ascend engine once the preparations where completed and the CSM was in the righ position. After the circularization burn, a comparatively long burn was neccessary to match orbital planes. Due to their extended stay on the munar surface, John and Charles had drifted far out of the CSM plane.\n\nNonetheless about one hour after liftoff the ascend-stage approached the CSM and John docked the two spacecraft without any complications. Thomas opened the hatch to the MEM and welcomed John and Charles back on their spacecraft. The crew moved all samples and experiments from the MEM to the CM before jettisoning it and leaving it to crash into the munar surface.\n\nThere was just one more thing to do before leaving munar orbit. Thomas opened the CSM instrument bay and launched the subsatellite. The small, solar-cell clad satellite slowly drifted out of the CSM bay and into orbit. With this done the crew activated the SPS and once in the right position over the far side of the mun made the trans-kerbular injection.\n\nThe trip back to Kerbin was rather uneventfull. Thomas listened to John and Charles\u0027s stories from the munar surface while they had some snacks in the Odin capsule. Just enough time for a nap before they had to prepare for reentry.\n\nAbout 100 kilometers above Kerbin the crew jettisoned the service module before the dived into the atmosphere at 3200 m/s. Thanks to improved planing by the guys in mission controll the capsule didn\u0027t have to reenter over the dark side of Kerbin, as it had on Odin XV. Just a few minutes after being engulfed in a firery ball of plasma the parachutes deployed and the crew safely descended to the ocean below them.\n\n![XrfnFzu.png](http://i.imgur.com/XrfnFzu.png)\n\n**Edited \u003Ctime datetime=\u00222015-11-30T17:23:21Z\u0022 title=\u002211/30/2015 05:23  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by Xeldrak**"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-26T07:37:05Z","Content":"Reading it right now, but whats the MRV?\n\n- - - Updated - - -\n\nNever mind, it\u0027s the Munar Roving Vehicle \u003E.\u003C"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-26T12:44:15Z","Content":"correct ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nOh, it\u0027s missing in the glossary. Let me fix that.\n\n**Edited \u003Ctime datetime=\u00222015-09-26T12:48:02Z\u0022 title=\u002209/26/2015 12:48  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 26, 2015\u003C/time\u003E by Xeldrak**"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-28T18:26:41Z","Content":"The crew of Odin 17. \n\n![NvUDjx5.png](http://i.imgur.com/NvUDjx5.png)\n\nThe decission to train two additional Odin crews has been criticized from many sides. But the third crew of the Odin program was thoroughly trained and is ready and eager to start its mission.\n\nOdin 17 will land near the Litwack-Valley, a part of the munar highlands, not far from the Seer 7 landing site. The exact landing zone is between the Emory crater and the valley entrance.\n\n![TaKGznX.png](http://i.imgur.com/TaKGznX.png)"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-28T18:46:56Z","Content":"Odin 18 hype!\n\nIf you\u0027re struggling with making a Soyuz, ask around on the forums for a stock one, or download the Habitat Pack, it gives a cool stockalike Soyuz capsule."},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-28T19:24:17Z","Content":"Well, first i\u0027ll have to fly Odin 17, Skylab (have to come up for a name too), and Apollo-Soyuz. Then we\u0027ll talk about Odin 18 ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nI\u0027ll build something myself. Also I\u0027m not a big fan of mods. I installed planetshine and...some...scatterthing that makes for nicer screenshots, but I\u0027m hesitant to add more mods. Especially part-mods. I like to keep the rockets stock, so it\u0027s relatable to everyone what it is capable of and so on."},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-29T15:12:44Z","Content":"I thought Apollo 18 WAS Apollo-Soyuz?"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-29T15:57:40Z","Content":"Nope, Apollo-Soyuz was officially called \u0022[Apollo–Soyuz Test Project](https://en.wikipedia.org/wiki/Apollo%E2%80%93Soyuz_Test_Project)\u0022 (ASTP). Apollo 17 was the last Apollo-mission. Also ASTP was launched almost 2 and a half years after Apollo 17.\n\n**Edited \u003Ctime datetime=\u00222015-11-30T17:24:57Z\u0022 title=\u002211/30/2015 05:24  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by Xeldrak**"},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2015-09-29T17:49:28Z","Content":"Sad news about the MRV, but solar panels would have been \u0022cheating\u0022 I guess. The actual Apollo missions did have plans in reserve in case the Rover either wouldn\u0027t deploy, or broke down along the way. It caused headaches for flight planners as they always had to ensure the astronauts had enough oxygen and coolant in reserve to walk back from any point along the EVA. So, although your mission deviated from the real flight, it was still very much in the spirit of what would have happened if the batteries had failed (minus the jetpacks!)\n\nGreat work once again."},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-09-29T17:58:32Z","Content":"Yes, I read somewhere that they would allways start with driving the maximum safe distance and then slowly work their way back to the LM. This way they could allways walk back in case of a problem."}]}