{"TopicId":119932,"ForumId":51,"TopicTitle":"Saturn Shuttle Mission Archive [SSM-17]","CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-01T22:16:17Z","PageNum":1,"Articles":[{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-01T22:16:17Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI would like to have this community to send me requests so that I can do routine missions with my \u003Ca href=\u0022https://en.wikipedia.org/wiki/Saturn-Shuttle\u0022 rel=\u0022external nofollow\u0022\u003ESaturn Shuttle\u003C/a\u003E. These can be requests for basic satellite deployment, or station modules. If you\u0027d like you can even send me your own satalites and I\u0027ll put them into whatever orbit you want me to (if the vehicle can achieve it). If you want me to add to the station I will be making in this, then tell me what to add. Like add a solar array, a science module (what kind?), etc. If your making a request up, then feel free to be original!! My SSM-2 (Saturn Shuttle Mission) consisted of me putting a satellite into orbit which had two 1m-.5m adaptors with the idea being that it is a \u0022Micro-Particle collector\u0022 which will be collected by the shuttle in a few years time. So give me whatever ideas you like! If you would like to cooperate and add to my save then let me know.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nI will also be writing down all the missions I complete here. Mission identifications are simple, as the number is always that of the last missions before it (I.e., SSM-1 (First SS mission), SSM-2 (second SS mission), etc). However if a mission is aborted during launch and the mission could not be completed, then a letter is placed behind the number, (I.e., SSM-2A (second attempt at mission 2)), the letters will continue from A (2nd attempt) to Z (27th attempt). If the mission was a failure, but the shuttle made it to orbit and returned safely, then a number with a hyphen is added (SSM-2-1). Routine missions such as refuel/resupply missions will have an R placed in front of the mission number (SSM-R2). (Complete set of examples of mission identifications, SSM-1C, SSM-R24, SSM-R9B-2, SSM-12D-6, etc)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cem\u003EThe Saturn Shuttle Program is a rich and complex series of mission filled with success and tears. We have achieved so much, but at the same time we have lost so many. This thread is home to the series of events and tales told by the members of the Saturn Shuttle Program, whether that be a crew member or from the media department. Below is a list of all the mission for the program, however I suggest reading the pages to this thread as the true story cannot be written here. So I hope you enjoy reading these tales about the Saturn Shuttle Program \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E , and that you\u0027ll stick with us through the best and the worst!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u002219ZOLZn.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/19ZOLZn.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003ESaturn Shuttles (Shuttle Orbiter Vehicle (SOV)) History\u003C/strong\u003E:\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nHercules (SOV-001): Test vehicle (Structural and Operational Testing) \u003Cstrong\u003E(Retired)\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nOdysseus (SOV-002): Test vehicle (Approach and Landing Tests), ,Both wings destroyed, hull damaged (ALT-1) ,\u003Cstrong\u003EDamaged (Retired) \u003C/strong\u003E\u003Cem\u003E(Currently owned by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150764-notagain/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022150764\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/150764-notagain/\u0022 rel=\u0022\u0022\u003E@NotAgain\u003C/a\u003E )\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nExplorer (SOV-003): Test vehicle (Approach and Landing Tests), Right wing destroyed, hull damaged (ALT-2),\u003Cstrong\u003EDamaged (Retired) \u003C/strong\u003E\u003Cem\u003E(Currently owned by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/130079-sampa/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022130079\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/130079-sampa/\u0022 rel=\u0022\u0022\u003E@Sampa\u003C/a\u003E )\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nNomad (SOV-004): Test vehicle (Approach and Landing Tests), (ALT-3) (ALT-4), (SSM-11) (SSM-14),\u003Cstrong\u003E(Destroyed)\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nHorizons (SOV-005): Orbiter, (SSM-1) (SSM-2) (SSM-3) (SSM-4) (SSM-6), \u003Cstrong\u003E(Destroyed)\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nInspiration (SOV-006): Orbiter, (SSM-6) (SSM-7) (SSM-8) (SSM-9) (SSM-10A) (SSM-12) (SSM-13),\u003Cstrong\u003E(Active)\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nDetermination (SOV-007): Orbiter, \u003Cstrong\u003E(Active)\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EMissions\u003C/strong\u003E:\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-1:\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Horizons (SOV-005)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Achieve a stable orbit around Kerbin and return back to the KSC after one orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: A instable beginning into ascent, but corrected and put into a 250km orbit. After one orbit SOV-006 rotated retrograde and fired it\u0027s OMS pods over Kerbin\u0027s deserts. SOV-006 approached the KSC Shuttle Runway at 100m/s and slightly south.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-2:\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Horizons (SOV-005)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy ParticleSat in a 250km orbit above Kerbin.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Partial Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: A perfect launch up until 67km where a \u0022phantom yaw\u0022 pulled the craft out of its stable trajectory (reason unknown). The payload was released successfully however the control unit was damaged, so a repair mission must be launched. The repair mission has been slated as SSM-2-1. The Shuttle returned perfectly with a slight southern adjustment just before landing.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-3\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Horizons (SOV-005)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy FuelSat into a 200km orbit\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Successful.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Launch was poor due to the flight computer having a yaw/roll conflict (for unknown reasons). However payload was successfully deployed and the orbiter returned safely to the KSC.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-2-1\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Horizons (SOV-005)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Capture ParticleSat and attach a new control unit to it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Launch successful. Approach was slow but successful in the end. A crew member bumped the probe, however no damage was sustained. Crew accounted for newly added spin/roll. After only a few minutes of approaching, the crew successfully grabbed ParticleSat and released it back into it\u0027s own orbit with a new control unit. A major success. A press release has been issued between the crew and a news reporter.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-4\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Horizons (SOV-005)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy H.E.R.S. into an extremely high orbit and return.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Launch successful, and drift into orbit was absolutely perfect. Best mission so far. Payload released into a 4.801km orbit. Shuttle returned at the highest speed yet (3.2km/s), however the orbiter passed just below 30km and then returned to space for a brief period before returning to Kerbin (Re-entry skip method). First night landing, successful.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-5\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Horizons (SOV-005)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Test the MMU backpack in orbit. After which, 1 crew will board the ERHS and will return to Kerbin from high orbit. Shuttle will follow up until shortly before orbit, then withdraw back into orbit where it will remain until the ERHS has been safely recovered. Then the shuttle will return to the KSC.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Partial Failure\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Launch and orbital insertion went smoothly. EMU performed well. Upon returning to the KSC, SOV-006 was shot down by a SAM. Orbiter and crew lost.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-6\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy a comsat into a polar orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Launch went well, minor failure on first stage (S-I) after separation, had no impact on orbital insertion. Payload deployed well, also performed additional tests with the EMU.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-7\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: \u003Cstrong\u003EMilitary Classified\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: \u003Cstrong\u003EN/A\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-8\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy LightSat into high orbit above Kerbin.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Launch under new protocols went well. Orbital insertion went perfectly. Payload released, however SolarPanel2 on the probe did not work, but payload engineers say it is fine and the probe will function nominally with only one panel operational. However a possible service mission may possibly occur in the future.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-9\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy StationCore into orbit above Kerbin.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Launch successful, required orbital insertion. Core deployed into a 300k x 300k orbit with minimal inclination. It has been mentioned the shuttle could attach to the station later and \u0022tug\u0022 it into different altitudes or inclinations as per scientific requirements. After deployment the orbiter performed an \u0022Emergency Return Maneuver\u0022 which involved a high power long duration burn out of Kerbin orbit and \u0022falling\u0022 to the KSC (this was a test to prove the emergency maneuver can work in case of emergency which requires it). Maneuver successful and the orbiter landed at the KSC less than an hour after launch.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-10A\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy 2 CubeSats in orbit. Deploy the AGILE probe, test remote control maneuverability and attempt to dock to Inspiration to test it\u0027s, and the orbiters docking systems.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Launch went well, minor pressure spikes at 60km, no impact on orbit. Got into a 400km v 400km orbit. Deployed CubeSat1 at apoapsis. Shortly thereafter, crew began docking and maneuver testing of the AGILE probe. Crew discovered shortly after deployment of the probe that the aft docking port had broken off, cause is unknown. However it had no impact on the testing. After they completed the testing, they redocked the probe to the orbiter and began a retroburn back to Kerbin. They deployed CubeSat2 into a orbit of 410km v 71km to test the atmospheric effects on spacecraft in low Kerbin orbit. Shortly after, the crew made the final retrofire to return home. Crew landed slightly south of the runway.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-11\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Nomad (SOV-004)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Return to StationCore in orbit of Kerbin.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Orbiter hoped into LKO and then burned at periapsis to encounter after two orbits. \u003Cem\u003ENomad\u003C/em\u003E then rendezvoused with the StationCore and docked successfully. Then they waited for the habitation module to be brought up by another space agency, however after a failure to launch (and resulting in complete vehicle destruction) the agency had to use a different booster. Nearly three weeks after launch of SSM-11, the Zuel5 booster brought the module up, and once 2km away, Jabe Kerman went on EVA using a EMU pack and oversaw the remote control docking performed by pilot Nathan and engineer Ted Kerman. After docking, Jabe Kerman returned to the orbiter and ditched the EMU in Kerbin orbit. They then returned nearly four week later, landing with a slightly northern inclination.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-12\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy classified military payload D.A.R.T. in a 200km orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Orbiter launched successfully into proper orbit and then deployed payload which control was then referred to a undisclosed source. It then returned to the KSC within an after launch. Note, SSM-12 returned prior to the return of SSM-11.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-13\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Remain in orbit for one month for life science testing aboard SciHab-2.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Orbiter launched nominally and entered a 175kmx175km orbit and remained they for 31 days. During that time the onboard crew performed astronomical observations of stars, the moons, and other planets. They also studied the planet\u0027s geomagnetic field, meteorology and atmosphere. The SciHab module also allowed scientists to record the effect of long term space flight on the crew members. On the 31st day of the mission, the crew sealed the SciHab module and began de-orbit operations. Re-entry was nominal, with a slight inclination to the north.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-M14\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Nomad (SOV-004)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy and test the Komodo vehicle on behalf of SpaceY\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Partial Failure\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Orbiter got into orbit safely and then deployed the Komodo payload. However shortly after deployment, there was a meteor strike which destroyed the rear portion of the orbiter and left it crippled. The ground team managed to quickly prep a rescue vehicle which docked to the orbiter and managed to have all crew members get aboard. However as they began to undock, the air hatch blew shooting debris everywhere, some of which penetrated the cupola module which rendered it incapable of re-entry so crew member Gus Kerman stayed onboard the orbiter and successfully de-orbited it and sadly perished as the vehicle re-entered. Gus Kerman and orbiter \u003Cem\u003ENomad \u003C/em\u003Elost over the sea to the west of the KSC.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-15\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy classified JAI military payload into specified orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Orbiter was launched successfully into it\u0027s required orbit (with a \u0026lt;1% deviation) and released it within it\u0027s fairing loose into Kerbin orbit. Orbiter then vacated the area after the onboard passengers as per JAI requests had finished their tasks. Orbiter returned safely coming in slightly south.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-16\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy 4 CubeSats into varying orbits.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Success\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: Orbiter launch was successful and after a long duration drift through the atmosphere it finally reached apoapsis where it made a final correction burn and then released the payloads. It then safely returned to the KSC after having to make a turn around. The mission was recorded by the media team on this rare occasion.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/YHy5I-RkE6M?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-17\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Determination (SOV-007)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Attach StructuralPort1 to Starlight station and perform a crew transfer.\u003Cbr\u003E\u003Cbr\u003E\nMission Result: In Preparation\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-18\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy MADS into it\u0027s required orbit as per \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/157095-valleytwo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022157095\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/157095-valleytwo/\u0022 rel=\u0022\u0022\u003E@ValleyTwo\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: In Preparation\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-19\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Determination (SOV-007)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy DoLSO and also capture PanSat-12 and perform a repair on it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Awaiting Completion of SSM-17\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-20\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Deploy Duna Sample Return mission as per the NSP ( @Ultimate Steve).\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: Awaiting Completion of SSM-18.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-21\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Determination\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Bring up SolarSegment to Starlight station and perform a crew transfer.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-22\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Launch SciHab2 into orbit above Kerbin and begin performing artificial gravity tests using the onboard propellant of the orbiter.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-23\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Determination (SOV-007)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Objective: Perform a MSD (Mass Satellite Deployment) once in an escape trajectory of Kerbin.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cu\u003ESSM-24\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSOV: Inspiration (SOV-006)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description: \u003Cstrong\u003EMilitary Classified\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Result: -\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nMission Description:\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n-\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-05T02:44:38Z\u0022 title=\u002206/05/2016 02:44  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 5, 2016\u003C/time\u003E by ZooNamedGames\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-09-01T22:35:02Z","Content":"\n\u003Cp\u003EInteresting, Mike-NZ made a saturn shuttle in his shuttle mod! Will be watching this thread.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-01T22:42:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EInteresting, Mike-NZ made a saturn shuttle in his shuttle mod! Will be watching this thread.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHowever this one is stock \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E . But good to know someone will be reading \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E . If you have any mission suggestions, please tell!\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-02T13:12:14Z","Content":"\n\u003Cp\u003EOnce SSM-2 is completed, then these are the missions so far announced:\u003C/p\u003E\u003Cp\u003ESSM-3:\u003C/p\u003E\u003Cp\u003EMission Objective: Place FuelSat1 into 150km orbit.\u003C/p\u003E\u003Cp\u003ESSM-2-1:\u003C/p\u003E\u003Cp\u003EMission Objective: To be announced\u003C/p\u003E\u003Cp\u003ESSM-4:\u003C/p\u003E\u003Cp\u003EPlace H.E.R.S. (User Submitted Craft) Into a 1,000km orbit. \u003C/p\u003E\u003Cp\u003ESSM-5:\u003C/p\u003E\u003Cp\u003EMission Objective: Orbit For 20 orbits with SpaceHab1 in the cargo bay. Then return.\u003C/p\u003E\u003Cp\u003ESSM-6:\u003C/p\u003E\u003Cp\u003EMission Objective: Deploy the Emergency Re-entry Heatshield (ERHS) on a 2,500km ballistic arc. At apoapsis, the ERHS will be jettisoned with a single crew member. The shuttle will maintain a safe distance from the ERHS, but shortly before hitting the atmosphere, the OMS pods will fire and raise its periapsis so that the orbiter will safely return to orbit after entering the atmosphere. After the ERHS safely landed, then the shuttle will also return home.\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-09-02T13:13:19Z","Content":"\n\u003Cp\u003EAny pictures of your shuttle? I want to know how you\u0027re going to balance the thing.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-02T13:27:23Z","Content":"\n\u003Cp\u003EI will add some story to these missions later on. Right now I\u0027m just learning to work the craft. I might also add Dangit, Entropy, Part Failures and KerbalMechanics later on as well, so that every mission is a bit more interesting.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yukon0009\u0022 data-cite=\u0022Yukon0009\u0022\u003E\u003Cdiv\u003EAny pictures of your shuttle? I want to know how you\u0027re going to balance the thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was going to make a image showcase tonight since tonight is my first time with a normal day this week. But I have this-\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/IS85N4x\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/IS85N4x\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(Few things have changed since that pic). It seems odd- but my design works.\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-09-02T14:02:49Z","Content":"\n\u003Cp\u003EHey, when i get home, i\u0027ll see,if i can\u0027t build you a payload. What requirements do you have?\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-09-02T14:11:14Z","Content":"\n\u003Cp\u003EO_O But how is..that..even balanced? Are there counterweights or angled engines?\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-02T14:39:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yukon0009\u0022 data-cite=\u0022Yukon0009\u0022\u003E\u003Cdiv\u003EO_O But how is..that..even balanced? Are there counterweights or angled engines?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe engines are angled just like on a normal shuttle.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EHey, when i get home, i\u0027ll see,if i can\u0027t build you a payload. What requirements do you have?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo real requirements other than it needs to fit within a medium mk3 cargo bay. Light (try to make sure it doesn\u0027t have a lot of weight) and an easily attachable node.\u003C/p\u003E\u003Cp\u003EI can\u0027t wait to see your submission!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso- make your submission stock. No mods.\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-09-02T14:44:22Z","Content":"\n\u003Cp\u003EOk! At best, i\u0027ll use mechjeb to,check,stats...don\u0027t really like how the game shows weight. Too hard to read because of its size. Will,remove mechjeb after checking.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-02T14:56:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EOk! At best, i\u0027ll use mechjeb to,check,stats...don\u0027t really like how the game shows weight. Too hard to read because of its size. Will,remove mechjeb after checking.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E . Can\u0027t wait. I\u0027ll likely move your payload up on the listing depending on some other aspects.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-03T01:30:06Z","Content":"\n\u003Cp\u003EOk! SSM-2 completed, feel free to read the mission summery. SSM-3 is in progress and is close to ending (on return trajectory). Upon completion of this mission I will upload a lot of pictures for you guys to see my CURRENT version of the Saturn Shuttle.\u003C/p\u003E\u003Cp\u003EAlso, the design progress for SOV-007, \u003Cem\u003EInspiration\u003C/em\u003E, is coming swiftly. We are predicting the 3rd generation shuttle (SOV-008) will have a significantly larger cargo bay since that would seem to be a fantastic addition to the shuttle, however for the time being \u003Cem\u003EInspiration\u003C/em\u003E will just have a modified docking port, modified landing gear setup, and a different landing chute (note, more could be added as time goes on). We expect SOV-007 to be ready around the time of SSM-20 at this rate. So stick around to see it made.\u003C/p\u003E\u003Cp\u003ELastly, noting that 1.1 is nearly here, I will have SOV-008 use the new SSME styled engines on the orbiter, however that will take testing. We predict those new engines will be stronger and therefore, SOV-008 will be slated for heavy missions or extremely high altitude. SOV-008 may be used with the Saturn Nova or other Saturn\u002B design. \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EThis is however, all hypothetical or theoretical at this point\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EPlease keep submitting! As you can see SSM-4 is slated for a user submission, and so you yours! I\u0027m glad to see this getting some attention and a positive reception. However keep the suggestions coming \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I can only provide crafts for myself for so long, eventually I will need user submissions.\u003C/p\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-09-03T04:53:42Z","Content":"\n\u003Cp\u003EI suggest a deep space probe- Jool-Eeloo maybe?\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-03T11:02:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bev7787\u0022 data-cite=\u0022Bev7787\u0022\u003E\u003Cdiv\u003EI suggest a deep space probe- Jool-Eeloo maybe?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESend it to me. Just make it fit within a medium size mk3 cargo bay.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-03T21:36:21Z","Content":"\n\u003Cp\u003EWith SSM-3 completed we move to the first ever mission which will have the shuttle rendezvous with another object in space and also attach to it.\u003C/p\u003E\u003Cp\u003EAlso the engineers are looking into a potential structural issue which has been suggested by the astronauts regarding the instability issues. They say that the phantom yaw may have been caused by an inbalence of the orbiter and the S-IIIS stage (Stage 3 Shuttle). However the engineers report that the two are balenced as they should be. The search for the cause behind the \u0022phantom yaw\u0022 continues.\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-09-04T14:28:58Z","Content":"\n\u003Cp\u003EMaybe the payload itself?\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-04T16:00:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EMaybe the payload itself?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConsidered- but we believe it isn\u0027t. If all else fails, SSM-5 will be a flight loaded with sensors and such to find the cause behind it.\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-09-04T16:08:27Z","Content":"\n\u003Cp\u003EOk, btw, we\u0027ve encountered delays in payload production. We are working on a space station core and some of our module parts were either not delivered, delivered incomplete, or were damaged.\u003C/p\u003E\n"},{"CreatedByName":"Voyager275","CreatedById":128829,"CreatedDateTime":"2015-09-04T17:12:20Z","Content":"\n\u003Cp\u003EAfter H.E.R.S is launched we hope to get T.P.F(Transiting Planet Finder) on a later mission. The parts have just been shipped so it will be awhile.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-04T17:33:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voyager275\u0022 data-cite=\u0022Voyager275\u0022\u003E\u003Cdiv\u003EAfter H.E.R.S is launched we hope to get T.P.F(Transiting Planet Finder) on a later mission. The parts have just been shipped so it will be awhile.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood news is that H.E.R.S has just been loaded into \u003Cem\u003EHorizon\u0027s\u003C/em\u003E cargo bay. She is being moved to the launchpad now. We can expect a launch later today.\u003C/p\u003E\n"},{"CreatedByName":"Voyager275","CreatedById":128829,"CreatedDateTime":"2015-09-04T17:40:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003EGood news is that H.E.R.S has just been loaded into \u003Cem\u003EHorizon\u0027s\u003C/em\u003E cargo bay. She is being moved to the launchpad now. We can expect a launch later today.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerfect. Looking forward to it.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-04T20:17:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EOk, btw, we\u0027ve encountered delays in payload production. We are working on a space station core and some of our module parts were either not delivered, delivered incomplete, or were damaged.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see. We were expecting to work on our own station core, but this will be just as desirable! Our design will be scrapped in preference to yours.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voyager275\u0022 data-cite=\u0022Voyager275\u0022\u003E\u003Cdiv\u003EPerfect. Looking forward to it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEverything is looking good. There was a slight issue with loading it into the cargo bay (the probe would load with the probe core up half way across the VAB unattached from the science lab- the heck KSP?), but we worked around it and we are counting down to launch. Into the highest possible orbit.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-04T22:12:02Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESpecial Interview with crew SSM-2-1!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENote- these are questions asked by essential media crews covering the launch. An open interview between others and the astronauts will be opened at 1pm tomorrow (9/5/15) til 5pm.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ECrew: \u003C/p\u003E\u003Cp\u003EChaddon Kerman, Male Kerbonaut, Mission Commander.\u003C/p\u003E\u003Cp\u003EPhoxy Kerman, Female Kerbonaut, Orbiter Pilot.\u003C/p\u003E\u003Cp\u003EPately Kerman, Male Kerbonaut, Navigator.\u003C/p\u003E\u003Cp\u003EKathcia Kerman, Female Kerbonaut, Payload Specialist.\u003C/p\u003E\u003Cp\u003EGemvy Kerman, Female Kerbonaut, Payload Specialist.\u003C/p\u003E\u003Cp\u003ENeilke Kerman, Male Kerbonaut, Shuttle Manipulator.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EInterview\u003C/em\u003E:\u003C/p\u003E\u003Cp\u003EReporter: So explain to me, why was this mission being held as the \u0022biggest mission\u0022 for this program thus far?\u003C/p\u003E\u003Cp\u003EChaddon: This was a major mission for the SSM-\u003C/p\u003E\u003Cp\u003EReporter: SSM?\u003C/p\u003E\u003Cp\u003EPhoxy: Saturn Shuttle Mission.\u003C/p\u003E\u003Cp\u003EReporter: Ah. Continue Chaddon.\u003C/p\u003E\u003Cp\u003EChaddon: This was a major mission for the SSM program as it required us to achieve several things that the shuttle, hypothetically, could do.\u003C/p\u003E\u003Cp\u003EReporter: What would you say is the role of the shuttle in the new world of space?\u003C/p\u003E\u003Cp\u003EPhoxy: This new shuttle system will open space up to us in a way never been accessible. Routine shuttle missions will allow us to perform service missions for companies and space agencies, along with cargo missions-\u003C/p\u003E\u003Cp\u003EReporter: Such as the launch of the ParticleSat?\u003C/p\u003E\u003Cp\u003EPhoxy: Yes.\u003C/p\u003E\u003Cp\u003EReporter: Let me get a bit of background here and ask the person who is responsible for the ParticleSat, two time kerbonaut, Kathcia Kerman.\u003C/p\u003E\u003Cp\u003EKathcia: Hello.\u003C/p\u003E\u003Cp\u003EReporter: So explain to me, what happened to the ParticleSat on SSM-2?\u003C/p\u003E\u003Cp\u003EKathcia: Well when it was deployed we discovered several issues with the probe. One of which being that the control unit was damaged.\u003C/p\u003E\u003Cp\u003EReporter: How so?\u003C/p\u003E\u003Cp\u003EKathcia: Well for some reason, between loading ParticleSat into the payload bay and orbital deployment, the probe got damaged.\u003C/p\u003E\u003Cp\u003EReporter: I have looked into the launch profile for the Saturn Shuttle design, and also talked to a few previous kerbonauts which rode aboard the Saturn V which was bound for the Mun several years ago, and the Saturn launch vehicle does have quite a violent shaking and rattling, could that possibly caused the damage?\u003C/p\u003E\u003Cp\u003EKathcia: Possible, but we believe it was caused by something else as the cargo bay cameras show that the cargo protection system-\u003C/p\u003E\u003Cp\u003EReporter: The CPS.\u003C/p\u003E\u003Cp\u003EKathcia: The Cargo Protection System did it\u0027s job and it was not shaken apart during launch.\u003C/p\u003E\u003Cp\u003EReporter: Well, better question, what kind of damage did it receive?\u003C/p\u003E\u003Cp\u003EKathcia: Blunt force to the side of the probe.\u003C/p\u003E\u003Cp\u003EReporter: But wouldn\u0027t that ruin the probe? Damage the delicate systems?\u003C/p\u003E\u003Cp\u003EKathcia: So we thought, but after reading select data being transmitted through the Direct Communication System-\u003C/p\u003E\u003Cp\u003EReporter: Direct Communication System?\u003C/p\u003E\u003Cp\u003EChaddon: It\u0027s a transmission system which has a short 24 hour battery after launch which transmits probe telemetry over a short distance.\u003C/p\u003E\u003Cp\u003EReporter: Whats it for? Why not use a normal communication system?\u003C/p\u003E\u003Cp\u003EChaddon: The DCS, Direct Communication System, is apart of all probes so that in the event of a failure, such as the one on ParticleSat, we can still identify the status of the spacecraft.\u003C/p\u003E\u003Cp\u003EReporter: Ah I see. Back to Kathcia, why didn\u0027t you see this before you deployed the probe? Why didn\u0027t you see a reading from the probe when it was damaged.\u003C/p\u003E\u003Cp\u003EKathcia: We are again, uncertain and looking into it. We believe it was caused by a disconnect in some wires between the orbiter and the CPS.\u003C/p\u003E\u003Cp\u003EReporter: Hm. Now, I\u0027m curious, Pately, what do you do as a \u0022Navigator\u0022? Doesn\u0027t the Orbiter Pilot navigate the spacecraft?\u003C/p\u003E\u003Cp\u003EPately: The Orbiter Pilot simply flies the spacecraft, I plot out when to make a burn to match with our target, for how long to burn, and when to perform other mission critical maneuvers. \u003C/p\u003E\u003Cp\u003EReporter: However in a time of crisis, the pilot outranks you?\u003C/p\u003E\u003Cp\u003EPately: Technically, yes. But if there\u0027s an emergency, my role is unnecessary.\u003C/p\u003E\u003Cp\u003EReporter: What have you found, in your months of training, about flying the Saturn Shuttle Orbiter? You are a two time kerbonaut and a man to land on the Mun. How does this new vehicle stand up to the old time space capsules?\u003C/p\u003E\u003Cp\u003EPately: I have seen that it is a delicate, yet amazing powerful spacecraft. The thing about the old time Kerpollo rocket systems, is that it was designed to do one job and one job only.\u003C/p\u003E\u003Cp\u003EReporter: To go to the Mun.\u003C/p\u003E\u003Cp\u003EPately: Yes. The Saturn Shuttle is amazing as it can do so many things, it has such a wide verity of tasks it can undertake. \u003C/p\u003E\u003Cp\u003EReporter: Indeed, and in fact the Saturn Shuttle system saw it\u0027s way into the military as well. Anyone of you can answer, but are you aware of any upcoming military missions?\u003C/p\u003E\u003Cp\u003E[Momentary Silence]\u003C/p\u003E\u003Cp\u003EChaddon: This is a tough subject, if any of us know about a military mission, then we\u0027re not allowed to talk about it.\u003C/p\u003E\u003Cp\u003EReporter: That makes sense, I was just curious if any were low enough class to be mentioned.\u003C/p\u003E\u003Cp\u003EChaddon: There are no military missions, that we know of, which we can discuss here today. \u003C/p\u003E\u003Cp\u003EReporter: I see. Do you think you could discuss how the orbiter could be used in military missions?\u003C/p\u003E\u003Cp\u003EPhoxy: The orbiter, as we have already said, has a very wide range of missions it can perform. It is possible for the orbiter to perform high orbit reconnaissance. It is possible that it could deploy weaponry to the surface, or it could deploy military payload into orbit.\u003C/p\u003E\u003Cp\u003EReporter: Wow... so this could be the next line of warfare?\u003C/p\u003E\u003Cp\u003EChaddon: Unlikely. The military has been inquiring about using spacecrafts for military purposes since the beginning, but as you can see, nothing has really happened yet.\u003C/p\u003E\u003Cp\u003E[Voice from off tape]\u003C/p\u003E\u003Cp\u003EReporter: I was informed we only have a few more minutes, so I turn to Gemvy. You were the one who designed and deployed the object which saved the day and allowed for ParticleSat to successfully. What lead to the design of this \u0022object\u0022? What is it?\u003C/p\u003E\u003Cp\u003EGemvy: I was called onto this project soon after it was discovered that the probe was faulty. So I worked heavily with lead ParticleSat engineer, Jurry Kerman, which lead to us discovering an issue with a spacecraft never before encountered, there was nothing to attach to.\u003C/p\u003E\u003Cp\u003EReporter: So you designed this \u0022claw\u0022?\u003C/p\u003E\u003Cp\u003EGemvy: The SSM program was already designing a attachment device known as the KanadArm which will allow the orbiter to attach to any object it needs to in space. So I simplified the design, removing all joints and moving parts, so that it had only one function, a magnetic attachment device at the end of it, so that it would attach to the probe and then we could detach it from the orbiter, so that it could save the probe.\u003C/p\u003E\u003Cp\u003EReporter: I know this is a late question, but why save this probe? Why not just launch another?\u003C/p\u003E\u003Cp\u003EKathcia: It was decided to save the probe for many reasons, the biggest being that the cost of launching another would be more costly than launching a repair mission. Also it was decided that it would be worth while to test the Saturn Shuttle mission and see how it operated under a real repair mission, which was one of it\u0027s prime mission types.\u003C/p\u003E\u003Cp\u003EReporter: I see. This is also the most difficult... attachment? Mission?\u003C/p\u003E\u003Cp\u003EChaddon: (Laughs) Yeah, this was a very challenging mission for Neilke.\u003C/p\u003E\u003Cp\u003EReporter: Right, especially since he was a rookie kerbonaut. Why rookie? Why not choose a highly experienced kerbonaut? This is a high priority mission, wouldn\u0027t you trust this mission in the hands of someone with more experience?\u003C/p\u003E\u003Cp\u003EChaddon: It was decided that the experienced kerbonauts which have had previous space missions would have a \u0022control bias\u0022-\u003C/p\u003E\u003Cp\u003EReporter: \u0022Control Bias\u0022?\u003C/p\u003E\u003Cp\u003EPhoxy: Basically it was determined that any kerbonaut with flight experience would have to relearn the orbital flight mechanics, so it\u0027s easier and more desirable to just train new kerbonauts rather than train existing ones.\u003C/p\u003E\u003Cp\u003EReporter: But your supposed to be smart enough to overcome this, right?\u003C/p\u003E\u003Cp\u003ENeilke: Smart enough, yes. But its cheaper and easier not to.\u003C/p\u003E\u003Cp\u003EReporter: Ah, money is a controlling factor I see.\u003C/p\u003E\u003Cp\u003EChaddon: It always is.\u003C/p\u003E\u003Cp\u003EReporter: Indeed. Back to Neilke\u0027s successful work with the orbiter\u0027s control systems. Obvious question here, but how much of a challenge was it?\u003C/p\u003E\u003Cp\u003ENeilke: It was a challenge. A serious challenge, but the thing is I had simulated performing the mission so many times in training that it was natural.\u003C/p\u003E\u003Cp\u003EReporter: What was the hardest part of it for you?\u003C/p\u003E\u003Cp\u003ENeilke: A personal error lead to being a bit of a harder issue.\u003C/p\u003E\u003Cp\u003E[sSM-2-1 crew chuckes]\u003C/p\u003E\u003Cp\u003EReporter: \u0022Personal Error\u0022?\u003C/p\u003E\u003Cp\u003ENeilke: Weellll.... When we first approached, I accidentally nudged the probe and put it into a spin.\u003C/p\u003E\u003Cp\u003EReporter: Did you damage ParticleSat?\u003C/p\u003E\u003Cp\u003ENeilke: No, it was fine.\u003C/p\u003E\u003Cp\u003EReporter: How did you account for your collision?\u003C/p\u003E\u003Cp\u003ENeilke: I just moved the shuttle with it in the direction I bumped it. So it basically in relation to us in the orbiter, stopped moving.\u003C/p\u003E\u003Cp\u003EReporter: I remember reading about how you caused a roll in your collision?\u003C/p\u003E\u003Cp\u003ENeilke: You read that did you?\u003C/p\u003E\u003Cp\u003EReporter: I did.\u003C/p\u003E\u003Cp\u003ENeilke: I did in fact cause a roll in the collision... which I didn\u0027t account for. Since it wasn\u0027t moving in relation to us, aside from the roll, I just waited for when it was in a stable position and moved in. The Magnetic draw of the claw actually killed some of the rotation, and over a period of several minutes it reduced it to almost none.\u003C/p\u003E\u003Cp\u003EReporter: Great work on your part.\u003C/p\u003E\u003Cp\u003ENeilke: Thank you.\u003C/p\u003E\u003Cp\u003EReporter: I hear we are all out of time with the SSM-2-1 crew today. Thank you for tuning in, and if you\u0027d like to hear more, tune in next time to SpaceSpot on KNN.\u003C/p\u003E\u003Cp\u003E[End of Interview]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Voyager275","CreatedById":128829,"CreatedDateTime":"2015-09-05T03:18:10Z","Content":"\n\u003Cp\u003ECan Voyager Nation become the prime contractor for your SSM missions?\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-09-05T03:35:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voyager275\u0022 data-cite=\u0022Voyager275\u0022\u003E\u003Cdiv\u003ECan Voyager Nation become the prime contractor for your SSM missions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe SSM program would gladly like to have Voyager Nation to be our primary contractor.\u003C/p\u003E\n"}]}