{"TopicId":122461,"ForumId":51,"TopicTitle":"Road to Kolonists","CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-06T20:47:17Z","PageNum":1,"Articles":[{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-06T20:47:17Z","Content":"\n\u003Cp\u003EHail to everyone. After some request, I decided to begin the translation of my science career mode also in english. You can find the original (still in progress) here: \u003Ca href=\u0022http://www.kerbalspaceprogram.it/forum/viewtopic.php?f=9\u0026amp;t=1791\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalspaceprogram.it/forum/viewtopic.php?f=9\u0026amp;t=1791\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe goal is simple: colonize the entire Kerbol system.\u003C/p\u003E\u003Cp\u003EThe game is a Science mode, normal difficulty, no revert or quick load unless bug or glitches.\u003C/p\u003E\u003Cp\u003EThere are a lots of mods involved, most important are: Interstellar Extended, FAR, B9 (maintenance port), KW Rocketry.\u003C/p\u003E\u003Cp\u003EOur story begin after we went to the Mun and Minmus, and we have some interplanetary probes on their route to Duna, Moho and Dres. We built our first Space Station (at half), the KSS.\u003C/p\u003E\u003Cp\u003EThis is our tech tree when our story begins:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/XFP3oI2.png\u0022 alt=\u0022XFP3oI2.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd that\u0027s our Space Station KSS (Kerbal Space Station)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/ADlmwEY.png\u0022 alt=\u0022ADlmwEY.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/G69LZu6.png\u0022 alt=\u0022G69LZu6.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAcrÃƒÂ¬tually it has one year of LF. Every three months, the crew is replaced and the LS replaned.\u003C/p\u003E\u003Cp\u003EAfter more than 150 days of travel in the cold interplanetary space, the Moho probe finally approach the hottest planet of the solar system\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/sIHrCwF.png\u0022 alt=\u0022sIHrCwF.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe ship has been built with many km/s of Delta/V for the braking near the planet. I begin to brake very soon, using half of the remaining first stage fuel, that will crash on the surface of Moho.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/6goU0yz.png\u0022 alt=\u00226goU0yz.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe remaining fuel comes from the second stage, planned for the brake, trying to maintain a 10 km periapsis\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/hshWGqX.png\u0022 alt=\u0022hshWGqX.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EWith focus and patience, the probe obtain a more or less perfect orbit near the little planet\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/hnJLwi7.png\u0022 alt=\u0022hnJLwi7.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EWe gather scientific data from orbit, but, why not? After such a long trip, we\u0027ll try to land, to gather data from the surface, and to use the Material Bay of the probe.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Z1BUzym.png\u0022 alt=\u0022Z1BUzym.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/1mQlqBe.png\u0022 alt=\u00221mQlqBe.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003ESadly the probe has not landing legs, so it must land o the engine\u0027s bell, straight just for the Moho\u0027s low gravity and for the low power of the SAS, so, to avoid damages, the probe stand on the surface just for few moments, and return fastly in orbit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/2pYcBA0.png\u0022 alt=\u00222pYcBA0.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EReached the orbit, we realize two things: first, the heating is really dangerous near Moho, we need a lot of radiators for the Waste Heat (we must think about it for future landers), second, we haven\u0027t enough fuel to return to Kerbin.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/zQhi67O.png\u0022 alt=\u0022zQhi67O.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EBy the Way, sent the data back to the Mission Control, we leave the probe parked in Moho\u0027s orbit. maybe tomorrow, if it still works, it will be useful to gather data of the internal composition of Moho, as an Impactor probe.\u003C/p\u003E\u003Cp\u003EMeanwhile, in the NSC (Nansuchao Space Corporation) shipyard, another secret mission is ready to launch, with a secret payload, hide in the fairings of the rocket. it will be useful for an experiment about the heat.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/1jdlqlq.png\u0022 alt=\u00221jdlqlq.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe rocket depart straight to the outer space, without any kind of gravity turn.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/PCAF3Zt.png\u0022 alt=\u0022PCAF3Zt.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/oQvdHD8.png\u0022 alt=\u0022oQvdHD8.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter the first stage separation, we can take a look at hte payload.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/4WmJwOG.png\u0022 alt=\u00224WmJwOG.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EA new Sentinel Telescope and a lot of solar panels, to have data about the accumulation and dispersion of heat. The scope will be parked in a orbit between Kerbin and Eve, searching for killer asteroids.\u003C/p\u003E\u003Cp\u003EThanks to the data came from Moho, we\u0027re able to put our hands on new technologies, that will be very useful very soon. What am I talking about?\u003C/p\u003E\u003Cp\u003EYou will know it very soon...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-01T20:06:05Z\u0022 title=\u002211/01/2015 08:06  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 1, 2015\u003C/time\u003E by Nansuchao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2015-10-07T01:53:56Z","Content":"\n\u003Cp\u003EVery cool. \u002B Rep.\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-07T07:11:25Z","Content":"\n\u003Cp\u003EThanks Signo :-)\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-07T10:44:32Z","Content":"\n\u003Cp\u003EThanks to the scientific data received from Moho, the NSC can obtain very useful augers and ISRU, perfect to reach an important goal, to gather more data as possible from the Mun in a single mission.\u003C/p\u003E\u003Cp\u003ESo, Frodorf and Jangrid says goodbye to Kerbin, in the fairing of the first part of the Munar Harvester.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Y6r53jA.png\u0022 alt=\u0022Y6r53jA.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/o4y2trV.png\u0022 alt=\u0022o4y2trV.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/59zVeI4.png\u0022 alt=\u002259zVeI4.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter few days, it\u0027s the time for another launch, the second and third part of the Mun Harvester.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/CK9wNY7.png\u0022 alt=\u0022CK9wNY7.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/JLjxnFr.png\u0022 alt=\u0022JLjxnFr.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, here you\u0027ll see an example af bad engineering. I prepared the Mun Harvester completely in the VAB. Sure that it had everithing needed, I split it for the launch. For the main stage, I had no issues, but for the side stages, I decided to make a single launch, so i tied the parts together inside the fairings. For a payload like this, I\u0027ll needed surely more struts.\u003C/p\u003E\u003Cp\u003EJust after the liftoff, the rocket began to wobble, and so it did in orbit.\u003C/p\u003E\u003Cp\u003ELuckily, with patient and cold blood (and with some saints), we\u0027ve been able to deliver the payload at his destination, docking the parts eyeballing the entire process.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Go6XrZa.png\u0022 alt=\u0022Go6XrZa.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, we miss just the last part before the beginning of this journey.\u003C/p\u003E\u003Cp\u003ELodas and Samnica prepares to depart. Samnica will be the third member of the Mun Harvester crew, while Lodas must accomplish a really important engineer operation. To mount some struts on the Mun Harvester, to make it stable.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/A8iPhm4.png\u0022 alt=\u0022A8iPhm4.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Q4pjISO.png\u0022 alt=\u0022Q4pjISO.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/vzSCOx8.png\u0022 alt=\u0022vzSCOx8.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EParked the Spare Engineering near the Mun Harvester, we see Lodas during this important procedure (thanks to KIS/KAS). \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/3P9vAfT.png\u0022 alt=\u00223P9vAfT.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003ESamnica reach the Mun Harvester, the crew check all the system, and it\u0027s time to leave the orbit of Kerbin.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/zrVwNyQ.png\u0022 alt=\u0022zrVwNyQ.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/9jjG6T4.png\u0022 alt=\u00229jjG6T4.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAs soon as the ship enter the Mun\u0027s SOI, we have the first issue of the mission.When the engines are burning, the Mun harvester seems completely out of control, after a 10% ratio of throttle. The ships seems went crazy, and the Mission Control prepare itself and the crew for the Abort, that means to park the ship in munar orbit and wait for a rescue mission.\u003C/p\u003E\u003Cp\u003EBut when everithing seemed lost, Frodorf had a genial idea. Seen that the ship has some torque and the vehicle isn\u0027t so heavy, maybe it will be possible to control it without the engine\u0027s gimbal. Mission Control authorize this try, Frodorf deactivate the engine\u0027s gimbal and miracle, the Mun Harvester has control again. The crew were so able to land safely on the Mun and begin the mission.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/daPIzmX.png\u0022 alt=\u0022daPIzmX.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe girls stays in the lab, gathering and analyzing data, while Frodorf stretch his legs on the Munar soil, to collect sample of the surface and to put a flag.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/2H8tIbH.png\u0022 alt=\u00222H8tIbH.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe area where the Mun Harvester has landed isn\u0027t rich of Ore, so it must stay there for a while, to refill the fuel tanks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-01T20:09:36Z\u0022 title=\u002211/01/2015 08:09  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 1, 2015\u003C/time\u003E by Nansuchao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-08T18:53:38Z","Content":"\n\u003Cp\u003ESeen that there is still a month for the Tars probe to reach Duna, the leaders of NSC decide to begin a new, very important experimet. So, Jebediah Kerman, the best pilot of NSC, has to pilot a new plane, to test it, and gather info on the atmosphere of Kerbin, reaching the South Pole. There, he must find a good spot, for a future building.\u003C/p\u003E\u003Cp\u003EHere we have Jebediah ready to depart aboard the marco Polo\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/ctGXIMa.jpg\u0022 alt=\u0022ctGXIMa.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a long travel, but everithing goes well.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/QjnJ10i.jpg\u0022 alt=\u0022QjnJ10i.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EFinally, after a really boring journey, Jeb reach the South Pole\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/xQG6Hx6.jpg\u0022 alt=\u0022xQG6Hx6.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EJeb dump some fuel for safety reasons. The plane was never tested, so, for a better landing he will make the ship lighter. Jeb found the spot he was looking for, and he marks it with a flag.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/DL0OFPf.jpg\u0022 alt=\u0022DL0OFPf.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter few hours, at the KSC, a new rocket is ready to launch. It\u0027s the new SpaceZ Dragon VK1 (fantasy name), drove by Neilfred Kerman, It must reach the KSS, to deliver a new structural part and to change some of the crew.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/RxtJRmL.jpg\u0022 alt=\u0022RxtJRmL.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe journey begin\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/wEhuIHB.jpg\u0022 alt=\u0022wEhuIHB.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/YLzuiHh.jpg\u0022 alt=\u0022YLzuiHh.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003ESadly the launch happened in a bad moment, so Neilfred had to work for a while to find a good rendez-vous with the station. But finally, the long months of training are helpful, and the Dragon VK1 is able to reach the KSS.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/pYlbtxk.jpg\u0022 alt=\u0022pYlbtxk.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter the docking, the structural Hub is delivered to the station, and Neilfred wait that Valentina and Bill reach the capsule. Those two seems sad to leave the station.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Hs8CX1k.jpg\u0022 alt=\u0022Hs8CX1k.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThen it\u0027s time for the little ship to return to Kerbin\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/J0OWTNj.jpg\u0022 alt=\u0022J0OWTNj.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/gfst0lO.jpg\u0022 alt=\u0022gfst0lO.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EMeanwhile, on the Mun, the crew of the Mun Harvester is still busy analyzing the data and filling the tanks, so they ask to the Mission Control, to deorbit one of the munar satellites, to make it impact on the surface, for a better comprehension of the inner part of Mun.\u003C/p\u003E\u003Cp\u003EThe Mission Control, do a fast check of the two satellites in Mun orbit. One has no engines, but the other, has ended is job and it\u0027s not more useful. So it is deorbited.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/P3gcJV7.jpg\u0022 alt=\u0022P3gcJV7.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/FezXur7.jpg\u0022 alt=\u0022FezXur7.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom the impact on the surface, a lot of data are generated.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/m8gZhFK.jpg\u0022 alt=\u0022m8gZhFK.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks to this experiment, new parts for planes and spaceplanes are created, for the future ships.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/TCneVHC.png\u0022 alt=\u0022TCneVHC.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003ENow the thing become to be interesting. What will we discover on Duna? How the Mun Harvester\u0027s mission will go?\u003C/p\u003E\u003Cp\u003EYou will know it soon...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-01T20:12:07Z\u0022 title=\u002211/01/2015 08:12  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 1, 2015\u003C/time\u003E by Nansuchao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-18T18:08:27Z","Content":"\n\u003Cp\u003EAt the KSC engineers and scientists are still working on new projects, when finally the Tars probe enter the SOI of Duna. the Tars tried an aerobraking, but the periapsis was too high, and it had to ignite the engines for a few seconds to enter in a stable orbit. Luckily the Hohmann transfer was perfect, so just a few m-s of Delta/V made the job.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/bfUBf8n.png\u0022 alt=\u0022bfUBf8n.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAt this point, the Mission Control decide to change the flight plan. The probe had to gather data from the orbit or from the high atmosphere and return to Kerbin. But this probe has just two reloadable experiments and it\u0027s very old, so the Mission Control made the probe do a Hohmann trasnfer to Ike\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/sWR0gJj.png\u0022 alt=\u0022sWR0gJj.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003ETars gathered data from the orbit, and it lands too, for more data\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/EnmUW5g.jpg\u0022 alt=\u0022EnmUW5g.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003Eafter a succesful landing, free from the second stage, Tars do a maneuver to escape the Ike\u0027s gravity to encounter once again the atmosphere of Duna, with the goal to land on the red planet.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/dhgU3sY.png\u0022 alt=\u0022dhgU3sY.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/oRNO3hl.jpg\u0022 alt=\u0022oRNO3hl.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/t0KtDM1.png\u0022 alt=\u0022t0KtDM1.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/7neuTd1.png\u0022 alt=\u00227neuTd1.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe landing is successful, after some troubles during the atmospheric flight.\u003C/p\u003E\u003Cp\u003EHere ends the Tars chapter, our first probe to land on two different bodies, sending back to Kerbin a great quanity and variety of informations.\u003C/p\u003E\u003Cp\u003EWELL DONE TARS!!!\u003C/p\u003E\u003Cp\u003EMeanwhile, on the MUn, the Mun Harvester has finally re-filled the fuel tanks, and it\u0027s ready for the second stage of his journey. The vehicle make a short burn to the south, reaching the East Crater zone, gathering a good amount of data\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/B65gzD2.jpg\u0022 alt=\u0022B65gzD2.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Mcimq9s.png\u0022 alt=\u0022Mcimq9s.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EDuring a couple of EVA, made for the healt of the crew, two Gigantor were lost (due to collisions bug). The mission is still in go, but the Mission Control has to worry about the safety of the crew.\u003C/p\u003E\u003Cp\u003EThanks to all the data gathered on the last missions, it\u0027s time for the NSC to start a new, long waited project, that will be very important for the future of Kerbalkind. What am I talking about? You\u0027ll know it soon...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-01T20:13:56Z\u0022 title=\u002211/01/2015 08:13  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 1, 2015\u003C/time\u003E by Nansuchao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-31T09:01:45Z","Content":"\n\u003Cp\u003EHave a good Halloween night, from the NSC and all the Road to Kolonists staff\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fv587hh.png\u0022 alt=\u0022fv587hh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thegamer211","CreatedById":149354,"CreatedDateTime":"2015-10-31T09:14:06Z","Content":"\n\u003Cp\u003EUmm... your spoiler tags don\u0027t work.\u003C/p\u003E\u003Cp\u003EThey are supposed to be like [ spoiler=name ] stuff [ /spoiler ]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003Estuff\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-31T09:19:38Z","Content":"\n\u003Cp\u003EThanks for the tip, it works in the other forum... I\u0027ll change the tag ASAP.\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-11-09T08:39:12Z","Content":"\n\u003Cp\u003EThanks to the data received from the various missions, the NSC is able to reach a very important milestone: dominate the power of atom!\u003C/p\u003E\u003Cp\u003ESo a little nuclear reactor is build up, a Molten Salt. This little device is not able to generate great energy, but together with a new experimental engine, it gives interesting results.\u003C/p\u003E\u003Cp\u003EThe air gathered from a plane, is heated up from the reactor and expelled at great speed from the new born Thermal Turbo Jet. This engine has not a great thrust, but has the advantage that it doesn\u0027t need propellant also than air, so it can work almost forever, until the reactor works.\u003C/p\u003E\u003Cp\u003ESo, secretly, a new vehicle is realized for a secret mission, with the only crew of Calzer Kerman.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/LzUbazG.jpg\u0022 alt=\u0022LzUbazG.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe new plane works really well, light and stable.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/inbIg38.jpg\u0022 alt=\u0022inbIg38.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EFollowing his orders, Calzer flies through the North. In a past mission with Jebediah, his instrumentation found something unusual. A satellite in polar orbit has a strange reading of the same area, so the mission of Calzer is to reach that zone to check the place with his eyes.\u003C/p\u003E\u003Cp\u003EReached the icy and cold North Pol, Calzer sees something absolutely amazing, unwaited and terribly alien. \u003C/p\u003E\u003Cp\u003EHe lands his plane near the strange object to look it from near.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Zd8EfuF.jpg\u0022 alt=\u0022Zd8EfuF.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Yp4XJdM.jpg\u0022 alt=\u0022Yp4XJdM.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter the inspection, Calzer comes back to his plane terribly scarred. What he has found is surely alien.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/FmSkyLd.jpg\u0022 alt=\u0022FmSkyLd.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EMeanwhile, at the KSC, a new rocket is ready on the launchpad. A new scientific lab for the space station.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/YUmMdMR.jpg\u0022 alt=\u0022YUmMdMR.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/QFlq5Fh.png\u0022 alt=\u0022QFlq5Fh.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/QUG5pN1.png\u0022 alt=\u0022QUG5pN1.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks to the Mun Harvester success on Mun, the same way will be followed to gather data from the farthest moon of Kerbin, Minmus.\u003C/p\u003E\u003Cp\u003ENeides and Madry will be the crew of the Minmus Exploit Greenish.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/2ogIkSi.jpg\u0022 alt=\u00222ogIkSi.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/noqQkcm.jpg\u0022 alt=\u0022noqQkcm.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThen, it\u0027s finally time to pose the first stone of a long awaited project, that will be very useful for the future of KSC and all kerbalkind. This new endeavour will be accomplished not in some far corner of the Kerbol syste, but here on Kerbin, in that area found by Jebediah Kerman in a past flight in the South Pole.\u003C/p\u003E\u003Cp\u003EFor this missione, a new plane is used, the Base Plane Ikea . Flew by Jeb, Bill, Bob and Val, it take off for the first step of this ambitious project.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/3iIJX31.jpg\u0022 alt=\u00223iIJX31.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/FQoJruz.jpg\u0022 alt=\u0022FQoJruz.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Ou71uVs.jpg\u0022 alt=\u0022Ou71uVs.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter a long and boring travel, the four reach the South Pole and delivers the first Kerbal Base.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/OgTA8iL.jpg\u0022 alt=\u0022OgTA8iL.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the next few weeks, various interplanetary windows are available, so two new modular probes are sent in the outer space. One of those will reach the hot planet of Moho, while the other one would try to gather info from the planet of Eve and from his little moon Gilly. This probe has a new engine, another application of the new nuclear technology, a NERVA engines.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/0l1lwAJ.jpg\u0022 alt=\u00220l1lwAJ.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EHow these new probes will perform? How the South Pole Base will be completed? What about the consequences of the strange, alien object found at the North Pole?\u003C/p\u003E\u003Cp\u003EWait and you\u0027ll know it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-09T08:41:19Z\u0022 title=\u002211/09/2015 08:41  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 9, 2015\u003C/time\u003E by Nansuchao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-11-13T12:16:57Z","Content":"\n\u003Cp\u003EDue to the 1.0.5 update I\u0027ll be unable to continue Road to Kolonists. If someone is interested in watch the complete story (until the update), look there: \u003Ca href=\u0022http://www.kerbalspaceprogram.it/forum/viewtopic.php?f=9\u0026amp;t=1791\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalspaceprogram.it/forum/viewtopic.php?f=9\u0026amp;t=1791\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"KronosHelix","CreatedById":154270,"CreatedDateTime":"2016-04-28T02:01:25Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/135151-nansuchao/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022135151\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/135151-nansuchao/\u0022 rel=\u0022\u0022\u003E@Nansuchao\u003C/a\u003E I know that you stop adding to this post due to 1.0.5 update, but I\u0027m sure you can start again with 1.1, most mods listed are available once again. The only thing you have worry about now is getting bored repeating the same missions from the original mission.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2016-04-28T04:15:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222544749\u0022 data-ipsquote-contentid=\u0022122461\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461808885\u0022 data-ipsquote-userid=\u0022154270\u0022 data-ipsquote-username=\u0022KronosHelix\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, KronosHelix said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/135151-nansuchao/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022135151\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/135151-nansuchao/\u0022 rel=\u0022\u0022\u003E@Nansuchao\u003C/a\u003E I know that you stop adding to this post due to 1.0.5 update, but I\u0027m sure you can start again with 1.1, most mods listed are available once again. The only thing you have worry about now is getting bored repeating the same missions from the original mission.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks, I would like to, but if you saw the original thread, I almost reached every inner planet with manned missions and sent some proves to the OPM.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t repeat all the missions, with the same design and now I would like to use also other mods, but actually KSP 1.1 is complete broken for me, unplayable stock too.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe, once 1.1.1 is out, if possible I would like to begin something new, with a different planet pack.\n\u003C/p\u003E\n"},{"CreatedByName":"TopHeavy11","CreatedById":154744,"CreatedDateTime":"2016-04-28T12:13:56Z","Content":"\n\u003Cp\u003E\nAmazing! Mod list PLEASE.\n\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2016-04-28T12:22:46Z","Content":"\n\u003Cp\u003E\nThank you very much.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMod list, incomplete, but here it is:\n\u003C/p\u003E\n\u003Cp\u003E\nB9 Aerospace\u003Cbr\u003E\nKW Rocketry\u003Cbr\u003E\nInterstellar Extended\u003Cbr\u003E\nVanguard Technologies\u003Cbr\u003E\nFerram Aerospace Research\u003Cbr\u003E\nAmbient Light Adjustement\u003Cbr\u003E\nTAC Life Support\u003Cbr\u003E\nTAC Fuel Balancer\u003Cbr\u003E\nInfernal Robotics\u003Cbr\u003E\nKerbal Alarm Clock\u003Cbr\u003E\nMechjeb\u003Cbr\u003E\nKerbal Renaissance Compilation\u003Cbr\u003E\nChatterer\u003Cbr\u003E\nDocking Alignement Indicator\u003Cbr\u003E\nG-Effects\u003Cbr\u003E\nTransfer Windows Planner\u003Cbr\u003E\nKerbal Inventory System\u003Cbr\u003E\nKerbal Attachment System\u003Cbr\u003E\nActive Texture Management\u003Cbr\u003E\nKerbal Planetary Base System\u003Cbr\u003E\nRaster Prop Monitor\u003Cbr\u003E\nTweakscale\u003Cbr\u003E\nTweakable Everything\u003Cbr\u003E\nModular Computer Package\u003Cbr\u003E\nReal Chute\u003Cbr\u003E\nKerbal Joint Reinforcement\u003Cbr\u003E\nKerbal Engineer\u003Cbr\u003E\nBetter buoyancy\u003Cbr\u003E\nSETI Greenhouse\u003Cbr\u003E\nCrowd sourced science\n\u003C/p\u003E\n\u003Cp\u003E\nRemember, this was in KSP 1.0.4\n\u003C/p\u003E\n"},{"CreatedByName":"TopHeavy11","CreatedById":154744,"CreatedDateTime":"2016-04-28T12:23:45Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E I\u0027m going to need moar wings...\n\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2016-04-28T12:24:41Z","Content":"\n\u003Cp\u003E\nB9 Procedural Wings were perfect \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"}]}