{"TopicId":122954,"ForumId":51,"TopicTitle":"Duna Direct (Pic Heavy, Mission Patches!)","CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-10-13T18:27:57Z","PageNum":1,"Articles":[{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-10-13T18:27:57Z","Content":"\n\u003Cp\u003EHey everyone! So to celebrate The Martian coming out, I formed my own \u0022Duna Direct\u0022 type mission. For the past few weeks, I\u0027ve been modding, paper planning, and executing this crazy long mission plan. \u003C/p\u003E\u003Cp\u003EIn the long run, the goal is simply to have a manned mission on the surface of Duna. To do this, I needed to: design and build a mobile space station; assemble the station in Kerbin orbit; find a pick an area to land that is relatively flat and contains ore; scout it ahead of time with satellites, probes, and rovers; design and test all spacecraft and landing systems; send in advance the ascent vehicle, resource converter, and manned rover; pack enough fuel and supplies to the space station; build and test the descent vehicle; dock the ascent vehicle to the station; and finally carry out the mission. \u003C/p\u003E\u003Cp\u003EIt all started with the Moses IV. Moses is an acronym that stands for Mobile Orbiting Station for Exploration and Science. It was built all together at once, then broken apart into subassemblies and sent in three different robotic launches, which all docked with each other in Kerbin orbit. It\u0027s expensive, but reliable. The whole thing cost around 1.5 million funds, which is pretty staggering when you know that it only costs 90,000 funds to get three kerbals into orbit. \u003C/p\u003E\u003Cp\u003EThe station consists of three main sections: The CSM (Command/Service Module) which contains the cockpit, communications devices, batteries, food supplies, and KIS storage space; the PSM (Power/Supply Module) which contains mostly Xenon fuel, a little monopropellant, and the main solar panels and docking hub; and the ERM (Engine/Reactor Module) which contains more solar panels, thermal radiators, the nuclear reactor, and the electric-ion engines.\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022http://i.imgur.com/Ijw5EtW.png\u0022 alt=\u0022Ijw5EtW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter assembly, all systems were checked to make sure everything worked correctly. Then came Expedition 1 - Valentina, Haleny, and Dauna. The three boarded the Moses IV and Dauna installed a forgotten communications dish and rearranged the RCS ports to improve their efficiency. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qyxh45g.png\u0022 alt=\u0022qyxh45g.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3fWaYNQ.png\u0022 alt=\u00223fWaYNQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gP5FWYy.png\u0022 alt=\u0022gP5FWYy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EShortly after, Cargo Resupply System 1 was launched, which carried monopropellant (to replenish what was used when docking the whole thing together) and ladder pieces to attach to the hull for ease of mobility, after Dauna got annoyed by bumping into everything. She performed an EVA and attached the ladder parts and the fuel resources were transferred. CRS-1 undocked, descended back to Kerbin perfectly, and was recovered. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0IEGoeG.png\u0022 alt=\u00220IEGoeG.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/H8H8EJ4.png\u0022 alt=\u0022H8H8EJ4.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/1plXE9r.png\u0022 alt=\u00221plXE9r.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/rk18XRW.png\u0022 alt=\u0022rk18XRW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECargo Resupply System 2 was launched, which carried more ladder parts and the Nom-O-Matic 5000, which turns the Kerbal\u0027s leftovers and organics back into food supplies. CRS2 docked with the Moses IV, and Val assisted Dauna in attaching the ladder parts and Nom-O-Matic to the hull. At this time, a Materials Bay science instrument was also attached. Shortly after, CRS2 undocked and was recovered on Kerbin, just like CRS1. Unfortunately, a parachute anomaly caused the CRS-2 capsule to crash into the ocean.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ppouXYc.png\u0022 alt=\u0022ppouXYc.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/qSvExxR.png\u0022 alt=\u0022qSvExxR.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/IOQMPzP.png\u0022 alt=\u0022IOQMPzP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter CRS2 was undocked, and the Moses IV had an unoccupied docking port, Expedition 2 was launched. This carried Jebediah, Sherdard, and Leina. They docked and boarded the Moses IV and transferred their supplies onboard. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0EdBpma.png\u0022 alt=\u00220EdBpma.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/GtHiwnI.png\u0022 alt=\u0022GtHiwnI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith six crew members onboard the Moses IV, hopefully testing equipment and finding design flaws, the KSC focused on Duna. \u003C/p\u003E\u003Cp\u003EThe Duna Global Surveyor was built. The ion-propelled satellite was mainly built to take low resolution photographs of Duna\u0027s surface, in an attempt to find a good spot for the future manned mission. The satellite arrived in Duna orbit and took lots of photos, of which a handful of sites were chosen for further analysis. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tXQTfvn.png\u0022 alt=\u0022tXQTfvn.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Yy9tfXL.png\u0022 alt=\u0022Yy9tfXL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter about 100 days onboard the Moses IV, the Expedition 1 team disembarked and flew home. They seemed a little upset about leaving orbit, but the Expedition 2 team needed the docking port to be open for future CRS missions. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/L0GFAYV.png\u0022 alt=\u0022L0GFAYV.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/hfOgowf.png\u0022 alt=\u0022hfOgowf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo further analyze the chosen sites on Duna, the Duna Resource Orbiter was built and launched. Using its powerful radar and communications arrays, the satellite gave clear images of where the resource Ore exists on the surface. Further narrowing down of the possible sites, the KSC finally decided upon the main canyon that flows across Duna. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fSq1qO0.png\u0022 alt=\u0022fSq1qO0.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/swS6a6r.png\u0022 alt=\u0022swS6a6r.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHaving enough supplies to last an entire year on the Moses IV, the Expedition 2 team was left to their own devices for a while. \u003C/p\u003E\u003Cp\u003EDuring this break, the KSC launched two spacecraft simultaneously: the Duna Probe Lander and the Duna Imaging Satellite. Unfortunately, the engineers that built the Global Surveyor didn\u0027t realize that the telescope they used was meant for observational data and not photography (accidentally used DMagic\u0027s telescope instead of HullCam), and thus a second imaging satellite was needed. \u003C/p\u003E\u003Cp\u003EThe Probe Lander was nothing more than a glorified camera hooked up to a parachute and solar panel, but it would give useful information about the topography of the chosen landing site. The Imaging Satellite would use a super high-resolution camera to zoom in from orbit and survey the site as well.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7pLCys7.png\u0022 alt=\u00227pLCys7.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/n0UVj8b.png\u0022 alt=\u0022n0UVj8b.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Imaging Satellite took lots of useful photographs, but unfortunately the Probe Lander revealed that the chosen landing site was very rough terrain, and further analysis revealed that the valley in the canyon had flatter terrain than the plateau above the canyon, contrary to what was previously thought. After a while, the KSC decided the new landing site would be the bottom of the canyon. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/M0cy7gr.png\u0022 alt=\u0022M0cy7gr.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/8RAAvar.png\u0022 alt=\u00228RAAvar.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo the scientists\u0027 dismay and the engineers\u0027 glee, it was unclear from orbital data if there were any ore deposits at the bottom of the canyon. This meant building another spacecraft - to land and scan the surface for ore deposits. It was decided that a rover would best carry out the mission and also be fun to build. \u003C/p\u003E\u003Cp\u003EAt first, a micro-rover was built and although very adorable, lacked any way to safely deliver it to the surface and could not carry the scanning instrument needed. A slightly larger rover was built and sent. \u003C/p\u003E\u003Cp\u003EThe Duna Science Rover launched and landed successfully right in the middle of the canyon, and after a day of roving, found there to be plenty of ore available. It even took photos of the topography - the perfect landing site!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/34geaFD.png\u0022 alt=\u002234geaFD.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/1Zalwi1.png\u0022 alt=\u00221Zalwi1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe KSC started kicking the manned mission into gear. Engineers built and tested the Resource Converter - a ten ton machine capable of converting ore into useful fuel. After destroying one in a landing test, the bugs were worked out and the second machine landed and worked. A manned rover was also built, which would take the astronaut engineer from the main site to the Resource Converter. The engineer would then use empty fuel tanks to transfer fuel from the converter back to the MAV. The Rover landing system worked flawlessly. \u003C/p\u003E\u003Cp\u003EThe last piece to be built and tested was the MAV, which is essentially s tiny rocket, capable of leaving Duna\u0027s atmosphere and docking with the Moses IV. \u003C/p\u003E\u003Cp\u003EAll three vehicles were launched only days apart, reaching Duna in around 70 days. The MAV landed right where it needed to be, flawlessly. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/R21tkFM.png\u0022 alt=\u0022R21tkFM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe manned rover, however, suffered a hard landing due to lack of drag (parachutes). The two front wheels were smashed on impact, but repairable by a skilled engineer. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mHByEx1.png\u0022 alt=\u0022mHByEx1.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/BICtRYv.png\u0022 alt=\u0022BICtRYv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Resource Converter had enough parachutes, however they deployed too late and the landing was overshot by a full kilometer. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qjT9rPt.png\u0022 alt=\u0022qjT9rPt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter landing, each vehicle extended its solar arrays and the resource converter began drilling for ore. It was at this time that it was decided NOT to send a Habitat module, and the crew could just live inside the MAV. \u003C/p\u003E\u003Cp\u003EAfter everything was confirmed to be working, all that was left was to supply the Moses IV and get ready for the transfer. The Expedition 2 crew\u0027s capsule was robotically undocked and sent back to Kerbin and CRS3 and CRS4 were launched. The cargo resupply systems replenished all the monopropellant and supplies onboard and brought a second Nom-O-Matic, which replaced the Materials Bay instrument. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ffnUeNI.png\u0022 alt=\u0022ffnUeNI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe two CRS capsules were undocked and the final vehicle was launched, the MDV capsule, carrying Valentina, and it docked with the Moses IV. The MDV is basically a capsule with a heat shield, parachutes, and monopropellant thrusters. It takes three astronauts from Duna orbit to the surface and keeps them alive during descent - no frills. \u003C/p\u003E\u003Cp\u003EOnce docked, the MDV\u0027s monopropellant was refueled and the entire Moses IV assembly moved into a geosynchronous orbit, to test the nuclear reactor and ion engine pair and where it waited an additional 170 days before starting the transfer orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MoH4obZ.png\u0022 alt=\u0022MoH4obZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Duna Transfer took place on Year 6, Day 116. The transfer took the Moses IV to a 300km Duna encounter and the ion engines accelerated the craft at a speed of 4m/s. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/u8gj3v2.png\u0022 alt=\u0022u8gj3v2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDuring the 75 day transfer, Jeb clumsily opened an airlock and lost quite a bit of supplies, so when the Moses IV performed it\u0027s circularization burn for a 300km parking orbit, the crew only had 30 days of food onboard. Remaining supplies, Jeb, Bill, and Bob were transferred to the MDV, and it undocked from the Moses IV. Valentina stayed onboard to monitor systems, pilot the station, and the two Nom-O-Matics would replenish her food supply. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6GYW65u.png\u0022 alt=\u00226GYW65u.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe MDV landing went worse than expected, overshooting the intended site by 3.4km. It landed hard enough to destroy the heat shield, and the capsule tipped onto its side. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Fax3yCg.png\u0022 alt=\u0022Fax3yCg.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/zbzArQ5.png\u0022 alt=\u0022zbzArQ5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill exited the capsule and gave Jeb and Bob his food supplies, thinking that he can run to the manned rover and drive it back to pick them up. Luckily for Bill, the rover was already packed with supplies and a drill to fix the wheels. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SdvyfhW.png\u0022 alt=\u0022SdvyfhW.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/V3MEcP8.png\u0022 alt=\u0022V3MEcP8.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/IRJL5Dr.png\u0022 alt=\u0022IRJL5Dr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt took Bill forty minutes to reach the rover, and he fixed the wheels and drove it back to the MDV. He loaded up the supplies, but unfortunately the rover was only designed to fit one person inside. The design was for the engineer to drive the rover and it\u0027s empty fuel tanks to the resource converter, fill the fuel tanks, and drive back to the MAV to fill its tank. Quickly thinking, Jeb and Bob held onto the access ladders on the top while Bill drove slowly to the MAV. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Gml29zd.png\u0022 alt=\u0022Gml29zd.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/yYFh97x.png\u0022 alt=\u0022yYFh97x.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb fell off. A couple times. The first time was kind of a shock, he just stood up and fell off the side of the rover. Bill came to a stop and Jeb ran back up and hopped on again. The second time, Jeb tumbled down the back of the rover, breaking a solar panel, and off into the Duna hills. Irritated, Bill stopped again and Jeb caught up an hopped on again. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2Kxd7GL.png\u0022 alt=\u00222Kxd7GL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinally, they reached the MAV! They posed for a picture in front of the vehicles before sunset, and entered the MAV as night fell upon Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cl2FQPT.png\u0022 alt=\u0022cl2FQPT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs they slept in the MAV, the KSC analyzed the mission. The three astronauts on the surface had around three months of food supplies, plus another month of supplies in the rover. The Moses IV, constantly making food, could keep Valentina alive for two years. Assuming nobody dropped any food out of any air locks. \u003C/p\u003E\u003Cp\u003EThe mission planners felt bad about the lack of habitation module and science experiments for the ground crew, and decided to hastily build a Hab and a Resupply mission. The Hab was launched directly to Duna on the biggest rocket available, and landed around 60 days later. The Cargo Resupply System - Duna 1 was packed with food supplies, spare solar panels (to replace the one Jeb broke, and extras) and KIS containers for extra storage on the surface. It is in a low-Kerbin parking orbit while waiting for a transfer window. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pGm8v3r.png\u0022 alt=\u0022pGm8v3r.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/anzH8Dn.png\u0022 alt=\u0022anzH8Dn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I felt bad, as my priorities shifted to modding the rover used in The Martian, and my little team was sitting on the surface of Duna, all alone. So I decided it was time to bring them all home.\u003C/p\u003E\u003Cp\u003EIt started off great, I used Bill to drive to rover over to the ISRU, load the fuel into empty containers, then drive back to the MAV and refuel it. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GE5NyTG.png\u0022 alt=\u0022GE5NyTG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately on the way back, Bill rolled the rover and was killed. I loaded my quicksave multiple times, but his death was inevitable. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tsTGF5V.png\u0022 alt=\u0022tsTGF5V.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI refueled the MAV and took off, to dock with Moses IV. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mbZubxC.png\u0022 alt=\u0022mbZubxC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUpon docking, I realized Jeb and Bob were in fact in the Hab on surface, not in the MAV. I undocked the MAV and deorbited it. Upon crashing, I took Jeb and Bob and ran over to the crashed MDV. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/84wTvtN.png\u0022 alt=\u002284wTvtN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/q69gQ6a.png\u0022 alt=\u0022q69gQ6a.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey boarded the vehicle (and yes, using RCS cheats...) flew up and docked with the Moses IV. They started their journey back to Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/a34oPbq.png\u0022 alt=\u0022a34oPbq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUpon reaching LKO, I flew a Ranger spacecraft (from the Endurance mod) and docked with the Moses IV, transferred the crew, and flew everyone home safely. Kind of a success, I suppose.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xXCnFoU.png\u0022 alt=\u0022xXCnFoU.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Hou96MU.png\u0022 alt=\u0022Hou96MU.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/9U0TlkV.png\u0022 alt=\u00229U0TlkV.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Jk1Rr04.png\u0022 alt=\u0022Jk1Rr04.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/VUgRgQ5.png\u0022 alt=\u0022VUgRgQ5.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Dgnd3BZ.png\u0022 alt=\u0022Dgnd3BZ.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/dmiIBZI.png\u0022 alt=\u0022dmiIBZI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks for reading!\u003C/p\u003E\u003Cp\u003EHere are all the mission patches I made for my mission set:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dyD0RZQ.png\u0022 alt=\u0022dyD0RZQ.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/h3Aay2l.png\u0022 alt=\u0022h3Aay2l.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/YndWHrz.jpg\u0022 alt=\u0022YndWHrz.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2015-10-14T09:50:26Z","Content":"\n\u003Cp\u003EGreat mission - those patches look like a lot of work too!\u003C/p\u003E\n"}]}