{"TopicId":123597,"ForumId":51,"TopicTitle":"Elcano challenge on Pol - Completed","CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-23T06:56:08Z","PageNum":1,"Articles":[{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-23T06:56:08Z","Content":"\n\u003Cp\u003EPol is one of the few heavenly bodies on which no one has completed a circumnavigation yet. So i decided to attempt it with a small rover without RTG\u0027s to make it more interesting.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/14923883/screenshot597.png\u0022 alt=\u0022screenshot597.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve driven the rover now for some time and i wonder if i haven\u0027t bitten of more than i can chew. Sofar the rover has overturned three times, fortunately without massive damage and the RCS thusters have enough force to turn the rover back on it\u0027s tracks.\u003C/p\u003E\u003Cp\u003EThe hills are steep, really steep! I\u0027ve encountered a hill with an incline larger than 50 degrees, possibly even over 60 degrees. It proved too steep for the rover and it overturned, started to slide and fall downward. I was able to right the rover with RCS while falling and managed to stop the fall. After a (long) breather i took a safer route to climb the hill.\u003C/p\u003E\u003Cp\u003EPol is a dangerous, dreadfull and foremost depressing place! Travelling on Minmus was a walk in the park compared to driving on Pol.\u003C/p\u003E\u003Cp\u003EStartingpoint : 0 , -215.370 (which is the same as 0 , 144.630) \u003C/p\u003E\u003Cp\u003E[table=width: 500, align:left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Position[/td]\u003C/p\u003E\u003Cp\u003E [td]Longitude[/td]\u003C/p\u003E\u003Cp\u003E [td]Latitude[/td]\u003C/p\u003E\u003Cp\u003E [td]Fuel[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Start[/td]\u003C/p\u003E\u003Cp\u003E [td]0[/td]\u003C/p\u003E\u003Cp\u003E [td]144.630[/td]\u003C/p\u003E\u003Cp\u003E [td]-[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]Current[/td]\u003C/p\u003E\u003Cp\u003E [td]0[/td]\u003C/p\u003E\u003Cp\u003E [td]144.630[/td]\u003C/p\u003E\u003Cp\u003E [td]8.54[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]To go[/td]\u003C/p\u003E\u003Cp\u003E [td]0[/td]\u003C/p\u003E\u003Cp\u003E [td]0[/td]\u003C/p\u003E\u003Cp\u003E [td]-[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-28T21:40:26Z\u0022 title=\u002210/28/2015 09:40  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 28, 2015\u003C/time\u003E by TheCardinal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-10-23T07:32:13Z","Content":"\n\u003Cp\u003EWow, cool idea! I\u0027m not sure I\u0027d have the patience for this challenge, though, thus I\u0027m impressed by your ambition!\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-23T08:45:52Z","Content":"\n\u003Cp\u003Ean example of a steep hill seen through a night vision camera\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/14923883/screenshot630.png\u0022 alt=\u0022screenshot630.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexanderTeaH\u0022 data-cite=\u0022AlexanderTeaH\u0022\u003E\u003Cdiv\u003EWow, cool idea! I\u0027m not sure I\u0027d have the patience for this challenge, though, thus I\u0027m impressed by your ambition!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI started the mission on Minmus thinking that the greatest challenge would be having enough patience, so i understand your feelings completely. It proved to be quite different. At a certain stage you\u0027ll get so immersed in the \u0027game\u0027 that it\u0027s almost as if your really there. I wasn\u0027t joking or exagerating when i wrote i needed a breather. One thing is for sure, you\u0027ll never look at a planet/moon the same way as before the \u0022challenge\u0022.\u003C/p\u003E\n"},{"CreatedByName":"nsgallup","CreatedById":136892,"CreatedDateTime":"2015-10-23T17:34:04Z","Content":"\n\u003Cp\u003EPol is pretty crazy, I like using RCS landers there\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-23T19:48:52Z","Content":"\n\u003Cp\u003EI\u0027ve stumbled onwards for a bit today. I\u0027m asking myself what i was thinking when i started this trip. I managed to survive twelve times overturning and several times dropping from a steep cliff. I\u0027m wondering how long will i be so lucky. Granted, the gravity is low but it only takes six or seven m/s to have something exploding. I\u0027ve taken the procaution to refill the generatortanks from the main tank to make an explosion of the main tank less catastrophice ahould it occur. Without liquid fuel no more power until the sun shines again.\u003C/p\u003E\u003Cp\u003ETime for a rest. Tomorrow we\u0027ll continue.\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-24T20:58:09Z","Content":"\n\u003Cp\u003EToday i only managed to travel about half the distance i wanted to. No RTG\u0027s means no power when the generators aren\u0027t running and the batteries are flat. I didn\u0027t realise that braking with the reverse key doesn\u0027t work because for reverse power you need energy. The craft twice went without power and twice it got into a spin ending up on it\u0027s back. I also didn\u0027t realise that without power the BTDT scanner needs to be restarted. I only noticed that when i came to the next photo point (every 10 degrees i make a screenshot). Fortunately i still can proved that i traveled the distance with the photo\u0027s.\u003C/p\u003E\u003Cp\u003EToday the rover \u0027only\u0027 turned over three times, still without major damage (the only damage was my pride). Every time i used the RCS to right the rover again. I took a lot of RCS with me on the rover because i intended to land the rover on Pol on RCS but there was sufficient liquid fuel and oxidiser to land on those. That has proven to be quite fortunate. I have to be very careful in using the RCS because only a third remains now and i still have to travel more than half the distance.\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2015-10-24T21:44:23Z","Content":"\n\u003Cp\u003EPol??? You are definitely brave!\u003C/p\u003E\u003Cp\u003E I landed on Pol once, and I still have nightmares! \u003C/p\u003E\u003Cp\u003EI can\u0027t imagine driving a rover thru this!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zpK404P.png\u0022 alt=\u0022zpK404P.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-25T22:01:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Just Jim\u0022 data-cite=\u0022Just Jim\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI can\u0027t imagine driving a rover thru this!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice picture of an interesting landscape! I haven\u0027t encountered that yet. It might be location specific.\u003C/p\u003E\u003Cp\u003EWell today proved to be a miserable day on Pol. I have reached a mountain with the steepest cliffs i\u0027ve ever seen. I\u0027ve made several attempts to climb the mountain but it failed miserably. I even used the RCS thrusters once for an extra push upward but the end result remained the same: tumbling downward.\u003C/p\u003E\u003Cp\u003EFinally i decided to drive around it. It took a long detour. I estimate that i\u0027ve travelled three times as much as the normal distance. I was almost at the next stop at latitude -50 when the bottom suddenly dropped away. The incline of 40 degrees upward changed into a downward angle of 50 or 60 degrees. Even though i took great care to pass the edge ever so slowly, it resulted in a tumbling drop which took an enormous effort to stabilise and and stop. The rover took a lot of damage. The liquid fuel tank exploded, as did one of the generators. Only one generator remains with less than 12 liters of liquid fuel. I can only hope the sun will appear soon otherwise this mission will be over soon. Perhaps the fuel is just enough to reach the point where the sun is visible. I still have about 20% of RCS remaining. The RCS thrusters have survived the fall and remain functional. At least the rover still can be righted after a tumble. Pol is a hard nut to crack, much harder than i anticipated. For those who are thinking about circumnavigating Pol, think again! Minmus was occasionally treacherous but at Pol the dangers lurk everywhere. Take at least two RTG\u0027s on board of your rover. I consciously did not and now face the consequences of that decision.\u003C/p\u003E\u003Cp\u003EOnly 11.82 liters of fuel remaining. It\u0027ll have to do.\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-26T09:13:05Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/14923883/screenshot713.png\u0022 alt=\u0022screenshot713.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis morning i limped the small distance to the next stop 0,-50. It\u0027s extremely clear that the stability of the rover is compromised. The rover now handles like a babypram with just two of the four wheels attached (diagonally) to it. The shifted center of gravity makes steering quite difficult. It\u0027s as if you try to push the pram with just the thumb and indexfinger on the handlebar of the pram but on the extreme left or right with one of the two wheels directly beneath.\u003C/p\u003E\u003Cp\u003EI\u0027m considering several options to restore the center of gravity, which has shifted forward, as much as i can. The remaining RCS fluid has been pumped to the back. The Kerbonauts have some parts in their inventory which maybe can be attached to the backend. I\u0027m even considering having one of the girls ride on the outside, attached to the backend. Even that minimal amount of weight might improve the chances of completing the mission. I\u0027m unsure at this time if i should reduce the torque on the tracks. I should do that to prevent flipping backwards when speeding up but on the other hand, it increases the energy consumption in relation to the speed (i.e. travelled distance). It seems like i\u0027m in a \u0022Dammed if i do and dammed if i don\u0027t\u0022 situation. From the map view i can see that the rover is still about 40 degrees from the terminator. The amount of fuel should be sufficient to at least reach the terminator, so i\u0027ll have to risk not reducing the torque until reaching the terminator. Giving up is not an option as a relief/rescue mission requires several years to reach Pol. No choice but to continue limping towards the finish.\u003C/p\u003E\u003Cp\u003EEdit: Neither Serena nor Marella have any parts in their inventory, so no parts to attach at the back. The option for one of the Kerbonauts to ride outside is also out.\u003C/p\u003E\u003Cp\u003Eposition 0,-45 fuel: 11.69\u003C/p\u003E\u003Cp\u003EA 5 degree progress at the cost of 0.13 l of fuel. In theory the fuel should be sufficient to complete the mission even without sunlight. It means i don\u0027t have to shut down the BTDT scanner and SAS which use energy every second no matter if i drive or not.\u003C/p\u003E\u003Cp\u003EThat is at least positive news. Driving is very difficult due to the different weight distribution, but we will persevere.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-26T10:57:23Z\u0022 title=\u002210/26/2015 10:57  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 26, 2015\u003C/time\u003E by TheCardinal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-26T13:09:55Z","Content":"\n\u003Cp\u003EPosition: 0, -40 fuel: 11.57 Y12D345 4:22\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-10-26T13:58:31Z","Content":"\n\u003Cp\u003ETurn on the scatter, set it to maximum. Pol should be entirely covered with those spikes.\u003C/p\u003E\u003Cp\u003EYou\u0027re gonna get very frustrated with this body. I suggest examining the slope map for Pol and planning your route using that data.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.kerbalmaps.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalmaps.com/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-26T21:27:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003ETurn on the scatter, set it to maximum. Pol should be entirely covered with those spikes.\u003Cp\u003EYou\u0027re gonna get very frustrated with this body. I suggest examining the slope map for Pol and planning your route using that data.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.kerbalmaps.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalmaps.com/\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll try the scatter (let\u0027s see if my old girl can handle that).\u003C/p\u003E\u003Cp\u003EFrankly, i didn\u0027t make a slope map for Pol, i started at it completely blanc. I had the intention of completely following the equator. And i DID get very frustrated. After the damage which completely ruined the balance of the rover, i had to adopt a new driving style and i loosend the \u0022equator following\u0022 part a bit. Now I skip the longtude 0 point when it lies on top of a mountain. Now I accept a point slightly up or down the equator as well.\u003C/p\u003E\u003Cp\u003EThe new driving style works fine. On other days i could only manage to travel about 20 degrees (per day). Today, despite the bad balance and the limited fuelsupply, i managed to do 50 degrees.\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2015-10-26T21:59:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCardinal\u0022 data-cite=\u0022TheCardinal\u0022\u003E\u003Cdiv\u003EI\u0027ll try the scatter (let\u0027s see if my old girl can handle that).\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, scatter should give you the spiky rocks.\u003C/p\u003E\u003Cp\u003EI planted a flag where I tool that screenshot, the location is 7-39-55S by 73-41-26W. It seemed an innocent enough valley from orbit... yeah. Upon further exploration it turns out most of Pol looks like this.\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-27T10:52:33Z","Content":"\n\u003Cp\u003EI\u0027ve set the scatter to 100% but i haven\u0027t seen any spikes yet. Probably because i did something foolish, like climbing a mountain. At the moment the rover is at the highest top of a mountain (3413 meters high). I found myself at more than two degrees from the equator so i decided to climb the mountain to reduce the distance to the equator. I feel somewhat like a kitten in a very high tree except there\u0027s no firebrigade which can save me when excrements hit the fan.\u003C/p\u003E\u003Cp\u003EBut it also gives a feeling of victory which makes it all worthwile even at the cost of slower progress. Besides, what\u0027s the use of circumnavigation when you don\u0027t go about exploring.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-27T15:14:04Z\u0022 title=\u002210/27/2015 03:14  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 27, 2015\u003C/time\u003E by TheCardinal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-27T21:43:38Z","Content":"\n\u003Cp\u003EThis day has been quite fortunate. I\u0027ve travelled a greater distance than i thought possible. The new way of driving turns out to be THE way to drive on Pol. It is a lot faster than before and the fuel consumption is down. The sun might have something to do with that as well. The six solarpanels on top don\u0027t provide enough power to charge the batteries. They\u0027re just enough to keep the BTDT scanner active, whiich means the batteries don\u0027t deplete as fast as before.\u003C/p\u003E\u003Cp\u003EThe design of the rover is good but could have been a lot better. Something which i will keep in mind when circumnavigating an other moon or planet. Choosing tracks instead of wheels was one of the best decisions i\u0027ve made when designing this rover. And the nightvision camera! Without the NVC i couldn\u0027t have travelled in the dark which would have made this voyage even longer. Still almost a quarter moon to go but the chances of making it seem a lot more plausible than after the unfortunate crash which destroyed one of the generators and the fuel supply. I still haven\u0027t seen any spike, despite of setting the scatter to 100%. (Perhaps it doesn\u0027t works when the body is in memory).\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-28T22:11:30Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/14923883/screenshot790.png\u0022 alt=\u0022screenshot790.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe mission is completed. I\u0027m back at the starting point. It has taken 6 Kerbal days to drive around Pol. Today with the end in sight, i\u0027ve travelled the largest distance during this trip. And surprisingly, with fuel to spare. The last degrees i\u0027ve left the generator running to have all batteries at full capacity in case the second (and last) generator would be damaged. It\u0027s a shame i haven\u0027t found any spikes during the trip. It\u0027s only gueswork but perhaps the spikes are condensed gasclouds from Jool. Spontaneously appearing when and where ever the temperature is right. Perhaps an automatic station can be built here to monitor the forming of the spikes. That\u0027s up to Kerbal Control. Both ladies, Sarena and Marella are extremely glad the trip is over. The monotoneous environment is getting on their nerves.\u003C/p\u003E\u003Cp\u003EA small part of the BTDT track is missing due to me forgetting to start the scanner again after completely draining the batteries. I do have pictures of every 10 degrees of latitude change which i will present in an album as soon as i have the chance to sort them out. (I have about 300-400 screenshots).\u003C/p\u003E\u003Cp\u003EAfter driving full circle on Pol i honestly can say that it\u0027s difficult but doable. Make sure you have plenty of SAS and power. I only had 1650 batterie capacity. More than once i had to stop between normal stops to reload the batteries. The extra fuel i took with me wasn\u0027t necessary but the mass was usefull.\u003C/p\u003E\u003Cp\u003EThe six small solar panels on top were of little use. Either take more/larger solarpanels or leave them off. The tracks were fenomenal, never any trouble. I believe that i would have had innumerable flat tyres when i had used tyres. During the trip, the rover often came loose from the ground at bumps, landing several meters further. It is possible to drive without a nightvision camera but i don\u0027t recommend it. No matter how many lights you\u0027ll put on the rover, it doesn\u0027t compare to the image you\u0027ll get from a NVC.\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2015-10-30T07:36:40Z","Content":"\n\u003Cp\u003EAs promised, the album with pictures. Some picture are included, just because they\u0027re so beautiful, some because there\u0027s something special there. Most are just documentation of the route taken.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/cK4SU\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/cK4SU\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"damerell","CreatedById":123074,"CreatedDateTime":"2015-11-04T12:00:25Z","Content":"\n\u003Cp\u003ENice one; reading that sounds like the worst of Minmus and Mun in some horrifying combination.\u003C/p\u003E\n"}]}