{"TopicId":124152,"ForumId":51,"TopicTitle":"Inspired by the Elcano challenge and Overland\u0026#039;s trains...","CreatedByName":"Wintersdark","CreatedById":128573,"CreatedDateTime":"2015-10-31T11:27:07Z","PageNum":1,"Articles":[{"CreatedByName":"Wintersdark","CreatedById":128573,"CreatedDateTime":"2015-10-31T11:27:07Z","Content":"\n\u003Cp\u003EI decided to give land based circumnavigation a go. This won\u0027t qualify as a Elcano challenge entry directly, as it\u0027s not water friendly at all, but it\u0027s there in spirit.\u003C/p\u003E\u003Cp\u003ENow, I could make a small, speedy rover and have at it... But I\u0027ve spent a lot of time in rovers. Overland\u0027s thread, and stories of his 4408\u0027s journey... a train!\u003C/p\u003E\u003Cp\u003EBut, here\u0027s the thing. I have issues with efficient design. I like things big and over-engineered. Also, while I\u0027m a fairly patient man, I\u0027d rather not try to circumnavigate Kerbin at 24 m/s. I don\u0027t have that much free time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, then, I present to you: The 3004!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/b9Z5Glr.png\u0022 alt=\u0022b9Z5Glr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WdCWbQL.png\u0022 alt=\u0022WdCWbQL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E78 Infernal Robotics Hauler movatrons provide 36m/s of electric driving power, these get it up to speed for the jets to take over\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E8 Weasley Jet Engines, 4 front, 4 rear. These get the train up to just shy of 100m/s on level ground. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E18263 units of Liquid Fuel \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EA crew capacity of... Lots.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EFrom back to front:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EThe 3 red and white tankers are Liquid Fuel tankers, using Procedural Parts for the tanks (to pull the train\u0027s part count down and rigidity up; it\u0027s already at some 400 parts! The final, jet equipped fuel tanker also sports a couple fins that are \u0022deployed\u0022 to add some downforce and help counter wobble.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EThe gold tanker is a single, huge battery (again, Procedural Parts for a single part battery)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EThen we have the ISRU car, featuring 4 drills, 4 large solar panels, 2 large ore containers and an ISRU module. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003ENext, the Science car. This one features a mobile lab, full science equipment, seating for 4, and scanners. I\u0027ll be adding a BTDT scanner before officially starting, just to get my route mapped automatically. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EFinally, the Engine, the 3004 itself. A Mark 3 monstrousity, this carries LfOx to power a couple fuel cell arrays, some additional fuel, and a hell of a lot of Kerbals. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EOverall, it\u0027s very, VERY fast and quite stable. As long as speeds stay below 100m/s it\u0027s fine, and that\u0027s about how much I can get out of the 8 jet engines. Some caution is required going downhill, as it\u0027s entirely possible to get much beyond that, and with more speed there\u0027s an extremely rapidly increasing risk of a wave starting through the train, which ends up snapping the rear cars back and forth like a whip. It\u0027s controllable, if you\u0027re paying very close attention and can counter the wobble before it gets too pronounced, but as land speed increases the rate at which it gets more severe increases as well. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EI\u0027ve taken a couple test trips out around the mountains north of KSC and back, and it\u0027s performed admirably. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003ETomorrow, I\u0027m starting my journey around the world!\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2015-10-31T12:45:02Z","Content":"\n\u003Cp\u003EBy the way, it doesn\u0027t have to be water friendly. If you can circumnavigate Kerbin and cross the continent west of KSA, it will count as a land circumnavigation.\u003C/p\u003E\u003Cp\u003E-SPAddict\u003C/p\u003E\u003Cp\u003EWishing you, your kerbals, and the train the best! ;D\u003C/p\u003E\n"},{"CreatedByName":"Overland","CreatedById":119812,"CreatedDateTime":"2015-11-01T00:24:43Z","Content":"\n\u003Cp\u003EVery impressive engineering my friend \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I could only hope to assemble such a beast.. it would make my aging core2duo server with 2gb of ram cry.. if KSP starts at all \u003C/p\u003E\u003Cp\u003E(Currently converted KSP into KTP, train only parts installed for that reason)\u003C/p\u003E\u003Cp\u003Erespect and admiration for being able to get upto 100ms without the wave kraken descending would have taken some great skill and dedication.. \u003C/p\u003E\u003Cp\u003Eshes 3004.. would that mean by the numbering system that shes 4th of the class with the others ending horribly while in the research phase? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooking forward to following your adventures.. best of luck.. its a challenging thing to drive a land train all by itself... adding circumnavigation to that puts it into the \u0022its over 9000!\u0022 territory. the kind that mixes insanity, dedication an skill all into one experience that seems to be a common element in the landtrain driver ranks\u003C/p\u003E\u003Cp\u003EDon\u0027t be shy with the screenshots and video, \u003C/p\u003E\u003Cp\u003Eshes a beautiful machine.. im sure she\u0027ll generate much respect and reputation\u003C/p\u003E\u003Cp\u003EI wish you well.. and that your journey adds to the growing legends of Kerbal Land-Trains..\u003C/p\u003E\u003Cp\u003Eits quite amazing to see it gathering a following \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT:... Im now fully awake and read all your post.. Thankyou for the shout out to not only myself but 4408.. That actually means alot thankyou..\u003C/p\u003E\u003Cp\u003ESadly 44 class 4408 went to the big scrapyard in the sky long ago.. 4426 takes her place... As does 4016 for the 40 class..\u003C/p\u003E\u003Cp\u003EIts a long difficult road my friend.. Its my dearest hope although you mention not wanting to run at 26ms .. (44 class do 45ms max although lethal above 31)\u003C/p\u003E\u003Cp\u003EThe time taken will have you bond with your train as have I many times.. Its then things change for the better (an worse when you lose one)\u003C/p\u003E\u003Cp\u003EBecoming one with your train... Personally its one of the better experiences ive had in pc gaming..\u003C/p\u003E\u003Cp\u003ESo as a fellow train driver and owner of many trains past and present... Again I simply say..\u003C/p\u003E\u003Cp\u003EGoodluck...and may you enjoy the journey.. 3003s a fine machine.. Best wishes for all involved \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-01T03:10:26Z\u0022 title=\u002211/01/2015 03:10  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 1, 2015\u003C/time\u003E by Overland\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wintersdark","CreatedById":128573,"CreatedDateTime":"2015-11-01T03:54:28Z","Content":"\n\u003Cp\u003EShe was marvelous, but alas I\u0027m already rolling out the next of her line, the 3101. A horrible mishap due to my own overconfidence and poor planning - specifically, turning at the last minute into too sharp an incline causing a rollover. It created a debris field about a kilometer long, with hundreds of parts strewn across the landscape. The amazingly good news was that \u003Cem\u003Enot a single kerbal was killed\u003C/em\u003E - in fact, the engine itself is still capable of moving under it\u0027s own power, but poorly, and with a pretty limited range. I put a lot of thought into crash handling and kerbal saving, and that paid off:\u003C/p\u003E\u003Cp\u003E1) The engine uses Mark 3 parts, and is remarkably sturdy\u003C/p\u003E\u003Cp\u003E2) The wheels are arranged with strutted girders in a fashion that, combined with the engine nacelles on the roof, allows the engine to roll without hard impacts\u003C/p\u003E\u003Cp\u003E3) I have all couplings (docking clamps) and brakes tied to the abort key, so when the train started rolling, I was able to engage the brakes and uncouple all the cars, and push the engine\u0027s jets to full - this allowed the engine to get some distance from the extraordinarily explosive fuel cars before rolling to a stop. If not for part count issues, I\u0027d add underslung(so out of sight) separatrons as well for extra braking during abort moments. That\u0027d likely save cars, too, but I just can\u0027t add more parts.\u003C/p\u003E\u003Cp\u003ESo, the 3101 is being launched, and will pick up the crew of the 3004 and bring them along on the ride. It\u0027s a minor class upgrade, in that I\u0027m removing one fuel tanker and the battery car, and replacing them with a car housing a retrievable rover and a jet and stuffing the battery elsewhere. This, because I\u0027ve definitely found that I\u0027m very interested in exploring Kerbin as I go - you\u0027re totally right in that you really see the scenery in a completely different way - but while the train is an excellent means of transportation, it\u0027s not at all maneuverable and attempts to look in interesting places are fraught with peril. \u003C/p\u003E\u003Cp\u003EHaving a car bringing a rover and jet that can be loaded and unloaded repeatedly will allow us to explore terrain that I could otherwise only gaze at in the distance. \u003C/p\u003E\u003Cp\u003EI\u0027m hoping to have her set off tonight, just got to get the deployment car put together. \u003C/p\u003E\u003Cp\u003E--------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003EWith regards to the wave problem:\u003C/p\u003E\u003Cp\u003EI fought with this in my earlier models quite a bit. The solution I found was having struts to each wheel, and it made a massive difference: I could hit (with the large wheels and 2m chassis I\u0027m using) around 50m/s before the wave kraken would eat my train. After installing the 78 (!!!!) struts I got to a reliable 100m/s before any wave kraken danger. Unfortunately, even for my rather heavily overclocked 4.5ghz i5 4690k, there\u0027s a very noticeable performance hit with that many struts. 400 parts is a lot of parts. Every wheel needs a strut, and fewer wheels lead to more issues because each wheel must bear more weight, and each suspension can only handle so much. So, while I could probably get the train going faster, the lower framerate would invite more kraken strikes (and the time slowing effect would negate the speed gains anyways)\u003C/p\u003E\u003Cp\u003E--------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003EI\u0027m very grateful for your posts and adventures, though. I\u0027d never have attempted this (or even remotely considered it) without them! I\u0027m finding this a lot more entertaining and interesting that I expected it to be, with surprising engineering challenges that I hadn\u0027t anticipated. I went through the 10 (using 1.25m parts) and 20 (2m engine, 1.25m cars) class trains before settling on the 30 class I\u0027m using now - I\u0027d thought it would be easy to just \u0022throw together\u0022 a train and play around with it, but that wasn\u0027t the case at all. Difficult tasks, however, are much more rewarding.\u003C/p\u003E\n"},{"CreatedByName":"Wintersdark","CreatedById":128573,"CreatedDateTime":"2015-11-01T20:38:21Z","Content":"\n\u003Cp\u003ESorry for the atrocious video quality, I was experimenting with Windows 10\u0027s built in game DVR, and the \u0022standard\u0022 setting is \u003Cem\u003Eawful\u003C/em\u003E. Will adjust for High for the next time. \u003C/p\u003E\u003Cp\u003EAnyways, this is the 3102, doing a test of it\u0027s jet loading/unloading system, before heading out to rescue the stranded crew of the 3004 and attempt to circumnavigate Kerbin. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/lD68vz0txGs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThe test worked out really well, except for a minor mistake stowing the robotic arm causing it to clip through itself. That\u0027s simple enough to avoid in the future, however. In a perfect world, I\u0027d set hard caps onto the rotatrons rotation range so that can\u0027t happen, but because the scout jet uses an inline clampatron and has to be docked after launch, I wasn\u0027t very keen on reverting and adjusting. If something else goes arwy, though, I\u0027ll fix it properly. \u003C/p\u003E\u003Cp\u003ENow, time to head out and find those Kerbals!\u003C/p\u003E\n"},{"CreatedByName":"Wintersdark","CreatedById":128573,"CreatedDateTime":"2015-11-01T22:12:55Z","Content":"\n\u003Cp\u003EWell, the 3102 met a sad end right outside of KSC: Turns out, having the structure of one central car consist of nothing but 3 girders causes a significant weakness that the wave kraken finds delicious. Still, it gave me a chance to make a couple fixes: \u003C/p\u003E\u003Cp\u003E* Moving the jets wings up a smidge, and the gear outboard so when the Inline Clampatron opens to dock, it\u0027s covers don\u0027t collide with the gear and wings\u003C/p\u003E\u003Cp\u003E* Put limits on the rotatrons for stowing the robotic arm, so it doesn\u0027t clip through itself.\u003C/p\u003E\u003Cp\u003EI then loaded up the new jet on the 3103, and made another short video to test the new recording settings:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/pbL2ZBSsqUw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EQuality is a lot more bearable here; though still pretty low-res. I\u0027ve other recording apps too - better ones - but Windows\u0027 is just easier to use without setup.\u003C/p\u003E\u003Cp\u003ESadly, I discovered \u003Cem\u003Eanother\u003C/em\u003E issue with stowing the arm, causing it to clip into the jet(if the jet wasn\u0027t docked and part of the same craft, it would have pushed it off the car or possibly destroyed it!), but while preventable that was user error and lesson learned. \u003C/p\u003E\u003Cp\u003ENow, off to rescue those Kerbals, this time with less destruction I hope.\u003C/p\u003E\n"},{"CreatedByName":"Wintersdark","CreatedById":128573,"CreatedDateTime":"2015-11-02T03:30:28Z","Content":"\n\u003Cp\u003EWave problem update:\u003C/p\u003E\u003Cp\u003EI\u0027m now up to the 32 class 3201, after discovering some other design flaws and an overall organizational improvement that appears to full, completely and utterly eradicate the dreaded Train Wave Kraken.\u003C/p\u003E\u003Cp\u003EAnd that is: Heavy cars up front, to lightest in the back. It seems when you\u0027ve got a lighter car in the middle, the train likes to buckle more right there (be it vertically or horizontally) then the increased weight towards the rear of the train starts increasing oscillations resulting in the near inevitable explosive disassembly of your train. \u003C/p\u003E\u003Cp\u003EWith my train reorganzied that way - and larger Docking Port Sr. connectors for more rigidity - I can now turn (as fast as the train turns) while travelling at 360kph with no fear of Wave Kraken strikes.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUpdate:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo, I\u0027ve made it to the crash site, recovered the 3004\u0027s crew, remembered to have my scout jet fly out and get loaded up - now we\u0027re making tracks and heading north to the pole. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/pIzh9\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI should note - this redesign also manages to pull the total part count down to 358. Still high, but there\u0027s a definite point where performance starts to fall off sharply, and it\u0027s right around 400. This gets me well below that level, and allows for excellent performance.\u003C/p\u003E\n"}]}