{"TopicId":126972,"ForumId":51,"TopicTitle":"Forgotten Space Program","CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-12-04T01:02:10Z","PageNum":15,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-06T05:14:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222443339\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457198720\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ESlow Moves\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith the docking port in his pack he then jetted in the direction of the approaching Nitrogen. Surely there would be someplace on its orbital module where he could glue this thing on and bolt it down....\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKAS FTW (although I\u0027m probably like Thonlock in having another meaning for \u0022FTW\u0022 from a less kind, less gentle age).  I also appreciate Thomlock\u0027s \u003Cem\u003Esang-froid\u003C/em\u003E at the staging mishap.  Old age and treachery beat youth and enthusiasm \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RocketSquid","CreatedById":152665,"CreatedDateTime":"2016-03-06T16:43:16Z","Content":"\n\u003Cp\u003E\nI always worry about the tantares docking ports... It seems like having to put adapters on everything should outweigh the benefits from the Tantares ports. Is there something I\u0027m missing that makes them practical?\n\u003C/p\u003E\n"},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2016-03-06T16:45:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222444710\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457282596\u0022 data-ipsquote-userid=\u0022152665\u0022 data-ipsquote-username=\u0022RocketSquid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, RocketSquid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nmakes them practical?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey look cool?\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-06T19:54:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222444710\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457282596\u0022 data-ipsquote-userid=\u0022152665\u0022 data-ipsquote-username=\u0022RocketSquid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, RocketSquid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI always worry about the tantares docking ports... It seems like having to put adapters on everything should outweigh the benefits from the Tantares ports. Is there something I\u0027m missing that makes them practical?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222444715\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457282740\u0022 data-ipsquote-userid=\u0022142607\u0022 data-ipsquote-username=\u0022legoclone09\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, legoclone09 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThey look cool?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLooking cool has something to do with it. Originally the normal docking ports were buried deep within the Engineering Tech Tree whereas the Tantares ports weren\u0027t. (Because they weren\u0027t accounted for yet.) So in addition to a bit of \u0022cheating by omission,\u0022 my thought was to save mass, but... the math doesn\u0027t work out. So I kinda stick with it because it\u0027s what\u0027s going on and no patent or trademark lawyers have shown up to threaten me.\n\u003C/p\u003E\n\u003Cp\u003E\nI kinda wish the stock docking ports were APAS-styled, as I suspect similar tripodal interchangeable designs will be used by us here in the real world for hundreds of years. Though the magic-magnetic perfectly hermetically-sealed kerbal ports do have their own special character.  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-06T19:55:43Z\u0022 title=\u002203/06/2016 07:55  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 6, 2016\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-06T22:26:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222444955\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457294079\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThough the magic-magnetic perfectly hermetically-sealed kerbal ports do have their own special character.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTo me, the big advantage of KSP ports is that they have no protruding bits that end up clipped into each other.  Docking \u002B clipping = Krakenbait.  The Kraken doesn\u0027t always take the bait, or might bite on something else instead, but you increase the odds of a strike if your docking ports clip.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-07T05:11:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222445196\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457303184\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTo me, the big advantage of KSP ports is that they have no protruding bits that end up clipped into each other.  Docking \u002B clipping = Krakenbait. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree re: clipping colliders. As far as I can tell the Tantares parts don\u0027t have colliders on the protruding bits.\n\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2016-03-07T15:55:57Z","Content":"\n\u003Cp\u003E\nSensible (of the mod maker), if slightly less realistic.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-07T15:56:19Z\u0022 title=\u002203/07/2016 03:56  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 7, 2016\u003C/time\u003E by Commander Zoom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-08T08:40:23Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EMemories of Tomorrow\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFour kerbals waited anxiously aboard Kelgee Station, hoping their ride would arrive soon to spirit them away to their new ship. Their old ship. Their ship. The space agency had assigned them a bit of busy work to complete at Kelgee while they idled... busy work none of them were particularly interested in. So news of the launch of Sulphur 1 was reason for celebration. A small celebration, as they didn\u0027t have much in the way of spare snacks aboard the station.\n\u003C/p\u003E\n\u003Cp\u003E\nA mission destined to be misspelled, the Sulpher, no, Sulphur, or was it Sulfur? 1 was the first in a series of small, system-scale shuttles. Packed with enough boom to reach anywhere in the Kerbin System and come back, one Sulphur shuttle also includes seating for 4 plus a pilot and enough food and supplies for at least three Münths (~19 days). \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160305_ksp0119_s-1.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022590\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160305_ksp0119_s-1.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch vehicle for this mission was an LV-06A Cadence, upgraded to replace the glitchy AIES engines with LV-T45s. This reduced the maximum lift-off mass of the rocket somewhat, but made up for it in increased pitch authority. (Just having working gimbals was enough, honestly.) \n\u003C/p\u003E\n\u003Cp\u003E\nThough the Sulpher (or was it Sulphur?) series of shuttles were designed with a pilot in mind, they also allowed for fully autonomous control. The reasoning being they could then be sent out to \u0022rescue\u0022 up to 5 kerbals, none of which would need to be a pilot. It also made it much safer to launch, as the craft was not intended to ever renter the atmosphere. No abort procedures needed for launch if no pilot was required.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160305_ksp0129_s-1.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160305_ksp0129_s-1.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis Sulphur shuttle, the first of its kind, would not accompany the crew of the Silicon DSV on their trip to Jool - that would instead be used by a later craft. This one would instead fly with them and the Si-DSV-1 to the Mün, and would then return the crew to Kelgee Station. A newer version of the shuttle would be launched with a few small adjustments for use at Jool. \n\u003C/p\u003E\n\u003Cp\u003E\nTo save fuel, the second stage of the S-1 tagged along all the way to Kelgee. The docking, as with half of all things in the space program, happened at night. As is only right and proper. Which might explain why the craft was docked to an inaccessible port, forcing the crew to EVA over to it. Before long they had all collected their things, said a short goodbye to Kelgee, and pushed away from the familiar.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160305_ksp0137_s-1.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022590\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160305_ksp0137_s-1.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe second stage was spent during the burn up to the Si-DSV-1, and was discarded into an orbit with a periapsis above Station Orbit but below 300km. \u0022Safe\u0022 orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nLess than an orbit later and the Sulphur 1 was dancing with the Silicon DSV 1. The pass-through seating aboard the Sulphur shuttles allow the small craft to dock in either direction, though the cockpit is assumed to be \u0022forward\u0022 and must always be facing such when docked to the fore of a Silicon DSV. (As the shuttle will effectively be serving as the helm of the Silicon vessel.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160305_ksp0145_s-1.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160305_ksp0145_s-1.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160305_ksp0151_s-1.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022526\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160305_ksp0151_s-1.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd with that, the first Silicon DSV was \u0022complete\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n\u0022So, do we name it now, or do we name it when the rest of the drive section arrives?\u0022 Agake was running her hand along the inside of the oldest part of the ship as she drifted through the common room, the other three following shortly after. \n\u003C/p\u003E\n\u003Cp\u003E\nThomlock swung gracefully into a seat and grunted. \u0022Captain\u0027s prerogative.\u0022 He motioned towards Macfred with a mittened hand while using the other to fasten the seat\u0027s belt. \u0022It\u0027s his ship, his choice. Just don\u0027t expect me to swing out on the transom and repaint it anytime soon.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hey, if it\u0027s my choice, then we name it now. Seems senseless to wait given we\u0027ve already decided what to name her. It.\u0022 Macfred used his momentum to carry himself to the end of the common room before rebounding, twisting, then grabbing hold of the radio terminal on his way back fore. He glanced around at the other three. \u0022Agreed?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAll three nodded. \n\u003C/p\u003E\n\u003Cp\u003E\nMacfred keyed the radio.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Silicon DSV 1 to Kerbin.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Go ahead Silicon.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThomlock tossed a flask towards Gletrix, who was still hovering near the forward hatch. She caught it and returned a questioning look. Macfred continued before Thomlock could answer, so he just pointed at the flask and then at Macfred.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh mighty and great ruler of the void, through who\u0027s power we glide endlessly towards the stars, we implore you to take unto your records and recollection this worthy vessel hereafter and for all time known as \u0027Memory of Tomorrow\u0027, guarding her with your high and mighty tentacled arms and ensuring her safe passage throughout her journeys in your realm. In appreciation of your munificence and in honor of your greatness, we offer these libations to your majesty and your court.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGletrix smiled with understanding and slipped open the flask. A quick shake and two small spheres of Thomlock\u0027s lubricant of choice were gyrating in the cabin. She quickly emptied the rest into the airlock and vented it to the vacuum, passing the flask back to Thomlock. The two spheres were gone by the time she had finished.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We copy, Memory of Tomorrow, and have updated the ledger accordingly.\u0022 The radio clicked a few times as Macfred slid a new nameplate in above the operator\u0027s station, the line obviously still open on the other end. \u0022Also, be advised the Silicon 5 with your first refuel will be launching shortly.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Copy that Kerbin. We\u0027ve got a few housekeeping chores to take care of first.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nFirst among those chores was rigging their ship. The drive section, though temporary, needed to be fully strutted to the utility core before they would be able to fire its engines. So Macfred suited up and ventured out into the void, wrench and a couple extra strut plates in hand. He also needed to re-rig the previous struts, as undocking from Kelgee Station had apparently turned them invisible.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160305_ksp0159_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160305_ksp0159_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBy the time he was done the Silicon 5 had launched. A simple affair, this overgrown tanker was intended to be just that - and overgrown tanker. Once it had completed its task of topping off the Memory of Tomorrow\u0027s smaller drive section, it would return to low Kerbin orbit where it would await some future task. (Such as being refueled at an orbital refinery that had yet to be built.)\n\u003C/p\u003E\n\u003Cp\u003E\nFuel being a heavy thing, the Silicon 5 was itself a record breaker. At 238.1 tonnes, it had (by 5 tonnes) now broken the Silicon 4\u0027s liftoff mass record. Again flying without a fairing, instead powering its mostly streamlined self through the atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0170_si-5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022586\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0170_si-5.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0181_si-5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0181_si-5.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA short time later and the tanker arrived at its destination. Thomlock handled the remote operation of the Silicon 5 while Gletrix had the helm of the Memory of Tomorrow. In short order they were all docked up and Macfred and Agake were busy running fuel lines through the shuttle and down to the drive section. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0184_si-5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022588\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0184_si-5.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0188_si-5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022521\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0188_si-5.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nWith its task complete and the thirsty Memory full, the Silicon 5 backed safely away. Macfred quickly scanned over his transfer plots for the Mün and checked their position. Confirming it with Thomlock and double checking his numbers, he decided the time was then and the time was now.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0206_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0206_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Thomlock, would you like to do the honors?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022As honored as I would be, Gletrix has the helm.\u0022 The aged kerbal smiled and leaned back in his chair, resting his mittened hands behind his head. \u0022Let her.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Helmskerb, bring up primary engines 1 through 6.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0221_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022588\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0221_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Engines 1 through six online Captain.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Give me a test burn of 5 seconds at one eighth power.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0195_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0195_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ship shuddered as the six main engines fired to life. The short burn was enough to pull bits of flotsam to the aft of the vessel, only to have them tumble back forward a few moments later. Probably the most thrust some parts of the ship had felt since they were first launched, many decades previous. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Engines felt good. Good response. Good power.\u0022 Macfred checked over his readouts to confirm what his helmskerb was reporting. Everything did in fact look good. At their current mass these six mains would impart a bit more than 3 Gs at full throttle. This was a good ship built by good kerbals and with a good crew. They could take her anywhere. Anywhere at all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0199_mot.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0199_mot.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Gletrix, all ahead full. Take us to the Mün.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022With pleasure, Sir.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160307_ksp0203_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022588\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160307_ksp0203_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNavigation: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126972-forgotten-space-program/\u0026amp;do=findComment\u0026amp;comment=2452086\u0022 rel=\u0022\u0022\u003ENext Post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-04T07:17:05Z\u0022 title=\u002212/04/2016 07:17  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 4, 2016\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2016-03-08T16:36:35Z","Content":"\n\u003Cp\u003E\nWe\u0027re not in LKO anymore, Koto! (We\u0027re off to see the Kraken... The wonderful Kraken of Mun! Because of the wonderful explosions he makes...)\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-08T18:10:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222447723\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457454995\u0022 data-ipsquote-userid=\u0022140704\u0022 data-ipsquote-username=\u0022KAL 9000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KAL 9000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe\u0027re not in LKO anymore, Koto! (We\u0027re off to see the Kraken... The wonderful Kraken of Mun! Because of the wonderful explosions he makes...)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPay no attention to the Kraken behind the curtain!\n\u003C/p\u003E\n"},{"CreatedByName":"Angelo Kerman","CreatedById":106975,"CreatedDateTime":"2016-03-08T18:30:49Z","Content":"\n\u003Cp\u003E\nToo late, I looked! *runs away screaming after going insane*\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-08T21:02:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222447318\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457426423\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EMemories of Tomorrow\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh mighty and great ruler of the void, through who\u0027s power we glide endlessly towards the stars, we implore you to take unto your records and recollection this worthy vessel hereafter and for all time known as \u0027Memory of Tomorrow\u0027, guarding her with your high and mighty tentacled arms and ensuring her safe passage throughout her journeys in your realm. In appreciation of your munificence and in honor of your greatness, we offer these libations to your majesty and your court.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAmen!  Kraken bless this ship and all who sail in her.\n\u003C/p\u003E\n"},{"CreatedByName":"Comrade Xmir","CreatedById":159934,"CreatedDateTime":"2016-03-08T21:17:58Z","Content":"\n\u003Cp\u003E\nSweet!\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-10T17:05:04Z","Content":"\n\u003Cp\u003E\nSo I was experimenting in an alternate save last night, and discovered that interfacing with Laythe\u0027s atmosphere when you\u0027ve entered into the Joolian system in a retrograde orbit = instant death. Orbital velocity at Laythe was well over 7,500m/s and even though my aeropass was not below 55km it was still like hitting a brick wall. As for why one would even want to do that.... No clue.\n\u003C/p\u003E\n\u003Cp\u003E\nIn other news Mün operations are Go. We\u0027ll cover that tonight. Found some fun stuff even I had forgotten about.\n\u003C/p\u003E\n"},{"CreatedByName":"insert_name","CreatedById":150339,"CreatedDateTime":"2016-03-10T17:49:11Z","Content":"\n\u003Cp\u003E\nwhy are mackfred and agake orange suits?\n\u003C/p\u003E\n"},{"CreatedByName":"TopHeavy11","CreatedById":154744,"CreatedDateTime":"2016-03-10T17:51:12Z","Content":"\n\u003Cp\u003E\nBecause Entropy.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-10T18:03:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222451016\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457632151\u0022 data-ipsquote-userid=\u0022150339\u0022 data-ipsquote-username=\u0022insert_name\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, insert_name said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhy are mackfred and agake orange suits?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey were the first kerbals I recruited in this save, along with the rest of the Carbon 6, so it only fits they should wear orange suits. The Aluminium 5 wear red. Not sure what suits the next batch of recruits will get, probably not violet.\n\u003C/p\u003E\n\u003Cp\u003E\nEarly on I was leaving the suits as TextureReplacer random, but then TR decided everybody needed to be female so I had to intervene.\n\u003C/p\u003E\n\u003Cp\u003E\nThomlock is probably the only kerbal of mine that\u0027s worn the \u0022new blue\u0022 default suit since I started using Texture Replacer. \n\u003C/p\u003E\n\u003Cp\u003E\n(Hmm... Just noticed I typo\u0027d the filenames on the images from the last update. Looks like that all happened in 2013 instead of 2016.)\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-11T08:57:31Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EThe Mystic Mün\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0232_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022586\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0232_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0235_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022588\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0235_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022First time I saw this old Mün from space it wasn\u0027t nearly as beat up. Just a few craters here and there.\u0022 The Memory of Tomorrow had arrived in its 50km orbit more than an hour ago, an hour which Thomlock had spent examining the Mün from the shuttle\u0027s cockpit. The large canopy gave a nearly unobstructed view, perfect for watching thousands of craters slip by from on high. \u0022Of course I was still in shock from the launch. Seeing it slide past was proof I wasn\u0027t coming home.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022This time I can promise you\u0027ll come home.\u0022 Macfred was just behind the pilot\u0027s chair, also mesmerized by the vast grey emptiness below. Above. Beside.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ha! Space is my home now kid. I\u0027ve been up here so long Kerbin just doesn\u0027t feel right. The kerbals don\u0027t feel right. So home is now a tin can smaller than my first car, wrapped in nothingness and death for as far as the eye can\u0027t see.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well, if you\u0027re ready to spend a few more days in this can there are a few satellites I\u0027d like to check out. Thing candidates mostly. Should keep us busy until the R\u0026amp;D kerbs get that lander prototype to us.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Alright then. Let\u0027s go. Get the kids aboard. This train\u0027s leaving.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\nFirst on Macfred\u0027s list was a small satellite observed in a higher, 200km orbit. With all four crew members crammed in the Sulphur shuttle they detached from the Memory of Tomorrow and made their way upwards. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0239_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022589\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0239_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs expected this turned out to be a very small satellite, just a barrel of fuel and more antennas than the solar arrays on it could have ever powered. (Was it missing solar panels? Had someone robbed it of an \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E? Had it already been harvested for parts? Hard to say.) Macfred ventured over to it, forced an antenna open, and the 3.1-Comms-G1-A started loudly pouring forth a stream of ones and zeros. \n\u003C/p\u003E\n\u003Cp\u003E\nAt least it would do for another relay satellite.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0247_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0247_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTheir next target was large and in a dangerous orbit. Dangerous because while it was going retrograde around the Mün in its 100km orbit, two other bits of Stuff were orbiting at the same altitude in a prograde fashion. Only 850m/s relative velocity there. Clearly they were \u0022safe\u0022, in that had they any intercepts there would instead be a large cloud of debris (or a good chance that objects of similar mass would cancel each other out and fall directly to the Mün\u0027s surface).\n\u003C/p\u003E\n\u003Cp\u003E\nThey made sure to bring the Sulphur shuttle down through an orbit that didn\u0027t intersect the two prograde objects. They arrived at the Thing (Mün Thing 1) just as the Sun was slipping out of view.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0262_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0262_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022You weren\u0027t kidding about its size, Mac.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well, we first observed this Thing using one of the Magnesium satellites around Kerbin, so we knew it had to be big. Still, it\u0027s not quite as large as we expected. Very massive, just not large. I\u0027m guessing that tank-like structure is just like the others back in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. And full of fuel.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Fuel, eh? Can we trust it?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Only one way to find out.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThomlock danced the shuttle around to face the nearest docking port and was surprised when the terminal pinged to life in front of him. \u0022Hey, check it out. Docking port camera feed from your Thing over there. Fancy.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0266_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0266_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA few moments later and they were docked. The records on the station were still fresh, and Agake was pleasantly surprised to find the attached Laboratory was still clean and in good order. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022A good 500 points of science here, at least.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGood news for the R\u0026amp;D teams back at Kerbin. And for the administration, who was too busy finding inventive things to do with bean and queso dip to notice the science points, thanks to the endless barrage of platitudes and funds from the World\u0027s Firsters. Mün mission? What\u0027s that? Sorry, can\u0027t hear you over the sound of the popcorn and corn chips. Mmm.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0224_mot.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0224_mot.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew spent a couple days at their new found station, which turned out to be rather new indeed. \u0022Pequoni 2\u0022 all the documentation read, what little of it there was. No station logs or any other operational data as was seemingly the theme, but plenty of notes to pick up on in the lab. And quite a few ongoing experiments in its racks. Staffed with an experienced scientist it could crank out at least 1 science point per day.\n\u003C/p\u003E\n\u003Cp\u003E\nThe chronometer showed less than a decade of flight time, meaning not everything in orbit was as ancient as Baile Speir and Kelgee. And the living quarters proved to be rather spacious. A four-kerbal common room just down from the Lab, and four rather spacious single-kerbal personal rooms situated around the core docking node. \n\u003C/p\u003E\n\u003Cp\u003E\nThe fuel in the \u0022Big Orange Tank\u0022 even proved to be in good shape, perhaps needing a good stirring, but otherwise safe to burn. So they topped off the fuel tanks of the Sulphur shuttle and waited. And then Macfred had his crazy idea.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022A complete stop. Then we go back the other way. The ship has a good 2,500m/s of delta-v in just the primary fuel system alone. With the excess fuel here, we can afford to do it and still make it back to the Memory of Tomorrow. Even stop here at Pequoni 2 and refuel again first.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hey, it\u0027s your mission. If you think it\u0027ll work...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It\u0027ll work. Let\u0027s go see what this big scary thing is that\u0027s been buzzing us for the last thirteen hours.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0277_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022586\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0277_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe maneuver planning was rather simple: Determine how long it would take to complete the 464m/s complete deorbit burn and the equivalent reinsertion burn, divide the time in half, figure out where your next closest meeting is with \u0022Mun Thing 2\u0022, and start burning halfway there. Simple.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0283_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022589\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0283_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd sure enough it worked. Macfred and his crew became quite possibly the first kerbals to ever change directly from a retrograde munar orbit into a prograde munar orbit. At least the first anyone back on Kerbin knew of, doubly so since these were the first four kerbals to ever visit the Mün. Right?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0290_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0290_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Another station?\u0022 Gletrix was taking a turn at the controls. \u0022I\u0027m starting to think we\u0027re the only ones that haven\u0027t built one yet.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nMacfred was watching out of the rear docking port. \u0022Looks old. Different architecture from the others, sort of. Couple of strange craft docked to it, too.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I\u0027m picking up radiologicals.\u0022 Agake was working the magic scanner one of the interns had built while experimenting with the early RTGs. Near as they could tell kerbals were unaffected by the damage blutonium and similar radioactives caused, but the ship\u0027s computers were a different subject. One accidental erasure had already wiped out munths of data in the lab, so they had to devise a sure-fire way for telling when their blutonium pellets were exposed to the void without any shielding. This clicking gizmo was just what the angry computer doctor ordered. \u0022Nothing too strong, but considering our distance...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Guess I\u0027ll have to go out and take a look. Maybe we hit the jackpot?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0290_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0290_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0294_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022589\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0294_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0297_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022586\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0297_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt took a few minutes for their shuttle to pump a breathable atmosphere into the apparently vacated station. It wasn\u0027t a complete vacuum, but the low pressure and complete lack of oxygen would\u0027ve brought the most strong-willed of them to their knees.\n\u003C/p\u003E\n\u003Cp\u003E\nThis time the station\u0027s clock showed 38 years, 252 days of flight time. A cursory check showed that once again no data beyond the name of the station had been left behind - a very generic name at that - KTS 3.1.1 Mun. One poster suggested it was part of the KARTE project, possibly one link in a series of transfer stations?\n\u003C/p\u003E\n\u003Cp\u003E\nThe station\u0027s solar arrays were more than enough to power all of its communications equipment, which Macfred started to bring online. The larger of the dishes he left deactivated, as the mid-tier was sufficient for reaching Kerbin. Of the three ships docked at the station, one appeared to be a construction bot nearly identical to \u0022Gerty\u0022 at Kelgee Station, one was apparently a shuttle not dissimilar to their own (if a bit bulkier and less attractive), while the third was a strange mess.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0300_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0300_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd a strange mess it was. Macfred slipped out to take a look at it. Apparently intended to serve as a fuel tanker, it featured two strange engines strapped to its side with explosive decouplers. And they were hot. Temperature scans showed them as being the warmest parts of the station, even including the recently warmed-up crew cabins.\n\u003C/p\u003E\n\u003Cp\u003E\nThe side of the engine featured a bright orange plug with labelling indicating it was loaded with blutonium, an unexpected surprise. Were they burning straight rocket fuel and oxidizer with this? To what end? He made sure to take plenty of pictures to send them back to the interns in the lab (and Wernher, who would no doubt be drooling over it), and even attempted to disconnect an engine from its frame before decided it was best not to wake sleeping dragons.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0311_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0311_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHe did however take the liberty of relieving the docked vessel and the station of three RTGs. They may have all the power they need for the Jool mission, but these would no doubt be useful for the Dres mission. Stashed on the underbelly of the Sulphur shuttle for safe keeping, they would be dropped off at Kelgee whenever they returned down-well to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0303_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0303_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0307_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0307_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0308_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0308_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew spent a few more restful days at the KTS 3.1.1 Mun before Macfred decided to head out to their next target - a small satellite in a somewhat inclined 100km prograde orbit. It was the only other bit of Stuff observed in a low-ish prograde orbit, and some suspected it might somehow be related to the station. (One crackpot theory had even suggested it was a formerly crewed spacecraft.)\n\u003C/p\u003E\n\u003Cp\u003E\nAs they were planning to return to Pequoni 2 in the exact opposite of their current orbit soon, this might be the only chance they would have at investigating this small wanderer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0313_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022588\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0313_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow this was indeed a strange one. From a distance it first appeared to be a small station. Except there wasn\u0027t a crew module. Or crew anything. The closer it got the more it just looked like a set of three large solar panels around a soft core and nothing else. Something was obviously missing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0319_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022589\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0319_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVery strange. \n\u003C/p\u003E\n\u003Cp\u003E\nAs usual Macfred grabbed his wrench and made for the airlock.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0321_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022588\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0321_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well, I don\u0027t see any obvious means of propulsion. There\u0027s a computer core that appears to be offline, and a cold gas attitude control system and what appears to be a large reaction wheel, larger than anything I\u0027ve ever seen. No backup antenna. Batteries are a gooey mess, but I can bypass them and just wire the solar arrays direct to the flight core.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHe tinkered around inside the probe for several minutes until he was knocked back by a slight impact.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Whoa!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0323_mot.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0323_mot.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Whats up?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Just got smacked in the windshield by an antenna. Appears to be in good shape, but with the probe shut down for so long, if it had any star tracking equipment onboard it probably long offtrack. Seems like it has no idea where Kerbin is. I\u0027ll spin it around to face home. Maybe ground can get something from this bird.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe reaction control system was still in top shape, so he turned that on and pointed the dish in the general direction of Kerbin. And then he took a glance at the clock, which he had to read twice before he believed it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hey Thomlock.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yeah?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I think I found your long lost cousin. A probe named Phantom 0. Clock shows a flight time of 93 years, 117 days, 3 hours and some change. Says it belongs to someone named Tom Lock Kerman. Is he a relative of yours?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Strange, I don\u0027t seem to remember ever owning a probe. Very interesting.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Good, \u0027cause I made that last bit up. I\u0027m done out here. Go ahead and get the course plotted for our burn to return to Pequoni 2. Hopefully those R\u0026amp;D clowns have some good news for us by now.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGood news? Edsel isn\u0027t so sure that long ladder climb is good news. Perhaps it is, perhaps it isn\u0027t...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160310_ksp0330_s-x.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022587\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20160310_ksp0330_s-x.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n... but either way it\u0027ll have to wait until next time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNavigation: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126972-forgotten-space-program/\u0026amp;do=findComment\u0026amp;comment=2464846\u0022 rel=\u0022\u0022\u003ENext Post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-04T07:16:30Z\u0022 title=\u002212/04/2016 07:16  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 4, 2016\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TopHeavy11","CreatedById":154744,"CreatedDateTime":"2016-03-11T13:02:51Z","Content":"\n\u003Cp\u003E\nNO! You must make moar NOW! I can\u0027t wait!!\n\u003C/p\u003E\n\u003Cp\u003E\nBTW I love your designs.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-11T13:03:12Z\u0022 title=\u002203/11/2016 01:03  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 11, 2016\u003C/time\u003E by TopHeavy11\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-11T14:08:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222452086\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457686651\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022First time I saw this old Mün from space it wasn\u0027t nearly as beat up. Just a few craters here and there.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAh yes, the good ol\u0027 pre-0.21, smooth, rover-friendly Mun.  I miss it, too \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nReally looking forward to finding out what happened to the Old Kerbals and how the sudden appearance of Mun Pox fits into that.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-11T15:08:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222452241\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457701371\u0022 data-ipsquote-userid=\u0022154744\u0022 data-ipsquote-username=\u0022TopHeavy11\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, TopHeavy11 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBTW I love your designs.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222452318\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457705289\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAh yes, the good ol\u0027 pre-0.21, smooth, rover-friendly Mun.  I miss it, too \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nReally looking forward to finding out what happened to the Old Kerbals and how the sudden appearance of Mun Pox fits into that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne does not so easily wield Chekhov\u0027s Gun..... \n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022Flat Mün\u0022 wasn\u0027t just a conspiracy theory. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E While I do kinda miss the occasional long-distance rovering, this new version is a far more interesting place to visit. \n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-11T15:34:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222452408\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457708909\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne does not so easily wield Chekhov\u0027s Gun..... \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSee, as I always say and am in the process of demonstrating, I\u0027m not a writer.  I had to look this up.  Just guessing before I did it that, I figured this term had something to do with the mechanism behind the Late Heavy Bombardment \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyway, that\u0027s an interesting and logical concept, although I don\u0027t completely agree with it as it would IMHO tend to make the story too predictable.  As Lord Balfour said, \u0022Nothing matters very much and very few things matter at all.\u0022  Real life is crowded with stuff that has no bearing on anything you\u0027ll ever do, and full of misleading signals that grab your attention so you get blindsided by something else.  So, shouldn\u0027t literature be the same way?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe \u0022Flat Mün\u0022 wasn\u0027t just a conspiracy theory. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E While I do kinda miss the occasional long-distance rovering, this new version is a far more interesting place to visit. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmmm, I find the \u0022new\u0022 Mun interesting to look at and as a brief tourist destination.  But the real estate values suck, which tends to put a damper on development \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-11T16:36:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222452449\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457710454\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);background-color:rgb(255,255,255);\u0022\u003EAnyway, that\u0027s an interesting and logical concept, although I don\u0027t completely agree with it....\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI suspect the discussion the principle has generated as to whether or not it is universally applicable is what Chekhov was after, instead of creating some unbreakable rule. \u0022It is the role of the artist to ask questions, not answer them\u0022 after all.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd there\u0027s the possibility his gun comment is an early form of microfiction, as it both establishes a narrative and prompts questions.\n\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2016-03-11T17:13:00Z","Content":"\n\u003Cp\u003E\nI\u0027m still chuckling over the \u0022can\u0027t remember ever owning a probe\u0022 reference.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-03-14T02:03:18Z","Content":"\n\u003Cp\u003E\nNot doing so hot this weekend between alergies and other issues (Texas summers are killing me), so no update today. Aside from fiddling in the VAB all I got done was to rename the spent orbital stage of Silicon 2 to Chlorine 1 and the fuel tanker from Silicon 5 to Chlorine 2. Both have been docked up and will be moving into a low orbit for future reuse. \n\u003C/p\u003E\n"}]}