{"TopicId":126972,"ForumId":51,"TopicTitle":"Forgotten Space Program","CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-12-04T01:02:10Z","PageNum":57,"Articles":[{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2017-10-19T20:32:11Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EOut In The Cold\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHow long had they been on Vall? The Sun had risen twice since Thomlock disappeared, and they landed in the dark. Three days? Three Vall days at least. How many days was that on Kerbin? Macfred considered doing the math, but decided it wasn\u0027t worth it. He was too cold for math. \n\u003C/p\u003E\n\u003Cp\u003E\nVall is a very cold place, that much they\u0027d discovered. Especially in such extreme latitudes where the sunlight was thin and never far above the horizon. The low angles cast all manner of strange shadows. More than once he\u0027d found Thomlock\u0027s body, slumped on the ice, only to walk over and discover just another boulder, another set of misleading shadows. \n\u003C/p\u003E\n\u003Cp\u003E\nAgake was convinced the old space kerb had been vaporized. More than once she suggested continuing to search was pointless. Gletrix seemed to be of a similar mind, but was more supporting of Macfred\u0027s continued efforts. Besides, in absence of communication with Kerbin he was still the top ranking kerbal. If he wanted to stay here until their food ran out, that was his choice. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd so he kept looking. \n\u003C/p\u003E\n\u003Cp\u003E\nYet all he found was the cold. Cold was everywhere. His feet were cold. His hands were cold. Everything everywhere was cold, but he continued his search. \u0022Everything will be ok,\u0022 Thomlock had said. Is cold ok? Did he mean everything will be cold? Maybe, maybe not.\n\u003C/p\u003E\n\u003Cp\u003E\nAt least now they knew with certainty that Kerbin still existed. A message from The Boss had arrived shortly after Thomlock\u0027s disappearance. Things were not going well back home, with wild stories of power struggles and mass discontent, strange governments and bizarre conspiracies. The descriptions all pointed back to the cycles Bob and the other Forgotten had described, and perhaps to a bit of space madness. \n\u003C/p\u003E\n\u003Cp\u003E\nThey had only briefly exchanged information before the link was severed again. Macfred had relayed their science data and crew reports and explained the situation with Thomlock, and of course everything they knew about The Forgotten. The Boss had confirmed the orders to visit the other moons yet keep looking for Thomlock. And then... nothing. No further contact since two Vall days ago. \n\u003C/p\u003E\n\u003Cp\u003E\nThere was no good reason to keep the others at the anomaly, every square meter of ice around it had been searched. They\u0027d not have another chance to collect samples from the surface, so Macfred had sent them off to do other things. Gletrix was working as a radio relay in the Sulphur while Agake was out in the field doing science. There were a couple of \u0022biomes\u0022 near to their valley (or was it a crater?), one within close hiking distance.\n\u003C/p\u003E\n\u003Cp\u003E\nIt was eight kilometers out, a distance they would normally cover with a hop in the shuttle. Except the fuel levels were still questionable. Thomlock had assured them they could make it back to orbit, Gletrix had run the numbers again and came up with a different result. There would be no hops to other biomes unless they wanted to spend the rest of their lives here, and even making it back to orbit was suspect.\n\u003C/p\u003E\n\u003Cp\u003E\nSo hiking it was. Agake had ventured out early that morning, and was returning with a fresh set of samples from Vall\u0027s Midlands. She had stopped at an odd boulder on her way back, and was now describing it while taking a new sample. He was half listening to her, half meandering around the perimeter of the anomaly. It was a strangely welcome distraction.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It\u0027s a shame we can\u0027t take this entire rock back with us. Very out of place, with a blend of dark and light crystals. Resembles a huge lump of dirty quartz, though I think it\u0027s some form of water ice.\u0022 Macfred could hear her chipping away over the radio, the dull ringing of the hammer echoing through her suit. For a moment he imagined he felt each hammer strike as it happened. Thump. Thump. Thump.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I guess this tiny sample will have to suffice. Very pretty little rock.\u0022 The link went silent momentarily, a faint rustling sound on the other end. \u0022Tagged and bagged. Headed to base once again.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Copy that, Ag. The lights are still on.\u0022 Gletrix sounded bored. She was repeating the same canned phrases, this now the third time in the last hour she\u0027d commented on the lights being on. \u0022You find anything Commander?\u0022 And she was still asking the same questions, even though she knew the answers.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Negative. Just more ice and....\u0022 The shaking from earlier returned, yet the noises from Agake\u0027s radio were long gone. A low, deep rumble. Exactly as before. Long before. \u0022Wait a sec....\u0022 How long had it been going? Blue orbs appeared over the spires of the anomaly, and with them returned the ebb and flow of its energy. Static filled his radio.\n\u003C/p\u003E\n\u003Cp\u003E\nThe VallHenge was active once more.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170914_ksp0143_vallhenge.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170914_ksp0143_vallhenge.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHe tapped at the side of his helmet. Static. \u0022Agake?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I see it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Get back to the ship.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Already moving, still a few kilometers out.\u0022 Yet more static filled the connection, though faint enough for him to make sense of what he was hearing. \u0022You should do the same. Back off from the anomaly, no sense in losing you too.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe ground was now pulsating, its rhythm increasing in frequency as the energy built. Just like before. He watched as pebbles and small lumps of ice bounced with each thump, something missed the first time. They had been more interested in the lights, not what was happening to the rest of the moon. He wondered if these pulses could fracture the thick ice, or if the energy could melt it. No doubt this anomaly was contributing to the smooth surface nearby. \n\u003C/p\u003E\n\u003Cp\u003E\nBolts arced out from the orbs, the characteristic ring of plasma formed, and the same beam that had taken Thomlock shot upwards into the endless black. The blast of energy from its activation knocked Macfred backwards, off his feet and onto the cold ice.\n\u003C/p\u003E\n\u003Cp\u003E\nHis back was cold. The radio crackled. He heard voices, both loud and hurried and softly whispered. They weaved in and out of the background static, dancing against the interference. Was this what Sieta heard, all those years ago? Was this the sound that had inspired her music? One of the voices sounded like Gletrix, going on and on about... something. Another was unmistakable as Agake. He could hear both, but understand neither. Other voices were unfamiliar.\n\u003C/p\u003E\n\u003Cp\u003E\nThe light grew ever more blinding, beams of pure energy pulsating in their alien way. He pushed himself back onto his feet, brushed the ice and dust off of his cold suit. Checked to make sure nothing had broken. An arc reached out from the spire and grounded near him, his instincts made him back off.\n\u003C/p\u003E\n\u003Cp\u003E\nA shape formed in the dancing light. A dark shape, some shadowy thing, heading straight towards him. A demon from the stories of old? Perhaps, and a vaguely kerbal shaped one at that. A kraken having taken the appearance of one of their own? A voice deep inside told him to run, but he was frozen with a strange fear as the dark mass approached.\n\u003C/p\u003E\n\u003Cp\u003E\nIt stopped a few paces away, a dark hand reaching to its dark head. Eyes of a blinding fire pierced through Macfred, their fires burning brighter than the light from the anomaly. A scream belted forth, a banshee\u0027s wail. Loud as though inside his own head, distant as though at infinity. His hands instinctively shielded the sides of his helmet, reaching for his ears. The demon lowered its arm.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then it stopped. The anomaly went dark, the whispers and screams faded, the universe rebalanced itself, his mind calmed. The dark shape took a familiar form.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170914_ksp0142_thomlock.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170914_ksp0142_thomlock.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hey kid, how\u0027s it going?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHe blinked. This was no demon, no dark beast, but a flesh and blood kerbal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Thomlock?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You betcha. Miss me?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220171019_ksp0036_thomlock.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20171019_ksp0036_thomlock.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\nNavigation: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126972-forgotten-space-program/\u0026amp;do=findComment\u0026amp;comment=3201534\u0022 rel=\u0022\u0022\u003ENext Post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-23T06:13:31Z\u0022 title=\u002210/23/2017 06:13  AM\u0022 data-short=\u00226 yr\u0022\u003EOctober 23, 2017\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"obney kerman","CreatedById":171373,"CreatedDateTime":"2017-10-19T22:46:07Z","Content":"\n\u003Cp\u003E\nYUS!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223198944\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508445131\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022You betcha. Miss me?\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReally Thomlock? Really?\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2017-10-20T01:55:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223198944\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508445131\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt stopped a few paces away, a dark hand reaching to its dark head. Eyes of a blinding fire pierced through Macfred, their fires burning brighter than the light from the anomaly. A scream belted forth, a banshee\u0027s wail. Loud as though inside his own head, distant as though at infinity. His hands instinctively shielded the sides of his helmet, reaching for his ears. The demon lowered its arms.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI want one of those machines \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2017-10-20T06:56:00Z","Content":"\n\u003Cp\u003E\nIs it just me, or did the whole \u0022return of thomlock\u0022 have a very similar flavor to the return of starbuck in BSG?\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2017-10-20T15:12:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223199271\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508482560\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs it just me, or did the whole \u0022return of thomlock\u0022 have a very similar flavor to the return of starbuck in BSG?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe one where Starbuck repairs the Cylon and then jokes around with it for an hour before stealing its ship and flying to Disneyland? \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2017-10-20T15:15:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223199444\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508512338\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe one where Starbuck repairs the Cylon and then jokes around with it for an hour before stealing its ship and flying to Disneyland? \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf i\u0027m remembering correctly, you\u0027re talking about the last episode of Galactica 1980 (horrible abomination of a show). I\u0027m talking about the re-imagined show...\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2017-10-20T16:02:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223199446\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508512533\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf i\u0027m remembering correctly, you\u0027re talking about the last episode of Galactica 1980 (horrible abomination of a show).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt wasn’t a complete abomination, just mostly one. It was the super-lazy zero-cost production that hurt it - even spending an extra $10 would’ve made the horrible campiness ok-ish. I remember one of the crew saying by the time G:80 started they didn’t have any Cylon suits left that weren’t full of squib holes, and had no money to make more.\n\u003C/p\u003E\n\u003Cp\u003E\nThat same episode kinda-sorta made its way into the first season of BSG where Kara also nicked the Cylon ship.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNo deliberate parallels here, but if Thomlock starts tapping randomly on a piano you should become worried. \n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2017-10-20T16:21:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223199486\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508515371\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt wasn’t a complete abomination, just mostly one. It was the super-lazy zero-cost production that hurt it - even spending an extra $10 would’ve made the horrible campiness ok-ish. I remember one of the crew saying by the time G:80 started they didn’t have any Cylon suits left that weren’t full of squib holes, and had no money to make more.\n\u003C/p\u003E\n\u003Cp\u003E\nThat same episode kinda-sorta made its way into the first season of BSG where Kara also nicked the Cylon ship.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNo deliberate parallels here, but if Thomlock starts tapping randomly on a piano you should become worried. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, i do remember the one where she fixed up the kinda brain-dead raider...cool episode.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the G:80 episode though, Starbuck was marooned.....Had the show not been canceled, He would have been rescued by the Seraphs, and kept aboard the ship of light, as a guest...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sure it wasn\u0027t deliberate, but it just felt similar.....he disappeared in grand fashion, was shown truths by someone he thought was dead, and then was returned to his old life, in a \u0022poof, here i am, miss me?\u0022 kinda way.. just like Kara..\n\u003C/p\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2017-10-20T17:15:08Z","Content":"\n\u003Cp\u003E\nCylons aside, it was a good chapter... cannot wait to see what happens next!\n\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2017-10-20T21:29:47Z","Content":"\n\u003Cp\u003E\nAt least one great line came out of the (original) episode, though.  Starbuck has the opportunity to ask a Cylon what their goal is, other than the whole kill-all-humans thing.  \u0022Cy\u0022 explains that they intend to \u0022organize\u0022 the universe.  Starbuck asks the logical next question, \u0022And then what?\u0022  (after they get it all \u0022organized\u0022).\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022... NO ONE HAS EVER ASKED THAT QUESTION.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSo much for \u0022and they have a plan.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2017-10-23T06:13:02Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ELate Arrival\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt had been a productive day so far, and Agake was happy to get away from Macfred\u0027s pointless searches. Thomlock was gone, vaporized by the anomaly. That was the only logical conclusion. Otherwise they would\u0027ve found something; his helmet, a piece of metal, anything. The complete absence of any debris meant only one thing. And that was a thing Macfred seemed incapable of accepting.\n\u003C/p\u003E\n\u003Cp\u003E\nThe eight kilometers out to the Midlands had been an easy walk. She\u0027d covered three times that distance while looking for Thomlock, but there were surface samples and crew reports waiting at the end of it instead of strange obelisks and anomalous energy events. The ice there wasn\u0027t noticeably different, perhaps a bit more polished with a thicker layer of dust. How anything or anyone ever identified it as a different biome was beyond her understanding. She made a note to review the detailed satellite scans once she was back at the ship.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the way back she found a boulder. It was a very large one, formed of many mixed materials, and out here all on its own. There were many other similar pebbles around, but nothing this large. Some form of ejecta? Possibly, but there was no obvious impact on the nearby ice, and no impact she could think of that would include this much rock. What appeared to be pure water ice was mixed with the darker matter, making this lump all the more exceptional. Debris from one of the other moons? Very likely.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170914_ksp0145_agake.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170914_ksp0145_agake.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe opened a radio channel to the lander and relayed her findings to Gletrix. \u0022It\u0027s a shame we can\u0027t take this entire rock back with us. Very out of place, with a blend of dark and light crystals. Resembles a huge lump of dirty quartz, though I think it\u0027s some form of water ice.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe samples from the midlands took up most of her suit pouches, but she had room for another at least. She slipped her pick loose and started chipping away at the boulder, dropping the damaged pieces into a sample container. It didn\u0027t take much effort, a few rhythmic taps, and the surface fractured along one of the lighter bands. Obviously ice.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I guess this tiny sample will have to suffice. Very pretty little rock.\u0022 A bit of a shame, too, as the ice would no doubt melt once it was inside the ship. They had no way to insulate their samples long-term, meaning in a few hours a bag full of liquid water and some silt would be all that remained. All these many years the lump was frozen, and now this small part of it would be changed forever. Oh well, such is science.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Tagged and bagged. Headed to base once again.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGletrix droned back a response on the radio, rather monotone and mentally distant. \u0022Copy that, Ag. The lights are still on.\u0022 She went on to discuss some matter with Macfred, during which Agake tuned out by default. Or she did until the anomaly started glowing. It was faint at first, still some three or four kilometers out, but obvious. She sealed her suit pouches and took off towards the ship at a sprint.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Wait a sec....\u0022 Macfred had noticed it. \u0022Agake?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I see it.\u0022 The orbs were brighter now, and the ground was throbbing softly. (Or was that a trick of the mind caused by her running?) Not unlike the previous event. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Get back to the ship.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Already moving, still a few kilometers out.\u0022 She paused to take a breath, running in such low gravity was harder than one would expect. \u0022You should do the same. Back off from the anomaly, no sense in losing you too.\u0022 Why did she say that? Was it a mistake? Macfred was still convinced Thomlock was alive. Would he try to prove her wrong and run into the beam? To follow Thomlock? Maybe she shouldn\u0027t have said that.\n\u003C/p\u003E\n\u003Cp\u003E\nStatic filled her radio. Gletrix was going on about something, but the unintelligible noise overstepped her. And it only got worse when the anomaly fired its beam.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170914_ksp0152_agake.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170914_ksp0152_agake.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was active only a few seconds, but the event had rendered either the ship or her suit radio inoperable. No response from Gletrix, nothing from Macfred. She called out every few minutes anyway. \u0022Agake, Sulphur, please respond.\u0022 Nothing. A brief stop to check what parts of her suit she could reach revealed nothing, and she had no idea if it was on her end or theirs. Occasionally a short, static-filled burst would scratch its way out of her headset, but nothing more. Scritch.\n\u003C/p\u003E\n\u003Cp\u003E\nIt didn\u0027t take long to cover the remaining distance. There was nothing obviously amiss at the Sulphur, and she could see shapes of kerbals moving through the windows. More than one of them too; Macfred had apparently not charged into the anomaly. Good. Yet why had she not heard anything? Her radio must be dead.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170914_ksp0154_agake.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170914_ksp0154_agake.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe paused at the top of the ladder to transfer her surface samples to the cockpit\u0027s science container. While it was exposed to the void it still wasn\u0027t entirely insulated from the heat of the ship. Even just being in her suit pouch had made the boulder sample turn mushy, rather like a snowball sat in the sun for too long. Oh well, at least it was intact and unspoiled, along with her notes and observations of its collection. She closed the container, opened the airlock, and climbed back inside the all too familiar ship. \n\u003C/p\u003E\n\u003Cp\u003E\nHer helmet and mittens were stowed away before she dropped into the lower levels. If there was something wrong with the suit radio Macfred would need to fix it, so she kept the EVA pack. It was a tight fit inside the Sulphur; she unhooked the bulky EVA pack and lowered it into the cabin below her.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s when she noticed there were three others aboard, not two. An aged, grey-haired kerbal was looking up at her, eyes alight with some newfound energy. Thomlock.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We thought you were dead!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I get that more often than you know.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Vaporized!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022No,\u0022 Gletrix interjected, \u0022you thought he was dead. And you were wrong. Pay up.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022What?!\u0022 Macfred and Thomlock glanced at each other before looking with disbelief to their backup pilot. So Macfred didn\u0027t know about her wager with Gletrix after all. She felt herself turning a darker shade of green, somewhat embarrassed to be so suddenly reminded of it. Gletrix should have kept her mouth shut, especially in front of Thomlock.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Fine.\u0022 She climbed back up into the shuttle to her locker and removed a small, tightly wrapped brick. This was the last of her dessert rations on the shuttle. It was the good stuff, the squishy blue stuff. Sure, there was more of it back at the Jumble of Parts, and plenty to go around for all four of them, but if they kept to the mission plan they wouldn\u0027t be back there for several munths. Until then she was stuck with the bland normal snack rations. She tossed the package down to Gletrix. \u0022Here, that\u0027s all of it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nShe smiled at her prize, mockingly and loudly. \u0022Mmmmm.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ok then.\u0022 Agake turned to Thomlock, \u0022How are you still alive?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022As I was just telling the rest of the crew, I, well, I don\u0027t know. So I\u0027ll tell you what I do know.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\nShe found a comfortable place to perch while Thomlock described the last several days of his life. How the anomaly is just a marker of where a portal can be opened, a portal that will connect them to some other star system. How at this distant star system there was a moon where kerbals could live, possibly even thrive. How the Kerbol System was a construct, completely artificial, and built in every way to keep them trapped indefinitely. And how they needed to get back to Kerbin as soon as the transfer window was open so they could save everyone from their repetitious fates.\n\u003C/p\u003E\n\u003Cp\u003E\nHis tale left her with far more questions than answers, and she was certain he was leaving things out deliberately. Just too many holes in the story. Was this Albro character someone that could be trusted? Was anything he said real? How did these portals work? What is The Machine? How did they construct such small planets with such massive gravity using seemingly normal matter? How did Kerbol even maintain a fusion reaction at its small size and low mass? What were the Kraken? Where did kerbals come from?\n\u003C/p\u003E\n\u003Cp\u003E\nSo much of what Thomlock had said went against every basic principal of known kerbal science, which convention dictated to be impossible without overwhelming evidence. And yet here he was. Not vaporized, not dead, and not obviously spacecrazy. Of course there was the chance he had been hiding and was now lying about the entire ordeal, but she judged that to be very unlikely. Which meant the entire body of her knowledge of the physical universe was based on an untrue premise, and not for the first time.\n\u003C/p\u003E\n\u003Cp\u003E\nTo think they once thought there were barrels full of fleas, barrels that exploded. How simple everything was back then. \n\u003C/p\u003E\n\u003Cp\u003E\nWhen did life become so complex?\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\nNavigation: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126972-forgotten-space-program/\u0026amp;do=findComment\u0026amp;comment=3229895\u0022 rel=\u0022\u0022\u003ENext Post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-28T08:39:11Z\u0022 title=\u002211/28/2017 08:39  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 28, 2017\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2017-10-24T03:30:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223201534\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508739182\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nShe smiled at her prize, mockingly and loudly. \u0022Mmmmm.\u0022 \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhether it be grog rations, or desert, or years on Davey Jones\u0027 ship, sailors will wager their most prized possessions.  This is a trait which has never gone unnoticed by those who cater to sailor needs ashore wherever they happen to make port.  This simple thing proves the reality of this whole thread.  I cringe at thinking about what all humanity has Forgotten \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI believe it was Goethe who said, \u0022Everything has been thought of before; the problem is to think of it again.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTo think they once thought there were barrels full of fleas, barrels that exploded. How simple everything was back then. \n\u003C/p\u003E\n\u003Cp\u003E\nWhen did life become so complex?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWait, you mean barrels of fleas don\u0027t explode?  Geez, I\u0027ve been going about eradicating them all wrong \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"obney kerman","CreatedById":171373,"CreatedDateTime":"2017-10-24T13:24:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223201534\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508739182\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎10‎/‎23‎/‎2017 at 1:13 AM, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow the anomaly is just a marker of where a portal can be opened, a portal that will connect them to some other star system. How at this distant star system there was a moon where kerbals could live, possibly even thrive. How the Kerbol System was a construct, completely artificial, and built in every way to keep them trapped indefinitely. And how they needed to get back to Kerbin as soon as the transfer window was open so they could save everyone from their repetitious fates.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis feels like interstellar. A portal near a gas giant leading to another star system used to save \u003Cs\u003Ehuman \u003C/s\u003EKerbalkind.\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2017-10-24T14:01:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223202418\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508851445\u0022 data-ipsquote-userid=\u0022171373\u0022 data-ipsquote-username=\u0022obney kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, obney kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis feels like interstellar. A portal near a gas giant leading to another star system used to save \u003Cs\u003Ehuman \u003C/s\u003EKerbalkind.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd also there was a kerb with space madness earlier who stole a spaceship.\n\u003C/p\u003E\n"},{"CreatedByName":"Starslinger999","CreatedById":130027,"CreatedDateTime":"2017-11-02T00:11:51Z","Content":"\n\u003Cp\u003E\nQuick Question: Whats the mod u used for the \u0022Carbon\u0022 capsule?\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2017-11-02T00:23:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223208973\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509581511\u0022 data-ipsquote-userid=\u0022130027\u0022 data-ipsquote-username=\u0022Starslinger999\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, Starslinger999 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nQuick Question: Whats the mod u used for the \u0022Carbon\u0022 capsule?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt’s from an older version of Tantares. \n\u003C/p\u003E\n"},{"CreatedByName":"Starslinger999","CreatedById":130027,"CreatedDateTime":"2017-11-02T00:24:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223208983\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509582217\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt’s from an older version of Tantares. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAh. Darn.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2017-11-20T04:15:28Z","Content":"\n\u003Cp\u003E\nAn update: Sometimes when life gets busy, it gets so overly busy that it sucks the oxygen out of the room and leaves nothing for anything else (or some other metaphor that works). This has been one of those months. Thankfully things are slowing down now (or appear to be). And we get a couple of days for holiday this week in the U.S., so I’ll hopefully find some time where I can sit down, relax, and get back to kerbal and writing about kerbal. So the next post (or next several posts) should start flowing again in a few days. I hope.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat a year. At least it’s been interesting. Cheers.\n\u003C/p\u003E\n"},{"CreatedByName":"xkerbal","CreatedById":173361,"CreatedDateTime":"2017-11-25T21:29:12Z","Content":"\n\u003Cp\u003E\nWow\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2017-11-28T08:38:23Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ELate Departure\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThomlock\u0027s story of distant Espadarte ran late into the day. And in Geltrix\u0027s opinion it was stretching plausibility much too thin. Portals? Ok, maybe. He\u0027d obviously gone _somewhere_. Unless he\u0027d suddenly become the elite of all hide-and-seekers in the shortest time ever he had not been on this moon. Yet portals to a distant star system? Where their supposed creators had originally lived, and lived long enough to spawn this infinite Machine? (And not just any machine, mind you, but The Machine.) The tale had the same edge to it as the stories told by those among the \u0022space mad\u0022 kerbals. And that wasn\u0027t a good thing.\n\u003C/p\u003E\n\u003Cp\u003E\nThe worst part was he offered no explanation as to why. Why Thomlock? She guessed perhaps that part was obvious; he was the only living kerbal this Albro character could relate to. Yet why? Why did his old friend decide to whisk him away? Just to have a brief chat? To catch up on the times? To reveal the dark underbelly of existence and send him back with only vague promises? Nonsense. Something was missing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170914_ksp0155_thomlock.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022567\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170914_ksp0155_thomlock.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThomlock slipped outside to inspect the Sulphur and prepare for launch. They were several hours from leaving Vall, but their window opened long after sunset. Now was the time to do anything that required sunlight. Any of them could have taken the chore, technically it was Macfred\u0027s job to do the inspection, but when Thomlock offered they all agreed. He was, after all, an equal member of their crew, and qualified to do all three of their jobs. And they had quite a few things to discuss about him. \n\u003C/p\u003E\n\u003Cp\u003E\nAgake wasted no time, broaching the subject almost before the hatch was closed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Something doesn\u0027t add up.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And here I thought I was the only one.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nMacfred shook his head. \u0022No, I agree with her. Something is missing. The story was lucid, Thomlock seems to be in good spirits and fully cognizant. I just, I don\u0027t know. There\u0027s something.\u0022 They watched through the cabin windows as their now strangely alien crew mate bounced between the Sulphur\u0027s main engines. \u0022I\u0027m sure if it\u0027s important he\u0027ll tell us. It\u0027s not like Thomlock to hold back.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ok, so maybe he\u0027s hiding something. What? And how do we coax it out of him?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Maybe we don\u0027t. At last not until we\u0027re on our way back to Kerbin. Though depending on what it is he may not even tell us then.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You don\u0027t think it has something to do with The Forgotten, do you?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022No, Agake, I don\u0027t. They\u0027re weird in their own right, but I think if we were about to head back into a den of vipers he\u0027d at least tell us that much. Whatever\u0027s going on, it\u0027ll just have to wait until we\u0027re home.\n\u003C/p\u003E\n\u003Cp\u003E\nHome. Free again, if only for a few moments. Gletrix rubbed at the base of her collar, the bothersome and uncomfortable thing that it was. The mere mention of Kerbin was enough to remind her of the days when she had been free of that annoying helmet ring. Had it really been four years? No, couldn\u0027t be. \u0022So now the important question,\u0022 she gave the collar a quick twist to adjust it, a bit of a fidget, \u0022do we let Thomlock pilot us back to orbit? Or should I do it?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You\u0027re the only other pilot here. What do you think? Is he fit to fly?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I ain\u0027t no doctor, chief.\u0022 She\u0027d hoped Macfred had already decided for her; it certainly wasn\u0027t a decision she relished making. \u0022I mean he seems to be all here. The story might be strange, and maybe it\u0027s all true, but he didn\u0027t obviously break from the experience.\u0022 A quick glance outside revealed a remarkably spry kerbal, still bounding about on the ice. \u0022And he hasn\u0027t lost any of his motor functions. I guess he\u0027ll be ok? Who knows. I can always take over the ship using the terminal here in the cabin if something goes wrong.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hopefully that won\u0027t be necessary.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nFrom there the chatter degenerated into the usual smalltalk; Agake grumbling about her lost bet, Macfred zoned out and scanning through radio frequencies. Thomlock burst through the airlock shortly thereafter, announcing his intention to take a good, long nap until they were ready for launch. She hadn\u0027t realized it, but she was rather tired as well. And so she curled into a ball in her seat and drifted off to sleep.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\nShe awoke to the rattle of her seat\u0027s harness. The ship had shuddered, most likely caused by the engines spooling up. Someone had strapped her in while napping; she hadn\u0027t even noticed. She must have been far more exhausted than she realized. A strange kerbal blinked at her from the other side of the window; it took a few seconds to recognize her own reflection. Groggy. These cold dark mornings were not all they were cracked up to be. A quick shake of her head and she was awake, though koffee would be the best fix. \n\u003C/p\u003E\n\u003Cp\u003E\nThomlock\u0027s voice boomed into her helmet speakers, and now she was really awake.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ok kiddos, say goodbye to Vall.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\nThe sunlight was gone, its timid warmth no longer brightening the icy plains. Launching from the darkness, in the darkness, into yet more darkness. As was only right and proper. It was a strange phrase that, burned into their minds through some shadowy indoctrination, yet so perfectly fitting for their space agency. Half of everything happened in the dark, most of it forgotten before the next sunrise. \n\u003C/p\u003E\n\u003Cp\u003E\nHer still sleepy brain registered the flash of  the engine lights before it felt the shudder. The ice was briefly illuminated in an unnatural warm glow, a cloud of vapor spreading out in their wake. And then they were away, led willingly into the dark by a twice dead kerbal. What could possibly go wrong?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170915_ksp0164_vall.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022569\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170915_ksp0164_vall.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170915_ksp0166_vall.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170915_ksp0166_vall.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe g-forces were nice; enjoyable even, after so many days in the lower gravity of Vall. Everything was pulled along one vector, backwards. She only noticed the pitch over maneuver because Tylo slipped out of her view. \n\u003C/p\u003E\n\u003Cp\u003E\nTylo, the only moon of Jool they wouldn\u0027t land on. They weren\u0027t even planning to fly by the moon, unless it was in a position copacetic to their destination. Disappointing, somewhat, but when they left Kerbin the agency lacked the resources and the tech to land them safely on Tylo and return them to orbit. Heck, they weren\u0027t even sure they could get them back to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s just that Jool 4 just doesn\u0027t have the same ring to it. Jool 5 was where it was at, what all the cool kerbals talked about. Yet she was getting way ahead of herself. They\u0027d only landed on two of the moons, and as impressive as it was to be the first kerbals to land on Laythe, a Jool 2 was only half of the accomplishment of a Jool 4. Half the number of service ribbons, too. Thankfully she had secured that \u0022first to land on Laythe\u0022 achievement alone, quite likely the last kerbal to ever do so. \n\u003C/p\u003E\n\u003Cp\u003E\nSo maybe she wouldn\u0027t hit all five, but she would still be first. And possibly last. Good times.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then the engines cut out. Or... not so much cut out as sputtered out. Two completely different sounds, and any kerbal would recognize the difference. One was good, the other was \u0022uh oh, what now?\u0022 Even a mechanically disinclined scientist such as Agake would know the difference. One is a sharp jolt, the other is a series of uncomfortable jolts. Sometimes followed by a kerbin-shattering kaboom. \n\u003C/p\u003E\n\u003Cp\u003E\nGletrix only realized the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E was firing after the main engines went silent. A strong hiss as the tanks vented into the rear jets. Not a good sign.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022T? How we doing up there?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSilence for a few seconds. Too many seconds and too much silence.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Don\u0027t you worry about us, I\u0027ll get us back into orbit. Just a bit more. A bit more.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E sputtered out. Macfred chimed in from below. \u0022Was that the last of the monoprop?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Nope, there\u0027s still some in our EVA packs.\u0022 Gletrix heard the latches of Thomlock\u0027s harness clang off of the console before she saw him drift out of the seat. \u0022We\u0027ll make orbit, even if I have to get out and do it the old fashioned way.\u0022 He spun around to face her as he pulled his EVA suit on over his flight suit. \u0022Which is what I\u0027m going to do. Get out and push. It\u0027s the kerbal way.\u0022 He zipped up the thick EVA suit and started pulling the straps tight. \u0022You might want to bring the other Sulphur down to meet us, just in case something goes wrong.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Shouldn\u0027t we wait until we\u0027re in orbit?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nMacfred floated forward to help Thomlock with his suit. \u0022If something goes wrong we won\u0027t make orbit. There\u0027s enough oomph in our packs to get the four of us into a safe orbit without the shuttle, but if we lose the ship we lose the remote controls to the other Sulphur. I don\u0027t need to run the number to know we\u0027ll never make it into a higher orbit and change planes on our EVA packs alone.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yeah. What the kid said.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThey had a point. She fired up the remote console and brought the other shuttle online. It didn\u0027t take long to get a rendezvous plotted and programmed into its flight computer. It wasn\u0027t ideal, the maneuver required three burns to reach them, but they\u0027d at least live long enough to get to the other Sulphur. Even if that rendezvous was the hard way; in an EVA suit. And on the dark side of the moon, because fitting and right and proper and all that joy.\n\u003C/p\u003E\n\u003Cp\u003E\nThey weren\u0027t particularly short of orbit anyway, close enough they could\u0027ve vented the shuttle\u0027s atmosphere and made it into a safe orbit. They might have even technically been in orbit anyway, with their apoapsis near 17km and their periapsis well above 2km. Probably not high enough to miss the icy moon\u0027s many ridges, and she\u0027d rather not find out through field testing. A quick mental check of the numbers and she was pretty sure one jetpack\u0027s worth of monoprop would be enough.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170915_ksp0178_vall.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170915_ksp0178_vall.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTheir periapsis crept further upwards the longer she watched. She hadn\u0027t even noticed Thomlock slip out of the front docking port, and the tiny fraction of a G from his EVA thrusters was barely enough to cause the debris floating around the cabin to move. Yet move they did, if slowly. The numbers crawled away from their likely doom and towards a dark conference with Sulphur. 3km. 4km. 5km. And on. \n\u003C/p\u003E\n\u003Cp\u003E\nJust then the other Sulphur performed its first burn, kicking into a higher orbit. There it would then commit its plane change, burning however many degrees it needed to align their orbits. She watched the telemetry to make sure everything was going as planned, and her heart almost stopped when the feed cut out. \u0022Connection Lost.\u0022 What? What!? Oh, of course, there were only so many options for data relays at Vall, and their relay had just drifted out of sight under the moon. This was why the craft were equipped with programable flight computers. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I\u0027m back. Miss me?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAgake groaned from the lower seats as Thomlock made his way inside. \u0022Not that line again.\u0022 He was done? Already? Gletrix tuned them out and looked back at the numbers. Orbit. He\u0027d finished the job while she was obsessing over the other shuttle. It was a good burn he\u0027d just performed, and close to her projection. She\u0027d need to make a tweak to the other Sulphur\u0027s program once it matched their inclination, but it was workable. Assuming the Sulphur ever came back into... no, there it is. \u0022I\u0027m back.\u0022 Contact. \u0022Miss me?\u0022 Maybe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170915_ksp0191_vall.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170915_ksp0191_vall.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA couple orbits and some strange maneuvers later and they were set. The two shuttles would drift toward each other in the dark, and just when everything seemed like it would be forever in that abyss, the sister Sulphur would shine like a gemstone in the candlelight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Precision.\u0022 Macfred drifted into the upper cabin just as the Sun crossed Vall\u0027s horizon. The Sulphur 3 was drifting in the void above them, station keeping a little over a hundred meters away. It had finished its rendezvous in the dark, matched orbits, and was now awaiting their arrival. All without direct control from a kerbal. Strangely independent, these machines they had built. Fill them with a program and along they would run, reacting to stimuli, putting on a good show, entertaining the crowds. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Just like fine clockwork. Nice job.\u0022 Was he talking to her? Was he commenting on her thoughts? Had she been talking aloud? Nonsense, of course he was talking about the rendezvous. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Thanks.\u0022  She closed the remote control terminal and unlatched her seat harness. \u0022I\u0027ll head over to the other shuttle and get us docked up. It\u0027ll be easier from over there, hands on the actual controls instead of a radio link. Shouldn\u0027t take too long.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\nMacfred and Agake helped her into her EVA suit while Thomlock nursed the reaction wheels to hold their orientation. They were almost out of this mess. Just a short walk, a quick docking, and back up to the fuel tanker they\u0027d go. Then maybe they\u0027d get to knock two more moons off of their list. Jool 4, here they come. Hopefully. Just this short walk. Nothingness below, nothingness above, two islands of life between a vast nothing. Short walk. Right.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170915_ksp0199_vall.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170915_ksp0199_vall.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSpace. It was good to be back, back out amongst the dust and micrometeorites, separated from certain death by only a thin layer of cloth. One speck of dust would tar through that layer and through her and out the other side before her brain would even register it. No, shake that away, she had a job to do here. Space. It was good to be back. It was good to have something to do again. It was good to not be bored. This was never boring. It was just a short walk. A stroll down to the corner to fetch a bus and bring it to meet another bus. \n\u003C/p\u003E\n\u003Cp\u003E\nShe pushed off of the Sulphur 5 and kicked her way into the void. Floating through the endless nothingness above an icy prison. \n\u003C/p\u003E\n\u003Cp\u003E\nShe was alone again. The last time she felt this alone was during the descent to Laythe. The Aluminum, a good craft, but if something had gone wrong.... She spent several minutes there, completely alone, on the surface, the furthest kerbal from home. Her survival was dependent entirely on the other three members of their crew. (And Jeb.) They had to land nearby and \u0022rescue\u0022 her from that surface. If they missed, she could at least fly out to meet them. Unless they had missed so badly they ended up in the ocean. \n\u003C/p\u003E\n\u003Cp\u003E\nThey could have left her, aborted the landing, gone back home or out to Vall or even Eeloo if they were so inclined. Yet of course they wouldn\u0027t. And they didn\u0027t. They weren\u0027t robots, they weren\u0027t executing some program. They were kerbals. Would one of these Sulphurs rescue the other if it was falling to a certain death? Had it? No. What if it had been programmed to....\n\u003C/p\u003E\n\u003Cp\u003E\nShe reached out and grabbed the ladder of the Sulphur 3. The sudden transfer of momentum caused the shuttle to fire its \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E jets,  a program taking over to rescue itself. She almost lost her grip thanks to that hard burst from the shuttle, but she held on. Her eyes turned towards the stars, temporarily mesmerized by the nothingness. Was she programed to hold on? Had some machine whispered that in her ear? No.\n\u003C/p\u003E\n\u003Cp\u003E\nA star in the Cloud of the First Kerbals constellation caught her eye, brighter than the others. Was that where Thomlock had gone? Was that Anzol? She couldn\u0027t remember their names, those stars. She wasn\u0027t even sure they had names, and if they did who was to say they were the real names? The correct names? What was real anymore?\n\u003C/p\u003E\n\u003Cp\u003E\nThe emptiness, that\u0027s what was real. Out here every kerbal is alone. So very alone. Work together or risk slipping into the void, never to be found again. Or be stranded on the surface of some distant moon, or distant planet. The others? The other three? They were entirely dependent on her now. Their shuttle was empty, dry, only two of their EVA packs had fuel. If she left, if she took this shuttle and ran, they would never be able to leave. Trapped here, three frozen kerbals, drifting above a cursed and frozen moon. Would someone, some... thing, program such malice into a kerbal? \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220170915_ksp0205_vall.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022570\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20170915_ksp0205_vall.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNo, of course she couldn\u0027t leave, that was just the darkness talking. And she didn\u0027t. She was needed; they were needed; all kerbals were needed. Maybe not today, maybe not tomorrow, but at some point they would all be needed for something. She opened the hatch, climbed inside, and took control of the shuttle. She turned off the shuttle\u0027s flight computer and set about checking its systems. No more programs, no more robots, and no more hypothetical disasters. It was dangerous enough being out here without imagining more pain on themselves. It felt good to be free of the boredom of Vall\u0027s endless ice. She moved towards her friends, off to rescue their stranded little spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\nSpace. It really was good to be back.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\nNavigation: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126972-forgotten-space-program/\u0026amp;do=findComment\u0026amp;comment=3234809\u0022 rel=\u0022\u0022\u003ENext Post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-04T07:10:37Z\u0022 title=\u002212/04/2017 07:10  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 4, 2017\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2017-11-29T06:39:46Z","Content":"\n\u003Cp\u003E\n\u0022Get out and push!\u0022  Yay!  That\u0027s one of my all-time favorite things to do in KSP.  Glad you were able to work it into this story \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2017-11-29T13:18:09Z","Content":"\n\u003Cp\u003E\nExcellent as always!\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2017-11-29T17:04:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223230637\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511937586\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022Get out and push!\u0022  Yay!  That\u0027s one of my all-time favorite things to do in KSP.  Glad you were able to work it into this story \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSometimes it’s the only option. Don’t know how many times I’ve done it in the past. Just part of what makes KSP KSP.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223230760\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221511961489\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExcellent as always!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Pretorian28715","CreatedById":175947,"CreatedDateTime":"2017-11-29T20:51:05Z","Content":"\n\u003Cp\u003E\nMost definitely worth the wait.\n\u003C/p\u003E\n\u003Cp\u003E\nAs always...\n\u003C/p\u003E\n\u003Cp\u003E\nThought that might be an episode of spacemadness  [pun intended]\n\u003C/p\u003E\n\u003Cp\u003E\nBut it was a-void-ed\n\u003C/p\u003E\n"},{"CreatedByName":"obney kerman","CreatedById":171373,"CreatedDateTime":"2017-11-30T00:02:01Z","Content":"\n\u003Cp\u003E\n\u0022Get out and push\u0022. A time-honored spaceflight method when fuel has run low.\n\u003C/p\u003E\n"}]}