{"TopicId":128315,"ForumId":51,"TopicTitle":"Kerbin water Elcano Challenge (completed!)","CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2015-12-21T03:30:04Z","PageNum":1,"Articles":[{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2015-12-21T03:30:04Z","Content":"\n\u003Cp\u003E\nSince I have already done a Minmus circumnavigation (shameless plug \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/123486-minmus-circumnavigation/\u0022 rel=\u0022\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/topic/123486-minmus-circumnavigation/\u003C/a\u003E ) and I was bored after I finished my space station I decided to do a Kerbin Water circumnavigation. The boat is 321 parts and has drills for refueling. The boat has a top speed of 34 M/s and can go at 4x speed warp without slowing down or breaking. The boat basically drives itself!  The boat is called the Edmund Fitzgerald, I anticipate something horrible hence the name.  A map will be at the bottom of the post.    Craft File! \u003Ca href=\u0022http://kerbalx.com/Dfthu/Edmund-Fitzgerald\u0022 rel=\u0022external nofollow\u0022\u003Ecraft file here\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003ETESTING AND PROTOTYPES\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe boat had three prototypes. The first prototype had a mining rover. It worked well getting out but while getting in the solar panels broke.  second prototype had mining stuff inside farings and big engines. When it got in water it tipped over. Last prototype put the engines lower and added pontoons. After that I did a complete redesign of the boat using \u003Cspan style=\u0022font-size:20px;\u0022\u003E7!  \u003C/span\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003Ewheelsy engines. Added 4 sets of pontoons for extra stability. I also added this really cool \u0022flag\u0022 on the back. Now for pics! \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe frameborder=\u00220\u0022 height=\u0022550\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003ELEG ONE\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWell since this boat basically drives itself and I mostly had nothing to do except move fuel.. You see when the Edmund Fitzgerald is fully loaded with fuel the engines are halfway in the water. That landing engine effect thing happens and the lags me a lot so I move fuel to the front. I will partially refuel tomorrow. Pics as usual..\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe frameborder=\u00220\u0022 height=\u0022550\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003ELEG TWO\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI made land today. I tested the land driving and mining and it worked. Its kind of hard to turn on land but its ok. I didn\u0027t have that much time today but ill do more soon. Pics now.!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe frameborder=\u00220\u0022 height=\u0022550\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003ELEG THREE\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKept on moving Northeast and cam to a little island to mine. The island had like 3 little lakes and drove though those. After that I left and kept on moving.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe frameborder=\u00220\u0022 height=\u0022550\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003ELEG FOUR\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis leg was a long one. I also crossed the only land part  Its kind of hard to drive on land. If I stopped on a hill and tried to go forward I wet backwards. Top speed is about 50 M/S on land and on hills about 30 M/s. I kept the fuel low because I thought it would help. But besides that the land bridge was pretty uneventful. When I left the land bridge I refueled. After that I move down towards the equator. Turns out the Edmund Fitzgerald does bad on low fuel. If I time ward on low fuel it bob up in down in the water and turns plus it sows down to like 2 M/s. I had to fiddle with the fuel to get it to work. So when that started to happen I made a beeline towards the nearest land. So I made it to a island and refueled. When I passed by a island I refueled again. Than I saw another island and refueled again. I kept on going down past the equator and then stopped. I\u0027m also more that halfway done!!!. I also have tons of pics\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe frameborder=\u00220\u0022 height=\u0022550\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003ELEG FIVE\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGetting close now. This leg was pretty normal. I ran over a flag but I reloaded and fixed it. I refueled twice because the boat handles bad when I get low. I probably have two more stops before im done. I also probably be done by leg six or seven. So that\u0027s good\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe frameborder=\u00220\u0022 height=\u0022550\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003ELEG SIX \u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m done with this challenge now! Once again this leg was pretty normal. After Jeb left Bill planted  a  flag at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and left a plaque. Jeb then posed with it and read plaque. Then I did a plane fly-by and a fireworks launch! pics!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe frameborder=\u00220\u0022 height=\u0022550\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003EMAP OF ROUTE\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nRed is stopping points and purple is mining spots.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aAJPS2g.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/aAJPS2g.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-22T18:51:26Z\u0022 title=\u002211/22/2018 06:51  PM\u0022 data-short=\u00225 yr\u0022\u003ENovember 22, 2018\u003C/time\u003E by Dfthu\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-12-21T15:36:16Z","Content":"\n\u003Cp\u003E\nThat\u0027s quite a beast!  Good luck with your mission.\n\u003C/p\u003E\n\u003Cp\u003E\nWhere do you plan to make the unavoidable land crossing?  The shortest crossing point is far to the NE of your current position, up at the narrowerst neck of the eastern continent.  The good part about this place is that it\u0027s got a 70km-long lake in the middle.  The bad part is, the ground is rather bumpy and there\u0027s a pretty steep hill to come down at the eastern end to reach the vast inland sea.  I haven\u0027t tried crossing that neck nearly ahead of you, but that\u0027s all dirt.  And your boat might have trouble long trips on bumpy ground.\n\u003C/p\u003E\n"},{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2015-12-26T21:04:43Z","Content":"\n\u003Cp\u003E\nSorry for the lack of updates, had holidays and stuff. Logs should come everyday now.\n\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-12-27T18:50:40Z","Content":"\n\u003Cp\u003E\nThat\u0027s about the same test route I took. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Good luck!\n\u003C/p\u003E\n"},{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2016-01-01T21:32:14Z","Content":"\n\u003Cp\u003E\nOnce again sorry for updates so I made a \u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EMEGA UPDATE!!!  \u003C/span\u003E\u003C/strong\u003EI also made it halfway there!!!\n\u003C/p\u003E\n"},{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2016-01-05T02:06:15Z","Content":"\n\u003Cp\u003E\nI have now finished this challenge. I hope you guys liked it.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-01-06T15:54:19Z","Content":"\n\u003Cp\u003E\nBravo!  Welcome to the club :).  I did the same route but went in the opposite direction, going west from KSC.  Now get you the Kerbin patch with the boat propellers on it.\n\u003C/p\u003E\n"}]}