{"TopicId":130210,"ForumId":51,"TopicTitle":"THE BARTDON PAPERS - \u0026quot;Cancel all previous directives.\u0026quot;","CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-18T17:50:22Z","PageNum":1,"Articles":[{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-18T17:50:22Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022jW4G31Q.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/jW4G31Q.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003EThis is the story of the Kerbals of Earth, the third planet from the star Sol. Some time in the recent geological past, an unknown disaster brought devastation and extinction on a global scale. Once a paradise of forests and oceans teeming with life, Earth is now a blasted wasteland where small communities of these tenacious little green creatures struggle for survival, striving to rise from their subterranean origins and conquer the surface of their world, and its heavens.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003EA handful of powerful companies rule over the Kerbal communities and control access to the world\u0027s dwindling supply of resources. These companies have agreed to sponsor a small team of visionary engineers and scientists who believe that the future of their species – and an explanation as to their origins – may lie in space. Together, they found the Omelek Space Centre on a small island in the middle of the Pacific Ocean.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003EThis is the story of Camwise, a resourceful space engineer who proves to have an uncanny ability to survive and get his crew home, even when the odds are stacked against him. It is also the story of Bartdon, a truculent senior investigator trying to hold the space programme together despite facing pressure from without and treachery from within.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003EThis is the story of the Kerbals of planet Earth and their attempts to reach out into the Solar System. Reach out they will indeed, and find more than they bargained for.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe Camwise Logs is also a KSP Real Solar System / Realism Overhaul play-through in career mode. Certain part mods are used, and occasionally part configuration files are adjusted, but these will always reflect plausible – if not yet feasible – near future technologies. Hyperedit is occasionally used for the purpose of setting certain scenes (or repairing bugs and glitches), but all space missions are launched and flown legitimately, under full manual control of the author (ie: no mechjeb). All vehicles perform according to the specifications described in the story.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cbr\u003E\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/130210-the-camwise-logs-perhaps-this-is-not-over-yet/\u0022 rel=\u0022\u0022\u003EPART ONE: THE MOON VS. ME\u003C/a\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cstrong\u003E\u003Cem\u003EThe Moon vs. Me full part \u003Ca href=\u0022https://www.dropbox.com/s/cqdt4b2e61rjovd/The%20Moon%20vs.%20Me.pdf?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/130210-the-camwise-logs-perhaps-this-is-not-over-yet/\u0026amp;do=findComment\u0026amp;comment=2455611\u0022 rel=\u0022\u0022\u003EPART TWO: THE VIEW FROM PHOBOS\u003C/a\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cem\u003EThe View From Phobos full part \u003Ca href=\u0022https://www.dropbox.com/s/wo1pbqdxp1s5fh7/The%20View%20From%20Phobos.pdf?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/130210-the-camwise-logs-perhaps-this-is-not-over-yet/\u0026amp;do=findComment\u0026amp;comment=2601286\u0022 rel=\u0022\u0022\u003EPART THREE: LUNACY\u003C/a\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cem\u003ELunacy full part \u003Ca href=\u0022https://www.dropbox.com/s/jb9fqt4ys3idv6a/Lunacy.pdf?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/130210-the-camwise-logs-perhaps-this-is-not-over-yet/\u0026amp;do=findComment\u0026amp;comment=2724925\u0022 rel=\u0022\u0022\u003EPART FOUR: TOO BIG TO FAIL\u003C/a\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/130210-the-camwise-logs-part-five-lenfant-sauvage/\u0026amp;do=findComment\u0026amp;comment=2976697\u0022 rel=\u0022\u0022\u003EPART FIVE: L\u0027ENFANT SAUVAGE\u003C/a\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EPART ONE: THE MOON VS. ME\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u0022If we knew what it was we were doing, it would not be called research, would it?\u0022\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:right;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAlbert Einstein.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYEAR 6 DAY 45\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ENow, then. My name is Camwise and I am, until the circumstances change, stuck on the Moon.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022oXuDoJD.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/oXuDoJD.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYes, Luna, the Moon, the natural satellite of planet Earth; not the Mun, or whatever they call it in that computer game played by some of the kids back home who dream about becoming astronauts. What was it called again...?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAnyway, back to the problem at hand. I was sent to Luna as the engineer of the first two-kerbal crew to set up and occupy what shall be the first long-term Moon base. That is, if we manage to build the damned thing before we starve to death.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYes, as you can see if you examined the telemetry, our lander toppled. Before embarking, I had naturally expressed my concerns to the designer of the aforementioned vehicle, Karanda. She happens to be brilliant at aerodynamics, and made some invaluable contributions to the spaceplane programme, but this lander is certainly not one of her better efforts. She fails to grasp some of the fundamentals of flying where there is no air. To say it is top-heavy would be putting things mildly, but even I had not foreseen that the landing legs would impede the thrust of the radial engines that were supposed to ensure our soft touchdown at Drygalski crater.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYou would have thought she would have run the necessary simulations... It\u0027s not as if having engines that actually slow down a Lunar lander are mission critical, right?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAs it was, my pilot Catbeth had been faced with two choices: extend the gear and make a new crater on the lunar surface for the next team of engineers to drill into, or attempt to touchdown by canceling our velocity just above the surface and extending the gear at the last moment. Fortunately she had chosen the latter, but despite her best attempt at sticking the landing, the lander had tipped anyway.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022U1P6ma0.png\u0022 src=\u0022http://i.imgur.com/U1P6ma0.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EOK, fine. The good news is that we are still alive, and I can live with sleeping on the walls of our capsule for the foreseeable future. At least we have a ton of supplies for our long-term stay on the Lunar surface while we wait for the Island Space Port to come up with an idea for getting us off this rock, don\u0027t we?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EWell, not quite.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThe majority of the ton of supplies in question (2.4 metric tonnes actually, as well as the capsule that is our ride home, two spacious habs, a service module with large solar panels and a rover), is still circling the Moon in a low polar orbit. Some of the modules are as little as thirty kilometers above our heads. I\u0027m pretty sure that if I go outside and squint at the sky for long enough, I will catch a glimpse of the sunlight glinting off metal as our salvation skims silently over the grey and dusty landscape at one-point-six kilometers per second.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022nSd2m33.png\u0022 src=\u0022http://i.imgur.com/nSd2m33.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ENow, of course we weren\u0027t sent here to helplessly watch our gear fly past, so let me explain. We will have a lot of work to do once the first modules touch down. But they will only touch down if the water drilling rig continues to extract H2O at the planned rate. If the electrolysis units and cryocoolers that are supposed to turn the water into liquid hydrogen and oxygen work properly. If the cryogenic fuel doesn\u0027t boil off faster than we can produce it. If the shuttle we intend to refuel and fly to pluck the modules from orbit performs to spec, just like Karanda\u0027s brilliant single stage lander was supposed to. That\u0027s a lot of “if”s, I know. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EBut meanwhile, while the tank of this huge machine I\u0027m operating slowly fills up with water extracted from the lunar regolith, I have nothing better to do than tell you about the series of events that brought us here.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022line-height:100%;margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022line-height:100%;margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-28T22:26:44Z\u0022 title=\u002202/28/2019 10:26  PM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 28, 2019\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nahim","CreatedById":78568,"CreatedDateTime":"2016-01-18T17:57:16Z","Content":"\n\u003Cp\u003E\nSo... it\u0027s an alternative universe where kerbals are from... Earth?\u003Cbr\u003E\u003Cbr\u003E\nInteresting!\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-18T18:42:17Z","Content":"\n\u003Cp\u003E\nYes, although the point of this story will not be to explain how or why. Just accept that Kerbals are the dominant race on Earth now. Thanks for reading, more very soon. \n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-18T21:19:41Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EWhere to start? Perhaps with the first Moonshots that enabled my kind to walk on the lunar surface for the first time. Four years ago, after a detailed examination of the Earth\u0027s natural satellite by orbiting probes, the first ship touched down. We launched both the lander and the returning capsule separately, as our kerosene and hypergolic fueled rockets just didn\u0027t quite cut it back then. After rendez-vous and crew transfer just above the Moon\u0027s surface, \u003Cem\u003ECirq\u003C/em\u003E One descended to a safe landing on the \u003Cem\u003EMare Tranquilitatis\u003C/em\u003E.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022bUMzxsb.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/bUMzxsb.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EOur visionary - albeit crazy - head scientist Angun planted a flag, collected some rocks and vowed that other Kerbals would return some day in peace to plant more flags and, maybe, stay a little bit longer. So far, the first part of Angun\u0027s prophecy has been fulfilled, at least.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cem\u003ECirq\u003C/em\u003E Two touched down inside a crater bordering the \u003Cem\u003EMare Fecunditatis\u003C/em\u003E a couple of months later close to something big detected by the scrutiny of our orbiting satellites. This feat simultaneously demonstrated our ability to make a precision landing close to a given target on a distant body, and stunned the mission\u0027s commander Margaret by the majestic sight of an inexplicably huge rock arch that soared into the vacuum above the Moon\u0027s surface.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022P12eufx.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/P12eufx.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI can only imagine her thoughts as their ascent stage blasted space-wards a few hours later, and the arch slid away into the distance behind the capsule. She\u0027d seen what was up there but she knew the figures: putting two crewed capsules on the Moon\u0027s surface had cost something in the region of 1.5 million credits. Shooting disposable tin cans at Luna with single-use rockets to spend only hours on the surface was just too expensive. The truth was out there, but we just didn\u0027t have enough money to go and study it. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ESo we did the other things. Lighter, cheaper rockets sent orbiting probes to Mercury and to Mars. The first pioneering probe missions were launched to the outer planets of Jupiter and Saturn.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThere was also a rather more expensive but embarrassingly unsuccessful attempt by my esteemed fellow engineer Froemone to extract water to convert into rocket fuel from Near Earth Asteroids. It\u0027s a long story, so I\u0027ll tell you more about that some other time. It is... entertaining. Suffice to say that the figures just didn\u0027t add up with the technology available to us at the time, and Froemone\u0027s grand design failed to deliver a single drop of H2O to LEO.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EBut we suspected that there was water on the Moon too. Spectrometry from orbit suggested so, at least. But we had to go back and get an idea of how much, and exactly where it was. So we sent in the rovers.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EIndeed, although this is my first trip to the lunar surface in person, I have already spent far too long making many kilometers of tracks in the dust with our small \u003Cem\u003EType G\u003C/em\u003E vehicles. They’re really cute; basically a few grams of Plutonium on wheels. We designed them to be small enough to fit in a lander that could be boosted to the Moon for less than the 15 tonne payload limit of our SSTO. The first attempts fell short and a couple of them pancaked into the surface, but we eventually met the required delta-V and two successive teams spent many days operating them remotely from a tiny station in a polar orbit high above the surface.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThat’s right; we flew nearly half a million kilometers just to play Truck Simulator inside a capsule floating in space. But this allowed us to work around the one-second signal delay we would have to deal with if we’d controlled the rovers from Earth. Have you ever played Truck Simulator after drinking a six-pack of beer? That’s what it’s like to drive a rover that is one light-second from where you are sitting.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022QEboEly.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/QEboEly.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EA total of five \u003Cem\u003EType G\u003C/em\u003E vehicles survived touchdown and roved the surface. Another arch was confirmed on the farside highlands, but the three most important missions were to the South Pole where the highest concentrations of hydrogen had been detected. \u003Cem\u003EType G-Four\u003C/em\u003E overshot its primary target at Shackleton and touched down messily on a steep slope inside Shoemaker. After extracting itself from its toppled lander, \u003Cem\u003EG- Four\u003C/em\u003E attempted to reach the lunar pole but was quickly thwarted by the extreme terrain that seems to dominate in the higher latitudes. Its laser and chemcam confirmed the presence of hydrates in the regolith, but the landscape was so chaotic that regular landings and surface operations there would be dangerous to the point of insanity, even by our optimistic standards.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022oYHOyps.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/oYHOyps.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cem\u003EG-Five\u003C/em\u003E landed and discovered similar jagged terrain at the foot of Malapert Mountain and it didn’t become much friendlier even after a fifty kilometer drive away from the pole. The hydrogen concentrations in the regolith also started to drop, which would mean it would be harder to extract a useful quantity of fuel. I began to think that a viable project for using lunar water was beyond our grasp.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThen \u003Cem\u003EG-Six\u003C/em\u003E trundled into Drygalski, a few hundred kilometers from the pole, its sensors sniffing for the tell-tale whiff of hydrogen that betrayed the presence of water in the lunar soil. The scent grew stronger as it approached the centre of the crater. I remember the first read-out after driving \u003Cem\u003EG-Six \u003C/em\u003Ecautiously down a steep slope into a reasonably flat area sheltered by the u-shaped rise of the central peak. The sine qua non condition for Froemone\u0027s mining scheme to work was the magic figure of two percent of hydrate present in the regolith. I spoke with him over the comms link with a one second delay.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“One-point-nine-eight percent, is that good enough for you, Froe?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Nearly.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Well, it\u0027s all you\u0027re gonna get, deal with it.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E…\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAnd so, before the \u003Cem\u003EFaure\u003C/em\u003E capsule that brought Catbeth and I back from our lunar orbital excursion had even splashed down, plans for our first long-term stay on the Moon were already being made. We had proven that the inappropriately named Drygalski crater was, in fact, the wettest place north of 80°S. If we could refill the tanks of a surface-based shuttle with hydrolox, we could deliver reasonably-sized payloads to the surface whilst cutting our launch costs dramatically. From Drygalski, we should then be able to rove, hop or crawl to any destination we might desire; to other craters, to epic rock arches built by space aliens, or even to a Burger King if anyone is enterprising enough to open one on the Moon\u0027s southern hemisphere.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ESounds simple, right? I\u0027ll take the rover, please. My guilty secret is that I don\u0027t really like flying, and “hopping” is merely a euphemism for doing just that. I guess its supposed to make hurtling through the vacuum above a harsh alien landscape at unreasonable speeds (with your existence hanging on the ability of your ship\u0027s engines to restart for the nth time) sound just a little bit less terrifying. Well, that doesn\u0027t work for me. As for crawling, well, only after a few. Unfortunately the nearest drink is a light-second away right now, unless you count the theoretically-not-but-just-maybe-a-little-bit radioactive lunar water I\u0027ve been drinking for the past three days.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EBut I digress. The first mission-critical payload to be delivered to Drygalski was the \u003Cem\u003EPadirac\u003C/em\u003E Mobile Mining Vehicle. This lunar monster truck was the largest ground vehicle ever to emerge from the Horizontal Assembly Building. It was also the first vehicle we ever built to be fitted with a nuclear fission reactor. This would have been trivial, were it not for the fact that it was to be launched into space on the largest rocket we had ever built, and then soft-landed at a precise location on the Moon\u0027s surface.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022e4gSKvb.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/e4gSKvb.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI remember staring at the blueprints at the mission preview briefing, then staring at Froemone who was the father of this monstrosity, then staring back at the blueprints and wondering how the hell it would even fit inside a fairing. Those wheels, man... And how would we actually put it down inside Drygalski without creating a bigger crater than the one we were supposed to be landing in? Froe was ever the optimist: “We build a sky-crane”.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EFortunately the cash had been flowing in as a result of our highly successful probe exploration of Mars, the highlight of which had been the first landing on a satellite of another planet, in this case Phobos. The fact that we had inexplicably lost contact with the probe a few hours after touch down had mainly been glossed over. Here Be Krakens, no doubt.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ESo, many thousands of credits were thrown at the problem of developing a sky-crane that could be attached to the top of a twenty tonne rover, provide more than two klicks of delta-v to get it down safely, and still fit inside of the payload fairing. Nothing worked. It was Jonnie, our chief test pilot, of all people, who provided the solution. Looking at the design he simply wondered why we didn\u0027t push it to space with a large rocket, then detach said rocket from the rover\u0027s tail and park it back on top to drop the whole package onto the Moon. A single stage would provide Trans Lunar Injection, capture to orbit and powered descent. Elegantly simple. With that settled all that remained was for someone to design a sky-crane with 6.5 km/s of delta-V. Volunteers, anyone?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EIn the end I strapped a couple of boosters to a large central tank and called it a day. Thinking about it now, any number of things could have gone wrong. If the docking node on top of the rover had been slightly off the vehicle\u0027s centre of mass, it would have been uncontrollable. The engine\u0027s exhaust could have melted the lightweight cargo bay housing the nuclear reactor. And don\u0027t get me started about what could have happened to the light, fragile radiators that are our only protection against the first nuclear meltdown in space.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAgainst all odds, the launch went well and we avoided turning the Pacific Ocean into a nuclear waste dump. TLI and re-docking were performed without a hitch. A tense moment was when we lost connection with \u003Cem\u003EPadirac\u003C/em\u003E as she looped round the farside. The insertion burn would be performed entirely by the on board flight computer, and I half expected us to discover that we had shot half a million credits worth of nukes and mining equipment into solar orbit. Wouldn\u0027t it be ironic if orbital mechanics shot it back at us at a later date?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022kiflelc.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/kiflelc.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EBut we were pleased to learn that \u003Cem\u003EPadirac\u003C/em\u003E had successfully made it into a low polar orbit and was ready to be guided down to the surface by Mitzon and Macfrey who were eagerly awaiting their turn to play Nuclear Space Truck Simulator from the relative safety of our tiny station above the poles. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cem\u003EPadirac\u003C/em\u003E touched down gently on a late December afternoon a mere nine kilometers from the target and was driven the rest of the way towards Drygalski\u0027s peak where little \u003Cem\u003EG-Six\u003C/em\u003E awaited on the planned site of our future outpost. In what is surely the cutest moment in the history of robotic planetary exploration, the mighty uranium-powered miner and the tiny plutonium-powered scout took selfies together and exchanged high-fives before getting back to business. \u003Cem\u003EG-Six\u003C/em\u003E was to locate a second flat area nearby that would serve as our landing ground when the shuttle was delivered (I guess the 2.3 km buffer between the landing ground and the base Mitzon had deemed necessary was to avoid the inevitable crash landings taking out the rest of the outpost), and \u003Cem\u003EPadirac\u003C/em\u003E was to get to work extracting water.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022nyPmzqK.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/nyPmzqK.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThis time Froemone had nailed it. The regolith of Drygalski crater gave up its sweet water to the assaults of \u003Cem\u003EPadirac\u003C/em\u003E\u0027s four drills, and the two large water tanks totaling 25 cubic meters were filled in just under four days. The first key to conquering the Moon was in our possession. All that was left to do was to send up our reusable shuttle and then a crew to connect the fuel pipes to it. That\u0027s where Cat and I came in. Now, anyone for Burger King?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-11T00:21:18Z\u0022 title=\u002202/11/2016 12:21  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 11, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-27T11:09:58Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYEAR 6, DAY 47\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI have spent the best part of the last four days in the cab of the \u003Cem\u003EPadirac\u003C/em\u003E mining vehicle, watching over the drills, over the level of water in her tanks and most of all, watching over her nuclear reactor. The fact that I\u0027m sitting here, constantly and painfully aware of the several kilograms of enriched uranium just a few meters behind my back, is just the first of many irregular procedures and breaches of protocol that Cat and I will perform in the days to come.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYou see, \u003Cem\u003EPadirac\u003C/em\u003E is not meant to be crewed during regular operations. The regular procedure is as follows:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EEngineer (that\u0027s me) drives \u003Cem\u003EPadirac\u003C/em\u003E to suitable area for drilling operations.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EEngineer parks \u003Cem\u003EPadirac\u003C/em\u003E and exits vehicle. Upon Engineer reaching a safe distance, the 4MW uranium fission reactor powers up and drilling procedure commences. Reactor parameters are monitored from a safe distance via a remote command station, initially from orbital station Gamma, then directly from Drygalski Base once the base has been established. \u003C/span\u003E\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EWhen water tanks are full, the fission reactor powers down, allowing Engineer to approach safely and move the vehicle to an appropriate position to connect the fuel line to the Lunar Shuttle.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EEngineer connects the fuels line and again decamps to a safe distance, allowing the reactor to power up again and \u003Cem\u003EPadirac\u003C/em\u003E to perform the electrolysis and cryocooling processes that will convert the lunar water into liquid hydrogen and oxygen. Reactor parameters are monitored from a safe distance via a remote command station, initially from orbital station Gamma, then directly from Drygalski Base once the base has been established. \u003C/span\u003E\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EReactor powers down, allowing the Engineer to approach safely, disconnect the fuel line, and move the vehicle back to its drilling station.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ERepeat.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ENow, this is all very well thought out by my esteemed colleague Froemone, but this rather weighty procedure doesn\u0027t take into account the fact that the clock is ticking, the Moon is slowly rotating, and the hardware that will ensure our prolonged and happy existence on the Moon\u0027s surface is still orbiting above us. If the shuttle\u0027s fuel tanks are not full by the time that Drygalski crater rotates into alignment with the orbits of the aforementioned hardware, then Cat does not get to fly the shuttle to rendez-vous with it and bring it back down, and we both starve to death.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ESo you will excuse me if I spend every moment I can manage to stay awake sitting in the rover\u0027s cab, watching over the drills and the nuclear reactor, making sure nothing goes wrong.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022hnHkogP.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/hnHkogP.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ENaturally I have taken every precaution possible. I made sure that \u003Cem\u003EPadirac\u003C/em\u003E\u0027s forward tank fills up first, putting more than ten cubic meters of water between the reactor and myself. Once this was done, I even slept in the cab, although my sleep was fitful and I awoke in a cold sweat, with recollections of dreams involving extra limbs and a second head. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThis morning – not that morning has quite the same meaning at the Moon\u0027s South Pole – I was drawn from my atomic nightmares by a call from my boss, Angun.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Camwise, did you collect those samples?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Angun, everything is fine thank you very much for asking, and you? They\u0027re not treating you too badly back at home...?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EMy back was killing me and I was grouchy from lack of rest. The cupola module that had been used as the rover\u0027s cab was designed for good forward and downward vision, not for a good night\u0027s sleep.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Once you\u0027re set up at Drygalski, take the exploration rover to investigate the Bailly crater anomaly,” he continued.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Yeah, I\u0027m so looking forward to that.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Cam, this is important. The season will soon be over. There will be no other missions to the Moon until the end of the year. We need new material to ensure that the funding of the project continues.” \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI had to admit that he was right. The season Angun was referring to was the lunar south polar summer(1), which basically corresponds to winter in the northern hemisphere back on Earth. We had started launching modules for Drygalski Base at the start of the season, and it was now well past mid-summer. The days were already getting shorter, and operations here would depend on us getting a decent amount of sunlight, partly because the base relied on having at least some solar power to replenish our fuel cells as a back-up, and partly because we didn\u0027t want to drive our nuclear-powered rover into a lunar ravine because we couldn\u0027t see where we were going. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAnd he was also right about us needing “new material.” We had made little progress with regards to understanding or even just observing the lunar anomalies since the first landings four years ago. Eventually, our sponsors would grow impatient. A lot of cash had been invested in Drygalski. If the annual report read “we now have the infrastructure in place that may possibly allow further observations next year, if our engineers can design a lander that doesn\u0027t fall over”, they wouldn\u0027t be too pleased.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Any chance of a launch with some supplies for us, or another lander?” I tried.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Not unless you have thirty days to spare while we build a rocket, which I believe you don\u0027t. And of course, we would have to cancel the Mars launch window this year.” (which, coming from Angun, you can translate as “no.”) \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“What about the SSTO? You could send up a small probe with supplies...”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Stormy season at Kourou. Can\u0027t do.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“OK, that\u0027s settled then. We\u0027re going to test the shuttle today,” I told him.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Good. Wish Cat good luck.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYou bet she needs it. The shuttle is my design.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThe \u003Cem\u003ELentillac\u003C/em\u003E shuttle was my solution to the requirement for a reusable vehicle capable of delivering six tonne payloads to the lunar surface from a low parking orbit. Well, maybe six tonnes. I didn\u0027t really know exactly to be honest. When you have to include additional mass for the return trip, the delta-v calculations become more complicated and I ran out of napkins. I was pretty confident it could do the job, but we were literally in unchartered territory here. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAngun mercifully decided to stop pestering me for samples of the crater\u0027s soil and signed off. As far as I was concerned, the regolith of Drygalski crater was in no need of any further sampling. It contained enough water to fill up the tanks of my ship and, from my point of view as an engineer on starvation rations, it was therefore perfect in every way. I retracted the drills, and drove \u003Cem\u003EPadirac\u003C/em\u003E back to our toppled lander to pick up Catbeth.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022Ej8ayMu.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Ej8ayMu.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EShe\u0027s a cool one, that Cat. If she felt any apprehension about the fact that she was about to make history by being the first person to bounce around Luna in an almost entirely untested vehicle, she didn\u0027t show it. That\u0027s what I like about her. She gets the job done, and doesn\u0027t make a fuss.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThis would also be our second deviation from the original plan. The initial flight of \u003Cem\u003ELentillac\u003C/em\u003E was supposed to have been un-crewed, with take-off and landing remotely controlled by Macfrey from orbiting station Gamma. If the shuttle performed well, Cat would hop on board the next flight and take over from there. If the shuttle crashed or misbehaved in any way, we would have boarded our lander and returned to Earth until a better shuttle could be designed, but this of course was no longer an option. \u003Cem\u003ELentillac\u003C/em\u003E would perform to spec, or we would die here. And so Cat had decided to make the maiden trip, just to make damned sure my masterpiece would do what I said it would do. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Chill out Cam,” she said as she grabbed onto the ladder and climbed up on top of the rover\u0027s cab. “If your shuttle is as bad as they say it is, you get to watch me crash into that peak and you won\u0027t even have to live with the guilt. Well, not for very long anyway.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u0027Told you she was cool.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EWe made the short drive over to \u003Cem\u003ELentillac\u003C/em\u003E without a hitch and I EVAd to plug in the fuel line. Catbeth climbed the ladder into the shuttle\u0027s cockpit and started powering it up, but we still had a few hours to wait as the cryocoolers chilled the liquid oxygen and hydrogen and pumped it into the shuttle\u0027s tanks. I glanced at the time on the rover\u0027s console nervously: the launch window for the first module was imminent. The command module that was to be the first element of Drygalski base would orbit above us on its next pass. We were going to be late, and with each passing orbit, it would be harder for Cat to get an intercept.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022UpbkOSF.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/UpbkOSF.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EFortunately, the Moon\u0027s rotation was slow, so a couple of hours would not make a big difference, and Cat and I had decided to go for the lightest module first. Weighing in at just over three tonnes, it didn\u0027t even contain any supplies, but I had suggested it would be cautious to start with the smallest one and work our way upwards from there. I\u0027d looked at the orbital planes of the hardware spread out in various polar orbits and calculated that, if \u003Cem\u003EPadirac\u003C/em\u003E continued to draw water at its present rate, we could just about fill up the shuttles tanks in time to grab each module as the Moon rotated lazily through her lunar day, better known in more civilized places as a month. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EUnfortunately, the one that was most critical in our present situation – the service module with several tonnes of food on board – would be the next-to-last element to line up with Drygalski. It was also the heaviest of all, and had defined the six-tonne payload requirement of the shuttle. Nearly thirty days would pass before we would know if we\u0027d get our snacks or not. Care to guess how many days food we had left? Go on, you\u0027ll never guess...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAt last \u003Cem\u003ELentillac\u003C/em\u003E was ready, and I disconnected the rover. There was no time to waste, so I climbed straight back into the cab to drive \u003Cem\u003EPadirac\u003C/em\u003E clear and continue drilling, giving just a brief flash of my vehicle\u0027s lights to salute Catbeth as she made the final preparations for take-off. I did however park the rover so that I could see the shuttle\u0027s departure through the generous viewing ports that the cab provided. I would have a front-row view of the craziness of \u003Cem\u003ELentillac\u003C/em\u003E\u0027s design in motion.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYou see, the design criteria had been extremely specific. The shuttle had to be powered by hydrolox, so the fuel tanks were naturally bulky due to the low density of the liquid hydrogen fuel. It had to land vertically, of course, and had to use the LV-909 restartable engine, mainly because the puny little thing was by far the most reliable power-plant in our inventory. It also had to be able to move around the lunar surface on wheels, as we were not yet sure we could make pin-point precision landings (in fact, we were pretty sure we couldn\u0027t). Oh, and it would have to be able to lift large, bulky payloads and be able to deposit them gently onto the Moon\u0027s surface into a vertical position (for base modules) or horizontally (for the exploration rover). So away to the drawing board with you, good luck guys and girls.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022pECa2ae.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/pECa2ae.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EMy colleagues had pored over various designs for weeks before coming to the conclusion that such a vehicle was impossible with our present technology. I had done what I usually do when I hear the word “impossible,” and relaxed some of the assumptions. My conclusion was that such a vehicle was quite possible, as long as you did away with the ability to take-off vertically. The LV-909 was fine as a descent engine, but no-one could fit it into a sky-crane shape that would allow a wide selection of payloads to be carried. Auxiliary RCS thrusters would have to be used to touch down vertically once the shuttle had expended most of its fuel, but they simply wouldn\u0027t be able to lift it at max take-off weight. So, \u003Cem\u003ELentillac\u003C/em\u003E would have to leave the lunar surface like an aircraft: except for the small detail of there being no air.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EKaranda had scoffed, Mitzon had face-palmed, and fortunately Froemone had been lost for words. Catbeth had listened, which sealed her fate as the test pilot for my brilliant idea. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI remember my Powerpoint presentation stating that since the regolith of Drygalski had proved to be compact enough to support the weight of a fifteen tonne rover carrying twenty-five tonnes of water, it should therefore provide a stable enough medium for the rolling take-off of our shuttle. I didn\u0027t convince the audience, so I was forced to deploy my trump card.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“So, do you guys have a better idea?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThis challenge was met by the most complete and embarrassed of silences. \u003Cem\u003ELentillac\u003C/em\u003E was adopted by default.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022mvhYKh1.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/mvhYKh1.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EBack to the present, and Catbeth had started the engines, turning the shuttle to face southwards towards the lunar pole, and towards the crater\u0027s central peak. She had nearly two kilometers to run up to speed, rotate and to climb out before the sheer face of the lunar surface rose to meet her, and she had a thrust-to-weight ratio that could be defined as almost anything but generous. Her voice crackled over the cab\u0027s downlink as I watched the scene unfold.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“RCS engaged, main engines to full power. Release brakes...mark.” \u003Cem\u003ELentillac\u003C/em\u003E began to move. Go.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Ten meters per second.”\u003Cem\u003E I said Go.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Twenty meters per second.” \u003Cem\u003EGo, dammit!\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Thirty, beginning rotation sequence.” \u003Cem\u003EGo Faster!!!\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;font-style:normal;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u0022TgzQqKa.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/TgzQqKa.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EOne single word springs to mind to describe \u003Cem\u003ELentillac\u003C/em\u003E\u0027s rotation sequence, and it is lumbering. I watched in terrified fascination as the shuttle lifted slowly off the ground, gaining altitude as if every single meter was sheer torture. Once the rear wheels of the craft were unstuck, Cat could pitch up further without ploughing the tail end into the surface. The auxiliary thrusters puffed and sputtered as the ship reached an almost vertical attitude and kicked up a huge dust-cloud, but she had already built up considerable horizontal speed, and this speed was carrying her straight towards the steep slope ahead.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI could only look on in horror as \u003Cem\u003ELentillac\u003C/em\u003E clawed her way upwards to emerge from the dust, suspended on two points of light from the reliable but insufficient LV-909s. She was gaining height faster now, but the slope also became steeper towards the peak\u0027s summit and \u003Cem\u003ELentillac\u003C/em\u003E was hurtling belly-first towards it.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;font-style:normal;line-height:100%;\u0022\u003E\n\u003Cimg alt=\u00223F5ma78.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/3F5ma78.png?1\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-11T00:28:06Z\u0022 title=\u002202/11/2016 12:28  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 11, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-27T11:18:20Z","Content":"\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;font-style:normal;line-height:100%;\u0022\u003E\n\u003Cspan style=\u0022font-family:arial, helvetica, sans-serif;\u0022\u003E(1) Author\u0027s Note: in the real world, Luna has almost no axial tilt (just over one degree) and therefore no seasons, hence the permanently shadowed craters and the peaks of eternal light near the poles. In the KSP Real Solar System, in order to allow the Earth to have its true 23.4 degree axial tilt and work around the limitations of PQS, the entire solar system is tilted by this amount. As a consequence, the Moon\u0027s axis is tilted by over 20 degrees in relation to the ecliptic, and thus the duration of the day/night cycle in a given location will vary as the Earth-Moon system orbits the sun.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"chicobaptista","CreatedById":155556,"CreatedDateTime":"2016-01-27T15:25:04Z","Content":"\n\u003Cp\u003E\nargh the drama!\n\u003C/p\u003E\n\u003Cp\u003E\nwill our heroine make it? will Camwise be left to ponder about making plane-like take-offs on a body without atmosphere for a couple weeks before he starves to death?\n\u003C/p\u003E\n\u003Cp\u003E\nheck of a cliffhanger, mate! looking forward for the continuation of this tale.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-27T21:49:57Z","Content":"\n\u003Cp\u003E\nCheers mate, thanks for reading.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222381926\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221453908304\u0022 data-ipsquote-userid=\u0022155556\u0022 data-ipsquote-username=\u0022chicobaptista\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, chicobaptista said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwill our heroine make it?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, don\u0027t know if it will alleviate the tension or make it worse, but here is the next screenshot from the sequence. Velocity was more than 100m/s at this point. Care to bet if she makes it over the ridge...? \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CIDPGpG.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/CIDPGpG.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou know you\u0027re cutting it fine when you\u0027re landing gear light pools into a single spot!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-27T21:52:24Z\u0022 title=\u002201/27/2016 09:52  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 27, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-02T12:19:27Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYEAR 6, DAY 47 continued.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EOver the radio I heard Cat draw in her breath sharply, swear, then came a crackle, then silence. The shuttle\u0027s landing floodlights merged into a single point of brilliant light which then blinked out. Then nothing but inky blackness above the cold, pale lunar peak.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cem\u003ELentillac\u003C/em\u003E had simply vanished from my line of sight. I couldn\u0027t tell whether she had made it over the ridge and - due to the lack of atmosphere on the Moon - the radio link had cut immediately, or whether she had hit the crest of the slope and the shattered remains of her vessel were now tumbling down the opposite face of the crater\u0027s central peak. Granted, I had seen no explosion, but in space things just don\u0027t really explode in the same way as they sometimes do on the launchpad back on Earth. The fact that there would be no fireball didn\u0027t make a one hundred metre per second impact with hard lunar rock any less deadly.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThen the longest twenty seconds of my life. I remember staring at the instrument panel in front of me, then looking down through the viewing port into the ash-grey dust of the lunar surface below. I remember feeling an intense, selfish wave of extreme loneliness and despair. And most of all feeling like such a fool for letting my pilot take off in such a pile of poorly designed trash.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThen the radio crackled once more as \u003Cem\u003ELentillac\u003C/em\u003E rose from behind the ridge that had temporarily cut off communications. The tiny twin points of light that were her engines straining valiantly against gravity twinkled into view, and I realised that Cat had made it. \u003Cem\u003ELentillac\u003C/em\u003E was steadily gaining speed and altitude, and was rising to meet the first of the modules she was to retrieve from orbit.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022UX7pS06.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/UX7pS06.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Cam...?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Ye... Yeah. Yes?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Next time we start the take-off roll with a little more run-up, okay?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“R..Right. You bet.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“You OK Cam?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“No I\u0027m not. For a moment back then, you had me convinced that I\u0027d screwed up.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Well, I\u0027m not home yet, Einstein. There\u0027s still a ton of things that could go wrong. Wait until I\u0027m back on \u003Cem\u003ELuna Firma\u003C/em\u003E before you start congratulating yourself. Out.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EWith that Catbeth concentrated on her flying, and I concentrated on my nuclear reactor. Or, rather, I brooded. \u003Cem\u003ELentillac\u003C/em\u003E\u0027s first sortie had got off to a shaky start, to say the least. And this was just the first of five flights that would be required, simply to set up the base. Cat was in for a long lunar day. And as she had predicted, her problems had only just begun.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EIn her desperate attempt to gain altitude and to avoid becoming one with the Earth\u0027s natural satellite, Cat had launched into a slightly different orbital inclination than that of Drygalski Base Command Module. A hefty correction burn further round the Moon brought \u003Cem\u003ELentillac\u003C/em\u003E back in line, but she was now playing catch-up and wouldn\u0027t reach her target for another orbit. All the while, the cryogenic fuel was steadily boiling off from the shuttle\u0027s tanks into space. It was a deadly trade-off: burn hard and waste fuel for a fast rendez-vous, or burn less but watch your fuel leak away slowly.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EDrygalski crater was still covered in the pre-dawn darkness but fifty kilometers above, Catbeth and her target were bathed in full sunlight as they drifted past above me, clearly visible through the generous view ports of the rover\u0027s cab. Two specks of light chasing each other across the frozen heavens. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cem\u003ELentillac\u003C/em\u003E finally caught up with the Command Module halfway through the next orbit. Since she was on the other side of the Moon, Cat\u0027s scathing evaluation of the situation was relayed to me via Earth with a couple of seconds of delay.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Which \u003Cem\u003Eidiot\u003C/em\u003E left the antennae out?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;font-style:normal;line-height:100%;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u002200KDtFL.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/00KDtFL.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EWithout actually seeing what was happening, it took me a moment to realize what was wrong. When I did, I cursed mother nature for not providing me with enough limbs to express my exasperation at such an epically stupid oversight on our behalf. The command module had been launched into lunar orbit with a couple of powerful omni antennae to provide a downlink to our tracking stations on Earth. These antennae had remained deployed until the batteries of the module – lacking any power generation of its own – had died. And so they remained transfixed in this position, protruding from the upper end of the module and obstructing access to the docking port that was supposed to allow \u003Cem\u003ELentillac\u003C/em\u003E to pluck it from space and stow it in her cargo bay for the journey down to the Moon\u0027s surface.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI was about to suggest that Catbeth could perform an EVA to retract the antennae manually, but then I remembered that, in order to comply with the draconian weight restrictions of such a vessel, \u003Cem\u003ELentillac\u003C/em\u003E was not equipped with an EVA fuel tank to supply Cat\u0027s KMU, and it would be impossible for her to spacewalk across to the payload to carry out the operation. We were screwed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Forget it Cat, get back down here. We\u0027ll refuel and go up for the next module.” I said. The Command Module was not critical to our survival, as it didn\u0027t actually contain the supplies we needed. It was just living space.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“But what about the command station?” she replied.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EDamn, she was right. The module contained the remote command station that would eventually allow us to operate \u003Cem\u003EPadirac\u003C/em\u003E and our other vehicles from the safety of our base. It was therefore vital for the future of Drygalski Base. Before I could think of something useful to answer, Cat said “OK, main engine off. Auxiliary thrusters on line. Let\u0027s see how tough these cargo bay doors are...”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Cat, are you sure about this?”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“No, I\u0027m not.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EFair enough. At this point, one more insanely reckless procedure wouldn\u0027t make much of a difference... Catbeth was accomplishing firsts with each passing minute. She would now become the first Kerbal to land an untested shuttle on the Moon with an unsecured payload rattling round in the cargo bay. What could possibly go wrong? \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022ZlDzzdA.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ZlDzzdA.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI did a few mental calculations and concluded that \u003Cem\u003ELentillac\u003C/em\u003E\u0027s mediocre thrust-to-weight ratio would actually play in our favour here. If Cat opened up carefully, the module might just settle to the back of the bay and stay there. If she performed the pitch-over maneuver carefully she might just get away with it, and I could look forward to gloating during debriefing about the superiority of my shuttle design over the sky-cranes my colleagues had promoted so adamantly. Ladies and Gentlekerbs, today I am proud to conclude that I was absolutely right from the start...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Try not to scratch the paint. Out.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAnother half hour passed before Catbeth performed her de-orbit burn, and another ten minutes later a distant point of light on the northern rim of the crater alerted me to the fact that \u003Cem\u003ELentillac\u003C/em\u003E was making her approach. Cat had started her descent early, to compensate for having to burn gently. Low TWR, less fuel efficient, I thought to my self, and the fuel budget was already tight. C\u0027mon Cat.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022ahU56Tr.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ahU56Tr.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAs I sat there in the cab, I realised that I was the first Kerbal to witness a landing on another world from below. It was a strange, eerie feeling, listening to Catbeth\u0027s commentary through my headset as the shuttle descended tail-first from the heavens to meet me. By now, she had killed most of her forward velocity and was almost above \u003Cem\u003EPadirac\u003C/em\u003E\u0027s mining position. I could now see the individual lights on the shuttle and make out the huge landing struts that were deployed to absorb the impact with the lunar dust. All of this in the complete, deathly silence of the vacuum.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ETwo hundred metres above the surface, an alarm went off in \u003Cem\u003ELentillac\u003C/em\u003E\u0027s cockpit. Catbeth\u0027s voice was impassive as ever.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Fuel level critical. Starting pitch-over.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThe vessel began to flip forwards, a maneuver that would bring it into a horizontal attitude for the final touchdown using only the vertical thrusters.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“One hundred metres. Main engines off.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;line-height:100%;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022z47tAHd.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/z47tAHd.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThe stream of water vapour from the thrusters were almost invisible in the vacuum, and \u003Cem\u003ELentillac\u003C/em\u003E seemed to be suspended by magic. She was coming in hot, though, as Cat fought to put her down quickly before her tanks ran dry. Dust began to surround the shuttle as she approached the surface, but \u003Cem\u003ELentillac\u003C/em\u003E was still moving backwards towards the crater\u0027s peak. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Five backwards, ten metres.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThere was an agonizing moment as \u003Cem\u003ELentillac\u003C/em\u003E disappeared completely in the cloud of dust, still floating backwards, just meters above the surface. The RCS strained to kill the remaining horizontal velocity. Another alarm sounded.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“Five m... Uh, bingo fuel.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAnd I swear I felt a tremor through the surface as \u003Cem\u003ELentillac\u003C/em\u003E settled heavily onto her main gear, almost pitching onto her tail as it dragged into the dust and caught. She hung there, nose up for a moment, before settling on all four struts. Silence. The dust began to settle. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-11T00:32:37Z\u0022 title=\u002202/11/2016 12:32  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 11, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-07T22:09:12Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:georgia, serif;\u0022\u003EYEAR 6, DAY 62. CATBETH (Personal Message to Relative).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:georgia, serif;\u0022\u003EDear Lisabeth,\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:georgia, serif;\u0022\u003EI hope your fine, sorry I haven\u0027t written sooner, but we are very busy here at Drygalski. I assume you heard about the mishap we had with our lander, and I just wanted to tell you that everything is going to be OK. I know that Camwise does most of the reports we send back and he can be such a gloomy drama queen at times, so I wanted to set the record straight.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:georgia, serif;\u0022\u003EThe stuff they put up here for us is working as planned and we will soon have all the parts we need for completing our little base here. I just have a couple more trips to run and we\u0027ll be all good. I took some pictures of Camwise trying to build stuff, some are funny. Here you go.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:georgia, serif;\u0022\u003E\u003Ca href=\u0022http://imgur.com/a/L8ieM\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/L8ieM\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:georgia, serif;\u0022\u003ETake care Sis, love ya.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:georgia, serif;\u0022\u003ECat.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-11T00:33:14Z\u0022 title=\u002202/11/2016 12:33  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 11, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Choctofliatrio2.0","CreatedById":154657,"CreatedDateTime":"2016-02-09T16:08:52Z","Content":"\n\u003Cp\u003E\nThis is a really cool series. Keep it up!\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-09T20:47:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222400796\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455034132\u0022 data-ipsquote-userid=\u0022154657\u0022 data-ipsquote-username=\u0022Choctofliatrio2.0\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Choctofliatrio2.0 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is a really cool series. Keep it up!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you sir. Don\u0027t worry,  Camwise and Co. still have many things to tell.\n\u003C/p\u003E\n\u003Cp\u003E\nAs I\u0027m sure you know, playing KSP takes a lot of time. Playing KSP RSS takes more. And writing about playing KSP RSS is right out. I will try and publish once or twice a week and your encouragement is most welcome. \n\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2016-02-09T21:58:52Z","Content":"\n\u003Cp\u003E\nThis is great!  It reminds me of The Martian.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-09T22:58:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222401234\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455055132\u0022 data-ipsquote-userid=\u0022139256\u0022 data-ipsquote-username=\u0022Mad Rocket Scientist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, Mad Rocket Scientist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is great!  It reminds me of The Martian.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/oiNgl85.png?2\u0022 class=\u0022ipsImage\u0022 alt=\u0022oiNgl85.png?2\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re getting ahead of me. Mars is exactly where I intend to send Cam, if he makes it off the Moon alive.\n\u003C/p\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2016-02-10T03:29:27Z","Content":"\n\u003Cp\u003E\nI\u0027m loving this! I\u0027d really like to see the Padirac\u0027s launch vehicle. It must have been some monster...\n\u003C/p\u003E\n"},{"CreatedByName":"Choctofliatrio2.0","CreatedById":154657,"CreatedDateTime":"2016-02-10T04:43:33Z","Content":"\n\u003Cp\u003E\nSo I have a question, since this kinda confused me. So something went wrong (Lander tipped?) And they\u0027re stuck there. Do the folks at Kerbin know this? And are they trying to get them home? Sorry if this was explained, I\u0027m not the best listener \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-10T07:59:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222401625\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455074967\u0022 data-ipsquote-userid=\u0022157358\u0022 data-ipsquote-username=\u0022MatterBeam\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, MatterBeam said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m loving this! I\u0027d really like to see the Padirac\u0027s launch vehicle. It must have been some monster...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBig (about 2000 tonnes on the pad), but nothing specially ingenious. Space Y engines and procedural tanks make this sort of thing relatively easy... and part-count friendly. I\u0027ll post an album tonight if you like.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-10T08:09:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222401676\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455079413\u0022 data-ipsquote-userid=\u0022154657\u0022 data-ipsquote-username=\u0022Choctofliatrio2.0\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Choctofliatrio2.0 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo I have a question, since this kinda confused me. So something went wrong (Lander tipped?) And they\u0027re stuck there. Do the folks at Kerbin know this? And are they trying to get them home? Sorry if this was explained, I\u0027m not the best listener \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, their lander tipped, and yes, Mission Control is quite aware of the situation. They send all their sympathy and moral support.\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E However, it will take them some time to slap together another Moon-capable rocket with a rescue mission or supplies, and the programme\u0027s rather over-zealous head scientist, Angun, will be reluctant to divert launch capacity away from the upcoming interplanetary transfer window to Mars. So for the time being, they are YOYO.\n\u003C/p\u003E\n"},{"CreatedByName":"Choctofliatrio2.0","CreatedById":154657,"CreatedDateTime":"2016-02-10T12:45:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222401786\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455091795\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, their lander tipped, and yes, Mission Control is quite aware of the situation. They send all their sympathy and moral support.\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E However, it will take them some time to slap together another Moon-capable rocket with a rescue mission or supplies, and the programme\u0027s rather over-zealous head scientist, Angun, will be reluctant to divert launch capacity away from the upcoming interplanetary transfer window to Mars. So for the time being, they are YOYO.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOkay, that makes sense \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Thanks\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-10T21:53:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222401625\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455074967\u0022 data-ipsquote-userid=\u0022157358\u0022 data-ipsquote-username=\u0022MatterBeam\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, MatterBeam said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m loving this! I\u0027d really like to see the Padirac\u0027s launch vehicle. It must have been some monster...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs per requested...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eW2C1je.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/eW2C1je.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/uUgDL\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/uUgDL\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, back at Drygalski, the Snacks have landed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/zPuDdm3.png?1\u0022 class=\u0022ipsImage\u0022 alt=\u0022zPuDdm3.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-10T22:12:49Z\u0022 title=\u002202/10/2016 10:12  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 10, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2016-02-10T22:24:53Z","Content":"\n\u003Cp\u003E\nI like the straightforward, minimal radial-staging design.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the OPT-based crafts, they look like some landed eagles with their wings folded up, or something out of the concept art for Star Wars.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-10T22:44:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222402804\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455143093\u0022 data-ipsquote-userid=\u0022157358\u0022 data-ipsquote-username=\u0022MatterBeam\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, MatterBeam said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI like the straightforward, minimal radial-staging design.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the OPT-based crafts, they look like some landed eagles with their wings folded up, or something out of the concept art for Star Wars.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, if it can be done with a single stack, I prefer it. An old habit from using stock parts. Sometimes when you stage radial boosters, the centre of lift/drag shifts and bad things can happen. It\u0027s less of a problem using a single procedural tank because your centre of mass doesn\u0027t move as much as the stage drains.\n\u003C/p\u003E\n\u003Cp\u003E\nNot OPT, but \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/91713-105-mark-iv-spaceplane-system-the-go-faster-update-minor-hotfix-030116/\u0022\u003ENertea\u0027s Mark IV Spaceplane\u003C/a\u003E mod. And I only wish my shuttle was as maneuverable as an X-Wing....\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-10T23:26:37Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYEAR 6, DAY 75. CAMWISE.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cbr\u003E\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAt last! This morning I reported back to mission control with the news the last of the modules was successfully retrieved from orbit and that Drygalski Lunar Base is complete, at least until they can launch additional junk for us to bring down to the surface. \u003Cem\u003ELentillac\u003C/em\u003E performed admirably, despite our initial concerns, and Catbeth manged to fly more efficient ascent profiles and intercepts for all subsequent modules. Even with the heavier gear, such as the six-tonne Exploration Rover \u003Cem\u003EArcambal\u003C/em\u003E, she managed to land with fuel to spare. The service module was, in fact, overweight (someone had been over zealous in estimating the amount of snacks we would consume), and my best guess puts it at nearly seven tonnes. \u003Cem\u003ELentillac\u003C/em\u003E landed it all the same.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ESo we now have several hundred days of food, an estimated four hundred million tonnes of water in the lunar regolith beneath our feet and therefore, thanks to the power of electrolysis, enough oxygen to sustain a city full of Kerbals for many millenia. My only real concern now is boredom: we don\u0027t really have anything much left to do here at Drygalski.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022KLbeEsh.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/KLbeEsh.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYou see, we were supposed to return to Earth after setting up shop here and return to Drygalski next summer with additional equipment, a science lab and vehicles allowing us to roam freely across the entire surface and truly explore the secrets of Luna. But this equipment has not yet been built and we are in no position to leave, unless I can figure something out. I must confess that I have a couple of ideas, but one of them probably won\u0027t work, and the other one is completely crazy, so it will be only called upon as a last resort.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EPrincipal Investigator Angun (I love calling him that, makes him sound like the Spanish Inquisition...) reiterated his request yesterday for us to drive the exploration rover to the anomaly on the southern border of Bailly crater, nearly 300 kilometers away. This will, at least, give us something to do while we consider possible ways out of our predicament. We are still on our own, unless you count Mitzon and Macfrey still circling patiently above the Moon in Gamma Station\u0027s high polar orbit. Not that they can do much to help us, a part from remotely controlling some of our vehicles when they rotate into line of sight. So we can only count on our own ingenuity.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ENow that it was understood that we were no longer starving to death, all the launches from Omelek Island Space Centre for the next hundred days or so would be dedicated to the upcoming Mars mission. Angun was determined to go out there with a crew, check out what had happened to our probe on Phobos, and at least land some rovers on the Martian surface that could be controlled in real-time from orbit. We had managed to talk him out of actually landing crew on Mars, due to the fact that we simply weren\u0027t ready for such a feat.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI still don\u0027t get why he is so insistent about going crewed to Mars this year, as there is still much we could learn about Mars with probes, without having to fly a two-year mission out there to do our Rover Simulator thing again. But what I do know is that his fellow scientist Margaret – who witnessed the lunar arch near the \u003Cem\u003EMare Fecundidatis\u003C/em\u003E - will follow his lead, and that they can count on Jonnie to be crazy enough to fly them there. And of course they will need an engineer to make sure our deep space ship \u003Cem\u003ECernin\u003C/em\u003E doesn\u0027t fall apart before it even gets past the Moon\u0027s orbit. That engineer is supposed to be me, but for the moment, it looks like I\u0027ll be missing the bus. Who knows, maybe this is actually a good thing, although I reckon the view of Mars from Phobos would be awesome.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI\u0027m not too sure about \u003Cem\u003ECernin\u003C/em\u003E\u0027s ability to get us there and back safely, though. We did test the ship about eight months ago, and it held out perfectly well during our first shakedown cruise that took us about a million kilometers from Earth. The hardest part of that mission was explaining to our benefactors where we were going with our new, very expensive, nuclear thermal rocket-powered toy.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EOur destination was... nowhere.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022OpA739o.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/OpA739o.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThat\u0027s the thing: getting to low Earth orbit took us a while, but it is now more or less routine and we can even afford to do it with a vehicle that has wings strapped to it for some reason. Getting to the Moon was a little tougher, but my presence here is proof of the fact that it can be done, if enough cash and good ideas are flung at the problem. But out beyond Luna lies... well, tens of millions of kilometers of nothing, punctuated only by the odd near Earth asteroid. And we didn\u0027t even manage to line up one of those with our trajectory: the damn things always seem to swing past the Earth at the most awkward of inclinations.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EBut we simply had to test our deep space ship in deep space before sending it on a two year, you\u0027re-on-your-own-and-if-something-goes-wrong-you\u0027re-also-dead trip to the outer reaches of the inner solar system. So we had to content ourselves with boosting out far enough so that the Earth was a very distant pale blue marble, then congratulate ourselves and turn for home with our nuclear thermal rocket between our legs.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI will always remember the EVA I performed to inspect the ship before the nuke was powered back up to send us back earthwards. I had floated for just a few minutes in that endless void, looking back past the ship \u003Cem\u003ECernin\u003C/em\u003E to the far away splash of colour that was our home planet, against the backdrop of nothingness. And beyond that, our star Sol, that gave us life and that could also snuff out my very existence in an instant if she was so capricious as to blast a solar flare my way. It was humbling.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022lIo1GZo.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/lIo1GZo.png?1\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ESo, apart from granting me this profound experience, the first voyage of \u003Cem\u003ECernin\u003C/em\u003E did actually prove it could sustain a crew of four for extended periods of time in deep space. The problem as always – as Froemone would agree – was fuel.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAfter Froemone had failed to deliver the huge quantities of water promised (and therefore liquid hydrogen and/or oxygen) to Earth parking orbit, we had reconsidered the fuel and the engines we should use for a hypothetical Mars mission. The liquid hydrogen fueled NTR would have been the best option, if only the fuel tanks we would need weren\u0027t the size of Coventry Cathedral, and if only this fuel didn\u0027t seep from our tanks and into the vacuum like sand through the neck of an hourglass.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003ESo we had tried liquid methane. It was heavier, but provided extra thrust with much more compact tanks. Initial tests performed on the ground were encouraging. When the fuel tank and engine were launched and docked to the ship\u0027s crew section, everything seemed fine: the fuel had stayed put. Jonnie, Bartdon, Steledith and myself were then sent up on our spaceplane, transfered to \u003Cem\u003ECernin\u003C/em\u003E and performed the escape burn. Fine. We had passed the orbit of the Moon with as much fuel as when we had ended our initial boost.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EBut then, very slowly and very subtly, the pressure in our tank had begun to rise as we we swung out into deep space. We were naturally forced to vent this natural gas boil off to avoid our tank exploding. Slowly but surely our fuel was leaking away into space, at the rate of a few litres per hour. This was not enough to leave us stranded over the one month duration of our mission, but it was enough to make a two year mission to the red planet unfeasible. We would have to find some other way to power out return from Mars, and I assume that this is what my colleagues back at the Space Centre have been working on in my absence.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022LxYoHk1.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/LxYoHk1.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAnyway, back to the task at hand. We will set out from Drygalski base in a few days, when the late summer sun comes up above the horizon and allows us to see where we are driving. After scooting around the crater in the Arcambal Exploration Rover a few times, I can say it is pretty fun to drive, and after spending too many days mining water here, I\u0027m looking forward to seeing some new landscape.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EIn the mean time, tomorrow we are going to attempt to right our lander with the first idea I came up with.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EYEAR 6, DAY 76. CAMWISE.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EThe \u003Cem\u003ELentillac\u003C/em\u003E shuttle has some pretty tall landing struts. It also has a winch. If we can maneuver it into position above our lander, then maybe we can attach a socket to the top of the lander and use the winch to hoist the lander back onto its butt, right?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EWell, not quite.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAfter I\u0027d pumped a small amount of fuel back into the shuttle\u0027s tanks, Cat used its main engines to trundle along across the crater on its wheels to where our lander laid flopped pathetically on its side in the dust. She then activated the auxiliary engines to lift \u003Cem\u003ELentillac\u003C/em\u003E into the air and moved slowly forwards until she was directly above the lander, before putting it down gently on the shuttle\u0027s landing legs.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022OQxRvxw.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/OQxRvxw.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EI\u0027d followed the shuttle in the rover, parking it at a safe distance, and suited up to inspect the lander. Unfortunately, I couldn\u0027t drill through the top of the fuel tank bulkhead or I would have been greeted by a spray of highly toxic and corrosive hypergolic fuel, and that would have instantly ruined our plans to return to Earth any time in the immediate future. However, there was a spot just to the side of the top end of the tank where I knew I could attach the socket without compromising the hull\u0027s integrity. I grabbed my toolkit from \u003Cem\u003EPadirac\u003C/em\u003E and got to work.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EIt took me just a few minutes to get the plug in place, and I managed not to pierce the tank in the process. Cat released the winch, and I snapped the cable\u0027s attachment point into the awaiting socket. I asked her to set the winch retraction rate to its lowest possible value in order to lift the lander very gently, then I stepped well back to what I assumed was a safe distance, and told her to start reeling the cable in.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EOne the slack had been taken in, the upper end of the lander began to rise out of the lunar dust inch by inch. It tipped up very slowly towards an upright position, and was at one point, almost resting on the bottom docking port beneath the pilot\u0027s capsule. My hopes were raised. Then, because I hadn\u0027t been able to attach my socket to the very top of the lander, the whole vehicle, now unweighted, shifted round it\u0027s centre of balance and was once more leaning at a precarious angle in the opposite direction. If Cat released the winch now, it would once more settle into the dust... on its other side.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E“OK Cat,” I sighed “Put her back down, gently. I\u0027ll try and move the socket.”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EAn extremely frustrating couple of hours followed during which, amongst much swearing and muttering, I drilled enough plug holes in the top of the lander for it to start looking like a sieve. But each time we lifted it, it would pitch round and settle on its other side. I even tried deploying one, then several of the lander\u0027s legs to try and stabilize it, but nothing worked. Karanda had somehow managed to design a vehicle that resists staying upright with fanatical resolve. Remind me to nominate her for the Worst Lander of the Year Award if we get back, with an additional mention for Dedication to Mission Failure. She deserves it.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003E\u003Cimg alt=\u0022Zk0xaJ5.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Zk0xaJ5.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cspan style=\u0022font-family:tahoma, geneva, sans-serif;\u0022\u003EWe gave up. Looks like I\u0027ll be denied the pleasure of discovering the view from Phobos with Angun and Jonnie. \u003Cem\u003EUn bien pour un mal\u003C/em\u003E, perhaps. Ah well, let\u0027s get some rest. When the sun comes up, we rove.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-10T23:31:43Z\u0022 title=\u002202/10/2016 11:31  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 10, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2016-02-10T23:35:11Z","Content":"\n\u003Cp\u003E\nI\u0027m really liking the first-person point of view explanations of the design considerations and handling of the craft.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d like to suggest two things:\n\u003C/p\u003E\n\u003Cp\u003E\n-Post the mission logs one at a time on r/KSP subreddit. It might increase your viewership.\n\u003C/p\u003E\n\u003Cp\u003E\n-Try using my SimpleConstruction mod (link in sig). It\u0027ll give your kerbals with a base \u0027something to do\u0027, without consuming your RAM.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-02-11T00:08:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222402901\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455147311\u0022 data-ipsquote-userid=\u0022157358\u0022 data-ipsquote-username=\u0022MatterBeam\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, MatterBeam said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m really liking the first-person point of view explanations of the design considerations and handling of the craft.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d like to suggest two things:\n\u003C/p\u003E\n\u003Cp\u003E\n-Post the mission logs one at a time on r/KSP subreddit. It might increase your viewership.\n\u003C/p\u003E\n\u003Cp\u003E\n-Try using my SimpleConstruction mod (link in sig). It\u0027ll give your kerbals with a base \u0027something to do\u0027, without consuming your RAM.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks for your suggestions.\n\u003C/p\u003E\n\u003Cp\u003E\n-I must admit that I\u0027m really posting this stuff as I write it, and wasn\u0027t really considering viewership (although I do enjoy reading folk\u0027s feedback). I have never even used reddit, but if people keep saying that they are interested, I will certainly consider it.\n\u003C/p\u003E\n\u003Cp\u003E\n-I\u0027ll look into your mod. As you might have grasped from my character\u0027s description of Kerbal design, I\u0027m going for as much realism as possible (using, for example, Regex\u0027s unfinished mod for RSS ISRU to extract real stuff like water, and not \u0022ore\u0022) despite the slightly wacky execution of certain concepts. If I can fit it in with the theme of this save and use it for fun things, I will.\n\u003C/p\u003E\n\u003Cp\u003E\n-Glad you like the first-person narration. Ideally, I\u0027d like Camwise to get fellow players thinking about some of the difficulties of the real sized solar system, and some of the corners cut by stock gameplay. But also the awesome sense of achievement in RSS when things go as planned (or even when they go not quite as planned).\n\u003C/p\u003E\n"}]}