{"TopicId":133368,"ForumId":51,"TopicTitle":"Evacuate Kerbin! Act II (Part II is up!)","CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2016-03-02T20:57:03Z","PageNum":1,"Articles":[{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2016-03-02T20:57:03Z","Content":"\n\u003Cp\u003E\nAct II of Evacuate Kerbin is here!\n\u003C/p\u003E\n\u003Cp\u003E\nPart I: The Disaster\n\u003C/p\u003E\n\u003Cp\u003E\nCoasting through interstellar space, the enormous vessel silently made her way among the stars. But interstellar space, though very sparse indeed, it is not empty, and on rare occasions contains a comet or asteroid. And one such asteroid was approaching the ship. The ship\u0027s sensors detected the errant space rock and fired RCS to avoid a collision, but it was too late. At incredibly high relative velocities, the ship and asteroid crashed together, the asteroid crashing through the ship like so much vacuum. Error and warning messages started flooding in to the central computer:\n\u003C/p\u003E\n\u003Cp\u003E\nHULL INTEGRITY COMPROMISED\n\u003C/p\u003E\n\u003Cp\u003E\nSHIP SECTIONS H5 THROUGH K6 LEAKING ATMOSPHERE\n\u003C/p\u003E\n\u003Cp\u003E\nPOWER LOSS IN SHIP SECTION K1\n\u003C/p\u003E\n\u003Cp\u003E\nCRYOBAY 01 LEAKING ATMOSPHERE\n\u003C/p\u003E\n\u003Cp\u003E\nEMERGENCY - WAKING ALL BRIDGE CREW\n\u003C/p\u003E\n\u003Cp\u003E\nJeb heard a whooshing sound as the hatch of the cryosleep pod opened. He took a deep breath... only to have his lungs hurt and the literal wind knocked out of him.\n\u003C/p\u003E\n\u003Cp\u003E\nThen he saw the hole in the wall.\n\u003C/p\u003E\n\u003Cp\u003E\nFracntically looking around the room, he located a locker labeled BACKUP SUITS - EMERGENCY USE ONLY and launched himself toward it by pushing off the wall. Grabbing hold of the handle, he slammed the door open and fumbled with a suit. Thankfully, Emergency Depressurization Preparedness training had paid off, and he got his suit on in seconds. Punching the EMERGENCY SUIT LIFE SUPPORT ACTIVATION button, he breathed in deeply. Then the suit started flashing warnings at him, but they were HEART RATE: 200 BPM, DANGEROUS LEVEL, which was to be expected, and BREATHING RATE: 180 IPM, 180 EPM, DANGEROUS LEVEL, which was also to be expected, given what he had just been through. However, the cryosleep pods for the other bridge crew were displaying BEGINNING WAKEUP SEQUENCE. He quickly overrode the controls and stopped them from waking up the bridge crew. He crawled his way along the handholds, heading for the central computer core. He was having a word with GLaRuS.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-09T01:46:12Z\u0022 title=\u002203/09/2016 01:46  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 9, 2016\u003C/time\u003E by KAL 9000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2016-03-07T20:57:37Z","Content":"\n\u003Cp\u003E\nPart II: Aftermath\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022GLaRuS, what happened?!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The ship collided with a Class-C asteroid at approximately 10,000 m/s Rel-V. Sensors detected it too late to avoid the collision.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Damage report, please.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ship sections H5 through K6 are leaking atmosphere. I have closed the blast doors between those sections and the rest of the ship. In addition, section K1, which the asteroid hit hardest, has lost power.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We need to stop those leaks! Those sections contain vital equipment and 350 Kerbals in cryosleep.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIn section F7, there is a room full of containers. The containers hold Poppers.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022What are Poppers?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Poppers are devices that prevent the air from leaking until the hull can be repaired. Just take one to the area damaged, flick the ARM switch, and press the red button! It will inflate a 25-meter diameter balloon made of carbon fiber and flexitungstanium.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022But the holes are bigger than 25 meters!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022That\u0027s why you use multiple.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAfter Jeb had deployed the Poppers and jury-rigged a fix for the power in Section K1 out of duct tape, sweat, and elbow grease, he woke up Bill and the Kerbfleet Engineering Corps to repair everything.\n\u003C/p\u003E\n"}]}