{"TopicId":141284,"ForumId":51,"TopicTitle":"Project Intrepid (Chapter 59 - Life On Laythe)","CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-06-06T03:39:41Z","PageNum":4,"Articles":[{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-09-11T02:54:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222750478\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473559204\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n54 minutes ago, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n...!\n\u003C/p\u003E\n\u003Cp\u003E\nNote to self: Imgur doesn\u0027t like it when you try to upload 300 screenshots at once. Yep, the next chapter is going to be a bit lengthy.\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently uploading the first batch of 100.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Seriously? The limit is fifty images at a time? Welp, I\u0027ll be doing this for a while.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT EDIT: Wow, Imgur is deleting half of the images I upload.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow... My EDIT: longest chapters have about EDIT: 30 pictures, and most have about 15-20 EDIT: pictures. That sounds like a very EDIT: loooooooooooooong chapter with 300 pictures! I have about 65 picture from between the EDIT: Imgur update of doom, and now. Good EDIT: luck with uploading them! It\u0027s going to take EDIT: a while... \n\u003C/p\u003E\n\u003Cp\u003E\n(Actual) EDIT: why is the word EDIT randomly appearing? Oh well. MEH. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I unintentionally EDIT: got a nice new EDIT: page for the chapter! \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-11T02:56:56Z\u0022 title=\u002209/11/2016 02:56  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 11, 2016\u003C/time\u003E by max_creative\u003C/strong\u003E\n\u003Cbr\u003EEDIT: ATTACK OF THE EDIT!!! EVERYBODY RUN AWAY!!!\n\u003C/span\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-11T22:41:25Z","Content":"\n\u003Cp\u003E\nJust so you know, I don\u0027t use nearly all of the screenshots I upload. Only some of them. I\u0027m too lazy to delete the ones I don\u0027t need.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n8 separate imgur uploads later:\n\u003C/p\u003E\n\u003Cp\u003E\nPart 26, Eve \u003Cstrike\u003Eor\u003C/strike\u003E and bust! Prepare for an incredibly long chapter!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFar, far away, out in the desert, a strange old plane prepared to take off.\u003Cbr\u003E\u003Cimg alt=\u0022YYKEjsj.png\u0022 src=\u0022http://i.imgur.com/YYKEjsj.png\u0022\u003E\u003Cbr\u003E\nThree were aboard. The chief designer, the pilot, and the intern. The chief designer began inspecting the payload.\u003Cbr\u003E\u003Cimg alt=\u0022ckiyGOd.png\u0022 src=\u0022http://i.imgur.com/ckiyGOd.png\u0022\u003E\u003Cbr\u003E\nSatisfied with the nearly fifty years of work he had put into it, the chief designer signaled the pilot to take off and climb to cruising altitude.\u003Cbr\u003E\u003Cimg alt=\u0022YVwQd3j.png\u0022 src=\u0022http://i.imgur.com/YVwQd3j.png\u0022\u003E\u003Cbr\u003E\nOnce the plane had leveled out sufficiently, the chief designer prepared the payload for launch. Then, however, the intern entered the cargo bay.\u003Cbr\u003E\u003Cimg alt=\u0022Ef3zNpA.png\u0022 src=\u0022http://i.imgur.com/Ef3zNpA.png\u0022\u003E\u003Cbr\u003E\n\u0022Sir? Sorry to interrupt you, chief designer, sir, but I was just wondering if you could possibly explain what exactly this missile is, before we fire it.\u0022\u003Cbr\u003E\n\u0022First off, mister intern, your orders were to observe this test without interfering. Or asking questions. Although, I admire one who asks questions. It wasn\u0027t me who told you not to ask them.\u0022\u003Cbr\u003E\n\u0022So, what is it, sir? A nuclear cruise missile? A submarine diver missile?\u0022\u003Cbr\u003E\n\u0022Heh. Neither, Fred. It would be a stretch to even call it a missile.\u0022\u003Cbr\u003E\n\u0022How do you know my name?\u0022\u003Cbr\u003E\n\u0022Your nametag literally says \u0022Fred.\u0022\u003Cbr\u003E\n\u0022Oh. It\u0027s really more of a nickname.\u0022 Fred glanced at the Chief Designer\u0027s own nameplate. It had been removed long ago. His suit looked ancient. \u0022So, it\u0027s a jet and not a missile? That engine doesn\u0027t look like a Jet\u0027s.\u0022\u003Cbr\u003E\u003Cimg alt=\u00227cpF9CE.png\u0022 src=\u0022http://i.imgur.com/7cpF9CE.png\u0022\u003E\u003Cbr\u003E\n\u0022I like you, Fred. You bring a certain idealism to the society.\u0022\u003Cbr\u003E\n\u0022Thanks, sir.\u0022\u003Cbr\u003E\n\u0022Now, this thing, you could say it is a long range missile.\u0022\u003Cbr\u003E\n\u0022Just how much long ranged?\u0022\u003Cbr\u003E\n\u0022About as long ranged as anything can get.\u0022\u003Cbr\u003E\n\u0022The payload?\u0022\u003Cbr\u003E\n\u0022That is a tough question.\u0022\u003Cbr\u003E\n\u0022Is it involved in Plan Omega?\u0022\u003Cbr\u003E\n\u0022NO. NO. NO. This is something completely separate. If we didn\u0027t run out of alphabet, this would have been there. But we ran out of alphabet. Plan Omega better work. I designed it.\u0022\u003Cbr\u003E\n\u0022Remember when everybody laughed at us for naming our nuclear biplanes after a comic book?\u0022\u003Cbr\u003E\n\u0022GRAPHIC NOVEL. Not comic book. Those biplanes were an embarrassment to the Flat Kerbin Society.\u0022\u003Cbr\u003E\n\u0022Sir? We appear to be at cruising altitude.\u0022\u003Cbr\u003E\n\u0022Yes, I see. The bay doors are opening. You should return to the cockpit.\u0022\u003Cbr\u003E\u003Cimg alt=\u002225Hk9It.png\u0022 src=\u0022http://i.imgur.com/25Hk9It.png\u0022\u003E\u003Cbr\u003E\n\u0022Sir? Aren\u0027t you coming?\u0022 The Chief Designer was silent for a while. \u0022Sir?\u0022\u003Cbr\u003E\n\u0022Fred, do you want to come with me on the adventure of a lifetime?\u0022\u003Cbr\u003E\n\u0022Sir, I\u0027m not sure what you mean by that.\u0022\u003Cbr\u003E\n\u0022Get in.\u0022\u003Cbr\u003E\n\u0022What? Are you crazy? That\u0027s a missile!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022znU2QpZ.png\u0022 src=\u0022http://i.imgur.com/znU2QpZ.png\u0022\u003E\u003Cbr\u003E\n\u0022I spent FIFTY YEARS working on this. I can assure you that it\u0027s not a missile. Not in the traditional sense.\u0022\u003Cbr\u003E\n\u0022Then why was it marked MISSILE in the reports?\u0022\u003Cbr\u003E\n\u0022The only way I could get it past the society.\u0022\u003Cbr\u003E\n\u0022What? Are you saying - \u0022\u003Cbr\u003E\n\u0022Yes, Fred. I am a traitor. Now get in.\u0022 An ominous countdown started.\u003Cbr\u003E\n\u0022Fred, we\u0027re launching in ten seconds. Are you in, or out?\u0022 Weighing his options, Fred ran to the cockpit door. It was locked.\u003Cbr\u003E\n\u0022Fred, GET IN!\u0022 Because Fred did not want to be vaporized upon takeoff, he ran up the makeshift ladder and jumped into the seat. \u0022Hold onto your helmet!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022t1bBVRw.png\u0022 src=\u0022http://i.imgur.com/t1bBVRw.png\u0022\u003E\u003Cbr\u003E\n\u0022AAAAAAAAAAA-\u0022\u003Cbr\u003E\u003Cimg alt=\u0022x7dHx76.png\u0022 src=\u0022http://i.imgur.com/x7dHx76.png\u0022\u003E\u003Cbr\u003E\n\u0022AAAAAAAAAAAA-\u0022\u003Cbr\u003E\u003Cimg alt=\u00228f9vH4X.png\u0022 src=\u0022http://i.imgur.com/8f9vH4X.png\u0022\u003E\u003Cbr\u003E\n\u0022Fred, will you quit screaming?\u0022\u003Cbr\u003E\n\u0022I WANT TO GO HOME!\u0022\u003Cbr\u003E\n\u0022Sorry. That option was basically ruled out a few seconds ago. See? No chute.\u0022\u003Cbr\u003E\n\u0022YOU MANIAC!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022oP3Dzs1.png\u0022 src=\u0022http://i.imgur.com/oP3Dzs1.png\u0022\u003E\u003Cbr\u003E\n\u0022You were the one who came with me.\u0022\u003Cbr\u003E\n\u0022When are we coming back down?\u0022\u003Cbr\u003E\n\u0022In either 2 minutes, or not for a long time.\u0022\u003Cbr\u003E\n\u0022What\u0027s that supposed to mean?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022laoWPlJ.png\u0022 src=\u0022http://i.imgur.com/laoWPlJ.png\u0022\u003E\u003Cbr\u003E\n\u0022Woah.\u0022\u003Cbr\u003E\n\u0022You got that right, Fred. Kerbin is most definitely round.\u0022\u003Cbr\u003E\n\u0022But that\u0027s - \u0022\u003Cbr\u003E\n\u0022No. Kerbin is round. Don\u0027t try to deny it. The only reason I became the chief designer of the Flat Kerbin Society is so I could have the resources to build this.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022VpjqMHj.png\u0022 src=\u0022http://i.imgur.com/VpjqMHj.png\u0022\u003E\u003Cbr\u003E\n\u0022But why? And where are we going?\u0022\u003Cbr\u003E\u003Cimg alt=\u00227n1yYWx.png\u0022 src=\u0022http://i.imgur.com/7n1yYWx.png\u0022\u003E\u003Cbr\u003E\n\u0022Because. I wanted to go to the Mun.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022XC97uZR.png\u0022 src=\u0022http://i.imgur.com/XC97uZR.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n=======================================================================================================\u003Cbr\u003E\n\u0022So you were alive during the war?\u0022\u003Cbr\u003E\n\u0022Correct, Fred. Now, please don\u0027t distract me. I\u0027m trying to plot a specific landing site.\u0022\u003Cbr\u003E\n\u0022Tell me again how we\u0027re going to get back home after this?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022nzjAtH5.png\u0022 src=\u0022http://i.imgur.com/nzjAtH5.png\u0022\u003E\u003Cbr\u003E\n\u0022That is a good question. Also, you might want to brace for impact. I weighted the craft incorrectly. I can\u0027t throttle over 20% without this thing flipping around.\u0022\u003Cbr\u003E\n\u0022What?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022kbew1Ss.png\u0022 src=\u0022http://i.imgur.com/kbew1Ss.png\u0022\u003E\u003Cbr\u003E\n\u0022We should be fine, though.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022r8dUYSU.png\u0022 src=\u0022http://i.imgur.com/r8dUYSU.png\u0022\u003E\u003Cbr\u003E\n\u0022Coming in, Aaand,\u0022\u003Cbr\u003E\u003Cimg alt=\u0022jSPpF8G.png\u0022 src=\u0022http://i.imgur.com/jSPpF8G.png\u0022\u003E\u003Cbr\u003E\n\u0022Landed! Now, are you up for a hike?\u0022\u003Cbr\u003E\n\u0022What?\u0022\u003Cbr\u003E\n\u0022The thing I came here to find.\u0022\u003Cbr\u003E\n\u0022You came here to find something?\u0022\u003Cbr\u003E\n\u0022It\u0027s a few days hike away. Better start walking!\u0022\u003Cbr\u003E\n===========================================================================================\u003Cbr\u003E\n\u00223! 2! 1! Launch!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022rTZ0HvR.png\u0022 src=\u0022http://i.imgur.com/rTZ0HvR.png\u0022\u003E\u003Cbr\u003E\n\u0022How\u0027s it looking, Gene?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022oGEGI4p.png\u0022 src=\u0022http://i.imgur.com/oGEGI4p.png\u0022\u003E\u003Cbr\u003E\n\u0022WHY DID I AGREE TO PILOTING THIS THING?\u0022\u003Cbr\u003E\n\u0022Hey, the ITV-017 was your idea. And plus, we needed something to go to Eve in.\u0022\u003Cbr\u003E\n\u0022And I had to pilot it, because?\u0022\u003Cbr\u003E\n\u0022You volunteered.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022kUkTGDZ.png\u0022 src=\u0022http://i.imgur.com/kUkTGDZ.png\u0022\u003E\u003Cbr\u003E\n\u0022I heard some various explosions!*\n\u003C/p\u003E\n\u003Cp\u003E\n*(This is a reference to something.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yeah, apparently forgetting to strut the last 3 orange tanks was a bad idea.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022ggS78Xv.png\u0022 src=\u0022http://i.imgur.com/ggS78Xv.png\u0022\u003E\u003Cbr\u003E\n\u0022Yep, Sherlock. Also, the entire loop has fallen off. We didn\u0027t strut that either.\u0022\u003Cbr\u003E\n\u0022Already making the changes to the 018.\u0022\u003Cbr\u003E\n\u0022I\u0027m going to bail out now!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022Umave8X.png\u0022 src=\u0022http://i.imgur.com/Umave8X.png\u0022\u003E\u003Cbr\u003E\nThe ITV-017, one of three Intrepid Model 4\u0027s built, was Gene Kerman\u0027s idea. Mostly made because it carried 65 Kerbals, and looked cool. It was powered by a lot of Nerva\u0027s and was by far the longest of any of the motherships.\u003Cbr\u003E\u003Cimg alt=\u0022BWVTJOU.png\u0022 src=\u0022http://i.imgur.com/BWVTJOU.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022au4VYRs.png\u0022 src=\u0022http://i.imgur.com/au4VYRs.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022HkD2yF9.png\u0022 src=\u0022http://i.imgur.com/HkD2yF9.png\u0022\u003E\u003Cbr\u003E\n\u0022Next ship!\u0022 And thus, the 018 was readied for launch.\u003Cbr\u003E\u003Cimg alt=\u0022A5SfX0y.png\u0022 src=\u0022http://i.imgur.com/A5SfX0y.png\u0022\u003E\u003Cbr\u003E\n\u00223, 2, 1, Engage!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022IiODHNJ.png\u0022 src=\u0022http://i.imgur.com/IiODHNJ.png\u0022\u003E\u003Cbr\u003E\n\u0022Good news. Not as much is exploding. Nobody strutted the orange tanks, and only half of the ring is staying on.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022FIagvWc.png\u0022 src=\u0022http://i.imgur.com/FIagvWc.png\u0022\u003E\u003Cbr\u003E\n\u0022It\u0027s also flipping. A lot.\u0022\u003Cbr\u003E\u003Cimg alt=\u00221U4ljxP.png\u0022 src=\u0022http://i.imgur.com/1U4ljxP.png\u0022\u003E\u003Cbr\u003E\n\u0022I managed to recover it, though!\u0022\u003Cbr\u003E\n\u0022Do you think It\u0027ll get to space?\u0022\u003Cbr\u003E\n\u0022Depends. At this point, it\u0027s all about separation. Although, with the ring gone, there\u0027s nothing to obstruct the boosters at this point.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022he6IAnW.png\u0022 src=\u0022http://i.imgur.com/he6IAnW.png\u0022\u003E\u003Cbr\u003E\n\u0022Nearing space, and we have booster separation.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022MLDlOui.png\u0022 src=\u0022http://i.imgur.com/MLDlOui.png\u0022\u003E\u003Cbr\u003E\n\u0022Engaging LV-N\u0027s, and we have orbit!\u0022\u003Cbr\u003E\u003Cimg alt=\u00221CuoSaM.png\u0022 src=\u0022http://i.imgur.com/1CuoSaM.png\u0022\u003E\u003Cbr\u003E\n\u0022Yay, Gene! Now, you get to name it!\u0022\u003Cbr\u003E\n\u0022Hmm. I didn\u0027t think I\u0027d ever get to do this. I\u0027m going to name it after Admiral Valentina Kerman.\u0022\u003Cbr\u003E\n\u0022Good choice.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022Yq3Kfhx.png\u0022 src=\u0022http://i.imgur.com/Yq3Kfhx.png\u0022\u003E\u003Cbr\u003E\n\u0022Anything else need launching?\u0022\u003Cbr\u003E\n\u0022Yes. Phase one needs to go to Minmus. It\u0027s been sitting in orbit for months.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022oYoUejd.png\u0022 src=\u0022http://i.imgur.com/oYoUejd.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022yM6Vpnv.png\u0022 src=\u0022http://i.imgur.com/yM6Vpnv.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022tlxlj7S.png\u0022 src=\u0022http://i.imgur.com/tlxlj7S.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022dl4KW07.png\u0022 src=\u0022http://i.imgur.com/dl4KW07.png\u0022\u003E\u003Cbr\u003E\n\u0022Engaging landing. We should only have to use the final stage for literally the last 5m/s of the descent.\u0022\u003Cbr\u003E\n\u0022Good.\u0022\u003Cbr\u003E\n\u0022What\u0027s this for, again, Gene?\u0022\u003Cbr\u003E\n\u0022Oh. I\u0027m afraid it\u0027s still top secret at this point, but you\u0027ve probably already figured out that it\u0027s a giant Minmus base.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022f65tM2s.png\u0022 src=\u0022http://i.imgur.com/f65tM2s.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022KgVpx6l.png\u0022 src=\u0022http://i.imgur.com/KgVpx6l.png\u0022\u003E\u003Cbr\u003E\n\u0022And with that, the largest mass ever landed on Minmus in one go! 1500 tons of supplies!\u0022\u003Cbr\u003E\n\u0022Time to celebrate?\u0022\u003Cbr\u003E\n\u0022Yeah. Tell the phase two engineers that they have the day off!\u0022\u003Cbr\u003E\n==============================================================================\u003Cbr\u003E\u003Cimg alt=\u0022CKm81Tn.png\u0022 src=\u0022http://i.imgur.com/CKm81Tn.png\u0022\u003E\u003Cbr\u003E\n(OOOOOOOFFF, that south pole is VERY hard to look at, and it blends with the forum background. Oof.)\u003Cbr\u003E\nJebediah Kerman had landed on the Southern Ice Cap of Duna a week ago. He had hiked far and wide, searching for the anomaly he suspected had been located nearby. He spotted something in the distance.\u003Cbr\u003E\u003Cimg alt=\u0022e1dqAHw.png\u0022 src=\u0022http://i.imgur.com/e1dqAHw.png\u0022\u003E\u003Cbr\u003E\nHe concluded that it was some sort of sled. Solid evidence that Kerbals had been here, when yet no mission to the southern ice cap had been in the history logs. He spotted another dot on the horizon and walked over.\u003Cbr\u003E\u003Cimg alt=\u0022a4ckwgp.png\u0022 src=\u0022http://i.imgur.com/a4ckwgp.png\u0022\u003E\u003Cbr\u003E\nIt was an ancient base. It appeared ramshackle, and it had evidently been here for some time. It was buried in the ice. He entered, to find it empty.\u003Cbr\u003E\n\u0022But... there has to be something I\u0027m missing.\u0022 He started moving things around. \u0022Aha!\u0022 he had located a tunnel that led downwards, beneath the central table.\u003Cbr\u003E\u003Cimg alt=\u0022ryVVIVO.png\u0022 src=\u0022http://i.imgur.com/ryVVIVO.png\u0022\u003E\u003Cbr\u003E\nThe area below was tiny. The low power lights were flashing on and off. Gravioli detectors lined the walls. But all that, Jebediah didn\u0027t notice. Laying down on a table, frozen, unconscious, connected to a strange machine, and clutching a note, laid none other than the one person Jebediah Kerman had been aiming to find, at incredible odds.\u003Cbr\u003E\u003Cimg alt=\u0022Kd12Oje.png\u0022 src=\u0022http://i.imgur.com/Kd12Oje.png\u0022\u003E\u003Cbr\u003E\nJebediah held his breath, for he didn\u0027t know whether she was still alive. He carefully pulled the note out of her left hand and read it aloud:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022To whoever may find this note: I am Admiral Valentina Kerman. If you were purposely looking for me, you probably know that already. If you weren\u0027t, look me up later. For now, you may wonder why I am frozen, connected to a strange machine. Well, interestingly enough, after ten years alone on Duna, you get pretty bored (duh) and start thinking up ways to make time go faster. So I came up with a hibernation machine. Yeah, I\u0027m in hibernation right now. At least, I should be. I\u0027m hopefully not dead. I set up a timer to wake me up every five years or so, or if the power gets below 1%. On the back of this sheet, you should find tally marks which will symbolize how many times I\u0027ve woken up.\u0022 Jebediah flipped the page over to, unsettlingly, a blank sheet of white. He turned it back over and kept reading. \u0022Of course, it may have broke. There should be a big red button on the far wall that will revive me in an emergency. Unless the power\u0027s out and the timer has failed. Then, I\u0027m dead. Next to the experiment array, you should find a packet marked \u0022If I\u0027m dead.\u0022 Don\u0027t read it if I\u0027m not dead, please.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJebediah Kerman stopped reading immediately when he heard the warning voice: \u0022Warning. Power at 0.03%. Life support systems failing.\u0022 He immediately pressed the big red button on the far wall. \u0022Warning. Insufficient Oxygen for revival. If a source of oxygen is nearby, please remove subject from hibernation chamber and connect the source to the port on the suit.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJebediah Kerman began dragging Valentina Kerman up the ladder, and across the Dunian surface in attempt to get her to the plane, which had emergency oxygen for this sort of occasion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022C05WcTt.png\u0022 src=\u0022http://i.imgur.com/C05WcTt.png\u0022\u003E\u003Cbr\u003E\nThe plane was kilometers away. There was no way he could make it in time. So he did the only thing he could think of. He held his breath, undid his oxygen hose, and plugged it into the port on Valentina\u0027s suit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You\u0027re not dying that easily, Val. Not at all.\u0022\u003Cbr\u003E\n==========================================================================================\u003Cbr\u003E\n\u0022I hate Eve ascent vehicles.\u0022\u003Cbr\u003E\u003Cimg alt=\u00227qCOmUy.png\u0022 src=\u0022http://i.imgur.com/7qCOmUy.png\u0022\u003E\u003Cbr\u003E\nThat was the general mantra among the engineers, and it had been for weeks. Endless iterations of the same design lead to a very high frustration level. Eventually, though, it was completed. The pilot, Leah Kerman, began the startup procedures.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Let\u0027s hope this launch goes better than the last one.\u0022\u003Cbr\u003E\n\u0022Yeah, Leah. That was the worst thing.\u0022\u003Cbr\u003E\n\u0022The entire rocket blew up except for the actual EAV and I limped to orbit, getting to within 300m of the 018, before realizing the docking port had blown up as well.\u003Cbr\u003E\u003Cimg alt=\u0022zGixYXB.png\u0022 src=\u0022http://i.imgur.com/zGixYXB.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022Pjw3DcK.png\u0022 src=\u0022http://i.imgur.com/Pjw3DcK.png\u0022\u003E\u003Cbr\u003E\n\u0022Anyway. 3! 2! 1!\u0022 Liftoff!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022U4ORHAR.png\u0022 src=\u0022http://i.imgur.com/U4ORHAR.png\u0022\u003E\u003Cbr\u003E\n\u0022Oh, we\u0027re launching at night?\u0022\u003Cbr\u003E\n\u0022Yeah. Soonest transfer.\u0022\u003Cbr\u003E\n\u0022Okay.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022j8BM1fv.png\u0022 src=\u0022http://i.imgur.com/j8BM1fv.png\u0022\u003E\u003Cbr\u003E\n\u0022Booster sep, going on direct rendezvous. Approaching 018!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022Wriw8S5.png\u0022 src=\u0022http://i.imgur.com/Wriw8S5.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022t56ZGFS.png\u0022 src=\u0022http://i.imgur.com/t56ZGFS.png\u0022\u003E\u003Cbr\u003E\n\u0022Gene Kerman, requesting permission to dock!\u0022\u003Cbr\u003E\n\u0022Permission granted, Leah!\u0022\u003Cbr\u003E\u003Cimg alt=\u00224yoVWw8.png\u0022 src=\u0022http://i.imgur.com/4yoVWw8.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022nqlAz1E.png\u0022 src=\u0022http://i.imgur.com/nqlAz1E.png\u0022\u003E\u003Cbr\u003E\n\u0022We are docked! The longest thing ever in orbit, am I right Gene?\u0022\u003Cbr\u003E\n\u0022Mostly. Once, a rich millionaire paid us to make a five kilometer long truss in orbit, for just the purpose of seeing if it could be done.\u0022\u003Cbr\u003E\n\u0022Did it work?\u0022\u003Cbr\u003E\n\u0022Almost. It got to 2.2Km, and then something happened to it. It started shaking, and then vanished.\u0022\u003Cbr\u003E\n\u0022Like a Kraken attack?\u0022\u003Cbr\u003E\n\u0022The Kraken is a myth, Leah.\u0022\u003Cbr\u003E\u003Cimg alt=\u00220iZWrMn.png\u0022 src=\u0022http://i.imgur.com/0iZWrMn.png\u0022\u003E\u003Cbr\u003E\n\u0022If we docked anything to the other docking ports, we\u0027d be obstructing the engines. We\u0027d have to launch another ship to take anything else to Eve, Gene.\u0022\u003Cbr\u003E\n\u0022Well, guess what? We have a third model 4 in the hangar. Send six Kerbals up, and add more struts to the ring.\u0022\u003Cbr\u003E\n\u0022Got it!\u0022\u003Cbr\u003E\n============================================================================================\u003Cbr\u003E\n\u0022LIFTOFF!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022C0Huqbs.png\u0022 src=\u0022http://i.imgur.com/C0Huqbs.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u00227eDI1jv.png\u0022 src=\u0022http://i.imgur.com/7eDI1jv.png\u0022\u003E\u003Cbr\u003E\nThe crew of the 019 consisted of Anberta, the captain, Vernie and Elkin, scientists, Macfry and Pomeroy, engineers, and Nataemma, senior engineer.\u003Cbr\u003E\nIt quickly rose skyward.\u003Cbr\u003E\u003Cimg alt=\u0022yYcfuT5.png\u0022 src=\u0022http://i.imgur.com/yYcfuT5.png\u0022\u003E\u003Cbr\u003E\nSoon, it was in space.\u003Cbr\u003E\u003Cimg alt=\u00222lizsWQ.png\u0022 src=\u0022http://i.imgur.com/2lizsWQ.png\u0022\u003E\u003Cbr\u003E\nTwenty minutes later, Gene Kerman\u0027s vision of an insanely awesome looking ringship in orbit was fulfilled:\u003Cbr\u003E\u003Cimg alt=\u0022qT64FgM.png\u0022 src=\u0022http://i.imgur.com/qT64FgM.png\u0022\u003E\u003Cbr\u003E\n\u0022Tell me that doesn\u0027t look awesome. I DARE you! Oh, and Anberta, you get to name it.\u0022\u003Cbr\u003E\n\u0022I hereby Christen this ship the ITV-019 Homecoming!\u0022\u003Cbr\u003E\n========================================================================================\u003Cbr\u003E\n\u0022All the engineers were on break. We had Carol the scientist design the Gilly lander.\u0022\u003Cbr\u003E\n\u0022You mean, that lifter wasn\u0027t designed by Jeb?\u0022\u003Cbr\u003E\n\u0022No. I can\u0027t believe it earlier.\u0022\u003Cbr\u003E\n\u0022Also, Carol appears to be aboard.\u0022\u003Cbr\u003E\n\u0022What?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022T5K2QFh.png\u0022 src=\u0022http://i.imgur.com/T5K2QFh.png\u0022\u003E\u003Cbr\u003E\n\u0022But that\u0027s... ALL \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESrb\u003C/abbr\u003E\u0027s.\u0022\u003Cbr\u003E\n\u0022Except for the lander.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022MqpAMVm.png\u0022 src=\u0022http://i.imgur.com/MqpAMVm.png\u0022\u003E\u003Cbr\u003E\n\u0022Please tell me that\u0027ll make orbit.\u0022\u003Cbr\u003E\n\u0022Actually, it has too much \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E. Carol\u0027ll have to burn retrograde for a quarter of the final burn.\u0022\u003Cbr\u003E\n\u0022Are you sure she\u0027s not a clone of Jeb?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022F3Q42Zb.png\u0022 src=\u0022http://i.imgur.com/F3Q42Zb.png\u0022\u003E\u003Cbr\u003E\n\u0022Hey, it\u0027s actually working!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022TMOfzjo.png\u0022 src=\u0022http://i.imgur.com/TMOfzjo.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022KWwp1s9.png\u0022 src=\u0022http://i.imgur.com/KWwp1s9.png\u0022\u003E\u003Cbr\u003E\n\u0022And, she\u0027s docked!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022Ka4Gpob.png\u0022 src=\u0022http://i.imgur.com/Ka4Gpob.png\u0022\u003E\u003Cbr\u003E\n\u0022Yes, she apparently is!\u0022\u003Cbr\u003E\n\u0022So, now we launch the rest of the Eve ships?\u0022\u003Cbr\u003E\n\u0022Yep. Then, Phase two!\u0022\u003Cbr\u003E\n\u0022Uh, sir? We\u0027ve got an incoming on the radar.\u0022\u003Cbr\u003E\n\u0022What is it?\u0022\u003Cbr\u003E\n\u0022Some plane called \u0022Project Omega.\u0022\u0022\u003Cbr\u003E\n\u0022Never heard of it.\u0022\u003Cbr\u003E\n\u0022Uh, now we\u0027re tracking four incomings.\u0022\u003Cbr\u003E\n\u0022Uh oh. Everyone get to the bunkers!\u0022\u003Cbr\u003E\n=================================================================================\u003Cbr\u003E\n\u0022Alright Stachel. Remember what we taught you.\u0022\u003Cbr\u003E\n\u0022I remember commander. Targeting now.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022O7kjn9b.png\u0022 src=\u0022http://i.imgur.com/O7kjn9b.png\u0022\u003E\u003Cbr\u003E\n\u0022Today shall be the day the Flat Kerbin Society shall RISE!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022unZGVcV.png\u0022 src=\u0022http://i.imgur.com/unZGVcV.png\u0022\u003E\u003Cbr\u003E\n\u0022Direct hit on the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E! And the Astronaut Complex!\u0022\u003Cbr\u003E\n\u0022Good. Cycle back around. Give mission control a missile or two!\u0022\u003Cbr\u003E\n\u0022Roger that.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022oo05esN.png\u0022 src=\u0022http://i.imgur.com/oo05esN.png\u0022\u003E\u003Cbr\u003E\n\u0022Mission control has been destroyed.\u0022\u003Cbr\u003E\n\u0022Now give research and development - \u0022\u003Cbr\u003E\n\u0022A cluster bomb. I remember my training, commander.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022104Au82.png\u0022 src=\u0022http://i.imgur.com/104Au82.png\u0022\u003E\u003Cbr\u003E\n\u00223... 2... 1...\u0022\u003Cbr\u003E\u003Cimg alt=\u002200plSSC.png\u0022 src=\u0022http://i.imgur.com/00plSSC.png\u0022\u003E\u003Cbr\u003E\n\u0022Direct hit. Research and Development has been severely damaged. Also, I accidentally ditched my other cluster bomb.\u0022\u003Cbr\u003E\n\u0022Shame, shame. You wouldn\u0027t have needed it. Remember, do not damage the launch pad, or destroy the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\u0022\u003Cbr\u003E\n\u0022Roger.\u0022\u003Cbr\u003E\n\u0022Targeting the tracking station now.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022AdpMPOg.png\u0022 src=\u0022http://i.imgur.com/AdpMPOg.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022jJiGKCC.png\u0022 src=\u0022http://i.imgur.com/jJiGKCC.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022Hit. Dish one down.\u0022\u003Cbr\u003E\n\u0022Destroy the administration building.\u0022\u003Cbr\u003E\n\u0022Roger.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022lMhIvxs.png\u0022 src=\u0022http://i.imgur.com/lMhIvxs.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022sAhUzxG.png\u0022 src=\u0022http://i.imgur.com/sAhUzxG.png\u0022\u003E\u003Cbr\u003E\n\u0022Perfect. You may fire your remaining missiles at the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. Try to only cause minor damage.\u0022\u003Cbr\u003E\n\u0022Yes, sir.\u0022\u003Cbr\u003E\n\u0022Then you may land.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022x5wAkAl.png\u0022 src=\u0022http://i.imgur.com/x5wAkAl.png\u0022\u003E\u003Cbr\u003E\n\u0022Commencing landing sequence.\u0022\u003Cbr\u003E\n\u0022Wait. Destroy another Tracking station dish, and send the final rocket at the flag pole.\u0022\u003Cbr\u003E\n\u0022The flag pole, sir? It probably costs less than the missile!\u0022\u003Cbr\u003E\n\u0022Do as I say.\u0022\u003Cbr\u003E\n\u0022Roger.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022lhqt7iW.png\u0022 src=\u0022http://i.imgur.com/lhqt7iW.png\u0022\u003E\u003Cbr\u003E\n\u0022This will be a piece of cake.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022vSlSRCK.png\u0022 src=\u0022http://i.imgur.com/vSlSRCK.png\u0022\u003E\u003Cbr\u003E\n\u0022Uh, commander?\u0022\u003Cbr\u003E\n\u0022Yes?\u0022\u003Cbr\u003E\n\u0022I think I missed.\u0022\u003Cbr\u003E\n\u0022No matter. Land and shoot it yourself.\u0022\u003Cbr\u003E\n\u0022Roger.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022NAUWPcT.png\u0022 src=\u0022http://i.imgur.com/NAUWPcT.png\u0022\u003E\u003Cbr\u003E\n\u0022And thus ends the reign of the Kerbal Space Center!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022K6RpRH3.png\u0022 src=\u0022http://i.imgur.com/K6RpRH3.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022yciWnsh.png\u0022 src=\u0022http://i.imgur.com/yciWnsh.png\u0022\u003E\u003Cbr\u003E\n\u0022I\u0027m moving in with my ground force. Prepare the stage.\u0022\u003Cbr\u003E\n\u0022Roger that. Sir, should I destroy this?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022C25PTA3.png\u0022 src=\u0022http://i.imgur.com/C25PTA3.png\u0022\u003E\u003Cbr\u003E\n\u0022It\u0027s a WORTHLESS piece of stone that, when it was a real thing, was a piece of junk. Don\u0027t waste the effort. The chief designer, before he disappeared, specifically said that that piece of stone is to remain intact.\u0022\u003Cbr\u003E\n\u0022Understood.\u0022\u003Cbr\u003E\n======================================================================================\u003Cbr\u003E\u003Cimg alt=\u0022jNQkCdk.png\u0022 src=\u0022http://i.imgur.com/jNQkCdk.png\u0022\u003E\u003Cbr\u003E\n\u0022Attention all citizens of Kerbin. We are the Flat Kerbin Society, and by intervening tonight, we have liberated the world from the false belief that the world will end in 200 years. We have also established a more fair form of government. Together, the FKS and the world will create a powerful empire spanning the whole world!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022nxIHWFE.png\u0022 src=\u0022http://i.imgur.com/nxIHWFE.png\u0022\u003E\u003Cbr\u003E\nJust then, Wernher von Kerman stepped out of the crowd in protest. \u0022But you can\u0027t! This is our base of operations! We are a peaceful organization!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThen, the leader of the Flat Kerbin Society put on the evilest of grins, and said to Wernher\u0027s face,\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NWizeOC.png\u0022 src=\u0022http://i.imgur.com/NWizeOC.png\u0022\u003E\u003Cbr\u003E\n\u0022All of your base are belong to us.\u0022\u003Cbr\u003E\n=======================================================================================\u003Cbr\u003E\nFred and the Chief designer had been hiking the Mun for several days. They had yet found nothing.\u003Cbr\u003E\u003Cimg alt=\u0022v71HzFc.png\u0022 src=\u0022http://i.imgur.com/v71HzFc.png\u0022\u003E\u003Cbr\u003E\n\u0022My legs hurt.\u0022\u003Cbr\u003E\n\u0022Quiet, Fred. We\u0027re almost there.\u0022\u003Cbr\u003E\n\u0022That\u0027s what you\u0027ve been saying for days!\u0022\u003Cbr\u003E\n\u0022I\u0027m serious. It\u0027s only another 200 meters.\u0022\u003Cbr\u003E\n\u0022Oh! I see it!\u0022\u003Cbr\u003E\u003Cimg alt=\u00222l4zOJw.png\u0022 src=\u0022http://i.imgur.com/2l4zOJw.png\u0022\u003E\u003Cbr\u003E\n\u0022What is it?\u0022\u003Cbr\u003E\n\u0022It was a base. But the previous occupants must have triggered the self destruct.\u0022\u003Cbr\u003E\n\u0022So, we\u0027re stuck here?\u0022\u003Cbr\u003E\n\u0022No. The underground portion of the base should still be intact. Follow me.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022fRq3M6P.png\u0022 src=\u0022http://i.imgur.com/fRq3M6P.png\u0022\u003E\u003Cbr\u003E\n\u0022This is a long ladder.\u0022\u003Cbr\u003E\n\u0022No, it isn\u0027t. You haven\u0027t seen anything yet.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022csVeb3I.png\u0022 src=\u0022http://i.imgur.com/csVeb3I.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022GSjd4ZO.png\u0022 src=\u0022http://i.imgur.com/GSjd4ZO.png\u0022\u003E\u003Cbr\u003E\n\u0022So, this was the base that Bill and Bob built to cover up an even bigger secret.\u0022\u003Cbr\u003E\n\u0022Sorry, what? And why is there a pile of circuits on the floor?\u0022\u003Cbr\u003E\n\u0022To cover up the departure. They are merely decoys, chips from old gravioli detectors.\u0022\u003Cbr\u003E\n\u0022Sorry. Not following any of this.\u0022\u003Cbr\u003E\n\u0022You\u0027ll see soon. In about 3 seconds. 3... 2... 1...\u0022\u003Cbr\u003E\nJust then there was a sudden reversal in gravity, and then an explosion, and then a bright blue flash. When the two regained their vision, two figures stood before them, in front of the bank of Gravioli detectors.\u003Cbr\u003E\u003Cimg alt=\u0022Kpgmg1i.png\u0022 src=\u0022http://i.imgur.com/Kpgmg1i.png\u0022\u003E\u003Cbr\u003E\n\u0022Greetings, you must be Robo-Bill and Robo-Bob,\u0022 said the Chief Designer.\u003Cbr\u003E\n\u0022Who?\u0022 Asked Fred.\u003Cbr\u003E\n\u0022How do you know about us?\u0022 Asked Robo-Bob.  \u0022Where are we? What year is it?\u0022\u003Cbr\u003E\n\u0022Well,\u0022 replied the Chief Designer, \u0022it is currently year two, day 200, in cycle 8. In other words, you\u0027ve resynchronized. After a year of fun, way back in, what was it? The thirteenth era?\u0022\u003Cbr\u003E\n\u0022Correct,\u0022 replied Robo-Bob. \u0022How do you know about us? And when to land here?\u0022\u003Cbr\u003E\n\u0022The logs you stuffed inside the memorial to the old Mark One Command Pod Memorial.\u0022\u003Cbr\u003E\n\u0022Ah, someone found those. And how did you know what time?\u0022\u003Cbr\u003E\n\u0022The log entries stopped one year 100 days after you arrived. It was logical to assume that you would resynchronize one year and 100 days after you departed.\u0022\u003Cbr\u003E\n\u0022But surely you wouldn\u0027t just come here just to greet our return. Spit it out, you want something.\u0022\u003Cbr\u003E\n\u0022Two things, Mr. Bob. I would like the - secret feature, lets call it - of this base, and I want you to continue your research into time travel. To see if it can be replicated.\u0022\u003Cbr\u003E\n\u0022We were already going to do the second,\u0022 replied Robo-Bill, \u0022And we have no use for the first any more. You may go ahead, new ally. You already know our names. What should we call you?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe Chief Designer put on something of a sly grin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You may call me Hudson Kerman.\u0022 At this point, Fred interjected.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hudson Kerman? THE Hudson Kerman? Time Travel? The Thirteenth era? Robots? What?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hush now, Fred. Now, I shall prove what I have been trying to prove for over fifty years, since before the war started.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022But - How did you survive?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hush. Open this door for me, will you?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Mhg90Qj.png\u0022 src=\u0022http://i.imgur.com/Mhg90Qj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \u0022I don\u0027t know what you\u0027re talking abou - oh.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022YQ2gOks.png\u0022 src=\u0022http://i.imgur.com/YQ2gOks.png\u0022\u003E\u003Cbr\u003E\n\u0022I was right.\u0022\u003Cbr\u003E\u003Cimg alt=\u00221qqre4C.png\u0022 src=\u0022http://i.imgur.com/1qqre4C.png\u0022\u003E\u003Cbr\u003E\n\u0022About what, Hudson Sir?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022g793Iat.png\u0022 src=\u0022http://i.imgur.com/g793Iat.png\u0022\u003E\u003Cbr\u003E\n\u0022The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E is not as innocent as they would have us believe.\u0022\u003Cbr\u003E\n\u0022You mean, sir?\u0022\u003Cbr\u003E\u003Cimg alt=\u00225cTdXgL.png\u0022 src=\u0022http://i.imgur.com/5cTdXgL.png\u0022\u003E\u003Cbr\u003E\n\u0022They really did build a nuclear missile silo on the Mun.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n==========================================================================\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe story of Project Intrepid will Continue...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAlso, some bloopers:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fRXZdUn.png\u0022 src=\u0022http://i.imgur.com/fRXZdUn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GxlBeF0.png\u0022 src=\u0022http://i.imgur.com/GxlBeF0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-09-12T00:13:48Z","Content":"\n\u003Cp\u003E\nThat is a big ship!!!\n\u003C/p\u003E\n\u003Cp\u003E\nLoooooooong chapter... \n\u003C/p\u003E\n\u003Cp\u003E\nWarning: Eve = \u003Cu\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/u\u003EIL!!! So the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E did build a giant nuclear missile silo on Mun. Who care? I have lots and lots of silos (plural) on Dres! And I want to blow them off the face of the planet with my nukes!!! YOU WILL PAY FOR DESTROYING THE \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E!!! ALL SHIPS OPEN FIRE!!! \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:72px;\u0022\u003EYOU WILL PAY FOR THAT!!! \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n10 minutes of rage later... How\u0027s the ship going to Dres doing? Please tell me! (Even you\u0027re probably just going to say it\u0027s on it\u0027s way and it will be a long time until it arrives.)\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-12T00:40:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222751695\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473639228\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10 minutes of rage later... How\u0027s the ship going to Dres doing? Please tell me! (Even you\u0027re probably just going to say it\u0027s on it\u0027s way and it will be a long time until it arrives.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s on its way and it will be a long time until it arrives. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure when. I might have forgotten to set the \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E alarm, but it\u0027s still probably en route. The Jool ship, though, is still a year away, and I really want to play with the ships I have in space right now for a while before I launch anything else. I\u0027ve got something going to (or at) each planet right now, so I\u0027ll be covered for awhile. I just needed a storyline reason not to launch anything. (Blowing up \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was WAAAAY more fun than it should have been.)\n\u003C/p\u003E\n"},{"CreatedByName":"spacebrick3","CreatedById":158990,"CreatedDateTime":"2016-09-12T00:50:03Z","Content":"\n\u003Cp\u003E\nHow many Kerbals do you have active right now? 50? 100? 200?\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-12T01:06:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222751732\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473641403\u0022 data-ipsquote-userid=\u0022158990\u0022 data-ipsquote-username=\u0022spacebrick3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, spacebrick3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow many Kerbals do you have active right now? 50? 100? 200?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is an interesting question. I\u0027m not at my KSP computer right now, so this is purely from memory (And I don\u0027t want to go and check every chapter right now).\n\u003C/p\u003E\n\u003Cp\u003E\n6 on the Duna Mission, counting Val.\n\u003C/p\u003E\n\u003Cp\u003E\nBetween five and eight (?) on the Jool mission.\n\u003C/p\u003E\n\u003Cp\u003E\nFour around Moho.\n\u003C/p\u003E\n\u003Cp\u003E\nFour en route to Dres.\n\u003C/p\u003E\n\u003Cp\u003E\nFive (ish) en route to Eeloo.\n\u003C/p\u003E\n\u003Cp\u003E\nFour on the Mun (Including Robo-Bill and Robo-Bob, although they aren\u0027t there in-game).\n\u003C/p\u003E\n\u003Cp\u003E\nNine in the two Eve ships.\n\u003C/p\u003E\n\u003Cp\u003E\nBetween 38 and 45\u002B Kerbals. (Also, the game managed to eat my Wernher Von Kerman I coded in).\n\u003C/p\u003E\n\u003Cp\u003E\nQuite a lot, although you haven\u0027t seen anything yet!\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-19T01:01:45Z","Content":"\n\u003Cp\u003E\nAllright. It\u0027s been a week (School and stuff) but I\u0027ve managed to get something done. Half of the most epic thing I\u0027ve ever done (And half of which is still to come) in KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nI present part 27, The Descent:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSection A, Transit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sWAQGXh.png\u0022 src=\u0022http://i.imgur.com/sWAQGXh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThree forces would soon converge on Eve. No, scratch that. Four. Although the fourth one would not reach Eve for quite some time. The \u0022Explorer\u0022 is not one of those forces. The \u0022Explorer\u0022 performed its course correction burn for Dres.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hsCds8T.png\u0022 src=\u0022http://i.imgur.com/hsCds8T.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022BHYZhAG.png\u0022 src=\u0022http://i.imgur.com/BHYZhAG.png\u0022\u003E\u003Cbr\u003E\nAround Moho, the former crew of the \u0022Magician\u0022 transferred to the IRV-002. The crew plotted a transfer to Eve.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227GVufhK.png\u0022 src=\u0022http://i.imgur.com/7GVufhK.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00221Dub2kH.png\u0022 src=\u0022http://i.imgur.com/1Dub2kH.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u002201oDvvf.png\u0022 src=\u0022http://i.imgur.com/01oDvvf.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022dNnLLFv.png\u0022 src=\u0022http://i.imgur.com/dNnLLFv.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThus formed the first of the four converging forces. The second was the \u0022Valentina,\u0022 the ship carrying the Eve Ascent Vehicle.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002241P7ILw.png\u0022 src=\u0022http://i.imgur.com/41P7ILw.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe Third force to depart was the \u0022Homecoming,\u0022 the 6 Kerbal sister ship of the Valentina. However, it still had its ring. It also carried the \u0022Gilly Hoppah,\u0022 the Gilly lander of the mission.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022s8A7mKS.png\u0022 src=\u0022http://i.imgur.com/s8A7mKS.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe \u0022Homecoming\u0022 was the first ship to arrive at Eve, and placed itself into an elliptical medium orbit.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022pFJF7iF.png\u0022 src=\u0022http://i.imgur.com/pFJF7iF.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u002202mMImK.png\u0022 src=\u0022http://i.imgur.com/02mMImK.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe second force to arrive at Eve was the \u0022Valentina.\u0022 It entered a slightly lower orbit than the \u0022Homecoming.\u0022\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u002201SDHq8.png\u0022 src=\u0022http://i.imgur.com/01SDHq8.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022IT2M5Of.png\u0022 src=\u0022http://i.imgur.com/IT2M5Of.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u00222IBtNKl.png\u0022 src=\u0022http://i.imgur.com/2IBtNKl.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe final force to arrive was the crew from Moho, consisting of two rescue crew, and two space pirates, who had taken over the rescue ship.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022P7mBGfa.png\u0022 src=\u0022http://i.imgur.com/P7mBGfa.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022z3LbG4m.png\u0022 src=\u0022http://i.imgur.com/z3LbG4m.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nA noteworthy thing to mention is that none of the crews in space had heard a peep from Kerbin in over 200 days. The last thing they had heard was a word from Houston, the mission controller. \u0022Oh, Moho! We\u0027re under attack!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lKTZOTa.png\u0022 src=\u0022http://i.imgur.com/lKTZOTa.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe crew of the IRV-002 had barely been able to make orbit. They made a plane change to rendezvous with the \u0022Homecoming\u0022 because it had a lander that could rescue them. And here, our story continues...\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022I6gF7om.png\u0022 src=\u0022http://i.imgur.com/I6gF7om.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n==================================================================================\u003Cbr\u003E\nSection B, Rescue\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022oPrYZ1c.png\u0022 src=\u0022http://i.imgur.com/oPrYZ1c.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022Hello? You\u0027re the rescue team, right? Well, actually half of my crew was our rescue team, but are you the rescue team for the rescue team?\u0022\u003Cbr\u003E\n\u0022Yes, I am. Carol Kerman, reporting in. Feel free to start sending over your crew. Four, right? I\u0027ve got five spare seats. What\u0027s your name, again?\u0022\u003Cbr\u003E\n\u0022Tomfurt. Yes, we have a crew of four. We\u0027ll send over the rescue team first. Allin and Ribwig.\u0022\u003Cbr\u003E\n\u0022Roger. Over and out.\u0022 Carol leaned away from the radio monitor. Space was boring, she had concluded after the 30th day of the mission. Since day 2, there had not been a peep from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. On day 38, there was a solar storm that wiped the computer banks. Not the important ones. Just the ones outside of the faraday cages. I.E, everyone\u0027s copies of Human Space Program. Since then, nothing exciting had happened. Except approaching Eve. It was now day 208 of the mission, and she had been chosen to pilot the Gilly Hoppah to rescue the crew of the IRV-002. Funny, they were supposed to return to Kerbin, not go to Eve.\n\u003C/p\u003E\n\u003Cp\u003E\n*Clang.* The airlock began opening, and a figure stepped in.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh, you must be Allin Kerman. Nice to meet you!\u0022 Finally, a new person after 200 days of the same 6 crew members.\u003Cbr\u003E\n\u0022Whatever he says, don\u0027t listen to him. He\u0027s a madman.\u0022\u003Cbr\u003E\n\u0022Sorry, what?\u0022\u003Cbr\u003E\n\u0022Tomfurt is a madman. He stole our ship and brought it to Eve. He speaks of artificial intelligence, other universes, and a strange quest to sample every single body in the solar system. Including Jool and the Sun.\u0022\u003Cbr\u003E\n\u0022Wait, he stole your ship?\u0022\u003Cbr\u003E\n\u0022YES! Now once we get Ribwig on board, we burn away. Straight towards which mothership is closer.\u0022\u003Cbr\u003E\n\u0022I want to hear more. For all I know, you\u0027re the madman.\u0022 Just then, the airlock clanged again and Ribwig entered.\u003Cbr\u003E\n\u0022Quick, before Milvy gets here! Lock the doors! Start the engines!\u0022\u003Cbr\u003E\n\u0022He\u0027s right. We need to get out of here before he takes over the entire Eve system!\u0022\u003Cbr\u003E\n\u0022Hold on, guys. Strange quest? Crazy people? Space pirates?\u0022\u003Cbr\u003E\n\u0022YES, that\u0027s what we\u0027ve been trying to tell you! I\u0027ve given you several reasons to go now!\u0022\u003Cbr\u003E\n\u0022No.\u0022 Carol broke into a grin. \u0022Space is boring. All you\u0027ve done is given me several reasons to stay. I want to hear what this \u0022madman\u0022 has to say.\u0022 Just then, the airlock made that clang sound again. Milvy Kerman and Tomfurt Kerman simultaneously entered.\u003Cbr\u003E\n\u0022Alright, surrender the vessel, Carol, or face the consequences!\u0022\u003Cbr\u003E\n\u0022Relax, Milvy. Wasn\u0027t really planning on resisting.\u0022\u003Cbr\u003E\n\u0022Really? Oh. Wait... why give up so easily?\u0022\u003Cbr\u003E\n\u0022Space is boring. Go ahead, take the ship. I just have one condition.\u0022\u003Cbr\u003E\n\u0022And what would that be?\u0022\u003Cbr\u003E\n\u0022Take me with you. I want some adventure, and I\u0027m guessing you\u0027ll be going places soon. I\u0027m stationed to be around Eve for the next few years. Really, it only goes upwards from here.\u0022\u003Cbr\u003E\n\u0022I just have one question for you, Carol.\u0022\u003Cbr\u003E\n\u0022Yes, Tomfurt?\u0022\u003Cbr\u003E\n\u0022Are you a scientist?\u0022\u003Cbr\u003E\n\u0022Well, yes. I suppose I am. Where to next?\u0022\u003Cbr\u003E\n\u0022Eve.\u0022\u003Cbr\u003E\n========================================================================================================\u003Cbr\u003E\nSection C, Piracy\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FOoAL62.png\u0022 src=\u0022http://i.imgur.com/FOoAL62.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nAllin and Ribwig were tied up in the back. Carol, Shercott, and Milvy were all piloting the ship.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022So, let me get this straight. The world\u0027s ending, and this monolith who watches over the universe told you to get a surface sample from every single body in the system, including Jool, the Sun, and a boulder that doesn\u0027t exist, and that combining these samples would create a new element that would allow travel through multiple dimensions? And Gravioli particles are a force that can change the laws of physics that works like magic, and the universe is running out of it? And the Kraken is real?\u0022\u003Cbr\u003E\n\u0022Yes, Carol. Way to sum up the plot! Also, we have a bit of a problem.\u0022\u003Cbr\u003E\n\u0022What would that be?\u0022\u003Cbr\u003E\n\u0022Our relative velocity to the \u0022Valentina\u0022 is 1200 meters per second. We have 1100 meters per second in the tanks.\u0022\u003Cbr\u003E\n\u0022That is very bad news.\u0022\u003Cbr\u003E\u003Cimg alt=\u00223MhjnGa.png\u0022 src=\u0022http://i.imgur.com/3MhjnGa.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u002290q2aml.png\u0022 src=\u0022http://i.imgur.com/90q2aml.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022Send out a distress signal. They don\u0027t know we\u0027ve taken the ship over yet.\u0022\u003Cbr\u003E\n\u0022Good idea. Attention, Gene and Leah of the ITV-018 \u0022Valentina,\u0022 we are going to run out of fuel before our velocities equalize. Please acknowledge.\u0022\u003Cbr\u003E\n\u0022This is Gene. We read you loud and clear. We\u0027ll try to burn, but it\u0027s going to take us a full 30 seconds to turn.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Okay, gang. Now all we can do is wait.\u0022\u003Cbr\u003E\n\u0022I\u0027ve shut off the engines with 29m/s remaining so we can dock.\u0022\u003Cbr\u003E\n\u0022But isn\u0027t the port taken by the Eve Ascent Vehicle?\u0022\u003Cbr\u003E\n\u0022Exactly.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022zkCmOgF.png\u0022 src=\u0022http://i.imgur.com/zkCmOgF.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00228uRGisz.png\u0022 src=\u0022http://i.imgur.com/8uRGisz.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022NxMu7qk.png\u0022 src=\u0022http://i.imgur.com/NxMu7qk.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022Wow, that was close. Crew, begin EVAing over into the Eve Ascent Vehicle.\u0022\u003Cbr\u003E\n\u0022Roger. What should we do with Allin and Ribwig?\u0022\u003Cbr\u003E\n\u0022I\u0027ll leave last and untie them. They can dock once we depart.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022crREwOJ.png\u0022 src=\u0022http://i.imgur.com/crREwOJ.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022h09GpkM.png\u0022 src=\u0022http://i.imgur.com/h09GpkM.png\u0022\u003E\u003Cbr\u003E\n\u0022Allright, Gene and Leah. My name is Milvy Kerman. Long story short, we are stealing your Eve Ascent Vehicle.\u0022\u003Cbr\u003E\n\u0022What?\u0022\u003Cbr\u003E\n\u0022Yes. Now please get into it.\u0022\u003Cbr\u003E\n\u0022Sorry?\u0022\u003Cbr\u003E\n\u0022Gene. Get. In. The. Eve. Ascent. Vehicle.\u0022 the airlock clanged, and Tomfurt and Carol entered.\u003Cbr\u003E\n\u0022Why do you need us, though?\u0022 Gene had his hands up. \u0022I wasn\u0027t on the Eve list!\u0022\u003Cbr\u003E\n\u0022Simple. Leah is the only one who knows how to fly this thing, and the moment we leave, Allin and Ribwig are going to dock to the \u0022Valentina.\u0022 When they do, they\u0027d run and abandon us. You, Gene, Senior mission controller of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, are our hostage. They wouldn\u0027t abandon you, the most important person in space.\u0022\u003Cbr\u003E\n\u0022As Senior mission controller, I order you to not steal a \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E vehicle!\u0022\u003Cbr\u003E\n\u0022Uh, sorry. We\u0027ve already stolen two. I don\u0027t see how a third will make any difference.\u0022\u003Cbr\u003E\n\u0022This is an \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E ASCENT VEHICLE. There has never been a successful one in history. Why?\u0022\u003Cbr\u003E\n\u0022Long story. Tomfurt, for the universe\u0027s sake, needs to obtain a surface sample from Eve.\u0022\u003Cbr\u003E\n\u0022Well, you could have just asked for one!\u0022\u003Cbr\u003E\n\u0022Yes. But this is more fun.\u0022\u003Cbr\u003E\n====================================================================================\u003Cbr\u003E\nSection D, Entry\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022P3xDDJ7.png\u0022 src=\u0022http://i.imgur.com/P3xDDJ7.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022Now this is interesting.\u0022\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022B70nVUe.png\u0022 src=\u0022http://i.imgur.com/B70nVUe.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022EAV 3 is a boring name. What should we call it?\u0022\u003Cbr\u003E\n\u0022How about Dragon?\u0022\u003Cbr\u003E\n\u0022Sure. That sounds good. Although \u0022Phoenix\u0022 would be more appropriate, as we are ascending from Eve...\u0022\u003Cbr\u003E\n\u0022Dragon is a bit of lore from Human Space Program, though.\u0022\u003Cbr\u003E\n\u0022Dragon it is!\u0022\u003Cbr\u003E\n===========================================================================================\u003Cbr\u003E\u003Cimg alt=\u0022kRQmAHR.png\u0022 src=\u0022http://i.imgur.com/kRQmAHR.png\u0022\u003E\u003Cbr\u003E\nAllin and Ribwig were having a tough time getting docked to the \u0022Valentina.\u0022 It slowly had begun to oscillate, back and forth, in a way that reminded them of that 2.2 Kilometer long truss that had done exactly the same and then disappeared, a term coined \u0022Kraken attack.\u0022 But surely, the Kraken was a myth. They docked eventually.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ship began to oscillate again. Surely, the madman couldn\u0027t be right. The Kraken couldn\u0027t possibly be real.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then, an ominous, yet invisible voice rippled through the universe, and the oscillating stopped. For a while, at least.\u003Cbr\u003E\n============================================================================================\u003Cbr\u003E\n\u0027Leah, you can land this thing, right?\u0022\u003Cbr\u003E\n\u0022I don\u0027t know! We departed from an orbit ten times higher than in the simulations!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022bZ4rXSo.png\u0022 src=\u0022http://i.imgur.com/bZ4rXSo.png\u0022\u003E\u003Cbr\u003E\n\u0022Well, there\u0027s no going back now.\u0022\u003Cbr\u003E\n\u0022You said that right! We\u0027re going to die because of you!\u0022\u003Cbr\u003E\n*KABOOMKABOOMKABOOMKABOOM*\u003Cbr\u003E\n\u0022What was that?\u0022\u003Cbr\u003E\n\u0022The orbital power package! It never exploded in the tests!\u0022\u003Cbr\u003E\n\u0022The what?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022WqgsyE1.png\u0022 src=\u0022http://i.imgur.com/WqgsyE1.png\u0022\u003E\u003Cbr\u003E\n\u0022The battery and solar panel and reaction wheels!\u0022\u003Cbr\u003E\n\u0022Oh.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022zwZ00xF.png\u0022 src=\u0022http://i.imgur.com/zwZ00xF.png\u0022\u003E\u003Cbr\u003E\n\u0022Are the temperature gauges for the landing gear supposed to read \u002299%?\u0022\u003Cbr\u003E\n\u0022AAGGHH! Start spinning the craft!\u0022\u003Cbr\u003E\n\u0022How will that help?\u0022\u003Cbr\u003E\n\u0022It breaks the laws of physics but it works!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022fxzh6ZL.png\u0022 src=\u0022http://i.imgur.com/fxzh6ZL.png\u0022\u003E\u003Cbr\u003E\n\u00223 things.\u0022\u003Cbr\u003E\n\u0022Shoot.\u0022\u003Cbr\u003E\n\u0022We\u0027re below 63 Kilometers.\u0022\u003Cbr\u003E\n\u0022Yes?\u0022\u003Cbr\u003E\n\u0022That\u0027s the lowest altitude a Kerbal has ever flown on Eve!\u0022\u003Cbr\u003E\n\u0022In what?\u0022\u003Cbr\u003E\n\u0022There was this thing - called the \u0022Atmosferikdipperkraft\u0022 or something.\u0022\u003Cbr\u003E\n\u0022What was it?\u0022\u003Cbr\u003E\n\u0022Oh, someone wrote a graphic novel about a trip to Eve and someone took it seriously and actually built the thing even when it totally failed in the novel! No offense to the novel, though.\u0022\u003Cbr\u003E\n\u0022Eve: Order Zero?\u0022 I loved that! It\u0027s antique now, and I just loved the conclusion to that Jool novel and the other ones after that.\u0022\u003Cbr\u003E\n\u0022Stay on topic! The thing somehow worked out. We\u0027re below 3 kilometers per second, but we might land in the ocean!\u0022\u003Cbr\u003E\n\u0022That\u0027s bad, right?\u0022\u003Cbr\u003E\n\u0022Very bad.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022eB8eZGf.png\u0022 src=\u0022http://i.imgur.com/eB8eZGf.png\u0022\u003E\u003Cbr\u003E\n\u0022Okay. Never mind. We\u0027re landing on land.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022ZGnwMju.png\u0022 src=\u0022http://i.imgur.com/ZGnwMju.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00224UWg6es.png\u0022 src=\u0022http://i.imgur.com/4UWg6es.png\u0022\u003E\u003Cbr\u003E\n\u0022Okay, let\u0027s jettison the heat shields and deploy the first set of drogue chutes.\u0022\u003Cbr\u003E\n*BANGBANG*\u003Cbr\u003E\n\u0022What was that?\u0022\u003Cbr\u003E\n\u0022The shield decoupler hit the engines. I\u0027m throttling up a bit to blow up the shield, as it\u0027s sticking to the bottom of the craft.\u0022\u003Cbr\u003E\n*BANG*\u003Cbr\u003E\n\u0022Hey, that actually worked!\u0022\u003Cbr\u003E\n\u0022What do you mean?\u0022\u003Cbr\u003E\n\u0022It only worked half the time in the tests.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022yrLF4tb.png\u0022 src=\u0022http://i.imgur.com/yrLF4tb.png\u0022\u003E\u003Cbr\u003E\n\u0022Chutes out! Wow, we\u0027re going way faster than in the tests. Deploying more.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022DAsNFuD.png\u0022 src=\u0022http://i.imgur.com/DAsNFuD.png\u0022\u003E\u003Cbr\u003E\n\u0022Still too fast for the mains!\u0022\u003Cbr\u003E\n\u0022Relax. The drogues haven\u0027t fully deployed yet!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022rtU4kU1.png\u0022 src=\u0022http://i.imgur.com/rtU4kU1.png\u0022\u003E\u003Cbr\u003E\n\u0022I\u0027m deploying them anyway!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022haBWjDY.png\u0022 src=\u0022http://i.imgur.com/haBWjDY.png\u0022\u003E\u003Cbr\u003E\n\u0022Gear deployed! Oh - the surface is 1KM ASL.\u0022\u003Cbr\u003E\n\u0022Is that bad?\u0022\u003Cbr\u003E\n\u0022We\u0027ve used more fuel than we should have. In the sims, the lowest altitude we reached orbit from was 1500m!\u0022\u003Cbr\u003E\n\u0022The mains have deployed!\u0022\u003Cbr\u003E\u003Cimg alt=\u00224LFBZCm.png\u0022 src=\u0022http://i.imgur.com/4LFBZCm.png\u0022\u003E\u003Cbr\u003E\n\u0022Five hundred meters!\u0022\u003Cbr\u003E\n\u0022Permission to panic?\u0022\u003Cbr\u003E\n\u0022Granted, to all four of you.\u0022\u003Cbr\u003E\n\u0022AAAAAAAAAA-\u0022\u003Cbr\u003E\n\u0022AAAAAAAHHHHHHHHHHHHH-\u0022\u003Cbr\u003E\n\u0022BBBAAAAAAAAAAAAAWHAAAAAAAA\u0022\u003Cbr\u003E\n\u0022GGGEEEERRRRROOOONNNNNIIIIMMMMOOOOOO!!!!!\u0022\u003Cbr\u003E\n\u0022Three hundred meters!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022j11QtJ8.png\u0022 src=\u0022http://i.imgur.com/j11QtJ8.png\u0022\u003E\u003Cbr\u003E\n\u0022AAAAAAAAAAAAAAAAAAAAAAA\u0022\u003Cbr\u003E\n\u0022Two hundred meters!\u0022\u003Cbr\u003E\n\u0022Brace for impact!\u0022\u003Cbr\u003E\n\u0022Fifty meters! Starting engines!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022qM0jAti.png\u0022 src=\u0022http://i.imgur.com/qM0jAti.png\u0022\u003E\u003Cbr\u003E\n\u0022WHHHHHHHAAAAAAAAAAAA-\u0022\u003Cbr\u003E\n\u0022We bounced! The engines are stuck on!\u0022\u003Cbr\u003E\u003Cimg alt=\u002275gxzqg.png\u0022 src=\u0022http://i.imgur.com/75gxzqg.png\u0022\u003E\u003Cbr\u003E\n\u0022AAAAAAAAAAAAAAAAAAAAAAAAA-\u0022\u003Cbr\u003E\u003Cimg alt=\u002275gxzqg.png\u0022 src=\u0022http://i.imgur.com/75gxzqg.png\u0022\u003E\u003Cbr\u003E\n\u0022WE\u0027RE GOING TO TIP!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022BLyWUzc.png\u0022 src=\u0022http://i.imgur.com/BLyWUzc.png\u0022\u003E\u003Cbr\u003E\n\u0022Comeoncomeoncomeoncomeon -\u0022\u003Cbr\u003E\u003Cimg alt=\u0022F9kq6yt.png\u0022 src=\u0022http://i.imgur.com/F9kq6yt.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022Good morning, kerbonauts, space pirates and management personnel. This is your pilot speaking.\u0022\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022BWasVUK.png\u0022 src=\u0022http://i.imgur.com/BWasVUK.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022Welcome to Planet Eve!\u0022\u003Cbr\u003E\u003Cbr\u003E\n=================================================================\u003Cbr\u003E\u003Cimg alt=\u0022XruXEG5.png\u0022 src=\u0022http://i.imgur.com/XruXEG5.png\u0022\u003E\u003Cbr\u003E\n\u0022We\u0027re leaving together - \u0022\u003Cbr\u003E\u003Cimg alt=\u0022qvcf16P.png\u0022 src=\u0022http://i.imgur.com/qvcf16P.png\u0022\u003E\u003Cbr\u003E\n\u0022But still it\u0027s farewell - \u0022\u003Cbr\u003E\u003Cimg alt=\u0022DMwYPSu.png\u0022 src=\u0022http://i.imgur.com/DMwYPSu.png\u0022\u003E\u003Cbr\u003E\n\u0022And maybe we\u0027ll come back - \u0022\u003Cbr\u003E\u003Cimg alt=\u0022WgQnBpH.png\u0022 src=\u0022http://i.imgur.com/WgQnBpH.png\u0022\u003E\u003Cbr\u003E\n\u0022To Kerbin, who can tell?\u0022\u003Cbr\u003E\u003Cimg alt=\u00223ncRcn5.png\u0022 src=\u0022http://i.imgur.com/3ncRcn5.png\u0022\u003E\u003Cbr\u003E\n\u0022I guess there is no one to blame - \u0022\u003Cbr\u003E\u003Cimg alt=\u0022NBfgrfe.png\u0022 src=\u0022http://i.imgur.com/NBfgrfe.png\u0022\u003E\u003Cbr\u003E\n\u0022We\u0027re leaving ground!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022yYc7jPg.png\u0022 src=\u0022http://i.imgur.com/yYc7jPg.png\u0022\u003E\u003Cbr\u003E\n\u0022Will things ever be the same again?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022AniE5se.png\u0022 src=\u0022http://i.imgur.com/AniE5se.png\u0022\u003E\u003Cbr\u003E\n\u0022It\u0027s the final countdown!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022hJhkiRZ.png\u0022 src=\u0022http://i.imgur.com/hJhkiRZ.png\u0022\u003E\u003Cbr\u003E\n\u0022Three down - fifteen to go.\u0022\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe Story of Project Intrepid will Continue...\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-09-19T02:06:18Z","Content":"\n\u003Cp\u003E\nNice references! This is 50 years later, so I suppose that your Kerbals would already know the ending. We don\u0027t though... Only \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111501-kuzzter/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111501\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111501-kuzzter/\u0022 rel=\u0022\u0022\u003E@Kuzzter\u003C/a\u003E does...\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-20T00:56:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222764050\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474250778\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNice references! This is 50 years later, so I suppose that your Kerbals would already know the ending. We don\u0027t though... Only \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111501-kuzzter/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111501\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111501-kuzzter/\u0022 rel=\u0022\u0022\u003E@Kuzzter\u003C/a\u003E does...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHaha! I wish I knew the ending.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, was I the only one who was inspired by Eve: Order Zero to go and build my own dipperkraft? Because I did. And my Gilly Lander looked suspiciously similar to Kuzzter\u0027s... I\u0027ll see if I can dig out the screenshots.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-25T22:28:06Z","Content":"\n\u003Cp\u003E\nHello, just an update. You may not see a new part for a while, just a heads up. The screenshots for the next few parts are ready, but the issue is having a long enough stretch of time to write. Weekends are usually a good time to do this (I\u0027ve got school during the week) but I spent this weekend working on something else.\n\u003C/p\u003E\n\u003Cp\u003E\nThat being said, I might have a day where I\u0027m doing nothing and part 28 might come tomorrow. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-27T02:24:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222774165\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474842486\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎9‎/‎25‎/‎2016 at 5:28 PM, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat being said, I might have a day where I\u0027m doing nothing and part 28 might come tomorrow. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, look at me! Predicting the future!\n\u003C/p\u003E\n\u003Cp\u003E\nAlthough, this isn\u0027t really the full part 28. I only used 1.5 out of the 5 albums I uploaded so far. I was a bit short on time. So, here is a somewhat shorter part! Enjoy!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPart 28: Sunset on Eve!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nProject report: Operation SB-99\n\u003C/p\u003E\n\u003Cp\u003E\nFlat Kerbin Society\n\u003C/p\u003E\n\u003Cp\u003E\nReport by Jonfrey Kerman\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sort of new to the report business, but I\u0027ll do the best that I can. The previous person who did this job was an intern who disappeared around the same time as the chief designer. So, Operation SB-99 was another attempt by the society to prove that Kerbin was flat. It consisted of four separate launches.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HtdY39U.png\u0022 src=\u0022http://i.imgur.com/HtdY39U.png\u0022\u003E\u003Cbr\u003E\nExperiment A, shown here, was a simple rocket designed to fly as high as possible to photograph the anomaly in all camera lenses which causes the horizon to warp at high altitudes.\u003Cbr\u003E\u003Cimg alt=\u0022uVYcbxK.png\u0022 src=\u0022http://i.imgur.com/uVYcbxK.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022KrfqAZW.png\u0022 src=\u0022http://i.imgur.com/KrfqAZW.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022uHk5Mkt.png\u0022 src=\u0022http://i.imgur.com/uHk5Mkt.png\u0022\u003E\u003Cbr\u003E\nAt this point in the flight, our theory of glass-warping was further supported by the camera attached to the third stage. We waited for it to fall back to Kerbin at this point.\u003Cbr\u003E\u003Cimg alt=\u0022ywKml5R.png\u0022 src=\u0022http://i.imgur.com/ywKml5R.png\u0022\u003E\u003Cbr\u003E\nHowever, it didn\u0027t fall. It just kept going.\u003Cbr\u003E\u003Cimg alt=\u0022wQTmRg0.png\u0022 src=\u0022http://i.imgur.com/wQTmRg0.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u002259f75N0.png\u0022 src=\u0022http://i.imgur.com/59f75N0.png\u0022\u003E\u003Cbr\u003E\nAt this point, communication was lost. Experiment B was designed to send a Kerbal up into the high atmosphere with a non-glass visor to attempt to view the true flat Kerbin.\u003Cbr\u003E\u003Cimg alt=\u0022STIdrYF.png\u0022 src=\u0022http://i.imgur.com/STIdrYF.png\u0022\u003E\u003Cbr\u003E\nContrary to popular belief, our engineers did not stick three planes together, even though it looks like that.\u003Cbr\u003E\u003Cimg alt=\u0022iBPL6gv.png\u0022 src=\u0022http://i.imgur.com/iBPL6gv.png\u0022\u003E\u003Cbr\u003E\nHowever, shortly into the flight the vehicle suffered loss of thrust in several engines and an aerodynamic anomaly.\u003Cbr\u003E\u003Cimg alt=\u0022xKjJgF0.png\u0022 src=\u0022http://i.imgur.com/xKjJgF0.png\u0022\u003E\u003Cbr\u003E\nThe pilot maintains that the non-glass window and visor did not have any effect on Kerbin\u0027s false appearance. It was determined that Experiment C should test whether the unaided Kerbal eye sees Kerbin as it truly is. Experiment B landed safely.\u003Cbr\u003E\u003Cimg alt=\u0022QW4InjN.png\u0022 src=\u0022http://i.imgur.com/QW4InjN.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022HEdlDrc.png\u0022 src=\u0022http://i.imgur.com/HEdlDrc.png\u0022\u003E\u003Cbr\u003E\nExperiment C was composed of a large capsule designed to hold the council members of the Flat Kerbin Society and allow them a one second glimpse of Kerbin\u0027s horizon unhindered by visors or windows - however, such a maneuver is dangerous. The lifter was made up of seven cores from old missiles. It was determined that is was not aerodynamically stable, and the mission was aborted.\u003Cbr\u003E\u003Cimg alt=\u0022hCxBdj8.png\u0022 src=\u0022http://i.imgur.com/hCxBdj8.png\u0022\u003E\u003Cbr\u003E\nExperiment C2 was a more advanced Experiment C, with larger fins as well as more fuel.\u003Cbr\u003E\u003Cimg alt=\u0022S6CwnbJ.png\u0022 src=\u0022http://i.imgur.com/S6CwnbJ.png\u0022\u003E\u003Cbr\u003E\nIt flew to great heights in the upper atmosphere, and the council members performed their experiment.\u003Cbr\u003E\u003Cimg alt=\u0022JennR9h.png\u0022 src=\u0022http://i.imgur.com/JennR9h.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00226UoAHR8.png\u0022 src=\u0022http://i.imgur.com/6UoAHR8.png\u0022\u003E\u003Cbr\u003E\nThey landed without problem.\u003Cbr\u003E\u003Cimg alt=\u0022NASecLW.png\u0022 src=\u0022http://i.imgur.com/NASecLW.png\u0022\u003E\u003Cbr\u003E\nHowever, soon after landing the councilmembers disembarked the vessel with concerned expressions and immediately declared that the secret bunker be made available for a priority one meeting.\u003Cbr\u003E\n========================================================================\u003Cbr\u003E\n\u0022Get a load of this nonsense.\u0022\u003Cbr\u003E\n\u0022I know, Gidrien. The Flat Kerbin Society is absolutely ridiculous.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022mm0XfYp.png\u0022 src=\u0022http://i.imgur.com/mm0XfYp.png\u0022\u003E\u003Cbr\u003E\nGidrien and Shercott were out on a routine science mission to the side of the Duna canyon in the Duna rover. It had been 200 days since they last saw Jeb. Everyone was worried. Bob maintained that he\u0027d show up eventually; he was Jeb. By now it was well known that he went off in search of his sister.\u003Cbr\u003E\n\u0022I mean, seriously! can\u0027t that report writer realize that the council saw a round Kerbin? That would perfectly explain their concerned looks and the secret meeting!\u0022\u003Cbr\u003E\n\u0022Gidrien, some people just can\u0027t be reasoned with.\u0022\u003Cbr\u003E\n\u0022I know.\u0022\u003Cbr\u003E\n\u0022How did we even get these reports?\u0022\u003Cbr\u003E\n\u0022They haven\u0027t figured how to turn off the automatic uploading.\u0022\u003Cbr\u003E\n\u0022Ah.\u0022\u003Cbr\u003E\n============================================================================\u003Cbr\u003E\nMeanwhile at Eve, there was a bit of a crisis.\u003Cbr\u003E\u003Cimg alt=\u0022DYJtFlN.png\u0022 src=\u0022http://i.imgur.com/DYJtFlN.png\u0022\u003E\u003Cbr\u003E\n\u0022Leah, status report.\u0022\u003Cbr\u003E\n\u0022Well, Tomfurt, there are quite a few issues. First off, you had to steal this thing.\u0022\u003Cbr\u003E\n\u0022For a good reason. You just don\u0027t understand yet.\u0022\u003Cbr\u003E\n\u0022You denied four others the chance to walk on Eve!\u0022\u003Cbr\u003E\n\u0022Sorry. But I only denied three.\u0022\u003Cbr\u003E\n\u0022Gene wasn\u0027t slated to land.\u0022\u003Cbr\u003E\n\u0022Oh. My bad. What else is wrong?\u0022\u003Cbr\u003E\n\u0022We had to replant the flag. The first one got knocked over by the lander - it\u0027s slowly sliding downhill.\u0022\u003Cbr\u003E\n\u0022Great.\u0022\u003Cbr\u003E\n\u0022Third thing - we might not have enough fuel to get back into orbit. We\u0027re really close to sea level, and we\u0027ve used up more fuel then planned in the landing.\u0022\u003Cbr\u003E\n\u0022Don\u0027t worry about that, I can fix it if we need to.\u0022\u003Cbr\u003E\n\u0022How?\u0022\u003Cbr\u003E\n\u0022None of your business.\u0022\u003Cbr\u003E\n\u0022Fourth - we have detected a leak in the port side stage Composite Overwrapped Pressure Vessel.\u0022\u003Cbr\u003E\n\u0022The what?\u0022\u003Cbr\u003E\n\u0022The COPV, it\u0027s a helium tank that fills up the space that is made when the fuel is burnt.\u0022\u003Cbr\u003E\n\u0022Okay?\u0022\u003Cbr\u003E\n\u0022It\u0027s a major problem. Helium is leaking out of the tank, as well as the actual fuel tanks because there was already some fuel burned.\u0022\u003Cbr\u003E\n\u0022Yeah?\u0022\u003Cbr\u003E\n\u0022If we spend more than three days on Eve, the fuel tanks will implode and render the vehicle useless.\u0022\u003Cbr\u003E\n\u0022Ouch. So we spend less than three days here. I don\u0027t really see the problem.\u0022\u003Cbr\u003E\n\u0022The problem? We have to cram sixty days of science mission into three days.\u0022\u003Cbr\u003E\n\u0022Okay!\u0022\u003Cbr\u003E\n\u0022With my trained crew of professionals it would have been no problem, but I\u0027m the only one here qualified for this. You and your buddy were trained for Moho, Carol was only supposed to go to Gilly, and Gene here was just supposed to oversee everything.\u0022\u003Cbr\u003E\n\u0022On the plus side, we get to be the first Kerbals to witness the Evian sunset.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022kkaKZvu.png\u0022 src=\u0022http://i.imgur.com/kkaKZvu.png\u0022\u003E\u003Cbr\u003E\nTomfurt was right. The sunset on Eve turned out to be spectacular.\u003Cbr\u003E\u003Cimg alt=\u0022pwdR2Ko.png\u0022 src=\u0022http://i.imgur.com/pwdR2Ko.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022xhrJjs2.png\u0022 src=\u0022http://i.imgur.com/xhrJjs2.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022cB03NUq.png\u0022 src=\u0022http://i.imgur.com/cB03NUq.png\u0022\u003E\u003Cbr\u003E\nThe sky turned green. Then faded to stars. However, there was no sleep for the five lone inhabitants of Eve - they frantically scurried around setting up experiments and collecting samples. Days on Eve were long. So shortly after the sun rose, it was already two and a half days into the mission. Nearly time to go.\u003Cbr\u003E\u003Cimg alt=\u0022aLauzg4.png\u0022 src=\u0022http://i.imgur.com/aLauzg4.png\u0022\u003E\u003Cbr\u003E\n\u0022I\u0027m headed up the ladder.\u0022\u003Cbr\u003E\n\u0022Okay, Leah. Start her up.\u0022\u003Cbr\u003E\n\u0022Liftoff in thirty minutes.\u0022\u003Cbr\u003E\n\u0022Roger.\u0022\u003Cbr\u003E\n\u0022Gene, are you okay?\u0022\u003Cbr\u003E\n\u0022I, uh, yes. I just need to go get one more sample.\u0022\u003Cbr\u003E\n\u0022Okay then.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022nbWpzgD.png\u0022 src=\u0022http://i.imgur.com/nbWpzgD.png\u0022\u003E\u003Cbr\u003E\nAnd then Gene ran. Far away enough before he collapsed from exhaustion.\u003Cbr\u003E\u003Cimg alt=\u0022RO4ZG9M.png\u0022 src=\u0022http://i.imgur.com/RO4ZG9M.png\u0022\u003E\u003Cbr\u003E\nSlowly becoming sane again, he sat up, panting. He couldn\u0027t go on with this. He wasn\u0027t built for it. He realized he had to return to the lifter and face his greatest fear.\u003Cbr\u003E\u003Cimg alt=\u0022EX5OQoz.png\u0022 src=\u0022http://i.imgur.com/EX5OQoz.png\u0022\u003E\u003Cbr\u003E\nAnd the truth was, Gene Kerman was deathly afraid of heights.\u003Cbr\u003E\u003Cimg alt=\u0022RQN4Yfs.png\u0022 src=\u0022http://i.imgur.com/RQN4Yfs.png\u0022\u003E\u003Cbr\u003E\nHe clung to the ladder, deathly afraid of falling. Even falling from a few meters up on Eve could be deadly. Fortunately, he reached the top. He shut his reflective visor so the others would not see his terrified expression.\u003Cbr\u003E\u003Cimg alt=\u0022X6SD9eq.png\u0022 src=\u0022http://i.imgur.com/X6SD9eq.png\u0022\u003E\u003Cbr\u003E\n\u0022Hey, Gene! What took you so long?\u0022\u003Cbr\u003E\n\u0022I, uh, nothing. Just had to go a bit farther than I expected.\u0022\u003Cbr\u003E\n\u0022You cut it awfully close. Liftoff is in four minutes. I was just about to retract the ladders when you got here!\u0022\u003Cbr\u003E\n\u0022You\u0027re scaring me. Stop.\u0022\u003Cbr\u003E\n\u0022Okay, Gene. Hey, you always seem to have the right kind of music for situations like this. I could use some right now to make this moment a bit more epic, you know.\u0022\u003Cbr\u003E\n\u0022Thanks, I could use a distraction right now. Hey, we\u0027re in a ship called \u0022Dragon,\u0022 right? I\u0027ve got this cool piece of music called \u003Ca href=\u0022https://www.youtube.com/watch?v=EptSSXNHIfg\u0022 rel=\u0022external nofollow\u0022\u003E\u0022Dragon Rider\u0022\u003C/a\u003E if you want to play it. Start it 24 seconds before liftoff.\u0022\u003Cbr\u003E\n\u0022If you insist! Liftoff in one minute. Retracting ladders.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022yUEtZ0k.png\u0022 src=\u0022http://i.imgur.com/yUEtZ0k.png\u0022\u003E\u003Cbr\u003E\n\u0022Ladders have been retracted. T-40 seconds.\u0022\u003Cbr\u003E\n\u0022Run me through the procedure really quickly again, Leah.\u0022\u003Cbr\u003E\n\u0022Within a second of each other, I need to close the gear, detach everything, and slam the engines on.\u0022\u003Cbr\u003E\n\u0022Okay. T-29 seconds. Music ready?\u0022\u003Cbr\u003E\n\u0022Music... on!\u0022\u003Cbr\u003E\n\u0022Whoever is listening in on this transmission, this is Leah Kerman, pilot of EAV DRAGON. We are ready for takeoff!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nFar across the system, many souls heard her voice. The Jool crew, the Dres crew. The Eeloo crew, and the Duna crew. Even the four on the Mun. They all stared in hope at the screens they were watching, knowing full well, because of the light speed delay, everything shown had already happened.\u003Cbr\u003E\u003Cbr\u003E\n\u0022Five! Four! Three! Two! One!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022MycYme5.png\u0022 src=\u0022http://i.imgur.com/MycYme5.png\u0022\u003E\u003Cbr\u003E\n\u0022GERONIMO!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022XcmB3Qr.png\u0022 src=\u0022http://i.imgur.com/XcmB3Qr.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022V54MnnN.png\u0022 src=\u0022http://i.imgur.com/V54MnnN.png\u0022\u003E\u003Cbr\u003E\n\u0022Attention all listeners - \u0022\u003Cbr\u003E\u003Cimg alt=\u0022TuN2q8Z.png\u0022 src=\u0022http://i.imgur.com/TuN2q8Z.png\u0022\u003E\u003Cbr\u003E\n\u0022The Dragon has taken flight.\u0022\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe story of Project Intrepid will Continue...\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-09-27T02:33:22Z","Content":"\n\u003Cp\u003E\nThe world isn\u0027t a sphere! It\u0027s an ellipsoid! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I\u0027m actually still waiting for some of the photos to load though... THE DRAGON!!! Nice name! My current EAV is called the OMGWHYDOESTHISKEEPEXPLODING?!? Yes, I actually named it that... Nice chapter (even though half the photos still aren\u0027t loaded)!\n\u003C/p\u003E\n"},{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2016-09-28T10:06:15Z","Content":"\n\u003Cp\u003E\nThis is an awesome thread. Love the story. Thanks for all the time you put into it.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-28T20:44:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222777713\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475057175\u0022 data-ipsquote-userid=\u0022167187\u0022 data-ipsquote-username=\u0022Magzimum\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Magzimum said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is an awesome thread. Love the story. Thanks for all the time you put into it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you very much, this comment made my day. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rlin","CreatedById":156783,"CreatedDateTime":"2016-09-29T03:33:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222751589\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473633685\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/11/2016 at 3:41 PM, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022NO. NO. NO. This is something completely separate. If we didn\u0027t run out of alphabet, this would have been there. But we ran out of alphabet. Plan Omega better work. I designed it.\u0022\u003Cbr\u003E\n\u0022Remember when everybody laughed at us for naming our nuclear biplanes after a comic book?\u0022\u003Cbr\u003E\n\u0022GRAPHIC NOVEL. Not comic book. Those biplanes were an embarrassment to the Flat Kerbin Society.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLet me guess. Plan Kappa?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the FKS needs \u003Cimg alt=\u0022:science:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/science.png\u0022 title=\u0022:science:\u0022\u003E. (and needs to stop disbelieving what their eyes see)\n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-09-29T04:19:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222778987\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475120026\u0022 data-ipsquote-userid=\u0022156783\u0022 data-ipsquote-username=\u0022rlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, rlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLet me guess. Plan Kappa?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the FKS needs \u003Cimg alt=\u0022:science:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/science.png\u0022 title=\u0022:science:\u0022\u003E. (and needs to stop disbelieving what their eyes see)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhere are they even getting all the \u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022\u003E to build a rocket and just burn \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E to escape velocity? \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E, can you please post a picture of its orbit? I\u0027m guessing it\u0027s never returning to Kerbin.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-29T21:28:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222778987\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475120026\u0022 data-ipsquote-userid=\u0022156783\u0022 data-ipsquote-username=\u0022rlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, rlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLet me guess. Plan Kappa?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes. Now I feel a need to actually go and build nuclear biplanes now... If only I didn\u0027t have lots of homework. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222779017\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475122762\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhere are they even getting all the \u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022\u003E to build a rocket and just burn \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E to escape velocity? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI haven\u0027t officially mentioned it yet, but in my head they are piecing rockets together out of whatever was laying in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222779017\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475122762\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E, can you please post a picture of its orbit? I\u0027m guessing it\u0027s never returning to Kerbin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI assume you\u0027re talking about Experiment A. Luckily, I thought to take a screenshot of that. Just goes to show how I\u0027ll take 150 screenshots and only 50 of them make it in. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022U3caXtT.png\u0022 src=\u0022http://i.imgur.com/U3caXtT.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nYeah, that won\u0027t be coming back for a while.\u003Cbr\u003E\u003Cbr\u003E\nNow, just need to find time for Part 29!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-29T21:29:08Z\u0022 title=\u002209/29/2016 09:29  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 29, 2016\u003C/time\u003E by Ultimate Steve\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-30T01:19:23Z","Content":"\n\u003Cp\u003E\nOkay, Part 29: Return from Eve!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JmDjYS8.png\u0022 src=\u0022http://i.imgur.com/JmDjYS8.png\u0022\u003E\u003Cbr\u003E\n\u0022AAAAAAAAAAAAA-\u0022\u003Cbr\u003E\n\u0022Oh my, the ship\u0027s vibrating!\u0022\u003Cbr\u003E\n\u0022Do you think I didn\u0027t notice, Carol?\u0022\u003Cbr\u003E\n\u0022Oh, I think I\u0027m going to barf!\u0022\u003Cbr\u003E\n\u0022Grab a barf bag, then!\u0022\u003Cbr\u003E\n\u0022I\u0027m wearing a helmet, Tomfurt!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022GUHKCe2.png\u0022 src=\u0022http://i.imgur.com/GUHKCe2.png\u0022\u003E\u003Cbr\u003E\n\u0022Would you all just SHUT UP!\u0022\u003Cbr\u003E\n\u0022Well, if you hadn\u0027t noticed, Leah, we\u0027re sort of riding in a - \u0022\u003Cbr\u003E\n\u0022Well, I\u0027m sort of FLYING an untested Eve Ascent Vehicle, so can you please let me focus for a second? Okay, good. 3 kilometers and rising. We\u0027re going supersonic. I suggest you brace yourself against your seat. It\u0027s going to get a whole lot shakier, then a whole lot faster, then a whole lot hotter.\u0022\u003Cbr\u003E\n\u0022Roger that.\u0022\u003Cbr\u003E\n\u0022Don\u0027tbarfDon\u0027tbarfDon\u0027tbarf.\u0022\u003Cbr\u003E\n\u0022Outer boosters at 25 percent fuel.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022jemAW0o.png\u0022 src=\u0022http://i.imgur.com/jemAW0o.png\u0022\u003E\u003Cbr\u003E\n\u0022All crew, report in!\u0022\u003Cbr\u003E\n\u0022Tomfurt, optimistic but nervous!\u0022\u003Cbr\u003E\n\u0022Gene, sick to my stomach and scared to death!\u0022\u003Cbr\u003E\n\u0022Carol, this is AWESOME!\u0022\u003Cbr\u003E\n\u0022Milvy, totally - \u0022\u003Cbr\u003E\n*PH-THHH!!!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022EOc1SZ6.png\u0022 src=\u0022http://i.imgur.com/EOc1SZ6.png\u0022\u003E\u003Cbr\u003E\n\u0022We\u0027ve successfully detached!\u0022\u003Cbr\u003E\n\u0022Go team!\u0022\u003Cbr\u003E\n\u0022Shercott, you\u0027re a space pirate. Not a team member. But a crew member, nonetheless. All crew members, this is the most risky part of the mission. We have to gravity turn, and it will be very shaky. I wouldn\u0027t be surprised if all of you barfed. Then we need to accelerate, and there\u0027s a chance my command pod might explode. Here goes nothing.\u0022\u003Cbr\u003E\n\u0022BLEUAGGGH!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022ersPJPU.png\u0022 src=\u0022http://i.imgur.com/ersPJPU.png\u0022\u003E\u003Cbr\u003E\n\u0022We lost a fin on separation!\u0022\u003Cbr\u003E\n\u0022I want to go home!\u0022\u003Cbr\u003E\n\u0022That\u0027s my goal, Gene!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022QGm3CC5.png\u0022 src=\u0022http://i.imgur.com/QGm3CC5.png\u0022\u003E\u003Cbr\u003E\n\u0022What\u0027s that creaking sound?\u0022\u003Cbr\u003E\n\u0022Probably the burst hydraulic lines to the fin getting clogged by debris and potentially about to explode.\u0022\u003Cbr\u003E\n\u0022AAAAAAAAAAAAAAAAAAAAAAAAAA-\u0022\u003Cbr\u003E\u003Cimg alt=\u00223HSqhLg.png\u0022 src=\u0022http://i.imgur.com/3HSqhLg.png\u0022\u003E\u003Cbr\u003E\n\u00223 g\u0027s!\u0022\u003Cbr\u003E\n\u0022BLEAGUAHHH!\u0022\u003Cbr\u003E\n\u0022That\u0027s two, Gene and Milvy.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022u3eQD4y.png\u0022 src=\u0022http://i.imgur.com/u3eQD4y.png\u0022\u003E\u003Cbr\u003E\n\u00224 G\u0027s!\u0022\u003Cbr\u003E\n\u0022This is the explodey bit you mentioned, right?\u0022\u003Cbr\u003E\n\u0022Capsule heating at 75 percent. OwOwOw! Note to self, don\u0027t touch the overhead beam. It\u0027s getting really hot. Ow! Or the hatch handle! Ow! Or the throttle lever! Oh no. THE THROTTLE LEVER?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022W8vPkOw.png\u0022 src=\u0022http://i.imgur.com/W8vPkOw.png\u0022\u003E\u003Cbr\u003E\n\u00225 g\u0027s!\u0022 OwOwOwOwOw!\u0022\u003Cbr\u003E\n\u0022Are you okay, Leah?\u0022\u003Cbr\u003E\n\u0022Gene, if I die, take the extra canister of EVA propellant and get to orbit!\u0022\u003Cbr\u003E\n\u0022Leah?\u0022\u003Cbr\u003E\n\u0022The G force meter has melted! OWOWOWOWOW!\u0022\u003Cbr\u003E\n\u0022AAAAAAAaaaaaaasmsplbbh.....\u0022\u003Cbr\u003E\n\u0022Tomfurt has fainted! There goes our insurance policy!\u0022\u003Cbr\u003E\n\u0022IIIIIIIIIIIDDDDDOOOOOOOON\u0027TKNOWWHATYOUARETALKINGABOUT!\u0022\u003Cbr\u003E\n\u0022IT\u0027S SORT OF COMPLICATED!\u0022\u003Cbr\u003E\n\u0022THE THROTTLE IS MELTED STUCK ON FULL! PROBABLY 7 G\u0027S! THE CAPSULE THERMOMETER HAS MELTED! AAAAAAAAAAAAAARRRGGG-\u0022\u003Cbr\u003E\u003Cimg alt=\u0022zs7LuhH.png\u0022 src=\u0022http://i.imgur.com/zs7LuhH.png\u0022\u003E\u003Cbr\u003E\n\u0022MMMMMMMMMMMMMMMMMRRRRRRRRRRFFFFFFFFFF!\u0022\u003Cbr\u003E\n\u0022TEN... GEES! WINDOW... MELTIIIIIII-\u0022\u003Cbr\u003E\n\u0022WWWWWWWEEEE\u0022REGOING...To... plbbbbbfrhhhhh......................................fhhng.............................................\u0022\u003Cbr\u003E\n============================================================================\u003Cbr\u003E\nLeah Kerman awoke, dazed and confused, wondering where she was. She could see her terribly cracked space helmet. Through her broken visor, she could see several pieces of metal glowing molten orange. And then there was an altimeter. It was going... up? Maybe? Then, it all came back to her. Eve. The Dragon. The throttle stuck on full. The melting capsule. The fact that she should have been dead. She tried to move her left arm. It appeared to have been broken. Several levers were either missing, or melted in place.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Leah?\u0022\u003Cbr\u003E\n\u0022Gene?\u0022\u003Cbr\u003E\n\u0022You\u0027re alive?\u0022\u003Cbr\u003E\n\u0022Yes. I am. How long was I out?\u0022\u003Cbr\u003E\n\u0022About a minute.\u0022\u003Cbr\u003E\n\u0022Why didn\u0027t you bail out? I passed out. I may have not woken back up!\u0022\u003Cbr\u003E\n\u0022The EVA fuel tank valve sort of melted. I wouldn\u0027t have made it to orbit, anyway. You might want to fire up the second stage now.\u0022\u003Cbr\u003E\n\u0022Oh. Right!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022vOkNUdJ.png\u0022 src=\u0022http://i.imgur.com/vOkNUdJ.png\u0022\u003E\u003Cbr\u003E\n*click* *click*\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The second stage engine isn\u0027t working.\u0022\u003Cbr\u003E\n\u0022...\u0022\u003Cbr\u003E\n\u0022It appears that the second stage COPV valves have actually melted shut. There isn\u0027t enough pressure to feed it.\u0022\u003Cbr\u003E\n\u0022We\u0027ve got backup solid rocket ullage motors, though, right?\u0022\u003Cbr\u003E\n\u0022The igniters melted and set off them and they burned through a bunch of first stage wiring.\u0022\u003Cbr\u003E\n\u0022So we need something else to act as an ullage motor. How long until apoapsis?\u0022\u003Cbr\u003E\n\u002229 seconds. What else could possible work as an ullage - oh. Gene, I know what you\u0027re thinking. Don\u0027t do it!\u0022\u003Cbr\u003E\n\u0022Leah, this is the only way. I EVA, get out and push the spacecraft, and you start the engines and get everyone else to safety.\u0022\u003Cbr\u003E\n\u0022As pilot of this ship, I order you not to - \u0022\u003Cbr\u003E\n\u0022As acting chief officer of the space program, I hereby overrule you\u0027re order!\u0022\u003Cbr\u003E\n\u0022But, Gene! You\u0027ll die!\u0022 Gene Kerman got out of his seat and floated over to the airlock.\u003Cbr\u003E\n\u0022Sorry, Leah. This is the only way I can get you to safety!\u0022\u003Cbr\u003E\n\u0022zzzzzzzzzzzzzzzzzzzzzzzwhwWhat?\u0022\u003Cbr\u003E\n\u0022Tomfurt? You\u0027re awake?\u0022\u003Cbr\u003E\n\u0022Uh, yeah?\u0022\u003Cbr\u003E\n\u0022Stop Gene!\u0022\u003Cbr\u003E\n\u0022What\u0027s going on?\u0022\u003Cbr\u003E\n\u0022He\u0027s going to jump start the broken engine and is going to get himself killed!\u0022\u003Cbr\u003E\n\u0022Broken engine?\u0022\u003Cbr\u003E\n\u0022Stop Gene!\u0022 Gene had his gloved hand on the airlock hatch and began to twist the handle.\u003Cbr\u003E\u003Cbr\u003E\n\u0022By the power of the monolith, I wish and proclaim that the engine be fixed!\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022EKG1Qkb.png\u0022 src=\u0022http://i.imgur.com/EKG1Qkb.png\u0022\u003E\u003Cbr\u003E\n*pshhh...Ctof!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022WiqOEj9.png\u0022 src=\u0022http://i.imgur.com/WiqOEj9.png\u0022\u003E\u003Cbr\u003E\n\u0022What just happened? The engine is functioning normally now!\u0022\u003Cbr\u003E\n\u0022That was insurance.\u0022\u003Cbr\u003E\n\u0022Gene, get back in your seat now! What did you just do, Shercott?\u0022\u003Cbr\u003E\n\u0022Some might call it magic. It\u0027s really just really complicated science.\u0022\u003Cbr\u003E\n\u0022Bu - wha?\u0022\u003Cbr\u003E\n\u0022I promise you I\u0027m not crazy, Leah. I\u0027m just a bit of a... magician.\u0022\u003Cbr\u003E\n\u0022Shercott, if you can do that, then why not just go anywhere in the blink of an eye?\u0022\u003Cbr\u003E\n\u0022There are rules. With great power comes great responsibility. That, and there is actually a limit to how much I can do before the universe runs out of this \u0022magic.\u0022\u0022\u003Cbr\u003E\n\u0022I don\u0027t understand!\u0022\u003Cbr\u003E\n\u0022And you don\u0027t have to. I just saved everyone on this ship. Now, concentrate on getting this thing to orbit.\u0022\u003Cbr\u003E\u003Cimg alt=\u00222vWS6Ep.png\u0022 src=\u0022http://i.imgur.com/2vWS6Ep.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022WuMELNF.png\u0022 src=\u0022http://i.imgur.com/WuMELNF.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022R2tFM59.png\u0022 src=\u0022http://i.imgur.com/R2tFM59.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022lFLOTSA.png\u0022 src=\u0022http://i.imgur.com/lFLOTSA.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nAnd that day, although the millions on Kerbin would not hear of it for quite some time, there was great rejoicing among the ones who could: The handful of Kerbals in space. They rejoiced at different intervals, the Eve orbit crew after three seconds, Kerbin after a minute, Duna in five, Dres in twelve, Jool in thirteen, and Eeloo in eighteen. Although no rejoice could compare to that of the six: The five in the rocket, and the one that nobody could see.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022x5X4zJA.png\u0022 src=\u0022http://i.imgur.com/x5X4zJA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cimg alt=\u0022:kiss:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif\u0022 title=\u0022:kiss:\u0022\u003E\u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022jinOp9y.png\u0022 src=\u0022http://i.imgur.com/jinOp9y.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022L50jS7m.png\u0022 src=\u0022http://i.imgur.com/L50jS7m.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022ABtEyZQ.png\u0022 src=\u0022http://i.imgur.com/ABtEyZQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Tuw8InQ.png\u0022 src=\u0022http://i.imgur.com/Tuw8InQ.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022PjWEyeT.png\u0022 src=\u0022http://i.imgur.com/PjWEyeT.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe Story of Project Intrepid will Continue...\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-09-30T01:28:53Z","Content":"\n\u003Cp\u003E\nAwesome! They\u0027re ship is damaged, so it\u0027s a good thing they didn\u0027t need to make a rendezvous with the mothership on an escape trajectory using the suit air to fly like aluminum man! \u003Cu\u003EThat\u003C/u\u003E would be bad...\n\u003C/p\u003E\n\u003Cp\u003E\nNote: remember tell Gus to add a heat shield in a fairing on top of the IHateEveAscentVehicles v6. Also bring 2 ascent vehicles just in case.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-30T01:40:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222780505\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475198933\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAwesome! They\u0027re ship is damaged, so it\u0027s a good thing they didn\u0027t need to make a rendezvous with the mothership on an escape trajectory using the suit air to fly like aluminum man! \u003Cu\u003EThat\u003C/u\u003E would be bad...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot shown: Mark Kerman, the ship\u0027s artificial intelligence system!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222780505\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475198933\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNote: remember tell Gus to add a heat shield in a fairing on top of the IHateEveAscentVehicles v6\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOriginally the top of mine was a mini nose cone, but I needed somewhere to mount the giant inflatable heat shield. If I had started this report a few weeks later than I had, then I would have been able to use 1.2\u0027s cool new 0.625m heat shield!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222780505\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475198933\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso bring 2 ascent vehicles just in case.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E would have launched more stuff, but they were sort of busy being attacked by the Flat Kerbin Society.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222780505\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475198933\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n2 ascent vehicles\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, just wait until I can unleash the TYLO ARMY! (6 Tylo Landers!)\n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-09-30T01:54:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222780514\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475199648\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOriginally the top of mine was a mini nose cone, but I needed somewhere to mount the giant inflatable heat shield. If I had started this report a few weeks later than I had, then I would have been able to use 1.2\u0027s cool new 0.625m heat shield!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah... I\u0027m launching \u003Cs\u003EProject ReallyCloseToTheBigRoundShinyThing\u003C/s\u003E Project Solar, which is supposed to be a tour of the inner solar system soon. Waiting for 1.2... Basically, if I ever get anything done and don\u0027t just blow up stuff, then I\u0027m going to land and return on every inner solar system body twice... Except I never seem to get anything compl- \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222780514\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475199648\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E would have launched more stuff, but they were sort of busy being attacked by the Flat Kerbin Society.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t have a Flat Kerbin Society. I do have a Minmus is Not Ice Cream Society, (MiNICS) but that\u0027s only 12 Kerbals who were part of the old FKS but I decided to leave on Minmus. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222780514\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475199648\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOh, just wait until I can unleash the TYLO ARMY! (6 Tylo Landers!)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh yes... The Tylo army... MUWAHAHAHA!!!\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-10-01T16:06:32Z","Content":"\n\u003Cp\u003E\nOkay, I\u0027ve got part 30 here! Not a very long part, but a semi-important plot part.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPart 30: The Kraken\u0027s Apprentice:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u0022Oof... where am I? Hello?\u0022\u003Cbr\u003E\n\u0022Val?\u0022\u003Cbr\u003E\n\u0022Jeb? I\u0027m dreaming, aren\u0027t I?\u0022\u003Cbr\u003E\n\u0022No, Val. It\u0027s me.\u0022\u003Cbr\u003E\n\u0022Jeb?\u0022\u003Cbr\u003E\n\u0022Yes.\u0022\u003Cbr\u003E\n\u0022How long has it been?\u0022\u003Cbr\u003E\n\u0022Fifty-two years.\u0022 Valentina Kerman sat up with a start.\u003Cbr\u003E\n\u0022Fifty-two years? Impossible. I\u0027d be dead by then! And I should have been woken up several times by now!\u0022\u003Cbr\u003E\n\u0022That sort of broke. And I spent two hundred days here trying to get you awake again. If I had gotten here a day later, you would have been dead.\u0022\u003Cbr\u003E\n\u0022You just look so... so...\u0022\u003Cbr\u003E\n\u0022Old? Yeah, fifty years does that.\u0022\u003Cbr\u003E\n\u0022Thanks. For coming and finding me.\u0022\u003Cbr\u003E\n\u0022No, Val. Thank you for being alive.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n=====================================\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n\u0022So. Fifty years. What\u0027s new?\u0022\u003Cbr\u003E\n\u0022Quite a lot. The biggest thing: The Kerbol system is on a collision course with a black hole and will reach it in 200 years time.\u0022\u003Cbr\u003E\n\u0022That\u0027s not good. What are we planning on doing about it?\u0022\u003Cbr\u003E\n\u0022We have a four phase plan, along with an exploration initiative.\u0022\u003Cbr\u003E\n\u0022Tell me about this.\u0022\u003Cbr\u003E\n\u0022Well, I don\u0027t know the whole plan. It\u0027s top secret as of right now. Phase one was getting 1500 tons of supplies to Minmus, supposedly to make a base.\u0022\u003Cbr\u003E\n\u0022What about the other three phases?\u0022\u003Cbr\u003E\n\u0022The Flat Kerbin Society took over \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E before the other phases could launch.\u0022\u003Cbr\u003E\n\u0022The what Kerbin Society?\u0022\u003Cbr\u003E\n\u0022Long story. We\u0027ve also been launching giant motherships to re-explore all the planets.\u0022\u003Cbr\u003E\n\u0022Tell me about these missions, please!\u0022\u003Cbr\u003E\n\u0022Well, I\u0027ve got some pictures here.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022drLZinf.png\u0022 src=\u0022http://i.imgur.com/drLZinf.png\u0022\u003E\u003Cbr\u003E\n\u0022This is the Intrepid Test Vehicle 009 \u0022Intrepid.\u0022 This is what I and my four crewmembers came here in.\u0022\u003Cbr\u003E\n\u0022Now that is a giant spaceship. Remember back when the Farlander was considered huge?\u0022\u003Cbr\u003E\n\u0022Yes. We\u0027re on Duna now, and have set up a small base. We\u0027re also going to Ike, but we\u0027ll get to the details in a minute.\u0022\u003Cbr\u003E\n\u0022Sorry, there\u0027s just so much to take in!\u0022\u003Cbr\u003E\n\u0022Nobody can blame you. For you, forty years have passed in a matter of minutes. Now, next ship.\u0022\u003Cbr\u003E\u003Cimg alt=\u00226rWY410.png\u0022 src=\u0022http://i.imgur.com/6rWY410.png\u0022\u003E\u003Cbr\u003E\n\u0022This is the Intrepid Test Vehicle 13, or ITV-011 \u0022Creativity.\u0022 Same general build as the Intrepid, just with a lot more stuff attached. It is currently en route to Jool.\u0022\u003Cbr\u003E\n\u0022What are those clusters of landers? They look to big to be a single Tylo lander.\u0022\u003Cbr\u003E\n\u0022Ah. That is the TYLO ARMY. Six Tylo landers.\u0022\u003Cbr\u003E\n\u0022SIX?\u0022\u003Cbr\u003E\n\u0022Yes. I designed it myself.\u0022\u003Cbr\u003E\n\u0022Let me guess. You stole Bill\u0027s blueprints.\u0022 Jeb smiled.\u003Cbr\u003E\n\u0022Next ship!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022efWwZwq.png\u0022 src=\u0022http://i.imgur.com/efWwZwq.png\u0022\u003E\u003Cbr\u003E\n\u0022This is the ITV-013 \u0022Magician\u0022 on its test run to Minmus. It was a complete redesign of the previous ships and can mine and land on most bodies. It was sent to Moho where it attempted a landing. It landed safely, but due to low \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E it could barely reach Moho orbit before it ran out of fuel.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022YR202Pq.png\u0022 src=\u0022http://i.imgur.com/YR202Pq.png\u0022\u003E\u003Cbr\u003E\n\u0022So the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E sent the IRV-002 to rescue the crew. However, the crew took over the rescue ship and went on a flight to Eve, but I\u0027ll get to that soon.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022pIuy5wN.png\u0022 src=\u0022http://i.imgur.com/pIuy5wN.png\u0022\u003E\u003Cbr\u003E\n\u0022This is already so confusing.\u0022\u003Cbr\u003E\n\u0022Yet, there is more. The ITV-015 \u0022Independence\u0022 was an Eeloo ship, still in transit to Eeloo, looks exactly the same as the 013. I\u0027ll skip that one. The ITV-016 \u0022Explorer\u0022 is a giant Dres ship.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022sWAQGXh.png\u0022 src=\u0022http://i.imgur.com/sWAQGXh.png\u0022\u003E\u003Cbr\u003E\n\u0022It\u0027s like two of the smaller ones stuck together!\u0022\u003Cbr\u003E\n\u0022Yes, I could say that it is!\u0022\u003Cbr\u003E\n\u0022Next up, we actually named a ship after you. The ITV-018 \u0022Valentina!\u0022\u003Cbr\u003E\n\u0022I\u0027m flattered!\u0022\u003Cbr\u003E\n\u0022Gene\u0027s idea.\u0022\u003Cbr\u003E\u003Cimg alt=\u00222IBtNKl.png\u0022 src=\u0022http://i.imgur.com/2IBtNKl.png\u0022\u003E\u0022As you can see, it went to Eve. With an Eve Ascent vehicle.\u0022\u003Cbr\u003E\n\u0022Wait. An actual Eve Ascent Vehicle?\u0022\u003Cbr\u003E\n\u0022Yes.\u0022\u003Cbr\u003E\n\u0022Did it work?\u0022\u003Cbr\u003E\n\u0022Hold on, I\u0027m getting to that. The most recent ship in the fleet is the ITV 019 \u0022Homecoming.\u0022 It is the sister ship of the 018. It carried the Gilly lander.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022Lw5zvy9.png\u0022 src=\u0022http://i.imgur.com/Lw5zvy9.png\u0022\u003E\u003Cbr\u003E\n\u0022Now that is a good looking mothership.\u0022\u003Cbr\u003E\n\u0022So? What happened with the Eve Ascent Vehicle?\u0022\u003Cbr\u003E\n\u0022It worked.\u0022\u003Cbr\u003E\n\u0022YES!\u0022\u003Cbr\u003E\n\u0022Unfortunately, the crew of the \u0022Magician\u0022 stole it and took it down to the surface of Eve with Gene and the pilot as hostages.\u0022\u003Cbr\u003E\n\u0022Gene? No way! He\u0027s afraid of heights!\u0022\u003Cbr\u003E\n\u0022What?\u0022\u003Cbr\u003E\n\u0022Err, never mind.\u0022\u003Cbr\u003E\n\u0022So it worked. And here we are now. We need to get back to the base, our supplies are running low. And we\u0027re scheduled to leave Duna in one day.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022uOKSgC7.png\u0022 src=\u0022http://i.imgur.com/uOKSgC7.png\u0022\u003E\u003Cbr\u003E\n\u0022Any questions?\u0022\u003Cbr\u003E\n\u0022Thousands. But I\u0027ve got three big ones.\u0022\u003Cbr\u003E\n\u0022Shoot.\u0022\u003Cbr\u003E\n\u0022How did you get here?\u0022\u003Cbr\u003E\n\u0022The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E designed a simple plane.\u0022\u003Cbr\u003E\n\u0022A plane? On Duna?\u0022\u003Cbr\u003E\n\u0022Yeah. In retrospect, I should have just nixed the wings and made it a suborbital hopper.\u0022\u003Cbr\u003E\n\u0022Question two. The one I regret to ask - can your lander hold six Kerbals?\u0022\u003Cbr\u003E\n\u0022Fortunately, yes. Remember Wernher\u0027s pentaphobia?\u0022\u003Cbr\u003E\n\u0022Oh. Yes! Haha! Remember when I sent him that proposal for the five engine shuttle? Remember how he freaked?\u0022\u003Cbr\u003E\n\u0022Yeah, that was pretty funny!\u0022\u003Cbr\u003E\n\u0022Last big question. Who won the war?\u0022\u003Cbr\u003E\n\u0022Nobody did. We were all underground for fifty years because of the radiation.\u0022\u003Cbr\u003E\n\u0022War hurts.\u0022\u003Cbr\u003E\n\u0022Yes. And I hope that will serve as a reminder enough never to go to war again.\u0022\u003Cbr\u003E\n=========================================================================\u003Cbr\u003E\n\u0022Are you sure this will work?\u0022\u003Cbr\u003E\n\u0022Nope, and I never have been.\u0022\u003Cbr\u003E\u003Cimg alt=\u0022fn0LpcR.png\u0022 src=\u0022http://i.imgur.com/fn0LpcR.png\u0022\u003E\u003Cbr\u003E\n\u0022Isn\u0027t there a better way to do this?\u0022\u003Cbr\u003E\n\u0022There\u0027s one seat, but there\u0027s a service bay.\u0022\u003Cbr\u003E\n\u0022So we both cram into it so there\u0027s nobody at the controls.\u0022\u003Cbr\u003E\n\u0022And we only have 35% of our fuel left.\u0022\u003Cbr\u003E\n\u0022Oh, yay. This\u0027ll be fun.\u0022\u003Cbr\u003E\n\u0022Sarcasm? Nah, this will actually be fun! 3! 2! 1!\u0022\u003Cbr\u003E\u003Cimg alt=\u002216Moh1o.png\u0022 src=\u0022http://i.imgur.com/16Moh1o.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022U7Ufuco.png\u0022 src=\u0022http://i.imgur.com/U7Ufuco.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u00220aran27.png\u0022 src=\u0022http://i.imgur.com/0aran27.png\u0022\u003E\u003Cbr\u003E\n\u0022MRRRRRRPHHHH!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022bJcboAz.png\u0022 src=\u0022http://i.imgur.com/bJcboAz.png\u0022\u003E\u003Cbr\u003E\n\u0022Well, Val. Good news and bad news. We\u0027re in space again. However, we set our course wrong. We\u0027ll be landing to the East of the base.\u0022\u003Cbr\u003E\n\u0022Great! So, we get to Jetpack?\u0022\u003Cbr\u003E\n\u0022Nah, the base will probably send the rover.\u0022\u003Cbr\u003E\u003Cimg alt=\u00221wnJW0u.png\u0022 src=\u0022http://i.imgur.com/1wnJW0u.png\u0022\u003E\u003Cbr\u003E\n\u0022Val, I\u0027ve got a question for you myself.\u0022\u003Cbr\u003E\n\u0022Yes?\u0022\u003Cbr\u003E\n\u0022You didn\u0027t seem so surprised that I was alive.\u0022\u003Cbr\u003E\n\u0022You either, Jeb.\u0022\u003Cbr\u003E\n\u0022So I\u0027ve got one question - are you allergic to ketchup?\u0022\u003Cbr\u003E\u003Cimg alt=\u0022InFVNaP.png\u0022 src=\u0022http://i.imgur.com/InFVNaP.png\u0022\u003E\u003Cbr\u003E\n\u0022Oh. Yeah, I am. And I know that you are as well.\u0022\u003Cbr\u003E\n\u0022So the telepathy still works?\u0022\u003Cbr\u003E\n\u0022Yes, Jeb. It still hasn\u0027t gone away.\u0022\u003Cbr\u003E\n\u0022Funny, Two of the crew on this mission have the same type of telepathy that we do. Just a bit more harsh.\u0022\u003Cbr\u003E\n\u0022So now there\u0027s a second case so we can do more research on this?\u0022\u003Cbr\u003E\n\u0022Correct! Maybe some Ketchup substitutes will work?\u0022\u003Cbr\u003E\n\u0022Uh, slight problem.\u0022\u003Cbr\u003E\n\u0022Yeah?\u0022\u003Cbr\u003E\n\u0022The ground is really hilly and we\u0027regoingREALLYREALLYFA-\u0022\u003Cbr\u003E\u003Cimg alt=\u0022v6GJGih.png\u0022 src=\u0022http://i.imgur.com/v6GJGih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022l8fk6jO.png\u0022 src=\u0022http://i.imgur.com/l8fk6jO.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00225eGpk1T.png\u0022 src=\u0022http://i.imgur.com/5eGpk1T.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022CMHTh2Z.png\u0022 src=\u0022http://i.imgur.com/CMHTh2Z.png\u0022\u003E\u003Cbr\u003E\n\u0022Val? Are you okay?\u0022\u003Cbr\u003E\n\u0022That was AWESOME!\u0022\u003Cbr\u003E\n\u0022Val, I missed you.\u0022\u003Cbr\u003E\n\u0022I missed you more!\u0022\u003Cbr\u003E\n\u0022Nah. About that Jetpacking. Want to try it?\u0022\u003Cbr\u003E\n\u0022321GO!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022qGnrK7O.png\u0022 src=\u0022http://i.imgur.com/qGnrK7O.png\u0022\u003E\u003Cbr\u003E\nValentina rose above the red hills of Duna. The base marker could be seen, twenty kilometers in the distance.\u003Cbr\u003E\u003Cimg alt=\u0022JAPggxA.png\u0022 src=\u0022http://i.imgur.com/JAPggxA.png\u0022\u003E\u003Cbr\u003E\nHowever, half her fuel gone, she would only make it half way. The reversed thrust, trying to land, but she was going too fast. Way too fast. The red ground approached her. She gripped the controls harder. And then -\u003Cbr\u003E\n==========================================================\u003Cbr\u003E\n\u0022And then you died!\u0022\u003Cbr\u003E\u003Cimg alt=\u0022CMHTh2Z.png\u0022 src=\u0022http://i.imgur.com/CMHTh2Z.png\u0022\u003E\u003Cbr\u003E\n\u0022Jeb! I told you not to ever do that again!\u0022\u003Cbr\u003E\n\u0022But you were dead, Val! I spent fifty years dreaming of seeing you again, and then you just died jetpacking across the surface of Duna! What was I supposed to do?\u0022\u003Cbr\u003E\n\u0022So after fifty two years. You\u0027re still doing it.\u0022\u003Cbr\u003E\n\u0022I\u0027ve only had to do it three times in the last fifty two years, thank you very much! Would you rather be dead?\u0022\u003Cbr\u003E\n\u0022Well, in case you\u0027ve forgotten, I could have lived. Kerbals can\u0027t really die, remember?\u0022\u003Cbr\u003E\n\u0022Yes, but this is Duna. You\u0027d have a 10% chance of being able to come back!\u0022\u003Cbr\u003E\n\u0022It\u0027s bad for the universe! You have a limit of doing that, you know? You used most of it up sixty years ago!\u0022\u003Cbr\u003E\n\u0022I used it to defeat the Kraken. Then I used the rest of it to save you.\u0022\u003Cbr\u003E\n\u0022How much do you have left, then?\u0022\u003Cbr\u003E\n\u0022Not much. I can do a \u0022quickload\u0022 as the Kraken called it four more times before I\u0027m completely out.\u0022\u003Cbr\u003E\n\u0022I have one more question.\u0022\u003Cbr\u003E\n\u0022Yes.\u0022\u003Cbr\u003E\n\u0022Do you regret it?\u0022\u003Cbr\u003E\n\u0022That\u0027s a tough question. Doing what I did - was both a blessing and a curse.\u0022\u003Cbr\u003E\n\u0022Well, we might as well wait for the rover now.\u0022\u003Cbr\u003E\n\u0022Might as well. Jetpacking won\u0027t really work, Val.\u0022\u003Cbr\u003E\n\u0022If you had a choice, if you could go back, would you have done it?\u0022\u003Cbr\u003E\n\u0022I defeated him. That should serve as evidence enough.\u0022\u003Cbr\u003E\n\u0022I need you to admit it.\u0022\u003Cbr\u003E\n\u0022Well,\u0022\u003Cbr\u003E\u003Cimg alt=\u0022SVNPDat.png\u0022 src=\u0022http://i.imgur.com/SVNPDat.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\n\u0022If I had known what would happen afterward, I would have never become - \u0022\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022JIsNIoT.png\u0022 src=\u0022http://i.imgur.com/JIsNIoT.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\n\u0022The Kraken\u0027s Apprentice.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe story of Project Intrepid will Continue...\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-10-01T17:04:13Z","Content":"\n\u003Cp\u003E\nDUN DUN DUN!!! Jeb\u0027s allergic to ketchup? \n\u003C/p\u003E\n\u003Cp\u003E\nSomething tells we messing around with magic and telepathy have something to do with each other... \n\u003C/p\u003E\n\u003Cp\u003E\nVAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAL!!!!!!!!!!!!!!!!!!!!!!!!\n\u003C/p\u003E\n"},{"CreatedByName":"rlin","CreatedById":156783,"CreatedDateTime":"2016-10-02T01:47:37Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWow. Just amazing.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-10-02T02:46:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222782729\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475341453\u0022 data-ipsquote-userid=\u0022159640\u0022 data-ipsquote-username=\u0022max_creative\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, max_creative said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDUN DUN DUN!!! Jeb\u0027s allergic to ketchup? \n\u003C/p\u003E\n\u003Cp\u003E\nSomething tells we messing around with magic and telepathy have something to do with each other... \n\u003C/p\u003E\n\u003Cp\u003E\nVAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAL!!!!!!!!!!!!!!!!!!!!!!!!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, Val\u0027s back! And a lot of Kerbals happen to be allergic to Ketchup! 75% of telepathic ones, anyway...\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222783322\u0022 data-ipsquote-contentid=\u0022141284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475372857\u0022 data-ipsquote-userid=\u0022156783\u0022 data-ipsquote-username=\u0022rlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, rlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWow. Just amazing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI decided to do some calculations. Apparently, anything over 40,000 words counts as a novel (!) and after an hour of copypasting PI into a word counter, I discovered that Project Intrepid is over 26,000 words so far! Over half way to being a novel!\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, part 18 was the shortest (350 words) and part 26 the longest (3,000 words) with the average at around 900 words per part!\n\u003C/p\u003E\n"}]}