{"TopicId":147319,"ForumId":51,"TopicTitle":"A new beginning: yet another career","CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2016-09-09T03:09:21Z","PageNum":1,"Articles":[{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2016-09-09T03:09:21Z","Content":"\n\u003Cp\u003E\nSo I just remembered that I had been contemplating doing a mission report of every rocket for my next career, and since I just started one yesterday I think I\u0027m still early enough for it to count.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGoing off my mods directory, and some of these are strictly DLL dependencies, like Firespitter.\n\u003C/p\u003E\n\u003Cp\u003E\nBahaSP\n\u003C/p\u003E\n\u003Cp\u003E\nCommunity Resource Pack\n\u003C/p\u003E\n\u003Cp\u003E\nCommunity Tech Tree\n\u003C/p\u003E\n\u003Cp\u003E\nContract Configurator\n\u003C/p\u003E\n\u003Cp\u003E\n- Historic Missions\n\u003C/p\u003E\n\u003Cp\u003E\nCrowd sourced Science\n\u003C/p\u003E\n\u003Cp\u003E\nDark Side Technology \n\u003C/p\u003E\n\u003Cp\u003E\nFirespitter\n\u003C/p\u003E\n\u003Cp\u003E\nInterstellarFuelSwitch\n\u003C/p\u003E\n\u003Cp\u003E\nJoolianDiscovery\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMechjeb2\n\u003C/p\u003E\n\u003Cp\u003E\nMk2 Expansion\n\u003C/p\u003E\n\u003Cp\u003E\nNearfuture Propulsion\n\u003C/p\u003E\n\u003Cp\u003E\nNearfuture Solar\n\u003C/p\u003E\n\u003Cp\u003E\nNearfuture Spacecraft\n\u003C/p\u003E\n\u003Cp\u003E\nOrbitalTug\n\u003C/p\u003E\n\u003Cp\u003E\nRcsSounds\n\u003C/p\u003E\n\u003Cp\u003E\nRemoteTech (not compatible with RN_US_Probes)\n\u003C/p\u003E\n\u003Cp\u003E\nRN_US_Probes\n\u003C/p\u003E\n\u003Cp\u003E\nSmokeScreen\n\u003C/p\u003E\n\u003Cp\u003E\nTarsierSpaceTech\n\u003C/p\u003E\n\u003Cp\u003E\nTextureReplacer\n\u003C/p\u003E\n\u003Cp\u003E\nUmbraSpaceIndustries\n\u003C/p\u003E\n\u003Cp\u003E\n- FTT\n\u003C/p\u003E\n\u003Cp\u003E\n- FX\n\u003C/p\u003E\n\u003Cp\u003E\n- Kolonization\n\u003C/p\u003E\n\u003Cp\u003E\n- Konstruction\n\u003C/p\u003E\n\u003Cp\u003E\n- Kontainers\n\u003C/p\u003E\n\u003Cp\u003E\n- LifeSupport\n\u003C/p\u003E\n\u003Cp\u003E\n- ReactorPack\n\u003C/p\u003E\n\u003Cp\u003E\n- SoundingRockets\n\u003C/p\u003E\n\u003Cp\u003E\nWarpPlugin\n\u003C/p\u003E\n\u003Cp\u003E\nWildBlueIndustries\n\u003C/p\u003E\n\u003Cp\u003E\n- MOLE\n\u003C/p\u003E\n\u003Cp\u003E\nDespite the fact that some of the probes for RN_US_Probes are really nice, I\u0027m thinking about shelving that mod simply because a) I\u0027m overwhelmed with too many choices early in the career, and I don\u0027t actually have the proper parts or infrastructure to launch a 5-ton interplanetary probe right now. b) Some of them are really really out of place, like they have end-tier stuff on them and I got them in the first two tiers. c) They don\u0027t use RT, which on the one hand is nice because with a new career I don\u0027t have a sat net up yet, but on the other hand it feels a little cheaty to be doing that. RT definitely makes the opening moves in the career a lot harder with the historic missions (where I have to launch, and often land, dozens of unmanned probes).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSo here\u0027s a pic of my first orbiter for this career:\u003Cimg alt=\u0022hWaN049.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/hWaN049.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMy progress so far has been pretty steady, with a quick succession of missions reaching ever higher past the planetary surface, culminating in this latest escapade where our probe was calculated as probably having been in orbit for at least ten seconds before the de-orbit command doomed it to plummet back to the planetary surface.\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s pause for a brief review of what we\u0027ve already done. Starting with a sounding rocket so small and so budget-constrained that it didn\u0027t even have a name (which we are retroactively naming Sounder 0) we\u0027ve sent Sounder 0 off the ground; Sounder 1 just brushed the atmosphere, but failed to return much in the way of scientific value. Sounder 2 spent a solid minute in space and brought back a woeful pittance of useful information. Now with Sounder 3 we\u0027ve not only sent a craft to orbit, but we managed to bring back a bit of data for once.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cCwcOMG.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022565\u0022 src=\u0022http://i.imgur.com/cCwcOMG.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow that we\u0027ve proven the worth of our space empire, we expect a veritable flood of lucrative contracts!\n\u003C/p\u003E\n\u003Cp\u003E\nAnd Jeb was the first astronaut to reach space. We think he redacted the command pod out of Sounder I because it looks better with a probe head, but probe I as saved is over on parts and probably height. Not sure how he managed that. The investigation is ongoing.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-09T03:16:39Z\u0022 title=\u002209/09/2016 03:16  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 9, 2016\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2016-09-09T04:09:12Z","Content":"\n\u003Cp\u003E\nOur next task is to investigate a scandalous rumor that Kerbals have been doing unnatural things in order to lift off the ground and get high...without the benefit of rockets! We sent our best man to look into it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229EuYQHf.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/9EuYQHf.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt is clear from the beginning that Jeb\u0027s not at all sure he believes these rumors, and his first attempt at a craft is what we could call a \u0022Kerbal-manned Rocket-assisted Take-Off\u0022 or KRATO. It\u0027s an unusual piece not only because Jeb is personally flying it but because once the boosters fall off, he\u0027ll be relying on the mysterious natural buoyancy of the aetherial substance. Many critics claim that flight in this way is impossible.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Mw58Ikq.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/Mw58Ikq.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd in fact Jeb\u0027s first flight experience suggests that, although the rockets can accelerate the craft to 100 m/s and keep it above ground level, the jet engine is too wimpy to keep the heavy craft airborne for long. It simply doesn\u0027t have the horsepower required to keep the craft aloft. On the face of it, this experiment had clearly and obviously disproven these \u0022Aethernaut\u0022 rumors. However, Jeb wasn\u0027t ready to give up. He was willing to try again...and again...and again...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nl5CBZS.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/nl5CBZS.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...Until finally his fourth iteration of the humble \u0022Scout I\u0022 is able to stay airborne and even achieve speeds approaching 120 m/s, all while sipping the tiniest pittance of fuel!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229WIwGvs.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/9WIwGvs.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHowever, on his third and final contract for the day, Jeb runs into a problem: The mountains stand between him and his contract, and they reach higher than the generous 4km ceiling that his Scout I can handle.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NyUGjq1.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/NyUGjq1.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFortunately the butterfly-shaped wings are exceptionally maneuverable at the low speeds Jeb is flying at, and he\u0027s able to grab the contract by buzzing within meters of a sheer cliff.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223QSnL0Y.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/3QSnL0Y.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlthough Jeb has plenty of fuel and plenty more contracts to go, he decides that before he continues he needs something bigger, faster, definitely with a higher ceiling. The Scout I has done its job and proven those Aetherial nay-sayers wrong, and earned a fair bit of coin in the process, but one brush with death is enough; it is time to collect his science and his lucre and call it a day.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cmRzin9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/cmRzin9.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-09T04:53:04Z\u0022 title=\u002209/09/2016 04:53  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 9, 2016\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2016-09-09T05:52:11Z","Content":"\n\u003Cp\u003E\nThe Scout II flies twice as fast, goes twice as high, carries almost twice as much fuel, and uses three -fewer- parts than the scout 1, all by swapping out the wimpy mk0 jet pair for a single Wheezely. Preliminary flights suggest that the craft can maintain speeds in excess of 150 m/s for not less than two hours, perhaps as long as three or four.  However, one long, yawn-inducing flight to a target zone convinced Jeb: Must go faster.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222crzDUE.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/2crzDUE.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow that Jeb has dispelled all doubts regarding the existence of the mysterious Aetherium, on whose invisible wings a sufficiently clever Kerbal may ride (provided they also bring actual, visible wings), funding has come flooding into the Kerbal Space Center. It is time for Jeb to once again pick up his true dream: Get high, go fast.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-09T06:01:27Z\u0022 title=\u002209/09/2016 06:01  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 9, 2016\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2016-09-09T06:47:34Z","Content":"\n\u003Cp\u003E\n\u0022Tourists want to breathe the fresh, clean space-air,\u0022 Jeb grumbles. \u0022Admin is talking about putting up a string of satellites so we can use satellites to talk to our satellites. And I\u0027ve had enough of this paperwork! I\u0027ve had enough!\u0022 He waves at a jumbled pile of forms with a radius of a half-meter.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I\u0027m going up. I\u0027ll let you guys know if I see anything cool while I\u0027m up there.\u0022\u003Cimg alt=\u0022I3cpY5w.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/I3cpY5w.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Control, I put a rocket on the pad. I am go for launch. Tee-zee-go! Hahahaha!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jeb, wait!\u0022 Gene broadcast frantically. \u0022You haven\u0027t filled out your requisition for control fins...in triplicate...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223qKJEto.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/3qKJEto.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Grumble grumble triplicate...Are there any other forms we have to fill out before we get high?\u0022 Jeb asked.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well, there\u0027s still the --\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I don\u0027t care. Tee-zee-go!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zXnMW6e.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/zXnMW6e.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jeb....kkkzzssshh...snacks....\u0022 Mission Control\u0027s voice faded into illegibility as Jeb wandered further and higher than any Kerbal had ever dared to venture.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Man, I sure could go for some snacks right now,\u0022 Jeb said.\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\nAs the lone capsule landed on the twisted, shattered remains of the Science Jr., the hatch swung open and Jeb, sans space-suit, staggered out and collapsed onto the green, green grass. The recovery helicopter was already overhead, and even as smoke still clung to Jeb\u0027s suit a news van came to a screeching halt.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Mr. Kerman, you have just returned from the first ever trip to the Mun! Do you have any words you\u0027d like to say?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022So...hungry....\u0022 Jeb whispered, smoke still clinging to his orange flight suit. \u0022Thirteen hours...no snacks...\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-09T20:31:41Z\u0022 title=\u002209/09/2016 08:31  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 9, 2016\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2016-09-09T20:22:52Z","Content":"\n\u003Cp\u003E\n\u0022Jeb, it\u0027s not that we don\u0027t believe that you actually flew past the moon. The psych evaluation is coming in next week, and -- \u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You\u0027re lying! I know you don\u0027t believe me. That\u0027s why, this time, I brought six tourists with me. And snacks! Snacks for everybody.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jeb, did those people actually agree to go with you?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Just give me launch clearance and nobody gets hurt. You\u0027ll see. I\u0027ll show you. I\u0027ll show you all! And have some emmantaler waiting for when we get back.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jeb, we can\u0027t just let you take rockets out willy-nilly whenever you -- \u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I don\u0027t care, Gene! Tee-zee-go!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022-sigh- An excellent pilot, but definitely crazy. Well, at least we still have the -- it\u0027s gone?! What do you mean it\u0027s gone? Jeb took it! Jeeeeeeeeeeb!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Vq5ptul.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/Vq5ptul.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFrom The Daily Kerbal: \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EDr. Hedrich Kerman made headlines today as he conducted original research on the effects of space travel on the Kerbal psyche. \u0022One sample vas not enuff,\u0022 the doctor quoted to an enthusiastic news team. \u0022I had to go and see this for myself. And seence it vas our anniversary, my vife vould keel me eef I did not bring her along also.\u0022 \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe doctor, along with his wife and four volunteers, accompanied famed pilot Jebediah Kerman on what Jeb claimed was a trip to the Mun.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0022Yes, I did go to the Mun, and yes, you can too! For the low, low price of only 100,000 credits, Kerbal Space Center will build you a custom seat on one of our Mun-faring rockets. It\u0027s safe, it\u0027s cheap, and it\u0027s definitely for real.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWhen asked if it was true that Jebediah was undergoing a psychological evaluation because Gene Kerman, head of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, thought he was dangerously insane, Jeb had no comment.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022u15ILBA.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i.imgur.com/u15ILBA.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-09T23:26:01Z\u0022 title=\u002209/09/2016 11:26  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 9, 2016\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"}]}