{"TopicId":152715,"ForumId":51,"TopicTitle":"From Airport to Spaceport - Offering Roundtrips to the Moons","CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-11-28T19:59:07Z","PageNum":1,"Articles":[{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-11-28T19:59:07Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYF.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MRt1lYF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo these guys over at KASA got their space program running, exploring stuff and getting all these rad contracts. We want a piece of that. Of course, testing is right out, we dont have the latest tech, construction too, we couldn\u0027t build working sattelites if our lifes depended on them and for the survey stuff we would need equipment we dont have. But the tourism, we can do that!\n\u003C/p\u003E\n\u003Cp\u003E\nThere was an old airport near the sea we could get for cheap. Mostly because noone goes there anymore and the last plane departure was months ago. Some of the crew could be persuaded to stay with us, luckily four pilots were among them!\n\u003C/p\u003E\n\u003Cp\u003E\nWe also managed to \u0022aquire\u0022 some rocket engines from KASA and the last owners of the airport left an abandoned plane in the hangar so we did the logical thing and cobbled them together to get our very own (hopefully) spaceworthy plane.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ugQqzYc.png\u0022 class=\u0022ipsImage\u0022 height=\u0022355\u0022 src=\u0022http://i.imgur.com/ugQqzYc.png\u0022 width=\u0022631\u0022\u003E\u003Cimg alt=\u0022gYF8dXb.png\u0022 class=\u0022ipsImage\u0022 height=\u0022351\u0022 src=\u0022http://i.imgur.com/gYF8dXb.png\u0022 width=\u0022629\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThats the Spaceplane Alpha One with Mirella, Mortimer, Telssa and Elbart. They got these spiffy new suits and will fly planes higher than they ever before have. They will touch the stars above Kerbins sky. They will also fly tourists about and make loads of cash. I mean, we have a business to run here.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n----\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPrerequesites\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n- moderate career, fund rewards 50%, penalties 200%, 42k starting money\n\u003C/p\u003E\n\u003Cp\u003E\n- mission control and spaceplane hangar once upgraded, airfield fully upgraded; tech tree on a pay-to-unlock basis (science will be \u0022bought\u0022 off KASA)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022xVvRCtH.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/xVvRCtH.png\u0022 width=\u0022636\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n- techs unlocked: Start, Engineering 101, Basic Rocketry, Stability, General Rocketry, General Construction, Aviation, Fuel Systems, Aerodynamics, Landing\n\u003C/p\u003E\n\u003Cp\u003E\n- only tourism and kerbal recovery contracts (exception are the first four contracts)\n\u003C/p\u003E\n\u003Cp\u003E\n- no hiring!\n\u003C/p\u003E\n\u003Cp\u003E\n- every construction is unique and can only be used in one running mission at a time, though other models can be based off existing ones\n\u003C/p\u003E\n\u003Cp\u003E\n- as much plane-ness as possible\n\u003C/p\u003E\n\u003Cp\u003E\nUltimate goal is to get to Jool and do the Jool 5 challenge - with planes!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nList of mods (no parts or physics mods)\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nContract Parser\n\u003C/p\u003E\n\u003Cp\u003E\nDocking Port Alignement Indicator\n\u003C/p\u003E\n\u003Cp\u003E\nFor Science (automatic science collection)\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Alarm Clock\n\u003C/p\u003E\n\u003Cp\u003E\nMechJeb\n\u003C/p\u003E\n\u003Cp\u003E\nMouse Aim Flight (very neat to fly planes with)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid\n\u003C/p\u003E\n\u003Cp\u003E\nBetter Burn Time\n\u003C/p\u003E\n\u003Cp\u003E\nTransfer Window Planner\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Engineer Redux\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Joint Reinforcement (after getting some large ships eaten by timewarps, I dont want to miss this anymore)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nVisual enhancement:\n\u003C/p\u003E\n\u003Cp\u003E\nRealPlume - Stock\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-30T22:38:43Z\u0022 title=\u002211/30/2016 10:38  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 30, 2016\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-11-28T21:35:54Z","Content":"\n\u003Cp\u003E\nMortimer the brave soul was volunteered to test the Spaceplane Alpha One on her maiden voyage. Although he had some initial concerns (\u0022It\u0027s just a regular plane with the tail sawn off and some rockets put on!\u0022) he strapped himself into the cockpit and was ready to go. Of course there was more work done to the plane itself, so it would truly be spaceworthy. For example, the body was covered in heat resistant radiator paint.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022DyZwsxe.png\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/DyZwsxe.png\u0022 width=\u0022641\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, you may ask (Mortimer certanly did) if we just took a store-bought thermometer and glued it onto the planes nose so the pilot could take temperature readings while flying and we would say that parts of it may be not far from the truth. Anyway, time to take off!\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022V3cg2w7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/V3cg2w7.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022Jg9Rxpv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Jg9Rxpv.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo the plane part still holds up to its former purpose. Mortimer is thrilled by the way, he was grounded for far too long. He will get up to about 4km, collect some speed and then climb further to 7km, where he will engage the rockets. And don\u0027t forget to take readings (sure, he says).\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022CGjAUg1.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/CGjAUg1.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022VcTcS2o.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/VcTcS2o.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen there is the rocket-powered ascend, which is totally awesome. Especially because it is a plane. 45 degrees and still accelerating.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022swwjv8W.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/swwjv8W.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022w2KoLxk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/w2KoLxk.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMortimer is getting higher than he ever has been. Plus he is flying a plane, which he is still totally thrilled about. From about 35km up he will coast to apoapsis and then circularize the orbit. Only then he truly is in space, because otherwise he would just fall back to Kerbin.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022E1H2CJr.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/E1H2CJr.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022xGPY4gN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/xGPY4gN.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPlanes are great, rockets are great. It certanly was no mistake to put both together.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022X45ivgp.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/X45ivgp.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022jn9CcEu.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/jn9CcEu.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is great. We are in space with some fuel left over. Even if it wasn\u0027t for Mortimers expert piloting there is some margin for error. Two more kerbals in the passenger cabin will be no problem. Spaceplane Alpha One can bring tourists into orbit. If it can bring them back as well, there could be some major ticket sales to make. Mortimer wants to let the others know that space is really awesome and they shouldn\u0027t be afraid to come up here. The view is amazing as well. Still, he will have to land again. A retro burn to get the periapse down to 55k somewhere above the airport should get us in landing distance to it. The reetry is critical of course, it will be a literal baptism of fire.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00220V5TVp0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/0V5TVp0.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022Kn8Bfww.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Kn8Bfww.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVery high temperature, reports Mortimer. Temperature off the scale, reports Mortimer. Thermometer melted and burned away, reports Mortimer. Well, there goes the 5 bucks we spent for that. The warranty surely doesn\u0027t cover reentry. Probably no refund for the ashes either. Now the good news is that the Spaceplane Alpha One mostly survived the aerobreaking intact, but ...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Z4PWZga.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Z4PWZga.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022spsiFl9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/spsiFl9.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n... we undershot and came down behind the mountain range some distance from the airport. Luckily Mortimer remained calm and did a flawless dead stick landing in some grassy hills. You may ask if either the periapse was too low or the retro burn should have been done later. We say \u0022probably\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nNow since we are the first people after the KASA guys to do an orbit-and-return mission, some over-enthusiastic investors threw some money our way and the Kerbal Space Agency is the talk of the town. Which is great. The plane was successfully recovered as well, by the way. And Mortimer was fine too. The thermometer will be gone forever though.\n\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2016-11-28T23:00:53Z","Content":"\n\u003Cp\u003E\nI like the way you are presenting this.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a fun ride so far and I\u0027m looking forward to seeing some more.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nHappy landings!\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-11-28T23:04:06Z","Content":"\n\u003Cp\u003E\nGood guy Mortimer. I like it; it\u0027s unconventional.\n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-11-29T05:26:28Z","Content":"\n\u003Cp\u003E\nThanks \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI will update with more missions this evening (CET) since I\u0027ve progressed some more before starting this. They will be less detailed though, mainly because I still need to internalize to make screenshots while flying.\n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-11-29T19:55:09Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYF.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MRt1lYF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGood news everybody, we\u0027ve got some eager tourists that want to feel weightless in microgravity. Spaceplane Alpha One will get a checkup and a refill and then it will take the first of the lot into Orbit. Some large tech companies want to send their VIPs up and we thought it would be a good idea to snatch these away from stupid KASA with our better prices. We could show off our capabilities and with a good standing we may get a discount on spare parts and gear we will eventually need. Mirella suggested we could take a science experiment or two up into space, since we would be going there anyway. But with the thermometer fiasco still fresh in our minds we dismissed this for now.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ZyGwXcM.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ZyGwXcM.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe talked to Elbart and the girls about piloting the Spaceplane Alpha One, but none of them were eager to do their first flight into orbit with other lifes depending on them. With his experience, Mortimer was the right choice of course. We only had to look into his direction and he already agreed to go again.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022D1SVxH9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/D1SVxH9.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022F7Blag0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/F7Blag0.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSame procedure - Mortimer did it perfectly of course. He got up to 4km, sped up and then climed to 7km where he hit the rockets to get them into space.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022y7CNvSv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/y7CNvSv.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022ePf28Ng.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/ePf28Ng.png\u0022 width=\u0022636\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis right there is the reason these guys wanted to come up here. That and drinking floating weightless water bubbles. They got two orbits of microgravity fun, before Mortimer did a retro burn with a hopefully better trajectory that would get them down closer to the airport.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ErRIVmy.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/ErRIVmy.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis time he nailed it. He came down well within range and landed safely. Two very thrilled VIPs disembarked Spaceplane Alpha One. This was not the only flight of they day of course, thats the reason planes are so awesome (Mortimer agrees enthusiastically). So after a refill and lunch it was right back into orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022nrwKVot.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/nrwKVot.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u0022Pj5abvM.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/Pj5abvM.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThese two VIPs, even though they were some big guys in an aerospace company, were quite nervous about flying. And they were not very silent about it, thats why Mortimer respectfully requested some sort of noise reducing barrier between the cockpit and crew compartement. But they eventually warmed up to the idea of going up into the vacuum of space, where in case of failure their death cries would silenced by the absolute void that surrounds the tiny vessel. Have we mentioned that we did this successfully before? Twice even.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022HvDGRbG.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/HvDGRbG.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u0022CLyzUpi.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/CLyzUpi.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey also got their roundtrip and water bottles which led to endless entertainement ... until the aerobraking maneuver and landing.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022JhT7Ofb.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/JhT7Ofb.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u0022Vk2eEtW.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/Vk2eEtW.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWell done, Mortimer. This gave us a nice pile of money on top. We have enough wiggle room now to slap together a second plane. This would allow us to ferry twice as many tourists. Alternatively we could follow Mirellas advice and put some science cargo into it, instead of a passenger cabin. Maybe we could impress some companies with this so they give us access to the awesome tech everyone throws after the KASA guys.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-29T20:11:56Z\u0022 title=\u002211/29/2016 08:11  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 29, 2016\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-11-29T21:41:48Z","Content":"\n\u003Cp\u003E\nSo we put a bit of thought into it and went ahead with the science plane idea. We \u0022aquired\u0022 some more rockets ... okay, lets be honest, we just walked them off the KASA lot when they weren\u0027t looking. Didn\u0027t notice their disappearance the first time anyway. Well, we copied the Spaceplane Alpha One design and added a cargo compartement in place of the passenger cabin, where we put a thermometer (its safe in there, we promise) and a barometer. Also we got some of that weird goo stuff that seems all the rage now. Now seriously, just don\u0027t ever touch it. Trust us. Just .. don\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nIt took some time to assemble a plane, clip off its tail and weld the rockets in its place. Luckily we\u0027ve got eager engineers and they slaved through the night to get it finished. Funnily enough it seemed to come with a pilot, because Telssa already sat in it when it rolled out of the hangar. Since there was no time to waste, we named it Scienceplane Alpha One and shoved it off the runway. There was a small complaint from her though, mainly because we skipped the testing phase and told her to go right into orbit. It was a proven design, what could go wrong?\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022TpNi6qN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/TpNi6qN.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u0022c96jtz9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/c96jtz9.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIts flying a bit wonky, we hear from her. But her piloting is on par with Mortimer it seems, since she is doing the initial ascend with ease. Shes not quite convinced about Scienceplane Alpha One when she eventually reaches the critical 7km mark.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022pZBOezV.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/pZBOezV.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe can hear screaming. And expletives. Mainly \u0022krap\u0022 and \u0022this stupid plane is rubbish\u0022. Also some \u0022how could you mess it up so bad\u0022. It seems to be pulling up quite strongly and Telssa has her hands full with keeping the 45 degree ascent below 90. Despite of her strong words (or maybe because of them?) she successfully wrestles Scienceplane Alpha One into space.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022tAHFnpV.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/tAHFnpV.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u00223BDv80j.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/3BDv80j.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe will stay in orbit for a few revelations. Partly because of science, partly to give her time to calm down. This is the furthest away we can be from her right now.\n\u003C/p\u003E\n\u003Cp\u003E\nLook at me; still sitting around, when there is science to do, she says and laughs, finally showing happyness about beeing in space. We don\u0027t get it. Mirella is smiling though.\n\u003C/p\u003E\n\u003Cp\u003E\nNow that the airspace is clear, Mortimer will get us some more sweet cash with two more tourists. He is happy about flying and totally fine with this situation.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022LFu4pZj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/LFu4pZj.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u0022R8ZCDyn.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/R8ZCDyn.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere he goes, thrilled about flying, unhappy about the noise. We will do some modifications, we promise.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022XiItFV7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/XiItFV7.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWell look at that, we have two vessels in orbit. This looks like a reputable space program with coordinated launches and everything. Thank god we have planes instead of only dumb rockets. Telssa cuts in to add that planes are \u0022only usually\u0022 better and sometimes there are \u0022grave exceptions\u0022. We think she might not like Scienceplane Alpha One that much. Let\u0027s leave her up there a bit longer and get Mortimer down first.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Fq4MXiT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/Fq4MXiT.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWait, thats going to be a night landing! But Mortimer just remarks that he will fly by his superb sence of smell if he couldn\u0027t see anything. We don\u0027t implore further for fear of an explanation.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022jBE49cG.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/jBE49cG.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u0022cMcjm6n.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/cMcjm6n.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhatever sense he ended up using, he came down just withing range of the airport and landed perfectly on the last drops of fuel. We think he can very much be proud of himself. We don\u0027t tell him though. Compliments are like bonus payments in that they have to be used very scarcely to keep demands low. Now we wait until the sun rises before getting Mirella back down. Is it because daylight is better for landing or to give her some more calming time? The answer is yes.\n\u003C/p\u003E\n\u003Cp\u003E\nStrangely the runway wasn\u0027t emtpy the next day.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022eddN8FT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/eddN8FT.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMorning, Mortimer says loudly to talk over the noise of the already spooling up turbofans. The explanation he offers is actually ok with us. He was up, tourists were here, the plane was there.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022xltD3Ae.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/xltD3Ae.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u00221daioG9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/1daioG9.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOff he goes, happily. We think it will be difficult to eventually part him from Spaceplane Alpha One to give Elbart or Mirella a try. They both seem too shy to just jump in themselves. Though it\u0027s not clear with Elbart, he is just very quiet.\n\u003C/p\u003E\n\u003Cp\u003E\nWe hear about Telssa meanwhile. Something about \u0022putting this piece of krap back into the Hangar for a redesign with a sledgehammer\u0022. So we get her to do the deorbit burn and brace for more expletives. It was useless though. The plane would not remain stable and Telssa had to give it her all to bring it down. Concentration- and language-wise. We had to omit these parts. Scienceplane Alpha One overshot the airport and Telssa brought it around in a steep glide. Even touched down on the runway it made her sweat by refusing to slow down.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022tpfxqxd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/tpfxqxd.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u0022R5LfGq2.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/R5LfGq2.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt ran up right to the very end before finally stopping. Telssa unbuckled herself without comment, left the plane and walked off. First we thought she was coming after us, but she headed for the shed where we keep our pilots, so we breathed a sigh of relief. Still, this was a close call and we have to do something for her later on, since she did miraculously bring the plane back in one piece.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter putting Scienceplane Alpha One back into the Hangar we clear Mortimer for landing and watch him gracefully burn through the atmosphere at several times the speed of sound, before doing a pinpoint landing on the airstrip.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022G9ffTMj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/G9ffTMj.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe think he is also not too happy about what happened. We will make it up to both of them, since we are right back up with our funds, even though we doubled the number of planes we have. Now we can do some bribing to get our hands on some nice tech to upgrade the planes. And of course we will do some investigating on Scienceplane Alpha Ones poor performance.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022csRrKpk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/csRrKpk.png\u0022 width=\u0022634\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s because of the stupid name, we hear from Elbart. Well, he is a man of few words, but he may be right.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-30T09:11:44Z\u0022 title=\u002211/30/2016 09:11  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 30, 2016\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-12-02T19:41:34Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYF.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MRt1lYF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo we decided to upgrade our pilots accomodation. There was an old hotel on the grounds of the airfield into which we poured some of our money to get it renovated and cleaned up (in part done by contractors, but mostly we made our ground crew guys do the work). During the cleanup we found strange backpacks hidden under a pile of old matresses. They turned out to be genuine jetpacks, which sadly didn\u0027t work at all. Before we could throw them away we were reminded these might work only in space. So we handed each of our pilot their very own jetpack and Telssa was grinning a bit too much about that.\n\u003C/p\u003E\n\u003Cp\u003E\nThen we made Mortimer fly more tourists, which he happily did.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022WlYwlzX.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/WlYwlzX.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022em1XrM5.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/em1XrM5.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen he went another two times, for the heck of it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ddJssv8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ddJssv8.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022wle1haK.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/wle1haK.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHe barely waited for it to be refuelled when he stuffed another two passengers in and went right up to space again.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Fnvw4SQ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/Fnvw4SQ.png\u0022 width=\u0022636\u0022\u003E\u003Cimg alt=\u0022ouOZRyu.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/ouOZRyu.png\u0022 width=\u0022636\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe get the feeling he really really likes it up there. Maybe its the flying too. In any case, we could absolutely not stop him from going right again before the sun went down, even if it meant another night landing for him. Which he totally aced. Dont be so suprised every time, I have been a pilot for all my life, he wants to let us know.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022IbwvSy6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/IbwvSy6.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nWe totally didn\u0027t call him out on the landing that ended just right before the runway. Because that would blemish his otherwise perfect run. So we just hid the records about it. Like, really well.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022PWyot0J.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/PWyot0J.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nOut engineers meanwhile were working on Scienceplane Alpha One. They cut and welded through the night and were able to present an overhauled vessel in the morning. Thats when we decided to go through with our cunning plan to make Telssa like us again. After a good nights sleep in the renovated hotel she was in best spirits anyway, so we sent her out to the runway (which we had to clear first again - bye Mort) and told her she was allowed to rename Scienceplane Alpha One to whatever she wanted. She seemed to not quite believe us at first, so we had to reassure her, that whatever name she chose was fine. Her asking again if we were really sure about it raised some tiny concerns, but we stayed with our plan.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022uJ4O1X0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/uJ4O1X0.png\u0022 width=\u0022636\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI want it to be The Levitating Honeybadger, she finally says.\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\nWe stayed with our plan. Really, we did. So she boarded ... The Levitating Honeybadger and took off without a hitch.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Nvp5aLO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Nvp5aLO.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u002249KznEW.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/49KznEW.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe plane flew perfectly level and stable. When it was time for the circularation, we told her to give it some more speed than usual to get the apoapse up some more. This was the second suprise, because she would be the first one of the pilots to penetrate deep space and go into high orbit over Kerbin. Mainly to show off that we were able to do that, but also to get some measurements from out there and hopefully find out that the KASA messed theirs up. They could claim anything anyway, since they were the first ones and noone could prove it - until now. So, fingers crossed we dig up some dirt.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022W7F3sVN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/W7F3sVN.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022212fBFc.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/212fBFc.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce in stable orbit, we asked her to leave the plane and test the jetpack. Luckily she brought it along, because we totally forgot to tell her. So she got outside and flew around a bit. Since she was very quiet about it, we had to ask her if everything was fine. She explained that it was \u0022breathtaking\u0022 and she really couldn\u0027t find any words to say.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ZZ7EXR9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/ZZ7EXR9.png\u0022 width=\u0022636\u0022\u003E\u003Cimg alt=\u0022rjXi2uX.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/rjXi2uX.png\u0022 width=\u0022636\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe did note that Kerbin looked vastly different from outside the plane in just her space suit. She also hugely enjoyed the jetpack and we had to remind her, that she had not brought spare fuel along.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022YXzKAmO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/YXzKAmO.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022jEw5I9s.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/jEw5I9s.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOur passengers get much more than just a roundtrip, she states. We agree.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile Telssa was marvelling about life, the universe and everything, Mortimer had already landed Spaceplane Alpha One to pick up another two very special passengers. Mirella and Elbart joined him to finally get their own taste of the infinite void surrounding Kerbin. He expertly took off and brought them into orbit. On the way up he gave them pointers on how to not die in a firey explosions. Both of them appreciated his advice and watched him closely.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022vQRQTV7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/vQRQTV7.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022IO0QJ9o.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/IO0QJ9o.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMirella had many questions, which Mortimer did his best to answer. All in all she seemed interested, but hesistant to fly Spaceplane Alpha One herself. Elbart seemed fine with listening and gave Mort a manly nod of understanding here and there. Telssa, who was back in - we will call it just \u0022The Badger\u0022 from now on - also added some advice on top about staying in space for more than a single orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nSpaceplane Alpha One had to get back eventually (it was not making any money that way), so after they spend some time with floating water bubbles and weightless snacks, Mortimer did the retro burn to reenter the atmosphere and bring them back to the airport.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MPSxViT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/MPSxViT.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022vS7dvQD.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/vS7dvQD.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt seemed Mirella and Elbart learned quite a bit from their experience. They would be able to go into space with a bunch of deathly afraid passengers right away.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Vwpgm9U.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Vwpgm9U.png\u0022 width=\u0022636\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe would have to wait a bit to send them on their first mission though, since Mortimer had found another two lucky tourists he quickly took along for another trip. He then then managed to squeeze in another takeoff and landing before sundown, we are slightly worried.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Dhz2W1E.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Dhz2W1E.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022dcp4Ftv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/dcp4Ftv.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-02T19:52:38Z\u0022 title=\u002212/02/2016 07:52  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 2, 2016\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-12-03T10:03:58Z","Content":"\n\u003Cp\u003E\nWhen the next morning broke, it finally was Elbarts turn to fly the Spaceplane Alpha One. He climbed in, along with two passengers and started the engines. We were totally confident about him in in the pilot seat. He proceeded to mimic Mortimers ascent flawlessly.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022U6edinP.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/U6edinP.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022oCEJBJn.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/oCEJBJn.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the blue sky above him and the rising sun gleaming into the cockpit, he seemed very content. Maybe we should have let him fly a bit sooner, he seems to enjoy it. We hope we won\u0027t have to choose sides when him and Mortimer eventually fight about the chance to fly.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022JkrI0GY.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/JkrI0GY.png\u0022 width=\u0022633\u0022\u003E\u003Cimg alt=\u0022aPwjukx.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/aPwjukx.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWelcome up here, Telssa greets him when Spaceplane Alpha One reaches a stable orbit. We leave Elbart and the tourists to their zero-G shenanigans, while we check on her, but she insists on staying some more. So after two orbits, Elbart is the one to do the retro burn. There was only a slight doubt in our mind that he couldn\u0027t mimic the landings Mortimer does, but he managed to wipe it away with a pinpoint touchdown right on our airfield. Although it was not quite the usual way around.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Hg8EzGv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022301\u0022 src=\u0022http://i.imgur.com/Hg8EzGv.png\u0022 width=\u0022535\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere was a refill, a change of passengers and a change of pilots. Mirella was now the one to show off her flying skills. Of course she has been a pilot for some time before this, but this plane has got two added rocket engines. Last time we checked, most planes haven\u0027t got any rockets at all. There was a slight possibility we were setting a trend here and others would copy our desings, but we were really hoping that wasn\u0027t the case. Especially because, if more people stole from KASA, they would notice at some point. Anyway. Mirella took off and did a beautiful ascend right there.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022FEcKU7o.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/FEcKU7o.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022EG9iMu3.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/EG9iMu3.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe seemed highly commited and in deep concentration. At least she was as silent as Elbart was. Without issues she broke through the higher layers of the atmosphere and blew right into space. The time in orbit she spent extremely quiet, even if the guys she took along had a blast - they had brought a game of darts along and were throwing their straightest shots ever. When time came for the retro burn and descent, Mirella showed some nervousness, but still did the maneuvers without problems.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022lXYbrJN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/lXYbrJN.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landing was another story though, because of a steep glide towards the airport she came down rather fast. Then, instead of breaking off and going for another try, she pressed on against our initial suggestions.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00224bb57lf.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/4bb57lf.png\u0022 width=\u0022636\u0022\u003E\u003Cimg alt=\u0022TNOLWeK.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/TNOLWeK.png\u0022 width=\u0022636\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe did a soft touchdown, but with far too much speed and very far up the runway. So Mirella hit the brakes hard and pushed the plane down, which caused a total lockup.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00222idQuw0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022224\u0022 src=\u0022http://i.imgur.com/2idQuw0.png\u0022 width=\u0022399\u0022\u003E\u003Cimg alt=\u0022kTQrpNt.png\u0022 class=\u0022ipsImage\u0022 height=\u0022224\u0022 src=\u0022http://i.imgur.com/kTQrpNt.png\u0022 width=\u0022399\u0022\u003E\u003Cimg alt=\u0022HwULWBV.png\u0022 class=\u0022ipsImage\u0022 height=\u0022224\u0022 src=\u0022http://i.imgur.com/HwULWBV.png\u0022 width=\u0022399\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTense we watched on as Spaceplane Alpha One spun out, overshot the runway and only came to a halt on the grass behind it. We were not happy about this and we planned on having a talk with Mirella about her insistence on landing against our suggestions. Mortimer, meanwhile, had ran onto the runway and was helping her and the passengers out of the plane. That was a bit strange, since we did have ground crew for that.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, there was another landing planned, so we cleared the runway and figuratively rolled out the carpet for Telssa and The Badger (there was no carpet in reality). All the way down we didn\u0027t hear a single expletive from her, but she still didn\u0027t seem too happy when the plane came to a final halt.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022v6wJc0Y.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/v6wJc0Y.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter going through the data the science instruments obtained, we were very disappointed when we compared our numbers to the measurements from the KASA, since they matched up. So we changed our own numbers and sent them to everyone important.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, we had totally asked them before borrowing their data, why do you ask?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWe had also made quite some money from ticket sales so far, so we logically decided to go on a bribing and shopping spree. It would be nice to upgrade Spaceplane Alpha One to carry more passengers. Also it would be nice to have two pilots on board, instead of only having one to pile all the responsibility and workload onto. The supersonic capabilities of the currently used turbofan engines were lacking as well.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe we had to change the whole design.\n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-12-05T20:29:07Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYF.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MRt1lYF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo we have good news and bad news. The bad news is, we spent everything. Close to it anyway. After bribing new tech out of some aerospace companies (they were suprisingly generous) we got our hands on actual spaceworthy components for planes plus a real flight simulator. Thats why our engineers didn\u0027t get to modify an existing airplane but instead had the chance to come up with a completely new design. Our pilots got some time to put their feet up while we stomped out a new spaceplane.\n\u003C/p\u003E\n\u003Cp\u003E\nNow to the good news: It\u0027s freaking awesome! We immediately put it on the runway and gave our guy and gal pilots a chance to take a look and they did a rather thorough inspection - they were literally all over it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MxIFYHk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/MxIFYHk.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt can take up to eight passengers into orbit and is flown by two, so every pilot now has double the chance to get a go. With the next generation turbofan engines it can fly supersonic speeds with ease - at least Mortimer will be thrilled by that. The climb will be considerably faster and the maximum altitude much higher as well. Our engineers outdid themselves we think, the test flight will show if everything holds up to the stats.\n\u003C/p\u003E\n\u003Cp\u003E\nThe naming will be done by one of the crew, which we told them. Telssa quickly reminded everybody that she already named a plane and passed it on to the others and the guys said something about \u0022ladies first\u0022. So Mirella, who was a bit embarassed about it, thought about it for a minute.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022IvIbxa2.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/IvIbxa2.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022Traveller\u0022 will be the name of the new spaceplane and it will make us so much money.\n\u003C/p\u003E\n\u003Cp\u003E\nMortimer quickly volunteered for a test flight (for real this time) and Elbart won the following stone-leaf-knife tournament. So the guys would be the first ones to bring the Traveller into orbit above Kerbin. Since it was already good to go, the girls left the runway and watched the flight from down here.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00220l1APGj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/0l1APGj.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022BA3TcyP.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/BA3TcyP.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThats some suprisingly awesome acceleration, was Mortimers professional opinion. They did a steep climb and still managed to gain more speed. At around 8km height they will stop climbing, go supersonic up to Mach 2 and then go as high as possible.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022gw2FxCU.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/gw2FxCU.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022KTZpCaw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/KTZpCaw.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe following rocket-powered ascent and orbital injection was routine and they guys did it with ease, even with the much heavier spaceplane. The engines were KASA rockets too, by the way. They seem to be very reliable and everything, if beeing free alone was not enough reason to get them from these guys.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022NSlEgm6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/NSlEgm6.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022XRO2eeJ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/XRO2eeJ.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTelssa and Mirella gave a little applause, which made the guys rather proud of themselves. We didn\u0027t add anything to that, but reminded them that the engineers did their best to make the plane perform well and fly stable.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00227XNzYrl.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/7XNzYrl.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022CB7CYG8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/CB7CYG8.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey stayed up for an orbit, enjoyed the view and munched on the complimentary provisions. Mortimer remarked that the change he was happiest about was the fuel tank section between the cockpit and the passenger compartement. Elbart agreed wordlessly. When it came to deorbiting, they did a perfect descent and aerobraking.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022wmvSl3i.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/wmvSl3i.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022cTsbjWB.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/cTsbjWB.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the airport in view, Elbart suggested a sideslip maneuver to shed more speed, which brought them down and close to the runway.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022kJxhDOr.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/kJxhDOr.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022mNfG35G.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/mNfG35G.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landing went without a hitch and the guys gave a glowing review of the Traveller. Finally we had a seriously futuristic spaceplane to show for. Ticket sales would surely soar and with the much larger passenger capacity we could easily cover the greater demand.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a refill and a thorough inspection we decided to send Mirella to accompany Mortimer, this would allow her to get some more hours while beeing directly supported by the very experienced colleague. Then eight eager tourists were comfotably seated and the Traveller went for its first profitable mission.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ngoTNL1.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ngoTNL1.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022u9hX0OK.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/u9hX0OK.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt went perfectly and they arrived safely back at the airport in the late evening. This was indeed a very lucrative flight and we couldn\u0027t wait for the next morning, when Elbart would be joined by Telssa to do a trip with another eight passengers.\n\u003C/p\u003E\n\u003Cp\u003E\nWe then literally couldn\u0027t wait and sent them up right away.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022kkTTi1f.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/kkTTi1f.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022wtOik2q.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/wtOik2q.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nElbart had no problems flying the Traveller and Telssa enjoyed beeing back up in space again, even if it was only for a short while. The passengers were happy about the larger compartement they could now float around in and the added snack station was quite popular. There was no question that we would sell more tickets than ever.\n\u003C/p\u003E\n\u003Cp\u003E\nRight when the sun rose, Mortimer and Mirella did another fully booked flight. Since the Traveller could gain so much speed within the atmosphere there wasn\u0027t so much fuel needed for the rockets. Altogether it was not much more expensive to run than Spaceplane Alpha One. Plus, it looks way better.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00227PuuwmB.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/7PuuwmB.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022LpbJM2l.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/LpbJM2l.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIncredibly after only these few trips our funds were nearly back up to the pre-Traveller level. We were already thinking about aquiring another one. To be really sure about it, we sent them up again right away. After the landing they actually waited in the plane for the refill to do the next trip in direct succession. We are not overworking them, we promise. They are doing that because they want to - we think. Maybe pilots just have a strong urge to move massive machines to ludicrous speeds.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022CzRKQn4.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/CzRKQn4.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022clm7E42.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/clm7E42.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyway, we were thrown money at by the handfuls and decided to give the engineers another project. It would not exactly be a passenger plane but we also didn\u0027t want a single role craft like The Levitating Honeybadger. Since the Traveller did so well, we did tell them to base it on the same design though.\n\u003C/p\u003E\n\u003Cp\u003E\nElbarts suggestion was to make it a cargo plane. We might listen to him.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00229PY3J2J.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/9PY3J2J.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-06T09:15:26Z\u0022 title=\u002212/06/2016 09:15  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 6, 2016\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-12-06T15:31:55Z","Content":"\n\u003Cp\u003E\nWe did listen to him. Out of the hangar rolled a close copy of the Traveller without the passenger compartements and an added cargo bay as well as a docking port. Theoretically it would be able to carry about 2 tons of cargo into orbit. Since it was Elbarts idea, he not only had to do the first flight, but we also gave him the honor of naming it. Telssa volunteered to accompany him and while they were taxied to the runway, a name was announced. Shortly thereafter Persephone took off to her maiden voyage into orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022OzMbnRE.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/OzMbnRE.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022i2pNhlY.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/i2pNhlY.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTelssa and Elbart both noticed that it didn\u0027t feel as light as it should have, even if it behaved perfectly well. The also added there were clunking noises coming from the cargo hold. We really hoped there wasn\u0027t some forgotten member of the ground crew in there. Because these guys dont get suits and the Persephone was quickly leaving the atmosphere. We would find out in once in orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Mck1Cog.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Mck1Cog.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022IloFtPP.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/IloFtPP.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the cargo bay was opened, a tiny vessel floated out. It actually seemed to be two even smaller ships docked together. A quick investigation later it turned out that one of our engineers put it in there. Others of the ground crew identified him as \u0022the new guy\u0022 and we checked his credentials again which were far too good so we logically assumed he was a spy for KASA. Suprisingly, we were right, because after a few questions he spilled the beans and explained that these were prototype drone tugs for assembling a space station. They were designing them and he was only checking to see if they fit into the Persephones cargo hold before he would have taken off with them and the spaceplanes blueprints. We were only angry for about a second until we noticed that we had totally stolen some awesome tech from KASA without even noticing! This also explained why there was a docking port on the spaceplane, we had been wondering about that since its introduction.\n\u003C/p\u003E\n\u003Cp\u003E\nThe engineers were ordered to distrust new hires a lot more and we figuratively put down the spy (we actually fired him). Since our pilots were still floating around up there with the tugs we told Telssa to get outside and check them out. She had again already brought her jetpack along \u0022just in case\u0022 as she remarked.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022SnQmdLy.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/SnQmdLy.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe described them as \u0022really cute\u0022 and stated that they had omni-directional thrusters and remote controlled drone cores. That sounded incredibly high-tech and we were even happier about the find. Only, we couldn\u0027t steer them, since they relied on a comm connection to the KASA space center. But we could put some sort of satellite up with a direct link to us and the amateur radio stations who let us use their antennas. Through that we could then patch the signal. We actually didn\u0027t have any use for them, but now that they were there, we couldn\u0027t just not do anything. So we ordered the Persephone back on the ground and our engineers to devise such a satellite.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00223kKqvYa.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/3kKqvYa.png\u0022 width=\u0022637\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nElbart and Telssa came down very close to the airport but then overshot it a bit. They easily glided back and landed safely. While the Persephone was rolled back into the hangar, the Traveller waited for the runway to be cleared to take off with Mirella and Mortimer which more and more turned out to be a good team. Of course they also took eight tourists along.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Gdrm9vJ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Gdrm9vJ.png\u0022 width=\u0022636\u0022\u003E\u003Cimg alt=\u0022bMxfkGO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/bMxfkGO.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhile they did their trip, our engineers (we checked them to make sure there weren\u0027t any new ones) took one of the discarded pieces of plane fuselage we had lying round, stuffed some electronics in there, added solar cells of the same design as the mini tugs and put a small container with fuel for these omni thrusters on. They also told us that they copied the anti-tumbling system we had in the planes to keep the satellite stable since it didn\u0027t have any propulsion and that they had installed docking ports for the tugs and different ones for the cargo plane. When it was finished they fastened it into the cargo bay and gave our pilots an old game controller. Meanwhile we reminded them to take their jetpacks along. Then the Persephone took off again for a nocturnal flight.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022KlJD41M.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/KlJD41M.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter arriving in space, both of our pilots now didn\u0027t know how to find the tugs again. We also only broadly knew where they were. That information didn\u0027t seem of much use to them though, since \u0022somewhere above Kerbin\u0022 was deemed \u0022not helpful\u0022. Telssa came up with the idea to ping their signal and then follow the blip they gave off. So we told her to do just that and made a note of finding out how to properly track objects in space.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022JYf67qg.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/JYf67qg.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022Mr9o3pR.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Mr9o3pR.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStill in the dark, Telssas idea paid off and they recieved a signal suprisingly close. It seemed that they did an incredibly well timed launch just by pure luck. They boosted themselves closer to it and once they got under about 2500 meters, the tugs automatically established a connection to the satellite in the cargo hold. Now the pilots found out what the controller had been for. Elbart began to remotely steer the tugs closer with it. Then he undocked them from each other and to the freshly released satellites docking ports.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022N0yhxlh.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/N0yhxlh.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022bTKam3E.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/bTKam3E.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHe turned out to be an absolute pro on the controller. We theorized he had played a lot of videogames and Telssa said she thought the same. Elbart didn\u0027t comment but instead did the docking flawlessly and with minimal fuel usage. It seemed we now had a real, actual space station, albeit a very small one. So we told them to get out and do some bragging (and maybe an inspection).\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ctEkKTU.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ctEkKTU.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022DgPSEVt.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/DgPSEVt.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhile they were floating about - Telssa with quite some enjoyment - we recieved a call that suprised us very much since it was from one of the KASA top officials. They told us in no uncertain terms that they knew about the theft (which gave us a small shock, until we noticed they were only talking about the tugs) and that they were offering to write them off if we did something for them. They knew we had awesome planes and they \u0022kind of lost\u0022 two of their people in orbit, so they asked us to go pick them up since they would need much more time to mount a rescue mission. Of course we agreed but then noticed that the Traveller was just accelerating into orbit. So we told Telssa and Elbart to get back down quickly and our engineers to throw together a passenger cabin we could stick into the cargo hold of the Persephone.\n\u003C/p\u003E\n\u003Cp\u003E\nQuicker than we thought possible the retrofit was done with another piece of unused plane fuselage. KASA let us use their tracking station data to get the location of the two stranded crewmen and the Persephone took off, aiming for the one that was about to go past.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022q7B7vHx.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/q7B7vHx.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022aJyq4z2.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/aJyq4z2.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe tracking was incredibly helpful and Elbart could easily plot a course to get as close as possible to their first target to pick up. Just after entering Kerbins shadow they met up with a science officer who introduced herself as Debty when she came on board and thanked everyone involved with her rescue. She also explained her adrift colleague, Macner, was an engineer and that it was very irresponsible to have let them fly on their own.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ffHHNgp.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ffHHNgp.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022QONkvld.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/QONkvld.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSome course corrections and a full orbit later they came close to Macner, again in Kerbins shadow. He sported his own jetpack and boosted over as soon as they came in range.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022UKo3ttM.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/UKo3ttM.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhile his headlights illuminated the Persephone, Debty greeted him enthusiastically. Shortly afterwards he joined her in the passenger cabin equally thankful about his timely rescue. They asked if we were planning on landing at the KASA space center, but we told them we had our very own space program with a space station and everything.\n\u003C/p\u003E\n\u003Cp\u003E\nDebty then asked if we were hiring.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00221xnrix6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/1xnrix6.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the Persephone touched down, we called KASA and told them we successfully saved their guys from certain death. Then we added that we would keep them. And the tugs too, in any case. Then we quickly hung up.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022HjBblF9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/HjBblF9.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-12-11T18:52:28Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYF.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MRt1lYF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe put together a plan for some space exploration. Debty, one of the two new hires, put some thought into it and had great ideas. Since she joined we saw her chatting it up with Mirella about some serious sounding science-y stuff like \u0022electromagnetism\u0022, \u0022cosmic radiation\u0022 and \u0022thermodynamic limits\u0022. We had no idea what they were talking about, but listened to their input nonetheless.\n\u003C/p\u003E\n\u003Cp\u003E\nMacner was a great help too, his space engineering background helped our engineers to come up with a plan to improve our space station. Plus he helped upgrade our cargo spaceplane to recieve some maneuvering thrustes to make docking to our station possible.. All of this together lead to the Persephone beeing fully booked for the forseeable future. So Elbart and Telssa were called for the next launch.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022FzA8Blx.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/FzA8Blx.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022DfUmb1F.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/DfUmb1F.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSince KASA conveniently forgot to withdraw our access to their tracking station, we could use this to arrange a perfect rendezvous. Elbart took the controller again to steer one of the tugs since their payload was supposed to be added to the station. It was a fuel tank which would supply the Persephone for a planned Mün flyby. Despite Mirella and Debtys ideas, we weren\u0027t doing this for science, but for fame. If we showed off our improved capabilities, we would sell even more tickets for our flights.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022dU4wxsl.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/dU4wxsl.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022LHh86oC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/LHh86oC.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTelssa was quite curious about the whole remote controlling thing, so Elbart showed her how a perfect docking procedure was done. And he really did it perfectly. The space station was expanded to a fuel station and they came back down to the airport.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022LI4VeFN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/LI4VeFN.png\u0022 width=\u0022636\u0022\u003E\u003Cimg alt=\u00220IgkXRr.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/0IgkXRr.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA refill was done and a cargo of science instruments was added to the Persephone. Meanwhile we spotted a disagreement between our pilots, but it turned out to be something else. Elbart was offering Mirella his spot on the plane and our resident scientist Debty was trying to talk her into it. Since it was obvious Mirella wanted to go along to the Mün flyby but was also afraid to mess something up, we reminded her that Telssa was with her and that there was absolutely no chance of failure if the two of them did the mission together. So she (quite happily) gave in and hopped into the Persephones cockpit alongside Telssa.\n\u003C/p\u003E\n\u003Cp\u003E\nIt was a timed launch; they were to meet with the fuel station, refuel and then boost their orbit to meet the Müns.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022PPnkM96.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/PPnkM96.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022Fz1zS2e.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Fz1zS2e.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhile they were doing the rendezvous maneuver, Mortimer (who told us he was fine with us calling him \u0022Mort\u0022) and Elbart earned us some money by taking some more tourists into Kerbins orbit. And some more in a second flght. We are totally on board with earning money of course.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022dwtAZGr.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/dwtAZGr.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022nSMoNPO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022356\u0022 src=\u0022http://i.imgur.com/nSMoNPO.png\u0022 width=\u0022633\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn space we could witness some professional docking action, undertaken by our femme pilots Telssa and Mirella. Thanks to the tracking station data they easily plotted a rendezvous course and then used the maneuver engines to dock to the station.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022bwTnXxj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/bwTnXxj.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022HMAcHDs.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/HMAcHDs.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter making contact, Telssa did a spacewalk to inspect the station and make sure everything was prepped for their long jurney. Since they were about to leave Kerbin for several days, everything had to work right. None of them were nervous about it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022SMr7zJ7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/SMr7zJ7.png\u0022 width=\u0022634\u0022\u003E\u003Cimg alt=\u0022PCjvcOL.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/PCjvcOL.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey transferred all of the fuel that was brought up to the station in the last trip, then undocked and did the acceleration burn to boost themselves into meeting the Mün.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022VeiCnuB.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/VeiCnuB.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022d3wEK27.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/d3wEK27.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Persephone would take quite some time to do its epilleptical orbit. So the Traveller did another trip and came back down long before its sister ship left for deep space.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ZCsVJdJ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ZCsVJdJ.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022OwbU5FC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/OwbU5FC.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMort seemed a bit nervous about the deep space mission, so we postponed the next flight and allowed the guys to watch the progress of the Persephone. Elbart too seemed very keen on looking after the girls. But it was worth sitting in front of some screens, because Telssa and Mirella entered an unstable orbit of the Mün some time afterwards and got a wonderful view. Only a small handfull of others had ever come so far.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022QLWhpH5.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/QLWhpH5.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022ITtpbja.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ITtpbja.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe girls not only got some good observations of the larger of Kerbins satellites, they also took science data from high orbit around it. That was quite a grand moment for us, since we managed to do a flyby of another astronomical body besides Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nPersephone was on a free return trajectory and planned aerobreaking maneuvers would bring her back into a stable Kerbin orbit. Out gals held up well in deep space and flawlessly did the dips into Kerbins atmosphere. It would take three to slow them down enough to enter low Kerbin orbit. Mortimer seemed more tense about it than the girls.\n\u003C/p\u003E\n\u003Cp\u003E\nEven before they came back down we recieved very lucrative offers about commercial Mün flybys.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022jNZnYTU.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/jNZnYTU.png\u0022 width=\u0022636\u0022\u003E\u003Cimg alt=\u0022pTK1VSA.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/pTK1VSA.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinally our resident lady pilots did a deorbit maneuver and a landing at our airport. A phenomenal success!\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022sMJxWC4.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/sMJxWC4.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022ze6wgWT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ze6wgWT.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere was no question about the massive increase in ticket sales that would follow still. We would have to upgrade the Traveller with a docking port so it could do a refill in orbit as well. For now Telssa and Mirella would do more missions to further expand our fuel station.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-16T14:04:26Z\u0022 title=\u002212/16/2016 02:04  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 16, 2016\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-12-16T13:57:56Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYF.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MRt1lYF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt began with a commercial launch with Mort and Elbart. We were still selling tickets for orbit tours, even if the demand for much farther space flights took over. The guys were absolute pros by now and could probably take off with the Traveller in their sleep. Nonetheless they were highly concentrated and watchful - errors could be not only costly, but fatal. They easily brought their plane up into space and had their eight passengers enjoy the view and the tricks that could be done in zero G in no time.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022dKnzLvu.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/dKnzLvu.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen the airspace was clear, the two gals took Persephone into orbit with another payload to be added to the fuel station. Since this launches had to be timed, the girls had to wait on the runway for a bit, which they didn\u0027t seem to mind. We did have snack compartements installed in the cockpits of both of our planes for long flights and they seem to be filled even for the short ones.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022vq8adDm.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/vq8adDm.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022BHDRst6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/BHDRst6.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUp in orbit they met up with the fuel station to expand it further. Since Telssa had watched Elbart control the tugs, it was her pleasure to do the docking. She was a bit overcautious, but did it without a hitch. It then was Mirellas idea to transfer all the excess fuel from the Persephone, since they would only need a bit to do the deorbit burn and subsequent landing. They did keep some more for closing in to the airport in case they over- or undershot though.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022hVkgyna.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/hVkgyna.png\u0022 width=\u0022636\u0022\u003E\u003Cimg alt=\u0022LHQ1dl0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/LHQ1dl0.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTelssa told us she liked it up there very much and asked if we were thinking about adding crew comparements to the station soon. We told her we would think about it. Truth is, this already crossed our minds, since we could surely sell bookings for an overnight stay in space - it would be the very first space hotel! You might think this to be either completely crazy or absolutely brilliant. We would like to think it is both.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile they were admiring their work, the guys had done another trip and earned us some more money. The girls left with a job well done and the plan to do a refueling trip next so the Traveller could do its first dips into deep space.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022d6bcocQ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/d6bcocQ.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022ZCsQNxk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/ZCsQNxk.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMacner had a meeting with us after the Persephone was back and suggested some improvements to the deep space capabilities of our planes, since the Traveller was beeing worked on anyway. We once again counted the number of engineers that were around (no new ones) and then gave him the go ahead. A retractable solar panel and several battery banks were added to both planes, which allowed the crew compartement of the Traveller to recieve a major upgrade in flight comfort with an entertainement system and a mini-fridge. While it was still grounded on account of it beeing cut in half and not quite in the process of beeing welded together again, the girls did the refueling run (they also snuck a mini-fridge aboard the Persephone and thought we would not notice it disappearing from the break room - we did, but only because our root beers had been in there).\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022QwLQYJv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/QwLQYJv.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022t0xGa33.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/t0xGa33.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey actually had some fuel left over, which made us plan on adding two more tanks. The cost of the launch, the fuel and the parts was not that high at least. The added long distance price for the Mün flyby ticket sales should more than offset that.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same night the girls came back down, the Traveller would do its big tour. It wasn\u0027t because of the launch window, it was because Mort was so eager to fly again. And also the money we got from the ticket sales.\n\u003C/p\u003E\n\u003Cp\u003E\nTell the girls we will be breaking their distance record, were Morts words as the engines went up to full thrust.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022m7GzLp6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/m7GzLp6.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022Hv8SWby.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/Hv8SWby.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOf course they had no problems with reaching orbit and Elbart had plenty of experience docking to the fuel station so that too was done perfectly. It was very important to show the tourists how professionally we did things. We were sure that this was the reason we sold so many more space tickets than KASA. Also the awesome planes. They didn\u0027t have anything that great.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022KUgNEer.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/KUgNEer.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022WzR0z5f.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/WzR0z5f.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey had to take in all of the stored fuel, since the Traveller was heavier than its sister ship and would need more energy to get that far away from Kerbin. Our estimates placed three refueling launches to two Mün flybys. There had to be more cost-saving method. Mort suggested making the Traveller lighter. We wouldn\u0027t do that, but he gave us an idea - we could use a plane just for space which would be parked at the station. It could use a more efficient rocket engine and it wouldn\u0027t need jet engines at all, making it very light. Of course it wouldn\u0027t be able to get up to space by itself, so it would have to be carried up. That we would plan later though, now it was time to launch our guys into deep space.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ZvLT374.png\u0022 class=\u0022ipsImage\u0022 height=\u0022358\u0022 src=\u0022http://i.imgur.com/ZvLT374.png\u0022 width=\u0022636\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the acceleration burn they had broken their personal speed records, which Elbart celebrated by fist-bumping his pilot colleague. It would take quite some time to reach the Mün of course. But the passengers would have a most luxurious trip. They could watch movies and have snacks and everything.\n\u003C/p\u003E\n\u003Cp\u003E\nMirella and Telssa didn\u0027t sit on their thumbs in the meantime and continued expanding the fuel station.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00223j073Zt.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/3j073Zt.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u00225BX0L4b.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/5BX0L4b.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey had added a third tank and dumped their excess fuel into the others, before going back down and fetching another.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022O5WRuFk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/O5WRuFk.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022jysyxHG.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/jysyxHG.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTelssa showed Mirella how to handle the gamecontroller and we allowed them to do some extra rounds with the tug. There was more than enough \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel around, since they were refilling it every time they docked. Mirella remarked that her colleague was right and \u0022this thing really is cute\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nAt last they did a fuel run, topping off the fuel stations tanks. Now there were enough reserves for another two Mün flybys. Telssa asked to do anothother integrity check of the station and we allowed her to buzz about a bit with her jetpack. Which she did.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022H7jAUXx.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/H7jAUXx.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022NH5ZCuC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/NH5ZCuC.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOur guys eventually reached the Mün. They indeed got closer than the gals and too asked for a spacewalk so they could get a better view. Since the passengers were distracted anyway we were fine with it.\n\u003C/p\u003E\n\u003Cp\u003E\nMort seems as happy beeing outside as he was on the pilot seat - this must be quite impressive for him.\n\u003C/p\u003E\n\u003Cp\u003E\nJust a dusty rock, but so beautiful in its cold dark stillness, said Elbart. He must be very impressed as well, since he was actually talking.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022HRnB1kq.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/HRnB1kq.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u00220kBrsvd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/0kBrsvd.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOur girls came back to the airport in the meantime. They would have to wait for the Traveller to come around and do the next trip, since we only had this one passenger plane. Although now we thought more about that permanent space plane idea. It would make loads of money and probably pay for itself quickly.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022QETlgPT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/QETlgPT.png\u0022 width=\u0022635\u0022\u003E\u003Cimg alt=\u0022fE4JcCd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022357\u0022 src=\u0022http://i.imgur.com/fE4JcCd.png\u0022 width=\u0022635\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe had to talk to Macner again and maybe to Debty as well. There was some downtime until the next launch and maybe we could use this.\n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2018-03-15T20:00:38Z","Content":"\n\u003Cp\u003E\n(Update)\n\u003C/p\u003E\n\u003Cp\u003E\nAfter losing - in that order - my computer, all my data and all my free time, I managed to rip some of my files from the clutches of the dead HDD and was suprised to find my game save data intact. I patched together some mods to work with the latest version of KSP and I think I can continue where we left off, since the updates didn\u0027t change much about our stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nFor now, at least Mort and Mirella are still able to fly the Traveller\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m1aEkmn.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/m1aEkmn.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-16T08:25:02Z\u0022 title=\u002203/16/2018 08:25  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 16, 2018\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2018-03-19T16:14:15Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022160\u0022 src=\u0022https://i.imgur.com/MRt1lYF.png\u0022 width=\u0022256\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo Macner called us into the hangar to show off his efforts and also what he was working on. Influenced by our other great planes and supported by Debty, he managed to knock out a way to increase the efficency with our Mün flyby tourist contracts and make us lots of money. To our suprise it was really small and light and we were very happy we invited him into our space program. Our planes - good looking as they were - had apparently been far too large and expensive, if this could get into space and close to the Mün on its own.\n\u003C/p\u003E\n\u003Cp\u003E\nHe then informed us that it couldn\u0027t actually go into space.\n\u003C/p\u003E\n\u003Cp\u003E\nIt had to be \u003Cem\u003Ebrought\u003C/em\u003E up.\n\u003C/p\u003E\n\u003Cp\u003E\nWe were close to getting out of the hangar and shutting the door on that ridiculous and useless thing, when Debty threw in that due to its low mass, high efficiency engine and aerobreaking on return it could do three Mün flybys on one refuelling run with fuel to spare. That did make us turn back around and listen. She explained, that since we had no rockets, we could do a contract with KASA and pay them to deliver it into orbit. Afterwards we would just keep it up there and transfer the tourists over via our already established space station. We might have fainted slightly when she showed us what they charged for tonnage. We then fainted quite some more when that turned out to be the price per kilogram. Debty then revived us by doing calculations in front of us that showed how quickly we made that money back in fuel savings on our own.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only hitch left was - of course - that we really hated the KASA guys. So we brought the new plane over to their space centre in the middle of the night and dumped it onto their front yard with the delivery instructions and money attached, signed by a fake middle man and company.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter we had recieved word of the successfull delivery, we shoved all our pilots into the Traveller and told them to go up to the specified orbit and coordinates.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022DuJq73wl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/DuJq73wl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022vNlN7sql.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/vNlN7sql.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThats when they started asking questions and we noticed we hadn\u0027t actually told them what they were supposed to meet up there. So we just explained that a suprise was waiting for them.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022QRglqYll.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/QRglqYll.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe people from KASA seemed to have packaged our plane. It definitely looked more round and bulbuous than before. We pondered on how to unwrap it. Meanwhile Mort was the first one to hop out and get a closer look.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Lk6wet8l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/Lk6wet8l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022VAxVTvXl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/VAxVTvXl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere is a button, he said as he already pressed that button.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u002273ntImGl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/73ntImGl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022iqHznmpl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/iqHznmpl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022a5Jrb2fl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/a5Jrb2fl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn space one apparantly cannot hear the \u0022poof\u0022 of an exploding clamshell fairing. Our guy and gal pilots were sufficently suprised about the new plane and since Mort had done the honours of the unboxing event, he got to name it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Snubnose. Well, we already had the Levitating Honeybadger.\n\u003C/p\u003E\n\u003Cp\u003E\nHe called over Mirella and volunteered to do the first flight. To get started, he got in and got rid of the rest of the fairing.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022r4xdi5fl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/r4xdi5fl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022VnjGrkHl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/VnjGrkHl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHe then noticed that there was no fuel in the tanks. We explained how much the fuel weighted and how much cheaper it had been that way. Also, we had a space station somewhere around there with loads of fuel. Mort remarked that it would be very difficult to get there without any.\n\u003C/p\u003E\n\u003Cp\u003E\nTelssa quickly suggested siphoning some fuel from the Traveller into the Snubnose so it could make its rendezvous with the station. So we told them to do just that.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022BK8OdgZl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/BK8OdgZl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022bQGmAh8l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/bQGmAh8l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter decoupling Telssa and Elbart returned back to us while Mort and Mirella met up and docked with the station. They did complain a bit about the low powered engine but otherwise were very happy about the view from the raised cockpit and seemed all around content. We suspected that they raided the snack cabinets of the Traveller while the fuel transfer was in progress.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00222syDUlql.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/2syDUlql.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022rr4jT8Dl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/rr4jT8Dl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022gLsE531l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/gLsE531l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the successful engagement we called the Traveller back up with a full load of tourists and a double load of snacks.\n\u003C/p\u003E\n\u003Cp\u003E\nWe had to introduce some sort of crew rotation between bringing tourists up and getting them out into space since it was quite a long trip and we didn\u0027t want to overstress our pilots by doing multiple in a row.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022M7P5jp7l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/M7P5jp7l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022XzWIkLSl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/XzWIkLSl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe made all the tourists climb down the narrow center tube of the station and thought about another expansion. If this was to work out, we would need a much nicer place up there. So we gave our engineers something to do with the rest of the discarded plane parts and leftover construction materials (we also counted them - no new ones).\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022i8STOLgl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/i8STOLgl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00224iwwA9dl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/4iwwA9dl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-22T07:51:58Z\u0022 title=\u002203/22/2018 07:51  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 22, 2018\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"roboslacker","CreatedById":175473,"CreatedDateTime":"2018-03-19T18:20:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223327671\u0022 data-ipsquote-contentid=\u0022152715\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221521476055\u0022 data-ipsquote-userid=\u0022164793\u0022 data-ipsquote-username=\u0022Cherubiel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Cherubiel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a5Jrb2fl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/a5Jrb2fl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn the event of an emergency, is the \u003Ci\u003ESnubnose \u003C/i\u003Ecapable of landing on Kerbin?\n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2018-03-19T19:26:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223327799\u0022 data-ipsquote-contentid=\u0022152715\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221521483636\u0022 data-ipsquote-userid=\u0022175473\u0022 data-ipsquote-username=\u0022roboslacker\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, roboslacker said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn the event of an emergency, is the \u003Ci\u003ESnubnose \u003C/i\u003Ecapable of landing on Kerbin?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt is very much designed as emergency landing craft for the emerging space station. Its glide ratio isn\u0027t the best but it can be touched down slow and soft enough to survive a water landing completely intact.\n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2018-03-19T21:09:15Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022160\u0022 src=\u0022https://i.imgur.com/MRt1lYF.png\u0022 width=\u0022256\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhile the Snubnose was drifting towards the Mün, our engineers were hard at work welding together whatever would ultimately fit into the cargo bay of the Persephone. To earn us some more money during construction, Telssa and Elbart made a fully booked trip into orbit with the Traveller- though it seemed the demand for getting a close encounter with another celestial body was much more in demand.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022VnJQyTml.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/VnJQyTml.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022R852CQkl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/R852CQkl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey were chatting away with the Mortimer and Mirella on the comms the whole time, eager to hear about the anemities on the new plane, Snubnose. We had added fully reclining seats and besides the improved snack station Macner came up with a coffee machine that worked in zero G. Since we had all these things we advertised first class tickets. It does count, even if there is only one class available.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen they came back down, the first part to be added to the station was ready to be delivered (for a much lower cost then what KASA asks for we might add). So Telssa and Elbart hopped out of one plane into the other and took off as the station drifted into the right position for interception.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022rFX05Dyl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/rFX05Dyl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022JNpqKXQl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/JNpqKXQl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nElbarts exceptional skills on the video game controller made him the first choice to do the unloading. There would be more chances for his lady co-pilot to get a go as well.\n\u003C/p\u003E\n\u003Cp\u003E\nThere better will be, I want to fly these cutesy little things as well, she had to say on that.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00229RBHmopl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/9RBHmopl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe new part was a multi coupler with added fuel reserves for the tug and active radiators. Apparently thats needed in space even though its very cold out there - we had checked.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022R18oQU4l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/R18oQU4l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTwo nearly identical girder sections were added next, for energy production and storage. Our energy source is fully renewable of course. As renewable as a sun can be anyway. Telssa and Elbart were switching for drone control each time and didn\u0027t even make a dent into our fuel reserves.\n\u003C/p\u003E\n\u003Cp\u003E\nIn one of the hangar back rooms our gound crew were looking through they had found another fully intact private jet. So they immediately cut it apart to repurpose the comfy passenger comparement. We now had our habitat sections for the station. Even better than the slightly modified caravans we had originally planned to use.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022jnRkA5El.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/jnRkA5El.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00222curQ9Kl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/2curQ9Kl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe station was really taking shape. We would like to point out here, that an ugly shape is still a shape.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile this was going on, the Snubnose was getting in close with the Mün and Mortimer called to inform us to \u0022forget the old distance record\u0022. He was getting closer to the Mün than we ever had been.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022IB16hY3l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/IB16hY3l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022T6vTTSSl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/T6vTTSSl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Persephone made three more trips to add more habitat sections - two of them included ample space for provisions and whatever else Macner had deemed useful for space-living.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter we saw how the station turned out, we felt very proud. This was serious stuff we were doing here. Even if it was on the cheap and on parts that we found lying around in dusty storage rooms and behind forgotten doors. The station needed a name now. Maybe Elbart would name it, if we can get him to talk.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022lzweP6Al.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/lzweP6Al.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the last delivery these two hard working delivery kerbals took a well deserved vacation for a few hours while the Snubnose came back to aerobrake its orbit back into a more circular shape. Mirella did some expert piloting there on the second maneuver - it takes two to safely slow down and the last one always has to be rather precise.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022f5s2SVSl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/f5s2SVSl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022s9Z5ZjPl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/s9Z5ZjPl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBefore they caught up to the station, Telssa and Elbart took off in the Traveller and actually made the rendezvous before them. While she did the docking maneuver (slow, precise and resourceful) we heard him say that the station was their \u0022Sternenhafen\u0022 now. We had to look it up and decided that it would be a fitting name, even if wou could really not pronounce it (also we didn\u0027t know Elbart was from overseas, how exotic).\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022s2V0rGgl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/s2V0rGgl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00226poENNrl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/6poENNrl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMinutes later the Snubnose turned up at Sternenhafen as well and the eight passengers were transferred through the new and improved walkways. They seemed quite impressed by the change. Our pilots switched as well and we heard some more positive comments. Maybe we should go into the business of renting space real estate.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, there would surely be safety regulations and restrictions and we would need permits or something. We will stay with the easier flying-busloads-of-people-around-for-money thing for now.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u002225iBFb0l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/25iBFb0l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022aDAOIR9l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/aDAOIR9l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis would be the new routine for the Mün flybys from now on. The Traveller also could do the orbital roundtrips while the Snubnose is underway and we will sell more tickets than ever.\n\u003C/p\u003E\n\u003Cp\u003E\nDebty took the opportunity to confess to us that she had smuggled science equipment into some sections of Sternenhafen and nicely asked if she could go up and play around with it. First we were not sure about it - it was one less ticket sold and nobody pays for science. Then we remembered we could possibly one-up KASA and told her she could join one of the next orbit-and-back flights.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-22T08:12:47Z\u0022 title=\u002203/22/2018 08:12  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 22, 2018\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2018-03-22T13:41:30Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022MRt1lYFl.png\u0022 class=\u0022ipsImage\u0022 height=\u0022160\u0022 src=\u0022https://i.imgur.com/MRt1lYFl.png\u0022 width=\u0022256\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnother Mün flyby trip was planned. The Traveller with Telssa and Elbart at the helm boosted into orbit and closed in to Sternenhafen. It was very obvious that they were a good team on account of how well they got along when they thought we weren\u0027t looking. Elbart was the laid-back and thoughtful ying to Telssas enthusiastic and driven karate (or something).\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Khu7Ua0l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/Khu7Ua0l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022n4d5Z2rl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/n4d5Z2rl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyway, a flawless docking maneuver happened and the Snubnose took in eight tourists plus provisions. Then it sped off towards a Mün encounter.\n\u003C/p\u003E\n\u003Cp\u003E\nMort was right about the name. The plane does have a unfavorable front section.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022tCBWZQhl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/tCBWZQhl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022RpXBMI0l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/RpXBMI0l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe then noticed that Macner had requested we visit him in the hangar some hours ago. So we got another coffee and then walked over there. Luckily we only interrupted some routine maintenance work. He started explaining that he had some made contact to important people in the aeronautics industry from when he worked with KASA and was offered a good deal on new high performance airplane parts because they thought he still was with them. We immediately told him to throw out whatever lie he needed to, because airplane parts are what we always needed. So he went off to get us cool stuff through good old-fashioned deceit.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen we got out, the Traveller was already back, so we shoved in some more tourists and fuel and sent it back into orbit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022AQ8a4XOl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/AQ8a4XOl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe didn\u0027t have to wait long for Macner to call in. He arranged a delivery to KASA HQ and we only had to intercept it. Which we did quite successfully of course. We knew the way around their facilities blind and deaf.\n\u003C/p\u003E\n\u003Cp\u003E\nIt turned out we got latest generation turbofan engines and quite impressive shock cone intakes coupled with engine precoolers for even more performance within the atmosphere. Our old rocket engines would be exchanged with aerospike engines that ... well, Macner kept talking and we were just nodding along at this point. We would take whatever upgrade we could get. Annoying KASA was a bonus. Our crew was told to upgrade the Persephone right away. Of course we wanted to see a test flight as soon as our pilots were back.\n\u003C/p\u003E\n\u003Cp\u003E\nTelssa turned out to be more than willing to snatch the maiden flight away from Mortimer for once. She listened to the specs, dragged Elbart into the cockpit and took off. It turned out the intial ascent became quite a bit easier since they went up quite steep, gaining speed all the way and only flattened out 14 km up.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00221ewFM78l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/1ewFM78l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022TZ3uxL5l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/TZ3uxL5l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe new engines pushed the Persephone higher and faster before the rocket engines had to take over at 20 km above sea level. Even Elbart seemed amazed at that point.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022nC54dZbl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/nC54dZbl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022UoyvwfVl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/UoyvwfVl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe have much more fuel left over, reported Telssa. Indeed they would have more room for maneuvers since their ascent was more efficient than before. We told them to go to Sternenhafen and transfer the leftover fuel to top off its reserves.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022GRRyYGGl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/GRRyYGGl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Gwymjc1l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/Gwymjc1l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey met up with the station and docked. All the while Telssa was raving about the upgrades to Mort. He didn\u0027t seem to mind that someone else got to be test pilot for once.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022mAbPO5Yl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/mAbPO5Yl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter transfering fuel and some leg stretching in zero G they noticed a transmission coming in to Sternenhafen. It turned out to be from orbit as well. A female, claminig to be a pilot at KASA, asked for our help. Since this sounded a bit dodgy we tried to get some more information, but we only recieved screaming and explosion noises for a bit and then radio silence. We still recieved a signal from her last position though.\n\u003C/p\u003E\n\u003Cp\u003E\nWe will save her, volunteered Elbart and Telssa seemed for it as well. We had to remind them that they were using the wrong plane for that. But luckily the Traveller was already beeing finished with its upgrades so we sent them down to change over. Another advantage of our planes - they were quickly made ready. In no time our pilots were on intercept course with the unknown pilot. Only after they took off we noticed that Debty was sitting in the passenger compartement. Well, we did promise her a trip to Sternenhafen.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022TpHd6Qrl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/TpHd6Qrl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022K51Q0pdl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/K51Q0pdl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen they got closer to the signal, the comm connection to the unknown pilot came back online. She sounded excited and very happy when we informed her that she was about to be picked up. Her name was Daster, she explained, and that she was testing a spaceplane for KASA that developed quite severe problems on the way up that ended in a slight complete disassembly by explosion. When the Traveller got closer, it turned out she was drifting in a spaceplane cockpit designed very much like ours. We were about to be mad about the obvious design theft by KASA, but we do buy these parts stock - so anybody could do the same.\n\u003C/p\u003E\n\u003Cp\u003E\nSince Daster had her very own jetpack, she just disembarked her wreck and flew over to climb aboard. While she was amazed about our plane and its ability to not only get into space in one piece but its history of doing that countless times already, we followed our tradition of stealing KASAs people away and offered her a position with us.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022K51Q0pdl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/K51Q0pdl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022H5o2V1Ul.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/H5o2V1Ul.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe accepted before she recognized Debty, who had also worked for KASA and who she had met a few times previously. It seemed those guys took horrible care of their people - they did tend to get lost in space and saved by us. Telssa introduced herself and Elbart and started to talk about piloting and planes. It seemed our new gal had also been a pilot for all her life and already did lots of hours with supersonic planes. She will make a great addition to our team we think.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next stop was Sternenhafen, where Debty disembarked with quite some luggage. She was to stay for longer and engage in some space science stuff, which (for whatever reason) was her lifelong dream. Daster was shown around the station, which she hugely enjoyed.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Fez9AF0l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/Fez9AF0l.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen we got the Traveller back down, the Snubnose was not yet on its way back. Since there were always more tourists, we quickly got another fully booked orbital trip to send it back into space. It seemed Telssa and Daster had a talk in the meantime, because the latter was now in the cockpit together with Elbart and Telssa had thrown her feet up in our airport food court. It was nice of her to offer the new pilot her seat, even if that meant she had to suffer through an extra long lunch break.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022986MSTjl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/986MSTjl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022efbkNOpl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022https://i.imgur.com/efbkNOpl.jpg\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith few words Elbart explained her how everything worked and how the things went with the Traveller. She seemed to pick things up easily and we were already planning her in for future missions. An additional pilot was quite useful, even though our planes were doing the pilot/co-pilot thing.\n\u003C/p\u003E\n\u003Cp\u003E\nWe also wondered a bit about her name. She did say \u0022Daster with an \u0027a\u0027\u0022, but we think she just misspelled \u0027Duster\u0027. We will never know though (because we won\u0027t ask - some people just have a weird name and it\u0027s not nice to remind them).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Alpha 360","CreatedById":166007,"CreatedDateTime":"2018-03-24T17:44:24Z","Content":"\n\u003Cp\u003E\nI like this a lot! When are the Mun orbit missions going to occur? Can\u0027t wait for those as well as the question of when will the KASA stop giving the spaceport access to the tracking station. Then there will be an, interesting situation.\n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2018-03-26T19:08:49Z","Content":"\n\u003Cp\u003E\nHaha, I haven\u0027t thought about KASA revoking the access to their tracking station. It would be pretty hard to make these timed launches and rendezvous then. Although with the money the tourist contracts are bringing in and the low costs of the spaceplane launch (its less than 2k for 75km orbit and back) the spaceport could buy its very own tracking station - if they were willing to part with the cash.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-26T19:35:19Z\u0022 title=\u002203/26/2018 07:35  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 26, 2018\u003C/time\u003E by Cherubiel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2018-03-30T19:55:19Z","Content":"\n\u003Cp\u003E\nI\u0027ve made a 24 seater plane and I very much got to the limits of the stock contract system. Even with cheating new contracts in, it\u0027s hard to fill up the whole thing. Are there mods around that help with custom contracts I can just put in?\n\u003C/p\u003E\n\u003Cp\u003E\nI also took a look at the tourism\u002B mod and I am not yet sure if it would be the right thing, since there are some very different missions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220cw5g3h.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/0cw5g3h.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}