{"TopicId":157079,"ForumId":51,"TopicTitle":"I did my first manned Duna landing and return","CreatedByName":"Souper","CreatedById":86003,"CreatedDateTime":"2017-02-27T23:15:41Z","PageNum":1,"Articles":[{"CreatedByName":"Souper","CreatedById":86003,"CreatedDateTime":"2017-02-27T23:15:41Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022WG2fyUb.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022https://i.imgur.com/WG2fyUb.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI have never in my entire time playing KSP returned from Duna. Not once. I thought it was too hard. But that\u0027s OVER! Not only did i land on Duna and return in career mode, i also did it without using an orbiting return module or anything like that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPost your early first-time-ever-done pics. I want those stories.\n\u003C/p\u003E\n"},{"CreatedByName":"Souper","CreatedById":86003,"CreatedDateTime":"2017-02-28T03:09:36Z","Content":"\n\u003Cp\u003E\nWait, this should be in Mission Reports.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2017-02-28T03:27:43Z","Content":"\n\u003Cp\u003E\nI don\u0027t have the pictures with me right now, but there are several milestones that each KSP player reaches (Well, not all of them) that open new gateways.\n\u003C/p\u003E\n\u003Cp\u003E\n     First orbit: I\u0027m getting the hang of this game! (Me: Toddler Steps III or something like that, back in 0.19.)\n\u003C/p\u003E\n\u003Cp\u003E\n     First Mun/Minmus landing: I can actually enjoy this game! (Me: I forget the name, but it was a super overbuilt manned Minmus landing, with two Mun probes as my only previous experience at landing on airless bodies.)\n\u003C/p\u003E\n\u003Cp\u003E\n     First docking: Opens up new possibilities, like giant spaceships and stations and other cool things! (Me: Docker A and Docker B. Took forever. At first I though \u0022Oh, cool!\u0022 But my real \u0022I can dock!\u0022 moment was the first additional module of Space Station Epic. I swear, it took me two hours to dock it! I felt so awesome afterward! And now, I\u0027m up to Space Station Epic V, which is about a hundred meters across!)\n\u003C/p\u003E\n\u003Cp\u003E\n     First precision landing: Woohoo! I can build bases now! (Me: I don\u0027t remember, probably Minmus Base Python?)\n\u003C/p\u003E\n\u003Cp\u003E\n     First manned Duna landing and return: Woah, I can do anything in this game now! (Yeah, this is true! After Duna, you can basically go anywhere!) (Me: I forget the name, but it was a two part ascent module and lander. I felt so cool climbing Jeb dramatically down the ladder!)\n\u003C/p\u003E\n\u003Cp\u003E\n     First ascent from Eve: Woah. I have truly mastered this game! (WOOOHOOO! If you need more info, I think it\u0027s in part 29(?) of Project Intrepid. It was a huge, five man ship that was brought to Eve by a 100 meter long mothership.)\n\u003C/p\u003E\n\u003Cp\u003E\n     Do a minor impossible thing: Oh, cool! I got a dozen likes on one post! (I\u0027ve done three. One being a working ion plane in 1.1, two, I built a steampunk Mun base using only solid rocket boosters (Yes, you heard me!) and three, sending 916 Kerbals to Minmus in one launch!)\n\u003C/p\u003E\n\u003Cp\u003E\n     Do a major impossible thing: Why did my like counter suddenly jump 200 points? (I have never done one of these. But to list a few: the first stock helicopter. The Rubik\u0027s cube. That first guy to do a Jool ascent. The EVA grand tour. The guy who went to Eve and back twice with no refueling and the same ship. If you achieve one of these, you basically have become one of the few overlords of KSP. Cherish it! Now, whatever can I do to get into this group...)\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-03-02T19:20:54Z","Content":"\n\u003Cp\u003E\nCongratulations. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Nice feeling, isn\u0027t it? \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, moved to Mission Reports. \n\u003C/p\u003E\n"},{"CreatedByName":"JedTech","CreatedById":104003,"CreatedDateTime":"2017-03-02T20:30:21Z","Content":"\n\u003Cp\u003E\nHere is one of my fun trips to Duna. See entire album here: \u003Ca href=\u0022http://imgur.com/a/l06P2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/l06P2\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Ca href=\u0022http://imgur.com/a/l06P2\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022lhpFx2m.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/lhpFx2m.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-02T20:38:06Z\u0022 title=\u002203/02/2017 08:38  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 2, 2017\u003C/time\u003E by JedTech\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2017-03-03T09:58:08Z","Content":"\n\u003Cp\u003E\nCongratulations. And with three kerbals and a luxurious crew cabin!\n\u003C/p\u003E\n\u003Cp\u003E\n It must feel great to land on your first planet. It doesn\u0027t beat the first mun landing.. but it still feels amazing, huh \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith this achievement unlocked.. what\u0027s your next plan?\n\u003C/p\u003E\n"},{"CreatedByName":"Souper","CreatedById":86003,"CreatedDateTime":"2017-03-03T12:11:19Z","Content":"\n\u003Cp\u003E\nI\u0027m going all over the system. I\u0027m gonna go to Dres or Gilly next.\n\u003C/p\u003E\n"}]}