{"TopicId":158813,"ForumId":51,"TopicTitle":"Imagining a Kerbal Future: What Would the Future of Kerbals Look Like? (Chapter XLIII: Epilogue)","CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2017-04-06T18:02:39Z","PageNum":16,"Articles":[{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-07-02T21:03:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223408987\u0022 data-ipsquote-contentid=\u0022158813\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530551958\u0022 data-ipsquote-userid=\u0022133334\u0022 data-ipsquote-username=\u0022MatterBeam\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, MatterBeam said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI really like the trade and relations charts of the Kerbol system.\n\u003C/p\u003E\n\u003Cp\u003E\nGreat job, keep it up!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah. I agree. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/141267-saturnianblue/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022141267\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/141267-saturnianblue/\u0022 rel=\u0022\u0022\u003E@SaturnianBlue\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-07-08T17:18:28Z","Content":"\n\u003Cp\u003E\nEnjoy a view of the beaches on Laythe, while I prepare the next chapter...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022n1M2h0A.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/n1M2h0A.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-07-08T21:01:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223412293\u0022 data-ipsquote-contentid=\u0022158813\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221531070308\u0022 data-ipsquote-userid=\u0022141267\u0022 data-ipsquote-username=\u0022SaturnianBlue\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, SaturnianBlue said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEnjoy a view of the beaches on Laythe, while I prepare the next chapter...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Ca href=\u0022https://i.imgur.com/n1M2h0A.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022n1M2h0A.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/n1M2h0A.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo pretty!\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-07-10T13:02:15Z","Content":"\n\u003Cp style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003ETHE JOOLIAN SYSTEM IN A COLONIZED KERBOL SYSTEM: PART TWO\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EChapter XXXVIII of Imagining a Kerbal Future\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(0,0,0);\u0022\u003EWar Scenario\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    We’ve covered independence movements, invasions, battles between corporations, and battles between nations, but we haven’t explored a planet vs. planet conflict. In this scenario, we finally explore the idea, with Jool and… Moho? (credit to Kerr of the Tough SciFi discord server for the proposal)\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    This might be a surprising choice, considering the more powerful planets of Eve or Duna appear as more comparable rivals. However, a Jool-Moho conflict gives us the opportunity to explore a war over a market—the energy market. Moho would have the vast resources of the planet to produce inexpensive solar panels to be placed either on the ground or in space. On the other hand, Jool has a massive supply of fusion fuel that can be launched and exported across the Kerbol system to power fusion reactors anywhere in the Kerbol system.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00226spIEtF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/6spIEtF.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EAlthough given the different fonts in this graphic it looks vaguely like a sci-fi font battle as well.\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    While Moho would have a population multiple times lower than the Joolian System, I also believe that on a per capita basis, Moho would have plenty of industry. As a result, the forces may be surprisingly closely-matched.  \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    Each side has the same goal—to successfully dominate the energy market.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    I would guess that Jool would have an overall larger military, in order to protect the entire system from attack. With a large store of fusion fuel, it would be able to build powerful warships with high delta-v. I would assume that the higher development of the system would mean a capability to build more warships. The Joolian System also has the higher position on the gravity well. Mass driver launched projectiles will gain significant velocity as they fall towards Moho. If they manage to survive countermeasures or avoid detection, they could cause havoc.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    Moho would have less of a need to build such a large military, though it would probably possess the capability to build one. It would also have relatively low supplies of fusion fuel, making it difficult to field a large interplanetary fleet. However, the abundant access to solar energy allows it to power massive weapons, such as swarms of rockets using solar-electric drives, and massive laser weapons for striking targets possibly in the Joolian System. Both options are made relatively easy by the fact that the infrastructure for these weapons likely already exist, since Moho would already have beaming stations to send power to rockets and to distant stations and bases without access to good sources of energy. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003C/span\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EWhile the conflict is mainly between the interests of these two worlds, other worlds will likely become entangled in the conflict, as they have to make a decision about where to get their energy from. Some places will remain fairly unaffected, as they can source a lot of their energy from home, but others will be placed in a difficult position.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe typical targets for attack remain, but given that the conflict is particularly about energy, there will be more focus on those targets. Typical targets include those like the water supply, ways to export products, and space superiority. The water supply for the Joolian System is practically impossible to eliminate, but the planet—the site of the fusion fuel source itself is rather vulnerable, with water vapor comprising only about 66 ppm of the Joolian atmosphere, according to KSP Interstellar. Though more frequent than the fusion fuel, that isn’t very much. On Moho, the water supply is secure in the poles, but only in the poles. If the transport lines to the equator can be cut, then that threatens many of Moho’s colonies. Ways to export products will be given more priority than usual, especially the ways to export energy. Lasers will become a major target for attacks against Moho, though making those attacks will be difficult, given the destructive nature of the target. Mass drivers and other various delivery methods will become the focus of bombardment against the Joolian System, since that is the likely way most fusion fuel will be exported. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    The targets related to energy owned by Moho will primarily be the solar arrays. A few may be located on the surface, but I suspect most will be in orbit. A few will likely be in low Kerbol orbit—a truly difficult location to attack. As for Jool, the target will be the scooping aircraft. These targets, however, would likely require an attack from relatively nearby or with a long-distance, high-area, high-damage weapon such as a superlaser. This is because the aircraft would be small compared to the solar arrays, and would also have some propulsive capabilities. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    I think that in this war scenario, the worlds would mainly be taking shots at each other from a distance, and would not seriously consider invading the other side. This is because while invasion might allow direct control of the energy sources, it would also require them to defend a lot of other locations as well, in order to sustain the invasion.  I suspect that the war will continue until one side has suffered so much damage to its energy production that it agrees to a peace.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EDemographics\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAs it has been implied earlier in the chapter, Laythe will be where the vast majority of the Joolian System’s kerbals will live, likely hosting millions of Kerbals in arcologies located mostly on the islands, and perhaps a little on the water and underwater. In a rather distant second place will be Tylo, with most of its population located in cylinders in orbit. Vall will have a small population living in the ice, and possibly in the underwater ocean. Bop and Pol will probably have a few thousand Kerbals, since there is relatively little need for Kerbals on the small mining moons. Jool itself will likely possess a similar amount, living on helium-3 mining installations.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe Joolian System’s population will come for a variety of reasons, but one is certainly dominant. That reason will be because it is simply a unique place to live. The resources of the system will result in many kerbals being sent to help establish mining colonies, but that alone would not result in millions flocking to the system. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EGenetic tweaking to fit the local environment is unlikely on Jool, Tylo, Bop, or Pol, due to the lack of an atmosphere, temperatures too cold, or there simply being too few people on the worlds to warrant such tweaking. However, Vall and Laythe could see some tweaking. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    Tweaking on Laythe would be fairly achievable compared to most other worlds. The main traits tweaking would aim for would be much greater resistance to ammonia, resistance to CO2, and possibly greater radiation protection. Eventually, such tweaking may become redundant when Laythe is terraformed. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    Tweaking on Vall would involve some radical work. Tweaking on this moon mainly focuses on one premise—that Kerbals or other lifeforms can be made to survive in Vall’s subsurface oceans. Essentially, merkerbals.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ERelations and Trade\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022tJ7DBRl.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/tJ7DBRl.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EFusion fuel will be a major export of Jool. Despite the massive difficulties in launching a ship from Jool into orbit, it is certainly doable, and the relative abundance of the fuel on Jool makes it competitive with other sources. This allows containers of helium-3 and deuterium to be launched into orbit and to a moon, where the containers will be picked up and loaded on interplanetary spacecraft. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EOne of the Joolian System’s major industries will be the tourism industry. The idea of seeing an enormous gas giant in the sky on an eerily Kerbin-like world will certainly appeal to many. If the effects of low gravity have not been counteracted effectively, then Laythe might also see tourism from those who want an experience like Kerbin, but would find the slightly higher gravity of Kerbin too uncomfortable.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EMoho: \u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EJool and Moho are likely to have only weak ties, or (as explored in the war scenario) could be enemies. Neither side has much to offer to the other, and in fact are more likely to compete over a similar market. This market would be the energy/propulsion market. Jool has vast stores of fusion fuel, while Moho has abundant solar energy. As a result, a sort of energy cold war could begin.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EEve:\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E The Joolian system provides yet another source of water for the water-starved world. With a very strong heat shield and a bit of maneuvering capability, a container can be delivered from Jool with only a kick from a mass driver. What Eve has to offer in return, however, is less obvious.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe Kerbin System:\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E The Kerbin System’s main contributions to the Joolian System are with the establishment of the colonies and a steady influx of people. In return, the Joolian System provides Kerbin corporations with an excellent place to operate equipment for various purposes. However, there is likely going to be some tension regarding independence.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EDuna: \u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAs stated in the Duna chapter, relations would be quite strong due to the investment Duna would put into the Joolian system, possibly establishing colonies there.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EDres/Asteroids: \u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ERelations with the asteroids will be strong. Jool provides a trading post and support site for mining operations, and Jool can profit by placing fees on the services they provide. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EEeloo:\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E Eeloo may supply radioactive fissiles to Jool, in exchange for equipment.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EI decided to try a different format for this last section. Instead of a short story like previous chapters, I have decided to write it more in the style of a tourist guide. My reasoning is that it better explores the hypothetical aspects of the Joolian System, which I sometimes had to force into with the previous stories.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EA Kerbiner’s Quick Guide to the Joolian System\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe Joolian System, with an enormous gas giant and five moons, three of which are comparable in size to other planets, has been the focus of travel, with its marvelous sites and culture. Before you go, here’s a quick guide from a fellow Kerbiner to the Joolian System.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EWe will start our journey with Laythe, the second largest moon and probably the main attraction on most trips. To reach this moon in particular requires a ride on a mass driver assembly in orbit around Tylo, the main hub for interplanetary travel. On the other side, a space tether grapples onto the vehicle, and a half-revolution later, the capsule will be on its way to Laythe’s surface, with either small rockets or wings to guide its descent. This is fairly inexpensive, considering the main access to Laythe in the early days was by rocket. However, an orbital ring is being built, that will decelerate the incoming capsules, and allow rapid access to the surface.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022GlGd0Cr.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/GlGd0Cr.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe people of Laythe are varying in opinion and background. Some Laytheians live on the world as a place for a retirement. Others live on Laythe simply because they want to and can afford to, with a job does not require them to be in any particular location. These two groups are carefree, indulgent, and relaxed, boosted by the fact that the effects of a rare habitat breach are quite mild, so they have one major issue they do not have to worry about. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThere are also other, less distinct groups, but we will skip over them to look at a relatively new group. Consisting mainly of younger Kerbals who have recently departed Kerbin, they have founded new communities with the intention of creating a “New Kerbin”, without the mistakes of the first one. Some of this group sees old Kerbin as doomed or too difficult to save. This dislike of Kerbin has made them the forefront of the Joolian independence movement, and puts them in conflict, especially with Kerbals on other moons, which depend highly on being able to maintain trade relations. As Kerbiners, it might be best for you to keep your head down around them.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ELaythe relies heavily on tourism, and as a result, they have plenty to offer to the average tourist. These include oceanic cruises, massive resorts, volcanic sightseeing, to name a few. To travel around the various islands, there are aircraft, but most travel, which is between the major population centers, is done through sub-ocean vacuum train lines. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe food of Laythe is interesting, to say the least. With genetic modifications, crops on Kerbin have been grown in the open on Laythe, with the addition of artificial lighting to benefit growth. The ease of growing plants has made Laythe the major food production site in the Joolain System, along with the orbital habitats. One of the most unique parts of the Laytheian diet is algae. Initially eaten by the early colonists, and popularized with the beginning of the terraforming effort, algae is surprisingly a staple food, thanks to the development of the various dishes that have made algae into a surprisingly tasty food. Having mentioned the alien life of Laythe, you may be wondering if that is edible. The alien life can peacefully coexist with Kerbals, but for obvious reasons their consumption is completely illegal. It is possible it could be found with a hard enough look, but it would be wise to stick with just watching the life in the aquarium.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe second stop on our journey is the green giant of Jool itself. Though the \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003Eland\u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E… rather \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003Ecloudscapes\u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E are a sight like none other, only a few people ever see the sights for themselves. The reason is that a ride down to Jool and the ride back up are both extremely expensive, the only access being rocketplanes, with high performance requirements driving prices up. Additionally, the ride into Jool is very intense. There isn’t much of infrastructure for tourism on Jool, mainly because Jool has focused mainly on fusion fuel mining. However, the sight outside is likely going to be the main attraction, in any case.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe smallest of the major moons, Vall is a world covered in ice. Transportation to Vall is similar to Laythe, though the tether will drop you off right on the surface. Once there, transport is primarily through subsurface trains, though trucks are often used for transport between smaller colonies.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe surface is quite desolate, being exposed to constant radiation. As a result, it is imperative to be in optimal condition before embarking on any travels across Vall, through which many unique sites can be found... \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EBelow the ice is the water mining operations on Vall. Compared to the people of Laythe, the people on Vall (and the other moons) have a rather different mindset. Proportionally, a greater amount of the residents work, and there is of course much greater risk involved in a habitat breach. The residents are, perhaps as a result, quite detail-oriented and generally tend to be more restrained. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00229n7l9Hp.png?2\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/9n7l9Hp.png?2\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ERecently, the construction of habitats in the subsurface ocean has begun. While life in these oceans has yet to be found, a visit to an ocean observatory in one of these habitats is a must-see. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAlmost every interplanetary traveller to Jool, unless they have chosen the smaller spaceports on Bop and Pol, will have been quite close to Tylo, the largest of the moons. The spaceports around Tylo are well-prepared for tourists, and have become the center of cultural exchanges within the Joolian System between each of the moons, as well as other planets.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EA short ride carries passengers to the tether, which delivers them to the surface. The tether is almost single-handedly responsible for major tourism on Tylo, since it was very expensive to access the surface with rockets, given the high gravity and delta-V required. It is hoped that an orbital ring like the one being built around Laythe will also increase the cargo delivered dramatically. Once on the surface, you have many natural wonders to explore, such as the massive caves, which are becoming host to massive cities. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EBop and Pol are outliers. Their low gravity and strange landscapes (especially Pol) would seemingly make them ideal targets for tourism like that which takes hold on Minmus, but for now, Laythe has become the focus of most activity regarding tourism. Accessing these sites from Tylo generally involves a launch via mass driver, and a deceleration phase with the use of laser or particle beam stations on the smaller moons. This cuts the time travelled considerably.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EBop is arguably the more boring of the two moons, but it does have its share of intrigue, related to some mythical many-armed sea creatures. How this connection ever formed is a mystery, but the moon’s nascent tourism industry has provided a few kraken-theme venues. Technically, Bop has the highest peaks in the Kerbol, at 22 km above “sea level”. This might seem like a daunting activity, but given Bop’s gravity, it is not difficult to achieve the distinction.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022r4R9FP4.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/r4R9FP4.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EPol’s landscapes are a sight worth seeing. The color palette of this moon is like no other, and the jagged rocks and high cliffs further make this an interesting trek off the beaten path. Travel is generally done on double-sided rail cars. If you can grab yourself a jetpack, do it—it’ll allow you to travel around the moon how you want, and you have an opportunity to jump off the cliffs. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThat about concludes this little guide—hopefully it has helped you narrow your choices down to where you want to romp about the Joolian System. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ERole and Conclusion\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    The role of Jool itself is as the powerhouse, providing fusion fuel to places that lack it. Laythe will be the new Kerbin, but with a strong emphasis on resorts, beaches and tourism. Vall is the “ice world”—given that fresh water ice is probably the main reason for colonizing Vall, this title is rather appropriate. Tylo is the “middlemoon”, being the one you generally travel to before heading to another location. Bop and Pol are the “outliers”, rather overlooked. Overall, the Joolian System is the system with a bit of everything—habitability, resource availability, and more.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;vertical-align:baseline;\u0022\u003EThanks for Reading!\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;vertical-align:baseline;\u0022\u003ENext: Eeloo In A Colonized Kerbol System\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-07-10T13:21:05Z","Content":"\n\u003Cp\u003E\nWHOOOOO! I\u0027d go to all the muns. \n\u003C/p\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2018-07-11T06:39:10Z","Content":"\n\u003Cp\u003E\nNice work on this one \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/141267-saturnianblue/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022141267\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/141267-saturnianblue/\u0022 rel=\u0022\u0022\u003E@SaturnianBlue\u003C/a\u003E! \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"obney kerman","CreatedById":171373,"CreatedDateTime":"2018-07-11T22:41:51Z","Content":"\n\u003Cp\u003E\nI love all the tourist attractions.\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-07-11T22:42:51Z","Content":"\n\u003Cp\u003E\nSo do i\n\u003C/p\u003E\n"},{"CreatedByName":"Laythe Squid","CreatedById":175666,"CreatedDateTime":"2018-07-15T00:19:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223413321\u0022 data-ipsquote-contentid=\u0022158813\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221531227735\u0022 data-ipsquote-userid=\u0022141267\u0022 data-ipsquote-username=\u0022SaturnianBlue\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/10/2018 at 8:02 AM, SaturnianBlue said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nbut it would be wise to stick with just watching the life in the aquarium.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would like to see that. \n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-07-16T13:32:46Z","Content":"\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EIt is the end of the road for a half-year long series! Only one world remains in the stock Kerbol System. The distant iceball of Eeloo. This chapter will admittedly be rather short, because although the world has a role to play, it certainly isn\u0027t the biggest.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EEELOO IN A COLONIZED KERBOL SYSTEM\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EChapter XXXIX of Imagining a Kerbal Future\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022lFozOvL.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/lFozOvL.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EGOVERNMENT\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    Eeloo is not particularly habitable—a bit of a surprise, given that geysers probably exist on Eeloo, and therefore there must be a source of liquid water. However, Vall is a more accessible option for a subsurface ocean world, as it is already in a place of significant interest. Instead, the interest is focused on the likely cause of heating—radioactive fissiles, which will provide fuel for nuclear reactors. The main groups interested in colonization would likely be either governments or corporations which are trying to secure a source of fissiles for colonies in the outer Kerbol System. As a result, colonization might begin quite early, in order to support colonies like Jool.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAs a result, Eeloo is likely to be a rather divided world, with many factions attempting to set up mining bases to secure their interests around Jool. Perhaps there will be a consortium to make sure that everyone’s interests are met, especially regarding the export of fissiles. In the end, Eeloo will likely not be independent on its own—the world is simply too limited in resources for that to happen. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cfont color=\u0022#000000\u0022\u003ETHE ISSUES FACING EELOO\u003C/font\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAs with Vall, there is a possibility that there could be life in the subsurface oceans of Eeloo. If the oceans are quarantined, it may make accessing Eeloo’s nuclear fuel deposits more difficult.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EEeloo’s remoteness and lack of resources will be a serious roadblock to any major development occurring on the planet. If Eeloo wants to become more than a mining site for fissiles and a tourist attraction very much off the beaten path, it will have to overcome these issues. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe colonies of Eeloo essentially rely on the price and demand of fissiles to remain profitable. If the price or demand of fissiles falls dramatically, the dwarf planet as a whole will struggle. Therefore, it is imperative that the Eeloo colonies eventually try to diversify into other markets. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EWAR\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EEeloo would be incapable of fielding a large force. While Dres has the resources and the construction sites to build a fleet, Eeloo is likely to lack even this, making it unlikely that Eeloo would ever build a force of its own. However, Eeloo could still find itself in conflict. One power on Eeloo may have claims to very rich uranium deposits, for example, and a nearby power might try to claim it for themselves. These powers may be associated with larger polities, which would assist each side in the conflict. Additionally, Eeloo has a purpose as a strategic base in an interplanetary conflict. With the high availability of fissiles, Eeloo might become a restocking site for Orion drive and nuclear warships to be based out of. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022FpuBSHK.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/FpuBSHK.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EOn Eeloo, militaries would be kept to ensure that the ships exporting the fissiles are not attacked, and to defend their territory, especially the fissile deposits. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe key priorities of an attacking force would be to secure a blockade, and to nullify the enemy uranium deposits. If Eeloo colonies are blockaded, they will be doomed. With no influx of supplies, and no way to export resources, the Eeloo colonies will eventually be starved of their resources, and they will either be invaded, or be forced to surrender. Given the state of Eeloosian colonies, an invasion might succeed on Eeloo. With the limited resources of the colonies, they wouldn’t really have a way to defend themselves, and victory would mainly consist of taking the fissile deposits. The defenders do have one potential advantage, and that would be access to nuclear weapons, especially if their colony is the site of a warship base. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EDEMOGRAPHICS\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe population of Eeloo would be very limited, perhaps as low as a few thousand, and probably being nothing more than a hundred thousand, unless the dwarf planet has overcome its major obstacles. Most would probably live in orbit, since there would probably be relatively little need to be stationed next to the mining equipment itself. This would also benefit the colony early on, when ways of adapting the Kerbal body to low gravity haven’t been invented.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EMost of the population will have come to work on the fissile mining operations. They would mostly be part-time residents, perhaps spending a few years at the site before coming home. I would only expect a few to come to Eeloo simply to live—Vall provides a much better alternative for an icy world with a subsurface ocean, unless the people coming to Eeloo want to be as isolated as possible. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EOnly a few tourists would come to Eeloo. The world is far away from any other planets, and the low demand for passenger journeys from the beginning would make it difficult for tourists to go there. Once there, Eeloo is fairly exciting, but unless tourism has actually become quite profitable, there will be little infrastructure to support them.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EEeloosians would be unlikely to adapt themselves to the world, except perhaps for the gravity. The surface is too harsh, and while the oceans might be a place to adapt to, I mostly doubt they would, because many of the residents would plan on going home. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ETRADE \u0026amp; RELATIONS\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ENuclear resources and water ice are likely to be the main material exports of Eeloo.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022143bnOg.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/143bnOg.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EMoho:\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E\u003Cstrong\u003E \u003C/strong\u003EBoth planets are likely to have weak ties. Moho doesn’t need radioactive material, and can get water ice from other places, and the same goes for Eeloo and procuring equipment.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E\u003Cstrong\u003EEve:\u003C/strong\u003E \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe purple planet would probably be self-sufficient regarding radioactives, especially once the Kerbol System is heavily colonized, since Eve would gain access to its surface resources by then.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe Kerbin System: \u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe system that will probably be the spearhead of Eeloo colonization, supporting the effort with plenty of equipment, in hopes that it will supplement further colonization.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EDuna:\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E\u003Cstrong\u003E \u003C/strong\u003EI don’t think ties would be very strong—Duna has its own supply of fission fuel, though it is not as much as Eeloo’s. It is also self-sufficient in regards to water ice, and therefore, Duna would not interact with Eeloo.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EDres/Asteroids:\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E The two worlds will likely have strong ties. Dres would probably lack radioactives, while Eeloo would lack the high concentration of metals that the asteroids provide. As a result, a bond may begin to form.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cstrong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe Joolian System:\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E\u003Cstrong\u003E \u003C/strong\u003EThe system will likely benefit from having easy-to-access fission fuel, before they can depend on their own deposits. Though in terms of planetary order, Eeloo may be quite close to Jool, the world is still too distant to be very connected to the Joolian System.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ECULTURE\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EGiven the relative lack of material resources on Eeloo, Eeloosians may be very careful to conserve resource usage, and likely become quite restrained. The isolation from most other worlds will likely mean a culture will develop quite quickly. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ECONCLUSION\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EWe have reached the end of the road—with the combination of this set of IAKF chapters and the earlier ones discussing the process of colonization itself, I have overviewed both the near-future, and far-future aspects of the many planets of the Kerbol System. I hope that you have enjoyed this series, and the next chapter will bring a short set discussing nothing less than space warfare—as applied to Kerbal Space Program. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;vertical-align:baseline;\u0022\u003EThanks for Reading!\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;vertical-align:baseline;\u0022\u003ENext: Space Warfare In KSP\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2018-07-19T14:59:41Z","Content":"\n\u003Cp\u003E\nCongratulations on finishing the series!\n\u003C/p\u003E\n\u003Cp\u003E\nPoor lone Eeloo.\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-07-19T21:52:47Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133334\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0022 rel=\u0022\u0022\u003E@MatterBeam\u003C/a\u003E Thanks! Poor Eeloo indeed—it would seem like Dres would be the overlooked one, but that isn\u0027t really the case.\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-07-20T00:18:19Z","Content":"\n\u003Cp\u003E\nCan you please do OPM and Kerbol Origins?\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-07-20T19:44:39Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/187595-the-minmus-derp/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022187595\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/187595-the-minmus-derp/\u0022 rel=\u0022\u0022\u003E@The Minmus Derp\u003C/a\u003E Not for the time being. Currently, I want to do the space warfare series, and I intend to dedicate more time to other KSP-related projects.\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-07-20T23:57:53Z","Content":"\n\u003Cp\u003E\nOk.\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-07-22T22:39:35Z","Content":"\n\u003Cp\u003E\nNext time on IAKF...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GTkbebh.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/GTkbebh.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2018-07-23T08:47:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223420361\u0022 data-ipsquote-contentid=\u0022158813\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532299175\u0022 data-ipsquote-userid=\u0022141267\u0022 data-ipsquote-username=\u0022SaturnianBlue\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, SaturnianBlue said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNext time on IAKF...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/GTkbebh.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022GTkbebh.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/GTkbebh.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOoo, interplanetary warfare!\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-07-26T02:09:54Z","Content":"\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EImagining a Kerbal Future has covered how wars may start, and how combat might progress from a strategic standpoint, but hardly about individual battles, and how they may be depicted in Kerbal Space Program, a game that isn’t particularly suited for space combat. In this series, I will focus on making a relatively plausible form of space warfare possible in a KSP setting. For additional information and an overview of realistic space warfare, I’d recommend Tough SF and Atomic Rockets, who explain it better than I can.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;vertical-align:baseline;\u0022\u003EOverview of In-Game Space Warfare\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EChapter XL of Imagining a Kerbal Future\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;vertical-align:baseline;\u0022\u003E*The Following Information Is Subject To Change—Follow Mod Updates!*\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;font-size:11pt;vertical-align:baseline;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003ESpecial Thanks to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133334\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0022 rel=\u0022\u0022\u003E@MatterBeam\u003C/a\u003E for helping with the chapter!\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EGiven that Kerbal Space Program is not a space warfare game (like Children of a Dead Earth, for example), there are significant issues in conveying space warfare that generally adheres to the principle of hard/tough sci-fi—being scientifically accurate or plausible, while hopefully remaining engaging. Since this involves in-game information, this chapter is relatively sensitive to change (this was written in KSP 1.4.1, without the Making History expansion).\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EWeapon Systems\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EFirst, a look at weapon systems. In general, weapon systems in space warfare tend to fall into three categories—lasers, kinetics, and missiles. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ELasers In-Game\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ELasers. Kerbal Space Program’s community offers a variety of possibilities for lasers. For example, KSP-Interstellar Extended offers a huge selection of lasers. However, those are for power transmission purposes, and not for weapons, at least without any modification. A mod that does have lasers for weapon purposes, on the other hand, is BDArmory (and any mods based off it with laser parts, such as SMArmory). \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022TzVPGSy.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/TzVPGSy.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe laser part of BDArmory in particular is the USAF airborne laser. Lasers cause damage to a hitpoint based system, with each part in KSP been assigned a number of hit points, which are subtracted when weapons strike the part. Each part also has an adjustable level of armor, which can protect against certain sizes of weapons and reduce the level of damage they incur, depending on thickness. The lasers in BDArmory also have a diffraction factor, so it depicts the decreased damage from further distances. If the weapons of the mod don’t cause enough damage, or diffract too much, they can be modified in the configuration files.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EProblems\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe lasers available in the mods are relatively low power, consuming power around the tens of kilowatts. However, this issue can be solved using the configuration files, to create much more powerful lasers. An issue with the BDA armor system in regards to lasers is that the hitpoint system in this case is not for vaporizing much or all of the armor, but rather for penetrating the part. This means that a relatively large, high hitpoint part can easily be destroyed when exposed to just a few seconds of 75kW laser fire at point-blank range. This means that lasers are given a potentially unfair advantage in-game.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAnother issue is that under the BDA guard mode (which allows ships to automatically fire weapons), the USAF laser only opens fire within 5 kilometers—this is because the “maximum effective range” in the configuration of this part is set at that distance. The solution is either to edit this range, or use radar to lock onto the target and fire the lasers in this way.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EKinetics In-Game\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAnything from a small gun to a giant electromagnetic gun fits into this category. This is the type of weapon KSP mods support the most, with hundreds of different guns to choose from. Of particular note are the few railgun parts that I have found in three different mods—SMArmory, North Kerbin Dynamics, and more recently KTech. These are the parts I took the most interest in—while conventional guns might play some role in space warfare, railguns and coilguns are much more likely to be part of the offensive armament. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EI tested the three railguns I had access to. First, the SMArmory railgun, which has a fire rate of 30 rounds per minute, and travels at 5000 m/s. Each nonexplosive bullet amasses 1.25 kilograms. When put together, this means each bullet has a kinetic energy of 15.625 \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E. The bullets can easily destroy an unarmored, low hitpoint part in a few shots, but will struggle with the addition of armor. However, the bullets can also pass through multiple parts, and cause some damage to all of them. This railgun in its default incarnation has a maximum deviation of 0.12 degrees, which makes it quite effective past 10 kilometers.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022p2kySQK.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://imgur.com/p2kySQK.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ESecond, is the NKD railgun, which fires the same bullets at only 6 rounds per minute. However, it does have a bullet velocity of 8.6 km/s, and a slightly better accuracy at 0.1 degrees. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022c1GSWVa.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/c1GSWVa.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe last is the KTech railgun. While it shares the same fire rate and velocity as the SMArmory railgun, it has two main differences. The first is that this weapon fires 14 kg bullets with an explosive payload, and generally causes high damage to the first layer only. The second is that the bullets do not deviate from where it was aimed.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EMissiles \u0026amp; Explosives In-Game\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EMissiles. In some ways, this is the weapon type KSP is best suited for, but in other ways is unsuited as well. While KSP, being first and foremost a rocket game, allows you to make a wide variety of missiles, building it with the usual rocket parts becomes unsustainable if dozens of these missiles are being launched, driving part counts into the hundreds, and affecting game performance. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ofcTePD.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/ofcTePD.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EHowever, mods like BDArmory do provide an alternative. While BDA is mainly focused on atmospheric missiles, it has the HE-KV-1 space missile. The missile is radar guided, and accelerates at a high-g force, with a few thousand meters per second of delta-V. If the missile arrives at the target and explodes at a close enough distance, it will annihilate unarmored ships. The damage done is more than what would be realistic, since in reality, all explosives have a very small area of effect in space, without a shockwave.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe KTech mod also has space missiles of its own, which are even more powerful, with sustained accelerations of over 10G—probably worth nerfing, unless you plan on having fusion/antimatter missiles in your setting. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EBoth missiles suffer from a strange problem—below at least 5000 kilometers, missiles perform very well—they will even lead an accelerating target, and generally succeed in intercepting it. Above this level, however, the missiles often turn completely wayward and off to nowhere in particular. One other missile option, using the modular missile guidance part to construct a missile with other in-game parts, seems to be completely ineffective at any altitude at orbital speed. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022isqDuQs.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/isqDuQs.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003EThe missile veers rapidly to the side, despite the target being straight ahead.\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EIf one is interested in creating a custom missile anyway, KSP certainly provides the tools to do so. However, I would recommend MechJeb to get a precise indication of closest approach, and BurnTogether for multiple missiles. All of this makes this option quite complicated, and especially difficult to use with relation to accelerating targets, but it does give the player full control. This allows options like putting nuclear payloads on the missiles.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EWhile missiles can achieve high velocity on their own, an additional boost is always welcome to help reduce the time the enemy can intercept them. This is where an upsized version of kinetics is very useful. How can this be achieved? For now, the best option is the Netherdyne Mass Driver mod. For a certain amount of electric charge, the mass driver provides a high amount of acceleration in an extremely short amount of time. This is useful for custom missiles, but it is less so for the BDArmory ones, which somewhat literally have a mind of their own. The main problem with this technique is that only so many missiles can fit into the barrel, and any reloading mechanism is sure to be complicated. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EActive Defenses\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EWhat is used to stop an incoming missile? While kinetic shells could also be intercepted in real-life, the shells in KSP cannot, because they are not actual parts. However, missiles can be intercepted, using the three weapon options above. Lasers would be very destructive point defense weapons at short range, especially considering the fact that KSP lasers don’t need to completely destroy the missile. However, the deflection the lasers cause that might throw a missile off course at long range is not a factor either.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EIn practice, the lasers were extremely effective at preventing the ship from being destroyed. Even against groups of 8 high-speed missiles approaching the ship every second or so, an array of 8 low-strength lasers held their own. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022QOGeJH5.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/QOGeJH5.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThere are several factors that skewed this result heavily, however. For non-accelerating targets, the missiles seem to concentrate extremely closely, meaning that one firing of the lasers can be enough to bring down the whole group. Second, the missiles have a bizarre tendency to explode around a kilometer from the craft—and with only a regular explosion. For these reasons, the lasers appear more powerful than they actually are.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EIf the ship has powerful lasers, that might be more than an adequate defense against missiles. An alternative option would be kinetic or missile defenses. In testing, this option proved to be relatively ineffective at stopping missiles.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EArmor \u0026amp; Damage\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022DoOk2wV.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/DoOk2wV.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe BDArmory armor system, partially mentioned above, doesn’t model materials and armor to the point that Children of a Dead Earth does, but it is still quite well done, taking into account factors like penetration, kinetic energy, armor slanting, armor thickness, as well as damage for certain modules. Additionally, there also appears to be a reactive armor module for modders. Lastly, the DCK FutureTech mod has a feature for regenerating hit points, to model self-healing armor.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EPart Count\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAt a certain number of parts, even the most powerful computers are going to start struggling. I certainly don’t have anything near that (a 2012 MacBookPro is not a gaming computer). While space battles containing a few ships aren’t likely to slow the game too much, ships with a lot of parts or just ships with a sheer number of them will. There are several solutions to this issue, and I’ll cover some of them in this following, and the others in a later chapter. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe first solution would be to simply reduce the amount of parts on each ship. This might mean that parts that mostly exist for aesthetic purposes should be removed, and even parts that serve functions, like armor plating, or custom-built missiles, should at the very least be simplified. The second solution would be to try to keep what the ship has, while reducing the part count. This can be done with a mod like the UbioWelding mod, which can “weld” multiple parts together to create a singular part. If the ship is to have an interior that the characters will be in, the interior should be separate from the actual ship. Lastly, the battle can be reworked to involve less parts at one time. This might mean relying heavily on missile combat, with only one fleet loaded into the game.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003E \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EShip Control\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EBDArmory provides AI parts for planes, tanks, and ships, allowing them to maneuver without the player’s input (aside from a few presets), but does not contain one for spacecraft. The first solution is to manually control each ship. Such a solution is fairly workable for a small amount of ships, but very quickly becomes tedious if the battle consists of many ships. The second solution would be to use BurnTogether, where a single ship can act as a leader, and the other ships act as a follower, which constricts individual ship movements, but allows the fleet as a whole to maneuver.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ESensors and Stealth\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022ay4tY5X.png?1\u0022 class=\u0022ipsImage\u0022 height=\u0022415\u0022 src=\u0022https://i.imgur.com/ay4tY5X.png?1\u0022 width=\u0022529\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ERange of the KTech radar part—1000 kilometers.\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe sensor options the mods provide for space warfare are fairly limited. The sensor that is generally relied on the most is the radar.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EStealth in space is not impossible, but it is at the very least very difficult to remain concealed at close ranges. While a few mods contain stealth features, the difficulty of stealth means that they shouldn’t be used for space battles. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EIssues with Load Ranges\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe default KSP game is fairly limited in regards to load range, the radius where ships are actually loaded into the game. Thankfully, the Physics Range Extender mod (a requirement for BDA) allows a player to set the load range to anything they want. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ECombat at High Velocity\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ECombat at high velocity is problematic in KSP. There isn’t much time to lock onto the target and begin firing, but the main issue is with missiles. Missiles would especially benefit from high velocity, but the rate of physics timesteps (how frequent the game “checks” what is happening) limits missiles to a certain velocity, since anything higher might simply pass through the ships, because the time steps were before and after when the missile passed through the ship. To mitigate this, it is best to use a mod like BetterTimeWarp, which allows customization of time warp, including physics time warp. This feature can be used to allow time warp rates lower than 1x, and slowing the game down to allow more physics timesteps to happen, and increasing the chances that the missile will actually crash into the warship. This is also a helpful feature for cinematics, to capture action that is usually over instantly.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EIssues with the Weapon Manager\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe first issue with the BDArmory weapon manager is that it doesn’t appear to be able to fire multiple types of weapons. I’m not sure of a way to solve this issue, other than activating the weapons manually and using the radar to lock all of them on to the other target.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EProjectile Weirdness\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E    \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe oddities involving the missile guidance may be related to another potential issue. It is that space combat might only work near stationary orbit. It has been reported that projectiles and lasers are aimed relative to the surface, which can cause them to be wildly off target outside of geostationary orbit. Proof of this can actually be seen in the second chapter of “Kerbin in a Colonized System” (picture below), where the lasers on the attacking warships that should be firing at the fleet of warships very nearby are firing to the side. In more recent testing, the railguns are generally accurate, though a test in solar orbit had the railguns consistently aiming at a point a degree or so away from the actual target. Interestingly enough, when I locked the radar manually onto the enemy target, it began to shoot accurately. In conclusion, it is always prudent to test whether the guns can aim accurately at a given location before fighting there.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00222LRrxmC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/2LRrxmC.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EIf there’s anything you’d like to see added, I’ll do my best to add it! Let me know!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;vertical-align:baseline;\u0022\u003EThanks for Reading!\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;vertical-align:baseline;\u0022\u003ENext: Space Warfare In KSP, Part Two\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-27T00:27:45Z\u0022 title=\u002207/27/2018 12:27  AM\u0022 data-short=\u00225 yr\u0022\u003EJuly 27, 2018\u003C/time\u003E by SaturnianBlue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2018-07-26T19:22:17Z","Content":"\n\u003Cp\u003E\nThat was really interesting \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I wonder if space warfare will ever happen in real life....hope not \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2018-07-27T01:36:14Z","Content":"\n\u003Cp\u003E\nIt sounds like a long list of problems to solve. I hope you have the time and energy to do it all!\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-07-27T02:23:46Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133334\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0022 rel=\u0022\u0022\u003E@MatterBeam\u003C/a\u003E Indeed! The testing I had to do for the chapter was one of the most tedious things I\u0027ve done in IAKF. Hopefully,  the other approaches (including the RPG option you proposed a long while back) might be less so.\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-08-07T14:29:47Z","Content":"\n\u003Cp style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;vertical-align:baseline;\u0022\u003EApproaches to Depicting Space Warfare\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:14px;text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EChapter XLI of Imagining a Kerbal Future\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe first chapter of the space warfare series focused on space combat specifically within the confines of the game and its mods, without any particular setup. However, this is not the only approach to depicting space combat for a KSP setting. This chapter intends to weight the pros and cons of each approach I have gathered.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EIn-Game\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022uBUhr9d.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/uBUhr9d.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe first approach is probably the most straightforward—depict the space battles in-game. The first benefit of this approach is that this is probably the one that’s the most enjoyable, since you can, for the most part, set up the battle, kick back, and watch the explosions. Second, it is the one that can be replicated in the easiest way by the typical KSP player, who likely isn’t creating a space warfare story. Lastly, it means that you are not required to select the outcome of the battle in advance, possibly leading to some interesting and unexpected results.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EIn my opinion, this kind of approach is well suited to keeping track of the overall picture, documenting the orbital movements, to keep track chronologically when the ships reach their targets, for example. For the actual battle, this option is ideal for battles with low part counts, and if you want a lot of pictures/screenshots to work with.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThis approach certainly is not without its flaws—KSP and its mods are not necessarily suited to depict space warfare, which means that what happens in-game will not necessarily translate to realistic space warfare, and balancing parts or creating new mods can be time-consuming. This is not an obstacle if the player is not determined to have very hard sci-fi space warfare, and will settle for generally realistic, but not so for someone who wants results as close to realistic as possible. The solution for that person does exist, however.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EScale Model KSP\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022a6sUaWl.png\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://i.imgur.com/a6sUaWl.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E(Kerbal for Scale)\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThis is not the solution—this is a subsection of the previous. While creating scale model craft is going to make the battle fundamentally less realistic, they do provide some benefits. First, they can create ships that give the impression of being more detailed while using less parts, since there is less empty space in the hull. Second, they tend to be more reliable, since KSP handles large ships poorly. Third, it means they can actually be launched into space conventionally, if you aren’t a fan of hyperedit (though hyperedit has always been a given in Imagining a Kerbal Future). \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThere are issues, however. In addition to the somewhat lower realism, the ships will be less suited to handle missiles—they will look oversized relative to the ship.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EChildren of a Dead Earth\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00220XNM0LM.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/0XNM0LM.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EChildren of a Dead Earth is a simulator that is specifically suited for the topic of space combat. There is even a mod for Children of a Dead Earth for the Kerbol System. While it is great for space combat, this option generally undermines the principle of Imagining a Kerbal Future, because Children of a Dead Earth is fundamentally not Kerbal, even with the Kerbol System (the look and style of the two programs are different). Additionally, KSP does provide more choice in regards to the battles, both in the battle (like maneuvering), and outside the battle, since Children of a Dead Earth limits itself to one set of battles in a scenario.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EFor writing a KSP story, however, this game can actually be quite helpful. Since it is more realistic, Children of a Dead Earth can be used to find more realistic results of a battle between ships, while KSP itself, with its greater choice in aesthetic choices for ships and graphics mods can be used for screenshots that depict the events of the battle that took place in Children of a Dead Earth.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EBoard Game/RPG\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EProposed by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133334\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0022 rel=\u0022\u0022\u003E@MatterBeam\u003C/a\u003E, this option seeks to solve many of the problems experienced in-game. Instead of playing the battle out in KSP, this option uses the game mainly to represent the action, while many of the combat mechanics are played out behind the scenes, which is how this path compensates for the problems a pure-KSP battle often suffers from. First, this solution solves the issue of controlling large amounts of ships at once, because the maneuvering is made off-screen, while the ships in-game do not need to move, creating plenty of time to set each screenshot up. If the damage systems of KSP itself and BDArmory prove unsatisfying, this option allows a person to create a system that can better represent what they want. While I have not yet tried this approach, it seems as though the main disadvantage to this approach is the initial amount of effort that must go into creating a balanced system of rules and points for a more realistic battle.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EArt\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022c5F1os9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://imgur.com/c5F1os9.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EDrawing or modelling the battle scenes is one way to depict space battles. As mentioned in the chapter \u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E“Depicting the Future in KSP”\u003C/span\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E, drawing or creating 3D models of the scenes allows considerably greater control of how the battle sequences look, and is great for someone who wants high quality images, rather than more of them, provided they are willing to spend the time required of the approach. However, this approach can require plenty of skill, time, and effort, which means that this is a less accessible choice. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EProse Only\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThis path is convenient for anyone who wants to write KSP space war story. While writing, like art, can require lots of skill, time, and effort, writing a KSP story will necessitate this regardless. Instead of possibly spending hours setting up the battles, or designing every detail of a warship, this option means that writing can begin right away. However, it does mean that the writing by itself must stand independently. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThis method is particularly well suited to battles involving many spacecraft that KSP cannot handle, and drawing the battle would either mean only a few drawings, or having to rush through them a bit more, if one is to save some time.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003ECombination\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EThe final approach would be to combine multiple of these approaches. One example that \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133334\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133334-matterbeam/\u0022 rel=\u0022\u0022\u003E@MatterBeam\u003C/a\u003E proposes is that KSP can be used to keep track of ship movements, so that battles can be kept in chronological order and to create an accurate battle setup for the following step, an off-screen minigame. This step is essentially the board game approach, and can help create more accurate battle results. Lastly, a combination of art and an after-action report can be used to depict the battle itself.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:rgb(0,0,0);vertical-align:baseline;\u0022\u003EConclusion\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EIn general, there is no single “best approach” for depicting space warfare. Rather, the best approach depends on a multitude of factors, such as the battle itself, the person who is controlling the battle, and the intended application of the battle. In the next chapter (possibly the last for a while), I will apply these approaches in a space warfare scenario.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;vertical-align:baseline;\u0022\u003EThanks for Reading!\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022font-size:14px;\u0022\u003E\n\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;vertical-align:baseline;\u0022\u003ENext: Space Warfare In KSP, Part Three\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-08-07T16:31:25Z\u0022 title=\u002208/07/2018 04:31  PM\u0022 data-short=\u00225 yr\u0022\u003EAugust 7, 2018\u003C/time\u003E by SaturnianBlue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2018-08-10T00:21:29Z","Content":"\n\u003Cp\u003E\nA combination of in-game maneuvers and look-alike space warships, but written/artistic battles would be amazing! I want more of your art. \n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-08-10T01:06:30Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003ETry BDARMORY. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/72433-bahamutod/\u0026amp;do=hovercard\u0022 data-mentionid=\u002272433\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/72433-bahamutod/\u0022 rel=\u0022\u0022\u003E@BahamutoD\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2018-08-10T01:39:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223431002\u0022 data-ipsquote-contentid=\u0022158813\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221533863190\u0022 data-ipsquote-userid=\u0022187595\u0022 data-ipsquote-username=\u0022The Minmus Derp\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, The Minmus Derp said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003ETry BDARMORY. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/72433-bahamutod/\u0026amp;do=hovercard\u0022 data-mentionid=\u002272433\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/72433-bahamutod/\u0022 rel=\u0022\u0022\u003E@BahamutoD\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt is what I have been using for the past few chapters...\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223430967\u0022 data-ipsquote-contentid=\u0022158813\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221533860489\u0022 data-ipsquote-userid=\u0022133334\u0022 data-ipsquote-username=\u0022MatterBeam\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, MatterBeam said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA combination of in-game maneuvers and look-alike space warships, but written/artistic battles would be amazing! I want more of your art. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat do you mean by look-alikes? And you will get to see more art in the next chapter!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-08-10T01:42:37Z\u0022 title=\u002208/10/2018 01:42  AM\u0022 data-short=\u00225 yr\u0022\u003EAugust 10, 2018\u003C/time\u003E by SaturnianBlue\u003C/strong\u003E\n\u003C/span\u003E\n"}]}