{"TopicId":159107,"ForumId":51,"TopicTitle":"ARGUS - a somewhat realistic career diary","CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2017-04-13T10:11:49Z","PageNum":1,"Articles":[{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2017-04-13T10:11:49Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003E\u003Cstrong\u003EForeword\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI couldn\u0027t wait for 1.3 and started a new game where I plan to reach and, hopefully, colonize the entire system. I\u0027m playing a heavily modded (\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E lists 113 mods) game on very hard difficulty: i.e. hard settings with some additional challenges. I use KCT, CommNet (and RT 2.0 for signal delay when it\u0027s out), life support, etc. I never quicksave or revert flights (except maybe if there was a kraken), so it\u0027s nearly as realistic as it gets without becoming too tedious.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is not one of the artsy and beautifully written fanfics with a rich story and carefully scripted drama. I enjoy reading those, but I\u0027m too lazy (or let\u0027s call it busy) to make one myself. This is going to be just a sort of a glorified what-did-you-do-in-KSP-today thread, which may or may not coincidentally be an interesting reading. I may get bored of it at any moment, decide to start a new game again or anything.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, without further ado...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cem\u003EFirst Things\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KFRt3qc.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/KFRt3qc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nARGUS opened its doors on day 1 of what they called \u0022the first year of space era\u0022. At the press conference, they revealed that the full name of the company was Argus Flying Things Corp.\u003Csup\u003E*\u003C/sup\u003E  Gene Kerman explained that this pretty simplistic name (and also slogan) was a necessity because words like \u0022rocketry\u0022 or \u0022spaceship\u0022 were yet to be invented. The new company\u0027s mission was to become the biggest and most successful space program on Kerbin. This was a great challenge, but the creativity of Argus\u0027 engineers and courageousness of its astronauts gave grounds for optimism as well as the fact that there were no other space programs on Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fILvy7S.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/fILvy7S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe first missions were very usual and even boring, with occasional fun moments when the rockets went bang. On day 117, Argus managed to launch the first satellite into low Kerbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rw6QGUc.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/rw6QGUc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA relay satellite was successfully launched some 80 days later. Then an argument arose between Wernher von Kerman and Jebediah Kerman about the nature of the next mission. Wenher wanted a fly-by of the Mun while Jebediah was eager to fly to space himself. After a heated discussion, several broken plates and an intervention of Gene Kerman, it was agreed to do both historical missions simultaneously.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, the Mun mission was to be launched earlier. First, all the necessary technologies were already in place for it while the engineers were still developing a manned (or kerballed?) pod for Jeb. Second, it would take several weeks to build each craft and the prepare for launch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225MXQcef.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/5MXQcef.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMun Visitor, officially designated P004, launched without problems and entered the parking orbit while Argo (the manned ship) was still under construction. The Argo\u0027s launch was further delayed a day because the engineers had to fix an issue with its on-board computer systems. While they were working, Mun Visitor left the orbit and went toward the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, on day 232 of year 1, Mun Visitor reached the Mun, provided valuable scientific data and crashed into its surface.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Y8lSYLp.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Y8lSYLp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt the very same time, Jebediah climbed into the small command pod of Argo, waved his fellow kerbals goodbye and made a speech, apparently, about importance of space exploration or something (Jeb forgot to switch on the microphone and nobody heard what he said, but no one dared to ask).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GVzXCkB.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/GVzXCkB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Argo took off, but the launch was marred with issues. First, the antenna was torn off by the incoming wind. Then the rocket failed to make the correct gravitational turn because its only \u0022Reliant\u0022 engine lacked a gimbal and command pod\u0027s controls were not strong enough to steer the craft. But Jeb\u0027s prowess and coolness allowed him to turn the rocket in the opposite, western instead of eastern, direction, drop the first stage and reach space. The mission control room burst in applause when Jeb reported, over the auxiliary radio transmitter, \u0022Periapsis seven-two kilometers, orbit established, cutting engine\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220g6QU4v.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/0g6QU4v.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter one orbit, Jebediah was instructed to burn retrograde and lower periapsis to 55 km. The Argo reentered atmosphere and began burning. Something was apparently off because, even after expending all the fuel on the second stage the heat was excessive. Ship\u0027s external systems burned one after another: thermometer, the rump antenna, and the solar panel. Fortunately, the parachute and the capsule itself were much more heat-resistant and survived the reentry without a problem.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xwDJAXm.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/xwDJAXm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Argo\u0027s command pod opened its chute and slowly descended into the sea near the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Jeb would later brag about his skillful navigation that put the ship \u0022next door\u0022 to his living quarters, but the truth is, it was a pure coincidence.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022X39KFlj.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/X39KFlj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThus ended the day 232 of year 1 of the Space Age. New discoveries await!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003E* \u003Ca href=\u0022https://www.freepik.com/free-photos-vectors/space\u0022 rel=\u0022external nofollow\u0022\u003EThe rocket image was created by Freepik\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-14T21:26:28Z\u0022 title=\u002204/14/2017 09:26  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 14, 2017\u003C/time\u003E by garwel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2017-04-18T08:21:10Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003E\u003Cstrong\u003ECrescent Disaster\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGene and Wernher sat at the biggest table in the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E Administration Building, which happened to be in the cafeteria. Opposite them sat members of the Kerbal Investigation Commision on Undesired Deaths of Astronauts (KICUDA).\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022This was just the second manned flight and you already lost an astonaut\u0022, said the Commission head. \u0022Tell us what happened to the Crescent mission. What was the plan?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The goal was to have a kerbal fly by the Mun and return home. The death of Valentina was unplanned\u0022, admitted Gene. He looked upset.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbals generally take death lightly. They believe that the entire universe is just a computer game and even if you die, you will resurrect again in another playthrough. But losing an astronaut and a friend was still an unpleasant, perhaps even tragic event.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ok, let\u0027s start from the beginning. How did the launch go?\u0022 asked one kerbal at the table.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The launch was nominal... Almost\u0022, Gene replied. He continued, \u0022There were some issues with the first stage control and we could not recover the second stage as planned. It was traveling too fast and burned in the atmosphere.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TbB2nKL.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/TbB2nKL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022We shouldn\u0027t have used these SRBs\u0022, interrupted Wernher. His voice was angry. \u0022They are uncontrollable. I said it from the beginning, but I was told they were cheaper!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGene ignored this comment and continued calmly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The orbital ejection burn was a little late. Val couldn\u0027t take her eyes off Kerbin. We still reached Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, but...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHe abruptly stopped and looked at the cafeteria\u0027s fridge, full of snacks. Gene wanted one. Badly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bOkq1Nr.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/bOkq1Nr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022What was the problem?\u0022 asked the KICUDA head.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Um, yes. Sorry. The first problem was that Crescent arrived ahead of the Mun. We need to eject from Mun\u0027s sphere in its retrograde direction for the optimal return trajectory.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dBezm6q.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/dBezm6q.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022But couldn\u0027t you correct it?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We tried. But it required a lot of fuel. And then, we made a navigational mistake.\u0022 Gene stared at his fingers and tried not to think about snacks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022A mistake?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yes. When correcting the trajectory, the ship ended up outside Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, but again on the wrong side of it. Her orbit was higher than the Mun\u0027s, not lower. Val then had to burn even more fuel to lower the periapsis to Kerbin\u0027s atmosphere.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/cQgsY5i.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022cQgsY5i.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022What happened in the reentry?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The velocity was too high and fuel level too low. Val burned all the fuel to slow the ship down, but was still traveling too fast.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Have you run tests?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yes, but only a launch simulation,\u0022 replied Wernher. \u0022We didn\u0027t run reentry sims at such high velocities. It was also considered too expensive.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022So, did the ship burn up?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGene responded after a pause.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It went into the atmosphere three times. In the first reentry it spent all the fuel and lost the last stage. Without propulsion, there was almost nothing Val could do. In the second contact, we lost the thermometer and the main antenna. In the third entry we lost the ship.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Why only the third time?\u0022 kept asking the commissioner.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022At every reentry the craft lost some speed and some ablative shielding of the command pod. Unfortunately, ablating was happening quicker than decelerating,\u0022 answered Wernher.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022That\u0027s it\u0022, Gene shrugged.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pSlQcWl.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/pSlQcWl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a pause, a commissioner asked:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022So, we\u0027ll never be able to come back from the Mun?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Of course, we will!\u0022 shot back Wernher, sounding angry. \u0022Progress cannot stop!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We need a better ground navigational system,\u0022 said Gene. \u0022We started upgrading it even before that flight. There will be no manned missions to the Mun until it\u0027s finished.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And we\u0027ll do testing. More testing!\u0022 added Wernher.\n\u003C/p\u003E\n\u003Cp\u003E\nGene nodded and added impatiently: \u0022Can I have a snack now?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAt this moment, all the kerbals at the table jumped up and rushed for the refrigerator.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-18T08:22:07Z\u0022 title=\u002204/18/2017 08:22  AM\u0022 data-short=\u00227 yr\u0022\u003EApril 18, 2017\u003C/time\u003E by garwel\u003C/strong\u003E\n\u003C/span\u003E\n"}]}