{"TopicId":163302,"ForumId":51,"TopicTitle":"One mission, stock parts, 3 Kerbals landing on Eve and returning","CreatedByName":"ichaleynbin","CreatedById":179857,"CreatedDateTime":"2017-07-16T04:50:25Z","PageNum":1,"Articles":[{"CreatedByName":"ichaleynbin","CreatedById":179857,"CreatedDateTime":"2017-07-16T04:50:25Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAfter a long time playing this game and playing around with different ways to land and return from Eve, I\u0027ve finally done it. One launch (IE I can reset to pad still, yeah this was in normal-sandbox, it was also a first for me), 1890 parts at launch, over 23 megatons, and a guaranteed destroyed launchpad. I\u0027ve uploaded the entire flight (what I captured in screenshots anyhow) to an \u003Ca href=\u0022http://imgur.com/a/jkENw\u0022 rel=\u0022external nofollow\u0022\u003Eimgur album\u003C/a\u003E, but I\u0027ll go over the highlights here with a few choice images. \n\u003C/p\u003E\n\u003Cp\u003E\nThis craft is as yet unnamed, so I\u0027d love some good name suggestions for it. \u003Cbr\u003E\u003Cbr\u003E\nI did use a pair of mods, though all of the parts involved were stock parts save for the mechjeb AR202. I found it necessary to use FSHangarExtender due to the size of this rocket: 98.6 meters high, 71m x 71m in the other two axes. FSHangarExtender simply allows me to zoom out much further, to be able to place the outer layers. This isn\u0027t strictly necessary as you can move the rocket to one edge, I\u0027m pretty sure I had enough room for that, but it certainly does make it easier. Mechjeb I\u0027m sure most of you are familiar with, for those of you that aren\u0027t, it adds a lot of functionality which I\u0027ll definitely take advantage of. I can (eventually, a lot of trial and error nodes sometimes) do all of the things I used mechjeb for. Interplanetary transfers are a pain but I know how to do em. But without mechjeb, I probably wouldn\u0027t have completed the mission- at 23 megatons this craft still had barely enough fuel at 2 points in the process, where hand planned burns would potentially have used up that fuel. \u003Cbr\u003E\u003Cbr\u003E\nSo first, the rocket in the hangar, with fancy MSpaint lines to show which tanks belong to which branch of the fourfold symmetry the tank belongs to, as well as the stats screen. FSHangarExtender saved my sanity.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222u9Slfj.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/2u9Slfj.png\u0022\u003E\u003Cbr\u003E\nThe engineer\u0027s report is really something else, though I do have quite a few launch stability enhancers. Getting rockets this large past physics load-in is a task in and of itself. Each tank is primarily anchored to the one it is staging off, with 6 connections each to that one. There are two additional supports in either direction between tanks in the same ring, though those primarily support rows outside, as once that ring starts staging, the circle is broken and stability greatly decreases. I lost quite a bit of thrust to cosine still, but I did want my computer to be able to eventually process the launch, so I had to limit the amount of stability I could add via struts. \u003Cbr\u003E\u003Cbr\u003E\nStill, it loads onto the pad. It needs time to settle down after physics load-in, time to stop the wobble, but after a few minutes because of framerate drop, it\u0027s stable. \u003Cimg alt=\u0022OKwWoKY.png\u0022 class=\u0022ipsImage\u0022 height=\u0022580\u0022 src=\u0022http://i.imgur.com/OKwWoKY.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis launch is exactly as ridiculous as it looks. And for what it\u0027s worth, goes mostly as planned. The mechjeb \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E stat page really tells the tale of a brief yet agonizing climb which took more than an hour to process 5 minutes worth of launch, and actually reach orbit. Highlight reel of the launch with brief commentary, if you want the full story and full commentary, check the imgur album: \u003Cbr\u003E\u003Cimg alt=\u00221NiVSR8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022http://i.imgur.com/1NiVSR8.png\u0022 width=\u00221024\u0022\u003EFirst stage, cleanly away, but I\u0027m barely off the pad. This is all according to plan, though my launchpad is toast. And yes, 5.2s to burn through 8 big 3.75m tanks. \u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00229iDbimd.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022579\u0022 src=\u0022http://i.imgur.com/9iDbimd.jpg\u0022 width=\u00221024\u0022\u003E15 minutes realtime, 36 seconds game time have elapsed, this is mid-stage so the max acceleration isn\u0027t accurate I don\u0027t think. But I\u0027ve put on some real speed, and this is the final 2-tank stage. \u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022JJlIVtg.png\u0022 class=\u0022ipsImage\u0022 height=\u0022581\u0022 src=\u0022http://i.imgur.com/JJlIVtg.png\u0022 width=\u00221024\u0022\u003ETipping now, though late, at ~14km. 2 more 2nd ring and 3 more inner ring stages remain. \u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022kD5wsrx.png\u0022 class=\u0022ipsImage\u0022 height=\u0022580\u0022 src=\u0022http://i.imgur.com/kD5wsrx.png\u0022 width=\u00221024\u0022\u003ELast ring booster away: about 45* tip right now, still svel\u002B alignment. It was at this point that I messed up.\u003Cbr\u003E\u003Cbr\u003E\nThe two mammoths which are further back along the ship are to be staged rapidly, less than 10 seconds to burn in each stage as they each have only a single tank to burn. There is a rhino located above each of them. I decided to switch to orbital alignment at this point, which nearly blew up the craft. One of the newly emptied tank\u002Bmammoth debris tagged one of the mammoths that was still burning and destroyed it. Luckily, the game was still moving at a snail\u0027s pace, so I could react quickly enough to save the launch. \u003Cbr\u003E\u003Cbr\u003E\nI quickly shut off the engines and staged again, to blow off the crippled stage, before I resumed full thrust. I lost around 90 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E from this because I didn\u0027t get to use that stage, but that\u0027s much better than imbalanced burning and the pains which come with that. There was a slight fuel imbalance in the later asparagus stages, but it was apparently so little that I didn\u0027t have problems from misalignments during Eve entry. But now I\u0027m into first rhino burn stage, which will last 1 minute 15 seconds, starts with 0.98 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E (because of my elevation, live SLT for rhinos is now maxed), and has over 800 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E. I\u0027ve made orbit. \u003Cimg alt=\u0022beKZybr.png\u0022 class=\u0022ipsImage\u0022 height=\u0022581\u0022 src=\u0022http://i.imgur.com/beKZybr.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEnd of first rhino stage, and I also get rid of the mammoths which I still had adding additional thrust. I don\u0027t need the thrust and can afford to shed the weight here. \u003Cbr\u003E\u003Cimg alt=\u0022uIbnYFQ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022582\u0022 src=\u0022http://i.imgur.com/uIbnYFQ.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs I said, I started tipping late: I\u0027m well, well above the atmosphere during my main horizontal burn, which should be more like 50km. \u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022Wdt0CwQ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022581\u0022 src=\u0022http://i.imgur.com/Wdt0CwQ.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut it\u0027s enough for me to be able to set up an orbit of 92/605, which I then circularize at apoapsis in order to warp at 100k. Here\u0027s what the craft looks like at that 600k circular orbit: \u003Cimg alt=\u0022YjiM7hA.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/YjiM7hA.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJust 8 fuel tanks outside of the Eve lander itself, which you can finally see. This is my biggest development here, which is really just asparagus staging taken to an extreme: There are 52 Vector engines, equivalent to 13 Mammoths, mounted on 2.5m to 4x1.25m quad stack adaptors. Each quad Vector is the same thrust as a Mammoth, 4,000 kN, and though it does weigh slightly more, it also has better atmospheric performance, which is ESSENTIAL to this process. The 2.5m form factor allowed me to more easily use 2.5m fuel tanks, which helped quite a bit with keeping the weight still manageable. \u003Cbr\u003E\u003Cbr\u003E\nThe big secret is that the lander has 3.55 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E in Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E vacuum. The hardware is not payload- the fuel on it is payload, but the hardware is VERY \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E positive. The ship seen above, with the 4x8 fuel tank only stage, is still 13 m/s/s of acceleration!! Pumping fuel into those engines from the ground means that I need fewer engines to be staged off later, which allows me a much larger craft. Lifting off is about maintaining sufficient \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E and angle for your current velocity- more thrust = more fuel hauling ability. The Eve lander itself is so net positive \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E that it can get the 4x8 stage off the ground alone, respectably even with 1.3 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\nThe craft itself being forced to have so high a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E in order to lift off Eve and combat the heavy atmosphere down near sea level, can lift a lot of its own fuel. Two additional 4x7 fuel tank \u002B rhino stages, along with the mammoth on the first 7\u002Brhino stage that I showed earlier, is enough to actually achieve orbit around kerbin from 35k and 300-400 m/s, as well as to transfer to Eve and slow down enough to achieve low eve orbit with minimal use of the fuel on the lander itself. The booster stages were just there to 1) fuel the lander and the other engines as they went, and 2) provide additional thrust to get those large tanks up to 35km\u002B from the pad. Each 3 tank \u002B mammoth provides some net \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E bonus, but the 2 tank \u002B mammoth as a booster stage provides a much higher \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E bonus. The 1 tank \u002B mammoths were the last to be staged because of their position inside the rings, under the rhinos which would not have helped much at sea level anyhow, in order to keep \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E high at lower altitudes. \n\u003C/p\u003E\n\u003Cp\u003E\nThis is Asparagus staging taken to an extreme, really, with utilization (in design anyhow, I didn\u0027t fly it very well) of changing \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E levels appropriately throughout the staging. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022T02K8op.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i.imgur.com/T02K8op.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe orbital stuff\u0027s pretty normal orbital transfers. I had a quick transit so I didn\u0027t actually pass through a plane node, so I didn\u0027t bother to plane change. I did do a fine tune burn to get a periapsis of 100km at Eve. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229e78pMO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022572\u0022 src=\u0022http://i.imgur.com/9e78pMO.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDeorbited a bit too hard I think, should\u0027ve had less thrust at this point. The tale of this landing is a long and harrowing one best read in full, because highlights won\u0027t do it justice. This picture shows a critical error which almost cost me the mission, slowing down too quickly at too high of an altitude, causing me to plunge into the lower atmosphere too quickly, without enough fuel. There were other errors along the way before a last minute save at only 6km, with my drogue chutes destroyed, no fuel, and very little chance of aero effects braking me sufficiently for my parachutes to save me. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GG5alRH.png\u0022 class=\u0022ipsImage\u0022 height=\u0022579\u0022 src=\u0022http://i.imgur.com/GG5alRH.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe fins! They can help! \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bTIQqLi.png\u0022 class=\u0022ipsImage\u0022 height=\u0022574\u0022 src=\u0022http://i.imgur.com/bTIQqLi.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSafe with parachutes only, using Eve\u0027s atmosphere for my benefit for once! \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BsNAdKZ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022577\u0022 src=\u0022http://i.imgur.com/BsNAdKZ.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nQuite a bit of time warp later, I\u0027ve used the mining drills, converters, solar panels, radiators, and the engineer for a nice healthy bonus, to fill the fuel tanks up again for launch. Immediately after take off (for safety\u0027s sake) the fuel generation equipment and entry fins will be staged off. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kgV3AAv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022574\u0022 src=\u0022http://i.imgur.com/kgV3AAv.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLaunch stage 2 is away cleanly but I\u0027m still not going very fast, or very high, ~12km. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jzPOQag.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/jzPOQag.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTipping away now that my q-limit is dropping off \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022i0lwYmq.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/i0lwYmq.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027ll do. Repacked my parachutes, pushed orbit up to over 600km circ, and made transfer. Still have some \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E left. Guess I WILL match planes\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UZ6cdId.png\u0022 class=\u0022ipsImage\u0022 height=\u0022577\u0022 src=\u0022http://i.imgur.com/UZ6cdId.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFine tune burn later, and I\u0027m parked at 25km periapsis at kerbin, which is enough to capture and deorbit safely with only an ablator. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IKELPE8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022574\u0022 src=\u0022http://i.imgur.com/IKELPE8.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSafe by a ways, actually. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gBj42VB.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022577\u0022 src=\u0022http://i.imgur.com/gBj42VB.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo it\u0027ll pull 5 g\u0027s or more for a while, between 20km and 35km or so it\u0027ll be pulling close to 5g\u0027s, but it\u0027ll shed off all that heat, and because I wasn\u0027t aimed at the ground, it\u0027ll still be a shallow enough entry that I\u0027ll slow down more than enough for parachutes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sHwA69Z.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022571\u0022 src=\u0022http://i.imgur.com/sHwA69Z.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd I\u0027ll land safely on kerbin again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ercs075.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i.imgur.com/ercs075.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, this was the longest single mission I\u0027ve run with the ability to reset to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E at any point, at over 4 hours when I recovered my vessel. I gathered no science and didn\u0027t even leave the vessel lol, but I landed and took off. This is the eighth iteration of my eve lander that I\u0027ve been working on in the same style for the past few weeks, and is certainly the largest, though I\u0027ve attempted many times before with no real successes. A few in this recent sprint I did landed, but I did not have them set up right to actually take off from Eve again successfully, for a variety of reasons. \n\u003C/p\u003E\n\u003Cp\u003E\nThe biggest thing I\u0027d change to make this work better, IE less mass/parts at launch, is to try to shave mass off the Eve lander itself. I just don\u0027t see how it\u0027s even possible to make fundamental changes to sufficiently lose mass. \n\u003C/p\u003E\n\u003Cp\u003E\nChanging the last stage to a 16x ion cluster, instead of the LV-N\u0027s, leaves me with ~4500 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, but at a third the thrust. It\u0027s also much, much lighter. The problem I see is that the vector engines are still necessary to this style in order to lift off Eve. It is possible to asparagus some 1.25m tanks with a single vector on the bottom, resulting in many more stages and no doubt a more efficient launch, but the number of parts would balloon quickly, especially if I were to attach separatrons to keep the stages close together. 1.25m asparagus is also simply not as strong as 2.5m, so for those reasons, I think the 2.5m tanks make launches much more feasible. Kerbin launches too, fixing the main 3 tanks to the Eve lander I used is much easier than a more awkward 1.25m setup. \n\u003C/p\u003E\n\u003Cp\u003E\nThis being said, even if I decrease the mass of the final return craft by changing to ion, the biggest problem is still the lower atmosphere. The LV-N stage brings my final stage weight to around 42 tons, where the ion cluster would be ~16t. But the *empty* mass of the stage immediately prior with 20 x 1.25m tanks and 4 vectors, the mass that\u0027s shed when the stage is empty, was over 18 tons, and carries 80 tons of fuel at its start. That\u0027s 98 tons, bringing the ion cluster\u0027s total weight at that point to around 114 tons, and the LV-N\u0027s to around 140T. This will give it a lot more thrust and \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, to be sure. \n\u003C/p\u003E\n\u003Cp\u003E\nThe problem with that is, that it doesn\u0027t make very much difference in what I *can* bring for the lower stages. I\u0027m still likely going to strap on the same red booster stages. Tsiolkovsky\u0027s gets me a great return for the ion switch, *if* I can shed the rest of the mass. Switching to 1.25m tanks is problematic but possible, but if I use the same red booster stages, the final mass of the craft isn\u0027t going to change very much. I will have higher thrust (not by much, not enough to switch to 3x vectors instead of 4x, I don\u0027t think) and better fuel efficiency, but from my new experience with variations on Vector designs, and lifting off Eve, the vast majority of the fuel goes into the lower atmosphere, either into aero forces or into maintaining terminal for so long. \n\u003C/p\u003E\n\u003Cp\u003E\nEve takeoff needs a lot of thrust, for a long time, which needs a lot of fuel. I think the extremeness of this atmosphere problem does a number on the Tsiolkovsky gains you make from switching to ion cluster, to the point where \u003Cem\u003Eviable liftoff\u003C/em\u003E configurations which will lift small payloads to low Eve orbit don\u0027t benefit much from the mass being 16T instead of 42T, despite Tsiolkovsky\u0027s law. I don\u0027t know how much fine tuning can go into making the Eve launch more efficient, as there is a long phase where 1.1 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E is all that\u0027s required. Setting up a rocket to 1) have 1.1 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E for that period, and 2) being able to quickly boost to that point prior to that, would be a way to potentially remove 4 or even 8 vector engines by switching to tristacks instead of quad, so it\u0027s possible that more weight could be shaved off there. \n\u003C/p\u003E\n\u003Cp\u003E\nBut the dry mass at landing was nearly 500 tons, wet mass 1.6 megatons. It\u0027s playing a game of inches when the scale is in miles. I probably could shave 50-100 tons off wet mass of the lander by tweaking things using that flight\u0027s data, but then I\u0027ve got to get 1.5 megatons to low Eve orbit instead of 1.6. And with the amount of time it takes to launch this, as well as the complexity of reconstructing on any changes, I\u0027m loathe to tweak designs as opposed to just constructing new. If I change the spacing on where the big 3 sets of tanks are, I have to redo almost every single fuel duct and strut, which means a lot get left behind and are extra parts doing nothing. \n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, hope you guys liked it, I know I had a lot of fun and even though I made some mistakes in flying it, the mistakes didn\u0027t kill me. I might make another attempt at it in the future if I can drop the part count, or find a better way to launch from Eve. Please let me know what you think, I\u0027d love to get some fresh ideas on how to build these things! \n\u003C/p\u003E\n"},{"CreatedByName":"NotAgain","CreatedById":150764,"CreatedDateTime":"2017-07-16T12:28:56Z","Content":"\n\u003Cp\u003E\nCrikey! That was quite a mission, and a fantastic entry into the forums! Welcome aboard, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/179857-ichaleynbin/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022179857\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/179857-ichaleynbin/\u0022 rel=\u0022\u0022\u003E@ichaleynbin\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-17T11:19:18Z\u0022 title=\u002207/17/2017 11:19  AM\u0022 data-short=\u00226 yr\u0022\u003EJuly 17, 2017\u003C/time\u003E by NotAgain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2017-07-16T14:29:22Z","Content":"\n\u003Cp\u003E\nI\u0027m guessing that you had some self-imposed things you wanted from this mission, like using the mk1-2 capsule and not splitting the craft at any point?\n\u003C/p\u003E\n"},{"CreatedByName":"ichaleynbin","CreatedById":179857,"CreatedDateTime":"2017-07-17T00:05:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223122453\u0022 data-ipsquote-contentid=\u0022163302\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221500208136\u0022 data-ipsquote-userid=\u0022150764\u0022 data-ipsquote-username=\u0022NotAgain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, NotAgain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022 style=\u0022background-repeat:repeat;background-image:none;background-position:0% 0%;\u0022\u003E\n\u003Cp\u003E\nCikey! That was quite a mission, and a fantastic entry into the forums! Welcome aboard, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/179857-ichaleynbin/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022179857\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/179857-ichaleynbin/\u0022 rel=\u0022\u0022\u003E@ichaleynbin\u003C/a\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks much NotAgain! \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223122512\u0022 data-ipsquote-contentid=\u0022163302\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221500215362\u0022 data-ipsquote-userid=\u0022113764\u0022 data-ipsquote-username=\u0022Foxster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Foxster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022 style=\u0022background-repeat:repeat;background-image:none;background-position:0% 0%;\u0022\u003E\n\u003Cp\u003E\nI\u0027m guessing that you had some self-imposed things you wanted from this mission, like using the mk1-2 capsule and not splitting the craft at any point?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI did have a couple of self-imposed constraints. \n\u003C/p\u003E\n\u003Cp\u003E\n1) Stock parts, other than mechjeb, it\u0027s not really a challenge with KSPI or other mods with future-tech. With KSPI in particular I have had Eve landings and returns, but there are a few engines with nearly infinite \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, the thermal jets which use reactors and atmosphere to provide insane thrust, and the Quantum Thruster which only uses electricity. So the big one here for me is \u0022Stock.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n2) 3 kerbals, or at least 2 for the engineer bonus on refuelling. In one of my earlier unsuccessful missions, it took me almost 2 years to refuel on Eve\u0027s surface, so I wanted to do what I could to speed that up. The Mk 1-2 is for the engineer, and so I can have only one capsule w/ ablator for kerbin reentry. It makes a huge mass difference, it was a lot less fuel to get the mk1 back to kerbin from Eve\u0027s surface, though that launch didn\u0027t make Eve orbit and had to be reset. \n\u003C/p\u003E\n\u003Cp\u003E\n3) Be able to reset to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E because until this made it home, there were a lot of failures. I iterated over a few designs near this until I got this one to work. Sandbox mode, not career, I\u0027m not looking to set up a base on Eve, or to rescue Kerbals, I just wanted a 1-off mission that could reset to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\n4) Not so much a constraint as \u0022I couldn\u0027t make it work,\u0022 the 10m heat shields invariably ended with my craft flipping around and getting quite toasty, and I don\u0027t think with a craft that looks anything like what I\u0027ve got, the smaller heat shields would do what they need to for side protection. Haven\u0027t tested them though. So, a \u0022not-constraint\u0022 of using fuel to safely brake to landing speed rather than heat shields. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for splitting the craft... do you mean something along the lines of leaving an orbiter around Eve, so I don\u0027t have to haul my Eve-\u0026gt;Kerbin transfer up from Eve\u0027s surface? I\u0027m not opposed to transferring/EVAing kerbals, and I suppose if the craft has reached Eve orbit again, I can safely give up the \u0022Reset to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u0022 option. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been iterating over this design some more and I did manage to shed a lot of weight (and parts! I forgot what quick launches looked like, this is less than half the parts at kerbin launch) by switching to ion for return. Using ion to circularize like I did with the LV-N\u0027s failed a few times, to the point where I realized 1.8 m/s/s is simply not going to be able to finish circularizing and I had to get most of the fuel for orbit into the lower stages. So I did, and it did have gains over what I used in the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022anvGdrH.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/anvGdrH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe jump from 42 T stage start mass with the LV-N\u0027s to 11.5T with the ions saved me almost a megaton lifting off Eve, even though I had to get way more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E into the earlier stages to make it to orbit without use of the ion engines. I got close to orbit but couldn\u0027t finish with ions multiple times, on a very similar \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E profile to the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, so I gave up on giving the ion stage more thrust (they\u0027re kinda heavy for their thrust, one iteration had 24 ion engines instead of 8) to save lifting \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, and put a poodle on there for that upper atmo stage to help getting more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E into lifting the returner to orbit\n\u003C/p\u003E\n\u003Cp\u003E\nI think I like not landing the Eve-\u0026gt;KSP transfer \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, even though I won\u0027t gain very much from it. Getting \u003Cstrong\u003Eto\u003C/strong\u003E eve isn\u0027t a problem, it\u0027s getting down safely and back to orbit. I also just realized, I don\u0027t even have to launch the returner at the same time! That\u0027s great for part count, and for me being able to put a nice ion craft together rather than the bare minimum. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for that, Foxster,  I should be able to improve it quite a bit now!\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2017-07-17T06:30:03Z","Content":"\n\u003Cp\u003E\nI\u0027d say that a large part of your craft\u0027s huge mass is due to some less-than-optimal decisions about payload. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you just want a manned mission then you can put a one-man craft with no refuelling that is re-orbit capable onto Eve for a fraction of the mass you have now. The take-off mass from Eve can be as low as 25t. Think about a mk1 capsule craft that detaches from an mothership/orbiter/Kerbin-return craft, that lands, dumps everything needed for landing, re-orbits, rendezvous with the orbiter, crew EVAs over, lander is abandoned.  \n\u003C/p\u003E\n\u003Cp\u003E\nIf you feel you really must put three crew down then use a mk1 capsule and a 2-man passenger cabin to save several tons of payload and keep the craft mk1-sized. Or even put the crew in command seats inside a fairing to reduce mass further. \n\u003C/p\u003E\n\u003Cp\u003E\nEvery kg of mass that you have to lift from Eve will balloon into many tons of craft earlier on. \n\u003C/p\u003E\n"},{"CreatedByName":"ichaleynbin","CreatedById":179857,"CreatedDateTime":"2017-07-17T08:24:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223123181\u0022 data-ipsquote-contentid=\u0022163302\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221500273003\u0022 data-ipsquote-userid=\u0022113764\u0022 data-ipsquote-username=\u0022Foxster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Foxster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022 style=\u0022background-repeat:no-repeat;background-position:875px 0px;\u0022\u003E\n\u003Cp\u003E\nI\u0027d say that a large part of your craft\u0027s huge mass is due to some less-than-optimal decisions about payload. \n\u003C/p\u003E\n\u003Cp\u003E\n....The take-off mass from Eve can be as low as 25t.\u003Cbr\u003E\u003Cbr\u003E\n....Or even put the crew in command seats inside a fairing to reduce mass further. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have to concur with the first statement of yours I quoted. I\u0027ve been playing with different designs to reduce the mass I have to get to Eve orbit, and I\u0027ve got a craft down to 110 tons at lift off from Eve. But I had a mk1 with a 2 person crew cabin, which is another ton or so. \n\u003C/p\u003E\n\u003Cp\u003E\nI was struggling to figure out your 2nd quoted comment because I was running into a wall at 110T, I couldn\u0027t see many options to optimize it further, though I did try quite a few things. LV-N\u0027s, which are too heavy. Ions, also too heavy for their thrust. It seemed that a FL-T800 with a terrier was the best option for the last stage, which pretty much sets the stage for the entire rest of the rocket. \n\u003C/p\u003E\n\u003Cp\u003E\nThen I re-read your comment again and finally caught the command seat/fairing thing. I think that\u0027s the most Kerbalicious solution. No need for a pod even! The 25T thing makes more sense now. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks so much for your help! \n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2017-07-17T19:17:52Z","Content":"\n\u003Cp\u003E\nA one-man craft for Eve to orbit can look like this...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QMNgMRJ.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/QMNgMRJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA 4-man variant can look like this...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NdVZa5g.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/NdVZa5g.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBoth weigh around 26t. \n\u003C/p\u003E\n\u003Cp\u003E\nObviously they need ladders, science experiments, landing stuff, etc but that\u0027s all detail. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ichaleynbin","CreatedById":179857,"CreatedDateTime":"2017-07-17T21:22:54Z","Content":"\n\u003Cp\u003E\nHahaha, those are amazing. I finally got a 26t version of my own as well, using a single Spark and some Oscar-B\u0027s for the final stage. One of the biggest problems I had with final stage ions is that they didn\u0027t have the necessary \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E to circularize before I re-entered, but since I\u0027ve shaved off so much mass with pods and such, I\u0027m just hauling the external seats and a tiny reaction wheel and battery, the spark is enough to get a high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003Etwr\u003C/abbr\u003E and a lot of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227chAJKl.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/7chAJKl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI think the first stage will fire long enough so that the 2nd stage can get up to where it needs to be to do work. Hope so anyhow. \n\u003C/p\u003E\n\u003Cp\u003E\nI switched from the panels to a single PB-NUK as well, on the last stage, it just made more sense. More mass but panels are really not dependable. \n\u003C/p\u003E\n\u003Cp\u003E\nI had a few questions though. I\u0027m apparently not able to put kerbals into the external seats prior to launch, or transfer them, and have to actually EVA them close enough that I can right-click board. Can this be done through a fairing? If not, how do I get my kerbals aboard? \n\u003C/p\u003E\n\u003Cp\u003E\nSecond, are those air intakes on either end of the 1.25m asparagus fuel stages? I see the nose cones on the 0.675m Oscar-B\u0027s, and I really like how you used them for stability. Can\u0027t believe I forgot about fuel-only stages for asparagus, but I am still curious about the air intakes. What are they there for, decrease in drag? \n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2017-07-17T22:36:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223123861\u0022 data-ipsquote-contentid=\u0022163302\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221500326574\u0022 data-ipsquote-userid=\u0022179857\u0022 data-ipsquote-username=\u0022ichaleynbin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, ichaleynbin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI had a few questions though. I\u0027m apparently not able to put kerbals into the external seats prior to launch, or transfer them, and have to actually EVA them close enough that I can right-click board. Can this be done through a fairing? If not, how do I get my kerbals aboard? \n\u003C/p\u003E\n\u003Cp\u003E\nSecond, are those air intakes on either end of the 1.25m asparagus fuel stages? I see the nose cones on the 0.675m Oscar-B\u0027s, and I really like how you used them for stability. Can\u0027t believe I forgot about fuel-only stages for asparagus, but I am still curious about the air intakes. What are they there for, decrease in drag? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you use the mod TakeCommandContinued you can put crew into command seats in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. You can also do it during a mission through a fairing with some careful camera angling so you can right-click on the seat. Hard to get out though, unless you blow the fairing. \n\u003C/p\u003E\n\u003Cp\u003E\nFor mk1 stacks, the round intakes have an excellent combination of low drag and low mass. \n\u003C/p\u003E\n\u003Cp\u003E\nPS - I like the look of your craft but if at all possible I suggest sticking with mk1-sized parts (or smaller). Drag is your enemy on Eve and the thinner the stack the lower the drag. \n\u003C/p\u003E\n"},{"CreatedByName":"ichaleynbin","CreatedById":179857,"CreatedDateTime":"2017-07-19T06:32:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223123927\u0022 data-ipsquote-contentid=\u0022163302\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221500330985\u0022 data-ipsquote-userid=\u0022113764\u0022 data-ipsquote-username=\u0022Foxster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/17/2017 at 6:36 PM, Foxster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022 style=\u0022background-image:none;background-repeat:repeat;background-position:0% 0%;\u0022\u003E\n\u003Cp\u003E\nIf you use the mod TakeCommandContinued you can put crew into command seats in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. You can also do it during a mission through a fairing with some careful camera angling so you can right-click on the seat. Hard to get out though, unless you blow the fairing. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Found 1 error in text\u0022\u003E\n1\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI ended up with a small 2 person passenger compartment on the side with a mostly empty flea booster and some parachutes, long with a ladder system to get the kerbals up in range of the command seats, which all staged off at the same time. I couldn\u0027t get TakeCommandContinued to work. Downloaded the latest version and everything, not sure what\u0027s up with it, but I managed to get it to work even though it\u0027s a pain. \n\u003C/p\u003E\n\u003Cp\u003E\nI also discovered (though I am quite sure I am not the first) that a kerbal weighs 94 kilograms. The end mass of my smallest stage was 0.440t, prior to loading kerbals. Afterwards, it\u0027s 0.628t, giving them a combined mass of .188t, or 94 kilos each. \n\u003C/p\u003E\n\u003Cp\u003E\nThis painful discovery also causes a crazy \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E loss in the final stage. From ~3250 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E w/o the kerbals, to ~2575 with them. Without the kerbals, the spark craft only weighs 1.240 tons at the start, so the addition of 188 kilograms is a HUGE burden. For what it\u0027s worth, kerbals do not seem to add 94 kilograms to the weight of a pod, though they do weigh 0.09t in the map screen while on eva. \n\u003C/p\u003E\n\u003Cp\u003E\nI was also a little caught up on bringing the 2nd kerbal, but the only reason I was bringing the engineer was to make the refuelling process go faster. I only needed to refuel because I couldn\u0027t successfully aerobrake, but I decided to go the kerbtastic route and simply affix more 10m heat shields to the rear so that the craft can do nothing but align correctly. This also has the benefit of providing a lot more surface area, and therefore drag, slowing the craft more at higher altitudes and making aerobraking even easier/less explosive. So I managed to get the 10m shields to work, even if it\u0027s on the wrong end. If it\u0027s stupid, but it works.... \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/113764-foxster/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022113764\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/113764-foxster/\u0022 rel=\u0022\u0022\u003E@Foxster\u003C/a\u003E, I put together one of the craft you showed me that takes off from Eve. But I don\u0027t rightly understand it. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022msZodkp.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/msZodkp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E at sea level is perfect, could not possibly ask for better. But the overall \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E seems about 1800 short to actually make circ? I\u0027ve heard newer estimates at sea level \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to orbit (since aero patch) at around 7600-8000, though my biggest issue to date has been getting enough \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E and \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E on the final stage, while also getting that final stage up to 20-35km\u002B, wherever it needs to be, and also staying below ~26T because 26.25T is exactly 1.4 SLT on Eve with a single vector. \n\u003C/p\u003E\n\u003Cp\u003E\nJumping up to a 2nd vector engine balloons the size immensely due to the 2nd vector\u0027s weight, as well as the ability to carry up to 50.5T at 1.4 SLT, so might as well flesh it out to a full 50.5 at takoff? \n\u003C/p\u003E\n\u003Cp\u003E\nAnyhow I posted this edit to ask you how to fly that, do I q-limit or just go hard? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-19T20:17:45Z\u0022 title=\u002207/19/2017 08:17  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 19, 2017\u003C/time\u003E by ichaleynbin\u003C/strong\u003E\n\u003Cbr\u003EDidn\u0026#039;t want to double post\n\u003C/span\u003E\n"}]}