{"TopicId":165256,"ForumId":51,"TopicTitle":"Panarchist Space Alliance","CreatedByName":"panarchist","CreatedById":63336,"CreatedDateTime":"2017-09-06T19:59:12Z","PageNum":1,"Articles":[{"CreatedByName":"panarchist","CreatedById":63336,"CreatedDateTime":"2017-09-06T19:59:12Z","Content":"\n\u003Cp\u003E\nThis is inspired by a lot of Kerbal Mission Reports, and I\u0027ve been wanting to create my own content for a while, but the real instigation was Angel-125\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/150702-13\u0022 rel=\u0022\u0022\u003EHeisenberg mod\u003C/a\u003E and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/159763-kerbin-elcano-exploration-project-chapter-ten-going-for-a-swim/\u0022 rel=\u0022\u0022\u003Ehis mission report\u003C/a\u003E. Then I found \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/119520-plan-kappa\u0022 rel=\u0022\u0022\u003EPlan Kappa\u003C/a\u003E, and I knew for sure that I wanted to do \u003Cem\u003Esome\u003C/em\u003E sort of Mission Report / fictionalization of my main game save.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMod List\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nHere\u0027s my mod list\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TVXhojO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022688\u0022 src=\u0022https://i.imgur.com/TVXhojO.png\u0022 width=\u0022897\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOverview\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI wasn\u0027t a big fan of the existing nation maps of Kerbin, so I made my own. I\u0027ve been using Kerbal Konstructs for some time, so this version of Kerbin contains Kerbinside, Kosmodrome, the BAD-T airfields, and possibly additional bits and pieces.\n\u003C/p\u003E\n\u003Cp\u003E\nThe basic history is analogous to ours, sort-of. The Kerman Empire 2,000 years ago built roads all over the place, setting up the preconditions for truly world-wide trade. There was an equivalent to the Hanseatic League, and there was a Great War, which is sort of a combined WWI/WWII without the genocide. The sudden appearance of the monoliths brought everyone to the table to resolve their differences at least temporarily, and now there is an uneasy truce and a joint effort to explore the source of the monoliths. The general public isn\u0027t aware of the monoliths (yet).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Y9bUAYd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022160\u0022 src=\u0022https://imgur.com/Y9bUAYd.png\u0022 width=\u0022256\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPSA - The Panarchist Space Alliance\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe PSA was formed at the end of the Great War to investigate the origin of the monoliths.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nWhen the monoliths appeared, a radio signal was detected between the monoliths and Ciro, Kerbol\u0027s nearest stellar companion. This was the piece of evidence all parties needed to recognize all Kerbal-kind had a common threat.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKerbin\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin at the time of this story has 22 nations - 5 major powers and 17 minor ones.  Most of the national flags are from \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57127-ual002/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257127\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57127-ual002/\u0022 rel=\u0022\u0022\u003E@UAL002\u003C/a\u003E \u0027s awesome \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/78476-12-ual002s-lorefriendy-serious-parody-flags\u0022 rel=\u0022\u0022\u003Eflag pack\u003C/a\u003E, but a few are my own design or adapted from materials online which are CC BY-NC licensed. (see comment below for details)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tJmxC1j.png\u0022 class=\u0022ipsImage\u0022 height=\u0022512\u0022 src=\u0022https://imgur.com/tJmxC1j.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VOnx015.png\u0022 class=\u0022ipsImage\u0022 height=\u0022512\u0022 src=\u0022https://imgur.com/VOnx015.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cu\u003E\u003Cstrong\u003EThe Major Powers\u003C/strong\u003E\u003C/u\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DMQav3i.png\u0022 class=\u0022ipsImage\u0022 height=\u0022385\u0022 src=\u0022https://imgur.com/DMQav3i.png\u0022 width=\u0022735\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022kiQboc0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022https://imgur.com/kiQboc0.png\u0022 width=\u0022750\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKermania: \u003C/strong\u003EKermania is an analog to Earth\u0027s Germany. Originally a loose federation of barbarian tribes in the days of the Kerman Empire, they overran and defeated that power before collapsing back into a dark age of anarky. Later, under Konstantine Kerman, the tribes consolidated into several warring nation states until Kaiser Vilhelm Kerman united them into the nation of Kermania. Kermania was a major player in the Great War - part of the Triaxial League: Kermania, Imperial Kermanovia, and Yitalia. Kermania started the war with the invasion of Polan in year -5. (Year 1939 in the old calendar)\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the Great War, Kermanian scientists were instrumental in advancing rocket science to the point where manned space travel was possible. Kermanian rocket technology was pioneered during the war, and at the war\u0027s conclusion, on Year One, Day Three, Kermania launched the first orbital satellite - the first peaceful use of rocket technology, using a booster intended to launch a new weapon against the USK.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESouth Kijani: \u003C/strong\u003E The nation of South Kijani was originally neutral in the Great War, until Kermania invaded their territory to launch an offensive against the USK. South Kijani then sided with the USK to drive back Kermania and take the pressure off their occupation of Keltica.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUnion of Kerbalized Kommunist Republiks (UKKR): \u003C/strong\u003EFormerly the Kingdom of the Kermanovs, Imperial Kermanovia became a member of the Triaxial League during the Great War and led the offensive against United Kerbdom until Kermanovian workers rose in revolt against their imperialist masters during the Red Oktober uprising. The new Kommunist state immediately sued for peace with the UK and signed a non-aggression pact which made them neutral for the remainder of the Great War.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the war, the UKKR established Area 110011, the preeminent test flight facility on Kerbin, and the KKVLA, a new radio telescope to detect signals from space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUnited States of Kerbin (USK): \u003C/strong\u003EThe USK was one of the Allied Powers in the Great War, and led the bulk of the fighting against Kermanian expansion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EUnited Kerbdom (UK): \u003C/strong\u003EUnited Kerbdom, in a flip of \u0022real world\u0022 history, was originally a colony of the USK Which declared independence and established a constitutional monarchy.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cu\u003E\u003Cstrong\u003EThe Minor Powers\u003C/strong\u003E\u003C/u\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HCp8F2i.png\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://imgur.com/HCp8F2i.png\u0022 width=\u0022512\u0022\u003E\u003Cimg alt=\u0022K4aYutj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://imgur.com/K4aYutj.png\u0022 width=\u0022512\u0022\u003E\u003Cimg alt=\u0022hmxu9rc.png\u0022 class=\u0022ipsImage\u0022 height=\u0022282\u0022 src=\u0022https://imgur.com/hmxu9rc.png\u0022 width=\u0022360\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EArabnia: \u003C/strong\u003EThe Kingdom of Arabnia has been ruled by the Al Kaud family for generations, and has been home to desert nomads and kamel farmers for far longer than that. The Kingdom appeared destined to remain a minor power until the discovery of Liquid Fuel. Exploration revealed that Arabnia contains Kerbin\u0027s largest reserves of Liquid Fuel, and the Kingdom has successfully leveraged that fact to earn a place at the table.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECratery Coast: (more detail to come)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDPRK: \u003C/strong\u003EThe Demokratic People\u0027s Republik of Kerbin is a misnomer, as it is neither demokratic nor a republik. It is instead a military diktatorship established during the Kaoist Skism of 115 (Old Rekoning). The DPRK has no launch facilities of its own, but contracts with Republiko Simios for use of the facilities of Sanctuary Mouth. The Simios government has largely stepped back from the use of that facility, happy to keep the cash flowing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EGoreyo: \u003C/strong\u003EGoreyan culture is one of the oldest civilizations on Kerbin, and perhaps the least changed from its origins during the Big Split - the initial divergence of Kerbalkind from their pre-historic origins.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EErryday: \u003C/strong\u003EErryday is known for their world-famous bobsledding team, their world-famous koffee, and their world-famous relaxed attitude. Indeed, it\u0027s amazing they ever get anything done. The nation is an island paradise, and their citizens work only an hour each day. (or as the residents say, erryday) Erryday\u0027s space program started the same way their bobsled team did - someone cracked a joke and said they\u0027d never have one, so they went out and started one.  Erryday contracts with New Batavia and the Cratery Coast to use their launch facilities at The Shelf and Hanbert Cape, respectively.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFinnlund: \u003C/strong\u003EFinnlund maintains the largest commercial fishing fleet on Kerbin. \u003Cstrong\u003E(more detail to come)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFree Republik of Kerbin: \u003C/strong\u003EThe Free Republik of Kerbin split off from the USK many years ago, after the UK successfully broke away. Some of the early rebels wanted to call the new nation \u0022Kexas\u0022, but were shouted down by those who thought there were already too many kountries with a \u0022k\u0022 in their name. The Free Republik is a large island, and prides itself on the best beef in all of Kerbin, and was also the heart of the USK\u0027s Liquid Fuel industry before breaking away. Since becoming independent, that industry collapsed due to over-mining, and now the primary economy is beef, leather, outdoor equipment and enormous belt buckles. The Free Republik managed to stay out of the Great War, but because they wanted to - not because they were cowards. (and if you imply they are, they will give you \u0022what for\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\nSince the war, the FRoK keeps saying they\u0027re going to launch people into space, and that they have a great plan - the best plan ever, the highest rated plan anyone\u0027s ever seen. Rumor has it they have built a Top Secret facility in the island\u0027s interior. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHellenik Republik: \u003C/strong\u003EThe Hellenik Republik is the kradle of demokracy and the birthplace of Kerbal philosophy and science. Sokrates Kerman, Arkhimedes Kerman (before he moved to Syrakuse), Pythakoreus, Aristokle... the list goes on and on. The Republik wasn\u0027t always a republik, however - in years past it\u0027s been a kingdom, a military diktatorship, an oligarchy, matriarchy, patriarchy, a true democracy, and a libertarian dys/utopia (depending on who you ask). Every type of government has been tried, because the Helleniks are nothing if not experimental and ready to try anything. Most of the time, however, they have been a republic, though many think they are an autonomous collective. During the Great War, the Hellenik army successfully held off several Kermanian advances, and ultimately caused enough casualties that the Kermanic offensive found an easier target: South Kijani. The deciding battle was fought by 300 Kerbals under Leonidas Kerman in the battle of Kermopylae. Leonidas and his brave Kerbals all died, but the Kermanic advance was halted and several thousand Kermanians perished.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Helleniks have a small facility at Sea\u0027s End, on the inland sea. The facility is known more for its research than any real attempt at getting into space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKanada: \u003C/strong\u003EKanada is another former colony of the USK, but one which was intended to be independent from the start. It was a place for every Kerbal who found the USK to be far too warm. Kanada is sometimes called the land of milk and honey, due to all the goats and the bees there. Kanada is also Kerbin\u0027s largest supplier of waffle syrup. Prior to the Great War, Kanada lost its southern province when Imperial Kermanovia expanded northward. Since the Revolution, Kanada has opened talks several times with the UKKR to get the regions around Boostershire Farms and Dundard\u0027s Edge back, but the UKKR has so far refused to hand back the land they took.\n\u003C/p\u003E\n\u003Cp\u003E\nKanada has a small space program, but one of the best astronaut training centers on Kerbin - the Polar Research Center on the northern ice cap. Kanada is currently training the next crop of Kerbonauts for a mission to Duna.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECeltika (or is it Keltica?): \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENew Batavia: (more detail to come)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPolan: (more detail to come)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ERepublika de Santa Kruz: (more detail to come)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ERepubliko Simios: (more detail to come)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESkaibern Empire: \u003C/strong\u003EThe home in exile of the Kermanovs after being forced out of Kermanovia by the Oktober Revolutionaries. \u003Cstrong\u003E(more detail to come)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESkotslund: \u003C/strong\u003ESkotslund is Kerbin\u0027s airship capital, and home to all things considered strange on Kerbin - hakkis, kiltz, bagkipes, and golf. It\u0027s also home to ridiculous amounts of lifting gas, which not only got Skotslund\u0027s airship program literally off the ground, but provides hours or fun at parties when people breathe lifting gas and talk in high-pitched voices until they pass out.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EYitalia: \u003C/strong\u003EThe home and birthplace of pasta, and the world\u0027s greatest shoes. Yitalians also originated lawn bowling. Yitalia was a member of the Triaxial alliance during the Great War, but when they learned that Kermania was planning to launch rockets against the USK, they defected from the alliance and claimed the Kwiss alps region of Kermania, moving troops up to capture the Messerkerman factory there.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the war, \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETimekeeping on Kerbin:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n1 \u0022Astronomical Unit\u0022 (AU) on Kerbin is 13,599,840,256 m (45.4 LS)\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin sits in a circular orbit with a 23.5° inclination respective to the ecliptic, which means Kerbin has seasons similar to those on Earth. It has a 600km radius, which is 1/10 that of Earth. Year 1, Day 1 coincidentally is the first day of Spring in the northern hemisphere. (thanks to the mod \u0022Harder Solar System\u0022 for the inclined orbit!)\n\u003C/p\u003E\n\u003Cp\u003E\nSidereal Orbital Period: 9,203,545 s (426d 0h 32m 24.6s)\u003Cbr\u003E\nSidereal Rotation Period: 21,549.425 s (5h 59m 5.9s)\u003Cbr\u003E\nSolar Day: 21,600 s (1d / 6h) \n\u003C/p\u003E\n\u003Cp\u003E\nKerbin Year: 9,203,545 s\u003Cbr\u003E\n(426d 0h 32m 24.6s)\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin has a \u0022Leap\u0022 year every 12 years unless that year is divisible by 180 - but every 900 years *is* a leap year, and every 21,600 years is NOT.\n\u003C/p\u003E\n\u003Cp\u003E\n1 year - 14 months of 30 days each, plus \u0022Holiday\u0022, a 6 day intercalary month. (7 days on leap years)\n\u003C/p\u003E\n\u003Cp\u003E\n1 light year (Kerbol LY) = 2,759,153,377,863.61 km\u003Cbr\u003E\n1 light year (Earth LY) = 9,460,730,472,580.8 km (3.43 Kerbol LY)\n\u003C/p\u003E\n\u003Cp\u003E\nYear 1, Day 1 is actually 1950.12.27 under the previous calendar, which dates back to the founding of the Kermanian Empire. It\u0027s been nearly 4,200 years since the beginning of recorded Kerbal history.\n\u003C/p\u003E\n\u003Cp\u003E\nDays: (5 weeks of 6 days each per month)\u003Cbr\u003E\nSunday | Munday | Dunaday | Joolday | Evesday | Sarnusday\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-09T15:34:11Z\u0022 title=\u002210/09/2017 03:34  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 9, 2017\u003C/time\u003E by panarchist\u003C/strong\u003E\n\u003Cbr\u003EAdded world political map, major powers notes, timekeeping, additional detail\n\u003C/span\u003E\n"},{"CreatedByName":"panarchist","CreatedById":63336,"CreatedDateTime":"2017-09-06T21:44:08Z","Content":"\n\u003Cp\u003E\nLicensing Info on other people\u0027s stuff I\u0027ve used:\n\u003C/p\u003E\n\u003Cp\u003E\nFlag of the UKKR - The base flag was created by me, using Paint.net and a version of the logo of the Communist Party of the USA, which is \u003Ca href=\u0022https://en.wikipedia.org/wiki/File:CPUSA_Logo.svg#/media/File:CPUSA_logo.svg\u0022 rel=\u0022external nofollow\u0022\u003Elicensed as Public Domain\u003C/a\u003E. \u003Cbr\u003E\nFlag of the USK - \u003Ca href=\u0022https://alternatehistory.deviantart.com/art/United-States-Alternate-Flag-2-446871172\u0022 rel=\u0022external nofollow\u0022\u003ECreated by DeviantArt user\u003C/a\u003E \u0022AlternateHistory\u0022 (\u0022Michael M.\u0022), and licensed \u003Ca href=\u0022http://creativecommons.org/licenses/by-nc/3.0/\u0022 rel=\u0022external nofollow\u0022\u003ECC BY-NC 3.0\u003C/a\u003E - I trimmed the left and right ends but did not otherwise modify the work\u003Cbr\u003E\nOther flags - Created by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57127-ual002/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257127\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57127-ual002/\u0022 rel=\u0022\u0022\u003E@UAL002\u003C/a\u003E and licensed as \u0022For Personal Use\u0022 - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/78476-12-ual002s-lorefriendy-serious-parody-flags-v21-fall-of-the-ape-edition/\u0022 rel=\u0022\u0022\u003Esee UAL002\u0027s page here\u003C/a\u003E if you want the flags or intend to use them.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-10T13:54:53Z\u0022 title=\u002209/10/2017 01:54  PM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 10, 2017\u003C/time\u003E by panarchist\u003C/strong\u003E\n\u003Cbr\u003EAdd attribution and licensing info\n\u003C/span\u003E\n"},{"CreatedByName":"panarchist","CreatedById":63336,"CreatedDateTime":"2017-10-08T23:57:19Z","Content":"\n\u003Cp\u003E\nOriginally, I intended for this to be based on a career save, but since I want to have certain things in place prior to the \u0022start\u0022, it looks like either this will be a sandbox game, or I\u0027ll need to create my own tech tree before flying the first \u0022official\u0022 mission. Kerbals have already developed aircraft parts up through propellers and early jets (turbojets), and the Skots have been flying airships for a couple of decades or more. Many of the structural parts and a few other select pieces (like some of the wheels / gear) would have been \u0022discovered\u0022 / invented years earlier.\n\u003C/p\u003E\n\u003Cp\u003E\nI also added a couple more mods, and reinstalled MKS and some of the related mods - my problem is I like WBI and \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E both way too much, and it can be difficult to run both simultaneously since both put quite a few hooks into the base game. Both mod constellations are exceptional, and each has its strengths. I also updated everything to 1.3.1 versions, so I think everything\u0027s just about ready to go - hoping to post the actual first installment \u0022soon\u0022 (TM).\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2017-10-09T14:36:29Z","Content":"\n\u003Cp\u003E\nYou can definitely spin some ripping yarns from all this background.  I look forward to reading them.\n\u003C/p\u003E\n"},{"CreatedByName":"UAL002","CreatedById":57127,"CreatedDateTime":"2017-11-08T23:04:07Z","Content":"\n\u003Cp\u003E\nOh cool.\n\u003C/p\u003E\n"},{"CreatedByName":"panarchist","CreatedById":63336,"CreatedDateTime":"2019-07-01T19:59:12Z","Content":"\n\u003Cp\u003E\nReturning to this after a long absence - There\u0027s a good chance I am going to rework this for Galileo\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184880-17x-jnsq-07-17-june-2019/\u0022 rel=\u0022\u0022\u003EJe Ne Sais Quoi\u003C/a\u003E mod. I really like the idea of a 1/4 scale system (2.5x the size of \u0022current\u0022 Kerbin), and I\u0027ve had a number of ideas I want to explore since I first started this thread.\n\u003C/p\u003E\n"},{"CreatedByName":"Nnimrod","CreatedById":152586,"CreatedDateTime":"2019-07-03T04:56:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223628093\u0022 data-ipsquote-contentid=\u0022165256\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221562011152\u0022 data-ipsquote-userid=\u002263336\u0022 data-ipsquote-username=\u0022panarchist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/1/2019 at 2:59 PM, panarchist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nReturning to this after a long absence - There\u0027s a good chance I am going to rework this for Galileo\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184880-17x-jnsq-07-17-june-2019/\u0022 rel=\u0022\u0022\u003EJe Ne Sais Quoi\u003C/a\u003E mod. I really like the idea of a 1/4 scale system (2.5x the size of \u0022current\u0022 Kerbin), and I\u0027ve had a number of ideas I want to explore since I first started this thread.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI was just thinking yesterday that I could use a map with names and borders on it \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E My story takes place in JNSQ and fleshing out the world behind the story is tedious.\n\u003C/p\u003E\n"},{"CreatedByName":"panarchist","CreatedById":63336,"CreatedDateTime":"2019-07-03T14:26:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223628746\u0022 data-ipsquote-contentid=\u0022165256\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221562129767\u0022 data-ipsquote-userid=\u0022152586\u0022 data-ipsquote-username=\u0022Nnimrod\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Nnimrod said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI was just thinking yesterday that I could use a map with names and borders on it \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E My story takes place in JNSQ and fleshing out the world behind the story is tedious.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve got a border map set up, but no nations yet:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vzhOFCu.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022512\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vzhOFCu.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m probably keeping the same nations I had previously in the Kerbinized-original version. If you\u0027re looking for more than 20 nations, this makes a decent start, and then just fragment the larger chunks either along geographic features / biome boundaries, or like on Earth, use arbitrary straight lines. ;-)\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Also, keep in mind that this is the in-game biome map, so you need to flip it horizontally to get how it looks mapped onto Kerbin.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-07-03T17:04:48Z\u0022 title=\u002207/03/2019 05:04  PM\u0022 data-short=\u00225 yr\u0022\u003EJuly 3, 2019\u003C/time\u003E by panarchist\u003C/strong\u003E\n\u003C/span\u003E\n"}]}