{"TopicId":168906,"ForumId":51,"TopicTitle":"Curing a Burnout: My Attempt At Getting Back Into the Game","CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2017-12-25T22:27:05Z","PageNum":3,"Articles":[{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-06-26T23:33:52Z","Content":"\n\u003Cp\u003E\nThis one\u0027s a smaller mission, but no less important than the previous one. Having proved the ability of the \u003Cem\u003EAurelian \u003C/em\u003Elander, the \u003Cem\u003ENerva \u003C/em\u003Erover, and the \u003Cem\u003EMarius\u003C/em\u003E orbital station, I must now determine which areas of the Mun are rich enough in extractable resources to support a ground base. That is the mission of this probe, \u003Cem\u003EPolybius.\u003C/em\u003E It will be inserted into a polar orbit around the Mun and create a detailed map of the Mun\u0027s resource deposits, which will be used to create a shortlist of possible landing sites to explore in the future.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EPolybius\u003C/em\u003E was a Greek nobleman and historian who was sent to Rome as a hostage in 167 BC. In Rome, he used his nobility status to earn a position as the tutor of several high ranking Roman nobles\u0027 sons, including Scipio Aemilianus. He eventually became Scipio\u0027s advisor, and went on campaign with him during the Third Punic War, and was present at the sack of Carthage. His written accounts of his experiences during this time are some of the most valuable resources available to modern historians attempting to learn about the rise of the Roman Republic, as well as the organization and tactics employed by the Roman legions of this time period. Because of this, the model of a mid-Republican legion (c.300 BC - c.100 BC) is often referred to as a \u0022Polybian Legion\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/UYZsbEr.png\u0022 alt=\u0022UYZsbEr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EPolybius\u003C/em\u003E is launched on a new booster, the \u003Cem\u003EAuxiliary.\u003C/em\u003E It is intended to be fully modular and can fly with variable numbers and sizes of solid rocket boosters. The model used for this launch carries six small SRBs, but heavier payloads can use larger ones if necessary. Upper stages are also interchangeable, this mission carries the Orbital Insertion Stage 1 (henceforth referred to as OIS-1).\n\u003C/p\u003E\n\u003Cp\u003E\nAn Auxiliary was a non-citizen soldier in the Roman army. Auxiliary soldiers would be granted Roman citizenship and the full rights that accompanied it if they completed their 25 years of service with the army. Auxiliaries were organized into units separate from the legions but were usually grouped together with a legion when on campaign. While a typical Roman army\u0027s backbone consisted of a base of heavily armored legionary infantry, Auxiliary cohorts were used to support the legionaries by providing capabilities not available from a standard legionary unit. Therefore, an army\u0027s cavalry, skirmishers, archers, etc. would be made up of auxiliaries. Some auxiliary cohorts also fought as heavy infantry, similar to legionaries, but from what I can tell, this seems to not have been as common.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/gGRc6Kv.png\u0022 alt=\u0022gGRc6Kv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/KIvqb3e.png\u0022 alt=\u0022KIvqb3e.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/BwFQkAD.png\u0022 alt=\u0022BwFQkAD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis model of the \u003Cem\u003EAuxiliary\u003C/em\u003E launch vehicle fires three SRBs on the launch pad, and the other three in flight, staggering the burn time of the SRBs, allowing them to propel the rocket higher and longer without causing excessive acceleration.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/aDpjc6T.png\u0022 alt=\u0022aDpjc6T.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe core stage continues burning long after the SRBs are jettisoned, and can nearly place the payload in orbit by itself.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/q8vpKok.png\u0022 alt=\u0022q8vpKok.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/4bxM60r.png\u0022 alt=\u00224bxM60r.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/3T4yUSB.png\u0022 alt=\u00223T4yUSB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe OIS-1 is built for smaller probes such as this one but is still extremely powerful. It performed both the Trans-Lunar Injection and the Lunar Orbit Insertion burns for \u003Cem\u003EPolybius\u003C/em\u003E, as well as any course corrections needed during the flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/l1oJEgA.png\u0022 alt=\u0022l1oJEgA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce in its final orbit, \u003Cem\u003EPolybius\u003C/em\u003E begins scanning. It has both a large scanner to detect resources in a region and a narrow-band scanner to provide a more detailed view of the ground directly below it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/ZXeKWfn.png\u0022 alt=\u0022ZXeKWfn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/0BggyKL.png\u0022 alt=\u00220BggyKL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/0TSk3cA.png\u0022 alt=\u00220TSk3cA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/1N82RIS.png\u0022 alt=\u00221N82RIS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is the final model created by \u003Cem\u003EPolybius\u003C/em\u003E. Unfortunately, the richest resource deposits are on the far side of the Mun, which is currently unsuitable for base construction due to the possibility of a communications failure should either of the \u003Cem\u003ECato\u003C/em\u003E relays fall out of alignment. The near side has a few resource deposits, but they are relatively isolated, and only a few of them are close enough to the Lunar equator to be easily reached by a lander from \u003Cem\u003EMarius.\u003C/em\u003E I\u0027m sure I can find a good landing site in these regions, but it will be tricky, and possibly take multiple surface excursions. The ideal landing site for the base must feature a large expanse of open, flat ground, to facilitate easy landing, base assembly, and rover operation. It must also be close enough to the Lunar equator to be reached by \u003Cem\u003E Marius\u003C/em\u003E and have enough resources to support a base indefinitely. Finally, it must be far enough away from any mountains so as to allow easy landings with the shallow descent profile I tend to use with \u003Cem\u003EAurelian\u003C/em\u003E. The Mun is still a big place, so I should be able to find what I\u0027m looking for with enough time and persistence.             \n\u003C/p\u003E\n\u003Cp\u003E\nIn the meantime, I plan on beginning work on several other side projects, namely interplanetary probes. I\u0027ve installed the Outer Planets Mod, and a Sarnus transfer window opens in about two days, so I have a flyby mission already in the works. Once the Eve window opens I plan to send an orbiter there, to map both Eve and Gilly for resources, and deploy an atmosphere probe to the planet\u0027s surface.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, that\u0027s enough rambling for one post. I\u0027ve now fully caught up with my in-game progress, with \u003Cem\u003EPolybius\u003C/em\u003E safely in orbit and the Lunar surface fully mapped.\n\u003C/p\u003E\n"},{"CreatedByName":"insert_name","CreatedById":150339,"CreatedDateTime":"2018-06-27T04:37:11Z","Content":"\n\u003Cp\u003E\nFor your lunar comms network I would recommend four satilites in molnya orbits over the poles as then they can not drift away from the mun\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-06-27T05:31:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223406014\u0022 data-ipsquote-contentid=\u0022168906\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530074231\u0022 data-ipsquote-userid=\u0022150339\u0022 data-ipsquote-username=\u0022insert_name\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n53 minutes ago, insert_name said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor your lunar comms network I would recommend four satilites in molnya orbits over the poles as then they can not drift away from the mun\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWould that mean four satellites all with their apoapsis above the north pole, or two with their apoapsis at the north pole and two at the south?\n\u003C/p\u003E\n"},{"CreatedByName":"insert_name","CreatedById":150339,"CreatedDateTime":"2018-06-27T18:31:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223406030\u0022 data-ipsquote-contentid=\u0022168906\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221530077468\u0022 data-ipsquote-userid=\u0022131541\u0022 data-ipsquote-username=\u0022pTrevTrevs\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, pTrevTrevs said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWould that mean four satellites all with their apoapsis above the north pole, or two with their apoapsis at the north pole and two at the south?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTwo over each pole\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-07-04T21:46:22Z","Content":"\n\u003Cp\u003E\nI\u0027ve added the Outer Planets Mod to my game, and my Sarnus transfer window is open, so I\u0027m sending a probe to the outer planets and possibly even interstellar space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/m4k0cCp.png\u0022 alt=\u0022m4k0cCp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe high DeltaV requirements of the mission require yet another new launch vehicle. This one is an improved version of the \u003Cem\u003EAuxiliary\u003C/em\u003E booster, with a more powerful first stage engine, larger SRBs, a much larger second stage, and a new third stage. I swear to god this isn\u0027t (exactly) a copy of the Atlas V, it just turned out looking like this...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/hoZHdzO.png\u0022 alt=\u0022hoZHdzO.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/1bxlrPC.png\u0022 alt=\u00221bxlrPC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/pAc40YN.png\u0022 alt=\u0022pAc40YN.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/zCy77wp.png\u0022 alt=\u0022zCy77wp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis new vehicle has been christened \u003Cem\u003EAuxiliary II\u003C/em\u003E, and will also be used for unmanned launches, mostly for heavier probes and interplanetary spacecraft. It can also be used with variable numbers of SRBs, depending on the payload, and will likely serve as a workhorse of the fleet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/TdtOgnI.png\u0022 alt=\u0022TdtOgnI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe third stage used on this mission is also new and served extremely well during the burn to escape velocity. It may be adapted for future manned flights, pending future testing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/4uMmK6y.png\u0022 alt=\u00224uMmK6y.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the spacecraft is placed on its course for Sarnus, its three equipment booms are deployed. Each one is connected to the spacecraft by a docking port and is rotated out of the way during launch. Once safe to do so, the arms are decoupled and remotely maneuvered to reconnect to the probe bus, and control is provided by a probe core and sets of thrusters on each arm. The arm at the top of this photo holds the probes two RTGs, which will be used for power in the distant reaches of the Solar System, where photovoltaic power is infeasible due to the distance from the sun. The bottom right arm features the magnetometer, which will be used to measure the magnetic fields of Sarnus and any other bodies encountered. The bottom left arm features various other scientific instruments such as thermometers, cameras, gravitometers, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nThis probe is named \u003Cem\u003ESagittarius\u003C/em\u003E, the Latin word for \u0027Archer\u0027. Sagittarii auxiliary units appeared in the Roman military sometime in the early empire. After encountering eastern peoples such as the Parthians, the Romans began using mounted archers, which were much more adept at harassing the enemy from a distance than foot archers were. By the time of the late empire both foot and mounted sagittarii were much more prolific in the army. The Eastern Roman Empire continued to use mounted archers well past the fall of the Western Roman Empire and into the Middle Ages, due to their proximity to eastern empires such as the Sassanids and later the Muslims, who used cavalry to great effect on the open desert plains of the Middle East.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/dVw5BjP.png\u0022 alt=\u0022dVw5BjP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter fully deploying its equipment, \u003Cem\u003ESagittarius\u003C/em\u003E turns to point its high-gain antenna towards Kerbin. This will be its main orientation for much of the mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/dq1rKl7.png\u0022 alt=\u0022dq1rKl7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe probe has a long way to go before its encounter with Sarnus, but I\u0027ll check up on it every now and then for midcourse corrections and such. Currently, its voyage to Sarnus is expected to last 2 years and 300 days. Following its flyby with Sarnus I will attempt to get a gravity assist to Urlum (Uranus\u0027s analog in OPM), but failing that I will attempt to slingshot the spacecraft directly into interstellar space.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore people chastise me, I know it looks like \u003Cem\u003EVoyager\u003C/em\u003E. I wanted it to look like \u003Cem\u003EVoyager\u003C/em\u003E, and its mission is intended to closely mirror \u003Cem\u003EVoyager\u0027s\u003C/em\u003E, but nevertheless, I did my best to instill some spirit of originality in it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"obney kerman","CreatedById":171373,"CreatedDateTime":"2018-07-04T22:22:49Z","Content":"\n\u003Cp\u003E\nNice probe!\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-07-25T05:42:09Z","Content":"\n\u003Cp\u003E\nDespite being absent from this thread for something like twenty days, I actually have very little to report. The summer keeps winding away, and with it, the time I have left before I leave for college, so I\u0027ve had to spend most of my days packing up for the move. Fortunately, I was able to get back to this a little bit more tonight. The bad news is that all I was able to finish was two prototype craft in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/yMnmF5o.jpg\u0022 alt=\u0022yMnmF5o.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFirst, another variant of \u003Cem\u003EScipio\u003C/em\u003E. With the beginning of regular surface excursions with \u003Cem\u003EAurelian II \u003C/em\u003Ecomes a drastically increased demand for fuel in Lunar orbit. Say what you will about that beautiful spacecraft, it\u0027s an absolute gas-guzzler. Unfortunately, \u003Cem\u003EScipio-ST\u003C/em\u003E\u0027s capability to carry fuel is much lower than I had originally thought, and as it turns out, it can barely ship enough fuel to lunar orbit to fill the lander\u0027s tanks, let alone provide \u003Cem\u003EMarius\u003C/em\u003E itself with fuel for orbital corrections. Once I begin mining on the surface, I should have an easier time of it, but until then I need a bigger tanker that can provide a large amount of fuel in a single flight. \u003Cem\u003EScipio-FT\u003C/em\u003E (Fuel Tanker) is basically a stripped down version of the old ST ship. The pressurized cargo module has been removed, and with it the ability to carry \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E containers, but in exchange, the propellant storage tanks have been made much bigger. Furthermore, there is only a single (yet very large) fuel tank within the propellant module, which will make manual refueling much faster and simpler. The FT will likely end up replacing the ST, and any parts I need to be shipped to the Mun can be carried on board a crewed ship instead. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/SUbWJgd.jpg\u0022 alt=\u0022SUbWJgd.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSecond, the first of several logistics vessels intended for constructing or servicing the surface base, once its location has been chosen. This cargo rig can land up to four \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E containers on the Lunar surface In addition to miscellaneous cargo, this rig will likely deliver smaller base components, such as the basic structures of the drilling rig and refinery. Another cargo rig will deliver additional fittings such as radiators, solar panels, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E connectors, the drills themselves, etc. The surface crew will then install the boxed up components on the equipment structure, to form a complete and fully functional drilling rig. I\u0027m still working out the details, but I think this way will pose the smallest challenge while being versatile enough to adapt to any changing circumstances. These cargo rigs are intended to be disposable, and once their payload is delivered to the surface, they will again lift off and crash themselves on the far side of the Mun to remove clutter.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I\u0027m really not looking forward to refueling \u003Cem\u003EAurelian\u003C/em\u003E for its second sortie because of the lag I experience whenever loading \u003Cem\u003EMarius\u003C/em\u003E\u003Ci\u003E, \u003C/i\u003Ethat\u0027s why I\u0027ve been doing smaller things like the Sarnus probe and these other projects. Eventually, however, I\u0027ll have to get around to it...\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-08-04T04:41:39Z","Content":"\n\u003Cp\u003E\nAfter much procrastination, excuse hunting, and genuine fear of confronting this 600\u002B part menace, the Marius airlock is now in place. This newest addition to the station will make spacewalks much easier, and allow spacewalking crewmembers much more capability in servicing the station\u0027s exterior.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/iaqQ53xg.png\u0022 alt=\u0022iaqQ53xg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/aBZ2vU0.png\u0022 alt=\u0022aBZ2vU0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJust like most other lunar-bound payloads, the airlock module is launched aboard a typical Princeps 2 rocket, the medium-heavy workhorse of the booster fleet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/x11lGD5.png\u0022 alt=\u0022x11lGD5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Scipio Upper Stage is used to propel the payload beyond \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and insert it into Lunar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/A0UMQpm.png\u0022 alt=\u0022A0UMQpm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce in Lunar orbit, the Scipio Delivery Module acquires Marius on its rendezvous radar and begins procedures for closing with it. The Delivery Module is simply a modified Scipio Service Module, with the heatshield adapter removed, and the rendezvous radar relocated to the side paneling.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/4gugr9t.png\u0022 alt=\u00224gugr9t.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nClose approach and docking procedures are taken over by the station crew, using modern television guidance systems. Docking was a little hairy, especially when I realized that the delivery module\u0027s solar panels might collide with the Marius Main Solar Array, however, no such thing happened and the airlock was safely hard-docked.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/QlEylTp.png\u0022 alt=\u0022QlEylTp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce safely connected to the station and wired into the power, water, and electricity systems, the airlock was pressurized and the hatch was opened. Shortly after this the delivery module was jettisoned and commanded to separate from the station. It was then set to deorbit itself and impact the far side of the Mun, to avoid a future collision with the station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/XgQ9dq8.jpg\u0022 alt=\u0022XgQ9dq8.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Marius Airlock Module will finally allow EVAs to be conducted from a dedicated platform, rather than the Scipio Orbital Module, and will provide storage racks, EVA refueling canisters, and a safety tether to ensure safe, easy, and efficient spacewalks. It also has the same integrated radiator systems present on most other station modules, reducing the need for large and flimsy deployable radiators.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/gzB6lxM.png\u0022 alt=\u0022gzB6lxM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the docking successfully accomplished, the crew now begins an inaugural spacewalk, to test the airlock\u0027s new systems and to clean up the station\u0027s exterior to help streamline the performance of my computer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/CVscF49.png\u0022 alt=\u0022CVscF49.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFour handholds are clustered around the airlock\u0027s end to allow easy access to the two storage racks mounted around the egress chamber, as well as a safety tether.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/SOpo3eB.png\u0022 alt=\u0022SOpo3eB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe main goal of this EVA is to remove several items that have become either redundant or obstructive with the airlock\u0027s arrival. This includes the tether and storage rack on Aurelian 2\u0027s docking node. Both items are now unnecessary due to the nearby storage and tether provided by the airlock. These parts will be placed in a container until the next opportunity arises to dispose of them.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Yfc48WU.png\u0022 alt=\u0022Yfc48WU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSeveral short-range antennas are also removed from the Core Module and Node 1. These are also redundant, as the station can easily send relays to the two Cato satellites. Both antennas are also obstructive, providing very little clearance between the airlock and the station\u0027s main \u0022spine\u0022. This kind of decluttering EVA will take place periodically, as the station grows larger and my framerate drops. Marius is already at 625 parts, and I haven\u0027t even come close to finishing it according to my plans.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next flight bound for Marius will likely be Scipio-FT 1, with its payload of fuel for Aurelian, and after that, the Expedition 3 crew, which will make the second landing, and take over station operations from Expedition 2 afterward. \n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-08-06T01:39:48Z","Content":"\n\u003Cp\u003E\nBusiness as usual continues with lunar orbital operations, the first Scipio-FT has arrived at the station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Ls7QwmU.png\u0022 alt=\u0022Ls7QwmU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/YFJWZce.png\u0022 alt=\u0022YFJWZce.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/A6exSTD.png\u0022 alt=\u0022A6exSTD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Txtgnz0.png\u0022 alt=\u0022Txtgnz0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe fuel FT-1 delivered will soon be used to fuel up Aurelian 2 for its second journey to the lunar surface, once its next crew arrives. FT-1\u0027s launch was perfectly standard, using a typical \u003Cem\u003EPrinceps 2\u003C/em\u003E, and the flight to the Mun was uneventful. There was an issue with the spacecraft\u0027s electrical system, causing it to lose power in the critical moments before docking, however the crew aboard the station was able to achieve a negligible relative velocity before the power loss, and so the spacecraft was able to stay in position long enough for the problem to be worked. Docking proceeded as normal, with the spacecraft now berthed to the aft node of the Marius Core Module.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, back on Kerbin, to help add some more variety to this save, I\u0027ve begun working on a sort of concept demonstrator to help me determine the feasibility of constructing a glider for use on Duna one day. It seats a single kerbal, and is extremely lightweight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/3fHbEtx.png\u0022 alt=\u00223fHbEtx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/mDpL8Lo.png\u0022 alt=\u0022mDpL8Lo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAn actual interplanetary aircraft will probably be powered by a liquid-fueled engine, or possibly monopropellant system, but this early test rig only uses two separatron rockets to give it a short boost into the air for about thirty seconds to one minute of flight time. The spherical fuel tank underneath the wing is intended only for ballast, although in the future it may be called upon to power the aircraft itself.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/oIi8rjD.png\u0022 alt=\u0022oIi8rjD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe glider is certainly airworthy, although without any kind of power plant, it is extremely slow, and really lacks sufficient lift to serve as a dedicated glider. Future test models will possibly be towed into the air with another aircraft, or simply given engines of their own, in order to test long duration flight at various altitudes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/gn59xeE.png\u0022 alt=\u0022gn59xeE.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/XhJGCl4.png\u0022 alt=\u0022XhJGCl4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCurrently, the aircraft is slightly nose-heavy, but it flew a surprisingly long distance, considering how weak its takeoff boost actually was. I have no idea what\u0027s going on with the wheels sticking out of the top of their fairings, but I guess it\u0027s something with the game\u0027s suspension model...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/ycxow1t.png\u0022 alt=\u0022ycxow1t.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis design still has one problems to work out, namely issues regarding landing. Many other things will have to change before this aircraft will have evolved enough to be worthy of an interplanetary flight, but this is a start nonetheless.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2018-08-06T21:01:58Z","Content":"\n\u003Cp\u003E\nThe glider may be nose heavy because of the weight of the kerbal in the command seat. Try adjusting the wings in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E with a 94kg part near the command seat.\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-08-06T22:15:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223428991\u0022 data-ipsquote-contentid=\u0022168906\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221533589318\u0022 data-ipsquote-userid=\u0022139256\u0022 data-ipsquote-username=\u0022Mad Rocket Scientist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Mad Rocket Scientist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe glider may be nose heavy because of the weight of the kerbal in the command seat. Try adjusting the wings in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E with a 94kg part near the command seat.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually, I was wondering if the command seat\u0027s mass value in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E factors in the weight of a Kerbal sitting in it, I guess now I know...\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-08-06T22:39:26Z","Content":"\n\u003Cp\u003E\nLove it.\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-08-06T23:50:22Z","Content":"\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/NRJYImd.png\u0022 alt=\u0022NRJYImd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEVA training for Surface Expedition 3 is underway. This mission will be the first to land at a resource deposit and will bring with it special equipment for sampling ore from the surface. No high-intensity mining will be attempted on this mission, but a small amount of ore will be extracted for testing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/EVvQx7s.png\u0022 alt=\u0022EVvQx7s.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn order to safe space, this mission will not carry the bulky dish antenna used by SE-2, instead this mission will use Aurelian\u0027s main antenna to transmit to Kerbin, while the SEP will only transmit data when Marius passes overhead, eliminating the need for a dedicated long-distance antenna stand.\n\u003C/p\u003E\n\u003Cp\u003E\nThis mission also has a new electrical system. The new stand features bigger solar panels which can track the sun, as well as two radiator panels, to help shed away the heat produced by the mining equipment.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/wV2jPyZ.png\u0022 alt=\u0022wV2jPyZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe mission will also carry a full suite of SEP instruments, which will be linked into the same central station as the solar stand and mining rig. Many cables are crosses over one another in this training operation, but on the Mun, the instruments will be more spread out. A hose was also connected to the Aurelian Training Mockup, to simulate a potential plan to supply Aurelian with power from the electrical station during its surface stay. Such a setup would help improve conditions during the lunar night when solar power is unusable. However, in order to achieve this, the power station will have to be modified yet again with RTGs in order to provide a constant, efficient power supply throughout all conditions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/fVSj08q.png\u0022 alt=\u0022fVSj08q.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe training test was promptly terminated once it was realized that due to a miscommunication the crew had proceeded so far into the test that they had begun drilling holes in the side of the launch pad.\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-08-07T00:37:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223429087\u0022 data-ipsquote-contentid=\u0022168906\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221533599422\u0022 data-ipsquote-userid=\u0022131541\u0022 data-ipsquote-username=\u0022pTrevTrevs\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, pTrevTrevs said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe training test was promptly terminated once it was realized that due to a miscommunication the crew had proceeded so far into the test that they had begun drilling holes in the side of the launch pad.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHAHAHAHAHAHAHAHA\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-08-28T05:22:56Z","Content":"\n\u003Cp\u003E\nFinally back into the swing of things after my move to Huntsville, and I\u0027m still managing to find chances here and there to play KSP\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022npJz6ZI.png\u0022 src=\u0022https://i.imgur.com/npJz6ZI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe fuel tanker has been emptied and discarded, it will be deorbited on the far side of the Mun, just like every other unmanned supply ship sent to Marius.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iXMfE20.jpg\u0022 src=\u0022https://i.imgur.com/iXMfE20.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224OmohZ3.png\u0022 src=\u0022https://i.imgur.com/4OmohZ3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, the next landing crew has launched from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, aboard Scipio 6. Unlike the previous mission, this crew has launched before their cargo lander, due to last-minute payload changes. Scipio 6 will dock to Marius and its crew will help man the station for the next few weeks while waiting for their cargo shipment to arrive and prep the landing site. \n\u003C/p\u003E\n\u003Cp\u003E\nThis landing crew will be the first to extract resources from the lunar surface, and thanks to a newly added mission objective, they will use a small refinery sent aboard the cargo lander to produce fuel to help return to orbit. If the procedure goes well it will help lessen Marius\u0027s reliance on supply ships, and allow Aurelian to be refueled cheaper and faster.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-08-28T05:29:56Z\u0022 title=\u002208/28/2018 05:29  AM\u0022 data-short=\u00225 yr\u0022\u003EAugust 28, 2018\u003C/time\u003E by pTrevTrevs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dafni","CreatedById":149636,"CreatedDateTime":"2018-08-28T07:10:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223441149\u0022 data-ipsquote-contentid=\u0022168906\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221535433776\u0022 data-ipsquote-userid=\u0022131541\u0022 data-ipsquote-username=\u0022pTrevTrevs\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, pTrevTrevs said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe fuel tanker has been emptied and discarded, it will be deorbited on the far side of the Mun, just like every other unmanned supply ship sent to Marius.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOkay, so that\u0027s where you hide all your trash  \u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003EGood to see you are back after your move\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-08-28T13:42:13Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EUh... Whoohoo? Anyways: MOAR!\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-08-28T15:58:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223441167\u0022 data-ipsquote-contentid=\u0022168906\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221535440259\u0022 data-ipsquote-userid=\u0022149636\u0022 data-ipsquote-username=\u0022Dafni\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Dafni said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOkay, so that\u0027s where you hide all your trash  \u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003EGood to see you are back after your move\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI mean... it’s got to go somewhere...\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-08-28T19:35:07Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EUse extraplanetary launchpads recycler to destroy it\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-08-28T22:45:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223441418\u0022 data-ipsquote-contentid=\u0022168906\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221535484907\u0022 data-ipsquote-userid=\u0022187595\u0022 data-ipsquote-username=\u0022The Minmus Derp\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, The Minmus Derp said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EUse extraplanetary launchpads recycler to destroy it\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know, I don\u0027t particularly mind crashing ships on the far side of the Mun, it\u0027s not hard to do.\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-08-28T22:47:58Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EAlso, you can use the bits collected by the recycler from the ship to build a new ship!\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-09-06T04:25:07Z","Content":"\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/DY77fl0.png\u0022 alt=\u0022DY77fl0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSurface Expedition 3\u0027s cargo lander has finally launched, following repeated delays concerning the final payload. The changes made include the addition of a small refinery to allow resource sampling, as well as the replacement of the solar arrays originally intended for this mission with RTGs, to facilitate operations in the lunar night.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/o4JcNuH.png\u0022 alt=\u0022o4JcNuH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch was pretty normal, nothing new or interesting to show.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/V0PkERc.png\u0022 alt=\u0022V0PkERc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnlike Surface Expedition 2, I have no pinpoint target in mind, but rather a large swath of land containing a bountiful resource pocket, just north of the Mun\u0027s equator on the middle of the near side. To help guide myself during descent, I used the Polybius scanning probe, still in orbit around the Mun, to lay down two KerbNet waypoints surrounding what appeared to be the flattest land in the region, to mark the ends of a target ellipse, for which I would aim with the cargo lander. The actual landing site turned out to be just south of the light blue marker.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/7jHivwm.png\u0022 alt=\u00227jHivwm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCargo-2 passing above the landing site just after arriving in Lunar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/XMlMk08.png\u0022 alt=\u0022XMlMk08.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne orbit later Cargo-2 begins its powered descent, aiming for the plains marked out by Polybius\u0027s waypoints.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/RwhDFGG.png\u0022 alt=\u0022RwhDFGG.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs it turns out, the land is pretty good for landing, almost perfectly flat, but also bordered by craters which may offer interesting exploration opportunities.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/H4bgiVx.png\u0022 alt=\u0022H4bgiVx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/9pCj4ls.png\u0022 alt=\u00229pCj4ls.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCargo-2 is now safely on the surface, with its drilling and refining machinery ready to be unpacked by the landing crew, which should be arriving within the week. Until then Cargo-2 wait on the surface, doing with it can with its onboard cameras to inspect the site.\n\u003C/p\u003E\n\u003Cp\u003E\nPending the successful conclusion of this surface expedition, I plan to begin development of hardware meant for manned missions to Minmus. Although a base there would be less practical than on the Mun, its distance from Kerbin allows ample opportunity to experiment with long-duration flight in deep space. A new version of Scipio specially intended for deep space missions such as this is under development, as well as a new launcher capable of lifting it to Minmus. Instead of an orbital module, this Scipio Block III will have a new Mission Module, which will be stored in the fairing underneath the spacecraft during launch and retrieved once in orbit. It will be larger than the current Orbital Module and will provide much more utility in deep spaceflight. However, the launch schedule is still clogged with Lunar missions, as well as new modules for Marius, and no flight to Minmus is planned in the short-term.\n\u003C/p\u003E\n"},{"CreatedByName":"Johan-c","CreatedById":191465,"CreatedDateTime":"2018-09-06T19:20:05Z","Content":"\n\u003Cp\u003E\nYou have totally inspired me to build out a proper Munar base.  Till now I\u0027ve been taking contracts in career mode and totally letting those guide the development of my game. While this has led to what seems to me like fast research progress, it has also spread out my efforts far and wide - I have barely landed on the Mun twice, yet have some probes on their way to Duna and Ike (actually, two landers and a communications relay - I \u003Cem\u003Ehope\u003C/em\u003E the relay has a powerful enough antenna to communicate with Kerbin...)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI like your approach of building out the boundaries slightly more slowly, but be a bit more thorough about it.  It\u0027s more strategic.  For instance, once \u003Cem\u003EMarius\u003C/em\u003E is getting plenty of fuel from mining operations on the surface, might it be possible to lighten launchers taking off from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E for other planets, by using \u003Cem\u003EMarius\u003C/em\u003E as a refuelling stop?  I imagine it might be quite practical - it\u0027s much easier to escape Munar orbit than \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2018-09-06T21:50:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223446410\u0022 data-ipsquote-contentid=\u0022168906\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536261605\u0022 data-ipsquote-userid=\u0022191465\u0022 data-ipsquote-username=\u0022Johan-c\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Johan-c said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI like your approach of building out the boundaries slightly more slowly, but be a bit more thorough about it.  It\u0027s more strategic.  For instance, once \u003Cem\u003EMarius\u003C/em\u003E is getting plenty of fuel from mining operations on the surface, might it be possible to lighten launchers taking off from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E for other planets, by using \u003Cem\u003EMarius\u003C/em\u003E as a refuelling stop?  I imagine it might be quite practical - it\u0027s much easier to escape Munar orbit than \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Found 1 error in text\u0022\u003E\n1\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv title=\u0022Protected by Grammarly\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think that it would be all that useful to use Marius as a refueling stop for interplanetary ships instead of simply launching directly from Kerbin. The fuel I save would be negligible, considering that I would first need to travel to the Mun and rendezvous with Marius which costs more fuel. Additionally, I would then have to perform my planetary ejection burn from the Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E rather than Kerbin\u0027s, which means I could not make as much use of the Oberth effect to propel me along, should I choose to do so. In addition, the fact that I\u0027m orbiting a body which itself is orbiting Kerbin, which is also moving in its own orbit means it will be much more complicated to calculate and achieve an ideal ejection angle, as I would have to wait for the Mun to approach the proper point in its orbit before departing, potentially giving me a much shorter time window in which to launch a spacecraft. In short, my fear is that I would end up using more resources and go through more trouble than it\u0027s worth to simply top off an interplanetary ship\u0027s fuel tanks when I could simply take slightly more fuel at the start.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s an interesting possibility, but not really one that I plan on exploring as of yet. To be fair though, manned interplanetary missions are still quite far away in my roadmap, so maybe my viewpoint will change between now and then.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, make sure to post some pictures when you get your own base up and running, I\u0027ll be looking forward to seeing it!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-06T21:52:33Z\u0022 title=\u002209/06/2018 09:52  PM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 6, 2018\u003C/time\u003E by pTrevTrevs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-09-06T22:25:13Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003ECan you do more schtuff at minmus? like, you have landed on the mun 3 times, and have a space station. but nothing but a teeny probe is around minmus. wut? \u003C/span\u003E\n\u003C/p\u003E\n"}]}