{"TopicId":174222,"ForumId":51,"TopicTitle":"Fun with sepratrons on Duna lander","CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-04-24T00:10:15Z","PageNum":1,"Articles":[{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-04-24T00:10:15Z","Content":"\n\u003Cp\u003E\nSo, just a silly little mission designed around fulfilling a contract that ended up way cooler than I expected.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe situation:  I was strapped for cash, but then a lucrative contract came along for \u0022Test 10m heat shield landed at Duna.\u0022  Was worth a ton of funds.  So I grabbed it, and since I hadn\u0027t been to Duna yet in this career, decided to make it a science lander, as well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xWtyaUU.png\u0022 class=\u0022ipsImage\u0022 height=\u0022703\u0022 src=\u0022https://i.imgur.com/xWtyaUU.png\u0022 width=\u0022998\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe interesting design challenge was this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan\u003EI wanted to use the heat shield \u003Cem\u003E\u003Cu\u003E\u003Cstrong\u003Eas\u003C/strong\u003E\u003C/u\u003E\u003C/em\u003E a heat shield, even though Duna reentry doesn\u0027t usually need it (because I had a crappy transfer window and was coming in hot), meaning that I needed to \u003Cu\u003E\u003Cem\u003Einflate\u003C/em\u003E\u003C/u\u003E it before hitting atmosphere.\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan\u003EOn the other hand, I couldn\u0027t \u003Cu\u003E\u003Cem\u003Ekeep\u003C/em\u003E\u003C/u\u003E it on the lander after landing, since it completely overshadowed all my solar panels and such, so the lander would go dead pretty soon if I kept it that way.\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan\u003EBut I couldn\u0027t jettison it \u003Cu\u003E\u003Cem\u003Ebefore\u003C/em\u003E\u003C/u\u003E landing, because then I couldn\u0027t do the \u0022run test while landed\u0022 thing.\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSo this made for an interesting problem:  \u003Cstrong\u003Ehow to get the darn heat shield off the lander\u003C/strong\u003E, \u003Cem\u003E\u003Cu\u003Eafter\u003C/u\u003E\u003C/em\u003E landing, without harming the lander?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jGbmzg0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022633\u0022 src=\u0022https://i.imgur.com/jGbmzg0.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo, what I settled on was to mount the heat shield on an inverted decoupler atop the lander, then mount a couple of sepratrons to it.  The sepratrons were mounted symmetrically, but they weren\u0027t actually a symmetry group.  This allowed me to give one sepratron a thrust-limiter setting just a \u003Cem\u003E\u003Cu\u003Esmidgeon\u003C/u\u003E\u003C/em\u003E higher than the other one.  The idea was that the slightly asymmetric thrust would make the heat shield curve off to one side as it lifts off the lander, so it would be flung clear and wouldn\u0027t come back down on top of it.\n\u003C/p\u003E\n\u003Cp\u003E\nSeemed like a sound idea, the math worked out... but of course one never knows in KSP how something will turn out until one tries it.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022n6xvOrg.png\u0022 class=\u0022ipsImage\u0022 height=\u0022553\u0022 src=\u0022https://i.imgur.com/n6xvOrg.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...it ended up looking \u003Cem\u003E\u003Cu\u003Eway\u003C/u\u003E\u003C/em\u003E cooler than I expected, and worked perfectly.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Did exactly what I wanted it to.\n\u003C/p\u003E\n\u003Cp\u003E\nThe sepratrons were tuned to roughly 50% thrust, so they burned for a while and accelerated smoothly as the heat shield arced away from the lander.  It was \u003Cem\u003E\u003Cu\u003Eawesome\u003C/u\u003E\u003C/em\u003E, felt just like it was one of the NASA Mars rover landings.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Gnn8X0x.png\u0022 class=\u0022ipsImage\u0022 height=\u0022759\u0022 src=\u0022https://i.imgur.com/Gnn8X0x.png\u0022 width=\u0022900\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt turns out that a couple of sepratrons have got a surprising amount of muscle, on Duna.  They flung the heat shield half a kilometer into the sky.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022L8TuW92.png\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.imgur.com/L8TuW92.png\u0022 width=\u0022825\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUp, up, and away!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003E(If you\u0027re thinking \u0022gee, Ike looks funny,\u0022 you\u0027re not seeing things.  That\u0027s Pol.  Just for fun and variety, I\u0027m playing a modded solar system for this career.  Duna has Bop and Pol orbiting it close in, like Phobos and Deimos.)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEven better, the heat shield didn\u0027t even explode when it came back down-- it has a pretty low terminal velocity when inflated, even on Duna. So now I\u0027ve got my lander standing there, with the discarded heat shield a few hundred meters away. The tableau looks just like one of those NASA Mars rover landing sites.\n\u003C/p\u003E\n\u003Cp\u003E\nIncidentally... the landing was a lot more fun than the usual routine, too.  I\u0027m playing 1.4.2, meaning that landing legs are bugged and I wanted to set down \u003Cem\u003E\u003Cu\u003Esuper\u003C/u\u003E\u003C/em\u003E gently so they wouldn\u0027t explode.  But I\u0027m also playing with Scatterer and SVE, meaning that Duna has all these dense dust clouds blowing around... and I was landed pretty close to sunset, so that I didn\u0027t have a shadow to go by.  So I was flying almost blind and trying to keep the descent speed low, and the tense last bit before touchdown felt like the suspense in a NASA control room, in a way that most of my landings don\u0027t, these days.\n\u003C/p\u003E\n\u003Cp\u003E\nSo... this was one of those rare missions that turned out to be a whole lot cooler than I expected.  (And gave me an opportunity to use sepratrons, which normally I never have any use for.)  And it was just because I happened to build a somewhat unusually-designed ship, in order to satisfy a silly contract.\n\u003C/p\u003E\n\u003Cp\u003E\nThe best example of KSP serendipity I\u0027ve played in a while.  Gosh, that was satisfying.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DAL59","CreatedById":180784,"CreatedDateTime":"2018-04-24T00:13:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223362305\u0022 data-ipsquote-contentid=\u0022174222\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524528615\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m playing a modded solar system for this career\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nwhat mod?\n\u003C/p\u003E\n"},{"CreatedByName":"Noobton","CreatedById":114094,"CreatedDateTime":"2018-04-24T00:16:57Z","Content":"\n\u003Cp\u003E\nI love that picture of the shield ascending towards Ike. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m still surprised how beautiful this game is (and Scatterer always helps too)\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-04-24T00:35:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223362309\u0022 data-ipsquote-contentid=\u0022174222\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524528832\u0022 data-ipsquote-userid=\u0022180784\u0022 data-ipsquote-username=\u0022DAL59\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/23/2018 at 5:13 PM, DAL59 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhat mod?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust vanilla Kopernicus, and a set of custom configs I\u0027ve put together to arrange the solar system for challenge and novelty.  Kopernicus makes this super easy to do.\n\u003C/p\u003E\n\u003Cp\u003E\nI figured I\u0027d do a career play-through to see how fun it is, then if I like it enough, post it as a mod (super lightweight, since there are no new planets-- it\u0027s just a few little config files).\n\u003C/p\u003E\n\u003Cp\u003E\nFor the curious, details of the modded solar system in spoiler.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nDesign goal:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EMake routine stuff more interesting.\u003C/strong\u003E  In stock, I get bored with Moho and never do anything interesting there; and I never visit Dres or Eeloo at all.  And I\u0027ve been to Mun and Minmus so many times I\u0027m sick of them, so do something to jazz them up and add challenge.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EMake some interesting tableaux.\u003C/strong\u003E  Have interesting skies to look at while I\u0027m flying around.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSo, here\u0027s what I\u0027ve done:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nI\u0027ve moved Moho to a highly eccentric orbit, considerably closer in to the sun.  Needs more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to get there, and ships had better have radiators on them.  So it\u0027s a bit more of a challenge now.\n\u003C/li\u003E\n\u003Cli\u003E\nTo compensate for that, and make Moho more interesting, Gilly becomes a moon of Moho, in a very low equatorial orbit.  Moho looks \u003Cem\u003E\u003Cu\u003Ehuge\u003C/u\u003E\u003C/em\u003E.  Gilly makes a convenient place to mine fuel.\n\u003C/li\u003E\n\u003Cli\u003E\nWith Gilly gone, Eve needs a moon.  Give it Ike, and make it orbit fairly close in, not unlike the Duna/Ike pair in stock KSP.  I\u0027ve got other plans for Duna.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Mun moves into a funky orbit, inclined over 60 degrees, highly eccentric, and perfectly semi-synchronous (i.e. takes exactly two Kerbin days).  I\u0027ve arranged it so that it slides spectacularly huge across the eastern sky near \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E every couple of days at periapsis.  Makes for some neat views when launching.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Putting the Mun in an orbit like this not only makes for great screenshots, but also adds quite a bit of challenge to going there.  And its \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E at periapsis comes close enough to Kerbin to make it an interesting challenge to build comsat networks.\n\u003C/li\u003E\n\u003Cli\u003E\nDres moves to be a \u0022pseudo-satellite\u0022 of Kerbin.  What I mean by that is, it\u0027s still orbiting the Sun... but in an orbit with exactly the same semimajor axis as Kerbin, and just a touch of eccentricity.  The result is that it\u0027s forever about 150,000 km from Kerbin, and from Kerbin\u0027s point of view seems to \u0022orbit\u0022 once a year.  \u003Cspan style=\u0022font-size:10px;\u0022\u003E(Unabashedly stole the idea from the moon Aptur in the New Horizons mod.)\u003C/span\u003E  This makes it an interesting destination that can be reached any time (no waiting for launch windows), but still needs a bit of navigational thought.  Also, it\u0027s a distance that gives the 2G antennas more of a reason to exist (they don\u0027t really seem to have any use in stock KSP, other than the Jool system).\n\u003C/li\u003E\n\u003Cli\u003E\nMinmus moves to be a satellite of Dres.  So, where Kerbin used to have two convenient moons, it now has one inconvenient moon, and two reasonably-accessible \u0022pseudo-moons\u0022 that are a bit harder to get to than Minmus used to be.\n\u003C/li\u003E\n\u003Cli\u003E\nDuna keeps the same orbit, but now has Pol and Bop orbiting close in, like Phobos and Deimos.  Both are in somewhat elliptical orbits, in a 3:1 resonance so they never collide even though Bop\u0027s \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E is lower than Pol\u0027s \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E.  I\u0027ve set it up so that Duna basically has no \u0022safe zone\u0022 near it at all:  at \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E, Pol\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E comes within 1 km of the top of Duna\u0027s atmosphere.  So there\u0027s basically nowhere safe to put a satellite in Duna orbit unless you go way out past Bop\u0027s apoapsis.\n\u003C/li\u003E\n\u003Cli\u003E\nSnagging Dres left a gap in the solar system, so Jool moves inwards to where Dres\u0027 old orbit used to be.\n\u003C/li\u003E\n\u003Cli\u003E\nI stole two of Jool\u0027s moons, so to compensate, move Eeloo to be a moon of Jool.  It\u0027s on an oddball inclined, eccentric orbit that goes closer in than Val but way farther out than Tylo.  It\u0027s carefully arranged so that it collides with neither moon (it has the exact same orbital period as Tylo, and I\u0027ve nudged Vall to be in a perfect 2:1 resonance.)  Result is that it\u0027s interesting to navigate around, and comes close enough to Vall on each periapsis that it generates some pretty sky images.\n\u003C/li\u003E\n\u003Cli\u003E\nI\u0027ve also added a compatibility patch for Outer Planets, so that if it\u0027s installed, all of them are moved inwards to compensate (with Sarnus moving to Jool\u0027s old orbit, and the other planets\u0027 orbits scaled down accordingly).  Also, in this case, Eeloo stays in Sarnus orbit, as OPM normally does.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nOverall, I\u0027ve been pretty happy with it so far.  I\u0027m about midway through a career.  I\u0027ve explored Mun / Minmus / Dres, which was way more fun for me than just doing Mun / Minmus in a stock play-through, and now I\u0027m starting to get probes in places like Moho and Duna.  Pretty soon I\u0027ll be sending kerbonauts out, and probes to various other places.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Duna / Pol / Bop system looks like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QmyzDca.png\u0022 class=\u0022ipsImage\u0022 height=\u0022400\u0022 src=\u0022https://i.imgur.com/QmyzDca.png\u0022 width=\u0022400\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uP5kNY0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022188\u0022 src=\u0022https://i.imgur.com/uP5kNY0.png\u0022 width=\u0022500\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n[UPDATE]  Okay, I\u0027ve published the rejiggered solar system as a mod, here:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed1107307457\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/175039-143-snarkiverse-v10-rearrange-the-solar-system-for-challenge-variety/\u0026amp;do=embed\u0022 style=\u0022height:205px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223362313\u0022 data-ipsquote-contentid=\u0022174222\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524529017\u0022 data-ipsquote-userid=\u0022114094\u0022 data-ipsquote-username=\u0022Noobton\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/23/2018 at 5:16 PM, Noobton said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI love that picture of the shield ascending towards Ike.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:9px;\u0022\u003E(Pol)\u003C/span\u003E \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-05-17T17:10:50Z\u0022 title=\u002205/17/2018 05:10  PM\u0022 data-short=\u00226 yr\u0022\u003EMay 17, 2018\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003Cbr\u003EAdd link to the Snarkiverse mod, now that I\u0026#039;ve published it\n\u003C/span\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2018-04-24T00:39:19Z","Content":"\n\u003Cp\u003E\nOK, have to admit, that was fun!  \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Noobton","CreatedById":114094,"CreatedDateTime":"2018-04-24T01:22:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223362331\u0022 data-ipsquote-contentid=\u0022174222\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524530121\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:9px;\u0022\u003E(Pol)\u003C/span\u003E \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOops... hahaha\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-05-17T17:11:46Z","Content":"\n\u003Cp\u003E\nFYI, for anyone who was curious about the modded solar system in which I was playing this game, and who may want to try it out, I\u0027ve now published it as a mod:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed4281026519\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/175039-143-snarkiverse-v10-rearrange-the-solar-system-for-challenge-variety/\u0026amp;do=embed\u0022 style=\u0022height:205px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SiriusRocketry","CreatedById":178125,"CreatedDateTime":"2018-05-18T04:24:00Z","Content":"\n\u003Cp\u003E\nCool!\n\u003C/p\u003E\n\u003Cp\u003E\nI always imagine the Interstellar docking theme playing when something intense is happening.\n\u003C/p\u003E\n"}]}