{"TopicId":176128,"ForumId":51,"TopicTitle":"Beginnings: A Tale of Four Kerbalnauts","CreatedByName":"Hummingbird Aerospace","CreatedById":187811,"CreatedDateTime":"2018-06-23T14:16:06Z","PageNum":1,"Articles":[{"CreatedByName":"Hummingbird Aerospace","CreatedById":187811,"CreatedDateTime":"2018-06-23T14:16:06Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Ci\u003E“Mystery creates wonder and wonder is the basis of Kerbal’s desire to understand”\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n-Neil Kerman\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is the story if how it all came together, the Kerbal Space Program, the story of how the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was built. The story of how the 4 greatest Kerbal beings of all time met together. This is the story of those 4 daring Kerbonauts, the pioneers of space and the explorers of worlds. This is the story of how it all started.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCHAPTER 1\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022color:#454545;font-size:14px;\u0022\u003E\n\u003Cspan style=\u0022font-size:14pt;\u0022\u003EJebediah, Bill, Bob, and Valentina Kerman found themselves inside a compact little shuttle bus. They zoomed past crowds of cheering spectators, photographers desperately trying to get a picture of one of these four famous Kerbalnauts. No, not Kerbals, Kerbalnauts, the pioneers of space travel. Explorers of worlds. Inside the van, the four Kerbalnauts kept to themselves, chatting about stuff and space. They all wore orange flight suits and held helmets by their sides. There were also 6 others inside the cramped shuttle. One of them was the famous Wernher von Kerman. Wernher was an ultra-famous rocket scientist, and he was the one that came up with the idea of a space program. Wernher wore glasses, a red bow tie, a neat white suit, and had a moustache. He was happily waving at all the photographers, basking in the camera flash. Next to him was Linus Kerman, a junior scientist and co-chief of research and development at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.He worked with Wernher von Kerman, but he was the one who would attended all the strategy conferences, since Wernher deemed himself “too important” to be at boring meetings. He was wearing the same as Wernher, but apart from that, looked like a pretty typical Kerbal.The driver of the bus was Gene Kerman, humming and patiently driving through the crowds at a slow speed and dodging that were failed to be held back by security’s futile attempt at keeping people from getting in the way of the bus. He wore a white vest, a headset, and had lightly-coloured hair, instead of the usual black hair colour. Gene was to be head of Mission Control at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, which he was very happy about. Sitting near the back next to Werner and Linus was Gus Kerman, the chief of construction in general at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. He wore basic construction worker garb, which was a yellow hard hat, a white shirt, and a yellow vest. He had already been there, since he needed to direct construction, so he was in a more casual mood than everyone else. In the last row of the van, next to the four Kerbalnauts, Mortimer Kerman was scowling at Gus for forgetting to add a fence around the main road leading into the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E complex. Mortimer was the manager of finances and was the man who had to be consented with when Wernher wanted to build a really big rocket. He wore a nice black suit with a tie and was an older kerbal with wrinkles. Sitting in the shotgun seat was Walt Kerman, with stubble and wearing a hazmat suit, waving at the children who were jumping up and down with their Walt Kerman action figures.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCHAPTER 2\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nA few minutes later, the shuttle bus had almost arrived at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, and by now they had passed the crowds of paparazzi. Most of the passengers in the bus were jiggling with excitement by now, as the magnificent Kerbal Space Centre was in sight by now. They zoomed closer and closer, and drove up a small hill. The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was built on a raised patch of land above the rest of the flatlands/shores. They drove by the seaside and then turned to drive up a small hill. They drove by the Launch pad, was just a bunker and a patch of sand with a burn score in the middle, already charred by rocket tests. They drove on the crawler way towards the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, a tall, rectangular grey building with green rooftops and a large door. They zoomed past it and drove past the Tracking Station, a small circular building with a radar on a patch of concrete, with two more patches surrounding it. The bus stopped at the R\u0026amp;D, a huge plot of land with only a few hangars, domes, and temporary buildings tucked in the corner. Wernher and Linus hopped out to be greeted by two other scientists, and walked inside discussing scientific stuff. The bus zoomed away and about 20 seconds later they parked at the administration building, a small, squat, rectangular building on a large plot of land where everyone got out. Gene turned off the bus and walked over to the mission control building, another building similar to the administration building close to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. Walt, Mortimer, Linus, and Gus walked into the administration building while Jeb, Bob, Bill, and Val excitedly jumped out of the bus and went over to the astronaut complex, a short but wide building with a path of concrete leading out of it and ending in a circle around a flagpole, hoisting the Kerbal Space Program official flag. The four Kerbalnauts paced down the neatly-kept lawn and into the building.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003EQuote based off Neil Armstrong’s quote “Mystery creates wonder, and wonder is the basis of man’s desire to understand”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-06T12:54:00Z\u0022 title=\u002209/06/2018 12:54  PM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 6, 2018\u003C/time\u003E by Hummingbird Aerospace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2018-06-24T14:33:25Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/187811-hummingbird-aerospace/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022187811\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/187811-hummingbird-aerospace/\u0022 rel=\u0022\u0022\u003E@Hummingbird Aerospace\u003C/a\u003E To make a hidden comment (called a spoiler) click the little eye button at the top of the post editor \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Hummingbird Aerospace","CreatedById":187811,"CreatedDateTime":"2018-08-20T01:06:05Z","Content":"\n\u003Cp\u003E\nJust mentioning the text is huge because I wrote this in notes on my iPad. I will try to get images soon.\n\u003C/p\u003E\n"}]}