{"TopicId":176923,"ForumId":51,"TopicTitle":"The Mission, Controlled: Old-timer Mortimer!","CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-07-22T16:19:11Z","PageNum":1,"Articles":[{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-07-22T16:19:11Z","Content":"\n\u003Cp\u003E\nHello, everyone! This is a mission report, but with a slight twist. This is a spinoff of the popular mission report The Duna Enterprise.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed9757699452\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/168683-the-duna-enterprise/\u0026amp;do=embed\u0022 style=\u0022height:226px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThe timelines diverge at the last \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/168683-the-duna-enterprise/\u0026amp;do=findComment\u0026amp;comment=3416819\u0022 rel=\u0022\u0022\u003Echapter\u003C/a\u003E , which lead to events resulting in the fading of Kerbals\u0027 spirit of exploration. The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E now only launches communication and Kerbin observation satellites. The once famous Kerbal Space Program, which had been a household name back in the day, is now mediocre at the best. Will the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E fade into the darkness or will it rise up once again? Find out, in this mission report!\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003EThe Mission, Controlled!!!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003ETable of contents:\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EChapter 1: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/176923-the-mission-controlled/\u0022 rel=\u0022\u0022\u003EInitiation\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EChapter 2: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/176923-the-mission-controlled/\u0026amp;do=findComment\u0026amp;comment=3424156\u0022 rel=\u0022\u0022\u003ETrial by....fire?\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EChapter 3: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/176923-the-mission-controlled/\u0026amp;do=findComment\u0026amp;comment=3428109\u0022 rel=\u0022\u0022\u003EThe Administrontium\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EChapter 4: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/176923-the-mission-controlled-the-administrontium/\u0026amp;do=findComment\u0026amp;comment=3432471\u0022 rel=\u0022\u0022\u003EThe Herd Mentality\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EChapter 5: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/176923-the-mission-controlled-cleaning-the-pipes/\u0026amp;do=findComment\u0026amp;comment=3443871\u0022 rel=\u0022\u0022\u003ECleaning the Pipes\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EChapter 6: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/176923-the-mission-controlled-cleaning-the-pipes/\u0026amp;do=findComment\u0026amp;comment=3449156\u0022 rel=\u0022\u0022\u003EOld-timer Mortimer!\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EChapter 7: \u003Ca href=\u0022\u0022 rel=\u0022\u0022\u003EThe Moho Mystique\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cu\u003EChapter 1: Initiation\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cu\u003EYear 233, International Geology and Chemistry Conference\u003C/u\u003E\u003Cbr\u003E\n\u0022And hence I believe, that such a mineral could exist. If not in our planet,then somewhere else in the solar system.\u0022 Dr. Rover D Ude Kerman finished his presentation. The younger scientists took down notes as fast as possible, while the elder, more experienced ones murmured in disagreement.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I think I speak for the majority of us, but Mr. Rover, such an hypothesis is just a good piece of fantasy in my opinion. A mineral with such volatile properties could not stay stable for too long, and its chemical structure would eventually break down. I think it\u0027s time for you to get off the stage and allow cooler minds take over.\u0022 One of the senior scientists spoke up, condescension dripping like venom in his voice.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022That\u0027s what you said about Karbonite, when you could not find any appreciable quantities in Kerbin. But a simple software tweak in the resource scanner orbiting the Mun and voila! We found Karbonite aplenty. The point, is that you need to widen your view, if you wish kermanity to flourish. Now, anymore questions or opinions?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe scientist sat down disgruntled. Another younger scientist raised his hand.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Sir, I am Linus Kerman the Third, geologist, Kerbin Research Institute. If this mineral that you speak of, this Karborundum, really exists somewhere in the solar system, how do you plan to prove it\u0027s existence? With the aid of our \u0027capable\u0027 and \u0027innovating\u0027 space program?\u0022 Linus\u0027 statement got a few chuckles, as the Kerbal Space Program was, gently speaking, quite mulchy at the moment.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EDr. Rover ignored the youngster\u0027s immature jibe.\u0022The truth will come out, sooner or later. I have complete faith that Karborundum will be found, if not by this generation, then the next.\u0022 Even though those were the words of a kid who was yet to see the world, they sure brought back some bad memories, from thirty years ago.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cu\u003EYear  233, Kerbal Institute of Social Studies\u003C/u\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EIt was the summer of Year 203, thirty years ago, the attempt to land a crewed vehicle on Duna by a private company failed catastrophically because of a damaged retro rocket. The new found spirit of exploration was dampened heavily. That was also the day when the Tech Tree was completed. It was concluded that the primary purpose of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E has been achieved and now it was time to implement all the knowledge to Kerbals\u0027 daily life. Budgets and careers were cut, subsequently and \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E became a jobs program, On this wretched day, heavy sighs from all over the planet caused the CO\u003Csub\u003E2\u003C/sub\u003E levels to jump about 2% higher than normal. \u0022The Agony of Duna\u0022, that\u0027s what they called it.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThat was the day I, Nanba Kerman was born.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAnd right now, I am being yelled at the headmaster of the school I am currently teaching at.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022You are fired.\u0022 The Headmaster\u0027s voice echoed in his office. No, it was more like a million headmasters speaking together, in perfect sync.\u003Cbr\u003E\n\u0022Come again?\u0022\u003Cbr\u003E\n\u0022You are fired! Launching soda bottle rockets with students when you are supposed to be teaching is unbecoming of someone in your profession!\u0022\u003Cbr\u003E\n\u0022I was trying to make the class more lively!!\u0022\u003Cbr\u003E\n\u0022Of course. And the fact that it hit the janitor square on the face was just a coincident, right?\u0022\u003Cbr\u003E\n\u0022Well he asked for it..I mean,Exactly! It was an accident! You believe me, right? So, about the job?\u0022 I was blabbering whatever came into my mind at that point.\u003Cbr\u003E\n\u0022You are still fired. You have 20 minutes to clear your locker.\u0022 He handed over a check. \u0022There\u0027s your severance pay. Now, please be thankful that I did not call the police and get out of here!!!\u0022 He finally erupted like a volcano of rage. I always like it when he does that, but not when I am on the receiving end.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E20 minutes later, I was standing at the school gates. The entire student body was by the gate, wishing me good bye. They said all sort of sweet stuff, like how  I was the teacher they had the most fun with and how I did not seem to know much about history. I could only look at them, tears in my eyes, and warned them not to follow my example of slamming the janitor in the face with a soda bottle rocket.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EWell, how the heck was I supposed to know about history anyways? I am a mechanical engineer, Kod Damn it!!!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI got home on a lonely bus ride. My mother was very happy to see me back. Father was his usual, grumpy self. I picked up the newspaper and started looking for jobs almost immediately.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cu\u003EThree weeks later\u003C/u\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI am still jobless. Its not like I am not qualified for jobs, its that I am \u003Cem\u003Eoverqualified\u003C/em\u003E for the most of them! The mood back home is tense. Even mother, who was happy to see me back after all these years is a little bit tense at dinner tonight. It even showed in my share of dessert! I was only served three mini-boongas, compared to mother\u0027s seven, and father\u0027s eight..\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Umm..I will start looking for more jobs tomorrow..so about the mini-boongas..\u0022 I was about to shamelessly grovel for a couple more of those sweet fruits when an advertisement flashed on television.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022We need young, fresh, vibrant Kerbs to be the new face of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E! Preferably Mechanical engineers, with some Organizational knowhow. Call this number to book a seat in the interview process!!\u0022 A toll free number flashed on the screen that I memorized automatically.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMy Kod, this was it! A real job, tailor made especially for me!! I looked down, and found two more mini-boongas in my dish. My mother was smiling, and my father appeared less grumpy.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI made that call, and then I made a face. I am not sure what sort of a face it was, whether I was happy or crying, but it was a face with maximum wrinkledness.\u003C/span\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-13T15:03:30Z\u0022 title=\u002210/13/2018 03:03  PM\u0022 data-short=\u00225 yr\u0022\u003EOctober 13, 2018\u003C/time\u003E by Sorabh\u003C/strong\u003E\n\u003Cbr\u003EUpdated Content list\n\u003C/span\u003E\n"},{"CreatedByName":"TanDeeJay","CreatedById":188578,"CreatedDateTime":"2018-07-24T23:15:29Z","Content":"\n\u003Cp\u003E\nGreat story. Can’t wait to read more \n\u003C/p\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-07-26T14:44:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421578\u0022 data-ipsquote-contentid=\u0022176923\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532474129\u0022 data-ipsquote-userid=\u0022188578\u0022 data-ipsquote-username=\u0022TanDeeJay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/25/2018 at 4:45 AM, TanDeeJay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGreat story. Can’t wait to read more \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks! I will try to update it weekly! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-07-29T15:34:14Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003E﻿The Mission, Controlled!!!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cu\u003EChapter 2: Trial by.... fire?\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cu\u003EThe day of the interview:\u003C/u\u003E\u003Cbr\u003E\nIt was the fated day! Today I would make or break my future. To say that I am nervous is like saying that Sir Jeb Kerman was only mildly happy when he landed on the Mun.\u003Cbr\u003E\nI had passed the written examination.It was time for the group discussion. They had us sit in a windowless room and then a voice told us what topic we were to discuss on. There were five groups, and each were given a particular topic to discuss on. I had expected a moderator, but there was no one to be found.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Good morning aspirants!I am your invigilator for this group discussion. Each of the five groups that you have been divided into will be given a specific topic to discuss about. All of you are being electroniaclly monitored, so make sure you give your best!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe mysterious voice then handed out our topics. My group, Group E got the topic \u0022What do you prefer: \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E of now, or the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E thirty years ago?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Good morning everyone, I am Justin Kerman, and I will take the pleasure of starting off this discussion.\u0022 A snooby looking kid snapped up the chance to speak first. Dang it!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022If we see the bigger picture, it is painfully obvious that the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E of today is mediocre at best, when compared to its state thirty years ago. Which is not a bad thing, if I may add. As it has been stated that all that could be invented, all that could be researched has already been done! We don\u0027t need anymore dangerous missions just to satisfy the \u0022curiousity\u0022 of a few kerbals.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Indeed, I partially agree with my friend here.\u0022 Another kerb, Luchas, I think, jumped into the conversation. \u0022The Agony of Duna was the most publicized and documented kerbal disaster. And it tells us what would happens when an arrogant kerb thinks he can take on the solar system for himself. We are living on this gigantic, living spaceship called Kerbin! And how much have we understood about the planet? Not much, that\u0027s for sure. Further research into outer space is unnecessary!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Of course. This is a huge solar system. Foolish are those Kerbs who think that kerbalkind was fated to explore it all! We should surrender ourselves to Kerbol, and be where it\u0027s light shines.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI was about to agree as well. But something seemed off, something basic, something instinctual. \u0022I would like to respectfully disagree.\u0022 I began.\u0022While the evidence suggests that mediocrity is the way to go, a species who once took pride in achieving new heights receeding into the dark? I, for one, can not accept this.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EJustin visibly rolled his eyes.\u0022Another one of the space junkies. I thought that your species went extinct thirty years ago!\u0022 Everyone had a nice little chuckle at my expense. \u0022What more do your kind want as a proof that your days are over? Were the deaths of twelve kerbals on a privately funded spacecraft on Duna not enough?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Things go wrong all the time. That does not mean we can all sit back and twiddle our thumbs and do nothing!\u0022 I retorted.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022And what guarantee is that the next krewed mission will be without flaws? That the next mission won\u0027t fail?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022There is no guarantee. Not at all. It is even possible to do nothing wrong and still fail our objectives. That\u0027s not the sign to stop. its a sign to buckle up, learn from the experience and keep moving forward.\u0022 I was slowly losing my patience with this guy.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Ohhh!! So you would dare walk into realms not blessed by the Glorious Kerbol?\u0022 The religious nut interfered.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Oi, the Glorious Kerbol has not blessed me for half my lifetime, during the nights. I am still alive. I think I will take my chances.\u0022 I could not help but snicker at my wisecrack. And then almost panicked as I realized that such verbal attacks are taken negatively by the invigilators.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Delusional thoughts are not productive at all. Like I mentioned earlier, we need to understand Kerbin better, not the space.\u0022 Luchas backed up the others.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022And limited thoughts are even less productive. Why should we be satisfied with only one \u0027spaceship\u0027, when dozens of other \u0027spaceships\u0027 are out there.\u0022 I pointed upwards.\u0022Just waiting to be claimed!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe discussion went for a long time, with me getting a nice clobbering from the rest of the kerbs in my group. However I did not relent and I was proud of that. Soon enough, time was up and we were all told to wait in the canteen and await the result.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI had a familiar feeling in my guts. That I messed up. I should have just gone with the flow. An hour passed and the results came in.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI passed. I passed?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EHuh, I guess luck is an important factor in these kind of situations...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E********\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EExactly 4 hours later, I entered into the interview room. The atmosphere in there was intimidating, to say the least. There were three scientist-y type kerbs, one of whom I recognized as Werhner Kerman II and... was that Mortimer Kerman?? The Accountant, El Contador??\u003Cbr\u003E\nFor those who don\u0027t know who Mortimer Kerman is, let me shed a little bit of light. He  is one of the \u0027Old Guard, the First Accountant and was the second-in-command when \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was at the peak of its popularity. He stayed at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E even though the other members of the \u0027Old Guard\u0027 including his (then) boss, Gene Kerman took voluntarily retirement, following the \u0027Agony of Duna\u0027. In several books and movies, he has been portrayed as a mean, cold and calculating personality, a perfect foil for the kind and gentle Gene Kerman .  In the movies, if he were smiling, then that meant he was going to do something BIG!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EHe was smiling right now. Oh I am such a goner!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ERegardless I smiled back. Or atleast tried to, I am sure it looked like a wince. The rest of the interviewers were trying to burn a hole in my head with their intimidating staring. Mortimer asked me to sit down.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAs soon as I sat down on the chair, something seemed out of place. The chair creaked a bit. It was slight, probably because of a loose screw.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Mr Nanba Kerman, I hope you had your lunch?\u0022 Wernher Kerman II took the initiative.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Yes sir, yes I did. Thank you.\u0022 I replied. And this chair was getting creakier by the second. My hand reached the spot where the screw securing the seat was supposed to be. It was loose! I knew it! I could not help it but try to tighten the loose screw, while keeping a straight face.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I will be asking a couple of serious questions ,Mr Kerman. This is a position of responsibility, so you better answer correctly.\u0022 Mr. Mortimer said, looking straight into my eyes. \u0022A dog, a monkey, and a squirrel are having breakfast.  What time is it?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0027Are you serious!!!!!\u0027 I almost screamed it out loud. \u0022I believe it\u0027s early morning, since they are having breakfast. I wake up early as well, since it makes me healthy,wealthy and wise.\u0022 Take that!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022cough*and unemployed*cough.\u0022  the younger scientist was not even trying to be subtle.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Relax Mr. Nanba, I threw that one in there just to break the ice.\u0022 Mortimer laughed my answer off. \u0022Now let\u0027s say,you a re sitting in your front yard and see a kob and kril across the street playing with their dog. The dog climbs into a wagon, and the kob pushes it down the hill.  The dog will be ok, the hill is not steep.  The kril starts yelling at the kob, the kob is yelling at the dog, and the dog is just waiting for the wagon to stop rolling. Which problem do you address first?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hmm..I think that the dog should be saved first. You see, even if the hill is not steep, the wagon will gradually speed up. And all it needs is a pebble in its path to overturn it, and injure the dog in the process. As for the Kob and the krill, they are just yelling. I will probably scold the kob for pushing the wagon, if anything.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EDr. Wernher Kerman II then took over the interview and after a round of technical questions related to rocketry and a few questions on organizational behavior, Mortimer stepped in again.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Describe, if you will, a previous management situation that you handled poorly, and then how you assessed it afterwards.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022In my last job, I launched a soda bottle rocket at the janitor. It was a harmless prank, as the janitor was not hurt in the slightest. I was only getting back at him for stealing all my Snacks everyday. I ended up losing my job because of that incident, despite the janitor being the first aggressor. I learnt an important lesson that day: If you are going to deal with someone, better do it without witnesses around. And do it quietly!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMr. Mortimer had this weird glint in his eyes, the kind of glint my Grandpa Jorfen has whenever he reminiscences about the glorious days of Air Force space program.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hmm, I see. And why do you care about space?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I..when I was a kid, I had this question: Why do we exist, and how? I still don\u0027t know the answer to the \u0027why\u0027 but this curiosity is what drives me. I also want to know, what\u0027s beyond the next hill, beyond the next forest, beyond the next celestial body... My fellow kerbs have called it childish but I can never let go of these thoughts.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Thank you, that will be all.\u0022 Wernher concluded the interview, and I got out of there as quick as I could, while being polite.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAnd 2 hours later, I was selected as the Director of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E Operations. Wait up! Director?This was an interview for choosing the Director? I was informed that it would be a PR related job when I applied for it!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E*******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cem\u003EAnd thus our protagonist becomes the new Director of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E Operations. What does it imply for the future? Will Nanba Kerman survive \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and its shenanigans? Or will he buckle under the mediocrity of the space center? Stay tuned to find out more!\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-08-12T12:50:35Z\u0022 title=\u002208/12/2018 12:50  PM\u0022 data-short=\u00225 yr\u0022\u003EAugust 12, 2018\u003C/time\u003E by Sorabh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-08-05T13:01:37Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003E﻿The Mission, Controlled!!!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cu\u003EChapter 3: The Administrontium\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI was standing in front of the administrative building of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, heaving my bags along. Apparently, I needed to \u0022stay\u0022 at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, since an emergency could pop up any moment and had to address the press and the media if the emergency was catastrophic. In other words, I am being paid for being a willing scapegoat for any failures that might occur.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe keyword being \u0027might\u0027. Operations in \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E have become so routine and reliable that  \u0022Employees sometimes wish for an explosion to spice up things.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ENot on my watch.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAlthough this brings me to the tall claims I made in the group discussion. To return Kerbal Space Center to its former glory, that was what I said. Now, I am not under any obligation to follow through my words at the group discussion, but deep within, it would feel wrong if I didn\u0027t.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAsk me to bring a vintage car to its former glory, I would do it before you even finish requesting. But to reorganize such a large organization, and removing the rot from each nook and cranny? I think I might just have bitten more than what I can chew.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EToday the IRIS-G Kerbin Observation Satellite will be launched. This will be the first of several IRIS-G satellites which would replace the ageing IRIS-F fleet. Also some students wanted to launch a KubeSat. \u0027To test new technologies for space travel\u0027 that\u0027s what they said. The fact that they could brag about it in international conferences remained unsaid.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe workhorse rocket of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, the Administrontium, launched from the launchpad with its payload, IRIS G-1 Kerbin Observation Satelite.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022VDjOfv9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/VDjOfv9.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAfter reaching burnout the sepratron motors ignited, and after a delay of a couple of seconds, the second stage engine started up.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022XoaFh6O.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/XoaFh6O.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022jymn3IN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/jymn3IN.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe second stage lifted the rocket to the required apoapsis of 100 km. After clearing 50kms, the fairings deployed, and the near exhausted second stage detached from the satellite. The solar panels, comms antenna, and the scanners deployed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022CDU1O76.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/CDU1O76.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAfter coasting to the apoapsis, the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E motors aboard the satellite circularised the orbit.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022ytBzrDo.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ytBzrDo.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EOnce the payload reached orbit, it released the small university KubeSat. The KubeSat deployed its solar panels and comms, and started doing stuff.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u00221sejxH8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/1sejxH8.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022bGsPHNY.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/bGsPHNY.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAfter a successful launch, the ground control retired for lunch, while I went back to my office. There were going to be reruns of \u0022The Dunatian\u0022 on WebFlix, and there\u0027s now way I am going to miss that classic.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EHalfway into the movie, an Email notification blipped on the screen. It was from a rookie intern. There was a sense of urgency in that email. An urgency similar to when you install a lot of mods in the game \u0022Human Space Program\u0022 and hope it won\u0027t crash on loading.\u003Cbr\u003E\nWhat was even odder was that it was not sent to my workplace mail address.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022MD0kNJQ.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022720\u0022 src=\u0022https://i.imgur.com/MD0kNJQ.jpg\u0022 width=\u0022960\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022P7HRVmw.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022720\u0022 src=\u0022https://i.imgur.com/P7HRVmw.jpg\u0022 width=\u0022960\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI looked at the attachments and the first thing I did was to fix a meeting with the engineers\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022This looks good, this looks very good!\u0022 I appreciated the 3D models of the Krewed space crafts that the young engineers were showing me. \u0022I am glad that the spirit of innovation still exists.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe intern, Kunfaya , looked embarrassed as she rubbed her cheek.\u0022Oh, it\u0027s nothing much, we just tried to extend the existing mk1 pod to fit another kerb. It would be much more better if we could build a 2-kerb spaceship, kinda like this one.\u0022 Her partner, Eddie, then showed me another design, this was a sightly larger, extended version of the mk1 cockpit. It could easily fit 2 kerbs inside, and felt like a decent upgrade from the first model.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022This is what we call the Mk-2 spacecraft. Like the previous one, we have planned an extension module, to house 4 more kerbals.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022While that\u0027s all fine and dandy, why are you showing me this? Work on krewed vehicles stopped 26 years ago.\u0022 I inquired.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Well, that might be so but... \u0022 Eddie hesitated a bit. \u0022We heard what you had to say in the group discussion.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022What?? How?? I mean, aren\u0027t the recordings supposed to be confidential?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Not to us! We borrowed the recordings and I must say, we were impressed. We thought that maybe, just maybe we could get this proposal through.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Well, sorry to disappoint you guys, but I don\u0027t have that kind of power, especially on the first day of the office.\u0022 I felt sorry for the younger intern, the way her enthusiasm faded.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022But, I can appeal to some of the more experienced workers here at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E! I am sure quite a few people will be enthusiastic about this.\u0022 I tried to reassure them, but I knew it was not a very good plan.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI returned to my office soon after, and opened up my laptop to make some additions to my mission report to the Magistrate and the Ministry of Space regarding the krewed flights. Midway through my report, I decided to take advice from someone more experienced than me.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI don\u0027t know what possessed me to call Mr. Mortimer though...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cem\u003EAnd thus Nanba oversaw his first mission, and got an interesting email by the end of the day. The gears in his mind are running at full speed. But what could he be thinking? And why does he want to take advice from Mortimer Kerman, El Contadore? Stay tuned to find out more!\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-08-12T12:50:15Z\u0022 title=\u002208/12/2018 12:50  PM\u0022 data-short=\u00225 yr\u0022\u003EAugust 12, 2018\u003C/time\u003E by Sorabh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-08-12T12:48:28Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003EThe Mission, Controlled!!!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cu\u003EChapter 4: The Herd Mentality\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAfter a quick talk over the phone, Mr. Mortimer invited me to a restaurant to talk more about this subject. It was an hour past lunch time, but I could manage.I put on a hat and dark sunglasses and entered the restaurant. Mr. Mort was already there, browsing the menu.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Oh, you are finally here! And what\u0027s with that disguise? Drop it. You look even more suspicious.\u0022 Mr. Mort remarked without even looking up from the menu.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I need to talk about more important matters than my disguise.\u0022 I said, removing the hat and showed him the blueprints of the krewed vehicles.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022pkr9Osq.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022634\u0022 src=\u0022https://i.imgur.com/pkr9Osq.jpg\u0022 width=\u0022796\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022DUtbZVN.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022647\u0022 src=\u0022https://i.imgur.com/DUtbZVN.jpg\u0022 width=\u0022815\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022So, what do you think? Can we make this work?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022If an engineer says it makes sense, I\u0027m sure we can find a way to afford such a craft- but why are you asking me?  What does Werhner Jr. say, and why does the government wish to send kerbs to orbit again?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Weeellll... I have not talked to any of them, in fact..\u0022 I replied sheepishly. \u0022It\u0027s just me and two other engineers, and now you, who are aware of this. All the officials I could have talked to have a negative attitude towards space exploration, and it\u0027s unlikely to change anytime soon. So I was wondering if we could force..er... convince them somehow to change their opinions..\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMortimer looked at me over the rims of his glasses, then sat back and crossed his arms. \u0022You do not, I take it, refer to simple lobbying.  What is your plan?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I was thinking about a way to generate hype among kerbs regarding space travel. If kerbs on ground want more satellites and probes in space, the government will, without a doubt, comply.\u0022 I spoke to Mortimer in a hushed tone. \u0022I am planning a covert space mission.It could be a flyby of bodies that we have not visited, and bodies that we can visit at frequent intervals.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Once we take science and imagery of an entirely new world, and \u0027leak\u0027 it to the public, kerbs will start taking notice, and that would be our chance! And didn\u0027t you have a share in a defunct company? What was it called? Kerbal R\u0026amp;D, yes! Maybe that would help?\u0022  I looked at Mr. Mortimer, hoping for a positive answer.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMortimer winced. \u0022Please, do not remind me where my retirement funds are sunk.\u0022  He sighed. \u0022Yes, \u003Cem\u003EKeRDy\u003C/em\u003E could certainly do what you ask, they have plenty of untapped resources at this point.  However, I am concerned with your objective.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Conducting flight operations outside of your existing mandate is perilous, whatever the objective.  Governments tend to prefer their assets conduct themselves within expected bounds.  Your end goal has fine merit, but wouldn\u0027t it be a better idea to try to influence the government to extend their directive first, rather than spend assets off the books in the hopes that everything will work out in the end?\u0022 Mr. Mortimer looked genuinely concerned.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022First of all, it\u0027s about visibility, Mr. Mort... Lobbying by space advocates has been going on for about 2 decades, with no real results. And there won\u0027t be any, as long as the common Kerbs are not involved in this process. If people see those images, then perhaps they will see that space is not just for educated, intelligent snobs. Herd mentality of the Kerbs will do the rest for us.Softer approaches haven\u0027t worked, maybe something more radical will? And if anyone finds out about what\u0027s going on behind the scenes, then I will be the fall guy.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Secondly,\u003Cem\u003E KeRDy\u003C/em\u003E promised to upgrade part performance in exchange of science. But the startup failed because there were no more exploration missions, and thus no more science to be gained. Without a demonstration, no one trusted \u003Cem\u003EKeRDy\u003C/em\u003E\u0027s claims and the startup failed. Well, here\u0027s your chance to get back your retirement funds, at the least. If the government is not swayed by the emotions of kerbs, then perhaps profit can convince them.\u0022 I put up a satisfied smile as I recited the speech I had rehearsed thrice.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMort strummed slowly strummed his fingers.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Fine.  You\u0027ll need to back-channel all your orders and conversations, I\u0027ll provide a secure line for you to someone there.  Your engineering team will need to pass me the bills, keep it to under 20% of operating costs and there will be no problems there.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I don\u0027t think you realize what you\u0027re doing yet, but- here\u0027s to Glory Days,\u0022 and Mort raised his glass.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022To the glory days!\u0022 We toasted and after a while of idle chit chat, left the restaurant.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E*******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMy inbox was flooded the next day. Turns out that after the successful test flight of the Tiny University KubeSat, every institute in Kerbin wanted a KubeSat of its own in Kerbin Orbit. The manufacturer of the Kubesat sold those in spades, making a huge profit. And now they wanted a launch vehicle. Herd Mentality. Now someone pick up that phone because I called it!!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe Administrontium-Lite was readied. It had the same first stage as the Standard Administrontium, but the upper stage was for lighter payloads.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022aYf1rG6.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/aYf1rG6.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe launch went almost nominally, with the booster placing the payload in equatorial \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022r9YLWoK.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/r9YLWoK.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022J5mtdD8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/J5mtdD8.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022CnsBVag.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/CnsBVag.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe only hiccup was when the software dumped the fairings way beforehand, exposing the payload to high temperatures.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u00227QDoPv1.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/7QDoPv1.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ENone of the KubeSats were harmed, however. That\u0027s good.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E Now it was the time for the most important part of the mission. The R\u0026amp;D department had hobbled up a makeshift KubeSat Dispensor.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022GHxwX71.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/GHxwX71.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe dispensing program initiated and the first batch of 4 kubesats separated from the payload container.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022yXyC8MS.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/yXyC8MS.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe second and the third batch followed suit.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022RNmNmE3.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/RNmNmE3.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022Qyw0Rtv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Qyw0Rtv.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe upperstage was then deorbited, bringing the mission to an end.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022jgfvXO2.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/jgfvXO2.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E*******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI spent the next few nights in my office researching and cataloguing every asset that \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E had at it\u0027s disposal. And which of those I could steal without making anyone look for them. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EWhile going through the archive, I stumbled upon a folder named \u0027DMagic equipments\u0027.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI stumbled upon a literal goldmine. There were science experiments that would no doubt accelerate my plan much faster than it would have been if I were using the \u0027stock\u0027 experiments. According to the data, all of it were in storage. I took a mental note to visit the storage warehouse and continued going through the inventory.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI started searching for SSTOs, for they will be ideal vehicles for launching my rogue space vehicles. They could take off from any runway without drawing much attention and launch the payload to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EBut to my disappointment, I discovered that all \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E designs were dismantled, and some were even burned by mobs!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThis was bad! While the probe could be assembled without drawing attention, the same could not be said about the launch.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ENow all I could do was to wait for an opportunity.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E*******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ENanba gets an \u0027Okay\u0027 from old Mortimer, but has hit a roadblock in his preparations. Would he be successful in getting over the issues and getting ahead in his dangerous plan? Or will he chicken out when he sees no solution in sight? Stay tuned t find out more!\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-08-12T12:48:54Z\u0022 title=\u002208/12/2018 12:48  PM\u0022 data-short=\u00225 yr\u0022\u003EAugust 12, 2018\u003C/time\u003E by Sorabh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2018-08-16T00:57:17Z","Content":"\n\u003Cp\u003E\nThat is a *smart* little launcher!  ...and I have a completely unbiased opinion of course. \u003Cspan\u003E:]\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-09-02T06:26:06Z","Content":"\n\u003Cp\u003E\n(A/N: Hello everyone! I apologize for the 2 week delay for this chapter, but the last week was a slogfest! I barely had time to double-click on the KSP icon on my desktop. I will release the next chapter sooner to make up for this. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003EThe Mission, Controlled!!!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cu\u003EChapter 5: Cleaning the Pipes\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EA few days later, \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E received a shipment from the Air Force. These were the surpulous missile motors which saw little use these days, and ended up taking storage space.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAnd by Kod those were lots of motors, in different shapes and sizes!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe little ones were the GEM motors. These most often saw use in land to land application over short distances and were Armed Forces\u0027 favorite because of its high thrust and range.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe bigger motor was actually designed by \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E as a \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E to assist rocket launches, but soon they fell out of favour. The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E started favoring liquid engines, which were less prone to blow up their warehouses. The Armed Forces grabbed hold of these motors and developed them into IRBMs.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAnd now, after all these years, they were being returned to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, with the permission to do with them whatever the heck we want to.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EPlans were made for launching an experimental small sat launcher \u0022Piddi\u0022. The plan required 4 GEM motors to be strapped together as the first stage and an improvised \u0027Spark\u0027 upper stage. These were not that cost effective, but no one cared about cost, these were practically free!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022M2JSEE2.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/M2JSEE2.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThese rockets got the job done, i.e. place a solitary Kubesat into orbit.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220MzBg5x.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/0MzBg5x.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WcAkRls.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/WcAkRls.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227Cva0xQ.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/7Cva0xQ.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rKAXtOu.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/rKAXtOu.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThey had their own limitations, though; they could only be launched in the mornings, as they had very little electric charge storage capability. After 8 more launches of the \u0022Piddi\u0022, we still had several boosters left, but no more KubeSats to boost into orbit. It was then when inspiration struck me.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E------A Few hours after the final KubeSat launch----\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hello Gentlekerbs! As all of you know, we have a logistics issue. There are too many motors left, and they are occupying storage space. And we all remember what happened last when we had so many SRBs stacked together.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Yes we remember, these motors need to be expended, and quickly! We never had any good luck with solids anyways.\u0022 Werhner Jr. spoke up, with murmurs of agreement from everyone else.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I have this proposal.\u0022 I showed them the blueprints of a new launch vehicle concept.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hmm, this might work.\u0022 Werhner Jr. said, peering into the blueprints of the launch vehicle. \u0022This could be a good use of those boosters. But we have exhausted all of our Kubesat payloads, and there are no government payloads either.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I doubt the government will let us launch a satellite on a fresh, untested launch vehicle. Lets just launch a dummy payload into orbit and call it a day.\u0022 I suggested.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Sure, works for me. Whatever gets out those SRBs outta my territory!\u0022 Werhner adjusted his glasses. Then we all broke up for lunch.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe rocket was finally completed, and the \u0027dummy\u0027 payload was integrated to it.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CJWTw1o.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/CJWTw1o.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Ugh, its ugly!\u0022 an engineer cringed when he looked at the rocket.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Yup, it is. But it is important as well. Get back to your posts!\u0022 I hushed him. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Well, OK, but what should we call it? Absurdium?\u0022 Linus the Third whispered.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hmm, yeah sure. Its not like this rocket will be a regular launch vehicle for us.\u0022 I went through the checklist for one final time \u003C/span\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E,\u0022 Command, give me a systems check.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Comms Go.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022GNC Go.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022FIDO Go.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022GUIDANCE Go.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u00223,2,1.. Booster ignition, and LIFTOFF!!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223KCrx4S.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/3KCrx4S.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe absurd rocket lunged into the atmosphere with a very high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E as all the solid motors fired at once. Soon it disappeared into the night sky, leaving behind a gigantic trail of fire and smoke.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MvN2t7H.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/MvN2t7H.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cWuLI9b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/cWuLI9b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ESoon enough, the motors exhausted themselves and detached from the rocket allowing the second stage to fire. This was the Administrontium\u0027s second stage. It worked as smooth as butter, and soon the fairing gave away.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022b6xNuGz.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/b6xNuGz.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MzaGwEn.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/MzaGwEn.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe dummy payload, was no dummy at all! This was the MOho FLyby Object or The MOFLO!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAfter setting into a nice steady orbit, the ground crew dispersed for lunch. A few, who had figured out that the payload was not an inert one, stayed behind.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Mr. Director, are we doing what we think we are doing?\u0022 One of the interns asked me nervously.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Yes, yes we are.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Where is it heading to? The Mun?\u0022 Werhner Jr. asked.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022No, its heading to someplace nothing and no one has been to before.\u0022 I replied.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Just so you know, we have no part in this! We wont be held accountable if this turns out to be a disaster!\u0022 an engineer shouted.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI calmed them down. \u0022If anything goes astray, I will take the axe, don\u0027t worry about it. Now, lets plot the trajectory to Moho!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMoho being Moho, offered an almost immediate launch window albeit an expensive one.\u003C/span\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe engines on the little probe fired and soon it became the fastest Kerbal made object ever made.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002255T6Aow.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/55T6Aow.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMinor course corrections were made and then everyone retired for the day.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ENow, all my crew and I could do was to wait for the Moho Intercept. And of course, the summons from the Ministry of Space.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cem\u003EAnd thus in one launch, Nanba violated all the rules that the previous Directors had followed until their retirement. How will all of this play out? Will the Ministry of Space take action against him and the engineers who made the probe?\u003C/em\u003E \u003Cem\u003EStay tuned to find out!\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-09-11T04:41:21Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EThe Mission, Controlled!!!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cu\u003EChapter 6: Old-timer Mortimer!\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EIt was early morning when the summon from the Ministry of Space eventually arrived. I wont bore anyone with the details, but the letter boiled down to \u0022Explain yourself.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EI contacted Kunfaya and other members of my crew if they had received similar summons. They answered in negative, thankfully. I dressed up in the most professional clothes that I could find, and took a deep breath as I headed out to the Ministry of Space HQ. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EAs soon as I walked into the HQ, two guards surrounded me.They led me to a courtroom. It was nicely furnished, completely out of place with the rest of the building. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EIt was houseful! No surprises there, a newly appointed, fresh outta Kompton \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E director flouted rules that could incriminate him, maybe send him to jail. What concerned me the most was that Mr. Mortimer wasn\u0027t there. Has he ditched me? Maybe, maybe not \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EI need to keep my faith. I pledged upon the Sacred Book of the Supreme Authority that I would speak the truth, and only the truth sat down on the defendant table. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThere were no lawyers to represent me. This was clearly a sham trial. These guys were not in the mood to let me walk out of this courtroom as a free kerb. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Mr. Nanba Kerman, you are faced with allegations of, let\u0027s see, privateering a launch vehicle, improper use of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E resources, launching of unauthorized payloads and blasphemy. Do you plead guilty?\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Of course, I plead not guilty. But the bigger question here is: Where are my lawyers? And this was supposed to be a Disciplinary Committee hearing, not a full out trial!\u0022 Mr. Mortimer was nowhere to be seen, and I was getting nervous. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Oh, our lawyers seem to be on leave.\u0022 The rest if the jury chuckled. \u0022All of them had a major case of flu!\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Well then, I guess I will have to fight for myself. And you did not answer my question. How did a disciplinary committee hearing turned into a trial?\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022WE will be the ones asking the questions, Mr, Nanba.” The Justicar sneered. “Now coming back to the case, could you please elaborate how you refuse to acknowledge the allegations against you, that have been confirmed by 8 witnesses?\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EHuh, 8? There were 12 kerbs in the control room who knew what was happening. If I got out of this in one piece, the first thing I am going to do is identify those 8 ra*****s. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022I.. I did everything that was mentioned, but...\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022So you agree that you violated rules! This makes our case much simpler. Now without further ado, this court, taking into consideration all witness and evidences...\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThe courtroom doors were opened by a very pale, quivering bailiff, to reveal a white-suit-and tie Mortimer standing outside the door.  He had a level gaze burned onto the bailiff, but after that further moment he cast his gaze upon the courtroom, and removing his hat walked right up to the judge\u0027s table.  The Ministry Justicar who was present to rule opened his eyes in shock. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022What are you- ?!\u0022 was all he could say before the elderly Mortimer began his reply. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Having ASKED me to speak, I hereby invoke the right of Peerage, and being a landholder of the old Empire who was permitted to retain my titles and privileges in exchange for my support of the new Authority, I will now speak my Piece to my Peace.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThe Justicar stared slack-jawed.  85% of the room had no clue what Mortimer was talking about, but the Justicar was one of the ones that did.  He closed his mouth and inwardly sighed- he had been called down for a simple disciplinary hearing and termination, and now his morning had just gotten well out of hand. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EHe was supposed to nod and gesture at this point he recalled, but instead he simply sat back and folded his arms with a just slightly indignant huff.  That was enough for Mortimer though, and he took the floor. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022My Fine, Revered, and Esteemed Space Program Management and Ministers.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Today you have dragged poor Nanba here to the dock with the intent of restoring your feeble grasp on the perils and risks of the use of space and to re-shackle the hopes of Kerbalkind to the very soils they live in.  No, space was too hard in the past, and loss and tragedy brought and end to flow of funding which supported so many jobs needed only for graft, legacy wealth, and greed.  Far better to be in complete control, eliminate risk as far as possible, and keep the minimized gravy train flowing.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022I could here speak about the Abysmal Failure of the Ministry to uphold Kerbal values.  I could speak about the utter ignorance of the Protocols of Jool, fore-most of which is to \u003C/span\u003E\u003Ci\u003E\u003Cspan style=\u0022font-family:Calibri;font-style:italic;\u0022\u003Ecommit no act which stifles the mind of another.\u003C/span\u003E\u003C/i\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E  I could here speak about the Ministry\u0027s willingness to Run a Kerb up the River to protect its existence, ... but I will not.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Instead I will explain to you why this Court is a mockery of everything it pretends to represent.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Nanba Kerman was hired not too long ago to be a Manager.  Therefore his objective and accepted responsibility was to uphold the post for which he was hired.  Seeing the deplorable state to which the once-lauded \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E had fallen to, he took the steps he felt were responsibly needed to restore the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to an institution that upheld the highest values of Kerbalkind.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Were regulations violated?  You could say yes.  You could also say, \u003C/span\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-style:italic;\u0022\u003Eif it was possible for a fledgling manager to circumvent the rules without an obvious violation then the rules put in place before his arrival were grossly lacking in management principle!  This is a symptom of institutional failure and not a violation of operational conduct!!\u0022\u003C/span\u003E \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EMortimer bored a hole in the board one by one, and none would withstand his gaze. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EHe relaxed his vicious visage, and slowly offered the frightening smile that had terrified so many in his shadowy past as a younger kerb. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Besides, he was actually upholding the exact conditions upon which he was hired.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EMortimer opened the briefcase which he had placed on the table next to Nanba, and took out a sheet of paper. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022When an entire institution is bereft of direction, is it not the responsibility of its manager to take charge of the needed change when so given that directive?  ...my good Justicar, would you please take this- Nanba\u0027s contract - and read the final line that is written above his signature?\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThe Justicar took the paper hesitantly, restored his glasses to his nose, and looked down.  Drawing air to speak his breath caught, and then he read out, \u0022...and other duties as required.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EMortimer gazed about the room as an eagle eyeing its prey. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022Look in the mirror you asses, and you\u0027ll see Nanba did \u003C/span\u003E\u003Cb\u003E\u003Cspan style=\u0022font-family:Calibri;font-weight:bold;\u0022\u003Eonly\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E that.\u0022 \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EMortimer paused a moment more, daring anyone to challenge him, then collected his briefcase and turned his back on the board. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E\u0022After you Nanba,\u0022 and he would not move until Nanba began preceding him down the aisle. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E*****\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EI just sat there, unmoving, just like the rest of the Jury. What was Mortimer even on about? I took his cue and left the courtroom. Mortimer followed me closely.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EOnce we were out of the room, I could no longer keep in the excitement.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E“Holy Mulch, Mortimer!!! What the heck even happened back there?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E“Language! And yes, you must be confused right now, but it’s alright. Only a few of us old kerbs REALLY know what I was talking about. Nevertheless, you are out of hot waters, I am sure. The Magistrate has a good head on his shoulder. For now, just focus on your duties as the director and extract some good data from the Moho Flyby mission.” And just like that, Mr. Mortime\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003Er headed back into his car without any further ceremony.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EI headed to my office. Now that Mr. Mortimer had my back, I could do whatever I could! Maybe that’s an exaggeration, but I surely can rub salt on the Justicar\u0027s burns by sending a couple of relays to the Mun!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E*****\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThe Relay Satellites were not that difficult to find. These were proposed a long time ago to allow for missions on the dark side of the Mun. The engineers 3D printed these satellites and soon, these were loaded up on a rocket. \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E(\u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003ESpeaking of which, I should probably uprate the Administrontium. It’s been the same rocket for the last couple of chapters. Clearly, ripping off a popular author’s rocket naming scheme did not do a lot for me!\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E)\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThe satellites were ready, and loaded up on an upgraded Administrontium rocket\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E \u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E(\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003Ewith \u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003Eextra tank\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003Es\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E and \u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003Eengines\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E). \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u0022UiD0M40.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/UiD0M40.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThose look like strapon boosters, but they aren\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003E’t. Those tanks are mechanically fowled to the central tank\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThe rocket took off, and without a lot of fanfare got into a comfortable 85x85 km \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u00228zbeJWT.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/8zbeJWT.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u00226XTPi8H.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/6XTPi8H.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u0022hHAe2Sr.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/hHAe2Sr.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u0022UxHlEP0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/UxHlEP0.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EOnce we aligned with the Mun,the second stage engine fired again. The third stage engine completed the burn after the second stage exhausted itself.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u00227v0BUnu.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/7v0BUnu.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u0022FkGwXSX.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/FkGwXSX.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThere was some minor course correction, and after a day,(?) the Relay Satellite Carrier reached the Munar periapsis.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThe goal was to put these relay satellites in a resonant orbit. Using a calculation tool  the mathematicians at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E had already planned how to do so.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThere were 4 relay sats that we had to deploy in a 135 x 135 km resonant orbit . For that, we needed to inject the Carrier craft in an orbit which had an orbital period of exactly 1.25 times the orbital period of the target orbit.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u00228PAyr41.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/8PAyr41.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EOnce such an orbit was established, a relay would be released by the carrier craft at the periapsis. Using its own propulsion, the relay circularized its orbit.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u0022cQbnkF7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/cQbnkF7.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u0022ASqYC2e.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ASqYC2e.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAll four relays were deployed from the carrier craft every time it hit the periapsis and the above procedures were repeated.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u0022TtQLb0m.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/TtQLb0m.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u00229K6NKDu.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/9K6NKDu.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u00222x7BaVt.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/2x7BaVt.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EOnce all four relays were deployed, the carrier craft engaged its scientific payload and then made a plane change maneuver to a polar orbit. It would now passively study the Mun and gather surface data which could be useful for ‘eventual’ Mun landings.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cimg alt=\u00224p8nvdg.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/4p8nvdg.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Times New Roman\u0027;\u0022\u003EThose were a long couple of days! Now, time to hit the bed and watch WebFlix!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E******\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cem\u003ENanba Kerman got into hot waters, and got out of it as well, thanks to a fierce defense by Mortimer . Now that the ball is in the Ministry\u0027s court, what will it do? Allow Nanba to undertake scientific missions? Or will it maintain it\u0027s stand and discipline Nanba anyway? Stay tuned to find out more!\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-14T12:01:27Z\u0022 title=\u002210/14/2018 12:01  PM\u0022 data-short=\u00225 yr\u0022\u003EOctober 14, 2018\u003C/time\u003E by Sorabh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2018-09-12T19:30:58Z","Content":"\n\u003Cp\u003E\nThat is a Gorgeous shot with the fully deployed vehicle over Kerbin.  Bravo!  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-09-13T03:23:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223450101\u0022 data-ipsquote-contentid=\u0022176923\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221536780658\u0022 data-ipsquote-userid=\u0022146403\u0022 data-ipsquote-username=\u0022GarrisonChisholm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, GarrisonChisholm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat is a Gorgeous shot with the fully deployed vehicle over Kerbin.  Bravo!  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks! And I see you now have four dots...... I also want four dots...I am jealous.. \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-10-13T15:02:27Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003EThe Mission, Controlled!!!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cu\u003EChapter 7: The Moho Mystique!\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EMy cellphone started blaring his new favourite ringtone, a cacaphony for everyone else, but music to my ears. It was from the assistant to the Magistrate.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hello, Nanba Kerman here.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hello Director, the Magistrate has agreed to allow scientific launches to other celestial bodies. But for now, keep the mission focussed on the inner planets.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Eve and Duna will be easier to reach, but will take a long time to do so. Moho has much quicker launch windows, but it\u0027s very difficult to get into its orbit.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I will leave those decisions upto you. And please keep launch costs minimal. Every science launch must be reviewed by an external financial advisor. He/ She will have the power to veto any launch, but within the realms of reason. I will send more details to you over the kmail.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Yeah sure. But we need to talk more on this subject, I don\u0027t like the government intruding in \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u0027s business in such a blatant manner. And Mortimer won\u0027t like it, of that I am sure.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe assistant to the Magistrate let out a sigh, \u0022Ah yes, Mortimer...that kerb...I will need to tell him all about his new \u0027charge\u0027.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Yeah, you have fun doing that.\u0022 I let a malevolent smile creep onto my face as I disconnected the cellphone. It was not all that I asked for, but atleast it was a start.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EA soon as I put down the phone, it started blaring up again. This one was from the tracking station.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EApparently, the MOFLO reached it\u0027s target!!!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022Ek31QrW.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Ek31QrW.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EOh just look at that chunk of rock, its so beautiful!!!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022I8ggn9U.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/I8ggn9U.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe probe slipped past Moho at a very high velocity because of our non optimal Trans-Moho insertion burn. Luckily for us it was only a flyby. We gathered whatever science data that we could\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022wi125fK.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/wi125fK.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EBefore we could even blink, the flyby was over! We gained about 756.2 science from this mission.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ENow that the flyby was done, the mission planning for the Moho Orbiter went underway. While reaching Moho was not an issue, capturing into orbit was the biggest issue. Our simulations showed it might take upto 4000 m/s to capture in some unfavorable situation!!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe only way to do this, while not raising a stink from the authorities and a lot of red tape by using a VERY heavy rocket, would be to use electric engines.That will be a little difficult as well. Xenon extraction from Kerbin\u0027s atmosphere was banned by the government, as environmental pressure groups opposed \u0027draining rare Kerbal resources to the void.\u0027\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EOh, that Magistrate....He is trying to make my life difficult.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAs we seemed to run out of options, I was thinking of making subsequent Moho missions to be flybys. But then Kunfaya came to the rescue!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Sir, I have something to tell you, but promise you won\u0027t get upset!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022What is it Kunfaya?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Xenon mining is banned, but there\u0027s no legislation which prohibits argon mining.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Actually, they considered banning argon mining, but argon is rather plentiful in our atmosphere. Moreover, with the ban on electric engines, there were very less opportunities and motivation for scientists to innovate in argon electric propulsion. For they were afraid their inventions could end up in the trash cans just like the Xenon Engines\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Yes, true. But when I was in the Kerbal Institute of Improvised Technology, there was this kerbelle who was suspended on the grounds of \u0027illegal activities\u0027.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Oh? And you are telling me about her because...\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Because the illegal activities that she was involved in was the development and testing of electrical engines that used argon! The Dean was an Environmental Maniac and suspended her immediately.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Wha...argon engines?? Who is this kerbelle? What\u0027s her name?\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Triksha Kerman.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EIt was a desolate house in the middle of nowhere. Clearly designed for mobility, and an independent life support system too, from the looks of it. Clearly, the home of a fugitive.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EKunfaya and I knocked on the door, only to get a huge surprise.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ESomething hit me on the face, almost knocking me out. As I staggered and fell down on my knees, I heard a weapon cocking.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022None of you BARISes move. Not one inch. You are not taking me back, do you get it??\u0022 It was a Kerbelle\u0027s voice. But it felt heavy, as if she had endured more than what a kerbelle deserves to.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI raised my hand in a gesture to surrender. \u0022We mean no harm!\u0022 I managed to get a squeak out. Luckily for me, Kunfaya snapped out of shock,\u0022 Triksha, its me, Kunfaya! From KIIT! Remember me!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EA look of recognition flashed across Triksha\u0027s face as she lowered the weapon.\u0022 You were the one who topped the fourth semester, yes, I remember you.\u0022 Her voice was still steady, unwavering.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022We just came here to talk about a mutual problem. I am Nanba Kerman, Director of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, by the way.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hmmph..come on in then. But remember, one wrong move and I will turn you BARISes into a lead mine.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ESoon we were discussing the present scenario at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. The permission to launch science missions to other planets, difficulties regarding the Moho missions, I laid all my cards on the table.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022So now you need my Argon engines. Heh, the irony. I was incarcerated for those engines, and now the government needs my help.\u0022 She let out a dry laugh. \u0022Well, I will help you out. But I have my conditions. I want them fulfilled, every last one of them.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022 Triksha, we can not promise to fulfill each and everyone of your condition!\u0022 Kunfaya retorted.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Then I guess, its Good Night! Show yourself out.\u0022 The fugitive scientist got up from her seat and headed to the kitchen. \u0022Oh wait! I can lend you those engines if you grovel in front of me. It would be sooooo Cathartic to see \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E begging me for my tech!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI turned around, a weary smile on my face. \u0022I am a poor kerb, all I have is my knowledge and my pride. They are not for sale. Thank you for sparing your valuable time for us.\u0022 I waved a good bye and got out of the house, with Kunfaya following me.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022You still haven\u0027t heard my conditions yet, Mr. Director.\u0022 Triksha called out from behind us.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Hmmph, please feel free to elaborate.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I will be the sole supplier of these engines, no big corporations will be allowed to be the subcontractor, especially not the Ionic Symphonic Protonic Electronics!\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I am listening, please go on.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022Secondly, I want immunity from all the charges that have been wrongfully levied on me, and compensation for my incarceration.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u0022I will consult my financial advisor. You take care until then.\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAfter an extensive discussion with Mr. Mortimer, I finally got that pardon and monopoly for Triksha. Mr. Mortimer wasn\u0027t too happy about her getting a monopoly in the electric engine market, and neither was I. So, we included a very tiny clause in the legal document that the pardon and monopoly would be valid as long as she works for \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E only. The clause was written in a manner that would not be visible to Triksha. I doubt it would be visible, even to seasoned lawyers.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EIf she doesn\u0027t toe the line, then I would simply disassociate \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E from her company, and she would be in for a huuuuge shock!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EA few days later, Triksha signed the document, and it was validated by the Council. After acquiring one of her experimental engines and refining it even further, we decided to use it in the next Moho Orbiter. If all went all, we could even use the setup for sample return missions from the inner planets!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u002281wSQq8.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/81wSQq8.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe Moho Orbiter for Scientific Experiments (MOOSE) was launched from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E on a beautiful dawn.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022cJpXgy9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/cJpXgy9.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAscent into the clouds. This is so beautiful I will frame this and put it on display in my office!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022Aa9w3Km.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Aa9w3Km.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ESeparation of the strapon boosters.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022g26h5OO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/g26h5OO.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe core booster soon ran out of juice and was staged, followed by the second stage ignition.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022YinBCg2.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/YinBCg2.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe second stage completed the circularization burn and the probe was in 85X85km \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E orbit.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022LbBcojk.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/LbBcojk.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EWhat happens when the photographer tries to be overly artistic..... (Is there a real life rocket which deploys fairings like confetti??)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022edYNFXt.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/edYNFXt.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022Wtxb85F.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Wtxb85F.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe second stage had no juice left, so it was discarded and the TMI stage was activated.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022ztFnz5p.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ztFnz5p.jpg\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ETurns out we overestimated the amount of fuel needed, as a result we had a lot more delta-v in our insertion stage (about 2000 m/s!!)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022IPxmFxP.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/IPxmFxP.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAbout a 110 days later, the probe reached Moho, and BY KRAKEN WHAT IS THAT MIST???!!!!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u0022qucCLRw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/qucCLRw.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u002287U7XZg.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/87U7XZg.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ERegardless, the probe was inserted onto Moho orbit. 2 burns were used, the first involving the \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E stage, and the second involving the ion engines.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cimg alt=\u00221cjnIwM.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/1cjnIwM.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe probe was established in an elliptical polar orbit, from where it will keep on observing Moho and produce science.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E******\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThe next day, disaster struck! A Kerbin observing satellites collided with one of those small KubeSats. It was a one in a million chance, considering the fact that both satellites were inclined 90 degrees with respect to each other. What\u0027s more, there were no spares for that satellite yet!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EA decision was made: Those pesky KubeSats will have to go. A plan was formulated and a time limit of 60 days was imposed on each kubesat. Moreover, the Kubesats should have their own propulsion to deorbit, once the 60 day time limit was over.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EFor now, we had to repair the broken satellite, or deorbit it if repair proves to be impossible. Also, we had to deorbit all of the kubesats strewn around in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EBut for this, machines just won\u0027t cut it! It was concluded that krewed presence would be needed in order to fulfill this. We had the ability to transport Krew to orbit, and sufficient studies on this subject had been done a few decades ago. It wouldn\u0027t hurt to try!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EThus the mothballed design, Carryminati mk-1 was worked upon, and Cariminati mk-II was born.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E*﻿*****\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cem\u003EThus the first \u0027Proper\u0027 scientific mission was successful. What will this lead to? More probes across the solar system? Maybe, or maybe not, the future is uncertain. And what does the emergence of krewed missions signal? Stay tuned to find out more!﻿\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-13T15:05:01Z\u0022 title=\u002210/13/2018 03:05  PM\u0022 data-short=\u00225 yr\u0022\u003EOctober 13, 2018\u003C/time\u003E by Sorabh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sorabh","CreatedById":178257,"CreatedDateTime":"2018-10-25T15:28:08Z","Content":"\n\u003Cp\u003E\nTo all of my (2) loyal fans, I am sorry. But I am closing down this thread. Life is pretty mulchy at the moment. And I don\u0027t have the luxury of spending any time on KSP. This, obviously, means that no new content for this thread will be generated. That and the general lack of interest in this mission report has helped me made up my mind.\n\u003C/p\u003E\n\u003Cp\u003E\nI sincerely apologize to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/146403-garrisonchisholm/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022146403\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/146403-garrisonchisholm/\u0022 rel=\u0022\u0022\u003E@GarrisonChisholm\u003C/a\u003E as I had promised him that he would be a co-author in this mission report. Sadly I could not deliver on that promise, I am really sorry Mr. Garrisom.\n\u003C/p\u003E\n\u003Cp\u003E\nI am closing down this thread, and I have already made a request to the mods to do the same.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you for your love and support.\n\u003C/p\u003E\n\u003Cp\u003E\nSincerely,\n\u003C/p\u003E\n\u003Cp\u003E\nSorabh.\n\u003C/p\u003E\n\u003Cp\u003E\nPS: What happened, you ask?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tumblr_mykuihQmpF1s1s9y4o4_r1_250.gif\u0022 class=\u0022ipsImage\u0022 height=\u0022245\u0022 src=\u0022https://66.media.tumblr.com/60cb408c1293611e23aa7ec46541bd13/tumblr_mykuihQmpF1s1s9y4o4_r1_250.gif\u0022 width=\u0022245\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-25T15:39:57Z\u0022 title=\u002210/25/2018 03:39  PM\u0022 data-short=\u00225 yr\u0022\u003EOctober 25, 2018\u003C/time\u003E by Sorabh\u003C/strong\u003E\n\u003Cbr\u003Efound a gif matching the intensity of my situation in real life.\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-10-25T17:27:56Z","Content":"\n\u003Cp\u003E\nThread closed by \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u0027s request. \n\u003C/p\u003E\n"}]}