{"TopicId":178741,"ForumId":51,"TopicTitle":"Conquering Whirligig (Chapter 20 - Interplanetary Ballooning)","CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-05T04:44:32Z","PageNum":1,"Articles":[{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-05T04:44:33Z","Content":"\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);font-size:14px;text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cem\u003EConquering Whirligig\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);font-size:14px;text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cem\u003EEscape from Mesbin\u003C/em\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);font-size:14px;text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);font-size:14px;text-align:center;\u0022\u003E\n\u003Cimg alt=\u00229lh4b5s.png\u0022 src=\u0022https://i.imgur.com/9lh4b5s.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cem\u003ETwo centuries ago, explorers from the far off planet Kerbin left their home to colonize other star systems. Preliminary transit data suggested the third planet of Kaywell\u0027s star had an oxygen atmosphere and water. It did not.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:rgb(255,255,255);\u0022\u003E\n\u003Cem\u003EUnable to correct their course due to piloting error, the\u003Cspan style=\u0022color:rgb(53,60,65);font-size:14px;\u0022\u003E \u003C/span\u003EU.S.C. Manifest Destiny crashed into the massive, 70 Kerbin Mass planet Mesbin. Luckily, Mesbin spins. Once every hour and twenty minutes it spins, and the centripetal effect pushes the equator outwards and negates some of the gravity. The 5 gees of gravity at the poles is reduced to a tad over 1 gee at the equator.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cem\u003EThe payload of the ship survived, but the engines and fuel tanks were reduced to a lot of metal rubble along the surface. Unable to find somewhere else to go, they buried themselves underground and set up a stable ecosystem and environment down there. Eventually the colony was sufficiently industrialized to start looking up again.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cem\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=PGNiXGX2nLU\u0022 rel=\u0022external nofollow\u0022 style=\u0022background-color:transparent;color:#3d6594;\u0022\u003EWelcome to Mesbin\u003C/a\u003E. (It plays a bit like a more difficult \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/163109-13x-alien-space-programs-10-take-ksc-and-push-it-somewhere-else/\u0022 rel=\u0022\u0022 style=\u0022background-color:transparent;color:#3d6594;\u0022\u003ETylo Space Program\u003C/a\u003E, getting to and from orbit)\u003Cspan\u003E﻿\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n-\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/36077-gregroxmun/\u0026amp;do=hovercard\u0022 data-mentionid=\u002236077\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/36077-gregroxmun/\u0022 rel=\u0022\u0022\u003E@GregroxMun\u003C/a\u003E, creator of the Whirligig mod\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nWelcome. I should really stop starting stuff left and right... Don\u0027t expect this to go really far, it\u0027s just what I\u0027m interested in now, and I\u0027d like to share it with you! There will be minimal story, and quite possibly no character development, or dialogue even. For this one, I\u0027m going to try my hardest to stick to \u0022Mission report\u0022 instead of \u0022Giant story with a beautifully complicated and lengthy plot\u0022 as to not interfere with anything else.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nAs far as mods go, obviously I have GregroxMun\u0027s Whirligig system installed, as well as many other visual and informational mods, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E, but no parts mods. If anyone wants to suggest parts mods, then go ahead! Enjoy!\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nOne of the most interesting things about this playthrough, I think, is the difficulty of returning things to Mesbin, meaning anything launched (including Kerbals) is probably up there for good!\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n\u003Cstrong\u003EChapter 1 - Breaking Free\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nBeing underground sucked.\n\u003C/p\u003E\n\u003Cp\u003E\nSure, there were some actual excavated areas, but those were for the leaders and a few lucky others. The rest of the Kerbals lived in lava tubes, hastily pressurized, always leaking and sometimes caving in.\n\u003C/p\u003E\n\u003Cp\u003E\nThe food was terrible. Due to the lack of an atmosphere on Mesbin, and the distance to the sun, the Kerbals had to grow their food in the lava tubes, with sun-mimicking light bulbs powered mostly geothermally. These light bulbs were the ones that had survived the crash, and therefore were over 200 years old.\n\u003C/p\u003E\n\u003Cp\u003E\nThere were 500 Kerbals on Mesbin. Due to Kerbin\u0027s impending doom, several hundred colony ships had been sent out to various star systems, taking hundreds of years to get there. The \u003Cem\u003EManifest Destiny\u003C/em\u003E was one of the first to reach its destination. Unfortunately it crashed. What little supplies the Kerbals had were mostly from the wreckage of the ship. They were able to scavenge 5 years worth of supplies.\n\u003C/p\u003E\n\u003Cp\u003E\nThose 5 years were spent trying to set up a sustainable system, food, water, and air, and they succeeded, barely. In their off time, Kerbals tried to make metals from the surrounding resources.\n\u003C/p\u003E\n\u003Cp\u003E\nThere were several things the Kerbals needed to figure out if they were going to survive. They needed a way of extracting and processing metal. They needed the excess farming capacity for fabrics, and animals. Only a few animals were still alive, they had been kept to a minimal number for the past 5 years. They also needed to figure out how to manufacture electronics, their supply from the crashed ship was dwindling. The supply chain, at this point, was unable to make spacesuits, which meant that most Kerbals were helpless in the event of a total colony depressurization. There were less than 200 usable suits remaining.\n\u003C/p\u003E\n\u003Cp\u003E\nIn time, they figured that all out, but barely. And being underground sucked. Scratch that, being on Mesbin sucked.\n\u003C/p\u003E\n\u003Cp\u003E\nSo it was decided to search for more habitable worlds in the system, they were unfound, as nobody had been to the surface in forever, and nobody had thought to accurately scan the system.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo quote the captain from WALL-E, \u003Cstrong\u003E\u003Cu\u003E\u003Cem\u003E\u0022I don\u0027t want to survive. I want to live!\u0022\u003C/em\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo, let\u0027s go to space!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dXrwVvu.png\u0022 src=\u0022https://i.imgur.com/dXrwVvu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA space center was built resembling the old one, for nostalgia reasons. The first launch, Savior 1, was piloted by Jeb, and was a short hop to gather science, weighed down by extra boosters as to not exceed a dozen or so meters. He gathered enough science to unlock the stayputnik, which is lower in the tech tree in this version.\n\u003C/p\u003E\n\u003Cp\u003E\nSome things about Mesbin - it has 5g gravity at the poles, but only a bit above 1g at the equator because of rotation. Orbital velocity of Mesbin is a whopping \u003Cstrong\u003E\u003Cem\u003E8000\u003C/em\u003E\u003C/strong\u003E meters per second, but due to the rotation you already have 4500m/s so you only need 3.5 plus gravity losses (a lot) to get into orbit. According to the release thread 4500 is a good number to aim for. Fun fact, Mesbin has a higher low orbit velocity than Earth! Also the equator is at about 1500km above \u0022sea\u0022 level, and space is considered space at 1535km. And fully a vacuum.\n\u003C/p\u003E\n\u003Cp\u003E\nIt was for this reason we unlocked the stayputnik. Because it\u0027s really hard to return a Kerbal from orbit. We may try someday, but that requires a vehicle with 9-ish kilometers per second of high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E Delta-V. We\u0027re not going to send Kerbals on one way journeys until we find a world to send them to.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221Tmdp95.png\u0022 src=\u0022https://i.imgur.com/1Tmdp95.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext up was Savior 2, which tried to find out where space was, and was pretty overkill. Also, I don\u0027t have \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E. It will become annoying.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iUqpsMi.png\u0022 src=\u0022https://i.imgur.com/iUqpsMi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSpace found, it was time to get to orbit. For this, Savior 3 was launched, basically Savior 2 but with a sepratron upper stage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B4kKGnZ.png\u0022 src=\u0022https://i.imgur.com/B4kKGnZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDue to the lack of reaction wheels, it fired downwards, destroying the probe. A staging mishap destroyed Savior 4. But on Savior 5, everything went right...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bgaKD1w.png\u0022 src=\u0022https://i.imgur.com/bgaKD1w.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt this point, we noticed - \u0022Hey! Mesbin has moons! We should throw stuff at them!\u0022 And thus, more precious metal and precious electronic circuits were assembled to build the Hopper 1. Because we didn\u0027t actually have enough science to get the reaction wheels necessary to get to the moons yet, and we didn\u0027t want to send a Kerbal into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B1460eA.png\u0022 src=\u0022https://i.imgur.com/B1460eA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dXaAAnf.png\u0022 src=\u0022https://i.imgur.com/dXaAAnf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nValentina was briefly sent into space to get some science, and succeeded in a mostly vertical landing. Any landing you can walk away from...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022t493fgT.png\u0022 src=\u0022https://i.imgur.com/t493fgT.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMunar 1 was built, this time with a reaction wheel and an upgraded \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. Its goal was to investigate what had been dubbed Statmun, as it was (I think) in a stationary orbit and was static. Unfortunately it failed due to the fact that the circularization burn would have taken place out of comms range.\n\u003C/p\u003E\n\u003Cp\u003E\nMunar 2 was built, with much larger tanks and more boosters.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022o7LI6ip.png\u0022 src=\u0022https://i.imgur.com/o7LI6ip.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis also attempted to encounter Statmun. Unfortunately it failed for some reason or another, maybe the same issue. So a copy was built, Munar 3.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CJnecgC.png\u0022 src=\u0022https://i.imgur.com/CJnecgC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was the closest it got. Without \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E/\u003Cabbr title=\u0022Descending Node\u0022\u003EDN\u003C/abbr\u003E markings, patched conics, or \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, this is as close as we were able to get, and even then fuel was low.\n\u003C/p\u003E\n\u003Cp\u003E\nWe needed science to do anything else, really, and that was short to come by. Actually, I read that the mod doesn\u0027t have biomes except for a few, so science will likely be scarce the whole time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226WJsJBI.png\u0022 src=\u0022https://i.imgur.com/6WJsJBI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA copy was sent to the largest moon in the sky as visible from Mesbin. The probe was Munar 4, and the moon Graymun because it was the Gray Mun and resembled Kerbin\u0027s Mun. Science was barely returned. The probe was out of comms range at this point, so we had to cross our fingers that our orbit would take us within the range of a groundstation, which somehow exist despite the colony being tiny.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002201LJig3.png\u0022 src=\u0022https://i.imgur.com/01LJig3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately it crashed into the Mun, being out of comms range, so I couldn\u0027t save it. Not that it had the fuel... The Delta-V requirements for this system are pretty large.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022n41UJdV.png\u0022 src=\u0022https://i.imgur.com/n41UJdV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMunar 5 used the most advanced technology available at the time. Seven Trashcans were used for the initial boost so that the rocket could tip over (no atmosphere to clear, just mountains!) and 7 thumpers were the second stage. The third stage was an LV-T45 with several fuel tanks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226YuiuZ6.png\u0022 src=\u0022https://i.imgur.com/6YuiuZ6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe fourth stage was a single LV-T45 with three FL-T200 tanks and the probe itself. The decision was made to attempt an encounter with the third moon of Mesbin, which was far away and required almost 3km/s to reach from a low Mesbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Zt9LKTy.png\u0022 src=\u0022https://i.imgur.com/Zt9LKTy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd despite having a blind transfer, with no possibility of course corrections, the probe encountered the body and recorded its data. But it was flung onto a trajectory on which it would not be able to communicate with home. So we upgraded the tracking station and got the data.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QCVK9U2.png\u0022 src=\u0022https://i.imgur.com/QCVK9U2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Kerbin-like world with an atmosphere and oceans. They didn\u0027t know what the atmosphere was made of, or what the ocean was made of, but it was hope. More probes would have to be sent to evaluate this body - dubbed Kerbmun - for future Kerbal colonization.\n\u003C/p\u003E\n\u003Cp\u003E\nThe science from Munar 5 was enough to unlock a larger antenna and the LV-909 engine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022E9n7l3n.png\u0022 src=\u0022https://i.imgur.com/E9n7l3n.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Munar 9 required the biggest launch vehicle designed by the space program (which needed a name, you can suggest in a reply if you like). The first stage was 7 thumpers with 2 swivels for control authority. The second stage was 5 LV-T30 engines, and the fourth stage was four LV-909s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223dvATKq.png\u0022 src=\u0022https://i.imgur.com/3dvATKq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe final stage was one LV-909 with all of the science experiments. Hibernation was used extensively as solar panels had not been unlocked yet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ozDlD4y.png\u0022 src=\u0022https://i.imgur.com/ozDlD4y.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tX37wl8.png\u0022 src=\u0022https://i.imgur.com/tX37wl8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Munar 6 actually had more than enough fuel left to enter orbit. The limiter was electricity - we were unable to get goo from low space because of the remaining power levels. So, in one more experiment, Munar-6 was de-orbited onto Kerbmun to learn about its atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ag4t10F.png\u0022 src=\u0022https://i.imgur.com/ag4t10F.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YavuhL7.png\u0022 src=\u0022https://i.imgur.com/YavuhL7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd that concludes the first step of getting off of Mesbin!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-28T05:33:45Z\u0022 title=\u002212/28/2018 05:33  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 28, 2018\u003C/time\u003E by Ultimate Steve\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2018-10-05T05:53:24Z","Content":"\n\u003Cp\u003E\nWoot! Yet another cool series from \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E! I will follow this.\n\u003C/p\u003E\n\u003Cp\u003E\n(by the way, the images took nigh on five minutes to load. Imagine what it’ll be like when this is the length of Intrepid \u003Cspan\u003E\u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon2.png\u0022 title=\u0022:o\u0022\u003E)\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-10-05T06:46:57Z","Content":"\n\u003Cp\u003E\nVery cool \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E! I will be following! Also, as for a name for the launcher maybe Gravity, or Hydrogen.\n\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2018-10-05T12:47:53Z","Content":"\n\u003Cp\u003E\nYou know it\u0027s funny, you got a fair bit of the actual W.I.P lore correct. (Including the bit shamelessly plagiarized from the WW \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\u003C/abbr\u003E)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Hey do you want to play with a wip prerelease of the next version of the mod?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-05T13:17:38Z\u0022 title=\u002210/05/2018 01:17  PM\u0022 data-short=\u00225 yr\u0022\u003EOctober 5, 2018\u003C/time\u003E by GregroxMun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-05T15:22:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223462623\u0022 data-ipsquote-contentid=\u0022178741\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221538743673\u0022 data-ipsquote-userid=\u002236077\u0022 data-ipsquote-username=\u0022GregroxMun\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, GregroxMun said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou know it\u0027s funny, you got a fair bit of the actual W.I.P lore correct. (Including the bit shamelessly plagiarized from the WW \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\u003C/abbr\u003E)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E  \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Hey do you want to play with a wip prerelease of the next version of the mod?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI probably should have asked first, but I did try to make it evident that that section is yours. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe loose storyline was extrapolated pretty much entirely from those 4 paragraphs, so I didn\u0027t expect it to be fully correct, nor did I need it to be. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAs far as the prerelease goes,\u003C/span\u003E would it break active flight? And what all has been added? EDIT: How stable is it?\n\u003C/p\u003E\n\u003Cp\u003E\nLoving the mod so far, although I\u0027ve only done one more mission than what I\u0027ve reported above!\n\u003C/p\u003E\n\u003Cp\u003E\nAnother edit: Once I\u0027ve done more I can help write science report texts if you want help with that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-05T15:24:14Z\u0022 title=\u002210/05/2018 03:24  PM\u0022 data-short=\u00225 yr\u0022\u003EOctober 5, 2018\u003C/time\u003E by Ultimate Steve\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"roboslacker","CreatedById":175473,"CreatedDateTime":"2018-10-05T15:48:44Z","Content":"\n\u003Cp\u003E\nIs Timberwind still on?\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-05T19:27:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223462676\u0022 data-ipsquote-contentid=\u0022178741\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221538754524\u0022 data-ipsquote-userid=\u0022175473\u0022 data-ipsquote-username=\u0022roboslacker\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, roboslacker said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs Timberwind still on?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes. I tend to bounce between things fairly quickly. Timberwind\u0027s playstyle is different from Whirligig\u0027s playstyle, is different from Intrepid\u0027s playstyle, is different from Voyage\u0027s playstyle. I\u0027ll work on whatever I feel like working on, generally.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-05T22:56:16Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 2 - No Return\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSo! Kerbmun has oceans and an atmosphere. Let\u0027s see what it\u0027s like!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tp571zy.png\u0022 src=\u0022https://i.imgur.com/tp571zy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is Dipper 1, launching on this launch vehicle which does not have a name as it is a cluster of low tier parts. Its mission was to soft land on Kerbmun and measure atmospheric pressure and temperature.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VygLtQc.png\u0022 src=\u0022https://i.imgur.com/VygLtQc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch went off without a hitch. One problem was discovered during atmospheric entry, and that was that the antennas like to snap off, but we brought two, so we\u0027re fine!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Od4PVZL.png\u0022 src=\u0022https://i.imgur.com/Od4PVZL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFrom here, Mesbin\u0027s oblateness can be properly observed. Also we unlocked the OKTO, which has basic \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E capabilities.\n\u003C/p\u003E\n\u003Cp\u003E\nWe unlocked a bunch of stuff with this science, so we built a near identical probe with landing legs and sent it to Graymun, managing to grab two relevant contracts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m0eS6C2.png\u0022 src=\u0022https://i.imgur.com/m0eS6C2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eMFs6iW.png\u0022 src=\u0022https://i.imgur.com/eMFs6iW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was Dipper 2, which had excess fuel to land. A note about the Mesbin system, it\u0027s about 4.5km/s to low orbit, and 3km/s to transfer to Kerbmun. It\u0027s 1.5-ish to transfer to Graymun and another 1 to capture, approximately. This system does not like Delta-V.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kRWPIog.png\u0022 src=\u0022https://i.imgur.com/kRWPIog.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landing was successful, although the legs were a tad short. Much more was learned from this probe. It had enough fuel left over, so it was put into an orbit of Graymun in order to act as a relay. A planetwide relay system is being considered.\n\u003C/p\u003E\n\u003Cp\u003E\nDipper 3 was an exact copy of Dipper 2, but this time we sent it to Statmun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229yWmv8h.png\u0022 src=\u0022https://i.imgur.com/9yWmv8h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vtmSeyY.png\u0022 src=\u0022https://i.imgur.com/vtmSeyY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhich is bumpy and possibly radioactive, according to the description.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yU15zMh.png\u0022 src=\u0022https://i.imgur.com/yU15zMh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI am most likely the first person \u003Cem\u003Eever\u003C/em\u003E to go to Statmun\u0027s north pole.\n\u003C/p\u003E\n\u003Cp\u003E\nThe final probe in the series, Dipper 4, was IIRC identical to Dipper 1, maybe with a few minor changes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qzdY8WW.png\u0022 src=\u0022https://i.imgur.com/qzdY8WW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIts mission was to fly by Derbin, which was the world that shared a barycenter with Mesbin. Antenna power was at its lowest about 50% due to the tracking station being level 2. It was determined that Mesbin is not a nice place. It is still unknown what the atmosphere is made of, but it\u0027s probably not good.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J5mNwJG.png\u0022 src=\u0022https://i.imgur.com/J5mNwJG.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt had just enough fuel to do a really fast flyby of its moon, which was named Derminmus for its minmus-like patches. After that, the periapsis was lowered into Derbin\u0027s atmosphere in an attempt to land.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wCshoMm.png\u0022 src=\u0022https://i.imgur.com/wCshoMm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022siM74SP.png\u0022 src=\u0022https://i.imgur.com/siM74SP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnly the heat shield and 2 parachutes survived entry, neither survived the impact. This atmosphere is pretty harsh. The flames started immediately, there wasn\u0027t even time to transmit  most of the atmospheric data.\n\u003C/p\u003E\n\u003Cp\u003E\nWe will have to do more with probes to investigate the five worlds we explored today. A plane is being considered for Kerbmun to test if the atmosphere contains oxygen. BTW Kerbmun h as 0.6ATM at sea level, so it should be livable, if the temperature is decent (I forgot the temperature reading) and if the atmosphere is oxygen. Good news for the evacuation.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next choice was a very controversial choice. The Kerbals needed to figure out of they could sustain life in space with the limited supply chain available. They had extensively tested this technology on the ground, but the only way to make sure it worked was to test it in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m7jt44l.png\u0022 src=\u0022https://i.imgur.com/m7jt44l.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUsing new technology, a space station was launched into a 1800km orbit of Mesbin (it sounds high but the surface is at around 1500km already). It was called \u0022Treehouse station.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m never going to get used to designing lifters without nose cones, fairings, and fins...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022G4pE3ns.png\u0022 src=\u0022https://i.imgur.com/G4pE3ns.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe first stage was a skipper with the equivalent of one orange tank (I\u0027m still going to call it that even though it\u0027s not always orange any more) coupled with two large SRBs. The second stage was a poodle, and the station had four sparks for maneuvering.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EyIW34s.png\u0022 src=\u0022https://i.imgur.com/EyIW34s.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter it was shown that everything was in working order... The controversial bit began. A crew of two had to be sent to the station. Some people opposed it, some people volunteered just to get off of Mesbin. The two candidates required were a pilot and an engineer, who were randomly selected from the list of volunteers.\n\u003C/p\u003E\n\u003Cp\u003E\nThe controversial part is that there was no provision for a return trip. They would be stuck up there for good until we either moved them to a habitable planet or developed the technology and had reason for a return lander. So these two were not going to see any other Kerbals for quite some time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Z7x0UqL.png\u0022 src=\u0022https://i.imgur.com/Z7x0UqL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was the Fearless 1, caryring Johnbo and Maddrin, who both had a high courage stat and were randomly selected. The rocket was angled for greater efficiency upon liftoff, although the gravity bent it a little bit. They said extensive goodbyes, stocked up on luxury snack items, and boarded the rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oEe836L.png\u0022 src=\u0022https://i.imgur.com/oEe836L.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022q73Hrjs.png\u0022 src=\u0022https://i.imgur.com/q73Hrjs.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Mf5IAt0.png\u0022 src=\u0022https://i.imgur.com/Mf5IAt0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then they arrived at their new home, home for who knows how long... They will have many experiments to perform, especially with the newly developed Kerbal Attachment System. They have the supplies to last a year ish (I won\u0027t be enforcing this for the sake of progression) and will need a resupply mission at some point. There are a few plans floating around to launch a refueler or even a dedicated transfer spaceship so they can explore Statmun or Graymun while they are up there.\n\u003C/p\u003E\n\u003Cp\u003E\nBut for now, they\u0027re there to stay.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd that concludes the second step of getting off of Mesbin!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI think that\u0027s the first time I\u0027ve sent a Kerbal into orbit with no way of returning on purpose. I know it\u0027s part of the goal, to evacuate Mesbin, but at the same time I can\u0027t help but feel a tad bit guilty.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-05T22:57:15Z\u0022 title=\u002210/05/2018 10:57  PM\u0022 data-short=\u00225 yr\u0022\u003EOctober 5, 2018\u003C/time\u003E by Ultimate Steve\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-10-06T03:54:45Z","Content":"\n\u003Cp\u003E\nWow, looks great \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E! May I add that you forgot to update the title?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd: \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223462897\u0022 data-ipsquote-contentid=\u0022178741\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221538780176\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...who\u003Cspan\u003E﻿\u003C/span\u003E both had a hi\u003Cspan\u003E﻿\u003C/span\u003Egh courage s\u003Cspan\u003E﻿tat...\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd presumably a high stupidity stat too. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-10-06T04:19:13Z","Content":"\n\u003Cp\u003E\nI see \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E has changed the title! Thank you! Also, I’m going to try playing Whirlwig world!\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-06T17:47:56Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 3 - Sending People Places\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSo, continuing with the theme of Kerbmun, the next thing to do should be to find out if it has an oxygen atmosphere. The only way we have to do that right now is using jets.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/dEpAM4b.png\u0022 alt=\u0022dEpAM4b.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is the Liberation 1 Lifter, our most powerful yet, and pretty much all of it is necessary to get its payload off to where it\u0027s going - 4.5km/s to orbit, 3.3km/s for the transfer, 1.3km/s for the capture, and as much as possible for the de-orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/i8ww9JO.png\u0022 alt=\u0022i8ww9JO.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA thing about EngineLight... It tends to illuminate the planet below. Anyway, due to lack of a more powerful engine, a skipper and 4 swivels power each Liberation core. Two SRBs are also there for added oomph. Asparagus staging is used here.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/jJJwtwM.png\u0022 alt=\u0022jJJwtwM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe poodle stage is enough to get it to orbit and begin the transfer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/M0bdquL.png\u0022 alt=\u0022M0bdquL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe three LV-909 cores are needed to complete the transfer. The middle one has some fuel left.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/fUrO2Fp.png\u0022 alt=\u0022fUrO2Fp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe vehicle entered orbit with some margin, which is good news. So we picked a landing site, de-orbited, and re-orbited the lower stage which was designed to function as a relay, as the plane only had a wimpy antenna.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Z60gDac.png\u0022 alt=\u0022Z60gDac.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, we drifted out of communication range, so the only controls we could really use were stage, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, Z, and X. Re-entry happened quickly and at least one intake exploded along with the science equipment.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/1cdhxWp.png\u0022 alt=\u00221cdhxWp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd Kerbmun Plane 1 crashed into Kerbmun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/jAiuvFU.png\u0022 alt=\u0022jAiuvFU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately I didn\u0027t get a chance to test the jets, so the oxygen levels are still inconclusive.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/wY0Chpr.png\u0022 alt=\u0022wY0Chpr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLuckily, the other half of the mission was successful. The relay entered a perfect 500km orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/5MLRpxU.png\u0022 alt=\u00225MLRpxU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe next mission was almost identical, save for a reaction wheel, doubling SRBs, and a few other improvements.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/MIb6HM4.png\u0022 alt=\u0022MIb6HM4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, as it turned out, if Kerbmun had oxygen in its atmosphere, it was not enough to run the basic jet engines. The jets did not ignite at all. Sad face. \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis posed a big problem for the space program. They had been hyping Kerbmun a Kerbalkind\u0027s next home, and were planning on sending the two Kerbals in low orbit to Kerbmun after it was viable. There was still hope... Maybe there was enough to run a larger jet engine with many intakes? Probably not, though. A spectrometer will have to be sent to further analyze the atmosphere... If it has even a hint of oxygen, it\u0027s still a better place than Mesbin, at the very least we can extract oxygen from the air.\n\u003C/p\u003E\n\u003Cp\u003E\nOxygen can also be extracted from the rocks on Mesbin, which is why nobody has suffocated, but unfortunately it is a very energy intensive process. (insert explanation for why oxidizer is still cheap here)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/NuHACXV.png\u0022 alt=\u0022NuHACXV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext up, also on a Liberation 1, was an expansion for treehouse station, a very important one.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/RPRz20y.png\u0022 alt=\u0022RPRz20y.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt doubled actual living space, and provided a lander designed for Statmun and Greymun. The crew\u0027s first task? Use the massive amount of fuel left in the stage 2 tank and go to Statmun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/jRjZNlX.png\u0022 alt=\u0022jRjZNlX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/j2KtNT8.png\u0022 alt=\u0022j2KtNT8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLanding was straightforward. But Texture Replacer Replaced doesn\u0027t like me right now so the visors are hot pink. (insert plausible explanation)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/DSW07Ah.png\u0022 alt=\u0022DSW07Ah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne of the crewmembers even visited the older Munar probe, which still had a lot of fuel left. However, as there was no scientist in orbit, they couldn\u0027t get the science from the probe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/pmjf8Ug.png\u0022 alt=\u0022pmjf8Ug.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHe also went to the north pole, as it was not 300 meters away from the probe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/AwiWDzi.png\u0022 alt=\u0022AwiWDzi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBy transferring some fuel around, it was found that they could keep the bottom stage attached and still have enough fuel to return, a big plus, as they would need this fuel margin to explore Graymun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/rUQvwyZ.png\u0022 alt=\u0022rUQvwyZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then they were back at their home away from home, back to fixing various subsystems and paving the way for the evacuation.\n\u003C/p\u003E\n\u003Cp\u003E\nAt this point we had a surface sample worth about 60 science points sitting up there, pointless to transmit... So a test was conducted.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/oXN7KqP.png\u0022 alt=\u0022oXN7KqP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLaunching on a Liberation variant, with only one core and 2 SRBs, was the Sample Return Capsule 1. Returning things to Mesbin was thought to be extremely impractical, but if the stuff being returned was extremely light, then maybe there was a chance.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/BUb7BGD.png\u0022 alt=\u0022BUb7BGD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe surface sample was transferred, and the descent began.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/SKTRdVm.png\u0022 alt=\u0022SKTRdVm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/fXTWBA0.png\u0022 alt=\u0022fXTWBA0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/5SwCKE1.png\u0022 alt=\u00225SwCKE1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe impact was a bit rough, but the sample survived! Someone just had to drive halfway across the planet to get it...\n\u003C/p\u003E\n\u003Cp\u003E\nNext up, a mission to Graymun. It was decided that since sample return technology had been tested, that science experiments and a scientist to work them must be sent.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/dYLFUp3.png\u0022 alt=\u0022dYLFUp3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFearless 2 launched, piloted by Pilot Crisfrey, and Scienced by Scientist Shelemy. It reached Treehouse Station successfully. There were now 496 Kerbals remaining on the planet Mesbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/HdreYnA.png\u0022 alt=\u0022HdreYnA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext, on another Liberation variant, was the Graymun Science Lander, with a seat for 1.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/UrvvCMj.png\u0022 alt=\u0022UrvvCMj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUpon reaching Treehouse station, many things were juggled.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/jUPvwLR.png\u0022 alt=\u0022jUPvwLR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUsing the fuel from the transfer stage to replenish an older transfer stage, the mission began.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/c06GrGB.png\u0022 alt=\u0022c06GrGB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTransfer to Graymun is surprisingly expensive, 1.5km/s just to get into a transfer orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/BV4C2kj.png\u0022 alt=\u0022BV4C2kj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe lander was actually a tad overbuilt, though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/U5KH2aW.png\u0022 alt=\u0022U5KH2aW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShelemy hopped around for a bit. Science was done. But unfortunately I forgot a picture of him on the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/vYOI2bB.png\u0022 alt=\u0022vYOI2bB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, take a look at this... Fuel margin was extremely tight. I got down into monopropellant to complete the final docking. This mission was almost a failure!\n\u003C/p\u003E\n\u003Cp\u003E\nNow, to return the samples!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/nRTqe3S.png\u0022 alt=\u0022nRTqe3S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/tq1Wtmh.png\u0022 alt=\u0022tq1Wtmh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/sJwDgaE.png\u0022 alt=\u0022sJwDgaE.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd this time, all of the samples were returned safely, and the lander intact with quite a fuel margin left over... Could this be the beginnings of a crew descent vehicle?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Xamgzvx.png\u0022 alt=\u0022Xamgzvx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext up, with all that new technology we unlocked, it was decided to attempt a manned mission to Kerbmun. However, due to the insane Delta-V requirements of getting there, many different launches had to be used. This was the prototype ascent vehicle, launching on a Liberation 2 lifter.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/H0AZBiF.png\u0022 alt=\u0022H0AZBiF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe five cores were asparagus.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/cxQjpOD.png\u0022 alt=\u0022cxQjpOD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe second stage was an \u0022orange\u0022 tank and a poodle.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Ez92DoJ.png\u0022 alt=\u0022Ez92DoJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe third stage was a half-jumbo and a poodle... Aerobraking needed to be used to get into a low orbit even though we used the largest lifter available.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/9D7gXIj.png\u0022 alt=\u00229D7gXIj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt went in for a landing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/SrjnDn0.png\u0022 alt=\u0022SrjnDn0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd did so successfully!\n\u003C/p\u003E\n\u003Cp\u003E\nHowever I built it for a 2.5km/s ascent, and Kerbmun looks like a 3-3.5km/s ascent... And it has no ladders... So back to the drawing board on that one!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStep 3 complete!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2018-10-06T18:07:40Z","Content":"\n\u003Cp\u003E\nShame about Kerbmun. Maybe it has oxygen, but not quite enough for jet engines.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is really great though, keep it up!\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-10-06T18:59:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223463294\u0022 data-ipsquote-contentid=\u0022178741\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221538849260\u0022 data-ipsquote-userid=\u0022183830\u0022 data-ipsquote-username=\u0022RealKerbal3x\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n50 minutes ago, RealKerbal3x said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nShame about Kerbmun. Maybe it has oxygen, but not quite enough for jet engines.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is really great though, keep it up!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree about Kerbmun.\n\u003C/p\u003E\n\u003Cp\u003E\nKeep up the great work \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E!\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-07T02:41:23Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 4 - Whirligig does not like Delta-V\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nDespite the disappointment that there was not enough oxygen to run jets (if any at all) the Kerbals still wanted to send detailed scientific instruments to find out. But, the spectrometer was still a bit up the tech tree. So, their only option was to send a crew.\n\u003C/p\u003E\n\u003Cp\u003E\nThis would require a lot of ships, a lot of patience, a lot of metal (money), and a lot, a LOT of Delta-V. As I said before, 4.5 to LMO, 3.3 to TKmI, and another 1 to LKmO, approximately. 0.5 more accounting for plane changes and such. To low orbit of Kerbmun it\u0027s about 9km/s, just short of the Delta-V required to get into LEO in real life.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that\u0027s there! You can use aerobraking to shave off most of the circularization burn and most of the landing, but it\u0027s 3.5 back to orbit, 1 back to a transfer trajectory, and 3.3 plus a plane change to LMO. We\u0027re stopping at LMO because of the whole no returns thing.\n\u003C/p\u003E\n\u003Cp\u003E\nAdd that all up, and you have roughly \u003Cstrong\u003E17.5km/s of Delta-V.\u003C/strong\u003E The Apollo missions used 9 for LEO, 3 for TLI, 1 for orbit insertion, 4 for landing and ascent, and 1 for back home, roughly, netting somewhere around \u003Cstrong\u003E18km/s.\u003C/strong\u003E This means that what I am attempting to do is on par with the Delta-V requirements for doing an Apollo mission... With the bad mass ratios of the stock parts. Curse you, Mesbin.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat could go wrong?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/GSOsdD8.png\u0022 alt=\u0022GSOsdD8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFirst off, the Kerbals launched a 3 core version of the Liberation 2 lifter to launch another probe to Derbin because we got a lucrative contract to land there...\n\u003C/p\u003E\n\u003Cp\u003E\nHow exactly would contracts work in a system where there are only 500 people on the planet? Actually, only 496 now? Maybe if we substitute \u0022funds\u0022 for \u0022scrap metal and oxygen.\u0022 Apparently one of the guys who controls a lot of metal is interested in Derbin.\n\u003C/p\u003E\n\u003Cp\u003E\nFor those who have forgotten, Derbin is binary with Mesbin. Derbin is still huge, a bit larger than Eve, but not as huge as Mesbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/CvjpeH3.png\u0022 alt=\u0022CvjpeH3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe entry went well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/xqAdkiI.png\u0022 alt=\u0022xqAdkiI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/MIeSiEs.png\u0022 alt=\u0022MIeSiEs.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nResults cannot be transmitted, however, because someone forgot a long range antenna because I forgot I didn\u0027t have a relay around Derbin yet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/q4jJaoY.png\u0022 alt=\u0022q4jJaoY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere we go! Much better!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/p1WY3ZJ.png\u0022 alt=\u0022p1WY3ZJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs it turns out, Derbin is pretty hot, pretty stuffy, and pretty heavy. 2g, 7atm, 350k (177f) at the surface if I remember right.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m most likely not sending a manned mission to Derbin. It\u0027s looking like it will be Eve but 3x as hard. Maybe if I get one of those airship mods...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/OGB51dm.png\u0022 alt=\u0022OGB51dm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGood news! We have enough science to unlock long ladders now! Jeb is shown here testing the Mk2 lander\u0027s ladder system. It will hopefully have enough fuel to ascend this time. We think. Hopefully.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/TgqWnHH.png\u0022 alt=\u0022TgqWnHH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLaunch was successful.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/VNy1N4N.png\u0022 alt=\u0022VNy1N4N.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe fuel margin was so low we had to aerobrake for this part. Stuff almost exploded.\n\u003C/p\u003E\n\u003Cp\u003E\nFor continuity\u0027s sake we tried landing near the earlier ascent vehicle.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/ONWa3MU.png\u0022 alt=\u0022ONWa3MU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m never going to get used to seeing Mesbin in the sky like that, it\u0027s just so unnatural. So, if we evacuated to Kerbmun, we wouldn\u0027t see beautiful Kerbmun in the night sky, we\u0027d see ugly Mesbin... Hopefully there is another planet out there with a better atmosphere and a better view.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/LPX7Wg6.png\u0022 alt=\u0022LPX7Wg6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut, the landing legs exploded due to forgetting to fire the engines at the last moment.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/1gKmxHQ.png\u0022 alt=\u00221gKmxHQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd the probe core\u0027s service bay broke off. So there aren\u0027t batteries. But everything important to the actual ascent still seems to be intact, so we\u0027re going with it.\n\u003C/p\u003E\n\u003Cp\u003E\nAt this point a manned expedition became top priority instead of back seat. So, what exactly would we need for a manned mission?\n\u003C/p\u003E\n\u003Cp\u003E\nWe\u0027d need an ascent vehicle (check), relays (spotty, but check), a return vehicle, a descent vehicle, a rover (landings are inaccurate), science experiments, and a small base. The crew would be 3 Kerbals, probably a pilot, engineer, and scientist, as that was all the ascent vehicle could carry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/OMsoV7v.png\u0022 alt=\u0022OMsoV7v.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShown here, Jeb, Bill, and Bob test the first version of the rover. Probably due to a weird code, the wheels loved to break due to the 5g gravity even though only 1 was felt. For the final version, there were way more wheels, a rear ladder, a probe core, some plane wheels in case the default ones broke, and parachutes for landing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/uGr0MJF.png\u0022 alt=\u0022uGr0MJF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was discovered that the space center floated several meters above the surface for some reason.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/DCmoTq9.png\u0022 alt=\u0022DCmoTq9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe final version launched on another Liberation 2 derivative.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/cRbhxa1.png\u0022 alt=\u0022cRbhxa1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis time the lower stage was disposed of instead of made into a relay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/w2uhAcX.png\u0022 alt=\u0022w2uhAcX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was discovered that you could sort of glide the rover, and it \u0022flew\u0022 to within 15km of the ascent vehicle... Not bad. Of course that means I\u0027ll have to drive at least 15km at 10m/s... 1500 seconds. 25 minutes. Let\u0027s hope it\u0027s stable at x4 warp! Although due to the airplane wheels I can go downhill faster than uphill, so maybe it will be less.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rover promptly touched down in front of a patch of grass.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/LN4CddA.png\u0022 alt=\u0022LN4CddA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWait, what? Grass? GRASS? LIFE! LIIIIIIIFFFFFEEEEEEE OOOOOOOONNNNNNNNN KKKKKKEEEEEEERRRRRRRRRRBBBBBBBBBBBMMMMMMMUUUUUUUUUUUUUUUUUUUUUUNNNNNNNN!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\u003C/p\u003E\n\u003Cp\u003E\nThis came as a massive shock to the mission planners, they had not anticipated life being a thing on Kerbmun! It seemed to be close to the common forms of grass found on Kerbin! Further analysis was necessary, but another problem - the things that had gone to Kerbmun had not been sterilized... Ah, whatever, who cares about planetary protection! There\u0027s only 500 Kerbals in this entire star system, not enough for there to be a planetary protection officer... Or much of a government.\n\u003C/p\u003E\n\u003Cp\u003E\nIf this was close to Kerbin grass, that meant there had to be carbon dioxide in the atmosphere, and it had to be producing at least some oxygen... But that was only if it was the same type of life.\n\u003C/p\u003E\n\u003Cp\u003E\nFurther analysis was necessary, we\u0027ve decided to add a science lab to the base.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/rkuESsW.png\u0022 alt=\u0022rkuESsW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUpon jettisoning the parachutes, two solar panels were broken. Sorry, grass!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe rarely used \u0022GREAT ANTENNA OF AWESOMENESS\u0022 was then used to tell the other 1000s of colony ships about their discovery of alien life. The nearest ship would take a few years to respond, but still.\n\u003C/p\u003E\n\u003Cp\u003E\nSo far only 8 colony ships had actually heard that the Manifest Destiny had crashed, and responses had only been received from 2.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/rApuuLl.png\u0022 alt=\u0022rApuuLl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext up were the science experiments, which were delivered on a partially proven platform - a modified plane, but with rocket engines.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/wE4svvp.png\u0022 alt=\u0022wE4svvp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAAA LOOK OUT ITS THE GIANT OVAL IN THE SKYYYYY!!!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/uvJTMWe.png\u0022 alt=\u0022uvJTMWe.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSometimes, spaceflight is as boring as watching grass grow. Sometimes it\u0027s as exciting as watching grass grow.\n\u003C/p\u003E\n\u003Cp\u003E\nOh, hey, we\u0027re out of money. Another wealthy Mesbiner is willing to give us a lot of metal to set up a station around Statmun, presumably to help look for radioactive isotopes there, because they are hard to find on Mesbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/gWcqZAu.png\u0022 alt=\u0022gWcqZAu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe\u0027ve got some cash now!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/VhLn1fW.png\u0022 alt=\u0022VhLn1fW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is the launch of the base.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/5bekoz7.png\u0022 alt=\u00225bekoz7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/4P8wffP.png\u0022 alt=\u00224P8wffP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landing was cushioned by twelve partially filled sepratrons. The job was done almost perfectly, but they were triggered just a bit too late and the base bounced a few centimeters into the air.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/D4cmN1H.png\u0022 alt=\u0022D4cmN1H.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/DaclADU.png\u0022 alt=\u0022DaclADU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso, on the top was a detachable 1.5-ish ton pod with a bunch of \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E supplies for experiments.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Fp8kuEh.png\u0022 alt=\u0022Fp8kuEh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnly two launches remained for the manned mission to Kerbmun - the descent/return vehicle and the crew. Since the descent/return vehicle doesn\u0027t have an exposed docking report to conserve mass (and due to bad design) the crew was launched first, on Fearless 3.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/C0lKd7S.png\u0022 alt=\u0022C0lKd7S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew was pilot Calny and engineer Sido, both guys. I\u0027ve been getting pretty good at direct rendezvouses from Mesbin, the crew made it to Treehouse station in just a little over 20 minutes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/rR6dj42.png\u0022 alt=\u0022rR6dj42.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt this point, the actual descent/return vehicle would be launched. Buuuuut we\u0027re out of money again, so the station will have 6 for a bit longer than scheduled.\n\u003C/p\u003E\n\u003Cp\u003E\nLuckily, we have a very substantial contract (700k funds) from another rich miner guy who wanted to send some of his personal belongings to the orbit of Kerbmun. The fact that these personal belongings look just like a science bay and a mystery goo can is completely a coincidence.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/om0Zso5.png\u0022 alt=\u0022om0Zso5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe were also able to add a relay antenna, because 3 sats is better than two!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Rsjh0ZL.png\u0022 alt=\u0022Rsjh0ZL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt looks oddly like a potato from here.\n\u003C/p\u003E\n\u003Cp\u003E\nSo due to that and a science contract, we now have 1.1 million funds to play with. I\u0027ve come to realize that money will be the hard part, not science... There are tourism, rescue, and explore contracts that are all insanely impractical to complete because most of them require a return. This means that my source of money is pretty much halved, and it takes way more funds to get places than in vanilla...\n\u003C/p\u003E\n\u003Cp\u003E\nBut, hey! We can afford the ship now!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/KE2QDNx.png\u0022 alt=\u0022KE2QDNx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStep 4 complete!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-10-07T05:31:45Z","Content":"\n\u003Cp\u003E\nWoohoo! 1.1 \u003Cem\u003Emillion \u003C/em\u003Efunds! That’s a lot! I just recently achieved my first Mesbin orbit!\n\u003C/p\u003E\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-07T05:33:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223463603\u0022 data-ipsquote-contentid=\u0022178741\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221538890305\u0022 data-ipsquote-userid=\u0022154159\u0022 data-ipsquote-username=\u0022Kerbalstar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Kerbalstar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWoohoo! 1.1 \u003Cem\u003Emillion \u003C/em\u003Efunds! That’s a lot! I just recently achieved my first Mesbin orbit!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo need to mention me, I\u0027m following the thread. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003Cspan\u003E Congrats on the orbit!\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-10-07T05:34:59Z","Content":"\n\u003Cp\u003E\nAh, I was wondering who closely you were following it. I follow mine with an email every time new content is posted. Thanks! I have an idea for a story... With different mythology then the standard Mesbin mythology...\n\u003C/p\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2018-10-07T10:05:03Z","Content":"\n\u003Cp\u003E\nGRASSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS! 1.1 MILLION FUNDS!\n\u003C/p\u003E\n\u003Cp\u003E\nSorry. Do you ever plan to build a Mesbin descent vehicle? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-07T10:05:18Z\u0022 title=\u002210/07/2018 10:05  AM\u0022 data-short=\u00225 yr\u0022\u003EOctober 7, 2018\u003C/time\u003E by RealKerbal3x\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-07T17:42:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223463691\u0022 data-ipsquote-contentid=\u0022178741\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221538906703\u0022 data-ipsquote-userid=\u0022183830\u0022 data-ipsquote-username=\u0022RealKerbal3x\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, RealKerbal3x said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGRASSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS! 1.1 MILLION FUNDS!\n\u003C/p\u003E\n\u003Cp\u003E\nSorry. Do you ever plan to build a Mesbin descent vehicle? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, I have for the sample return pods. I was vaguely considering using an EVA seat or two instead of the sample container, as that could actually work, but then I remembered I haven\u0027t unlocked EVA seats yet!\n\u003C/p\u003E\n\u003Cp\u003E\nBut, Whirligig 0.5 just got released and stuff has been changed... Mesbin is smaller and rotates even faster (every half hour!) and Statmun has doubled in size... I have no idea what these changes will mean for Delta-V requirements, but I\u0027m going to try installing it... Hopefully it won\u0027t break active missions! Ch.5 coming soon.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-07T18:24:49Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 5 - WE ARE THE ALIENS\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/sZtNFEY.png\u0022 alt=\u0022sZtNFEY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVirtuoso - a person highly skilled in music or another artistic pursuit. Also what we decided to name this absolute monster of a cluster rocket, which will hopefully take three Kerbals to Kerbmun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/hwB5w9U.png\u0022 alt=\u0022hwB5w9U.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Liberation 3 lifter was powered by 12 SRBs and 4 twin boars on the first stage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/eKu5pZn.png\u0022 alt=\u0022eKu5pZn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe second stage was five skippers.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/V4zdFaV.png\u0022 alt=\u0022V4zdFaV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFour of them fed their fuel to the central one and detached... The central skipper was just enough to get the ship into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/iy4iXHy.png\u0022 alt=\u0022iy4iXHy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe poodle stage had to be used just a little bit for the rendezvous with Treehouse Station. At this point, a crew was selected. It was decided that we\u0027d need our most experienced crewmembers on this mission, so the four that had been up there for quite some time were chosen - Johnbo (pilot), Maddrin (Engineer), Shelemy (Scientist), and Crisfrey (Orbital module pilot).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/xCFNLfV.png\u0022 alt=\u0022xCFNLfV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/ONj9xiW.png\u0022 alt=\u0022ONj9xiW.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll four outer tanks were depleted during the transfer, and there was also a plane change burn. This led to lower than expected fuel levels at Kerbmun, so some aerobraking had to be used.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/YhsDHsR.png\u0022 alt=\u0022YhsDHsR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd Crisfrey said goodbye to the landing team, who boarded the Virtuoso\u0027s descent module. They would be the first Kerbals in this entire system to land somewhere using parachutes. After several quickloads, a proper accurate descent trajectory was realized using what little propellant was in the poodle stage of the Virtuoso.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/kyq2FfX.png\u0022 alt=\u0022kyq2FfX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe return module immediately burned back into an orbit to avoid being incinerated. Crisfrey would now wait for their return assuming all went well... She had a substantial amount of supplies.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/q1ubWPz.png\u0022 alt=\u0022q1ubWPz.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/2lLZi5b.png\u0022 alt=\u00222lLZi5b.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Nti0ZKO.png\u0022 alt=\u0022Nti0ZKO.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDue to the atmosphere being so thin, the capsule was still going about 11m/s at touchdown, and the heat shield exploded. Future missions would need more parachutes.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd so, pilot Johnbro stepped out of the capsule and tried to walk.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/NicPTAJ.png\u0022 alt=\u0022NicPTAJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd that was the first step on a planet with aliens. Great job, Johnbro. Actually, he has been in 0g for the past hundred days except for his trip to Statmun and the acceleration of burning engines, so he does need time to readjust.\n\u003C/p\u003E\n\u003Cp\u003E\nCan I count this as an alien invasion?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/PTRnLZB.png\u0022 alt=\u0022PTRnLZB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso, I got the visors working! It was a known issue with the Windows version of the shaders.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, how did I do as far as accuracy goes?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/sOwPADr.png\u0022 alt=\u0022sOwPADr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPretty good, it looks like! Everything is within a 30km diameter circle, I think.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/0ns868j.png\u0022 alt=\u00220ns868j.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe rover drove over to pick the crew up. The crew noticed that Kerbmun\u0027s clouds move insanely fast, showing large levels of wind a few kilometers up.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/xUCDUrc.png\u0022 alt=\u0022xUCDUrc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/mDFBt1P.png\u0022 alt=\u0022mDFBt1P.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFirst contact with alien life - really tall grass.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/I5xwBLn.png?1\u0022 alt=\u0022I5xwBLn.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn the rover drive to check out the ascent vehicle it was realized that Mesbin sort of looked like a face. Mesbin does not approve of the ascent vehicle.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/GrUqikV.png\u0022 alt=\u0022GrUqikV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUpon checkout, it was thought that the ascent vehicle was in good condition. The ladders worked. The solar panels were deployed. The snacks were raided.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/E8tBbLv.png\u0022 alt=\u0022E8tBbLv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then they arrived at the base, named Vau Base. Some \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E things were set up, like science experiments, pipes, and lights. Also, the landing legs on the base broke the instant I attached anything with \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E... The wheels on the rover did the same thing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/ayzCdAm.png\u0022 alt=\u0022ayzCdAm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/wynvRwb.png\u0022 alt=\u0022wynvRwb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then the science glider - which is insanely hard to land as it turns out - was flown over to the base. All of the experiments were going to be processed in the lab, but there were only room for three... And \u0022life support\u0022 is ticking... We don\u0027t want to leave Crisfrey alone in the Virtuoso for more than a few months. So, we may have to turn this little base into something more permanent...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStep 5 complete!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-10-07T19:37:17Z","Content":"\n\u003Cp\u003E\nOut of likes! Very cool \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E, you’ve established the first permanent Kerbal presence on another ( habitable ) world!\n\u003C/p\u003E\n"},{"CreatedByName":"Pretorian28715","CreatedById":175947,"CreatedDateTime":"2018-10-07T21:10:19Z","Content":"\n\u003Cp\u003E\nFollowing. Nice and simple..\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2018-10-08T01:07:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223463909\u0022 data-ipsquote-contentid=\u0022178741\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221538941037\u0022 data-ipsquote-userid=\u0022154159\u0022 data-ipsquote-username=\u0022Kerbalstar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Kerbalstar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOut of likes! Very cool \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E, you’ve established the first permanent Kerbal presence on another ( habitable ) world!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223463954\u0022 data-ipsquote-contentid=\u0022178741\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221538946619\u0022 data-ipsquote-userid=\u0022175947\u0022 data-ipsquote-username=\u0022Pretorian28715\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n27 minutes ago, Pretorian28715 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFollowing. Nice and simple..\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you both for the kind words! The base module might be permanent, but the crew is definitely not, at least for now.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 6 - The Great Universe Derp\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nWhirligig has been updated to 0.5. Most of the changes involve far away worlds that I have not visited yet, but two major things have changed. Mesbin and Statmun. Mesbin is now way smaller and spins way faster, every 28 minutes. Statmun is still tidally locked in a stationary orbit, but is twice as large and completely redesigned.\n\u003C/p\u003E\n\u003Cp\u003E\nThe good news? You only need 2.5km/s to get into a low orbit. The bad news? You need more to go from there to anywhere else. I think it evens out, though, and we have a slight decrease in the total delta-v required to go places.\n\u003C/p\u003E\n\u003Cp\u003E\nBut two major things in the save have been messed up. Due to Statmun\u0027s sudden increase in size, it ate our one module Statmun station... Not a huge loss, to be honest. But the major thing is that Treehouse Station is now in a medium orbit instead of a low orbit, making it impractical as a stopping point. The delta-V from Treehouse to Graymun and Statmun are about 2km/s each way for both... We\u0027d want to optimize for one.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, instead of moving the pitifully tiny Treehouse station which can only support a few people for a short time, let\u0027s take advantage of the lower Delta-V to LMO and build something just a little bit bigger!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/WUogdIX.png\u0022 alt=\u0022WUogdIX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAAAA NO! I said \u0022A little bit bigger!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nFaith Station has a very large crew capacity, and has an artificial gravity ring. It also features several normal size docking ports and 6 jr ports for older generation ships. It also has a jumbo 64 worth of fuel capacity, a science lab, and space for *does math* 209 Kerbals, although it will never carry that many... That\u0027s over 40% of the planet\u0027s population!\n\u003C/p\u003E\n\u003Cp\u003E\nIt also cost over half a million funds and was right up to the 255 part limit. So I won\u0027t do anything this extravagant for a while.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso the rocket would have been about 3x bigger on the older, larger Mesbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Abfg6AH.png\u0022 alt=\u0022Abfg6AH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnother thing - Statmun now orbited just behind \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, much better than 1/3 of the way around the planet, much more accessible. Onboard Faith Station were Jeb, Bill, and Bob.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/CVbGOL1.png\u0022 alt=\u0022CVbGOL1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe two Kerbals on Treehouse station grabbed everything useful, including two antennas (forgotten on the new station), the entire \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E box, all of the remaining fuel, and most of the supplies and personal stuff, and stuffed it into two of the Fearless spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/iisV1YB.png\u0022 alt=\u0022iisV1YB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe lower stage of one  was used, then separated, and then the engine on the other used the rest of the fuel to get the whole stack to Faith Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/6YQP26k.png\u0022 alt=\u00226YQP26k.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/7QcjmDS.png\u0022 alt=\u00227QcjmDS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo at this point we\u0027d do do some stuff with Vau base, but due to tech tree changes, some parts are locked and I don\u0027t want to load it just in case... So, let\u0027s get some science!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/gHzdKLF.png\u0022 alt=\u0022gHzdKLF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDue to the new Delta-V requirements, it was determined that the Fearless spacecraft, with some modifications, could be used as a Statmun lander. And so, on Fearless 4, Pilot Valentina and a female scientist I don\u0027t remember the name of launched to Statmun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/aPgb35l.png\u0022 alt=\u0022aPgb35l.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOkay... It\u0027s really weird orbiting, seeing both Mesbin and Statmun literally not move as the star field moves. It\u0027s so disorientating.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/cVFY7Es.png\u0022 alt=\u0022cVFY7Es.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe second stage still had a bunch of fuel left at this point but we needed the landing legs, so we ditched the stage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/trRedh3.png\u0022 alt=\u0022trRedh3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n*ominous*\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/dqOi8rb.png\u0022 alt=\u0022dqOi8rb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA landing was attempted... Notice I say attempted. I bounced off the surface and fell up and sideways. You want to know why?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/g60AkxB.png\u0022 alt=\u0022g60AkxB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMost of Statmun\u0027s equator now rotates faster than orbital velocity. This makes landing there rather problematic. It\u0027s also a great curiosity as to how the moon stays together. Maybe it\u0027s one giant chunk of metal... It is covered in rust, after all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/Hr3RzI9.png\u0022 alt=\u0022Hr3RzI9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn order to have a safe touchdown zone we relocated to a really deep pit. At first everything looked good...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/8NmPkFy.png\u0022 alt=\u00228NmPkFy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut then everything started floating upwards. We had to jam the flag in really hard to ensure it wouldn\u0027t go flying.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/8MtKTDX.png\u0022 alt=\u00228MtKTDX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe lander flew upwards, to the right, then to the left, and crashed into the northern wall as I was writing the flag, flinging it into the opposite wall, destroying the docking port. The decision was made to quickly finish the science and go back to the north pole.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/77rTfXp.png\u0022 alt=\u002277rTfXp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe old Munar lander was now buried beneath the surface. Trying to extract it did not go so well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/o2caiel.png\u0022 alt=\u0022o2caiel.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe other flag is also buried and its text is lost to the persistence files. After a quick stop at the north pole (now much less pointy but more voidy) the lander went to Faith Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/GmumcBR.png\u0022 alt=\u0022GmumcBR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe engineer there installed a new docking port so it could dock. This came at the expense of one of the 6 docking ports on the station, so now there are only 5. Whatever!\n\u003C/p\u003E\n\u003Cp\u003E\nNow, to get the science home...\n\u003C/p\u003E\n\u003Cp\u003E\nPreviously, returning crew members was considered extremely impractical and returning science experiments required a huge rocket, but now, with 2.5km/s each way assuming  perfect suicide burn, it was definitely possible.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/MbVnHsH.png\u0022 alt=\u0022MbVnHsH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was the CASTLER - Crew And Sample Two-seat Lifeboat Extra Return. Designed to return 2 Kerbals and a sample container to Mesbin from low orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/l0N3LrP.png\u0022 alt=\u0022l0N3LrP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/bQvpxcf.png\u0022 alt=\u0022bQvpxcf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCASTLER was briefly docked to Faith Station, and promptly undocked after the experiments had been loaded. Nobody was onboard for this landing test.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/AcoROmn.png\u0022 alt=\u0022AcoROmn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDue to a badly timed suicide burn three times over, the lander stopped too early and wasted its fuel margin. On the final landing approach it ran out of fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/uqDmNJb.png\u0022 alt=\u0022uqDmNJb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFortunately, the crew compartment and the samples survived! About 550 science was recovered from this mission, which was enough to unlock the missing parts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/vJEGxvx.png\u0022 alt=\u0022vJEGxvx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMesbin\u0027s size difference is really apparent from Kerbmun.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd that\u0027s step 6 complete!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2018-10-08T01:13:50Z","Content":"\n\u003Cp\u003E\nYeah, I started over after the update. Like how you handled it! Crew return is a thing! Nice to know, thanks \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161505\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161505-ultimate-steve/\u0022 rel=\u0022\u0022\u003E@Ultimate Steve\u003C/a\u003E!\n\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2018-10-08T03:00:48Z","Content":"\n\u003Cp\u003E\nThis is quite a nice report so far! But uh... there are other planets in this system!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-10-08T03:01:47Z\u0022 title=\u002210/08/2018 03:01  AM\u0022 data-short=\u00225 yr\u0022\u003EOctober 8, 2018\u003C/time\u003E by GregroxMun\u003C/strong\u003E\n\u003C/span\u003E\n"}]}