{"TopicId":181951,"ForumId":51,"TopicTitle":"Stigmun\u0026#039;s Folly; or, A slightly crazy (and certainly overly complicated) attempt to visit every biome on Kerbin via rover.","CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-04T09:10:17Z","PageNum":1,"Articles":[{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-04T09:10:17Z","Content":"\n\u003Cp\u003E\nYesterday I posted \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/27292-what-did-you-do-in-ksp-today/\u0026amp;amp;do=findComment\u0026amp;amp;comment=3534035\u0022 rel=\u0022\u0022\u003Ethis post\u003C/a\u003E in the \u0022What did you do in KSP today?\u0022 thread... \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/103694-jacke/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022103694\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/103694-jacke/\u0022 rel=\u0022\u0022\u003E@Jacke\u003C/a\u003E then kindly suggested I turn this little project into a mission report, and that\u0027s actually not a bad idea. So, here we are.\n\u003C/p\u003E\n\u003Cp\u003E\nBasic premise is as stated above in the title... I want to visit every biome with a rover in one continuous mission in my science save. The reason I\u0027m starting with a rocket launch is, well... I kinda don\u0027t have a biome map of Kerbin, or a listing of all the anomalies, in the science save I\u0027m currently running, and that\u0027s kind of important for the mission. (How I managed to slip up on something that basic that is something that I\u0027m still wondering about.) But, what\u0027s not done yet can easily be done, and what\u0027s easily done can certainly be made harder. I.e., I\u0027ve been playing KSP for a touch over 7 years now. I can slap together a satellite for that mission and a rocket to launch it in under 10 minutes. There\u0027s no \u003Cem\u003Echallenge\u003C/em\u003E to that.\n\u003C/p\u003E\n\u003Cp\u003E\nHence, I\u0027m \u003Cem\u003Ebuilding\u003C/em\u003E the rocket, in the field, along with the supporting tower, at the Dessert Airfield launch pad. Why? Because I can, and \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E is \u003Cem\u003Eawesome\u003C/em\u003E. This is going to be phase 1 of the mission, and will begin soon...ish. Right now, I\u0027m in phase 0... Experimenting and toying around with the processes and procedures needed to make this work. I\u0027ve NEVER done anything remotely close to what I\u0027m intending to do, and I need to make sure I have a solid plan moving forwards. So, to the sandbox!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLast night\u0027s efforts were mainly focused on the first idea I had for building the rocket...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fVZGz0m.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/fVZGz0m.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe idea was to build the rocket horizontally, then use \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E to hoist it upright.\n\u003C/p\u003E\n\u003Cp\u003E\nIt... kinda worked.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WCp4zoF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/WCp4zoF.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI had no issue getting the rocket vertical... The issue was getting the darned Construction Ports from \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E to work properly. They flat out refused to play nice, so that kinda scrapped that attempt to dock it to the base, then weld them and compress the rocket onto the decoupler holding it to the pad.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, back to the (mental) drawing board today while I was sitting around bored during the combination of Super Bowl LIII and the snowstorm currently striking Seattle, where I live, and I thought over the failure from last night. I concluded that I was overly complicating the construction process. I was already planning on handling the stages dry, and fueling once assembled on the pad, just like irl. So, I though over how I could emulate that approach. I came up with this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hUJOM99.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/hUJOM99.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere are 6 discrete, easy-to-handle packages that come together to form the rocket...\n\u003C/p\u003E\n\u003Cp\u003E\n-Payload, encapsulated in the fairing\n\u003C/p\u003E\n\u003Cp\u003E\n-Upper stage fuel tank with fueling port\n\u003C/p\u003E\n\u003Cp\u003E\n-Upper stage engine with three retro motors and decoupler already attached, to ensure the shroud remains intact (and to \u0022protect\u0022 the engine in transit... more on that later.)\n\u003C/p\u003E\n\u003Cp\u003E\n-Upper fuel tank of the lower stage, with fueling port\n\u003C/p\u003E\n\u003Cp\u003E\n-Lower tank of the lower stage, with holddown ports and stabilizer fins\n\u003C/p\u003E\n\u003Cp\u003E\n-Lower stage engine package, with decoupler and adapter to the launch base already attached.\n\u003C/p\u003E\n\u003Cp\u003E\nEach of these packages is well under a tonne (actually, every single part and/or subassembly for the whole shebang, pad included, fits that bill. I\u0027m quite proud of that. \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E), meaning that an engineering-inclined Kerbal can easily move them around by themselves, no extra help required.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022M3tesGl.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/M3tesGl.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEllo Kerman has been my gracious test engineer. Here, you can see how the first stage engine pack and the lower fuel tank have been installed, and the upper stage engine has been moved out of the way. (I kinda got ahead of myself on that...\u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E)\n\u003C/p\u003E\n\u003Cp\u003E\nThe tower is essential, providing a work platform for both Kerbal and package being installed, as Ello demonstrates below...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CJe2bso.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/CJe2bso.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027ll notice that little black frustum on the bottom. That\u0027s deliberate. It\u0027s a solid piece attached to the bottom of the decoupler on the upper stage engine, and an identical unit caps off the bottom of the payload fairing. These are to seal out any FOD until the package above is ready to be mounted on the stack. (Not really needed, but hey, it adds a little realism.)\n\u003C/p\u003E\n\u003Cp\u003E\nThe platforms and ladders are used to sequentially move the upper stage tank and payload to the upper levels, where Ello can install them.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Cp95kRh.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Cp95kRh.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HWUkrN2.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/HWUkrN2.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere, you can see the packaging cap from the payload left behind on the work deck. The one atop the command pod is the one off the upper stage engine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JwYqrbe.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/JwYqrbe.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinished result of the build process on the prototype platform looks pretty good, imo, and I was largely happy with the results. It looks like a legit rocket on the pad, amirite? There were a few minor issues with the pad design that would be straightened out in the final version...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gU1BbXw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/gU1BbXw.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe overhead crane boom and the ladder used to access it was eliminated for simplicity, and was replaced with a work light and an antenna, which is also a faux lightning rod. I also replaced the heavy duty battery at the base of the tower with a pair of smaller 400 EC capacity batteries along the sides, and added solar panels. The fuel tanks are not in their final homes... that\u0027s just where I parked them while checking quantities needed to fuel the whole stack. Two FL-T-400s and two Oscar-Bs, along with two of the little Monopropellant tanks. There will be a little \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E left over, and ~3/4 of the second monoprop tank if I opt to fuel the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E on the upper stage. I may only do a partial \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel load to improve performance.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dEeZjxe.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/dEeZjxe.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn the pad at Woomerang at night.\n\u003C/p\u003E\n\u003Cp\u003E\nIf there\u0027s interest, I\u0027ll post the craft files to KerbalX so people can try this \u0022kit built rocket\u0022 thing out for themselves. It\u0027s an absolute hoot.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe rest of the night was spent doing logistical planning, like how many \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E containers I\u0027m going to need to move the baseplates and assorted other bulky/fragile parts (it turns out I need ~8000 litres total capacity, or 5 of the new long 1.25 m diameter cargo containers from \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E), testing the fit of the components into the cargo hauler I\u0027ll be using to airlift the containers, packages, and pre-assembled tower sections out to the Dessert airfield. Turns out the tower sections just \u003Cem\u003Ebarely\u003C/em\u003E squeak into the cargo hold of the Hercules I built the other day, and the rest of the parts fit with plenty of room to spare.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MKvMhrw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/MKvMhrw.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll told, it\u0027s going to take 3 flights for the tower, another 3 for the other pad components, two or three for the rocket proper, and one or two for the fuel load. And I still need to design a rover and trailer to haul the parts over from the pad to the runway at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, and vice versa at the Dessert facility. I may need to build a larger transport in the Mk 3 format to haul the rover, tbh.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hmm.gif\u0022 class=\u0022ipsImage\u0022 height=\u002220\u0022 src=\u0022https://www.orbiter-forum.com/images/smilies/hmm.gif\u0022 width=\u002215\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nY\u0027know, I will probably need that Mk 3 airlifter for the main rover mission for transporting the replacement rover, should it be needed. Might have to do that tomorrow. For now, though, it\u0027s 0100 local, and it\u0027s been a long day for me. Gonna have to call it a night here.\n\u003C/p\u003E\n\u003Cp\u003E\nCatch y\u0027all on the flip side, folks. \u003Cimg alt=\u0022Goodnite.gif\u0022 class=\u0022ipsImage\u0022 height=\u002233\u0022 src=\u0022https://www.orbiter-forum.com/images/smilies/Goodnite.gif\u0022 width=\u002233\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-04T09:12:21Z\u0022 title=\u002202/04/2019 09:12  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 4, 2019\u003C/time\u003E by MaverickSawyer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Czardus","CreatedById":195187,"CreatedDateTime":"2019-02-04T21:31:12Z","Content":"\n\u003Cp\u003E\nInteresting idea.  I\u0027m looking forward to seeing how long it takes you to get all the biomes!\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-05T00:32:49Z","Content":"\n\u003Cp\u003E\nWelp, my college classes got cancelled today due to the ~8 cm of snow that fell across the Puget Sound region last night and this morning, so I got an early start on some testing of potential airlifters...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D6WOQhN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/D6WOQhN.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI added a pair of underwing tanks to the Herc and shipped out for the Dessert Airstrip in a test flight, both of the plane\u0027s endurance and my ability to navigate to the remote site.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229W2bjY8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/9W2bjY8.png\u0022 width=\u00221024\u0022\u003EJeb was not terribly impressed with the plane\u0027s top speed. Even at wide open throttle, the plane topped out at 156 m/s. However, it was only burning 0.12 \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E per second, which was quite reasonable.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220iKo7Pj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/0iKo7Pj.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNoted some shallows near the Western Desert. Something worth investigating in the future... if they\u0027re sufficiently shallow, I might try to build something there.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FRDzbOy.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/FRDzbOy.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nField in sight, after nearly an hour and a half. Missions like this are a big part of why I have Atmospheric Autopilot installed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AoSrl0k.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/AoSrl0k.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLining up on final approach... in more ways than one.\n\u003C/p\u003E\n\u003Cp\u003E\nShortly after touchdown and the application of brakes and reverse thrust, the plane veered hard right in a sort of reverse ground loop the likes of which I haven\u0027t encountered in this plane before. The turn was hard enough that the left wingtip hit the runway at better than 30 m/s and promptly detonated, scattering fuel tanks, engines, and control surfaces everywhere. The plane then rolled to the right, veered left, and wound upon her right side external tank and wingtip before skidding to a stop...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TcFaZSd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/TcFaZSd.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNeedless to say, the boys decided to get a ride home... and a fresh set of undergarments.\n\u003C/p\u003E\n\u003Cp\u003E\nDuring the Accident Investigation Board, Jeb flat out refused to fly in one of these ever again, stormed out of the administrative complex, and vanished into the Hangar. A few hours later, he presented this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224Ps8bv6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/4Ps8bv6.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s basically a stock Mallard with Panther engines in place of the Wheesleys, and shock ramp inlets in place of the basic ones. He, Val, Bill, and Ello promptly saddled up and took off for the Dessert airstrip for a second crack at the test mission...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zqdHJVH.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/zqdHJVH.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229gf5LF7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/9gf5LF7.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb was disappointed he couldn\u0027t push it up to Mach 3, but the performance was nonetheless a significant improvement... more than 5 times faster, with only 4 times the fuel burn rate at cruise! \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLanding was a relatively straight forward affair, and the plane taxiied off the runway and shut down in one piece.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yfsNFJE.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/yfsNFJE.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen, the gang turned around and flew back home. There was some tinkering with ascent profiles and cruise parameters on the way home, and it was found that by climbing up to 17 km altitude while cruising, they\u0027d shave off ~25% of the fuel burn rate. Jeb wants to take it higher still and see if he can\u0027t coax some more speed out of it, but I\u0027ve told him that 800 m/s is more than adequate. After all, the round trip was completed in less time than it would have taken to fly to the \u0022feet dry\u0022 point on the route, let alone to the base...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qUpE8Wj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/qUpE8Wj.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNeedless to say, I think we\u0027ve got us a winner, though my computer didn\u0027t like the long duration of flight ops and promptly CTD\u0027d, then BSOD\u0027d when I tried to restart KSP. But, I\u0027m back up now, and about to restart KSP for a second swing at the experimentation... Next up, figuring out how the new towbar from \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E works, redoing the logistics of the airlift to accommodate the much larger cargo hold, and sorting the refueling operation at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E end of the operation. Then, it\u0027ll be time to shunt everything over to the science save and get on with Phase 1: launching the satellite.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-05T08:11:44Z","Content":"\n\u003Cp\u003E\nOne final report from Phase 0...\n\u003C/p\u003E\n\u003Cp\u003E\nPut the finalized design on the launchpad and drove Ello Kerman over to test the disassembly process...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J6jrFDp.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/J6jrFDp.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mw1MJo6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/mw1MJo6.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI then followed that with testing out the fit of the rover with the bulkiest parts (tower segments) into the Mallard II.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jzDmazL.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/jzDmazL.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hVBR1CO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/hVBR1CO.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m at a point where I know it\u0027ll work in the field now, so I copied all the craft files over to the science save... only to find out I need to unlock two more tech tree nodes to make it happen. So, I need to rack up 1100 science points to open up Experimental Aerodynamics and... Nanolathing? I think that\u0027s the one I need to unlock. Fortunately, I have a pretty capable team of Kerbals around Minmus, and 400 science points on their way back from Minmus already in a return capsule. I also transmitted ~150 science from crew reports and such at the location of my new surface base, and the team there has another 400 science points queued up for return. They\u0027ll bring that back with the crew rotation in a few days.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-07T09:17:16Z","Content":"\n\u003Cp\u003E\nPhase 1 has begun!\n\u003C/p\u003E\n\u003Cp\u003E\nStigmun finally got the last signoffs on the project, and he began to dismantle the pad and the rocket...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TqdgYvR.png\u0022 class=\u0022ipsImage\u0022 height=\u0022579\u0022 src=\u0022https://i.imgur.com/TqdgYvR.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt took some doing, but the panels were able to be tucked into the cargo pods.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rD2QLxp.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/rD2QLxp.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe plan was to stage the tower sections and rocket parts by the Mission Control complex, load up the pad base aboard the Mallard II, and fly over to the Desert Airfield and stage the cargo pods with the base there. Fly back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, pick up the tower sections, refuel, fly back to the airfield, unload and stage the tower, fly back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, pick up the rocket and the fuel it would need, refuel the Mallard \u003Cem\u003Eagain\u003C/em\u003E, then fly back to the airstrip and assemble everything.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kLOpVdv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022579\u0022 src=\u0022https://i.imgur.com/kLOpVdv.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat was the plan, anyways. And, as any experienced KSP player knows, the more complex the plan, the more likely you are to summon the Kraken to ruin your day.\n\u003C/p\u003E\n\u003Cp\u003E\nI managed to summon him repeatedly.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, the tower sections vanished. How, I don\u0027t know. I assume that the janitorial staff thought they were for collection or something, but when I reopened KSP earlier this evening... they were gone. I\u0027m not quite sure what to make of that, but I\u0027ll be replacing that with a freshly launched one tomorrow. It\u0027ll be joined by the entire upper stage, and the fuel tanks for the lower stage, which also vanished off the launch pad. This one, I blame on the automatic launch pad clean-up function. I\u0027ll be disabling that pronto for the future. That was actually the third kraken event.\n\u003C/p\u003E\n\u003Cp\u003E\nThe engines for the first stage and the payload are safe, though... Stigmun made sure to link them all together at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E before departing to ensure they don\u0027t vanish as well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ijPJy1S.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ijPJy1S.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSecond one was that, somehow, I managed to fling one of the base panels for the pad off into the distance... but after about three seconds, it just... froze. How, I don\u0027t know, but it just hung there some 40 meters up until I managed to coax the game to let me quicksave and reload, upon which time it appeared some \u003Cem\u003E98 kilometers to the west.\u003C/em\u003E I\u0027m still trying to wrap my head around that one. But, I did managed to get the rest of the parts into the containers, and from there, into the Mallard.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oHUoZau.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/oHUoZau.png\u0022 width=\u00221024\u0022\u003EFrom there, it was a fairly simple task to taxi to the end of the runway and take off... right?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OGlqIgB.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/OGlqIgB.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCue fourth visit from our tentacled friend... I somehow, \u003Cem\u003Esomehow \u003C/em\u003Emanaged to get the Mallard to explode about 90 seconds into flight by not properly securing the rover in the back of the cargo bay. Three times. Generally, the cockpit was the only part that survived. Thank god for having quicksaved on the runway. Stigmun finally traced it down to using the free-moving connector joint instead of the locked one. A quick swap of the part later, we managed to safely take off and start our climbout.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nritEkC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/nritEkC.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nClimbout and cruise were... less than ideal. I wound up being unable to push the Mallard to the planned cruising speed and altitude, so I burned through more than half my fuel on the trip over. But, good news is that, A. I made it there without crashing and/or exploding; B. I located the Desert Temple on my descent into the airstrip.; and C. they do offer a limited supply of liquid fuel suitable for feeding the Mallard at the airstrip, so I can top off enough to make it back to base with some margin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DZwacJW.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/DZwacJW.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHaving (mostly) succeeded so far, Stigmun offloaded one full canister of parts and drove it over to the launchpad for... testing. I\u0027m not sure how well it\u0027ll take to being left out there alone and anchored to the ground, so we\u0027ll see what happens. If I have to replace it, it\u0027ll be a minor issue instead of a project ending catastrophe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xdvjEBY.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/xdvjEBY.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JRuBhpS.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/JRuBhpS.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll things considered, Stigmun\u0027s actually quite happy with the progress so far. There have been some serious setbacks, yes, but it\u0027s minor stuff.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E*muffled explosion*\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAaaand the back right tire of the rover just spontaneously decided to go to NaN speed and destroy itself via collision into the ground. Joy. Well, that\u0027s why I have multiple wheels...\n\u003C/p\u003E\n\u003Cp\u003E\nThink I\u0027m going to call it a night before the Kraken decides to eat the whole save. \u003Cimg alt=\u0022Goodnite.gif\u0022 class=\u0022ipsImage\u0022 height=\u002233\u0022 src=\u0022https://www.orbiter-forum.com/images/smilies/Goodnite.gif\u0022 width=\u002233\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2019-02-07T13:41:29Z","Content":"\n\u003Cp\u003E\nGood progress, dude, despite the Kraken showing up from time to time.\n\u003C/p\u003E\n\u003Cp\u003E\nCan you provide a list of mods?  I\u0027m not familiar enough to recognise them implicitly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223536459\u0022 data-ipsquote-contentid=\u0022181951\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549531036\u0022 data-ipsquote-userid=\u002211952\u0022 data-ipsquote-username=\u0022MaverickSawyer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, MaverickSawyer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFirst, the tower sections vanished. How, I don\u0027t know. I assume that the janitorial staff thought they were for collection or something, but when I reopened KSP earlier this evening... they were gone. I\u0027m not quite sure what to make of that, but I\u0027ll be replacing that with a freshly launched one tomorrow. It\u0027ll be joined by the entire upper stage, and the fuel tanks for the lower stage, which also vanished off the launch pad. This one, I blame on the automatic launch pad clean-up function. I\u0027ll be disabling that pronto for the future. That was actually the third kraken event.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s something in the global settings, it may be what causes that \u0022automatic launch pad clean-up function\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022General\u0022 pane, right-side \u0022System\u0022, \u0022Tidy up debris cluttering \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u0022, defaults to ON.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, MaverickSawyer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nC. they do offer a limited supply of liquid fuel suitable for feeding the Mallard at the airstrip, so I can top off enough to make it back to base with some margin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow do you refuel the Mallard at the Dessert Airstrip?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, MaverickSawyer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/JRuBhpS.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022JRuBhpS.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/JRuBhpS.png\u0022 width=\u00221024\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAll things considered, Stigmun\u0027s actually quite happy with the progress so far. There have been some serious setbacks, yes, but it\u0027s minor stuff.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhere\u0027d Stigmun get his stetson and shades? \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, MaverickSawyer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cem\u003E*muffled explosion*\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAaaand the back right tire of the rover just spontaneously decided to go to NaN speed and destroy itself via collision into the ground. Joy. Well, that\u0027s why I have multiple wheels...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow!  How often does that happen?\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-07T18:44:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223536532\u0022 data-ipsquote-contentid=\u0022181951\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549546889\u0022 data-ipsquote-userid=\u0022103694\u0022 data-ipsquote-username=\u0022Jacke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Jacke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGood progress, dude, despite the Kraken showing up from time to time.\n\u003C/p\u003E\n\u003Cp\u003E\nCan you provide a list of mods?  I\u0027m not familiar enough to recognise them implicitly.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaking History\n\u003C/p\u003E\n\u003Cp\u003E\nMissing History (1.25m engine plate)\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Inventory System\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Attachment System\n\u003C/p\u003E\n\u003Cp\u003E\nBluedog Design Bureau (launch vehicle minus first stage engine package and satellite batteries and instruments, tower antenna, rover antenna)\n\u003C/p\u003E\n\u003Cp\u003E\nProbes Plus! (Instruments, batteries on satellite and rover, rover torque wheels)\n\u003C/p\u003E\n\u003Cp\u003E\nTweakscale\n\u003C/p\u003E\n\u003Cp\u003E\nNear Future Structural (tower truss sections, Tweakscaled to 1.25m)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E Construction (Akita Rover)\n\u003C/p\u003E\n\u003Cp\u003E\nAtmospheric Autopilot (for the Mallard II... makes flying it much easier)\n\u003C/p\u003E\n\u003Cp\u003E\nMechJeb for All (just a plugin that adds MechJeb to all probe cores and command pods)NavHud (for flying terminal approach in the Mallard)\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Hacks (hats, sunglasses, etc.)\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere\u0027s something in the global settings, it may be what causes that \u0022automatic launch pad clean-up function\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022General\u0022 pane, right-side \u0022System\u0022, \u0022Tidy up debris cluttering \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u0022, defaults to ON.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep, that\u0027s the one I had in mind.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow do you refuel the Mallard at the Dessert Airstrip?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m going to spawn in an Akita rover I made for refueling operations (before I ever thought of this mission, btw) and claim it was lurking in a hangar at the airstrip. It\u0027s got 300 units of \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E, iirc. More than enough to provide me with the needed margin to make it back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E with just the rover aboard.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhere\u0027d Stigmun get his stetson and shades? \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSee the last entry in the mods listing. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWow!  How often does that happen?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFirst time I\u0027ve ever seen it happen. Part of why I decided to call it a night at that point. \u003Cimg alt=\u0022lol.gif\u0022 class=\u0022ipsImage\u0022 height=\u002215\u0022 src=\u0022https://www.orbiter-forum.com/images/smilies/lol.gif\u0022 width=\u002215\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2019-02-07T19:46:54Z","Content":"\n\u003Cp\u003E\nThanks!  (And already out of likes!)\n\u003C/p\u003E\n\u003Cp\u003E\nI use a number of those mods already.  For autopilot, I went with Kramax Autopilot Continued as I thought its support was better.\n\u003C/p\u003E\n\u003Cp\u003E\nHave a few suggestions\n\u003C/p\u003E\n\u003Cp\u003E\nNavUtil - Good tool to do glide-path landings\u003Cbr\u003E\nSensible Screenshots - renames the files to a dated name\u003Cbr\u003E\nBetter Load Save Game\u003Cbr\u003E\nDated Quick Saves\u003Cbr\u003E\nKerbal Improved Save System\u003Cbr\u003E\nShip Save Splicer\u003Cbr\u003E\nCraft Manager\u003Cbr\u003E\nKXAPI\u003Cbr\u003E\nEditor Extensions\u003Cbr\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid\u003Cbr\u003E\nCorrect \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E - sort of like the tools with \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E\u003Cbr\u003E\nPart Wizard - used it to break and make symmetry\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve mostly switched to using \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E.  I use JSGME to do stuff needing manual installs and metamodding the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E mods.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223536653\u0022 data-ipsquote-contentid=\u0022181951\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549565079\u0022 data-ipsquote-userid=\u002211952\u0022 data-ipsquote-username=\u0022MaverickSawyer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, MaverickSawyer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMechJeb for All (just a plugin that adds MechJeb to all probe cores and command pods)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt appears now that MechJeb is doing that itself.  From before that, for a long time I\u0027ve used a Module Manager script to add MechJeb to pods and also the Command Chair and any equivalent Kerbal Seat part.  I also change it to give me all MechJeb functions at Start in a career.  Latest version.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\n\u003Cspan class=\u0022pln\u0022\u003E// MM.MechJeb2.MC\u002BKS.\u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026lt;date-version\u0026gt;\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E.cfg\n//\n// Version 20190205a\n// for KSP v1.6.1\n//\n// Powered by ialdabaoth and sarbian\u0027s ModuleManager\n//      http://forum.kerbalspaceprogram.com/index.php?/topic/50533--/\n// ModuleManager config coding by KSP forum user Jacke\n//      http://forum.kerbalspaceprogram.com/index.php?/profile/103694-jacke/\n// Copyright 2019 by Jacke\n// Licence GNU General Public Licence version 3\n//      https://www.gnu.org/licenses/gpl-3.0.en.html\n//\n// Include this file with Kerbal Space Program\n//\n// for MechJeb \u0026gt;= 2.1.1\n//\n// add MechJeb functions to all parts with MODULE ModuleCommand and/or KerbalSeat\n// enable these functions from Start of careers\n//\n// 2019 Feb 05 Tue  confirmed good for KSP 1.6.1 and recent MM and MechJeb2\n// 2017 Aug 21 Mon  split code for ModuleCommand and KerbalSeat as \u0027|\u0027 in HAS not working\n// 2017 Aug 19 Sat  75 Anniversary of the Dieppe Raid - Lest We Forget\n//                  confirmed good for MechJeb2 version 2.6.1.0-735\n// 2016 Dec 24 Sat  changed to recreate existing MODULE MechJebCore to change the unlockTechs\n// 2016 Dec 13 Tue  changed to one @PART block using \u0027|\u0027 in :HAS code\n// 2016 Dec 12 Mon  added :NEEDS[MechJeb2], added code block for KerbalSeat\n//                  similar to Mahal\u0027s StockPlugins,\n//                  renamed this file from MMJ-Graphotron-ModuleCommand\n//                  to MMJ-MechJeb-MC\u002BKS\n// 2016 Apr 20 Wed  updated links for KSP new forum\n// 2015 May 12 Tue  updated coding\n// 2015 May 07 Thu  updated for KSP 1.0.2 and recent changes\n// 2014 Aug 30 Sat  changed order of HAS tests\n// 2014 Feb 20 Thu  MM coding by Jacke\n//\n// where    GameData/zzzFinal/\n// what     parts with MODULE ModuleCommand and/or KerbalSeat\n// files    part config files with MODULE ModuleCommand or KerbalSeat\n// nodes    PART\u0027s with MODULE ModuleCommand or KerbalSeat\n//\n//\n// Standard Command Modules and Kerbal carrying parts\n//\n@PART[*]:HAS[@MODULE[ModuleCommand]]:NEEDS[MechJeb2]:FINAL\n{\n\t-MODULE[MechJebCore] {}\t\t// delete any existing MODULE MechJebCore to change unlochTechs\n\tMODULE\n\t{\n\t\tname = MechJebCore\n\t\tMechJebLocalSettings {\n\t\t\tMechJebModuleCustomWindowEditor { unlockTechs = start }\t\t// flightControl\n\t\t\tMechJebModuleSmartASS { unlockTechs = start }\t\t\t// flightControl\n\t\t\tMechJebModuleManeuverPlanner { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleNodeEditor { unlockTechs = start }\t\t\t// advFlightControl\n\t\t\tMechJebModuleTranslatron { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleWarpHelper { unlockTechs = start }\t\t\t// advFlightControl\n\t\t\tMechJebModuleAttitudeAdjustment { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleThrustWindow { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleRCSBalancerWindow { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleRoverWindow { unlockTechs = start }\t\t// fieldScience\n\t\t\tMechJebModuleAscentGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleLandingGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleSpaceplaneGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleDockingGuidance { unlockTechs = start }\t\t// advUnmannedTech\n\t\t\tMechJebModuleRendezvousAutopilotWindow { unlockTechs = start }\t// advUnmannedTech\n\t\t\tMechJebModuleRendezvousGuidance { unlockTechs = start }\t\t// advUnmannedTech\n\t\t}\n\t}\n}\n//\n@PART[*]:HAS[@MODULE[KerbalSeat]]:NEEDS[MechJeb2]:FINAL\n{\n\t-MODULE[MechJebCore] {}\t\t// delete any existing MODULE MechJebCore to change unlochTechs\n\tMODULE\n\t{\n\t\tname = MechJebCore\n\t\tMechJebLocalSettings {\n\t\t\tMechJebModuleCustomWindowEditor { unlockTechs = start }\t\t// flightControl\n\t\t\tMechJebModuleSmartASS { unlockTechs = start }\t\t\t// flightControl\n\t\t\tMechJebModuleManeuverPlanner { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleNodeEditor { unlockTechs = start }\t\t\t// advFlightControl\n\t\t\tMechJebModuleTranslatron { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleWarpHelper { unlockTechs = start }\t\t\t// advFlightControl\n\t\t\tMechJebModuleAttitudeAdjustment { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleThrustWindow { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleRCSBalancerWindow { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleRoverWindow { unlockTechs = start }\t\t// fieldScience\n\t\t\tMechJebModuleAscentGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleLandingGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleSpaceplaneGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleDockingGuidance { unlockTechs = start }\t\t// advUnmannedTech\n\t\t\tMechJebModuleRendezvousAutopilotWindow { unlockTechs = start }\t// advUnmannedTech\n\t\t\tMechJebModuleRendezvousGuidance { unlockTechs = start }\t\t// advUnmannedTech\n\t\t}\n\t}\n}\n//\n// END OF MM.MechJeb2.MC\u002BKS.\u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026lt;date-version\u0026gt;\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E.cfg\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-07T19:50:59Z\u0022 title=\u002202/07/2019 07:50  PM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 7, 2019\u003C/time\u003E by Jacke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-07T20:17:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223536695\u0022 data-ipsquote-contentid=\u0022181951\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549568814\u0022 data-ipsquote-userid=\u0022103694\u0022 data-ipsquote-username=\u0022Jacke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, Jacke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks!  (And already out of likes!)\n\u003C/p\u003E\n\u003Cp\u003E\nI use a number of those mods already.  For autopilot, I went with Kramax Autopilot Continued as I thought its support was better.\n\u003C/p\u003E\n\u003Cp\u003E\nHave a few suggestions\n\u003C/p\u003E\n\u003Cp\u003E\nNavUtil - Good tool to do glide-path landings\u003Cbr\u003E\nSensible Screenshots - renames the files to a dated name\u003Cbr\u003E\nBetter Load Save Game\u003Cbr\u003E\nDated Quick Saves\u003Cbr\u003E\nKerbal Improved Save System\u003Cbr\u003E\nShip Save Splicer\u003Cbr\u003E\nCraft Manager\u003Cbr\u003E\nKXAPI\u003Cbr\u003E\nEditor Extensions\u003Cbr\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid\u003Cbr\u003E\nCorrect \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E - sort of like the tools with \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E\u003Cbr\u003E\nPart Wizard - used it to break and make symmetry\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve mostly switched to using \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E.  I use JSGME to do stuff needing manual installs and metamodding the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E mods.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt appears now that MechJeb is doing that itself.  From before that, for a long time I\u0027ve used a Module Manager script to add MechJeb to pods and also the Command Chair and any equivalent Kerbal Seat part.  I also change it to give me all MechJeb functions at Start in a career.  Latest version.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\n\n\u003Cspan class=\u0022pln\u0022\u003E// MM.MechJeb2.MC\u002BKS.\u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026lt;date-version\u0026gt;\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E.cfg\n//\n// Version 20190205a\n// for KSP v1.6.1\n//\n// Powered by ialdabaoth and sarbian\u0027s ModuleManager\n//      http://forum.kerbalspaceprogram.com/index.php?/topic/50533--/\n// ModuleManager config coding by KSP forum user Jacke\n//      http://forum.kerbalspaceprogram.com/index.php?/profile/103694-jacke/\n// Copyright 2019 by Jacke\n// Licence GNU General Public Licence version 3\n//      https://www.gnu.org/licenses/gpl-3.0.en.html\n//\n// Include this file with Kerbal Space Program\n//\n// for MechJeb \u0026gt;= 2.1.1\n//\n// add MechJeb functions to all parts with MODULE ModuleCommand and/or KerbalSeat\n// enable these functions from Start of careers\n//\n// 2019 Feb 05 Tue  confirmed good for KSP 1.6.1 and recent MM and MechJeb2\n// 2017 Aug 21 Mon  split code for ModuleCommand and KerbalSeat as \u0027|\u0027 in HAS not working\n// 2017 Aug 19 Sat  75 Anniversary of the Dieppe Raid - Lest We Forget\n//                  confirmed good for MechJeb2 version 2.6.1.0-735\n// 2016 Dec 24 Sat  changed to recreate existing MODULE MechJebCore to change the unlockTechs\n// 2016 Dec 13 Tue  changed to one @PART block using \u0027|\u0027 in :HAS code\n// 2016 Dec 12 Mon  added :NEEDS[MechJeb2], added code block for KerbalSeat\n//                  similar to Mahal\u0027s StockPlugins,\n//                  renamed this file from MMJ-Graphotron-ModuleCommand\n//                  to MMJ-MechJeb-MC\u002BKS\n// 2016 Apr 20 Wed  updated links for KSP new forum\n// 2015 May 12 Tue  updated coding\n// 2015 May 07 Thu  updated for KSP 1.0.2 and recent changes\n// 2014 Aug 30 Sat  changed order of HAS tests\n// 2014 Feb 20 Thu  MM coding by Jacke\n//\n// where    GameData/zzzFinal/\n// what     parts with MODULE ModuleCommand and/or KerbalSeat\n// files    part config files with MODULE ModuleCommand or KerbalSeat\n// nodes    PART\u0027s with MODULE ModuleCommand or KerbalSeat\n//\n//\n// Standard Command Modules and Kerbal carrying parts\n//\n@PART[*]:HAS[@MODULE[ModuleCommand]]:NEEDS[MechJeb2]:FINAL\n{\n\t-MODULE[MechJebCore] {}\t\t// delete any existing MODULE MechJebCore to change unlochTechs\n\tMODULE\n\t{\n\t\tname = MechJebCore\n\t\tMechJebLocalSettings {\n\t\t\tMechJebModuleCustomWindowEditor { unlockTechs = start }\t\t// flightControl\n\t\t\tMechJebModuleSmartASS { unlockTechs = start }\t\t\t// flightControl\n\t\t\tMechJebModuleManeuverPlanner { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleNodeEditor { unlockTechs = start }\t\t\t// advFlightControl\n\t\t\tMechJebModuleTranslatron { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleWarpHelper { unlockTechs = start }\t\t\t// advFlightControl\n\t\t\tMechJebModuleAttitudeAdjustment { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleThrustWindow { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleRCSBalancerWindow { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleRoverWindow { unlockTechs = start }\t\t// fieldScience\n\t\t\tMechJebModuleAscentGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleLandingGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleSpaceplaneGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleDockingGuidance { unlockTechs = start }\t\t// advUnmannedTech\n\t\t\tMechJebModuleRendezvousAutopilotWindow { unlockTechs = start }\t// advUnmannedTech\n\t\t\tMechJebModuleRendezvousGuidance { unlockTechs = start }\t\t// advUnmannedTech\n\t\t}\n\t}\n}\n//\n@PART[*]:HAS[@MODULE[KerbalSeat]]:NEEDS[MechJeb2]:FINAL\n{\n\t-MODULE[MechJebCore] {}\t\t// delete any existing MODULE MechJebCore to change unlochTechs\n\tMODULE\n\t{\n\t\tname = MechJebCore\n\t\tMechJebLocalSettings {\n\t\t\tMechJebModuleCustomWindowEditor { unlockTechs = start }\t\t// flightControl\n\t\t\tMechJebModuleSmartASS { unlockTechs = start }\t\t\t// flightControl\n\t\t\tMechJebModuleManeuverPlanner { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleNodeEditor { unlockTechs = start }\t\t\t// advFlightControl\n\t\t\tMechJebModuleTranslatron { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleWarpHelper { unlockTechs = start }\t\t\t// advFlightControl\n\t\t\tMechJebModuleAttitudeAdjustment { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleThrustWindow { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleRCSBalancerWindow { unlockTechs = start }\t\t// advFlightControl\n\t\t\tMechJebModuleRoverWindow { unlockTechs = start }\t\t// fieldScience\n\t\t\tMechJebModuleAscentGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleLandingGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleSpaceplaneGuidance { unlockTechs = start }\t\t// unmannedTech\n\t\t\tMechJebModuleDockingGuidance { unlockTechs = start }\t\t// advUnmannedTech\n\t\t\tMechJebModuleRendezvousAutopilotWindow { unlockTechs = start }\t// advUnmannedTech\n\t\t\tMechJebModuleRendezvousGuidance { unlockTechs = start }\t\t// advUnmannedTech\n\t\t}\n\t}\n}\n//\n// END OF MM.MechJeb2.MC\u002BKS.\u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026lt;date-version\u0026gt;\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E.cfg\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve already got  RCSBuildAid and Correct \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E... they\u0027re absolute must-haves, imo. Didn\u0027t know about MechJeb natively supporting that function, though.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-08T05:50:29Z","Content":"\n\u003Cp\u003E\nWelp, went back after making sure to turn off the \u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:14px;\u0022\u003E\u0022Tidy up debris cluttering\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Cabbr style=\u0022background-color:#fbfbfb;border-bottom:none;color:#353c41;font-size:14px;\u0022 title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:14px;\u0022\u003E\u0022 option, and sure enough, the cargo canister was still where I left it. Stigmun was quite happy with that, and proceeded to move the remaining 4 canisters over to the launch pad at the Desert airbase.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:14px;\u0022\u003E\u003Cimg alt=\u0022wKdt5WS.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/wKdt5WS.png\u0022 width=\u00221024\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:rgb(251,251,251);\u0022\u003EThe rover\u0027s missing back right wheel was only minor inconvenience at first. The partner of it on the left decided to join it shortly before unloading the canisters shown above...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225R37u1x.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/5R37u1x.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStigmun realized that he could remove the damaged section of the cargo bed and swap it with the one ahead of it, and upon doing so, was able to finish moving the canisters to the launchpad without further issue. He then loaded the rover back aboard the Mallard.\n\u003C/p\u003E\n\u003Cp\u003E\nIt was at this point that he now headed over to the operations office to buy some fuel for the Mallard\u0027s return trip...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220gZTLNb.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/0gZTLNb.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter several minutes of haggling, he managed to get a fair price for the 400 units of \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E he needed to get Fredberry, Hamlin, and himself back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KOSQhKG.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/KOSQhKG.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFredberry, the pilot of the team, wasn\u0027t terribly pleased with the quality of the fuel, which he proclaimed had to have been sitting in that fuel truck for several months. The Mallard didn\u0027t seem to care... \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E is \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JhWcIfN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/JhWcIfN.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter convincing Fredberry that everything was fine, Stigmun returned the rover to its parking spot, left a tip on the seat, and hurried back to the Mallard, ready to go back to the coastal cool breezes of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022opJm0dj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/opJm0dj.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ryycbrf.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ryycbrf.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHamlin took note of the location of some odd looking ruins on the climb out from the airstrip. She and Stigmun, who will form the ground team of the actual expedition, both agreed to visit the location during the journey.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022C4HAsd0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/C4HAsd0.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe cruise home was largely uneventful, aside from not being able to reach the target cruising altitude again, although it was much better than the trip over. Fredberry blames the \u0022questionable\u0022 fuel. Hamlin blames the rover in the cargo hold.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZUThr4J.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ZUThr4J.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TqbiewJ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/TqbiewJ.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E#CrewPortrait. - @Hamster_the_Scientist\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHome, sweet home...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CUvPIus.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/CUvPIus.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dwwsYOt.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/dwwsYOt.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFredberry was a little too fast on approach, so the landing was longer than expected. Nothing that a little taxi back up the runway can\u0027t fix, though.\n\u003C/p\u003E\n\u003Cp\u003E\nReturning to the parking spot, a welcome sight greeted the weary crew:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cOlD4By.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/cOlD4By.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe payload and first stage engine package survived! Huzzah for the new settings.\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew is now taking some down time before making their next flight, this time with the replacement tower... and a repaired rover.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn the meantime, I experimented with the rover design for the expedition in the sandbox. Initial efforts focused on finding ways to make it submersible, but the weight and size penalties were excessive. So, that mission requirement was dropped almost as quickly as it was added. However, those experiments \u003Cem\u003Edid\u003C/em\u003E turn up something useful...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229VCL8na.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/9VCL8na.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/106975-angel-125/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022106975\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/106975-angel-125/\u0022 rel=\u0022\u0022\u003E@Angel-125\u003C/a\u003E\u0027s excellent Buffalo rover pack includes a pair of pumpjet engines for water use. Two of the radial-mount ones, throttled back to 20% rated thrust, are able to push this 6.8 tonne rover to speeds of 10.2 m/s on water.\n\u003C/p\u003E\n\u003Cp\u003E\nI finalized the design, warped to sunrise, then set out on a test voyage to the Island Airfield...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TSbnzoT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/TSbnzoT.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E#whoneedsbridgesanyways?\u003C/em\u003E\u003Cem\u003E - @Jebman_the_Munatic\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHandling is excellent, and it has plenty of fuel  for the fuel cell left over after making the crossing. And, due to the power of the all-wheel drive powertrain on land, it can match, or even exceed, the speeds of Triop\u0027s \u0022Round Kerbind in 80 Days\u0022 buggy series on flat ground.\n\u003C/p\u003E\n\u003Cp\u003E\nAll in all, quite happy with the progress for today. The rover has been ported over to the main save for compatibility checks, and hopefully will be able to get underway as soon as the biome map is finished.\n\u003C/p\u003E\n\u003Cp\u003E\nField support has also been decided upon... I\u0027m going to use either the Mallard (for long-range logisitcal support) or a modified Aeris 3S (Aeris 3 with a Panther) for refueling ops, as the rover only takes 30 \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E in its basic form (the fuel cell uses intake air to react with the \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E), and I can toss in another 50 in a Mk 0 Liquid Fuel Tank if I need more range, such as for large water crossings should I need to do so. I\u0027m currently looking at \u003Ca href=\u0022https://i.imgur.com/Y7MTOqh.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E map for basic planning right now. I\u0027ll start sketching the route onto that as soon as I get the survey satellite up.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-09T02:23:35Z","Content":"\n\u003Cp\u003E\nOkay, time to go-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002250291434_251996909026203_679071331571002\u0022 class=\u0022ipsImage\u0022 height=\u0022640\u0022 src=\u0022https://scontent-sea1-1.cdninstagram.com/vp/51e07ed1437b0be2e9a44b16cf26a8f4/5CDB3908/t51.2885-15/sh0.08/e35/s640x640/50291434_251996909026203_6790713315710024594_n.jpg?_nc_ht=scontent-sea1-1.cdninstagram.com\u0022 width=\u0022640\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n... Nope, not going out today. Nuh-uh.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, more progress was made on Phase 1...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SCZZXIZ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/SCZZXIZ.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLoaded in a replacement set of parts for those that got snapped up by the janitorial crew and proceeded to stage the rocket parts  near the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lecJn30.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/lecJn30.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLoaded up the tower for the launch pad...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229eOX4GI.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/9eOX4GI.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EfZZi0O.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/EfZZi0O.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Pa4npLi.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Pa4npLi.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFueled the Mallard up with the help of Bill and Jeb...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022laJvQr4.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/laJvQr4.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd shipped out for the Desert Airstrip once again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022L8wVWua.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/L8wVWua.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStigmun opted to put together the base of the launchpad first...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WlpEqlp.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/WlpEqlp.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSeveral of the outer pieces are missing due to the loss of a cargo canister... it rolled off the platform and exploded violently upon striking the ground. However, the pad seems stable enough as it is, so we\u0027re not going to replace the missing parts.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter finishing the pad, Stigmun took the tower out of the Mallard and delivered it to the pad.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HtBBPfX.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/HtBBPfX.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cpHSBaL.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/cpHSBaL.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wmb7IIV.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/wmb7IIV.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter nearly an hour of work, the pad was finally ready to receive the rocket, which will fly out on the next mission...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PF29toS.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/PF29toS.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe surviving cargo canisters were loaded aboard the Mallard, while the rover was left behind to make room for the next flight\u0027s cargo.\n\u003C/p\u003E\n\u003Cp\u003E\nA nominal return flight followed, and the team returned to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E just before sundown...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224qA1B6R.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/4qA1B6R.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll in all, an extremely productive hop. Next flight will be delivering the rocket, its propellants, and the propellant tanker to the airstrip, then stacking, fueling, and launching the rocket. After that, I just need to wait for the mapping satellite to do its job. Easy enough, as the Duna launch window is currently fast approaching, and I\u0027m launching a number of missions a little early to spread them out over the arrival window.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-09T07:21:18Z","Content":"\n\u003Cp\u003E\nOne final update for tonight... I did load the rocket parts and a refueling rover into the Mallard\u0027s cargo hold, and loaded the rocket with propellant. I figured that\u0027s probably the best way to transport it rather than loading up a bunch of extra tanks just for the trip. I also refueled the Mallard proper.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022E6UWI5m.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/E6UWI5m.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHowever, while awaiting daylight (and allowing a Duna mission to put some time behind it before launching the next one), Jeb and Bill\u0027s refueling rover vanished from the parking lot outside the Administration Building... with them still inside. The game has them logged as \u003Cabbr title=\u0022Killed in action\u0022\u003EKIA\u003C/abbr\u003E, so god only knows what happened, but I\u0027m running Permadeath, so... they\u0027re not coming back. \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E First time in a long time I\u0027ve suffered a legit LOCV (Loss Of Crew and Vehicle).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat wraps up the antics for today. We\u0027ll see if I can get to work tomorrow, as there\u0027s almost 14 cm of fresh snow on the ground right now, and it\u0027s still falling...\n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2019-02-09T10:20:52Z","Content":"\n\u003Cp\u003E\nEnjoying following your remote rocket building tale.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223537586\u0022 data-ipsquote-contentid=\u0022181951\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549696878\u0022 data-ipsquote-userid=\u002211952\u0022 data-ipsquote-username=\u0022MaverickSawyer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, MaverickSawyer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHowever, while awaiting daylight (and allowing a Duna mission to put some time behind it before launching the next one), Jeb and Bill\u0027s refueling rover vanished from the parking lot outside the Administration Building... with them still inside. The game has them logged as \u003Cabbr title=\u0022Killed in action\u0022\u003EKIA\u003C/abbr\u003E, so god only knows what happened, but I\u0027m running Permadeath, so... they\u0027re not coming back. \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E First time in a long time I\u0027ve suffered a legit LOCV (Loss Of Crew and Vehicle).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhoa. \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E  Jeb and Bill, victims of the Kraken.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EI wonder if this could be caused by the same issues addressed by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167015-whale_2/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167015\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167015-whale_2/\u0022 rel=\u0022\u0022\u003E@whale_2\u003C/a\u003E\u0027s WorldStabilizer.  Perhaps interacting with the ground during a scene change?  If it was within physics range, perhaps you\u0027d see an explosion, but if it\u0027s outside, perhaps \u003C/span\u003E\u003C/span\u003Eit just gets \u0022cleaned\u0022 up.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe start getting Kerbals out of pods and seats and on the ground themselves when not working?  Not that that\u0027s going to be certain to save them.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-09T16:47:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223537639\u0022 data-ipsquote-contentid=\u0022181951\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549707652\u0022 data-ipsquote-userid=\u0022103694\u0022 data-ipsquote-username=\u0022Jacke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Jacke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEnjoying following your remote rocket building tale.\n\u003C/p\u003E\n\u003Cp\u003E\nWhoa. \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E  Jeb and Bill, victims of the Kraken.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EI wonder if this could be caused by the same issues addressed by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167015-whale_2/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167015\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167015-whale_2/\u0022 rel=\u0022\u0022\u003E@whale_2\u003C/a\u003E\u0027s WorldStabilizer.  Perhaps interacting with the ground during a scene change?  If it was within physics range, perhaps you\u0027d see an explosion, but if it\u0027s outside, perhaps \u003C/span\u003E\u003C/span\u003Eit just gets \u0022cleaned\u0022 up.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe start getting Kerbals out of pods and seats and on the ground themselves when not working?  Not that that\u0027s going to be certain to save them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think it has to do with the fact that I had them in a Buffalo rover cab, which has something called \u0022Airpark\u0022. I had enabled that, so... *shrugs* Lesson learned.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-10T08:55:22Z","Content":"\n\u003Cp\u003E\nLadies, gentlekerbals, and children of all ages... I have done it.\n\u003C/p\u003E\n\u003Cp\u003E\nI have built a rocket, in the field, and successfully flown it to a targeted orbit and deployed a useful payload.\n\u003C/p\u003E\n\u003Cp\u003E\nPhase 1 of Stigmun\u0027s Folly is now complete!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s get caught up on the events of the day...\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew, rested and ready to get on with the mission, flew one last delivery run to the Desert Airstrip with the rocket and the fuel rover...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YkHCW1i.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/YkHCW1i.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tX1zuSw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/tX1zuSw.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAgain, wasn\u0027t able to achieve as efficient as a cruise as I would have liked, but I made it with enough fuel to make the trip back.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter landing, the first order of business was to defuel the first stage\u0027s lower tank so that it could be moved to the pad.\n\u003C/p\u003E\n\u003Cp\u003E\nApparently, the Kraken took offense to this level of safety and decided to trash four of the six wheels of the fuel tanker after offloading the fuel into it....\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ktau1NN.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ktau1NN.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat was considered acceptable for the time being, as the fuel itself was safe. The lower part of the stage was then carted over and stacked on the pad without further issue.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VLuF35d.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/VLuF35d.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was also discovered that the upper stage, if split into engine and tank, could be handled safely without defueling. So, Stigmun unloaded them and started over to the pad, only to corner too hard dodging a jakrabbit and rolled the rover. The payload and tanks were fine... but the rover could not be righted safely. Attempts to do so otherwise promptly resulted in the destruction of the two remaining rear wheels on the cargo rover I\u0027d left behind the last time I was there...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iSCOQ2E.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/iSCOQ2E.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThankfully, the locals chipped in a near-identical unit to help the effort... largely to get Stigmun and company out of their hair once and for all. \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FReq3rb.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/FReq3rb.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLikewise, they allowed the team to use their own fuel rover to unload the first stage\u0027s upper tank so it could be driven over to the pad. This was done without issue, and Stigmun was able to stack the rest of the rocket without issue.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226beAf8p.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/6beAf8p.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221RrOUAV.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/1RrOUAV.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EvGgUns.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/EvGgUns.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis new string of success apparently angered the Kraken again, who ate the rear pair of wheels on the new fuel rover as retribution shortly after the fuel from the first wrecked rover got transferred over to the new one. Stigmun... well, I\u0027ll show you, as a picture is worth a thousand words:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022l9XBqOj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/l9XBqOj.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCouldn\u0027t agree with you more, buddy. *headdesk*\n\u003C/p\u003E\n\u003Cp\u003E\nThankfully, some clever reuse of existing parts and rovers allowed Stigmun to move the now-empty fuel tank from the first fuel rover over to the cargo rover, along with the parts needed to pump the fuel. A careful transfer of fuel (and a quicksave/quickload) later, the impromptu tanker delivered the last of the fuel\n\u003C/p\u003E\n\u003Cp\u003E\nStigmun removed the last of the umbilicals and beat a hasty retreat back to the ops building, where he waited until sunset. After all, this is a mapping satellite, which needs a large amount of power for such a small thing. Sun-synchronous (or as close as it gets in KSP) is a must.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bIe9Fx8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/bIe9Fx8.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch, thankfully, had only one hiccup... The Mechjeb autopilot cut out right as the engines lit and the vehicle decoupled from the pad. I had anticipated this and was able to promptly restart the autopilot, and the rest of the ascent was normal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xEjx3UB.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/xEjx3UB.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pUkaRRn.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/pUkaRRn.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022obxeNdn.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/obxeNdn.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228dwsA6J.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/8dwsA6J.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022W4XJgq9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/W4XJgq9.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220o74bAC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/0o74bAC.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinal orbit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jS1iQDK.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/jS1iQDK.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI am extremely happy with how well that went, to be completely honest. I never thought it would be easy, but that was... actually pretty painless, loss of Jeb and Bill notwithstanding. Took a lot of time, both in-game and IRL, and caused me to nearly rage quit several times after repeated visits from our tentacled friend, but that part\u0027s done. Now, to wait for the map to generate, then I can move on to Phase 2... the main road trip.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve come up with a basic route, subject to change as biome information becomes available, but it\u0027ll give you an idea of my plan. Please forgive the shoddy Paint work... all I have is a mouse, and it\u0027s poorly suited for such work...\n\u003C/p\u003E\n\u003Cp\u003E\nOh, and zoom in. Otherwise, it just looks like a regular map.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oHHLqgj.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022512\u0022 src=\u0022https://i.imgur.com/oHHLqgj.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-12T03:30:26Z","Content":"\n\u003Cp\u003E\nWell, the map is complete, so Phase 2 can begin!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ctobSf1.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ctobSf1.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHamlin Kerman, on the left, is the scientist and navigator for the mission. Stigmun, on the right, is the driver and the mechanic.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HNjS1UT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/HNjS1UT.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd we\u0027re off! First stop was to kick around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to check all the systems for issues. A few notable ones were found, chief among them that something was blocking the crew from reaching the aft bay with the science instruments. I think I\u0027ve got it straightened out now, but I haven\u0027t checked it yet. Too excited to get on the road.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, without further ado... to the water!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xVMpExH.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/xVMpExH.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs I type this, I\u0027m about a third of the way to the island. I\u0027ll keep y\u0027all posted as things progress.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-12T06:42:01Z","Content":"\n\u003Cp\u003E\nMade it!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221ouDjYt.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/1ouDjYt.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yqXibbx.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/yqXibbx.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStigmun and Hamlin drove the Jalopy over to the base of the tower, did some science, and watched a Munar eclipse as the sun went down. Not bad for an hour\u0027s work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dtlLZn6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/dtlLZn6.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey\u0027re planning on spending the night on the island, then coming back early tomorrow morning, refueling at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, and setting off to the north.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-13T18:48:29Z","Content":"\n\u003Cp\u003E\nAfter a multi-day delay due to range safety constraints and bad weather, Stigmun and Hamlin are back on the move. Transit back across the Splashdown Straits was achieved without difficulty, and they proceeded to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E launchpad to pick up some more fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EIscuZv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/EIscuZv.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BYsbpK3.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/BYsbpK3.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe fuel tank has been stashed aboard the rover to provide a significant increase in range, as the fuel cell is barely being used at cruise conditions during the day. So, the first refueling in the field is probably going to be a ways off.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAlso found out that the Buffalo Crew Cabin has a monitor inside that you can load up with any images in your screenshots folder... So I copied the preliminary route image to the folder and loaded it up on the screen.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022l3ibtDb.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/l3ibtDb.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGranted, the route\u0027s now completely out of date until after I clear the Desert Airfield and the Temple, but after that... who knows?\n\u003C/p\u003E\n\u003Cp\u003E\nNow that that\u0027s been taken care of, the team headed out to the north, hooking around Booster Bay in an effort to avoid the mountains to the west of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UukHi9g.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/UukHi9g.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere have been several discoveries along the way...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cimg alt=\u00224BZAMdL.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/4BZAMdL.png\u0022 width=\u00221024\u0022\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hey... is that grass???\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Looks like it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I want to taste it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022No, Stigmun. Let\u0027s keep going. There\u0027s a Highlands biome near here we should visit.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Spoilsport.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lUvq1yD.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/lUvq1yD.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAaand that\u0027s where I wrapped up last night IRL. Just getting back to the rover now, so onwards we go! Next planned stop is up north, at the poles... there\u0027s a few untouched biomes up there... and the anomaly sensor picked up a spike of \u003Cem\u003Esomething\u003C/em\u003E up there, so Stigmun and Hamlin are both curious to see what that is.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-13T21:56:44Z","Content":"\n\u003Cp\u003E\nPut down an hour\u0027s in-game time driving earlier...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PbeJv8x.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/PbeJv8x.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Trees??!?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yes, Stigmun. Please try not to slalom through them... You know how I feel about spilling my koffee.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YXZEvG6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/YXZEvG6.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe blue line is the progress made on that leg of the trip after about 30 minutes or so...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Wyx7c9j.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Wyx7c9j.png\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\nSun\u0027s going down, so it\u0027s getting a little dicey to keep driving for now. There\u0027s no rush to complete the journey in any fixed amount of time, so nights will be spent doing other tasks, like prepping the next few modules for my \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E station, planning how to boost it to a higher orbit of 260x260 km for new MOLE science projects... stuff like that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uF0KL8m.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/uF0KL8m.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinal position as night fell. Making respectable time.\n\u003C/p\u003E\n"},{"CreatedByName":"Triop","CreatedById":145841,"CreatedDateTime":"2019-02-13T22:39:40Z","Content":"\n\u003Cp\u003E\nCool mission, a lot of work I guess. \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAbout the locations of the UFO and TEMPLE on your map, they are wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nHere are the right locations \u003Cspan\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226jP5oO7.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/6jP5oO7.jpg\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThere is a Tundra biome on the left of the UFO, maybe you can use this bit of information.\n\u003C/p\u003E\n\u003Cp\u003E\nGoodluck, I\u0027ll be following this. \u003Cimg alt=\u0022^_^\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 title=\u0022^_^\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-13T22:42:07Z\u0022 title=\u002202/13/2019 10:42  PM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 13, 2019\u003C/time\u003E by Triop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-02-13T23:49:54Z","Content":"\n\u003Cp\u003E\nYeah, all I remembered of the UFO\u0027s location was alongside a bay, up the hill a bit. Given how the map smears stuff out up there, and the relatively small actual area, I wasn\u0027t terribly concerned with the precise location. And the temple is really close to the Desert Airstrip, so that was another \u0022ehhh, close enough\u0022. It\u0027s more of a guideline, anyways. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-03-15T05:35:49Z","Content":"\n\u003Cp\u003E\nWell, after a rather lengthy hiatus from KSP to avoid burnout (and to prep for my last final exam in college), I\u0027ve returned to this mission. Due to the fact that I\u0027m running this mission in my science save, and I\u0027ve got the Jool and Duna launch windows open now, I\u0027ve opted to use Bon Voyage to speed the rover\u0027s progress. With that, I\u0027ve actually made some respectable headway over the 22 days that the rover\u0027s been in the field...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HQmHetl.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/HQmHetl.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMade a pit stop in the Tundra biome for obligatory science points... though I forgot that, by replacing the eXoKerbal Core Drill (XKCD, for short) on the aft of the rover, it no longer gets triggered by the action group I bound the rest of the instruments on, so I\u0027ll have to revisit the Tundra just to knock that one out at some point...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YwKqi7a.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/YwKqi7a.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nProceeded to carry on to the frigid wastes of the north in hot pursuit of the Northern Ice Cap and Ice Sheet biomes...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vUFFfUY.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/vUFFfUY.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs well as following the Anomaly I detected in the region: our good friend, Mr. Flying Saucer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222BqkVgL.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/2BqkVgL.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe next planned stop is going to be KSC2, but there\u0027s a slight problem...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XrYWd8J.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/XrYWd8J.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBon Voyage flat out refused to find a way around this, so I spent half an hour slowly picking my way down a slope that, at points, was steeper than 30* down... and that was the gentlest overall grade down I could find.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RNB20RF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/RNB20RF.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221yYVSIC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/1yYVSIC.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHowever, there\u0027s a relatively shallow beach  at the bottom, which is where I\u0027ve left off for now. It\u0027s technically a Shores biome, which I somehow skipped during my adventures around the Island Airfield and the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, so science will be collected from there as well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo, my tally up to this point is as follows:\n\u003C/p\u003E\n\u003Cp\u003E\nBIOMES VISITED:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nIsland Airfield\n\u003C/li\u003E\n\u003Cli\u003E\nOcean\n\u003C/li\u003E\n\u003Cli\u003E\nGrasslands\n\u003C/li\u003E\n\u003Cli\u003E\nHighlands\n\u003C/li\u003E\n\u003Cli\u003E\nTundra\n\u003C/li\u003E\n\u003Cli\u003E\nNorthern Ice Cap\n\u003C/li\u003E\n\u003Cli\u003E\nIce Shelf\n\u003C/li\u003E\n\u003Cli\u003E\nShores (unscienced... for now)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nLOCATIONS VISITED:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIsland Airfield\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nCrashed UFO\n\u003C/li\u003E\n\u003Cli\u003E\nThe big river\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo far, the mission has gone exceedingly well. I\u0027m feeling much more confident about doing similar missions on far-flung planets now. Which is a good thing, as I have a disassembled Buffalo Rover on its way to Duna as I type this. The plan is to pull another grand adventure there, but by then, Stigmun and Hamlin should be home at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-03-19T23:48:32Z","Content":"\n\u003Cp\u003E\nTime for another update...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nShortly after arriving at the edge of the river, I got out to collect some science data that I had missed before. However, during Hamlin\u0027s efforts to get into the utility bay, disaster #1 struck:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tC3M91L.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/tC3M91L.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSomehow, the Kraken was summoned and proceeded to toss the rover some 15 meters into the air and towards the river. This would have been fine had it landed upright and in the water.\n\u003C/p\u003E\n\u003Cp\u003E\nIt did not.\n\u003C/p\u003E\n\u003Cp\u003E\nIt landed on one of the two auxiliary solar panels at the very edge of the water, smashing it into little bits. The rover then proceeded to bounce into the river and come to rest in an upright position (thankfully), and no other parts were damaged. However, it was not exactly an auspicious start to the river crossing attempt.\n\u003C/p\u003E\n\u003Cp\u003E\nSaid river crossing went extremely smoothly, for a change. Made my way over to the other bank at the shallowest spot I could find...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uyAl3Is.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/uyAl3Is.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSaid shallowest spot was ~45* sloped. Should have taken a hint at this point that perhaps I should have taken the long way \u0027round, but to heck with sanity... we\u0027ve got a winch for situations just like this, right?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022niJY7tV.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/niJY7tV.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nxBV5e8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/nxBV5e8.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HWWAvCF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/HWWAvCF.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tLdt9rd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/tLdt9rd.png\u0022 width=\u00221024\u0022\u003EIt actually went very well while the slope was steady. I found out that a CB-1 ground base from \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E with an XKCD on top was more than adequate to keep the rover from sliding back down the hill while I repositioned the base that the cable linked to. Made it up to the change in slope before trouble reared its head...\n\u003C/p\u003E\n\u003Cp\u003E\nAfter making the transition to the shallower ~20 slope at the top of the canyon, I put Stigmun back into the cab and attmepted to drive the Buffalo forwards. Results were promising until I nearly high-centered the rover on the pylon. In the mad scramble to prevent such an occurrence, disaster #2 revealed itself:\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kraken had somehow snuck aboard the rover and had pickpocketed Stigmun as he climbed into the cab. The tools, the ground base and drill, everything he had was gone. Add in teh fact that the rover was now skidding down the slope towards the 45* section again, and I had little choice but to use the AirLand function of the Buffalo, which has historically resulted in the loss of a rover and two Kerbals. Needless to say, I was NOT going to be allowing that to happen again. So, Stigmun got out to reconnect the cable to the base while I figured out what my next move was...\n\u003C/p\u003E\n\u003Cp\u003E\nAnd he tripped.\n\u003C/p\u003E\n\u003Cp\u003E\nHe proceeded to slide all 250 vertical meters and half a kilometer actual distance down the side of the canyon and splashed into the river at 30\u002B m/s. Alive, but definitely wet, unhappy, missing his beloved omnitool, and with a looooong climb back up to the rover, Stigmun opted to call for extraction. (I.E., I recovered him and the rover in the Tracking Station.) The mission isn\u0027t over... but it\u0027s certainly been delayed while some revisions get made to the route and the rover.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m planning on picking this up in a while, after I get through the current spate of launch windows, and will probably be departing from the Desert Airfield for the second attempt.\n\u003C/p\u003E\n"}]}