{"TopicId":187014,"ForumId":51,"TopicTitle":"The Dream Is Alive: Recreating the Space Shuttle Program","CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2019-08-07T04:22:38Z","PageNum":5,"Articles":[{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-07-12T02:42:55Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ESTS-61N \u003Cem\u003EChallenger \u003C/em\u003E\u003C/strong\u003E\u003Cstrong\u003EMission Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pW2mhKF.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022108.00\u0022 height=\u0022432\u0022 width=\u0022400\u0022 src=\u0022https://i.imgur.com/pW2mhKF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQuick Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: Jane Steffensen (CDR), Tamara Mac Reachtain (PLT), Jordon Poole (MS1), Stuart Pryor (MS2), Kirsten Pavletic (MS3), Marie-France Gros, France (PS1), Gudmund Rasmussen, Norway (PS2)\n\u003C/p\u003E\n\u003Cp\u003E\nBackup Crew: Renee Rousseau, France (PS1), Josefine Christiansen, Norway (PS2)\n\u003C/p\u003E\n\u003Cp\u003E\nPayload: Galaxy VI-C commsat, Hot Bird 4C commsat, Freya 1 commsat\n\u003C/p\u003E\n\u003Cp\u003E\nPayload Mass: 6,658 kg\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch: January 21, 1987 0:30:00 from Pad 39A at Kerbal Space Center\n\u003C/p\u003E\n\u003Cp\u003E\nMission Duration: 6d5h54m44s\n\u003C/p\u003E\n\u003Cp\u003E\nLanding: January 28, 1987 0:24:44 at Edwards Air Force Range\n\u003C/p\u003E\n\u003Cp\u003E\nStatistics \u0026amp; Milestones: 50th Space Shuttle mission; 16th flight of \u003Cem\u003EChallenger\u003C/em\u003E; 21st landing at Edwards AFR. Payload Specialist Gudmund Rasmussen became the first Norwegian kerbal to fly in space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENarrative Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kerbal Space Shuttle program reached a major milestone on STS-51N with its 50th mission.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first launch attempt, for a predawn launch on January 18, was scrubbed due to frigid temperatures at the Edwards AFR emergency landing site. Due to more than a week of forecast freezing overnight temperatures at Edwards, mission managers elected to retarget the launch for mid-morning Edwards time, when the temperature should have exceeded the safety threshold for shuttle operations.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter one more delay due to rain at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, \u003Cem\u003EChallenger\u003C/em\u003E lifted off on the third launch attempt on January 21 with a cargo of three international communications satellites. The orbiter was inserted into an initial 57x121km orbit. The crew completed an OMS burn at MET 16m to place Challenger into a 72x121km orbit, inclination 0.5 degrees, period 32m24s. At MET 22m54s the #3 oxidizer tank in the orbiter aft compartment began leaking; the crew were able to transfer most of the contents into other tanks, but due to the low Delta-v necessary for the orbit insertion burn there was insufficient room and ~1/8 of the tank\u0027s contents were lost to space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg alt=\u00229xp5SiO.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/9xp5SiO.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe ascent was less efficient and reached a lower apoapsis than planned, leaving Challenger with insufficient fuel plus monopropellant margin for a \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E landing, and so mission managers determined to target a more forgiving landing at Edwards. At MET 4h52m the crew completed an OMS burn to raise the orbit to 72x199km. At MET 5h09m02s, one of the monopropellant tanks aboard Freya 1 began leaking. At MET 5h10m the crew completed a second OMS burn to circularize the orbit to 195x206km, period 39m56s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg alt=\u0022IJ7wq72.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/IJ7wq72.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAt MET 2d1h15m26s the #13 liquid fuel tank in the orbiter aft compartment began leaking. At MET 2d1h18m01s one of the antennas on Freya 1 failed. Mission managers added a spacewalk to Flight Day 5 to fix the antenna, and extended the mission by one day to compensate. Galaxy VI-C was deployed from the payload bay at MET 2d1h18m18s. The first stage PAM burn placed the payload into a 198x2,920km transfer orbit. It reached its operational orbit the next day.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg alt=\u0022a14qCHC.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/a14qCHC.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHot Bird 4C was deployed from the payload bay at MET 2d4h45m23s. The first PAM burn one orbit later placed it into a 205x2,770km transfer orbit. Soon thereafter it reached its operational geosynchronous orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nJordon Poole exited the airlock at MET 3d5h19m00s, followed by Kirsten Pavletic at MET 3d5h20m45s. Poole successfully repaired the antenna and patched the leaky monopropellant tank on Freya 1, and then the astronauts retreated outside. The total EVA time was 3m00s for Pavletic and 5m17s for Poole.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg alt=\u002252fmq89.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/52fmq89.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAt MET 4d4h06m02s the internal battery in the #2 fuel cell short-circuited. Freya 1 was deployed from the payload bay at MET 4d5h32m49s. The lower stage PAM burn placed it into a 208x2,882km transfer orbit. Although the second PAM burn was successful, a software error caused the first \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E burn to initially be in the wrong direction, raising the apoapsis to 3,900 km before the error was caught. Due to the earlier monopropellant leak that had depleted half of the spacecraft\u0027s monopropellant, it exhausted its propellant when it had reached an orbital period of 5h59m19s, 10 second longer than geosynchronous. This would cause an unacceptable rate of drift from the satellite\u0027s perch over Norway, rendering it useless. The spacecraft\u0027s owner, NorSatCom, immediately ordered a replacement spacecraft, Freya 1R, and secured a launch slot on a future shuttle mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg alt=\u0022F31Pqz8.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/F31Pqz8.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAt MET 5d4h39m the crew completed an OMS burn to lower the orbit to 99x198km, and a second at MET 5d4h57m to circularize the orbit to 96x103km, period 32m36s, in preparation for reentry the next day.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cspan style=\u0022font-style:normal;\u0022\u003E\u003Cspan style=\u0022text-decoration:none;\u0022\u003EThe crew closed the payload bay doors at MET 6d5h15m in preparation for the first landing attempt. The weather was go. The three-and-a-half-minute-long \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E-assisted OMS deorbit burn concluding at MET 6d5h33m was only able to lower the periapsis to 17 km. Entry interface occurred at MET 6d5h38m30s. The orbiter experienced an unusual degree of pitch oscillations during re-entry, but this did not affect vehicle safety. Steffensen and Mac Reachtain brought \u003C/span\u003E\u003C/span\u003E\u003Ci\u003E\u003Cspan style=\u0022text-decoration:none;\u0022\u003EChallenger\u003C/span\u003E\u003C/i\u003E\u003Cspan style=\u0022font-style:normal;\u0022\u003E\u003Cspan style=\u0022text-decoration:none;\u0022\u003E in for a smooth landing at Edwards Air Force Range with wheel stop at MET 6d5h54m44s.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg alt=\u0022lR0nGXu.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/lR0nGXu.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cspan style=\u0022font-style:normal;\u0022\u003E\u003Cspan style=\u0022text-decoration:none;\u0022\u003E\u003Cstrong\u003ENext Up: \u003C/strong\u003E\u003Cem\u003EAtlantis\u003C/em\u003E is standing ready on Pad 39B with another cargo of commsats. It is scheduled to launch on mission STS-61K on January 32.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-12T02:48:23Z\u0022 title=\u002207/12/2020 02:48  AM\u0022 data-short=\u00223 yr\u0022\u003EJuly 12, 2020\u003C/time\u003E by ShuttleHugger\u003C/strong\u003E\n\u003Cbr\u003EAdded the backup crew to the summary, which I\u0026#039;d forgotton on the first pass\n\u003C/span\u003E\n"},{"CreatedByName":"JakGamingKSP","CreatedById":163649,"CreatedDateTime":"2020-07-17T02:24:52Z","Content":"\n\u003Cp\u003E\nWill you do Vandenberg missions as they planned to before challenger?\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-07-18T04:05:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223821833\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221594952692\u0022 data-ipsquote-userid=\u0022163649\u0022 data-ipsquote-username=\u0022JakGamingKSP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/16/2020 at 10:24 PM, JakGamingKSP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWill you do Vandenberg missions as they planned to before challenger?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI already am! Three flown so far: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/187014-the-dream-is-alive-recreating-the-space-shuttle-program/\u0026amp;do=findComment\u0026amp;comment=3793444\u0022 rel=\u0022\u0022\u003ESTS-62A\u003C/a\u003E, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/187014-the-dream-is-alive-recreating-the-space-shuttle-program/\u0026amp;do=findComment\u0026amp;comment=3802471\u0022 rel=\u0022\u0022\u003ESTS-62B\u003C/a\u003E, and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/187014-the-dream-is-alive-recreating-the-space-shuttle-program/\u0026amp;do=findComment\u0026amp;comment=3814536\u0022 rel=\u0022\u0022\u003ESTS-62C\u003C/a\u003E. I\u0027m using the Dessert Launch Site as my Vandenburg analog.\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-07-18T23:42:28Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ESTS-61K \u003Cem\u003EAtlantis\u003C/em\u003E Mission Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sCzNanb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.00\u0022 height=\u0022436\u0022 width=\u0022400\u0022 src=\u0022https://i.imgur.com/sCzNanb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQuick Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: Nigel Simonis (CDR), Mindy Ibrahimovic (PLT), Georgia Fuentes (MS1), Justin Teague (MS2), Richard Thorpe (MS3), Govinda Patil, India (PS1), Elsa Eilerts (PS2)\n\u003C/p\u003E\n\u003Cp\u003E\nBackup Crew: Vivek Tamboli, India (PS1), Zlatko Del Bosque (PS2)\n\u003C/p\u003E\n\u003Cp\u003E\nPayload: INSAT 1-B commsat, BusinessLink 2 commsat\n\u003C/p\u003E\n\u003Cp\u003E\nPayload Mass: 6,299 kg\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch: January 32, 1987 3:30:00 from Pad 39B at Kerbal Space Center\n\u003C/p\u003E\n\u003Cp\u003E\nMission Duration: 5d1h56m29s\n\u003C/p\u003E\n\u003Cp\u003E\nLanding: February 1, 1987 5:26:29 at Kerbal Space Center\n\u003C/p\u003E\n\u003Cp\u003E\nStatistics \u0026amp; Milestones: 51st Space Shuttle mission; 7th flight of \u003Cem\u003EAtlantis\u003C/em\u003E; 10th night launch of the Space Shuttle program; 9th Space Shuttle launch from Pad 39B; 27th landing at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. January 1987 marked the first month to see four space shuttle launches, and had STS-61K landed on schedule it would have seen four full shuttle flights.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENarrative Summary: \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew of this flight included Govinda Patil of India, the second Indian kerbal to fly in space (the first flew to the SSSR Salyut 7 space station in 1984), and journalist Elsa Eilerts, the second kerbal to fly through the Civilians in Space program. This was also the most delayed shuttle flight to date; when originally manifested it was planned to launch on April 34, 1986, and was within two months of launching in the summer of 1986 when it was repeatedly delayed, first to allow the Hubble Space Telescope to launch first, and then to allow Ulysses to launch.\n\u003C/p\u003E\n\u003Cp\u003E\nSTS-61K experienced better luck once the shuttle actually reached the launch pad; \u003Cem\u003EAtlantis\u003C/em\u003E lifted off into the night on the first opportunity on January 32. MECO occurred just after orbital sunrise, leaving \u003Cem\u003EAtlantis \u003C/em\u003Ein an initial 36x255km orbit. At MET 19m the crew completed the OMS orbit insertion burn to place the orbiter in a 73x255km orbit, inclination 1.1 degrees, period 40m10s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022p5FiU7e.png\u0022 src=\u0022https://i.imgur.com/p5FiU7e.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew completed an OMS burn at MET 4h58m to lower the orbit to 73x199km, and a second at MET 5h15m to raise and circularize the orbit to 196x210km. Soon thereafter they activated the six GAS cannisters in the payload bay. At MET 1d0h24m09s, one of the six secondary antennas aboard BusinessLink 2 failed, necessitating a repair spacewalk. This was scheduled for Flight Day 4 and the mission extended by one day as a result.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022swqEwzm.png\u0022 src=\u0022https://i.imgur.com/swqEwzm.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;font-style:normal;\u0022\u003E\n\u003Cspan style=\u0022text-decoration:none;\u0022\u003EAt MET 1d5h46m17s the battery in one of INSAT 1-B\u0027s probe cores short-circuited, but the position of INSAT in the forward position in the payload bay prevented spacewalkers from egressing the airlock while it was in place, and consequently prevented in-orbit repair. INSAT was deployed from the payload bay at MET 2d0h32m28s. The PAM first stage burn placed the satellite into a 198x2,865km transfer orbit. The upper stage PAM burn plus three \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E burns over the next day put it into its operational orbit.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;font-style:normal;\u0022\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u00224rw4UCf.png\u0022 src=\u0022https://i.imgur.com/4rw4UCf.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;font-style:normal;\u0022\u003E\n\u003Cspan style=\u0022text-decoration:none;\u0022\u003EAt MET 2d4h04m58s the #18 liquid fuel tank in the orbiter aft compartment began leaking. At MET 2d4h08m17s the orbiter flight deck carbon dioxide retention manifold began leaking to space. The crew were able to redirect the CO2 scrubber flow to avoid venting the cabin atmosphere to space, but a second such failure would violate flight rules and require an emergency return to Kerbin. Georgia Fuentes exited the airlock at MET 2d5h08m30s, followed by Justin Teague one minute later. Fuentes successfully repaired the broken antenna on BusinessLink 2, and then the spacewalkers returned inside the shuttle. EVA time was 2m10s for Teague, and 3m41s for Fuentes.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;font-style:normal;\u0022\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022jgSTlPE.png\u0022 src=\u0022https://i.imgur.com/jgSTlPE.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;font-style:normal;\u0022\u003E\n\u003Cspan style=\u0022text-decoration:none;\u0022\u003EAt MET 3d4h01m33s the #15 oxidizer tank in the orbiter aft compartment began leaking. BusinessLink 2 was deployed from the payload bay at MET 3d5h18m20s. The first stage PAM burn one orbit later placed it into a 196x2,676km transfer orbit; the BusinessLink satellites are so heavy that even the most powerful PAM on the market is not quite capable of getting them to geosynchronous orbit even from the highest orbit the shuttle is capable of. 2m2s after the PAM lower stage was discarded, one of the large batteries aboard BusinessLink 2 short-circuited. It reached its operational geosynchronous perch the next day.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;font-style:normal;\u0022\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022f3GDeAb.png\u0022 src=\u0022https://i.imgur.com/f3GDeAb.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;font-style:normal;\u0022\u003E\n\u003Cspan style=\u0022text-decoration:none;\u0022\u003EAt MET 4d4h25m the crew completed an \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E-assisted OMS burn to lower the orbit to 100x214km, and a second at MET 4d4h44m to circularize the orbit to 96x105km in preparation for landing. The crew then prepared for landing, and a forecast 39% chance of rain at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E held off for the planned landing time. At MET 5d0h59m41s, while the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters were burning for the deorbit burn and seconds before the OMS engines were to light, the #7 oxidizer tank in the orbiter aft compartment began leaking. The OMS burn was aborted in order to avoid any possibility of igniting leaking vapors and causing an explosion. The orbiter was left in a 71x103km orbit, and the crew opened the payload bay doors and prepared for another landing attempt on the next orbit. They closed the payload bay doors again at MET 5d1h19m. The crew completed the deorbit burn on the second attempt at MET 5d1h34m. Entry interface occurred at MET 5d1h39m58s. Simonis and Ibrahimovic brought \u003C/span\u003E\u003Ci\u003E\u003Cspan style=\u0022text-decoration:none;\u0022\u003EAtlantis\u003C/span\u003E\u003C/i\u003E\u003Cspan style=\u0022text-decoration:none;\u0022\u003E in for a hard landing at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E with wheel stop at MET 5d1h56m29s.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;font-style:normal;\u0022\u003E\n\u003Cstrong\u003ENext Up: \u003C/strong\u003E\u003Cem\u003EDiscovery \u003C/em\u003Eis scheduled to launch on February 34 on mission STS-72A, carrying the first batch of operational GPS satellites.\n\u003C/p\u003E\n"},{"CreatedByName":"KerballingSmasher","CreatedById":195689,"CreatedDateTime":"2020-07-19T16:02:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223822750\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595115748\u0022 data-ipsquote-userid=\u0022199277\u0022 data-ipsquote-username=\u0022ShuttleHugger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, ShuttleHugger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIbrahimovic\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n*insert Zlatan joke*\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-07-19T23:28:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223822995\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595174544\u0022 data-ipsquote-userid=\u0022195689\u0022 data-ipsquote-username=\u0022Kerballing (Got Dunked On)\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Kerballing (Got Dunked On) said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n*insert Zlatan joke*\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XS5LK.gif\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002253.80\u0022 height=\u0022269\u0022 width=\u0022500\u0022 src=\u0022https://i.imgur.com/XS5LK.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI randomly generate the astronaut names, which sometimes unintentionally reference IRL famous people.\n\u003C/p\u003E\n"},{"CreatedByName":"KerballingSmasher","CreatedById":195689,"CreatedDateTime":"2020-07-20T21:10:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223823207\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595201338\u0022 data-ipsquote-userid=\u0022199277\u0022 data-ipsquote-username=\u0022ShuttleHugger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, ShuttleHugger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XS5LK.gif\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002253.80\u0022 height=\u0022269\u0022 width=\u0022500\u0022 src=\u0022https://i.imgur.com/XS5LK.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI randomly generate the astronaut names, which sometimes unintentionally reference IRL famous people.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh thank god I was so afraid I was gonna have to explain it XD\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-07-22T02:05:57Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ESoyuz TM-5 \u003Cem\u003EYastreb\u003C/em\u003E Launch Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jwPAkc8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022400\u0022 width=\u0022400\u0022 src=\u0022https://i.imgur.com/jwPAkc8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQuick Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: Vasilisa Kalnins (CDR), Georgiy Bogomolov (FE), Wedad Zaman, Syria (RC)\n\u003C/p\u003E\n\u003Cp\u003E\nBackup Crew: Petras Vinogradov (CDR), Gerasim Romanov (FE), Hadiyya Abbas, Syria (RC)\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch: February 19, 1987 1:45:44 from Site 33 at Woomerang Cosmodrome\n\u003C/p\u003E\n\u003Cp\u003E\nDocking: February 20, 1987 2:36:44 at Svoboda\u0027s aft port\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENarrative Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Mishchenie 27 freighter undocked from Svoboda at 1:05:00 on February 17 and dropped itself into the Pacific Ocean for disposal, thus opening a docking port for Soyuz TM-5.\n\u003C/p\u003E\n\u003Cp\u003E\nSoyuz TM-5, callsign \u003Cem\u003EYastreb\u003C/em\u003E, lifted off from Woomerang Cosmodrome on February 19. This was the first Soyuz rotation flight to Svoboda, allowing the EO-3 crew launched on Soyuz TM-4 to remain in space for longer than their spacecraft was rated for. This was also the first Interkosmos flight to Svoboda, carrying Syrian Air Force pilot Wedad Zaman for a week-long stay aboard Svoboda, during which time he would conduct a variety of experiments.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022e8JuLAH.png\u0022 src=\u0022https://i.imgur.com/e8JuLAH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch placed the spacecraft into a 94x155km preliminary orbit, inclined by 0.9 degrees with respect to that of Svoboda. The crew completed a burn at 2:05 to align their orbit with that of Svoboda. At 1:48 on February 20 they made another burn to adjust the orbit to 102x155km and set up a pass by Svoboda at 1 km distance and 45.5 m/s Delta v one orbit later. It docked to Svoboda\u0027s aft port at 2:36:44. One orbit later the crew opened the hatches and Kalnins, Bogomolov, and Zaman greeted Filipp Sokolovsky, Anastasiya Chayka, and Anna Ignatova aboard the station and began a week of joint operations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022UYSaSkI.png\u0022 src=\u0022https://i.imgur.com/UYSaSkI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ESoyuz TM-4 \u003Cem\u003EAlmaz\u003C/em\u003E Landing Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQuick Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: Vasilisa Kalnins (CDR), Georgiy Bogomolov (FE), Wedad Zaman, Syria (RC)\n\u003C/p\u003E\n\u003Cp\u003E\nUndocking: February 28, 1987 2:16:30\n\u003C/p\u003E\n\u003Cp\u003E\nLanding: February 28, 1987 3:03:12\n\u003C/p\u003E\n\u003Cp\u003E\nMission Duration: 119d5h43m51s (spacecraft), 9d1h18m28s (crew)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENarrative Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn February 28, 1987, the downgoing crew of Kalnins, Bogomolov, and Zaman boarded Soyuz TM-4 and bid farewell to Sokolovsky, Chayka, and Ignatova aboard Svoboda. They undocked at 2:16:30. They completed the deorbit burn at 2:48, and experienced a nominal re-entry. The parachute failed to deploy automatically, but the crew were able to deploy it manually at an altitude of ~1.5 km. They splashed down at 3:03:12 in the southern Indian Ocean, at 6d4h52m S, 149d20m08s E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022yEsjN7k.png\u0022 src=\u0022https://i.imgur.com/yEsjN7k.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"billbobjebkirk","CreatedById":104713,"CreatedDateTime":"2020-07-30T17:46:57Z","Content":"\n\u003Cp\u003E\nWhat are your plans for Space Station Liberty\u0027s design? Will she be closer to the IRL ISS, Bush Era Freedom, Dual Keel, or one of the even earlier design studies?\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-07-31T02:15:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828544\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596131217\u0022 data-ipsquote-userid=\u0022104713\u0022 data-ipsquote-username=\u0022billbobjebkirk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, billbobjebkirk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat are your plans for Space Station Liberty\u0027s design? Will she be closer to the IRL ISS, Bush Era Freedom, Dual Keel, or one of the even earlier design studies?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think it\u0027s going to be somewhere between the IRL ISS and the Bush-era Space Station Freedom design. I\u0027m planning to use the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/133501-16x-habtech2-stockalike-iss-parts-020-solar-arrays-truss-radiators-release/\u0022 rel=\u0022\u0022\u003EHabTech2 mod\u003C/a\u003E for the truss, so that will be basically identical to the ISS. The module configuration will be more like the later Freedom designs than the ISS. This is my current planned (subject to change) module configuration (left is front view, right is top view):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022M60tOq6.png\u0022 src=\u0022https://i.imgur.com/M60tOq6.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI particularly like the Freedom design feature of two parallel modules, so I use that in several places.\n\u003C/p\u003E\n\u003Cp\u003E\nGiven my rate of progress on the missions so far, though, it may be up to another IRL year before I even start building the station...\n\u003C/p\u003E\n"},{"CreatedByName":"billbobjebkirk","CreatedById":104713,"CreatedDateTime":"2020-07-31T03:57:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828793\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596161702\u0022 data-ipsquote-userid=\u0022199277\u0022 data-ipsquote-username=\u0022ShuttleHugger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, ShuttleHugger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think it\u0027s going to be somewhere between the IRL ISS and the Bush-era Space Station Freedom design. I\u0027m planning to use the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/133501-16x-habtech2-stockalike-iss-parts-020-solar-arrays-truss-radiators-release/\u0022 rel=\u0022\u0022\u003EHabTech2 mod\u003C/a\u003E for the truss, so that will be basically identical to the ISS. The module configuration will be more like the later Freedom designs than the ISS. This is my current planned (subject to change) module configuration (left is front view, right is top view):\n\u003C/p\u003E\n\u003Cp\u003E\n-\u003Cem\u003Eimage snip-\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI particularly like the Freedom design feature of two parallel modules, so I use that in several places.\n\u003C/p\u003E\n\u003Cp\u003E\nGiven my rate of progress on the missions so far, though, it may be up to another IRL year before I even start building the station...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI see!. I was personally hoping for a Dual Keel, but this configuration should be awesome enough to tide me over. (Also probably a lot easier for you to construct).\n\u003C/p\u003E\n\u003Cp\u003E\nAnd hey, given how many delays the real thing had in its design process, I suppose its only fitting for this to take a good long time to get out of the gate, lol\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-08-01T02:16:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828836\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596167835\u0022 data-ipsquote-userid=\u0022104713\u0022 data-ipsquote-username=\u0022billbobjebkirk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, billbobjebkirk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI see!. I was personally hoping for a Dual Keel, but this configuration should be awesome enough to tide me over. (Also probably a lot easier for you to construct).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI do like the Dual Keel design, but given the amount of effort that I need to put into every flight (especially complex missions like the assembly flights will be) I didn\u0027t want to be overambitious. It\u0027s already going to take me at least 23 missions to assemble, so at least 6 months of IRL time (practically more because they\u0027ll be interspersed with other flights).\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-08-08T04:22:15Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EKvant Launch Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQuick Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: None\n\u003C/p\u003E\n\u003Cp\u003E\nPayload: Kvant Laboratory Module; Kvant Transfer Module\n\u003C/p\u003E\n\u003Cp\u003E\nPayload mass: 8,917 kg; lab module only: 7,192 kg\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch: March 1, 1987 1:32:15 from Site 42 at Woomerang Cosmodrome\n\u003C/p\u003E\n\u003Cp\u003E\nLauncher: Neitron\n\u003C/p\u003E\n\u003Cp\u003E\nDocking: March 2, 1987 0:42:42 to Svoboda\u0027s aft port\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENarrative Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn February 31, the Svoboda EO-3 crew of Sokolovsky, Chayka, and Ignatova boarded Soyuz TM-5 and closed the hatches to Svoboda. They undocked from the aft port at 1:54:00 and backed away to a distance of 40 m. They paused the spacecraft there while Svoboda rotated itself to present the forward port towards the Soyuz. They redocked to the forward port at 2:04:09, 10m09s after undocking. This would be the last time that the Svoboda core module would be in free flight with no docked modules or spacecraft. This maneuver cleared the aft port for the launch of the Kvant module four days later.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first additional module for space station Svoboda, the Kvant laboratory module, lifted off aboard a Neitron rocket on March 1. In addition to laboratory space and equipment, it carried some 70 days\u0027 worth of supplies for the station crew. Kvant itself was not designed for free flight, and so it was launched attached to a Transfer Module (derived from the Soyuz/Mishchenie service module) to steer it safely to the station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022LxYsJG8.png\u0022 src=\u0022https://i.imgur.com/LxYsJG8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA smooth ascent placed the module and upper stage into an initial 72x111km orbit inclined 0.5 degrees with respect to that of Svoboda. At 1:44 the Neitron upper stage relit to zero out Kvant\u0027s inclination with respect to Svoboda. Kvant and its transfer stage then separated from the upper stage to proceed with the rendezvous. At 2:15 it performed a burn to raise its orbit to 72x155km and set up a rendezvous sequence with Svoboda. At 5:53 it performed another burn to set up a 1.0 km pass by Svoboda one orbit later at a relative velocity of 50.3 m/s. Kvant commenced the terminal rendezvous sequence at 0:28 on March 2. Kvant docked to the aft port of Svoboda at 0:42:42.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022g0J7A4j.png\u0022 src=\u0022https://i.imgur.com/g0J7A4j.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt 1:38 the built-in battery in the Kvant aft compartment short-circuited. Soon thereafter the EO-3 crew opened the hatches and entered Kvant for the first time on-orbit. At 1:14 on March 3 the crew deployed Kvant\u0027s own solar arrays. Kvant\u0027s transfer module was undocked at 0:53:00 on March 4. Shortly thereafter it performed a maneuver to dispose of itself in the Pacific Ocean. After disposal of the transfer module, Svoboda and its docked spacecraft had a total mass of 20,360 kg.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u002230J2MwJ.png\u0022 src=\u0022https://i.imgur.com/30J2MwJ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"billbobjebkirk","CreatedById":104713,"CreatedDateTime":"2020-08-09T16:15:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223829471\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596248160\u0022 data-ipsquote-userid=\u0022199277\u0022 data-ipsquote-username=\u0022ShuttleHugger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/31/2020 at 9:16 PM, ShuttleHugger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI do like the Dual Keel design, but given the amount of effort that I need to put into every flight (especially complex missions like the assembly flights will be) I didn\u0027t want to be overambitious. It\u0027s already going to take me at least 23 missions to assemble, so at least 6 months of IRL time (practically more because they\u0027ll be interspersed with other flights).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHave you considered using a Shuttle C to launch larger and heavier payloads so you don\u0027t have to do as many flights? I Believe that was what NASA was planning to do for Freedom.\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-08-14T01:57:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223834908\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596989710\u0022 data-ipsquote-userid=\u0022104713\u0022 data-ipsquote-username=\u0022billbobjebkirk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/9/2020 at 12:15 PM, billbobjebkirk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHave you considered using a Shuttle C to launch larger and heavier payloads so you don\u0027t have to do as many flights? I Believe that was what NASA was planning to do for Freedom.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s not really on my radar for the Station--I want to build it more like the ISS actually was--but I would consider using a Shuttle C for the Duna program I have notionally planned for the late 90s or early 00s.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerminator K-100","CreatedById":204357,"CreatedDateTime":"2020-08-14T15:21:24Z","Content":"\n\u003Cp\u003E\nI\u0027m really liking these patches! They look super cool and are really well detailed!\n\u003C/p\u003E\n\u003Cp\u003E\nHow do you make them? They almost look hand drawn.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso I like the shuttle design, I am trying to build my own but they usually flip over at launch. \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: How do you do the problems that some missions have? Things like this:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223834011\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596860535\u0022 data-ipsquote-userid=\u0022199277\u0022 data-ipsquote-username=\u0022ShuttleHugger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/8/2020 at 12:22 AM, ShuttleHugger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAt 1:38 the built-in battery in the Kvant aft compartment short-circuited\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nor\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223822750\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595115748\u0022 data-ipsquote-userid=\u0022199277\u0022 data-ipsquote-username=\u0022ShuttleHugger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/18/2020 at 7:42 PM, ShuttleHugger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFuentes successfully repaired the broken antenna on BusinessLink 2\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIs it just something you add or is it a random problem generator or something?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-14T15:26:10Z\u0022 title=\u002208/14/2020 03:26  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 14, 2020\u003C/time\u003E by Kerminator1000\u003C/strong\u003E\n\u003Cbr\u003EAdded a question\n\u003C/span\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-08-15T01:06:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223837955\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221597418484\u0022 data-ipsquote-userid=\u0022204357\u0022 data-ipsquote-username=\u0022Kerminator1000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Kerminator1000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m really liking these patches! They look super cool and are really well detailed!\n\u003C/p\u003E\n\u003Cp\u003E\nHow do you make them? They almost look hand drawn.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks! Most of them are hand-drawn, at least partially. For most of the patches, I first draw the main elements with pencil on paper, and then scan them. I use GIMP to composite everything together, and add the color, text, and geometric shapes. A few of the patches are purely digital compositions, usually because they require angles of the shuttle that my limited artistic skills aren\u0027t up to reproducing; in those cases I digitally trace over a screenshot to get the perspective I want.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223837955\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221597418484\u0022 data-ipsquote-userid=\u0022204357\u0022 data-ipsquote-username=\u0022Kerminator1000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Kerminator1000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso I like the shuttle design, I am trying to build my own but they usually flip over at launch. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt took me dozens of test flights in another save game to get the design right before STS-1. The wings on my external tank were my way of keeping it from flipping on launch.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223837955\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221597418484\u0022 data-ipsquote-userid=\u0022204357\u0022 data-ipsquote-username=\u0022Kerminator1000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Kerminator1000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow do you do the problems that some missions have?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe malfunctions are produced by the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/178973-19x-dang-it-continued/\u0026amp;tab=comments#comment-2845361\u0022 rel=\u0022\u0022\u003EDangIt! Continued\u003C/a\u003E mod.\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-08-16T01:18:57Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ESTS-72A \u003Cem\u003EDiscovery\u003C/em\u003E Mission Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GtsKOd0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002297.25\u0022 height=\u0022389\u0022 width=\u0022400\u0022 src=\u0022https://i.imgur.com/GtsKOd0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQuick Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: Eddie Schuchardt (CDR), Quinn Anker (PLT), Cecilia Trevis (MS1), Elizabeth Britton (MS2), Martina Moreno (PS1), Bedwyr Slovak (PS2)\n\u003C/p\u003E\n\u003Cp\u003E\nPayload: GPS II-1, GPS II-2, GPS II-3 Global Positioning System satellites\n\u003C/p\u003E\n\u003Cp\u003E\nPayload Mass: 7,998 kg\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch: March 8, 1987 0:30:00 from SLC-6 at Dessert AFB\n\u003C/p\u003E\n\u003Cp\u003E\nMission Duration: 5d5h51m48s\n\u003C/p\u003E\n\u003Cp\u003E\nLanding: March 14, 1987 0:21:48 at Dessert AFB\n\u003C/p\u003E\n\u003Cp\u003E\nStatistics \u0026amp; Milestones: 52nd Space Shuttle mission; 12th flight of \u003Cem\u003EDiscovery\u003C/em\u003E; 4th launch from and 3rd landing at Dessert AFB; 11th dedicated DOD mission, and first of these to be unclassified. The 25th spacewalk of the Space Shuttle program took place on this flight. Pilot Quinn Anker and Mission Specialist Cecilia Trevis became the first members of KSP Astronaut Group 11 (selected 1985) to fly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENarrative Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe first launch opportunity, on March 1, 1987 (pushed back one day due to forecast rain on February 34), was scrubbed at T-1h03m. While the crew were ingressing the orbiter, the external tank developed a hydrogen leak. Troubleshooting and fixing the problem took four days, plus time to roll the Shuttle Assembly Building (SAB) on and back.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EDiscovery\u003C/em\u003E lifted off on the second launch opportunity one week later. The orbiter was placed in an initial 20x234km orbit, after an ascent marred only by some issues with the flight control software briefly locking repeatedly. At MET 6m48s the #3 oxidizer tank began leaking; as the orbiter had not yet used any of its own fuel, all of the contents were lost to space. An OMS burn at MET 17m placed \u003Cem\u003EDiscovery \u003C/em\u003Einto a 72x234km orbit, inclination 66.5 degrees, period 36m24s. At MET 32m57s one of the antennas aboard GPS II-1 failed, but as this satellite occupied the forward position in the payload bay on-orbit repair was not possible. At MET 2d04h05m one of the probe core batteries aboard GPS II-3 failed, triggering a repair spacewalk and a one-day extension to the mission. At MET 2d07m58s one of the monopropellant tanks aboard GPS II-3 began leaking.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u00226sA3O4M.png\u0022 src=\u0022https://i.imgur.com/6sA3O4M.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew conducted an OMS burn at MET 4m50s to lower the orbit to 71x99km, and a second \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E-assisted OMS burn at MET 5m04s to circularize the orbit to 98x99km, period 32m32s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022Of4VEe5.png\u0022 src=\u0022https://i.imgur.com/Of4VEe5.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGPS II-1 was deployed from the payload bay at MET 1d5h20m15s. Five minutes later, one GPS II-1 had drifted to a distance of half a kilometer from the shuttle, its lower PAM stage ignited to place it into a 99x1,473km transfer orbit. Over the next few hours the upper stage PAM burn and two \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E maneuvers placed it into its operational 1,581x1,583km orbit, period 2h59m35s. At MET 2d2h01m16s one of the antennas on GPS II-3 failed; its repair was added to the agenda for the EVA.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u00221YYQJLx.png\u0022 src=\u0022https://i.imgur.com/1YYQJLx.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGPS II-2 was deployed from the payload bay at MET 2d4h47m52s, and the PAM lower stage was ignited several minutes later when the phase angle with respect to GPS II-1 equaled the planned value of 21.4 degrees. Just before the second \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E burn to insert GPS II-2 into its operational orbit, one of its onboard antennas failed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022yKsqvi4.png\u0022 src=\u0022https://i.imgur.com/yKsqvi4.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCecilia Trevis exited the airlock at MET 3d4h38m15s, followed by Elizabeth Britton one minute later. Trevis repaired the shorted battery and broken antenna aboard GPS II-3, and patched the leaky monopropellant tank. The spacewalkers then retreated inside \u003Cem\u003EDiscovery\u003C/em\u003E. EVA time was 3m55s for Britton and 5m28s for Trevis.\n\u003C/p\u003E\n\u003Cp\u003E\nAt MET 4d4h43m38s another one of the antennas aboard GPS II-3 failed. Mission managers decided to go ahead with deployment rather than stage another spacewalk. At MET 4d4h45m34s the #15 liquid fuel tank in the orbiter aft compartment began leaking, less than a minute before GPS II-3 was scheduled to be deployed; the deployment was put off for one orbit to allow the crew time to focus on the malfunction. GPS II-3 was finally deployed from the payload bay at MET 4d5h25m51s. At MET 4d5h26m16s the #3 oxygen tank in the orbiter aft compartment began leaking. The first stage PAM burn placed the satellite into a 98x1,516km transfer orbit. After the second PAM burn and two \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E burns it reached its operational orbit, but shortly thereafter another of its antennas failed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022GDXj5tT.png\u0022 src=\u0022https://i.imgur.com/GDXj5tT.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew completed the deorbit burn at MET 5d5h31m. Entry interface occurred at MET 5d5h37m08s. Schuchardt and Anker brought Discovery in for a smooth landing at Dessert AFB with wheel stop at MET 5d5h51m48s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022iUSt8zq.png\u0022 src=\u0022https://i.imgur.com/iUSt8zq.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENext Up: \u003C/strong\u003EThe day before \u003Cem\u003EDiscovery\u003C/em\u003E landed, \u003Cem\u003EColumbia\u003C/em\u003E was rolled out to Pad 39A at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. It is scheduled to launch on March 18 on mission STS-61Q, an international space lab mission sponsored by Japan that will see the first Japanese astronauts reach space.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerminator K-100","CreatedById":204357,"CreatedDateTime":"2020-08-17T22:54:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223819249\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221594521775\u0022 data-ipsquote-userid=\u0022199277\u0022 data-ipsquote-username=\u0022ShuttleHugger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/11/2020 at 10:42 PM, ShuttleHugger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n.\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg alt=\u0022a14qCHC.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/a14qCHC.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n*Puts on \u003Cs\u003EJehovah Witness\u003C/s\u003E Visual mod evangelist cap*\n\u003C/p\u003E\n\u003Cp\u003E\nHave you considered a visual mod? Perhaps Spectra or AVP? Your \u003Cs\u003Esoul \u003C/s\u003E game is in danger of not \u003Cs\u003Ebeing saved\u003C/s\u003E being as cool as it could be!\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-08-22T22:50:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223839858\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221597704841\u0022 data-ipsquote-userid=\u0022204357\u0022 data-ipsquote-username=\u0022Kerminator1000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/17/2020 at 6:54 PM, Kerminator1000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHave you considered a visual mod? Perhaps Spectra or AVP? Your \u003Cs\u003Esoul \u003C/s\u003E game is in danger of not \u003Cs\u003Ebeing saved\u003C/s\u003E being as cool as it could be!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have thought about it some, but I\u0027m a little reluctant as my past experience has been that having too many mods installed (especially visual mods) tend to make the game chug on my machine. I already have issues with the game running slow (depending upon payload the shuttle can have anywhere between 250 and 450 parts upon launch), and I don\u0027t want to make the game run even slower.\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2020-08-28T01:13:08Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ESTS-61Q \u003Cem\u003EColumbia\u003C/em\u003E Mission Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D8F7p0I.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022108.75\u0022 height=\u0022435\u0022 width=\u0022400\u0022 src=\u0022https://i.imgur.com/D8F7p0I.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQuick Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: Abe Dykstra (CDR), Ted Valencia (PLT), Ethan Santoro (MS1), Kolby Baart (MS2), Fred Langbrook (MS3), Takeshi Akiyama, Japan (PS1), Yukiko Watanabe, Japan (PS2), Mao Suzuki, Japan (PS3)\n\u003C/p\u003E\n\u003Cp\u003E\nBackup Crew: Aiko Moto, Japan (PS1), Kenji Matsumoto, Japan (PS2), Hoshi Maki, Japan (PS3)\n\u003C/p\u003E\n\u003Cp\u003E\nPayload: Spacelab J-1: Spacelab Pressurized Module 2, Spacelab Vacuum Pallet\n\u003C/p\u003E\n\u003Cp\u003E\nPayload Mass: 6,714 kg\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch: March 18, 1987 5:30:00 from Pad 39A at Kerbal Space Center\n\u003C/p\u003E\n\u003Cp\u003E\nMission Duration: 10d0h35m57s\n\u003C/p\u003E\n\u003Cp\u003E\nLanding: March 29, 1987 0:05:57 at Edwards Air Force Range\n\u003C/p\u003E\n\u003Cp\u003E\nStatistics \u0026amp; Milestones: 53rd Space Shuttle mission; 18th flight of \u003Cem\u003EColumbia\u003C/em\u003E; 22nd landing at Edwards AFR. Commander Abe Dykstra became the first kerbal to fly on the Shuttle five times, while Payload Specialists Takeshi Akiyama, Yukiko Watanabe, and Mao Suzuki became the first Japanese kerbals to fly into space. \u003Cem\u003EColumbia\u003C/em\u003E surpassed 100 days of flight time, and the Shuttle fleet as a whole surpassed 300 days, on this flight. The first launch abort of the Space Shuttle Program occurred on this mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENarrative Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EColumbia\u003C/em\u003E lifted off into clear Florida skies on the first launch opportunity on March 18, 1987. It carried the second Spacelab pressurized module and a large number of experiments sponsored by the Japanese government, academia, and industry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022T94UIKl.png\u0022 src=\u0022https://i.imgur.com/T94UIKl.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a nominal liftoff, problems quickly developed. 59 seconds after liftoff, the water tank in the orbiter middeck began leaking. At 1 minute 38 seconds after liftoff, the #2 (port) space shuttle main engine failed at an altitude of approximately 20 km. Under the guidance of mission control, the crew were able to execute a successful ATO (abort to orbit) by keeping the remaining two SSMEs at 100% thrust for the remainder of the ascent, as the engines were normally throttled down to 67% at this point in flight. Vehicle control after the abort was significantly more difficult than usual due to the asymmetric thrust of the two remaining SSMEs. Commander Dykstra recalled in a post-flight media briefing, “The vehicle just didn\u0027t want to fly straight. I had to wrestle the dang thing all the way up into orbit, the master alarm blaring the whole time.” The ascent nonetheless placed the orbiter into a preliminary 43x219km orbit. At MET 19m the crew completed an OMS burn to place Columbia into a 74x219km orbit, inclination 3.2 degrees, period 35m55s. Due to the water leak and lost supplies, mission controllers determined that the mission would need to be ended two days shorter than planned (with return on Flight Day 10 rather than 12) in order to not run into safety margins for consumables. Blue Team (Valencia, Santoro, Langbrook, Akiyama) went to bed at MET 30m, while Red Team (Dykstra, Baart, Watanabe, Suzuki) worked to activate all orbiter systems. The two teams swapped spots at MET 3h00m. Langbrook and Akiyama began activating Spacelab, while Valencia and Santoro prepared to maneuver the shuttle. They conducted an OMS burn at MET 4h12m to lower the orbit to 74x129km, and a second at MET 4h28m to circularize the orbit to 128x132km, period 34m45s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022FG5TYZt.png\u0022 src=\u0022https://i.imgur.com/FG5TYZt.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAt MET 1d0h00m Red Team moved into Spacelab and began the mission\u0027s program of scientific experiments.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022sOBHvDG.png\u0022 src=\u0022https://i.imgur.com/sOBHvDG.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDespite the excitement of the launch and the shortened mission duration, the remainder of the mission proceeded much more smoothly with a successful program of science.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile the remainder of Red Team began shutting down Spacelab, Commander Dykstra began preparations to lower \u003Cem\u003EColumbia\u003C/em\u003E\u0027s orbit. Dykstra completed an OMS burn at MET 9d0h24m to lower the orbit to 100x128km, and a second at MET 9d0h40m to circularize the orbit to 98x100km. At MET 9d3h00m the final crew exchange occurred, with Red Team going to bed for their final on-orbit sleep cycle and Blue Team taking over to begin closing out all orbiter systems.\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew completed the deorbit burn at MET 10d0h17m, targeting landing at Edwards due to heavy rain at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Entry interface occurred at MET 10d0h23m31s. The approach to Edwards was significantly hotter than normal, but Dykstra and Valencia nonetheless brought \u003Cem\u003EColumbia \u003C/em\u003Ein for a bumpy landing with wheel stop at MET 10d0h35m57s. After landing and being returned to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, \u003Cem\u003EColumbia\u003C/em\u003E was rolled into Orbiter Processing Facility Bay 3 for its Double Downtime maintenance period to perform additional maintenance and upgrades, including fitting the orbiter with a GPS receiver unit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022Ez3Hx3q.png\u0022 src=\u0022https://i.imgur.com/Ez3Hx3q.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENext Up: \u003C/strong\u003E\u003Cem\u003EChallenger\u003C/em\u003E is scheduled to lift off on May 12 on mission STS-61O, carrying Brazil\u0027s first astronaut and a cargo of commsats.\n\u003C/p\u003E\n"},{"CreatedByName":"The rocket exploder","CreatedById":208113,"CreatedDateTime":"2020-11-12T00:43:55Z","Content":"\n\u003Cp\u003E\nI really like whole mission report thing with the space shuttle missions. Keep up the good work.\n\u003C/p\u003E\n"},{"CreatedByName":"723179","CreatedById":207664,"CreatedDateTime":"2021-02-12T09:22:27Z","Content":"\n\u003Cp\u003E\nif you ever get to the end of the shuttle program, will you look at more shuttle derivatives?\n\u003C/p\u003E\n\u003Cp\u003E\nthese missions are amazing and I can’t wait for the next one \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2021-03-06T21:49:08Z","Content":"\n\u003Cp\u003E\nI\u0027m back! It\u0027s been a rather long hiatus, but I\u0027ve picked KSP back up and should be posting new missions here at least intermittently.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223924986\u0022 data-ipsquote-contentid=\u0022187014\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221613121747\u0022 data-ipsquote-userid=\u0022207664\u0022 data-ipsquote-username=\u0022723179\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/12/2021 at 4:22 AM, 723179 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nif you ever get to the end of the shuttle program, will you look at more shuttle derivatives?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt will probably take a very long time (each orbiter is rated for 100 missions and I\u0027ve only flown a little over 50 flights total), but I do have some plans for a Shuttle Mk. 2 and perhaps a Shuttle C heavy launch vehicle for the late \u002790s-early \u002700s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMishchenie 28 Launch Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(I don\u0027t usually post mission reports for cargo missions, but here\u0027s one just to have some actual content in this post...)\n\u003C/p\u003E\n\u003Cp\u003E\nThe Mishchenie 28 freighter lifted off into the predawn sky from Site 33 at Woomerang Cosmodrome at 0:38:16 on April 29, 1987. The booster slightly underperformed on launch, leaving the vehicle in an initial 5x122km orbit, but at 0:47 the spacecraft completed a contingency burn to raise its orbit to 80x122km, period 32m44s, inclination 45.4 degrees (or 0.2 degrees with respect to Svoboda). At 1:01 it conducted another burn to zero out its inclination with Svoboda\u0027s orbit, and a third at 1:04 to raise the orbit to 81x155km and set up the rendezvous sequence. Due to unlucky phasing at the time of launch the catch-up sequence was unusually long. At 1:34 on April 30 the vehicle conducted a burn to set up a pass by Svoboda at 1.5 km distance and 42.3 m/s Delta v one orbit later. Mischchenie 28 began the terminal rendezvous sequence at 2:08, and docked to the aft port of Kvant at 2:22:16. After docking, Svoboda had a total mass of 23,590 kg.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022mIcBVf7.png\u0022 src=\u0022https://i.imgur.com/mIcBVf7.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"ShuttleHugger","CreatedById":199277,"CreatedDateTime":"2021-03-18T03:20:07Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ESTS-61O \u003Cem\u003EChallenger\u003C/em\u003E Mission Report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bx6RR8i.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022108.75\u0022 height=\u0022435\u0022 width=\u0022400\u0022 src=\u0022https://i.imgur.com/bx6RR8i.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EQuick Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: Casimir Deniau (CDR), Ellis Beitel (PLT), Bill Kerman (MS1), Zachary Averesch (MS2), Alanna Zelenko (MS3), Paquita Oquendo, Mexico (PS1), Lucia Santos, Brazil (PS2)\n\u003C/p\u003E\n\u003Cp\u003E\nBackup Crew: Amparo Maradona, Mexico (PS1), Estefania Duarte, Brazil (PS2)\n\u003C/p\u003E\n\u003Cp\u003E\nPayload: DoCielo 2 commsat, AztlanSat II commsat, Maritime Commnet B commsat, 4x GAS Canisters\n\u003C/p\u003E\n\u003Cp\u003E\nPayload Mass: 6,596 kg\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch: May 13, 1987 0:54:00 from Pad 39B at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMission Duration: 4d4h39m22s\n\u003C/p\u003E\n\u003Cp\u003E\nLanding: May 17, 1987 5:33:22 at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nStatistics \u0026amp; Milestones: 54th Space Shuttle mission; 17th flight of \u003Cem\u003EChallenger\u003C/em\u003E; 10th Space Shuttle launch from Pad 39B; 28th landing at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Payload Specialist Lucia Santos became the first Brazilian kerbal to fly in space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENarrative Summary:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSTS-61O debuted the new ACES pressure suits, featuring improved safety, lighter weight, and better comfort as the Shuttle Program moves towards the Space Station Liberty era. The crew posed for a pre-launch group portrait at the launch pad:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022ZK0vH3E.png\u0022 src=\u0022https://i.imgur.com/ZK0vH3E.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLeft to right: Oquendo, Averesch, Beitel, Deniau, Kerman, Zelenko, Santos\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EChallenger \u003C/em\u003Elifted off on the first launch opportunity on May 13, 1987, carrying three commsats for Mexico, Brazil, and the Kerbal States Coast Guard. It was placed into an initial 25x211km orbit. The crew completed an OMS burn at MET 17m to place the orbiter into a 73x211km orbit, inclination 1.2 degrees, period 35m36s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022jCYSkr3.png\u0022 src=\u0022https://i.imgur.com/jCYSkr3.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAt MET 4h44m the crew completed an OMS burn to lower the orbit to 72x101km. At MET 4h47m25s, the #4 battery in the orbiter aft compartment short-circuited. They completed a second OMS burn at MET 4h58m to circularize the orbit to 99x102km, period 32m41s. Later in the day the crew activated the GAS Canisters in the payload bay. At MET 1d2h01m45s, the shuttle\u0027s #3 battery also short-circuited.\n\u003C/p\u003E\n\u003Cp\u003E\nDoCielo 2 was deployed from the payload bay at MET 1d5h11m10s. The first PAM burn one orbit later placed the payload into a 100x3,081km transfer orbit. The upper stage PAM burn and two correction maneuvers placed the payload into its operational geosynchronous orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u00222vEJcDN.png\u0022 src=\u0022https://i.imgur.com/2vEJcDN.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAztlanSat II was deployed from the payload bay at MET 3d0h47m48s. 31 minutes after deployment, the battery in its probe core short-circuited. The first PAM burn shortly thereafter placed the payload in a nearly perfect 100x2,863km transfer orbit. Thanks to the excellent first PAM burn, only a single \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E maneuver was necessary to insert the satellite into its operational orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nAt MET 3d4h03m38s, the deployment motors in the #4 GAS Canister in the payload bay failed. Maritime Comment B was deployed from the payload bay at MET 3d4h38m36s. The PAM burn one orbit later placed the payload into a 99x2,970km transfer orbit. The upper stage PAM burn and two \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E correction maneuvers delivered the satellite to its operational orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022iyiyeZs.png\u0022 src=\u0022https://i.imgur.com/iyiyeZs.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew closed the payload bay doors at MET 4d4h04m, and completed the deorbit burn at MET 4d4h20m. Entry interface occurred at MET 4d4h26m04s. At MET 4d4h31m21s the internal battery in the #2 fuel cell short-circuited. Deniau and Beitel brought \u003Cem\u003EChallenger \u003C/em\u003Ein for a hard landing at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E with wheel stop at MET 4d4h39m22s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022border:;white-space:pre;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022Vfc0YFv.png\u0022 src=\u0022https://i.imgur.com/Vfc0YFv.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENext Up: \u003C/strong\u003E\u003Cem\u003EDiscovery\u003C/em\u003E is scheduled to lift off on May 27 from Dessert AFB carrying three more GPS satellites on mission STS-72B.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIn Other News: \u003C/strong\u003EThe Mishchenie 28 freighter undocked from Svoboda on May 13, and disposed of itself in the Pacific Ocean. The Soyuz TM-6 spacecraft lifted off from Woomerang Cosmodrome on May 15 and docked with Svoboda the next day. A mission report will follow.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIn Meta: \u003C/strong\u003EThis mission, with payload specialists from Mexico and Brazil, was, of course, my nod to the team who made KSP, in thanks for making such a great game. On a personal note, I surpassed 1000 hours playing KSP during this mission!\n\u003C/p\u003E\n"}]}