{"TopicId":191657,"ForumId":51,"TopicTitle":"Ever Onward (or, my saves keep dying so here I go again)","CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2020-02-15T13:31:50Z","PageNum":1,"Articles":[{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2020-02-15T13:31:50Z","Content":"\n\u003Cp\u003E\nSidebar\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nA few worldbuilding notes. \n\u003C/p\u003E\n\u003Cp\u003E\nIn this universe, Kerbals evolved from cavern fungi and, as will be mentioned, only recently emerged. For convenience sake, I\u0027ve decided the in game calendar starts at Y1 because zero was spent building everything. There have been previous emergences but these were believed to be legend.\n\u003C/p\u003E\n\u003Cp\u003E\nThe starter tech level was found engraved on the monolith near the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, for lack of a better explanation. \n\u003C/p\u003E\n\u003Cp\u003E\nFor no particular reason, I\u0027ve decided that male Kerbals tend towards singleminded focus and will engage in daredevilry often. In contrast, the women have a broader view and less often but more risky/impressive stunts. This will mostly affect my characterization of the First Four, especially siblings Jeb and Val.\n\u003C/p\u003E\n\u003Cp\u003E\nFor this story, Ops is the Chief of Operations, basically me.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nValentina\u0027s Log; E\u002BY1D28:0340hrs\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a year of getting settled on the surface and building up our infrastructure, the Kerbal Space Center was given the green light for operations. After that, we practically flung ourselves at the sky, day in and day out, for the first twentyfour days.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a while, Ops called for a break in official missions and set aside some funding for \u0022discretionary\u0022 flights. Off the record, he explained that we had some time to goof around as long as we had a good excuse to put on the paperwork.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter one flight, my brother Jeb came back rather excited and eagerly thrust a picture into our faces.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WZlIOFv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/WZlIOFv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nApparently he\u0027d gone out to the desert and found a sort of stone pyramid complex. Bill and Bob went wild with speculation for a day or so before they all took off in a Fruitbat, towards a pretty far temp scan contract for lack of any better guidance, searching for any more archeological finds.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KsKH97H.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KsKH97H.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI was just gonna relax and familiarize myself with all the new tech, but we began picking up distress calls. From space. We\u0027re not the only Kerbals to have emerged recently (surprise) and other programs have also been flinging Kerbals up to the black. Trouble is, they haven\u0027t worked out how to get them back down. So, I headed over to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and asked the hardhats to throw something together. I ended up with a Hitchhiker slapped on top of some rockets, with a decoupler taking the brunt of reentry followed by a smaller, proper heat shield. It worked. Had enough deltaV for two pickups. We sent a smaller can up for the third, using an OKTO model probe core to pilot. The missions themselves were rather unremarkable, unless you count the narrow fuel reserve margin we cut for the first reentry. The Strays were a bit worried about seeing all of 16 meters per in the tanks, but we managed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VHFSafc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/VHFSafc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe new kids agreed to join up, sending Ops into some sort of... weird cackling fit. After a bit, and the newbs slowly backing out of the office, Ops explained to me that these new recruits would be assigned to the boys as a team of six, two of each specialty, and assigned to the first long-service spaceship. Either my disappointment was obvious or Ops had anticipated it, because he quickly added that he needed me Kerbside, being the more levelheaded pilot. He also said I would be the first to command the third generation of that line, at which point it would be self-sufficient!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xn3AsUt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xn3AsUt.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe boys returned and were introduced to the Strays. They get along pretty good, teamwork seems as solid as that weird monolith over yonder. So why does Ops look so nervous?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022q9OHYm6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/q9OHYm6.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-02-15T13:33:45Z\u0022 title=\u002202/15/2020 01:33  PM\u0022 data-short=\u00224 yr\u0022\u003EFebruary 15, 2020\u003C/time\u003E by Vagrant203\u003C/strong\u003E\n\u003Cbr\u003EProbe name correction\n\u003C/span\u003E\n"},{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2020-02-16T11:15:49Z","Content":"\n\u003Cp\u003E\nCaptain Jebediah\u0027s Log; E\u002BY1D43:0427hr\n\u003C/p\u003E\n\u003Cp\u003E\nLSV01 Pathfinder; MET\u002B1807hr\n\u003C/p\u003E\n\u003Cp\u003E\nAnother busy couple of days. Valentina was laid up for a while after some malfunctions with the first Munshot. The second, with yours truly at the helm, managed to land just fine.\n\u003C/p\u003E\n\u003Cp\u003E\nThe science data I recovered went really far. We ended up being able to research the tech for the long-service vessels Ops had planned. Even skipped right by the theoretical first generation since we got a command pod that can directly control probes. Right now me and Ludwin are sitting in that pod in a 151x148km orbit above Kerbin, waiting for the lab, habitation, and propulsion modules to be sent up. The first stop will definitely be Minmus, since it hasn\u0027t been explored yet and the nearest interplanetary transfer window is 107 days away, and that\u0027s to Moho. At least the scientists will be busy with all the data we\u0027ll get.\n\u003C/p\u003E\n\u003Cp\u003E\nWe\u0027ve also got a new multispectral sensor. Bill and Bob tell me it can pick up structures from orbit, so we\u0027ll probably be seeing more archeological expeditions.\n\u003C/p\u003E\n\u003Cp\u003E\nOpe, gotta go, the next module is about to come up and Ludwin can\u0027t steer the probe core all on his lonesome.\n\u003C/p\u003E\n\u003Cp\u003E\nCaptain Jebediah Kerman signing off.\n\u003C/p\u003E\n"},{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2020-02-19T15:34:30Z","Content":"\n\u003Cp\u003E\nOperation Log - Orbital Assembly, Minmus Shakedown Cruise; E\u002BY1D 57:0054hr\n\u003C/p\u003E\n\u003Cp\u003E\nLSV01 Pathfinder; MET\u002B12D:0235hr\n\u003C/p\u003E\n\u003Cp\u003E\nThe LSV01 is finally complete. Some hiccups were encountered, but the challenges were overcome just as quickly as they came.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UUcs0dT.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/UUcs0dT.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xeOhslw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xeOhslw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gTeDxWx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/gTeDxWx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou may notice the peculiar arrangement with the mk1-3 command pod being slipped in the middle. This was the solution to the first hiccup, not mounting the pod directly to the drive section. This will be corrected in the third generation\u0027s design.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother minor mistake was failing to seat the LSV\u0027s crew before launch, with the exception of the pilots. The obvious solution was implemented.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, two problems, a lack of science equipment and radial docking ports for probes, were both solved with a final trailing section. In the future, the ports will be placed on the drive section\u0027s center tank and the science equipment will be mounted on the relay section.\n\u003C/p\u003E\n\u003Cp\u003E\nAs previously discussed, the Pathfinder\u0027s shakedown cruise will be a scientific survey of Minmus, gathering data to send back to Kerbin and to research aboard the vessel. Operation will have two phases; phase one being orbital survey and science transmission, followed by phase two, a series of landers piloted remotely and manned by a scientist, perhaps augmented by new technology researched with the science from phase one.\n\u003C/p\u003E\n\u003Cp\u003E\nEven more importantly than the scientific data gained, this operation will establish a reliable set of procedures and test the practical extent of existing life support technology. The third generation of LSV will be outfitted with as yet unresearched technology to utilize local resources, but it will be important to know how much time can be spent between mining operations for purposes of interplanetary travel.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the time of this log, Pathfinder has just entered Minmus \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E and is executing a burn into polar orbit, after which the multispectral sensor will be deployed to track down any anomalies.\n\u003C/p\u003E\n\u003Cp\u003E\nEnd log\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow speaking as a writer, I would appreciate any feedback from any readers. \n\u003C/p\u003E\n"},{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2020-02-25T02:55:23Z","Content":"\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nCaptain Jebediah\u0027s Log; E\u002BY1D287\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nLSV01b Pathfinder; MET\u002BD47\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nSomeone once wrote, \u0022The times, they are a-changing.\u0022 As my crew and I settle into the new Model B Pathfinder modules, I find myself agreeing wholeheartedly. So much has happened in not even a year, and the Pathfinder-A was right at the center. \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nWhat\u0027s this about A and B and all that, you might ask? Well, the science we\u0027ve gathered and the research resulting from such have led to some pretty significant advances in propulsion, docking, comms, and more. The many probe launches and the operational experience we\u0027ve gained aboard Pathfinder have taught us how to better use all the better gear.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nIn essence, we\u0027re better at everything we were capable of before. However, we haven\u0027t yet cracked the secrets of using what we find out there to keep going. All of this means that we have yet to make a leap far enough for our LSVs to be considered a new generation.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nThere is a nice consolation prize though. Pathfinder lives on. Indeed, if you operate under a conveniently loose interpretation of the Ship of Theseus concept, it\u0027s still the same ship since the modules have been docked to the tail end and replaced one by one. The mission timer might not not agree with me, but I\u0027m using captain\u0027s prerogative to not give a flying fairing scrap. (That\u0027s right, computer, I laugh at your inflexible adherence to rules of logic that have no bearing on anything else! Ha! And again ha!)\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nReturning to the topic at hand, it\u0027s more than just Pathfinder that\u0027s changed. We\u0027re adopting a whole new mission approach. After consulting with several academics and authors of speculative fiction, Pathfinder will be making full use of the probe control option to lead a task force of drones, a marked shift from the previous single-package philosophy of Pathfinder A. \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nA whole new chapter is about to unfold. And Pathfinder will be leading the way once more, with some new drone buddies!\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:13px;\u0022\u003E\nThis is Captain Jebediah signing off. \n\u003C/p\u003E\n"},{"CreatedByName":"KerballingSmasher","CreatedById":195689,"CreatedDateTime":"2020-02-25T22:53:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223743620\u0022 data-ipsquote-contentid=\u0022191657\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221582126470\u0022 data-ipsquote-userid=\u0022202630\u0022 data-ipsquote-username=\u0022Vagrant203\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/20/2020 at 2:34 AM, Vagrant203 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe obvious solution was implemented.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cem\u003EAlt-F9 intensifies...\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2020-02-26T06:19:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223747355\u0022 data-ipsquote-contentid=\u0022191657\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221582671218\u0022 data-ipsquote-userid=\u0022195689\u0022 data-ipsquote-username=\u0022Kerballing (Got Dunked On)\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Kerballing (Got Dunked On) said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cem\u003EAlt-F9 intensifies...\u003C/em\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNah, I wouldn\u0027t have included that part if I\u0027d reverted and loaded them. The obvious solution was to send the crew up in the latest tourist trap.\n\u003C/p\u003E\n"}]}