{"TopicId":192791,"ForumId":51,"TopicTitle":"Project Rockband: Oh Lawd E Comin","CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2020-03-31T12:04:55Z","PageNum":1,"Articles":[{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2020-03-31T12:04:55Z","Content":"\n\u003Cp\u003E\nSo a funny thing happened on the way to a solar relay net. I\u0027m deploying my first proper relay network because I haven\u0027t quite figured out long term life support logistics.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E is indispensable for this. I\u0027ve been using it to note times and swap relays as the maneuver nodes arrive. I go for another swap and suddenly I\u0027m staring at a rock. Which, y\u0027know, space rocks are a lot cooler than regular rocks, and this is the first time I\u0027ve positively identified an asteroid, so cool, right?\n\u003C/p\u003E\n\u003Cp\u003E\nI head to the tracking station to read up on it. Turns out there are three key facts that put me in a bit of a panic.\n\u003C/p\u003E\n\u003Cp\u003E\n1. The object is a class E.\n\u003C/p\u003E\n\u003Cp\u003E\n2. It will pass through Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E, with a periapsis of about 15 thousand km.\n\u003C/p\u003E\n\u003Cp\u003E\n3. I grabbed contracts for it before realizing: I have no idea WHAT I\u0027M DOING! My very first rock and it\u0027s the largest class.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve created a first draft of a vehicle that may be able to capture it, siphon ore, and process it. I\u0027ll be crewing it with the rockstars of Kerbal astronautry (or whatever the word is,) the First Four, Jeb, Val, Bill and Bob.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll need to make provisions for agroponics. Fortunately \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E technology can synthesize fertilizer. The real trick will be to make sure the farms grow fast enough to replace the supplies consumed, with at least a small surplus.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then I\u0027ll have to catch the darn thing.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll pause for some suggestions and update this thread when the mission itself is executed.\n\u003C/p\u003E\n\u003Cp\u003E\nThis could have gone under the Pathfinder Files, but the act of rendezvous and capture were well outside the scope of that project, especially considering the LSV\u0027s would be tuned for efficiency instead of hard thrust. I will be adding entries to Pathfinder Files if I capture the bugger, because I\u0027ll definitely turn that rock into an LSV if I catch it.\n\u003C/p\u003E\n\u003Cp\u003E\nBig if.\n\u003C/p\u003E\n\u003Cp\u003E\nhalp\n\u003C/p\u003E\n"}]}