{"TopicId":196074,"ForumId":51,"TopicTitle":"My first Mission Report, A Tale of Two Kerbals","CreatedByName":"Kerbals_of_Steel","CreatedById":206555,"CreatedDateTime":"2020-08-03T05:08:24Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbals_of_Steel","CreatedById":206555,"CreatedDateTime":"2020-08-03T05:08:24Z","Content":"\n\u003Cp\u003E\nI\u0027ve been lurking here for a while and playing KSP for about a month, finally have something to add to the forums, a little thing called \u0022A Tale of Two Kerbals.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIn the beginning of Kerbins first space programme, Elon Kerman, Head of Finance and Chief Empirical Officer, and his head of Off-Planetary Science, Dr. Zubrin Kerman, one day devised themselves a plan that should be the envy of any Kerman. Rather than bore everyone with little things like learning to achieve a proper orbit around Kerbin, KSP\u0027s first step into the void would be a giant one. They wanted a space station, on the MUN! Technically, AROUND the Mun, but everyone accepted that at least parts of the first orbiting station would end up on the surface anyhow.\n\u003C/p\u003E\n\u003Cp\u003E\nAccordingly, KSP\u0027s first serious launch was a Space Station core assembly perched precariously upon a truly asinine  assemblage of solid boosters and a woefully overworked Poodle liquid engine. Several rapidly iterative attempts later, the hopes and dreams of Kerbal blasted succesfully into Munar orbit. Along with the entirety of KSP\u0027s 7 Kerbal astronaut core, except for Jeb, who had been joyriding a Mun rover around the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E. (Seriously, not sure what happened there. I thought I had Valentina and Bob for a flight crew, and the next time I checked the barracks, everybody was just gone...)\n\u003C/p\u003E\n\u003Cp\u003E\nThis left Elon and Dr. Zubrin in a bit of a quandary. 6/7ths of their entire manpower was now packed into a single tiny space station, stranded and snack deprived. The plans to slowly rotate the crew out in a 1 or 3 person pod was obviously out the window, but how do you rescue half a dozen stranded Kerbals simultaneously when your entire space program is now only hours old? The first step was obviously an unmanned resupply mission, just to make sure that we could actually find and dock to the darn thing, but how do we get the crew back??? While they hemmed and hawed, Jeb went out back and started doing what Jeb does best, besides eating snacks and engaging in near-suicidal hijinks. By stacking a standard pod on top of a tin can with life support and a hyuge inflatable heatshield, he created a 7 person spacecraft that resembled nothing else quite as much as the grain silo\u0027s on the farm Jeb grew up on. Festooned with every parachute he could fit, and stacked atop the same booster that had taken his friends to the Mun, Jeb was on a mission. It was 11,400 KM to the Mun, he had a full tank of gas, half a pack of snacks, it was dark out, and he was wearing sunglasses. Hit it!\n\u003C/p\u003E\n\u003Cp\u003E\nThe mission was completely norminal through launch, TMI and Mun capture, and Jeb was astounded that after just a couple orbits, he had an intercept with the station. It had taken the unmanned probe many attempts and almost all of the consumables on board before it finally docked. Never send a machine to do a Kerbals\u0027 job. It seemed a near-perfect intercept, too, on the same plane and a measly 300 meters minimum seperation. He could jump that far, in orbit. There was just one LITTLE hangup. The station would have an overtake velocity of 180m/s... Oh well, Jeb always did like to drive fast. He idled along at the top of his orbit, waiting for the opportune moment, and when it came, he struck, putting the metal to the pedal, and the thingy to the floor. In exactly the wrong direction, whooops... Ok, time for a fresh start. This time he was pointed in the right direction, and managed to close the separation even further. He got so close, in fact, that one of the Gigantor solar arrays smacked the bottom of his ship  as it blew past him at 100m/s. Third times a charm!?!?!??? The final attempt was in fact, final, because he managed to cut the velocity difference down to a manageable 10m/s before flipping his ship around and making connection. It had been ugly, with the Poodle wagging his ships tail all over the place and the tanks were nearly dry, but he was there, and he had just enough fuel to get back.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb, Valentina and Bill crowded into the command pod, stuffing the 3 new Kerbalnauts into the trunk of the craft that Valentina derisively called \u0022Jeb\u0027s Bus\u0022. \u0022You came here in THAT??? You are braver than I thought.\u0022 A quick escape burn, and Jeb had a highly elliptical Kerbin orbit plotted when the overworked Poodle finally ran out of fuel. Still, it had held out long enough to drop periphrasis to 60-something  kilometers, so they were going to come down, eventually. Eventually took 3 orbits and 4 increasingly rough rides through Kerbin\u0027s upper atmosphere, with Jeb and Valentina riding along stoically, and Bill just glad that the 3 rookies were in the other pod, where no one could hear them scream. Even with the ballistic co-efficient of a bouncy castle, those aerobraking passes had barely made a dent in the ships ludicrous speed, and the final decent was a roaring, shaking, plasma coated mess, but Jeb did in fact manage to get them on the ground in one piece, \u0022single handedly saving the entire Kerbin Space Programme!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb was justly (and incessantly) proud of that fact, too, much to Valentina\u0027s dismay, so when she heard that the next piece of the Munar Station was ready to launch, she silently slipped out of yet another press conference and climbed aboard the \u0022Neil, Degrasse, and Tyson Memorial Munar Science and Communications Munificent and Benevolent Society Orbital Educational, Obervational and Elucidational Module, Brought to you by Rockomax and Integrated Integrals\u0022 Everybody around the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E just called it the Labra-Poodle, after the combination of science lab and Poodle Upgraded Propulsion System service module.\n\u003C/p\u003E\n\u003Cp\u003E\nBetter plotting and more experienced orbital mechanics meant that she took off in a much more subtle and sleeker booster than previous Munar missions had used, and no one even missed her until Jeb proudly paraded out to the launch pad and proceeded to ask the age old question \u0022Dude, where\u0027s my ship?!?!??\u0022. The ship is question was already slipping the bonds of Kerbal on its way to the Mun and was entering Munar orbit by the time a suitably  chastened Jeb made it to Mission Control for his substitute duty as the mission CapCom. An elegant mid-course correction meant that Valentina was able to slip into Munar orbit on plane, on time, and well under the fuel budget, and when she eyeballed a minor correction intended to match her periphrasis with that of the station, the news only got better. She had beat Jeb\u0027s record, and had an intercept on the first orbit. Two of them, actually, about 20 degrees apart, creating a multi-minute window where the range varied from 2.4 to 3.6 km, and the closing speed was a stately 20m/s, give or take a few m/s. (Seriously, all I wanted to do was match part of the orbit, and when I started going through the results and realized just how dead-on my simple retrograde burn had been, well, excited expletives ensued.)\n\u003C/p\u003E\n\u003Cp\u003E\nValentina had plenty of time to enjoy the view from her command cupola as the station slowly, ever so slowly, drifted towards her, and not even Jeb\u0027s eager urging to \u0022Stop flying like a kerbushka and DO something!\u0022 could ruin her contemplative mood as she slid the Labra-Poodle into its temporary berthing on the first try. (Ok, technically, I did reload. That was only because my 4 year old crawled into my lap while I was waiting and asked \u0022Can I fly the space-boat, daddy???\u0022 When he asks like that, hell yes, he gets to fly the space-boat for a while. My first serious attempt was a complete success.) The first docking was only temporary, however, since the arrival of the first major module and a nearly fully fueled PUPS power unit started a complicated game of orbital musical chairs. First, the Foundation Franklin, the stations heavy orbital tug, had to remove the partially depleted Poodle/fuel tank combo that had boosted the station to orbit, then re-dock itself whilst carrying the old booster in its claw. Then, the probe core equipped PUPS unit detached from Valentina\u0027s Labra-Poodle to replace the old booster, the Franklin undocked and temporarily attached the old booster to a docking port on the side of the PUPS unit to drain the rest of the fuel, disposed of the old booster, and re docked to fuel its own tanks. Valentina then undocked the Lab unit (which had been nosed in to the main port on the command module side of the station), and swung it around to mount on the central node using the lower lab docking port. She managed to do that entirely without assistance from the tug, and only on the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel present in the command cupola, a maneuver that had Jeb whistling in appreciation and sending out that ultimate accolade, that \u0022Valentina, you are a steely-eyed missile Kerbal!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis concludes part 1 of a (hopefully) multi-part series on the exploration of near Kerbin space in general, and the Mun in particular. Though long, I hope it was entertaining and educational.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SuperMiiBrother","CreatedById":192341,"CreatedDateTime":"2020-08-03T21:06:28Z","Content":"\n\u003Cp\u003E\nSpace Boat\n\u003C/p\u003E\n"}]}