{"TopicId":197160,"ForumId":51,"TopicTitle":"No Contract Career Challenge, and more masochism","CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-09-27T18:02:13Z","PageNum":1,"Articles":[{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-09-27T18:02:13Z","Content":"\n\u003Cp\u003E\nAfter reaching the point in my career where I could do anything I wanted, just by building a bigger rocket and/or using my refueling stations everywhere, I found \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/170930-the-no-contract-career-challenge/\u0022 rel=\u0022\u0022\u003Ethis nice challenge to spice things up\u003C/a\u003E. My funding is limited by exploring new places, so no more grinding up money with tourist flights (\u003Cem\u003EI made so many, they became boring\u003C/em\u003E), no more grinding up science by landing those tourists in a different biome every time, and no more easy mission with infinite fuel available. And especially no brute forcing my way through anything else I can\u0027t tackle otherwise.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I decided to not just apply to the challenge, but also to be \u003Cstrong\u003Eelegant\u003C/strong\u003E about it.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, as further conditions\n\u003C/p\u003E\n\u003Cp\u003E\n- no use of policies. Sure, I could get some extra money by selling all the science I get, but science has no price. Or I could beg the government for money, but reputation also has no price. As for all the paperwork that\u0027s done by the admins, the only use it can possibly have is to cram it up a booster and use it as solid fuel. And unfortunately it\u0027s not good, too low Isp\n\u003C/p\u003E\n\u003Cp\u003E\n- no \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E\u003C/abbr\u003E. I can gather enough for a level 3 r\u0026amp;d and then mine Kerbin and sell fuel, but it\u0027s not elegant.\n\u003C/p\u003E\n\u003Cp\u003E\n- sending as few ships as I can. Because making one single multistage ship that goes everywhere is probably more efficient (\u003Cem\u003Eat least, you reuse all the parts\u003C/em\u003E) and, again, more elegant.\n\u003C/p\u003E\n\u003Cp\u003E\nOriginally I was hoping I could do it with 3 missions, but looks like I will need 4\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003EPart 1\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EEarly orbiting\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nObjective is reaching orbit with the first flight. but first i need some science.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zj0H8OT.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/zj0H8OT.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nStudying the goo, I unlock the thermometer.\n\u003C/p\u003E\n\u003Cp\u003E\nStudying the thermometer on the launchpad and landing strip, and with a couple EVA, I unlock the barometer. with the barometer I unlock basic rocketry, and I get the swivel.\n\u003C/p\u003E\n\u003Cp\u003E\nWith the swivel, I make the first orbiter\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eGrl97d.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/eGrl97d.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYes, this thing can reach orbit; in fact, it can reach a 250 km apoapsis, unlocking the \u0022outer space\u0022 science. If it is piloted very carefully. Which is especially hard having Bob on board and no \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIt took me three tries, but I managed to come back with 10 m/s left.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nyDEknl.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/nyDEknl.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E51 m/s left out of 2750 available may seem a safe margin, but I need to finish raising my periapsis for a full orbit, then I need to deorbit with enough precision to fall near the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E\u003C/abbr\u003E, and finally I need a bit to soften the landing\u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBut the rewards are big. All the achievements up to \u0022first orbit\u0022 in one go, with minimal expence, and all science experiments around Kerbin\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221XMREOi.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/1XMREOi.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-04T22:41:53Z\u0022 title=\u002207/04/2023 10:41  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 4, 2023\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-09-27T19:23:48Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EPart 2\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003ETo the moon(s)\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0022We choose to go to Mun in this decade and do the other things, and since they are not hard enough, we also choose to do them with minimal technology, inadequate equipment, and to also visit Minmus with a single mission before coming back\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:right;\u0022\u003E\nJ. F. Kerman\n\u003C/p\u003E\n\u003Cp\u003E\nActually, sending a single mission to Mun and Minmus together makes a lot of sense. Once you are on Mun orbit, you can spend 250 m/s to get back to Kerbin. Or, you could spend 200 m/s to go on a Minmus intercept, where you can circularize with 50 m/s. Then you drop a lander that can go down and back with 350 m/s, and finally 150 m/s wil see you home. So, you can visit both moons by adding just 25% extra deltaV to a Mun mission.\n\u003C/p\u003E\n\u003Cp\u003E\nThen again, even trying just for Mun is not trivial without adequate means. I made this lander\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BvdmDH5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/BvdmDH5.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYes, I know what you are thinking. This is a horrible lander. It is tall, thin, narrow, with small landing legs. It doesn\u0027t even have solar panels. And if you are not thinking that, you should be.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I didn\u0027t have much choice. I only had limited tech. I had 190 science, and I had two priorities: docking ports, to get the \u0022docking manuever\u0022 and \u0022build a space station\u0022 achievements, and they required 90 science alone, plus 45 for the prerequisite tech (\u003Cem\u003Eon the plus side, that prerequisite also gave me the science jr, for moar science\u003C/em\u003E). And second, I needed a Terrier engine, because you try making a low cost Mun mission without a dedicated last stage engine. A Spark would have been better, but that was too expensive. Anyway, there was no chance to get niceties like solar panels, or better landing legs, or fairings. I tried to get a wide base by more exotic designs, like this one\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sBCXrMj.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/sBCXrMj.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E(yes, it has 4 stacks, but only 2 engines. That I was willing to even consider such an abomination should stand as testament to how desperate I was)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBut they all performed too porly in the atmosphere. And with the limit of 30 parts (\u003Cem\u003Eno money to upgrade the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E\u003C/em\u003E) I also could not afford to brute force this with more boosters. So, thin lander will have to be.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I needed an orbiter. The lander would spend all its fuel for landing and take off. I needed an orbiter that could tow the lander the rest of the way. And the whole would be rather heavy. Also, I needed more batteries, and with the 30 parts limit it was a problem.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the end I came up with this design\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228hDTB0M.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/8hDTB0M.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not clear from this angle, but the three bosters on the bottom are not attached with decouplers. They are just stacked side by side. So I have the 3 boosters for the start, then I ditch them and I use a second booster to get suborbital. In all this process I have virtually no control, so I made sure to keep pointing in the right direction by adding fins on both the first and second stage (\u003Cem\u003EI could have used a Swivel, but it was more expensive\u003C/em\u003E). And then it circularizes using the fuel from the upper tank, the one attached over the docking port, that it will - of course - ditch before docking.\n\u003C/p\u003E\n\u003Cp\u003E\nNormal rockets discard stages from the bottom, but that requires using a new engine, and increases cost. Why not ditch stages from the top? Maybe for fear that they will crash over the ship? Seriously, have you seen the pieces of junk I\u0027m trying to fly? If we were ranking the possible causes for catastrophic failure, \u0022hit by the top tank\u0022 won\u0027t even make it to the top 10. But the total cost was less than 25k (\u003Cem\u003Eincluding the lander\u0027s launcher, which was actually a sane design\u003C/em\u003E); the 170k I had available would seem a lot of money for this mission, but I had to upgrade the launch pad, and I had to upgrade the tracking station and mission control if I wanted manuever nodes. By the way, this is the only launch system where I did not painstakingly recover every single piece of hardware.\n\u003C/p\u003E\n\u003Cp\u003E\nFlying this thing to orbit wasn\u0027t easy \u003Cem\u003E(it involved restarting the flight several times. Sometimes the lateral boosters would spontaneously detach in the launch pad).\u003C/em\u003E Managing a rendez-vous with the tracking station at level 1 also was a bother (\u003Cem\u003Eit involved reaching orbit behind the lander, putting apoapsis and periapsis a couple km lower, and then wait\u003C/em\u003E). Once they were within 100 km range, though, I was able to select the lander as a target, and then I could get a better rendez-vous by following the target on the navisphere.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce I docked the lander and orbiter (\u003Cem\u003Eand exchanged crews, which netted a bit more money\u003C/em\u003E) I used that money to up the tracking station. Still mission control was level 1, so I could not set up manuever nodes. How do I time my burn to reach Mun precisely? Three ways: eyeballing, save scumming, and correction manuevers. As soon as I got to Mun, I upgraded mission control too; there\u0027s no way I could eyeball a Mun-Minmus transfer.\n\u003C/p\u003E\n\u003Cp\u003E\nI had Bob in the orbiter to refresh the science experiments, and Jeb in the lander because landing without a \u0022hold retrograde\u0022 function was already hard enough without giving up on \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E entirely. I made sure to get a spacewalk over all the biomes I could reach for extra science.  Finally I landed\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nc3C10p.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/nc3C10p.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI knew where I could find a Mun arc (\u003Cem\u003Ewhich I discovered entirely by accident on a previous career\u003C/em\u003E), so I got that bit of extra money too.\n\u003C/p\u003E\n\u003Cp\u003E\nLanding this thing is even worse than it looks. Unless the ground is perfectly flat, it just won\u0027t stay upright. Oh, if you land it well, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E will keep it stable. But as soon as your pilot goes out, it flops. Even 5 degrees of ground inclination is enough to make landing unstable. And there\u0027s no way to judge accurately the inclination before landing, this game doesn\u0027t offer the best perspective.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, there is a solution: manually adjust the springs in the landing legs. I was able to make some legs longer or shorter by increasing or decreasing spring value, until it was stable.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first time it took me over 10 minutes. Then I had to scrap the mission and restart because I had run out of battery, and I made an orbiter with more batteries.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second time it took me 5 minutes. Then I run out of jetpack fuel trying to reach the mun arc. I reloaded again, trying to land closer.\n\u003C/p\u003E\n\u003Cp\u003E\nBy the time I made this actual landing, I was perhaps the greatest world expert at adjusting spring values to keep a lander upright.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022htJdzlR.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/htJdzlR.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMun and Minmus move so slow, you can transfer between them with barely any fuel. I love them!\n\u003C/p\u003E\n\u003Cp\u003E\nLanding on Minmus was much easier, because unlike Mun, it has some perfectly flat ground that\u0027s very easy to spot from orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gUgdM6e.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/gUgdM6e.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith the Minmus landing I got enough money to upgrade the r\u0026amp;d at level 2, so I could get surface samples. I managed to land close to the border of the flats, so I could get 2 different biomes.\n\u003C/p\u003E\n\u003Cp\u003E\nAn unexpected source of difficulty was keeping the science jr whole during descent. It has great thermal sensitivity. I could have let it burn and landed anyway, but recovering it was worth more money. And it let me perform one last experiment on whatever biome I would land.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JLTviog.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/JLTviog.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI barely managed it\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, the rewards were great.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JjEX6py.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/JjEX6py.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nsince I was there, I also scraped up a little rover to get science around the various \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E\u003C/abbr\u003E buildings\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HKsf0RS.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/HKsf0RS.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith this influx of science and money, it was time for the next step.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first mission achieved orbit. The second explored all the Kerbin system.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cem\u003Ethe third would get all the other planets, or die trying\u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-04T22:50:27Z\u0022 title=\u002207/04/2023 10:50  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 4, 2023\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-09-27T21:31:33Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EPart 3\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EAssembling \u003Cem\u003EMarco Polonium\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Less is more\u0022. A sound motto about space. Generally they utter it when pushing for small, simple crafts.\n\u003C/p\u003E\n\u003Cp\u003E\nBut then, if you can accomplish several missions with a single ship, you are doing less. That is, less ships. If you use one ship to do the job of three or four, that\u0027s certainly less.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EMarco Polonium\u003C/em\u003E is the mothership I built for the task. I was originally naming it \u003Cem\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Marco_Polo\u0022 rel=\u0022external nofollow\u0022\u003EMarco Polo\u003C/a\u003E\u003C/em\u003E, from the famous traveler. Like Marco Polo, it\u0027s going to visit faraway places and come back after a few decades. Then I thought, this thing has nuclear engines, Marco Polo didn\u0027t. So I gave it its actual name. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Polonium\u0022 rel=\u0022external nofollow\u0022\u003EPolonium\u003C/a\u003E is a byproduct of a nuclear reactor.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, for all its difficulties, a single ship to explore everywhere has its advantages. A single small lander can explore all the small worlds out there, except for Tylo and Laythe. Instead of sending one ship to each of those places, I could send one single ship, saving on the cost of having to launch a new one every time. And going from Duna to Jool is cheaper than going from Kerbin. And once you are at Jool, again going to Eeloo is cheaper than coming back and sending a new mission to Kerbin. And if I can make a single large ship, I can use the efficient nuclear propulsion without worrying about costs - or about how to recover it after every mission.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, that\u0027s the general plan. Have a mothership. With nuclear engines and plenty of fuel. Have a small lander attached to it. Figure something out for Tylo and Laythe. Get good antennas, because I can\u0027t afford a relay network. And find ways to manage it all within the 30 parts and 140 tons limit. And find ways to get all that stuff in orbit on a tight budget.\n\u003C/p\u003E\n\u003Cp\u003E\nSo. Back to the drawing board.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Vh8zQ8f.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Vh8zQ8f.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003Ethose are the technologies available at this time. The two most expensive pieces are the nuclear engine and the antenna strong enough to communicate from Jool\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E1) Launcher\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, strapping a parachute on a booster won\u0027t work; we all know they get deleted in the atmosphere. I had practice with launchers that could go suborbital in the first stage, then I would circularize with the second stage and still have time to assist the landing of the launcher. But then the launcher would end up at the end of a parabolic trajectory, quite far from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E\u003C/abbr\u003E, and I could recover only about 70% of the cost.\n\u003C/p\u003E\n\u003Cp\u003E\nLuckily, getting \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u003C/abbr\u003E on Kerbin is not difficult. All you need is \u003Cs\u003Ea spaceplane\u003C/s\u003E a big rocket with a relatively small payload. After some experimenting, I developed this workhorse\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fsNxuWK.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/fsNxuWK.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe cost for launching, at net from recovery, is around 9000\u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022\u003E. The payload is easily 20 tons, though I learned eventually to stretch it up to 25. The twin boar engine has a high resistance to impacts, so I can get away with less parachutes and no rocket assisted braking. In fact, the main problem is the rocket tipping and crashing the fuel tanks; to prevent that, I put the parachutes asymmetrically so that it would land tilted and fall gently on a side. It works perfectly on water, sometimes it fails on rough terrain.\n\u003C/p\u003E\n\u003Cp\u003E\nIt has 14 parts, but if needed I can skip the reaction wheel and the batteries, going down to 11. In this case, I must decouple the payload when I am already in the correct orientation for the deorbiting burn, make the deorbiting burn, deactivate \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E, and hybernate the probe core immediately. I can also remove the ground stabilizers and one parachute, though I will have to reload the launch a few times because it may flip randomly before I even turn on the engine. With one less parachute it will only survive with water landing and some well-timed rocket braking. But it\u0027s 8 parts. And if the payload has a docking port, I can use the docking port to connect to the launcher, and skip the decoupler. If I have a few spare parts to add I can put some solar panels on it so I don\u0027t have to reload if I accidentally leave \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E on. In any case autostrutting is mandatory.\n\u003C/p\u003E\n\u003Cp\u003E\nIt took me a long while to accept an aerodinamic fairing. I didn\u0027t want to use it because it adds extra cost that is not recovered. But I eventually discovered that a good fairing can increase my payload from 20 to 25 tons (\u003Cem\u003Ethe limit, because then the whole rocket would be 140 tons exactly, and I cannot afford a level 3 launch pad\u003C/em\u003E), while adding 1000 \u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 data-ratio=\u0022100.00\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022 width=\u002220\u0022\u003E that are not recovered. And I generally save a couple tons of fuel, which I can also transfer to my ship.\n\u003C/p\u003E\n\u003Cp\u003E\nThis effective and reliable vehicle allowed me to construct a big ship with limited - yes, I said reliable. For once, I have something that works properly. A few early models exploded because I forgot to autostrut everything and the payload started swinging, but after I worked out the kinks, I never had a catastrophic failure, and I most often make a perfect launch at the first try. This is the only vehicle I developed for this challenge that I would actually use in a normal career.\n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t found a way to reliably land it with precision besides save scumming. Those launchers have too little control to keep retrograde in the atmosphere, so each one will slow down a bit more or a bit less.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E2) Small lander\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTechnically I don\u0027t need science instruments, since I have decided I won\u0027t research anything else. But screw it, I am confident and I want to bring in some luxuries (\u003Cem\u003Ealmost half this thing\u0027s cost is the seismometer\u003C/em\u003E). This time I also can afford to make something with a wide base. I will put a parachute on it, because I will land it back to Kerbin eventually for all those \u0022we came back from ...\u0022 achievements. Since I have it, I can also use it on Duna. So the greater fuel budgets I will need are 1700 m/s to get down and up from Vall, or to get up from Duna after landing with parachutes (\u003Cem\u003Ethe map says 1450, but a large lander will have horrible aerodinamics\u003C/em\u003E). 2000 m/s is a good target for deltaV. I want to use all the science instruments available, I will need a Terrier to get up from Duna. I can use the lighter landing pod, since I will only use it in atmosphere once. I don\u0027t strictly need landing gear, but since I have some spare parts, I decided to put wheels. This is the result\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225K2GQod.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/5K2GQod.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt won\u0027t win a competition, and it\u0027s certainly not suitable for long distances, but it does its job, and it\u0027s very light. It has a total of 2 tons of fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nI will need the full tank to take off from Duna, and also for Vall. For Ike, Bop, Pol and Dres I can use less fuel. If I use it on Gilly and Moho, I will have a chance to get back to Kerbin for refueling. All considered, 8 tons of fuel seem a reasonable stockpile to do everything.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E3) Tylo/Laythe landing\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis gets trickier. Landing on Tylo would require 5000 m/s, so, a rocket with stages. Laythe at least allows aerobraking. In the phylosophy of reusing as much stuff as possible, I settled for an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u003C/abbr\u003E for Laythe, that would then couple with an extra fuel tank to land on Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is what I came up with\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hBiZ2EY.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002237.23\u0022 height=\u0022446\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/hBiZ2EY.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe lower part, that looks like a spaceplane (\u003Cem\u003Eit\u0027s not\u003C/em\u003E), is the lander. It will first land on Laythe, with parachutes. It will land on solid ground, a feat I intend to achieve, again, by save-scumming. The three fuel tanks on the bottom are horrible for flying in atmosphere, but I needed a large base to land this thing upright, or I\u0027d be unable to leave. The docking port in front, and the various instruments jutting out, are also horrible. The fins are needed to keep this thing flying straight - though they double up as landing legs. unfortunately, with low part limits and low technology, that\u0027s all I could come up with. It can take off and orbit from Laythe, at least.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is the only piece I did not send up with the launcher. It has 29 parts, and it is barely not good enough to \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u003C/abbr\u003E from Kerbin. I solved this, again, by putting a disposable fuel tank on top of the docking port.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter it returns from Laythe, the middle tank provides enough fuel to resupply it. It will be drained and discarded.\n\u003C/p\u003E\n\u003Cp\u003E\nThe huge tank on the left with thud rockets on it is the Tylo descent stage. It will be consummed going down, and ditched before take off. I must be careful to couple it with the engines staggered if I don\u0027t want them to just push down the lander\u0027s lateral tanks. This stage was too heavy for the launcher, so I had to send it half empty. I filled it with the spare fuel I had in the other launch vehicles; one ton here, half a ton there, I managed to complete Marco Polonium without needing a dedicated refueling mission for the landers.\n\u003C/p\u003E\n\u003Cp\u003E\nSince this thing is so heavy (\u003Cem\u003Earound 50 tons\u003C/em\u003E) I can\u0027t wait to get to Jool and get rid of all this mass.\n\u003C/p\u003E\n\u003Cp\u003E\nIn retrospect, I made a mistake; I should have added a decoupler after the lander\u0027s command pod. This way, after returning from Tylo, I could keep the pod for the \u0022Returned from Tylo\u0027s surface\u0022 bonus, but I wouldn\u0027t need to carry around a useless reliant engine and some empty tanks. However, I realized it only halfway through the mission, when it became clear I\u0027d need more fuel, and I didn\u0027t want to restart.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E4) Ship core\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter getting a good idea of what I would need to drag around for the mission (\u003Cem\u003Eabout 70 tons of landers and rocket fuel, plus as much liquid fuel as I could afford to send\u003C/em\u003E) it was time to design the main ship. It was clear I\u0027d get a horrible \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E. I could mitigate this with more engines, but I had limited funding. I settled on 4 engines as a compromise. And I wanted a modular design, so I could keep attaching more parts; but also in a way that would be compatible with a moving spacecraft. And I wanted to bring in a few luxuries: a cupola, because you get some real stunning views along the way that I want to enjoy in first person perspective, and a laboratory, because I want to level up my crew (\u003Cem\u003Ecan\u0027t wait to have Jeb at level 3 so I can track the manuevers authomatically\u003C/em\u003E). And to make more science, even if I won\u0027t use it, just FOR SCIENCE!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jUorVoJ.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/jUorVoJ.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the first stage, still coupled to the launcher. The launcher run out of fuel (\u003Cem\u003ENERVs are heavy\u003C/em\u003E), so the Marco Polonium core is towing the launcher to orbit to drop it near the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BQ2GJv6.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/BQ2GJv6.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe first parts are assembled. In the middle, the service probe is handling a couple of fuel tanks\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ByUCXqz.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/ByUCXqz.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA detail of the service probe. I didn\u0027t use it much to handle tanks because direct coupling with the launcher allowed me to leech the launcher of whatever leftover fuel it could still give, but it still turned out very useful.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022W9BfALD.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/W9BfALD.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAssembly goes on. Here I have 2 launchers still attached; the first had plenty of spare rocket fuel, but it could not transfer it to the ship until I sent the larger tanks\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pzMqeBt.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/pzMqeBt.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAll the landers are placed correctly. Now I will send fuel tanks as long as my money will allow\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wEwp6uF.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/wEwp6uF.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that\u0027s it! The Marco Polonium is all its glory!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224YT2xWv.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/4YT2xWv.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFront view\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228hnmJrw.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/8hnmJrw.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd detailed schematics\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow that it is complete, this little jewel totals 192.6 tons, for a total of 194 parts. And I managed to build it entirely with 270k \u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022\u003E. Sending it up in small pieces of no more than 20 tons and 20 parts each. I lost track of the exact number of flights required, but it was about a dozen, in three days of hard\u003Cs\u003E work\u003C/s\u003E gaming, and I consider it one of my finest creations - not because I couldn\u0027t do better, as I have many designs in my regular career that far outstips its performance, but because of the great constraints I took when making it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E when full is 0.12, very low, but it can be worked around with clever manuevering and course corrections. It\u0027s hard to get a good deltaV estimate. As it is, it\u0027s about 5000 m/s with just the liquid fuel festoon, but I will drop spent fuel tanks, and I will use up rocket fuel with the landers, so the mass will also decrease. And when I get to Tylo, I will drop a good half of my mass.\n\u003C/p\u003E\n\u003Cp\u003E\nI would have liked more fuel, if possible, but I literally cannot afford to send up another mission. I could still launch a smaller rocket, but at this point a dozen tons of fuel more or less aren\u0027t going to make any difference.\n\u003C/p\u003E\n\u003Cp\u003E\nHow far will I go? Will I manage to visit enough outer worlds to end the challenge?\n\u003C/p\u003E\n\u003Cp\u003E\nPart 4,\u003Cem\u003E the travels of Marco Polonium\u003C/em\u003E, is still going on. I will post when I finish\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-07-04T22:59:00Z\u0022 title=\u002207/04/2023 10:59  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 4, 2023\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-03T11:50:41Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EPart 4A\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EThe travels of \u003Cem\u003EMarco Polonium\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFirst objective is Duna. With a low \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E, measures must be taken to make effective manuevers. First Marco Polonium raises its periapsis a couple of times, then it gets to Duna with a Mun gravity assist\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YARJMRM.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/YARJMRM.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nInjection burn is minimal, then orbit is lowered with aerobraking. But not all the way. I leave a high periapsis so it will be cheaper to get to Ike later. it will require a bit more fuel on the lander to rendez-vous with the mothership, but the lander is light and has minimal consumption. Nuclear engines are efficient, but still to move Marco Polonium they are drinking plenty of fuel. I\u0027ve already discarded 3 fuel canisters out of 10 available. But when i reach Laythe and Tylo i will be able to drop the heavy lander.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VPpSteh.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/VPpSteh.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDuna landing is ok. For taking off I drive up to the highest mountain in sight, the lander/rover has awful aerodinamics and i\u0027d rather have less atmosphere to deal with.\n\u003C/p\u003E\n\u003Cp\u003E\nIke insertion. I didn\u0027t take screenshots. As worlds, Duna and Ike are quite ugly. Also on Ike i don\u0027t circularize orbit. I send the lander with half fuel, to save a bit of weight. Landing also is ok. Then I wait for the Jool tranfer window\n\u003C/p\u003E\n\u003Cp\u003E\nAgain I use a gravity assist, this time by falling back towards Duna and making the big burn at periapsis\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fWPDjn1.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/fWPDjn1.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe cupola adds one ton of useless weight, all for getting those kind of visuals\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vAQ4vBW.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/vAQ4vBW.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224mYWs8b.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/4mYWs8b.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VppojLY.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/VppojLY.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTotally worth it!\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI use a gravity assist from Laythe to avoid the insertion burn, and also a lot of apoapsis lowering\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RhBBpAj.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/RhBBpAj.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nToo bad I could not find a way to make it work with Ike too (Duna has too small \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E\u003C/abbr\u003E, apoapsis would still be outside).\n\u003C/p\u003E\n\u003Cp\u003E\nAt this point I would like to further lower my apoapsis, but another gravity assist from laythe would put me in a collision course with Jool. I tried raising my periapsis with Vall, but the gain was so tiny, it was not worth the course correction manuever. So, I just finished getting a good trajectory for Laythe by rockets. It still costed 400 m/s to lower the apoapsis and 600 m/s to get captured. I\u0027m getting quite nervous by this time, my fuel stockpile is running low. Even if I will shed a lot of weight after Tylo, it won\u0027t matter if i have no fuel left.\n\u003C/p\u003E\n\u003Cp\u003E\nLanding on Laythe required finding the only island on the equator. It was accomplished with the tested strategy of saving and reloading a lot of times\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Twzzr2x.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Twzzr2x.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rmMaGNw.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/rmMaGNw.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLaythe atmosphere is much harder that i expected. I was expecting something like Duna, where you are basically free of it after getting to 25 km of height, but Laythe brakes you noticeably even at 45 km. And my lander has pretty bad aerodinamics. While I can get back in space without problems, I don\u0027t have enough deltaV to rendez-vous with Marco Polonium without lowering its orbit. which would make going to Vall all the more expensive.\n\u003C/p\u003E\n\u003Cp\u003E\nWith only two fuel canisters left, \u003Cstrong\u003EI give up this attempt\u003C/strong\u003E. I will get to Tylo, maybe even to Bop and Pol, but I certainly won\u0027t ever be able to come back to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s clear I both overestimated how much range the nuclear engines would give me, and I underestimated how much deltaV it would take to accomplish all the trip. Navigating around Jool is all small manuevers, 500 m/s here, 300 m/s there, it\u0027s easy to think they are negligible, but there are a lot of worlds to visit, so they add up. Gravity assist can help some, but if you need to actually stop and orbit each planet, there are limits. And shedding weight from the Laythe/Tylo lander came too late to help.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut I got plenty of money. I could send supplies to finish the trip.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, I could. But I will explain better with a joke\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EA mathematician, a physicist and an engineer are sleeping in a hotel when fire erupts.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe engineer takes the fire blanker and smothers the fire\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe physicist makes some hydrodinamic calculations, then improvises a tube that he attaches to the water tap, extinguishing the fire\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe mathematician wakes up, sees the fire, sees a fire extinguisher on the wall. He declaims \u0022the problem admits a solution!\u0022 and goes back to sleep\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI am much like the mathematician here. Yes, I could easily send extra fuel and finish the trip. It would be easy. And since it would be easy, there would be no challenge in it, and it would not be interesting.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, I have figured a few places where the original design could be improved. I could get more mass on each launch if i used fairings properly. The landers can be improved. The trajectory can be improved, at least to some extent. I am convinced that the objective of launching Marco Polonium with only the Mun/Minmus money, exploring enough worlds to get enough money to finish the challenge without launching anything else, is doable.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I set off to remake Marco Polonium\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-03-28T03:15:59Z\u0022 title=\u002203/28/2024 03:15  AM\u0022 data-short=\u0022Mar 28\u0022\u003EMarch 28\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-03T13:20:50Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EPart 3B (5)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003ERemaking \u003Cem\u003EMarco Polonium\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOptimizing the Laythe/Tylo lander\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhile Marco Polonium failed its task, it behaved well, and proved itself a capable ship. Except for this lander, which was barely adequate.\n\u003C/p\u003E\n\u003Cp\u003E\nThe main problem was the reliant engine. I don\u0027t like using a swivel when I can use a reliant. The reliant is lighter and has more thrust. And a well-made ship won\u0027t need gimbaling because it will be stable on its own. So I feel a swivel is the noob\u0027s option to compensate for the launch system\u0027s shortcomings.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, I won\u0027t have the luxury of launching from a flat surface, and with a 30 part limit, my ship will have shortcomings indeed. Furthermore, the swivel has a higher vacuum Isp; even at Laythe sea level, it is equivalent to the reliant. So, the extra weight is compensated by higher efficiency. Even better, the previous lander had huge fins to keep it stable. The swivel will stabilize the rocket, so I won\u0027t need fins anymore. I\u0027m actually saving weight. And parts count.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd since I can afford some spare parts and Laythe\u0027s atmosphere is challenging, I decided to sacrifice 100 kg to put a cargo bay, and put all the science instruments in it. Now aerodinamics won\u0027t be an issue.\n\u003C/p\u003E\n\u003Cp\u003E\nI removed the fixed solar panels and I put retractable ones inside the cargo bay. This reduced weight, improved power generation, and improved aerodinamics.\n\u003C/p\u003E\n\u003Cp\u003E\nI swapped out the clamp-o-tron in front with a small claw. It looks more aerodinamic, but even in case it was not, it is still much cheaper. \u003Cem\u003E(I didn\u0027t think of it at first because in my regular career, at hard level, the claw won\u0027t allow fuel transfer. But at normal level, it does)\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe older lander could get to orbit from Laythe with 200 m/s left. Maybe. On a particularly good launch. The new lander got to orbit with 400 m/s left on the first try.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, I put a decoupler to get rid of engine and tanks once I won\u0027t be needing them anymore. It\u0027s all extra weight I won\u0027t have to lug around after Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rNlJ4C9.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/rNlJ4C9.jpg\u0022\u003E\u003Cstrong\u003EBefore\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mlFUWfl.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/mlFUWfl.jpg\u0022\u003E\u003Cstrong\u003EAfter\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOptimizing the Tylo descent stage\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPreviously, I put lots of fuel in it, to keep a safe margin. Back at the time, I still assumed weight would not be an issue. Now I know better. I removed a 9-ton tank from the design.\n\u003C/p\u003E\n\u003Cp\u003E\nI also removed all the joints based on the expensive clamp-o-tron junior, and replaced them with decouplers. To launch all the fuel tanks together, I sent them up empty, and filled them with spare fuel when I sent up some components that were light, but part-intensive.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B4X6Mxp.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/B4X6Mxp.jpg\u0022\u003E\u003Cstrong\u003EBefore\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229Rs7LAc.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/9Rs7LAc.jpg\u0022\u003E\u003Cstrong\u003EAfter \u003C/strong\u003E\u003Cem\u003E(notice: the smaller diameter tank is the reservoir for the small lander)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOptimizing the small lander\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe small lander was performing quite admirably, not much to do. Still, I replaced the docking port with a claw, again saving a lot of money. And I swapped out the fixed solar panels with retractable ones.\n\u003C/p\u003E\n\u003Cp\u003E\nNow that I got rid of all the fixed solar panels, the Marco Polonium is much more heat-resistant, allowing for more efficient aerobraking on Duna and Laythe.\n\u003C/p\u003E\n\u003Cp\u003E\nSince there\u0027s no way I\u0027ll be able to reach Eeloo and Dres, I finally reduced slightly the fuel stockpile, from 10 tons to 8 tons.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOptimizing the fuel tanks\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOriginally, I had 10 fuel canisters, each comprising 4 Mk1 tanks. That was unneeded. Each canister only had 1 ton of dry weight, and would provide some 500 m/s of deltaV. I saved some money and weight in docking ports by using bigger canisters, comprising 6 to 10 Mk1 tanks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOptimizing the launch system\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs I mentioned in part 3, I was reluctant to use fairings because most of their cost cannot be recovered. But they increased useful payload more than they increased cost. I also made sure to send some empty fuel tanks, so that I could always drain my launchers of every drop of fuel. And when I run out of money to launch a big supply dump (\u003Cem\u003Ethose cost some 40k, and 20k is recovered from the rocket\u003C/em\u003E), I was able to put together a smaller launcher to fill those tanks that still needed it.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a result, I was able to put 18% more mass into orbit for the same price.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOptimizing electricity and control\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMarco Polonium was suffering electricity shortages around Jool. I could not afford to keep the lab running. I put more solar panels, and I distanced them a bit more from the main body to keep them more exposed to sunlight.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the previous time I already sent all my astronauts in orbit by the time I decided to get science from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E\u003C/abbr\u003E. This time I didn\u0027t, and with the extra science from reports and samples I could afford to unlock large reaction wheels, that are cheaper and use less electricity.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, I put more batteries.\n\u003C/p\u003E\n\u003Cp\u003E\nOverall, this increased cost and mass. But not too much.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224NeJaPu.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/4NeJaPu.jpg\u0022\u003E\u003Cstrong\u003EBefore\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OTkaB8W.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/OTkaB8W.jpg\u0022\u003E\u003Cstrong\u003EAfter\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EMarco Polonium 2\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228UwaFXv.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/8UwaFXv.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bTCkm1J.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/bTCkm1J.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMass: 226.6 tons (up from 192.6)\n\u003C/p\u003E\n\u003Cp\u003E\nFuel \u003Cem\u003E(not including supplies for the landers)\u003C/em\u003E: 132 tons (up from 92)\n\u003C/p\u003E\n\u003Cp\u003E\nDry mass \u003Cem\u003E(again, counting the rocket fuel for landers as dry mass)\u003C/em\u003E: 78 tons (down from 89)\n\u003C/p\u003E\n\u003Cp\u003E\nMore capacity to discard empty mass\n\u003C/p\u003E\n\u003Cp\u003E\nBetter aerobraking\n\u003C/p\u003E\n\u003Cp\u003E\nMore electricity\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTarget: visit Duna, Ike and all the moons of Jool and return to Kerbin\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nWill it succeed where its predecessor di not?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-03-28T03:20:00Z\u0022 title=\u002203/28/2024 03:20  AM\u0022 data-short=\u0022Mar 28\u0022\u003EMarch 28\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-10-04T00:05:11Z","Content":"\n\u003Cp\u003E\nWow can\u0027t believe I missed this until now. Amazing work there and I can\u0027t wait to see how it goes on the second attempt!\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-04T16:35:30Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EPart 4B (6)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EThe travels of \u003Cem\u003EMarco Polonium 2\u003C/em\u003E, part 1: Kerbin, Duna, Ike, Tylo\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWhich planet to visit first?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe first dilemma to answer before even turning on the rockets is where to go first: Jool or Duna?\n\u003C/p\u003E\n\u003Cp\u003E\nDuna is easy to reach, I can use a Mun gravity assist to save some fuel, and reaching Jool is cheaper from it.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, I have 30 tons of Tylo/Laythe lander that I can\u0027t wait to drop off. And visiting Duna when going back also is not too expensive.\n\u003C/p\u003E\n\u003Cp\u003E\nMy first attempt then was to reach Jool directly. This turned out to be the wrong idea, because of the little problem of \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E. Yes, fully loaded with fuel (\u003Cem\u003Efuely loaded?\u003C/em\u003E) the Marco Polonium 2 has a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E of 0.11. And adding more engines is not an option. Sure, I can raise my apoapsis first. But to reach Jool I need a 2000 m/s burn, and at least 1000 m/s must be done when on an escape trajectory. That\u0027s a 15 minute burn, and no way around it. I tried, and I ended up spending some 2500 m/s for the whole thing. I also studied gravity assists, but unfortunately Kerbin, Duna and Jool are never aligned (I gave up after reaching 15 years). I also checked Eve, but a gravity assist from it would pull my apoapsis up to 20 million km, still a far shot from Jool. Not much to be gained there.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I tried going to Duna First. In this case I can easily raise my apoapsis for 600 m/s and split my mun flyby burn into convenient chunks. I only needed a dozen m/s of correction.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKerbin to Duna\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FsbXL0F.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/FsbXL0F.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne big problem for going to Duna is the 600 m/s for capture. I was trying to find gravity slingshots that would help with it, making a flyby on the first approach only to meet Duna again on the next orbit with a lower intercept speed. And while I was experimenting with that, and trying various ways to help with some aerobraking, I discovered that I can actually get a full aerocapture at the first pass! I dipped down to 22 km, I lost 600 m/s, and I didn\u0027t even start overheating anything! I think I\u0027m falling in love with Duna. It\u0027s perfect! Its atmosphere is thick enough that you can do aerobraking, aerocapture, and even use parachutes with just a little bit of rocket braking at the end, but it\u0027s thin enough that it won\u0027t be a huge obstacle when you want to leave. It has enough gravity that you can get a decent kick from a gravity assist, but small enough that going around is cheap. Wonderful planet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LwDnThd.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/LwDnThd.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI managed to get captured, but I didn\u0027t circularize. I retained an elliptic orbit so it would be cheap to go to Ike\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D3RrNBe.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/D3RrNBe.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIt\u0027s only 20 m/s from there\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThen I dropped my lander\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iKiCq2a.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/iKiCq2a.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBob contemplates the sunrise from the window of his lander\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLanding was no problem, I ended up in one of the lowest parts of Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, this makes leaving more problematic, because my lander has such poor aerodinamics that even Duna\u0027s atmosphere can be a serious hindrance. I looked around for a mountain on the equator that I could reasonably reach. I ended up traveling 100 km with this crappy rover on Duna. But hey, I put wheels on it because I figured they may be useful, and they totally were!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tgEY5XD.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/tgEY5XD.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003Eflag is where I landed, at 500 m of altitude. Mount Inadequate is where I took off. I called it Inadequate because, at 3800 m, it\u0027s not as tall as I was hoping for. The previous time I did this, I had a 7000 m conveniently next to my landing place, but I was on the other side of the planet.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOk, I admit I cheated a bit here. I run perhaps one fifth of that distance with the rover. Then I got bored, and I decided to skip direcly on the sloped of mount Inadequate with alt-f12. But it\u0027s not like I couldn\u0027t have done it regularly. I just saved myself four hours of driving\n\u003C/p\u003E\n\u003Cp\u003E\nMount inadequate offers 3% less gravity and 30% less atmosphere than my landing spot, but still at 200 m/s I had to turn down the throttle as the atmosphere was fighting against my ship, and keep the speed constant until I went above 15000 m. Climbing that mountain with the rover, I saved myself 15 more seconds of that, and related fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rover has 2100 m/s available. Even if I spent more than usual on the ascent, I still had enough for rendez-vous with Marco Polonium 2, with a comfortable margin. It was time to move to Ike.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDuna to Ike\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith Duna I was able to get aerocaptured. With Ike, I was determined to use gravity assist to reduce injection burn. Which is just 30 m/s, but still, why not?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mGUEeWg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/mGUEeWg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BIWgElp.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/BIWgElp.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI found a good trajectory. The first flyby raised my Duna periapsis, and after a few more orbits and 3 m/s of course correction I found myself in a second flyby with just 10 m/s of intercept, saving 15 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, I also entered with a high periapsis so it would be cheaper to leave, so I may have saved 25, maybe even 30 m/s! Meh. I somehow doubt it will make a difference.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kTYJGsc.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/kTYJGsc.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EI don\u0027t remember anymore what this trajectory was supposed to be, and I can\u0027t figure it out again. But surely showing this picture will make me look more badass\u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022c99Gs9c.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/c99Gs9c.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThis is my trajectory after the first flyby\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe only problem in all this is that I had loaded the fuel in my lander to comfortably land on Ike, no more. It\u0027s pointless to load the full 2 tons of fuel if I will bring back up most of it. So, as it takes 400 m/s to land on Ike and the same to leave, I loaded around 1000 m/s worth of fuel. I didn\u0027t consider how keeping my mothership in a high, elliptic orbit, not to mention orbiting opposite with the planet\u0027s rotation (\u003Cem\u003Eorbiting in the right direction would have required more course corrections\u003C/em\u003E), would increase those costs.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WupDTBR.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/WupDTBR.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI ended up rejoining the \u003Cem\u003EMarco Polonium 2\u003C/em\u003E with 12 m/s left.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIke to Jool\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe best way to make a big burn from a moon is to fall back on the planet and use it for a slingshot. It\u0027s what I did here\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022O4iEhwl.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/O4iEhwl.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022h8RReH1.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/h8RReH1.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, it\u0027s a 12 minutes burn (\u003Cem\u003Ethe game says 8, but it\u0027s wrong\u003C/em\u003E). But if I time it right, I can perform it while my ship is always going in the same direction, without losing too much efficiency\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022R5ggS6V.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/R5ggS6V.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J8XfcwF.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/J8XfcwF.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lnMf91X.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/lnMf91X.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI tried this manuever three times, always weighting the ship at the end, to find the best place to start burning. It\u0027s difficult to estimate exactly how much I lost for inefficiency of the long burn, probably 100 m/s or a bit less.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FDiQOkH.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/FDiQOkH.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHere I am transferring fuel in real time and dropping fuel canisters as soon as possible.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDoing the sums, I spent\n\u003C/p\u003E\n\u003Cp\u003E\n900 m/s for Duna intercept\n\u003C/p\u003E\n\u003Cp\u003E\n0 m/s for insertion\n\u003C/p\u003E\n\u003Cp\u003E\n50 m/s to get into Ike orbit\n\u003C/p\u003E\n\u003Cp\u003E\n1200 m/s for Jool intercept\n\u003C/p\u003E\n\u003Cp\u003E\n50 m/s or less for various small course corrections\n\u003C/p\u003E\n\u003Cp\u003E\nfor a total of 2200 m/s, actually cheaper than when I tried reaching for Jool directly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GeBY7ss.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/GeBY7ss.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EFirst sighting of Jool\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MdOOdFI.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/MdOOdFI.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qdP52d9.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/qdP52d9.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJool and its moons are always stunning\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ydB7mOt.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/ydB7mOt.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBill also likes them\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Us9SzdZ.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Us9SzdZ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBy now I have enough practice navigating the Jool system with gravity assists. With this Laythe assist I get captured by Jool\n\u003C/p\u003E\n\u003Cp\u003E\nI could save fuel on subsequent manuevers if I managed to aerobrake seriously on Laythe. Good thing I reinforced the ship just for it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tAe3GYo.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/tAe3GYo.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTo prepare for aerobraking, I retracted the solar panels and I moved lander/rover to a more protected position\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aKnNeFw.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/aKnNeFw.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIt\u0027s a bit disqueting seen from the cupola, though\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn this configuration, I tried aerobraking with a 35 km periapsis and.... got destroied. Badly. Laythe\u0027s atmosphere is so strong, I went from 3500 m/s to landing on the planet (those few debris that survived). Later attempts showed that even 48 km are not survivable. And by the way, the solar panels can be retracted, but the batteries cannot, and they are also quite sensitive to heat. I wasn\u0027t able to brake more than 5 m/s from that atmospheric pass.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom my current orbit I could get in Laythe orbit with about 1000 m/s. I will look for more gravity assists to reduce that. First thing to try is raising the periapsis and see the effect on  the next flybys.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd while I was looking for ways to reduce the cost of orbiting Laythe, I stumbled upon something unexpected: a cheap trajectory to Tylo\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EJool to Tylo\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VtC4PVX.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/VtC4PVX.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith only 57 m/s of correction, my next Laythe flyby will put me in a course for Tylo. What sold me on it is the low intercept speed, only 170 m/s to get captured (and a LOT more to circularize, but there\u0027s no way to avoid that.\n\u003C/p\u003E\n\u003Cp\u003E\nMy various stages are intended to be dropped in order doing Laythe first, Tylo second, but they can be managed. I will spend a bit more by not visiting all the moons in order, but finding such a cheap trajectory for Tylo vastly offsets any extra cost. Furthermore, the Tylo descent stage is the heaver of the disposable landers, I will be able to get rid of a lot of mass even sooner than I was planning.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd while I am in Jool orbit with a low periapsis, I take the chance to drop my lander for a dip into Jool\u0027s atmosphere. Val will have the dubious honor of doing a spacewalk inside Jool\u0027s atmosphere, if she\u0027s fast she won\u0027t get killed by it\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VIzhGSx.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/VIzhGSx.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nunfortunately, that\u0027s a significant deviation of trajectory, and I must rejoin with the Marco Polonium 2 before we get different gravity assists and end up in completely different directions. If I had a couple orbits to wait, I could do it more easily, but as it is, I had to reload because the 1200 m/s of fuel I loaded in the lander were not enough to get back. I needed full tanks, and I spent most of them. But I won\u0027t have another chance for a close pass inside Jool, and I won\u0027t have another chance of a good transfer to Tylo. 2 tons of rocket fuel will have to go\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224LKabXF.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/4LKabXF.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJool from Val\u0027s perspective\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wwdxYv9.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/wwdxYv9.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI had many false starts on Tylo. At first I was trying to land from an elliptic orbit, to save liquid fuel. However, I eventually realized I was running low on rocket fuel. Loading less fuel seemed a smart way to save weight when designing the ship, I didn\u0027t consider that with more rocket fuel I can drop my landers from higher orbit, saving fuel for the ship. Now I wonder if I could improve my mission design by planning extra rocket fuel for this, but I really would rather not have to build the Marco Polonium 3 one 20-ton piece at a time.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter some considerations \u003Cem\u003E(which included crashing into Tylo, landing on Tylo and failing to have enough fuel to leave, crashing into Tylo, crashing some more into Tylo, trying to land from a lower orbit and failing to have enough fuel to reach the Marco Polonium 2, crashing into Tylo, sending the lander/rover to tow the Tylo lander, reloading and sending the service probe to tow the lander, and crashing some more into Tylo, because saving fuel requires the more dangerous trajectories)\u003C/em\u003E I decided I would circularize with the Marco Polonium on Tylo and Laythe, because I have a heavy lander. On the other moons I will stay in a high orbit and send down the lander/rover, which is lighter and less consuming. And this required reloading several hours worth of gaming, and crashing into Tylo many more times.\n\u003C/p\u003E\n\u003Cp\u003E\nLanding on Tylo before Laythe required tampering with my fuel tanks.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst i must grab the post-Laythe refueling tank with the lander/rover\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wM9xtAL.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/wM9xtAL.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003Esorry for the bad lighting, but Jool is too far from the sun to get a good illumination\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThen I have to detach the Tylo/Laythe lander, and then I decouple the post-Laythe refueling tank\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wEpYO3x.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/wEpYO3x.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd finally I attach the lander to the Tylo descent stage. Being careful to hit the center, because it would be bad if the thrust was off-center. And being careful that the lateral tanks and the thud engines are staggered, or they won\u0027t give propulsion and will burn my tanks instead. On the plus side, if the thud is pointing at a solar panel, I can just retract the panel\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002295lyhJL.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/95lyhJL.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAnd since I had to change my strategy, I did this procedure 3 times\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally I can decouple the Tylo descent stage and start landing\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yKcxt9l.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/yKcxt9l.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAn optimized landing is a complex matter. On one hand, I would like to use the swivel engine as much as possible, because it has higher Isp than the thuds. I also would like to drain the top tank and discard it fast, because it\u0027s heavy. But I also need a high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E to brake before crashing onto Tylo, which requires keeping the descent stage. And finally, I must be careful to not be hit by the descent stage when i release it.\n\u003C/p\u003E\n\u003Cp\u003E\nEventually, I set off for starting at 40 km, braking with the swivel alone until I am at about 20 km and a bit less than 1,5 km/s, transfering fuel from the descent stage to always refuel the lander. Then I activate the thud and i start braking hard. When there are 5 units of fuel left in the descent stage i release it, the remaining fuel will send it far from my lander \u003Cem\u003E(trying to turn around to release the tank safely costed me too much time and made me crash. Releasing the tank otherwise caused my lander to be hit and destroied by the descent stage. using the thuds earlier was too inefficient fuel-wise)\u003C/em\u003E. Still braking, I manage to stop my lander at 200 meters from the ground. I didn\u0027t take any picture because there was no time.\n\u003C/p\u003E\n\u003Cp\u003E\nBut eventually I managed, and I even saved some fuel over what was planned.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TGN31NA.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TGN31NA.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003Eactually, when I landed, the ladder was shadowed. I had Bob pose for 3 days while the sun reached the right position for a picture. \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221ppE1vV.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/1ppE1vV.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229DCUOaH.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/9DCUOaH.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EStill more scenery porn\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter leaving Tylo, I rendez-vous with the lander/rover, which is still grabbing the fuel tank. Leaving the discarded tank behind like a camper with no sense of civic duty, I then rejoined with the Marco Polonium\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Md40EQb.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Md40EQb.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226v7BKSR.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/6v7BKSR.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAs you can see, I am down to 3 fuel canisters from the starting 7, plus the \u0022core\u0022, non-detacheable tanks. But I dropped a lot of mass with this whole Tylo business, and those tanks I have are all full.\n\u003C/p\u003E\n\u003Cp\u003E\nShip mass is now 108 tons, with 62 of fuel for the NERVs. I estimate the remaining deltaV to around 8000 m/s. It\u0027s impossible to make an exact estimate because there are the drop tanks, the lander fuel will be depleted... Looking at the deltaV map, it\u0027s going to be a close thing. I may have to skip a moon to make it back to Kerbin, but for certain I will be back with enough money to win the no contract challenge. But will I win the \u0022Marco Polonium visits all the Joolian moons\u0022 challenge?\n\u003C/p\u003E\n\u003Cp\u003E\nNext step will probably be Laythe\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-15T13:51:02Z\u0022 title=\u002201/15/2022 01:51  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 15, 2022\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-10-04T17:33:55Z","Content":"\n\u003Cp\u003E\nHey is this Stock Normal? I don\u0027t see any mods but don\u0027t know the settings.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m (finally \u003Cspan\u003E\u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E) putting you on the participants list.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-04T18:04:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223863429\u0022 data-ipsquote-contentid=\u0022197160\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221601832835\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHey is this Stock Normal? I don\u0027t see any mods but don\u0027t know the settings.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m (finally \u003Cspan\u003E\u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E) putting you on the participants list.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyes, just stock and no mods. there are the breaking ground and making history expansions, nothing else.\n\u003C/p\u003E\n\u003Cp\u003E\nP.S. i don\u0027t see my name on the participant list\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-10-04T18:06:40Z\u0022 title=\u002210/04/2020 06:06  PM\u0022 data-short=\u00223 yr\u0022\u003EOctober 4, 2020\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-10-04T18:07:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223863438\u0022 data-ipsquote-contentid=\u0022197160\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221601834684\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyes, just stock and no mods. there are the breaking ground and making history expansions, nothing else.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNormal mode or another, or custom?\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-04T18:07:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223863439\u0022 data-ipsquote-contentid=\u0022197160\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221601834853\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNormal mode or another, or custom?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nnormal, nothing changed\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-10T17:37:57Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EPart 4C (7)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EThe travels of \u003Cem\u003EMarco Polonium 2\u003C/em\u003E, part 2: Laythe, Vall, Bop, Pol\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETylo to Laythe\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs I was hoping, once in orbit around a joolian moon, it is fairly cheap to move to another. The main expence here was circularizing around Tylo, and then reaching escape velocity again. But it takes only a very small extra to reach Laythe, and even less for insertion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Yh4HaKe.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Yh4HaKe.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EOggnM7.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/EOggnM7.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLook how close to circling Laythe my intercept comes. It\u0027s maybe 5 m/s to enter a stable orbit, and it can easily be achieved by aerobraking even in Laythe\u0027s unforgiving atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nI spent quite a bit of time refining trajectories. I can\u0027t count on gravity assists anymore, but I can try to minimize intercept speed. For it was commanded\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cem\u003EThy shalt not wasteth any droppe of fuel\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oCVFwsV.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/oCVFwsV.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFor greater precision, I split the ejection burn in several apoapsis raising manuevers, as I did for leaving Kerbin\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XRjjQO6.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/XRjjQO6.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KVXFLC7.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/KVXFLC7.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESome more spectacular views. Those are the last, as the outer moons are quite ugly\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAt Laythe I gradually circularized with aerobraking, until I entered a 50x100 orbit. In retrospect, I could have dropped my lander from a higher orbit, as my feared shortage of rocket fuel did not materialize after all\n\u003C/p\u003E\n\u003Cp\u003E\nWhether luck or skill was involved, I managed to drop my lander in the middle of Laythe\u0027s biggest island at the second try\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UH7VxgB.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/UH7VxgB.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227BjBY61.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/7BjBY61.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis had the additional advantage of landing at 4000 meters of altitude, where the atmosphere is only 60% of its sea level pressure. It makes for a much smoother ascent\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GBEv0yT.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/GBEv0yT.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe new, improved Laythe lander flew very nicely in the atmosphere. Despite starting from a wrong angle and having to be steered, it never fought against the commands and it always remained very stable. I got a perfect launch the first time, but I went back and launched twice more, just because this rocket was a pleasure to pilot. And I reached orbit with 270 m/s left, despite starting with the tanks 20% depleted.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, Laythe has oceans, and thus it has 2 achievements for landing: one for landing on land, and one for landing on water. For this, my plan called for deorbiting the spent tanks (remember that this lander was made to drop everything after laythe, to save weight for subsequent trips) in a suborbital trajectory and hope they would count as \u0022landing\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222QgXm6e.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/2QgXm6e.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMy periapsis was 50,1 km. The jolt from the decoupler was enough to send the spent part of the lander in a suborbital trajectory. \u003Cem\u003EThy shalt not wasteth any droppe of fuel \u003C/em\u003Eindeed. It took many orbits to finally reenter atmosphere, though. The whole process was hampered by a glitch where adjusting the game speed after leaving the atmosphere would raise my periapsis by 200 meters. when you\u0027re counting on a 49.6 km periapsis to aerobrake, that\u0027s a huge difference.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IEbqu6d.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/IEbqu6d.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe tanks crashed into the sea. Unfortunately, that was not enough to get the splashdown achievement - which apparently requires for the vehicle to not disintegrate on the spot.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter some deliberation, I decided to sacrifice the service probe for it. it had control, and it had a rocket to brake. I kept it around in case it turned out to be useful, and indeed I used it to rescue some launch vehicle that had run out of electricity during assembly of the Marco Polonium. I also used it to rescue the lander on tylo from a low orbit, though I eventually reloaded that. I was reluctant to give it up, but I couldn\u0027t think of any situation where it would be necessary - I could recover from blunders with a reload anyway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022t0hb48E.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/t0hb48E.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bZ8EUn7.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/bZ8EUn7.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith this, I discarded two pieces of the Marco Polonium. Two pieces that have done their job, and have done it well, and after all this time flying them around, I\u0027m getting a bit emotional about it\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEulogy for the lost ships\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Tylo/Laythe lander was born as a one-shot. It was only meant to be used twice, it was meant to be cheap, and it was meant to be light, and it was meant to have a low part count.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yet, it performed admirably. Both times it was used, it flew without a glitch - in Tylo\u0027s case, despite having the descent stage attached asymmetrically (you try getting a perfect alignment with a claw). Both times, it ended up spending less fuel than planned - heck, in Laythe\u0027s case I was able to save two whole tons of fuel out of 10, though that was achieved by leaving them in orbit for they were not needed. Both times, it rocket-landed on high gravity world on rough terrain, and it didn\u0027t flip once. Despite a lack of landing legs.\n\u003C/p\u003E\n\u003Cp\u003E\nTylo/Laythe lander was a real pleasure to fly, a unique fact for this career. Lander/rover... well, the best that can be said about it is that it fulfills its tasks and it is very cheap to operate. Even the Marco Polonium itself, when you get down to basics, is just a command module with some engines, with two landers and a bunch of fuel tanks strapped to it. The only reason it does not pull to the side is that it accelerates so slowly, the reaction wheels can compensate \u003Cem\u003E(now that the ship is much lighter, I cannot use it at full thrust)\u003C/em\u003E. Everything I used in this career had some glaring weakness that I was forced to accept to keep up with the constraints. Everything except Tylo/Laythe lander.\n\u003C/p\u003E\n\u003Cp\u003E\nI said about my reusable launch system that it was the only vehicle I\u0027d import for a regular career. But I was wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nI will miss flying this lander.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhen I conceived the Marco Polonium, \u003Cem\u003Eeverything\u003C/em\u003E about it had a specific function. Everything was meant to be used in a very specific part of its voyage. Everything... except the service probe.\n\u003C/p\u003E\n\u003Cp\u003E\nI sent up the service probe because it could be useful at some point. It had one claw, oversized engine and wheels, as its intended task was moving tanks. But there was no real need for it. the tanks are properly secured, and they will only be released to be discarded. Even when I had to detach the post-Laythe refueling tank because i was dropping on Tylo first, I found it better to use a manned ship for the task - communication was an issue. Sure, I did detach the service probe before leaving Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E\u003C/abbr\u003E, and rejoined it with the main ship around the sun, getting some achievements for a \u0022space station\u0022 in Kerbol orbit. But I could have used a lander for it. I could have discarded the service probe afterwards.\n\u003C/p\u003E\n\u003Cp\u003E\nInstead I kept it. Because I though it would be useful.\n\u003C/p\u003E\n\u003Cp\u003E\nGradually, I worked out all the kinks from my trip, and eventually it became routine. There was no need for an emergency service vehicle. Still, I kept the service probe.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd when I needed something controlled to make a final descent into Laythe\u0027s seas, service probe was there. Though it was never designed for it, when I had a need that I could not fulfill with any of my other vehicles, service probe rose up to the task.\n\u003C/p\u003E\n\u003Cp\u003E\nRest well, little probe. You did, indeed, turn out to be very useful.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ELaythe to Vall\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGetting a Vall intercept was challenging in that, as soon as I was fast enough to leave Laythe, my apoapsis was much higher than Vall\u0027s orbit, resulting in higher intercept speed. A good intercept required a different launch trajectory. But I\u0027m quite proud of the result\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qYwaXp5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/qYwaXp5.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ejection speed is the bare minimum to leave Laythe, and the injection speed is only 10 m/s. If my calculations are correct (a bit difficult to keep into account elliptic orbits) , that\u0027s 25 m/s cheaper than what alexmoon launch planner was calculating as the cheapest trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I\u0027m back to using the little lander, and the Tylo/Laythe lander ended up not using some of its fuel, so I again keep my orbits as elliptic as possible to save fuel on circularization\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fOhRsfh.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/fOhRsfh.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThy shalt keep thy apoapsis as high as thy can, for thy lander consumeth less fuel circularizing and raising again than thy mothershippe\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe only limitation is the lander\u0027s authonomy of 2150 m/s, of which 1700 will be needed to get down to Vall and back... Again, I crashed into Vall\u0027s surface many times, trying to find the very last second to brake.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ahri3VT.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/ahri3VT.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBob admires the surface shortly before \u003Cs\u003Ecrashing\u003C/s\u003E landing on it\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gXHhrdm.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/gXHhrdm.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EScanning a boulder\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nhdGYPz.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/nhdGYPz.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, since \u003Cem\u003EThy shalt not wasteth any droppe of fuel\u003C/em\u003E, I decided I would climb the highest mountain available before taking off. Seen from this perspective,\u003Cem\u003E mount triangle\u003C/em\u003E (\u003Cem\u003Eso named because it has a triangular summit. Yep. Aside from some random bouts of creativity bringing me to names like\u003C/em\u003E Marco Polonium \u003Cem\u003Eor\u003C/em\u003E Dancing Porcupine\u003Cem\u003E, I generally suck at naming stuff\u003C/em\u003E) may not seem much, but it is 5500 m high, and the lander landed at 2000 m. It took 5 days to reach the top. The final slope was very long, and I could only climb some 200 meters before I run out of battery. That, at this distance from Kerbol, took one hour to recharge. Unless there was a Jool eclypse in the way...and all for saving 10, maybe 20 m/s. Totally worth it!\n\u003C/p\u003E\n\u003Cp\u003E\nI reunited with the Marco Polonium with 30 m/s left of fuel. So yes, totally worth saving every scrap I could. Though it\u0027s still almost three times what I had left after Ike...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBop\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBop is difficult to reach because of its inclined orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nHell, no. Bop would be a joke to reach. If this #### game was any decent at calculating closer approaches.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I set up a closer intercept at 2000 km. And then I start moving\u003Cem\u003E, \u003Cu\u003Every\u003C/u\u003E \u003C/em\u003Ecarefully, the cursor. And the intercept would gradually diminish. 1900 km. 1850. And then suddenly it would disappear. No, the distance does not start increasing. It just disappears. And I would see some other \u0022close approach\u0022 marker pointing to something 20 orbits in the future that for some reason the stupid game has decided is the closer approach. and it\u0027s not even an approach anyway. And in this I\u003Cu\u003E\u003Cem\u003E know\u003C/em\u003E\u003C/u\u003E I have an approach just outside of the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E\u003C/abbr\u003E, but good luck finding it blindly. And a course correction would be more expensive than getting a good launch immediately.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only good thing about it is, the deltaV for a vall-Bop transfer is pretty low (some 400 m/s total), so it\u0027s not a huge deal if I end up in a slightly suboptimal trajectory (blasphemy! \u003Cem\u003EThy shalt not wasteth any droppe of fuel!\u003C/em\u003E)\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, after about half an hour of fiddling with the manuever node, I managed to find an intercept that was 1) exhisting, and 2) cheap.\n\u003C/p\u003E\n\u003Cp\u003E\nSince Bop has low gravity and orbital inclination is cheap to adjust, I decided to go look for the kraken.\n\u003C/p\u003E\n\u003Cp\u003E\nI landed some 40 km from it. I spent an inordinate amount of time trying to reach it with the rover. the terrain is so rugged, and gravity so low, I kept capsizing and crashing, even though I was trying to go slowly. Add in the ever-persistent problems with getting enough energy, compounded by being close to the poles, and in shaded valleys\n\u003C/p\u003E\n\u003Cp\u003E\nAfter needing several hours to make 10 km (most of those time spent reloading) I decided to go with the jetpack\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Sxdvz5D.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Sxdvz5D.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xsyqdjR.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/xsyqdjR.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003Elower flag is landing. Upper flag is kraken. The lander is exactly where I got tired and decided to use the jetpack.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QEoaYrs.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/QEoaYrs.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPol\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGetting away from Bop towards another small moon had the same problems of going in. Also, every once in a while Bop and Pol are aligned while closer to the orbital nodes, and this results in a cheaper launch window. I spent 150 days around Bop to wait for it. I opted for a close periapsis because intercept was cheaper, and i stabilized in the most elliptic orbit i could to fix my orbital plane cheaply (at an orbital speed of 17 m/s, I could make a 34 degrees inclination change with almost nothing. it was delightful)\n\u003C/p\u003E\n\u003Cp\u003E\nPol would have been hard to land because of its rough terrain, if it hadn\u0027t such a low gravity. I landed against a ravine, but it was all right\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fnskkA5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/fnskkA5.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStaying landed, though, turned out a bigger problem, when my lander capsized and actually grabbed my EVA astronaut with the claw. A feat I tried to achieve without success other times\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GupQG0n.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/GupQG0n.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BXThGHk.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/BXThGHk.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI had to chase the lander down all the ravine. Luckily, the gravity is so low, nothing broke (and I had previously retracted the solar panels fearing such an eventuality)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt turned out, my initial assessment when I launched the Marco Polonium 1 wasn\u0027t too far off the mark. Yes, I run out of fuel, but it is true that after Laythe and Tylo, navigating the remaining moons is quite cheap, and it becomes even cheaper as the heavy lander is discarded. Indeed, I think if I had just a couple fuel canisters more at Laythe, I would have managed to complete the tour without needing to go back and make a new ship. Though perhaps it was for the best, as I could achieve much more this way.\n\u003C/p\u003E\n\u003Cp\u003E\nI finished the Jool system, and I finished my stated objective. I have 4.5 million funds, which may be enough to upgrade all the buildings already. I could go back home\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xEKVBQL.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/xEKVBQL.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDone during a transfer window, this manuever would see me on Kerbin intercept with 1300 m/s of deltaV. Intercept speed would be 2000 m/s, I\u0027d need to slow down to 900 to stay in Kerbin orbit, then I could slowly aerobrake. But I still have 30 tons of liquid fuel on a 65 tons ship, which should give me about 5000 m/s of deltaV. And I am close to a Jool-Eeloo transfer window. So I\u0027ll try to reach Eeloo first, and then if I have enough spare fuel I will even try to reach Dres. In any case, I have managed the initial objective of winning the challenge with 3 missions. Now it\u0027s about seeing how far I can overshoot that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-03-14T17:19:27Z\u0022 title=\u002203/14/2021 05:19  PM\u0022 data-short=\u00223 yr\u0022\u003EMarch 14, 2021\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-13T17:17:22Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EPart 4D (8)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EThe travels of \u003Cem\u003EMarco Polonium 2\u003C/em\u003E, final part: Eeloo, Dres, Eve, and HOME! \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Ereaching Eeloo\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBop is difficult to reach because of its inclined orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nHell, no. Bop would be a joke to reach. If this #### game was any decent at calculating closer approaches.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGetting to Eeloo is this, compounded a thousandfold. I wanted to intercept it on the orbital node, which I knew the planet would reach in approximately 4 years 80 days. And the Marco Polonium 2 was indeed passing through the orbital node in approximately 4 years 90 days. And try as I might, I still could never find a close approach. I could get to 5 million km, and whenever I got below that, it would disappear, and reappear in a completely unrelated part of the orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nIt didn\u0027t help that I was trying to find that intercept while orbiting a moon in a highly elliptic orbit (\u003Cem\u003Emy orbit around the moon, not the moon\u0027s orbi\u003C/em\u003Et). In the end I had to give up on that, give myself a slight nudge to quit Pol\u0027s orbit, and from a circular orbit around Jool it was much easier. Still a crappy experience, though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KlBxdWu.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/KlBxdWu.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vpMHOI7.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/vpMHOI7.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis time, my trajectory was about 50 m/s more expnsive than the minimum calculated, but what the hell, it was difficult enough already to find any kind of trajectory with this crappy encounter system.\n\u003C/p\u003E\n\u003Cp\u003E\nBy the way, I\u0027m now down to the last fuel canister, and since it creates a significant imbalance in my center of mass (\u003Cem\u003Eit\u0027s like one third of the total mass, hanging on one arm\u003C/em\u003E), I had to adjust my rockets to avoid swerving on the side\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226FZC8VI.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/6FZC8VI.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe trip was long, but uneventful. Eeloo has no special challenge to orbit or land it. Again, I fixed my orbital inclination with the trick of staying in a very elliptic orbit first, and changing inclination while on the far side. Orbital speed of 5 m/s!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Zri6vc2.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Zri6vc2.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cjePomg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/cjePomg.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EA curious glitch where a boulder seems to be floating\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEeloo to Dres\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter Eeloo, since I had plenty of spare fuel, it was time to hit Dres.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, let me clarify something about Dres. You may have heard that Dres does not exhist, and it is just part of a big conspiracy. Indeed, nobody ever visits Dres.\n\u003C/p\u003E\n\u003Cp\u003E\nThe thing is, Dres does indeed exhist, but people would wish otherwise.\n\u003C/p\u003E\n\u003Cp\u003E\nDres ruins people\u0027s lives. It is an unremarkable planet. It has some nice canyons, which are nonetheless much less nice than the Mun\u0027s one. I still have to drive my favourite rover through Dres canyons, but they look like they don\u0027t compare. And it\u0027s goddamn expensive to reach. You can ignore its orbital inclination when you get an intercept on an orbital node (\u003Cem\u003Eindeed, the only places in the orbit where it is somewhat less expensive to get an intercept\u003C/em\u003E) but you still need to pay that as injection deltaV. And then, when you leave Dres, you again will have a high inclination compared to anything else. And there is no atmosphere to aerobrake, and it\u0027s also too small to use for gravity assists. But if I want to complete my tour of the outer planets, I have to go there.\n\u003C/p\u003E\n\u003Cp\u003E\nAt least I have enough fuel left; even though I discarded the last fuel canister in leaving Eeloo and I only have the main tank left, now that I\u0027m down to 40 tons of mass, the Marco Polonium runs very cheaply.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OpHSes0.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/OpHSes0.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TURnoUk.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/TURnoUk.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd here I am in Dres orbit, barely below the escape speed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022U7pcMS4.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/U7pcMS4.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGetting a lander on the planet and up again is so unremarkable I didn\u0027t even think to take pictures. I also roved around the surface a bit, visiting 3 biomes. I also fell down one of the canyons, because I was too lazy to take a detour. By now I\u0027m feeling very tired. I\u0027ve been about this challenge since the end of august, and each time I could have surpassed it, but each time I decided to come back and do it better. Now I have fulfilled all my objectives, and a part of me just wants to be done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222zEAkSf.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/2zEAkSf.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EI did that this nice picture of scanning a Dres meteorite, though\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the last I\u0027ve used the lander/rover. I have 800 kg of oxidizer left, enough for about 1500 m/s. In the end, my estimate on how much rocket fuel I would need was pretty much spot  on.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDres to Eve, \u003Cem\u003Evia\u003C/em\u003E Duna\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSince I still had enough fuel left, I decided to take a detour and visit Eve. I was hoping I could reach Gilly, but even barring that, I could at least orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nBut getting from Dres to anywhere is a big mess, because of the aforementioned orbital inclination. An Eve intercept would require at least 2 km/s for injection. How can I lose that accursed speed on the Z axis?\n\u003C/p\u003E\n\u003Cp\u003E\nBy aerobraking on Duna, of course. I can get an intercept for Duna much cheaper than I can get for Eve. In Duna I can enter orbit completely by aerobraking, and this will conveniently match me to Duna\u0027s orbital inclination and speed. I can fix whatever remaining inclination from a highly elliptic orbit. Then I can orbit around Ike with a fairly low cost, and when the transfer window comes, I can fall back on duna and use it to slignshot away, again for a relatively low cost. It\u0027s much cheaper than going straight for Eve.\n\u003C/p\u003E\n\u003Cp\u003E\nI have to reiterate, I love Duna. Both times I didn\u0027t need to get there, and both times I found going there more convenient than going straight for my target. Thank you, you beautiful planet! I don\u0027t care that your surface is ugly, I love you anyway. See, Dres, you should try to be a bit more like him.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yyxWbbR.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/yyxWbbR.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAerobraking from a cockpit perspective. The thing attached in front is the lander/rover, which I attached there to keep the ship balanced.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nReaching Ike was a bit more expensive than last time, I couldn\u0027t find an equally good gravity assist and I ended up spending some 100 m/s between various manuevers. Still, cheaper than starting from low Duna orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, 700 m/s should be enough to put me in an intercept with Eve\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225cVi2JR.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/5cVi2JR.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, I wasn\u0027t able to skip a 300 m/s plane change midway. I\u0027m not understanding it, but somehow all other attempts to reach eve would still cost 300 m/s. I could cheat on inclination to reach Eeloo and Dres, but not Eve? this deserves some consideration.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027m growing increasibngly impatient with reaching the end. At the beginning, I would have strived harder for gravity assists, but now I just want to be done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224oilV33.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/4oilV33.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd here I enter Eve\u0027s orbit. Unfortunately, the direction is completely wrong to reach Gilly. I also could not aerobrake (tried it, ship broke up completely), so I had to spend some additional fuel. I could have reached Gilly, at the price of being stranded there.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBack HOME!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI was left with only 1 km/s, just enough to get back to Kerbin.In fact, it was enough only if I didn\u0027t spend any extra. An elliptic orbit is great to leave the planet, but only if you can burn prograde near periapsis. And of course, during the Kerbin transfer window the direction I should have left was completely different. With too few fuel to try tricks, and not enough motivation to look for gravity assists, I decided to brute force the problem. I did my periapsis burn and managed to cross Kerbin\u0027s orbit on a node. Then I would just have to wait to reach the planet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DzHJTg3.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/DzHJTg3.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m gaining 40 days every year, and I\u0027m about 100 days ahead of Kerbin. I will have to wait in this orbit... something like 8 years. In the last one, I will have to make a slight correction.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce more, this #### #### #### close approach engine wasn\u0027t any help\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zCeg35r.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/zCeg35r.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HNPf5ae.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/HNPf5ae.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI am actually on an encounter course with Kerbin, I haven\u0027t done any manuever between those two screenshots. Just, in the second I fixed a manuever node a bit ahead of time. In the first I still had a manuever node set so that I would reach Kerbin in three quarters of orbit, and still the #### #### #### engine \u003Cstrong\u003Ewould not spot my encounter\u003C/strong\u003E.\u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E I could forgive every other bug, but not this one. The other bugs, I\u0027d have no idea how to fix; for this close approach, I myself could easily design an algorithm that does a better job.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wp8zEgL.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/wp8zEgL.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin intercept. I had to raise my periapsis to 60 km, or the ship would be destroied. I still broke a science Jr, but at this point I didn\u0027t care anymore\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Z42YgvW.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Z42YgvW.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI forgot to turn off the rockets for a bit, and I was left with 90 m/s and an apoapsis at 8000 km. I could have saved fuel by stopping just after stabilizing orbit, but again, I didn\u0027t care anymore.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AaAbVeT.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/AaAbVeT.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI moved lander/rover to grab what\u0027s left of the Tylo/Laythe lander for recovery.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QYIur4N.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/QYIur4N.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBob grabs the 280 science experiments stored in the container to bring them to ground\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gTZIzNV.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/gTZIzNV.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EDetaching for the last time\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LYo6KuW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LYo6KuW.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAerobraking. I lost the wheels to go faster, again I didn\u0027t care\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JCGpoPt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JCGpoPt.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHome, sweet HOME!!!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Marco Polonium 2 has traveled for 34 years and one month. Which, incidentally, is also my age, within a few weeks. there may be some cosmic significance to this\n\u003C/p\u003E\n\u003Cp\u003E\nObligatory massive science screen. I could have gained more if I hadn\u0027t been broadcasting all the crew reports (was convenient to keep track of which biomes I already experimented)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022T079n67.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/T079n67.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PV0RkyS.png.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PV0RkyS.png.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe exact amount of reputation hopefully does not have any cosmic significance\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, the end screen. All buildings upgraded, 3 total missions used \u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003E(counting a big ship assembled into orbit in multiple launches as a single mission, not counting missions that did science on the launchpad without ever flying)\u003C/em\u003E\u003C/span\u003E, 2.5 million funds left. Challenge completed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OA1nY6u.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OA1nY6u.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003EThe end\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-03-28T03:27:41Z\u0022 title=\u002203/28/2024 03:27  AM\u0022 data-short=\u0022Mar 28\u0022\u003EMarch 28\u003C/time\u003E by king of nowhere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-10-23T01:52:45Z","Content":"\n\u003Cp\u003E\nNicely done! Sorry for taking so long it\u0027s been a crazy... well 2020 but in particular this month.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223867127\u0022 data-ipsquote-contentid=\u0022197160\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221602609442\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/13/2020 at 1:17 PM, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUnfortunately, I wasn\u0027t able to skip a 300 m/s plane change midway. I\u0027m not understanding it, but somehow all other attempts to reach eve would still cost 300 m/s. I could cheat on inclination to reach Eeloo and Dres, but not Eve? this deserves some consideration.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI believe the problem you have here is due to time. Eeloo and Dres move slowly, way out there away from the Sun. Eve whips around the Sun quickly so nailing the timing is extra difficult. Read: expensive in fuel \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-18T23:04:39Z\u0022 title=\u002201/18/2021 11:04  PM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 18, 2021\u003C/time\u003E by Superfluous J\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AtomicTech","CreatedById":210823,"CreatedDateTime":"2021-10-07T19:14:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223867127\u0022 data-ipsquote-contentid=\u0022197160\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221602609442\u0022 data-ipsquote-userid=\u0022204876\u0022 data-ipsquote-username=\u0022king of nowhere\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/13/2020 at 12:17 PM, king of nowhere said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003EPart 4D (8)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EThe travels of \u003Cem\u003EMarco Polonium 2\u003C/em\u003E, final part: Eeloo, Dres, Eve, and HOME! \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Ereaching Eeloo\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGetting to Eeloo is this, compounded a thousandfold. I wanted to intercept it on the orbital node, which I knew the planet would reach in approximately 4 years 80 days. And the Marco Polonium 2 was indeed passing through the orbital node in approximately 4 years 90 days. And try as I might, I still could never find a close approach. I could get to 5 million km, and whenever I got below that, it would disappear, and reappear in a completely unrelated part of the orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nIt didn\u0027t help that I was trying to find that intercept while orbiting a moon in a highly elliptic orbit (my orbit around the moon, not the moon\u0027s orbit). In the end I had to give up on that, give myself a slight nudge to quit Pol\u0027s orbit, and from a circular orbit around Jool it was much easier. Still a crappy experience, though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/KlBxdWu.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022KlBxdWu.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/KlBxdWu.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/vpMHOI7.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022vpMHOI7.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/vpMHOI7.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis time, my trajectory was about 50 m/s more expnsive than the minimum calculated, but what the hell, it was difficult enough already to find any kind of trajectory with this crappy encounter system.\n\u003C/p\u003E\n\u003Cp\u003E\nBy the way, I\u0027m now down to the last fuel canister, and since it creates a significant imbalance in my center of mass (it\u0027s like one third of the total mass, hanging on one arm), I had to adjust my rockets to avoid swerving on the side\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/6FZC8VI.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00226FZC8VI.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/6FZC8VI.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe trip was long, but uneventful. Eeloo has no special challenge to orbit or land it. Again, I fixed my orbital inclination with the trick of staying in a very elliptic orbit first, and changing inclination while on the far side. Orbital speed of 5 m/s!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/Zri6vc2.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022Zri6vc2.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Zri6vc2.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/cjePomg.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022cjePomg.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/cjePomg.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EA curious glitch where a boulder seems to be floating\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEeloo to Dres\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter Eeloo, since I had plenty of spare fuel, it was time to hit Dres.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, let me clarify something about Dres. You may have heard that Dres does not exhist, and it is just part of a big conspiracy. Indeed, nobody ever visits Dres.\n\u003C/p\u003E\n\u003Cp\u003E\nThe thing is, Dres does indeed exhist, but people would wish otherwise.\n\u003C/p\u003E\n\u003Cp\u003E\nDres ruins people\u0027s lives. It is an unremarkable planet. It has some nice canyons, which are nonetheless much less nice than the Mun\u0027s one. I still have to drive my favourite rover through Dres canyons, but they look like they don\u0027t compare. And it\u0027s goddamn expensive to reach. You can ignore its orbital inclination when you get an intercept on an orbital node (indeed, the only places in the orbit where it is somewhat less expensive to get an intercept) but you still need to pay that as injection deltaV. And then, when you leave Dres, you again will have a high inclination compared to anything else. And there is no atmosphere to aerobrake, and it\u0027s also too small to use for gravity assists. But if I want to complete my tour of the outer planets, I have to go there.\n\u003C/p\u003E\n\u003Cp\u003E\nAt least I have enough fuel left; even though I discarded the last fuel canister in leaving Eeloo and I only have the main tank left, now that I\u0027m down to 40 tons of mass, the Marco Polonium runs very cheaply.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/OpHSes0.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022OpHSes0.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/OpHSes0.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/TURnoUk.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022TURnoUk.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/TURnoUk.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd here I am in Dres orbit, barely below the escape speed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/U7pcMS4.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022U7pcMS4.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/U7pcMS4.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGetting a lander on the planet and up again is so unremarkable I didn\u0027t even think to take pictures. I also roved around the surface a bit, visiting 3 biomes. I also fell down one of the canyons, because I was too lazy to take a detour. By now I\u0027m feeling very tired. I\u0027ve been about this challenge since the end of august, and each time I could have surpassed it, but each time I decided to come back and do it better. Now I have fulfilled all my objectives, and a part of me just wants to be done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/2zEAkSf.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00222zEAkSf.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/2zEAkSf.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EI did that this nice picture of scanning a Dres meteorite, though\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the last I\u0027ve used the lander/rover. I have 800 kg of oxidizer left, enough for about 1500 m/s. In the end, my estimate on how much rocket fuel I would need was pretty much spot  on.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDres to Eve, \u003Cem\u003Evia\u003C/em\u003E Duna\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSince I still had enough fuel left, I decided to take a detour and visit Eve. I was hoping I could reach Gilly, but even barring that, I could at least orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nBut getting from Dres to anywhere is a big mess, because of the aforementioned orbital inclination. An Eve intercept would require at least 2 km/s for injection. How can I lose that accursed speed on the Z axis?\n\u003C/p\u003E\n\u003Cp\u003E\nBy aerobraking on Duna, of course. I can get an intercept for Duna much cheaper than I can get for Eve. In Duna I can enter orbit completely by aerobraking, and this will conveniently match me to Duna\u0027s orbital inclination and speed. I can fix whatever remaining inclination from a highly elliptic orbit. Then I can orbit around Ike with a fairly low cost, and when the transfer window comes, I can fall back on duna and use it to slignshot away, again for a relatively low cost. It\u0027s much cheaper than going straight for Eve.\n\u003C/p\u003E\n\u003Cp\u003E\nI have to reiterate, I love Duna. Both times I didn\u0027t need to get there, and both times I found going there more convenient than going straight for my target. Thank you, you beautiful planet! I don\u0027t care that your surface is ugly, I love you anyway. See, Dres, you should try to be a bit more like him.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/yyxWbbR.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022yyxWbbR.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/yyxWbbR.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAerobraking from a cockpit perspective. The thing attached in front is the lander/rover, which I attached there to keep the ship balanced.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nReaching Ike was a bit more expensive than last time, I couldn\u0027t find an equally good gravity assist and I ended up spending some 100 m/s between various manuevers. Still, cheaper than starting from low Duna orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, 700 m/s should be enough to put me in an intercept with Eve\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/5cVi2JR.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00225cVi2JR.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/5cVi2JR.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, I wasn\u0027t able to skip a 300 m/s plane change midway. I\u0027m not understanding it, but somehow all other attempts to reach eve would still cost 300 m/s. I could cheat on inclination to reach Eeloo and Dres, but not Eve? this deserves some consideration.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027m growing increasibngly impatient with reaching the end. At the beginning, I would have strived harder for gravity assists, but now I just want to be done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/4oilV33.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00224oilV33.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/4oilV33.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd here I enter Eve\u0027s orbit. Unfortunately, the direction is completely wrong to reach Gilly. I also could not aerobrake (tried it, ship broke up completely), so I had to spend some additional fuel. I could have reached Gilly, at the price of being stranded there.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBack HOME!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI was left with only 1 km/s, just enough to get back to Kerbin.In fact, it was enough only if I didn\u0027t spend any extra. An elliptic orbit is great to leave the planet, but only if you can burn prograde near periapsis. And of course, during the Kerbin transfer window the direction I should have left was completely different. With too few fuel to try tricks, and not enough motivation to look for gravity assists, I decided to brute force the problem. I did my periapsis burn and managed to cross Kerbin\u0027s orbit on a node. Then I would just have to wait to reach the planet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/DzHJTg3.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022DzHJTg3.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/DzHJTg3.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m gaining 40 days every year, and I\u0027m about 100 days ahead of Kerbin. I will have to wait in this orbit... something like 8 years. In the last one, I will have to make a slight correction.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce more, this #### #### #### close approach engine wasn\u0027t any help\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/zCeg35r.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022zCeg35r.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/zCeg35r.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/HNPf5ae.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022HNPf5ae.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/HNPf5ae.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI am actually on an encounter course with Kerbin, I haven\u0027t done any manuever between those two screenshots. Just, in the second I fixed a manuever node a bit ahead of time. In the first I still had a manuever node set so that I would reach Kerbin in three quarters of orbit, and still the #### #### #### engine \u003Cstrong\u003Ewould not spot my encounter\u003C/strong\u003E.\u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E I could forgive every other bug, but not this one. The other bugs, I\u0027d have no idea how to fix; for this close approach, I myself could easily design an algorithm that does a better job.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/wp8zEgL.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022wp8zEgL.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/wp8zEgL.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin intercept. I had to raise my periapsis to 60 km, or the ship would be destroied. I still broke a science Jr, but at this point I didn\u0027t care anymore\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/Z42YgvW.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022Z42YgvW.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/Z42YgvW.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI forgot to turn off the rockets for a bit, and I was left with 90 m/s and an apoapsis at 8000 km. I could have saved fuel by stopping just after stabilizing orbit, but again, I didn\u0027t care anymore.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/AaAbVeT.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022AaAbVeT.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/AaAbVeT.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI moved lander/rover to grab what\u0027s left of the Tylo/Laythe lander for recovery.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/QYIur4N.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022QYIur4N.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/QYIur4N.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBob grabs the 280 science experiments stored in the container to bring them to ground\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/gTZIzNV.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022gTZIzNV.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/gTZIzNV.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EDetaching for the last time\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/LYo6KuW.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022LYo6KuW.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LYo6KuW.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAerobraking. I lost the wheels to go faster, again I didn\u0027t care\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/JCGpoPt.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022JCGpoPt.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JCGpoPt.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHome, sweet HOME!!!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Marco Polonium 2 has traveled for 34 years and one month. Which, incidentally, is also my age, within a few weeks. there may be some cosmic significance to this\n\u003C/p\u003E\n\u003Cp\u003E\nObligatory massive science screen. I could have gained more if I hadn\u0027t been broadcasting all the crew reports (was convenient to keep track of which biomes I already experimented)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/T079n67.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022T079n67.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/T079n67.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/PV0RkyS.png.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022PV0RkyS.png.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PV0RkyS.png.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe exact amount of reputation hopefully does not have any cosmic significance\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, the end screen. All buildings upgraded, 3 total missions used \u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003E(counting a big ship assembled into orbit in multiple launches as a single mission, not counting missions that did science on the launchpad without ever flying)\u003C/em\u003E\u003C/span\u003E, 2.5 million funds left. Challenge completed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/OA1nY6u.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022OA1nY6u.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OA1nY6u.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cstrong\u003EThe end\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI just came across this, I absolutely love this!\n\u003C/p\u003E\n\u003Cp\u003E\nAwesome work!\n\u003C/p\u003E\n"}]}