{"TopicId":198428,"ForumId":51,"TopicTitle":"Terran(ism) Space Program (finished!)","CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-11-29T23:42:17Z","PageNum":6,"Articles":[{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2021-11-25T21:16:10Z","Content":"\n\u003Cp\u003E\nHmm, that design definitely looks familiar! \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHaving rear-facing thruster pods instead of forward-facing ones makes all the difference though.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGlad it\u0027s still working quite well in its reverse engineered variant.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-11-25T21:30:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224059286\u0022 data-ipsquote-contentid=\u0022198428\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221637874970\u0022 data-ipsquote-userid=\u002236109\u0022 data-ipsquote-username=\u0022The Destroyer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, The Destroyer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHmm, that design definitely looks familiar! \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHaving rear-facing thruster pods instead of forward-facing ones makes all the difference though.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGlad it\u0027s still working quite well in its reverse engineered variant.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThose rear-facing thrusters came in handy during one sim when I started the final braking burn a little bit too late. I’m also not a fan of engines pointing backwards as a rule.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I painted it a different colour so obviously it’s \u003Ci\u003Ecompletely\u003C/i\u003E unrelated in any way… \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-11-28T12:06:17Z","Content":"\n\u003Cp\u003E\nAs it turns out, the water supplies stolen from the Moon rover aren\u0027t enough for a year on the base- in fact they\u0027re good for about two months. Blue Counter 2 was dispatched to resolve that situation and landed a few days later, but a bit off course.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022M8wXXt5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/M8wXXt5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027ll spend some time driving over to the base, during which the liquid hydrogen will mysteriously boil off in its entirety (again! what\u0027s with that?).\n\u003C/p\u003E\n\u003Cp\u003E\nNext up, a post-sunset launch of the Mars ship\u0027s main section containing the crew quarters, life support and supplies and the Earth return stage. The rocket got a second sunset during the descent, which was very picturesque; however fairing separation turned into a nightmare...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Cpp5tcF.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Cpp5tcF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s just say that it took repeated attempts to launch this rocket, with frequent explosions and game crashes, before it eventually made it to orbit intact.\n\u003C/p\u003E\n\u003Cp\u003E\nSmash cut to White Tombaugh for a course correction that will send it hurtling past Pluto at a distance of under 150km, with a relative speed of 30km/s, in about 4 years. There\u0027s room to fiddle with it further, possibly even to graze its atmosphere and/or get a flyby of Charon that would last about two seconds, but zero chance of capturing into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aCPEMDp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aCPEMDp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBack to the Moon and the Blue Counter 2 arrived at the Moon base, topped up the food, water and lox tanks (no liquid hydrogen left at this point or it would have topped that up too), put the rest of the supplies into the crew rover and then made a rather misguided attempt to pick up the crew\u0027s lander and move it closer to the base, which failed miserably.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022p8GiRAX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/p8GiRAX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith that done, the rover was driven away a bit and range safety was fired to destroy it.\n\u003C/p\u003E\n\u003Cp\u003E\nStill on the topic of rovers, look who\u0027s finally arrived!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022b4WiECZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/b4WiECZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMany thousands of kilometres later (at a blistering 80cm/s cruise speed) the Orange Island rover found the Blue Pawn sample return craft and transferred its collection of samples over. Or at least, it tried to. As it turned out, it was simply impossible to get all the samples over to the two avionics units in the ascent craft and instead they\u0027d just move four over to one of them, then move those four between the two avionics while leaving two samples on the rover. It took a lot of save file digging before I finally found where the sample storage stuff is hidden, then applied a bit of hacking to make one avionics on the Blue Pawn have enough storage space for all the samples.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThere\u0027s just no way to transfer specific samples to a specific part with Kerbalism even when there\u0027s plenty space available, but I didn\u0027t feel like trying to edit the save to move the samples themselves around as that would probably break everything...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nWith its primary objective complete, the Orange Island drove off towards the Mariner Valley to continue its secondary science mission. It\u0027s still collecting samples and might end up taking them to the crewed lander if it\u0027s close enough.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next major launch is possibly the heaviest payload I\u0027ve ever launched, with the possible exception of the Black Galileo mission to Mercury- the Mars ship\u0027s core booster. 650 tons in total, its purpose is to capture into Mars orbit and adjust the orbit as necessary after that- maybe swing by Phobos at some point to do a landing there. This is the first real launch of the Black Empress launch rocket, with the two boosters for the Mars ship due to launch on the same design- I may make some further tweaks to those based on what happened to this one.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XJtSxKQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/XJtSxKQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA slightly unusual combination of 2x F-1A and 1x E-1A(KS) on each booster and 7x M-1U on the core, the boosters also have large hydrolox tanks that feed into the core while the boosters are attached; the fuel for the booster engines runs out a bit earlier than the fuel for the core engines so there\u0027s a short stretch where the boosters are still attached but not burning, something that I may address by shutting down the E-1s earlier or via design tweaks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226gvJ2XJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6gvJ2XJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe White Hubble space tug prepared to rendezvous, but during the wait for its first burn another mission needed attention:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TOJxEHN.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TOJxEHN.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBlue Bishop Ceres arrived at the asteroid belt\u0027s largest dwarf planet, once again with the magic disappearing hydrogen that seems to be plaguing this install lately- at this point I have no qualms about save file hacking to put it back because I know it\u0027s a bug and shouldn\u0027t be happening.\n\u003C/p\u003E\n\u003Cp\u003E\nOrbital insertion was completed without incident and the probe settled into an orbit that hits space low and high to rake in the science. There\u0027s plenty of fuel left for a landing attempt, but after the instability issues with the identical Blue Bishop Vesta that\u0027s an objective that will only be attempted once all the orbital science is done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WZz9Plr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/WZz9Plr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStill on the topic of Ceres- the transfer window is currently open, though it\u0027s a pretty terrible one (either that or a MechJeb update has made it spit out some really weird transfers). It\u0027s so bad that if I wait a year for the next window it\u0027s 4km/s cheaper and will still arrive at the same time. Of course I still launched stuff at Ceres though, it\u0027s still worth a try even if they might not succeed, right? First up was the White Ptolemy scanning probe:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tfixC9C.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tfixC9C.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFollowed within an hour by the Blue Draughtsman orbital science probe:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aMFFzFC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aMFFzFC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWill either of them have enough fuel to capture into Ceres orbit? I honestly don\u0027t know, but right now it doesn\u0027t look particularly good. On the flip side, I just noticed that I accidentally put two radar scanners and no SAR scanners on there so I can correct that for the Vesta mission and send a corrected version out to Ceres next year in the cheap window.\n\u003C/p\u003E\n\u003Cp\u003E\nA few more minor events:\n\u003C/p\u003E\n\u003Cp\u003E\nOrange Hill 2 arrived at the Moon base, transferred samples from crew rover to base. That\u0027s all this rover is for, but since it can\u0027t be done any other way and I plan to do more Moon exploration with the crew rover it\u0027s worth having.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J0mTyjv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/J0mTyjv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCourse corrections for the two Blue Bungalow Mk2 orbiter/rover missions to Venus- one\u0027s staying in the ecliptic plane while the other goes polar.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022T98PAwS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/T98PAwS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd after all that, it was \u003Cem\u003Efinally\u003C/em\u003E time for the White Hubble to grab the Mars ship core booster to tow it over to the Mars ship main hull. Things didn\u0027t go entirely to plan at first:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jK4gjCr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/jK4gjCr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEven KJR can\u0027t hold this thing straight! Let\u0027s try again, but grabbing the booster right in the middle instead of by one engine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SC46CBg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SC46CBg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat looks more stable, at least. I haven\u0027t fired the nuclear engines up yet as the game crashed just after this; if it turns out the klaw simply isn\u0027t up to the task I\u0027ll need to add avionics and proper \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to the two side boosters so they can all fly their own rendezvous and docking instead of using the NST for that.\n\u003C/p\u003E\n\u003Cp\u003E\nNo final scores this time due to game crash, but things are ticking along nicely- KCT points keep coming in all over the place, the remaining parts of the Mars mission are being built and White Huygens is on the launchpad waiting for the perfect time to launch to Saturn.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/elqVKKD\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/elqVKKD\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: Is the Space Tug a viable option for orbital assembly?\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-12-02T17:46:13Z","Content":"\n\u003Cp\u003E\nComing back to some missions I launched a while ago but which are now about to do what they were originally made for, the Blue King orbiter/lander combination mission reunites over Phobos, its cargo of surface samples safely stored for transport.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YKyWJ2h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YKyWJ2h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe original idea was to go to Deimos too, but there\u0027s simply not enough fuel left for that- just getting down to the Blue Queen return craft in low Mars orbit will be cutting it very finely indeed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Xjls4WZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Xjls4WZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDouble docking done, all remaining fuel from the Blue King is transferred to the Blue Queen and the samples have also been handed over. The Blue King orbiter and lander are now adrift in Mars orbit, completely out of propellant but otherwise still functional and able to scrape up some orbital science.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022v5GBfm6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/v5GBfm6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext, the Vesta transfer window opened. Cue two launches- first the orbital science probe Blue Draughtsman Vesta:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002204Qv3Rj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/04Qv3Rj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then the heavy scanning probe White Ptolemy V:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZIgkRFc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ZIgkRFc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHopefully they\u0027ll both have the fuel to capture into useful orbits; the alignment for Vesta is a lot better than the Ceres one was and the White Ptolemy got some minor tweaks to make it more capable and boost its range a little bit after what happened to the Ceres one- which I reckon will be some way short of capturing into orbit, but oh well.\n\u003C/p\u003E\n\u003Cp\u003E\nOver to Venus where the pair of Blue Bungalow Mk2 rovers arrive, capture into elliptical orbits, drop their periapses, drop their rovers off and then boost back into orbit. One stayed in the plane of Venus\u0027 orbit around the sun, the other went polar.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eZliygY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eZliygY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022y6aktD2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/y6aktD2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022q1y6Lh0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/q1y6Lh0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CiCRo5L.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CiCRo5L.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe orbiters were soon joined by the Blue Draughtsman Venus, parking into a 90 degree inclination, relatively low altitude orbit by burning its upper stage to depletion. The probe itself has about 1500m/s of fuel in it, enough to boost its apoapsis up to space high pretty much anywhere it wants, but there\u0027s loads of space low science to be had first.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KEEal1L.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KEEal1L.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022s49B0tM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/s49B0tM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd last, but definitely not least, the first of two side boosters for the Mars ship was launched. A convenient orbital alignment meant it could rendezvous directly with the ship instead of needing the Nuclear Space Tug\u0027s help, using its second stage to set up the rendezvous and match velocities after making orbit. (The addition of some \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E on that second stage was a great idea and overall I\u0027m really pleased with how well this rocket is performing- lobbing 650 ton payloads into LEO is practically routine now!)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BeuWRze.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/BeuWRze.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gmLf3Fi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gmLf3Fi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNote the red X on the side- that was added so the NST has something to aim at while grabbing it, it\u0027s right over the centre of mass so should make things a bit more stable.\n\u003C/p\u003E\n\u003Cp\u003E\nFiring pairs of engines on the second stage at low throttle- the NK-15-VM can throttle down to 52%- was plenty for the rendezvous and speed matching burns, though time warp related teleportation was an issue and forced a second rendezvous after the ship suddenly went from 500m to 5km away. Despite the lack of MLI, the sheer size of the tank plus that big radiator meant that boiloff wasn\u0027t too bad for the few hours of operation the second stage had, plus there was fuel left to deorbit it afterwards.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NwDjK94.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NwDjK94.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mFqnwDd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mFqnwDd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs you might expect, docking two very large, very heavy objects together took a very long time- so long, in fact, that while rendezvousing was completed in daylight, docking would take place in the dark.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAs is right and proper.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jIKz5gu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/jIKz5gu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA few \u003Cem\u003Ealmost\u003C/em\u003E dockings later and it finally held.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SRlSd9h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SRlSd9h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow all I need to do is repeat that process with even lower FPS, and add the lander. The lander is already built and could be launched now, but I\u0027m still debating whether I should send the crew up in the lander or retrofit an androgynous Apollo docking port to a Yellow Croissant and use that instead.\n\u003C/p\u003E\n\u003Cp\u003E\nNo final scores screenshot this time because I forgot, but due to a massive influx of science the free KCT points keep stacking up. The next Jupiter mission will be ready a few days before the optimal transfer window and then there are some course corrections to be done for a bunch of active missions.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/y65d4Ng\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/y65d4Ng\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: Final assembly of the Mars ship, which probably needs a proper name (suggestions anyone?), and I also need to pick the crew for this mission. Everyone is getting Apollo mission training (except Dan and Arkady who are on the Moon right now) so they\u0027ll all be eligible. Decisions, decisions...\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-12-04T11:39:29Z","Content":"\n\u003Cp\u003E\nThis is the 100th post in this series. That can only mean one thing...\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:48px;\u0022\u003EMONTAGE!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FnJcSGV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/FnJcSGV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220xn5jca.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0xn5jca.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ltAKUFP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ltAKUFP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rS0mLX1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/rS0mLX1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oPrPgqo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oPrPgqo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fAPN4jJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fAPN4jJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220mnD4X1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0mnD4X1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tlTGIP1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tlTGIP1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tMUMM3H.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tMUMM3H.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CIAnjyK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002267.50\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CIAnjyK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HIBSgfr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002267.50\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/HIBSgfr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022javo9w2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002267.50\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/javo9w2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lYhP0Rx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/lYhP0Rx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ol1XFhX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Ol1XFhX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fOCqWsb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fOCqWsb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RDRsRsk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RDRsRsk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002297yO80r.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002260.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/97yO80r.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022z3DX82Q.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/z3DX82Q.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rk1tBWL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/rk1tBWL.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nFirst launch of update 100 itself is a rather ambitious quadruple rover mission to Jupiter, aiming to put one rover on each of the four Galilean moons. A single stage will perform the Jupiter transfer burn and then capture into some kind of orbit at the other end, in the plane of the moons, so the rovers can then make their own way to their targets. Hopefully.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mOc5GSN.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mOc5GSN.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pNKmiL3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pNKmiL3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter accidentally rendezvousing with the wrong thing, Blue Pawn finally met up with Blue Queen in Mars orbit to hand over its cache of surface samples.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gay4sWd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gay4sWd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA few calculations revealed that it\u0027s possible to get this thing back to Earth, but only by using the remaining fuel in the Blue Pawn first then discarding it, burning the engines on the Blue Queen until it goes below 1.2t weight then ditching the top avionics and fairings to lighten it, relying solely on the return capsule\u0027s avionics for control after that. I also realised that the return capsule itself has \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E thrusters, but no fuel for them...\n\u003C/p\u003E\n\u003Cp\u003E\nThe final superheavy launch rocket for a while, a Black Empress carried up the second side booster to the Mars ship in orbit. Again, convenient orbital timings meant a rendezvous was easy in a couple of orbits without the need for the nuclear space tug.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CbjhCeb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CbjhCeb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dcEUFfi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dcEUFfi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnly two components left now- the Mars lander and the crew. First to launch was the crew- mission commander and pilot Tim (Timothy Sullivan, one of my original four!), scientist Terri (Powell) and engineer Vikky (Viktoriya Oprinchuka) were chosen for this mission, with pilots Diana (another original four) and Vicky flying up with them just to get the \u0022five crew in space\u0022 thing and the bonus funds that come with it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vsPCnO4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vsPCnO4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WI6KYYE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/WI6KYYE.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eDsvy3J.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eDsvy3J.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThree crew transferred over to their new home for the next few years, along with all the life support resources and \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E propellant that the Yellow Croissant had to spare, before Diana and Vicky said their goodbyes and headed back down.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zXT1tCp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zXT1tCp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA little while later the Mars lander was launched. By this point the orbit of the Mars ship was a bit out of alignment- while earlier launches occurred when the ship was coming over the horizon and so were able to launch almost to a direct rendezvous, this one was launching after the ship had passed overhead and had to fly in a low orbit for a while to catch up.\n\u003C/p\u003E\n\u003Cp\u003E\n \u003Cimg alt=\u0022J6EX6XX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/J6EX6XX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fWFxkwf.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fWFxkwf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUsing the little hypergolic thrusters that will also perform the deorbit burn around Mars, the lander had no trouble flying over and docking to the ship.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002252lqxOB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/52lqxOB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA course has been plotted to Mars in just under 50 days, requiring about 5.5km/s delta-V in total to get from LEO to LMO (with a bit more to match the plane of Phobos and any course corrections), which is well within the 6.5km/s currently available from the main and side boosters. Cutting down on the shielding for the crew modules was more than enough to offset the weight of the lander; the crew will be well protected from radiation by putting those big fuel tanks between the sun and the crew section. \n\u003C/p\u003E\n\u003Cp\u003E\nFinal scores:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oSEDeK6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oSEDeK6.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/jgNPGMI\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/jgNPGMI\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: There\u0027s a crew flight in LEO going on right now for contracts, and I still need to send a new crew to the Moon station; the original contract for that timed out, so I had to accept it again (oops...) and will dispatch a crew in due course. There are also a lot of course correction burns for various missions coming up and the departure of the Blue Queen back to Earth, as well as the Mars ship heading off from Earth to Mars shortly afterwards.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-12-04T11:39:51Z\u0022 title=\u002212/04/2021 11:39  AM\u0022 data-short=\u00222 yr\u0022\u003EDecember 4, 2021\u003C/time\u003E by jimmymcgoochie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-12-09T17:17:05Z","Content":"\n\u003Cp\u003E\nSadly, no Mars ship departure yet. Instead I went and spent \u003Cem\u003Efour days\u003C/em\u003E making a geostationary contract sat launcher. But first, I made this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oNZxaMX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oNZxaMX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a Mercury rover which should\u003Csup\u003E[citation needed]\u003C/sup\u003E have the delta-V to make it down to Mercury, then down to the surface. It\u0027s also the first time I\u0027ve tried a six-booster version of the White Cloud rocket, which I\u0027m calling White Cumulus; at just over 4 kilotons it\u0027s about as far as I can push this design, there\u0027s no room for more boosters around the core.\n\u003C/p\u003E\n\u003Cp\u003E\nNow back to the geostationary rockets, which took so long because I painstakingly compared all the available options for the upper stage and second stage to find the best combination for each- comparisons were made between build cost and time, overall delta-V and burn time, mass, reliability and ignition count. The winning combination was an upper stage powered by the Agena 2000 and a second stage powered by the RD-57M; the Agena 2000 is pretty reliable and offered the best delta-V of any available hypergolic upper stage whilst maintaining a reasonable \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E and burn time, while the RD-57M offers better performance at a lower build cost and time than the other engines I tested for that role and 11 ignitions- but with a frankly terrible 14% ignition failure rate! With 5000 units of payload on board the F-1A first stage is a bit overpowered, producing a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of over 2 at full throttle and about 1.7 when operating at minimum throttle (about 85%), but with 10,000 units of payload the greater fuel requirements bring it down to a more reasonable 1.5 at full thrust.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mx8Nt4d.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mx8Nt4d.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225L6UrwU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5L6UrwU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTesting concluded that geostationary contracts were feasible so the tanks were tooled up and two different rockets were made- Blue Chit holds 5k of payload, while its big brother Blue Chip holds 10k. That\u0027s all well and good, but that 14% failure rate is worryingly high and could really use some improving.\n\u003C/p\u003E\n\u003Cp\u003E\nEnter the Blue Meeple, a hasty conversion of the Blue Chit into a lunar orbit science probe with the best experiments money can buy. The reduced payload mass meant it could be launched on a first stage using two E-1As as an F-1A stage was stupidly overpowered, while the RD-57M on the second stage had extra telemetry to improve reliability as much as possible. Sure enough, the first ignition was a failure and once TLI was completed the remaining ignitions were used up to try and induce more failures; across the two Blue Meeple probes there were a total of three failures which improved the ignition failure rate from 14% to just 2.5%, which is much better.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SnVZcsO.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SnVZcsO.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224BnrPWq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4BnrPWq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt the same time as those missions, I also launched a crew up to the Moon to fulfil that \u0022crew the Moon station\u0022 contract that timed out a little while ago, as well as a crewed lunar orbit contract. Of course, this being me I didn\u0027t realise until they docked to the station that the lunar orbit contract required a higher orbit than the station was in so they\u0027ll need to do that before they go home...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022504eoaq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/504eoaq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oivtK54.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oivtK54.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225Z8vxGf.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5Z8vxGf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd while all that was going on, a crew were sitting in LEO for a couple of weeks for two more crewed orbit contracts. At this point I started experimenting with TUFX profiles- when I tried this before I got annoying circular artifacts on any planet or moon, but now that seems to have been resolved and it looks rather good.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore TUFX:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vsx0OCp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vsx0OCp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter applying EVO 0.3\u0027s TUFX profile:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Mb4eNcB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Mb4eNcB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLooks nice, right?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, the first real launch of a Blue Chit geostationary contract sat, which went totally according to plan with no-\n\u003C/p\u003E\n\u003Cp\u003E\nOh, who am I kidding? It was terrible! First the gimbal on the F-1A was limited too far so it kept flipping out before it reached max Q, then the upper stage avionics were insufficient for the weight of the craft and it had to burn a load of fuel to regain control (while tumbling slowly and pointing retrograde for some of it!), then I messed up the calculation for the timing of the resonant orbit to get above the point on the surface that the contract wanted and did it backwards; fortunately for me I was doing it backwards to begin with, so the two backwards-es cancelled out and it ended up right where it was meant to go in one orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022w9f6TTo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/w9f6TTo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002250Yt1AK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/50Yt1AK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd once again, my contract curse struck: completing the geostationary weather sat contract meant that second-gen weather sat contracts are no longer offered, which removes the majority of the income for each Green Condor rocket launch. While I can still build them in just over a day and they have a large profit margin even with just sun-synchronous contracts, I feel like it\u0027s time to call a halt on that. After many years and close to a hundred successful launches across the various iterations of this design, this is the last launch of a 60 ton contract sat.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022n8Xggsz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/n8Xggsz.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAt least, it is until I get bored and throw one on the build queue just to keep the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E crews occupied...\n\u003C/p\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/1COdWQb\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/1COdWQb\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: Mars ship departure? It might actually happen this time, but there\u0027s still more stuff I can do. There\u0027s a Mercury window about to open and a third White Galileo probe standing by to launch for it- this one uses a nuclear engine because why not; the Mercury rover won\u0027t be ready in time so will have to wait for the next one.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-12-11T21:13:43Z","Content":"\n\u003Cp\u003E\nShort update with Important Things\u003Csup\u003ETM\u003C/sup\u003E in it.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, White Galileo 3 departs for Mercury without even needing to turn on the nuclear engine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227xqceBQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7xqceBQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oU2gJ7d.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oU2gJ7d.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt this point I decided to turn off the TUFX filter in flight view as it makes things a bit too blue in atmosphere. I\u0027m keeping it on in map view though, it looks better there.\n\u003C/p\u003E\n\u003Cp\u003E\nOver to Mars as the Blue Queen sample return craft makes a rather complicated return burn to Earth. First, the remaining fuel in the Blue Pawn lander was burnt to give it a little kick:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fvpHwuY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fvpHwuY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen that got discarded and the craft turned 180 degrees to use its own engines, burning until it weighed 1.22 tons. Once it reached that weight, the upper avionics (with the magnetometer on it) was decoupled and the avionics on the sample return capsule took over; that avionics can only handle 1 ton of mass and the upper avionics weighs 220kg, hence the wait for the weight. Once the avionics was decoupled, the remainder of the craft scooted sideways a bit before completing the burn:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IJYj7Sn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/IJYj7Sn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNot sideways enough- the magnetometer broke a solar panel, but at this point it only needs one panel anyway as the power demands are much lower without any experiments to run or data to transmit. A small course correction will put it on course for a pretty aggressive Earth re-entry, which I\u0027m hoping will work due to the whole \u0022no \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel on the return capsule\u0022 thing...\n\u003C/p\u003E\n\u003Cp\u003E\nAlso at Mars, the Orange Island rover has made its way over to the Valles Marineris:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eDqwi2z.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eDqwi2z.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat isn\u0027t the edge of the valley over on the left, that\u0027s a strange cloud layer (that might be a bug in EVO 0.3); those cliffs go up even further than that.\n\u003C/p\u003E\n\u003Cp\u003E\nNow to launch some stuff towards Mars instead of away from it, starting with a Blue Draughtsman science probe:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022doOIlKM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/doOIlKM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n(Zoom in close on that image and you\u0027ll see a tiny orange speck just above the rocket; that\u0027s Mars)\n\u003C/p\u003E\n\u003Cp\u003E\nThis launch was followed by (at last!) the departure of the Mars ship:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227JRB1iI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7JRB1iI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022R947GJ1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/R947GJ1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Zdi2vJ8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Zdi2vJ8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPerhaps unsurprisingly, stability on those boosters was a bit of an issue when physics warp was applied- having two 600\u002B ton boosters with ~6MN of thrust each attached solely by a single docking port half way up will do that- and then the docking ports didn\u0027t release via staging or action groups so I had to drop the boosters by hand, hence the staggered decoupling. Other than the sheer length of the burn (~8 minutes at ~1/3 real speed) there were no real issues, and a course correction burn has been plotted to get a good Martian periapsis with another due later to get into the plane of Phobos.\n\u003C/p\u003E\n\u003Cp\u003E\nThere should have been another launch to send the Yellow Pie crew rover out to Mars too, but that thing was cursed.\n\u003C/p\u003E\n\u003Cp\u003E\nNo, really, it was cursed- trying to launch it via KCT just sent me back to the Space Centre without spawning it in on the launchpad, along with half a dozen random extra buttons on the toolbar (duplicates of a few including KSPedia as well as the mission scoreboard button that should never appear in career mode!); opening the craft in the editor didn\u0027t help as it was uneditable and wouldn\u0027t disappear when I clicked the new craft button either; reloading the game didn\u0027t fix either problem and eventually I had to abandon the idea entirely. I may be able to scrape together a new version by modifying the design used on the Moon rover (which ironically was adapted from the original design for the Mars rover) and building that without KCT to make up for the cursed version.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, Blue Bishop Jupiter arrived at its destination and braked into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022l7UPi0G.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/l7UPi0G.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe capture burn was plotted to get a nice intercept of Callisto pretty much at apoapsis, giving a nice little gravity assist to raise its periapsis a bit and (hopefully) make encountering the other moons easier in the future- and get some easy contract money for four flybys on top of the Jupiter orbiter contract it already completed.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also been tweaking the new geostationary contract rocket a bit, switching from a 1:1 ratio of weather and communications payloads to 1:9 as commsat contracts need a lot more payload. The interstage between stage two and the upper stage has been changed from a solid fairing piece to a deployable one as stage separation was inducing a spin due to the engine bell hitting the fairing; the Agena engine seems to start up with the gimbal cranked all the way over for some odd reason and even without the fairing present it still lurches to one side before correcting. Completing two contracts at once is a good way to net over 600k per flight, not including advances, though it feels a little bit cheaty as the commsat contracts take 2 minutes to complete after the orbit is reached whereas weathersat contracts require 6 hours, so I have to engage some fairly aggressive time warping to get them both done before the craft blinks out of existence.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/h8BVKV5\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/h8BVKV5\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: I\u0027ve begun to work on a Venus ship, which looks almost identical to the Mars ship but instead of a lander it carries an Apollo Block 4 mission module and a Yellow Pain-au-chocolat (which may or may not make the final version) and all the crew science experiments you can do somewhere other than low Earth orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-12-16T17:28:28Z","Content":"\n\u003Cp\u003E\nDespite the many hours of KSP that have happened since the last update, there\u0027s not a whole lot to show for it. Most of that is for one reason and one reason alone- GPS network contract.\n\u003C/p\u003E\n\u003Cp\u003E\nBut first...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002211blBBf.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/11blBBf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGeostationary communications network contract wants four satellites in GEO with 1750 units of commsat payload each? No problem- stick four of these little box-sats on the first two stages of a Blue Chip rocket and it can easily put them into a resonant orbit to deploy nicely in geostationary orbits.\n\u003C/p\u003E\n\u003Cp\u003E\nThat contract unlocked the GPS and GLONASS contracts; I picked GPS because the failure cost was much lower, the two contracts pay the same overall and require the same number of identical satellites either way. Minor tweaks to the probes from the GEO network and the Blue Chit rocket and the Blue Token GPS was ready to go.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022p7giEw9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/p7giEw9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLaunch four probes in one go to each orbit, position in a 3/4 resonant orbit then circularise one on each of the four subsequent orbits. Not difficult, but time-consuming as each circularisation burn takes over 10 minutes (0.06TWR \u003Cspan\u003E\u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E) and having to stop and do a burn every 8 hours or so means not much time progression- and of course having more than one set of probes on the go at once just makes that worse.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oLAFLac.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oLAFLac.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLittle dinky solar panels cost about 1 fund each and weigh a few hundred grams, but are enough to keep the probes powered as long as the avionics are off; with the avionics on they last a few days in total.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B1Eg47E.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/B1Eg47E.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSloooooooooow burns with these things, but at 10x physics warp it\u0027s not so bad. Normally the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E systems will go nuts at 10x physics warp and repeatedly overcorrect as they can\u0027t seem to react quickly enough, but that little generic engine from ProbesPlus has thrust vanes which act like a gimbal- no \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E panic, just smooth flying.\n\u003C/p\u003E\n\u003Cp\u003E\nIn between all that, Blue Bishop Jupiter was busy playing gravity pinball as it visited three of Jupiter\u0027s major moons in less than two orbits of Jupiter:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B7KbLhr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/B7KbLhr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pDQcKWu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pDQcKWu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002216ETRKf.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/16ETRKf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEach encounter provided a small gravity assist, then a burn of about 500m/s set an intercept course with the next one. Unfortunately Ganymede doesn\u0027t want to play- it\u0027s in the completely wrong place to get a flyby within the next orbit, or the one after that either. There\u0027s still about 2500m/s of fuel left in the tanks overall though so reaching it won\u0027t be too difficult, however capturing into orbit of a moon will probably need more gravity assists to reduce the relative velocity.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/bLJ8yLM\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/bLJ8yLM\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: More GPS tedium, but there\u0027s also a Mercury window due to open and a Mercury rover waiting for it, plus a few other missions doing course corrections (including the four White Herschel S probes going to explore the moons of Saturn) and that Ganymede flyby.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-12-26T22:55:09Z","Content":"\n\u003Cp\u003E\nBrief update: I’m currently AFKSP (away from KSP) due to travelling home for Christmas- and to a potato laptop that can’t even run stock KSP- but I plan to be back in another 10 days (travel restrictions dependent!) and will pick this series up again when I get back.\n\u003C/p\u003E\n\u003Cp\u003E\nOn a sort of related note- I made an actual contribution to RP-1! It’s not a huge one, granted- just fiddling with the prices on the ProbesPlus dishes to bring them in line with stock/ReStock instead of being pointlessly overpriced- but still…\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-05T21:01:15Z","Content":"\n\u003Cp\u003E\nIt\u0027s a new year, I\u0027ve come back after a few weeks AFKSP and forgotten most of what I was doing. Time to take stock and check what\u0027s what and going where.\n\u003C/p\u003E\n\u003Cp\u003E\nBut first, a couple of stragglers from before Christmas:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RWopxdC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RWopxdC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSix pretty tedious launches and a whole lot of \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E alarms later the GPS network is up and running. Having two dozen satellites in Earth orbit won\u0027t help much with save file bloat, loading times or general game performance, but they function as a communications network that covers almost the entire planet so I\u0027m reluctant to delete them.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022thdp2Ol.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/thdp2Ol.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA big launch as the core of the Venus ship heads to LEO. It\u0027s not too different from the core of the Mars ship and the rest of the parts are pretty similar too; the differences are mostly smaller solar panels, more radiators- and the distinct lack of a lander! It\u0027ll be replaced by an Apollo block 4 mission module to allow more crew science to be brought along for the trip.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow for some rocket stock-taking:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HPxXM4m.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/HPxXM4m.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGreen Condor Mk4, a 60 ton sun-synchronous weather sat launcher that launched dozens of times with almost no issues, completing second generation and sun-synchronous weather sat contracts for considerable profit, but now retired since geostationary contracts are more lucrative. The design has come a long way from its first iteration as the Green Starling:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Cs5fRxZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Cs5fRxZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nReading back through my own reports, I was surprised to discover that the Green Condor started out doing Molniya orbit contracts, before eventually the payload requirements got too high and I repurposed it solely for weather satellites. There was a brief period where Molniya orbit contracts were done with a 150 ton rocket called Grey Torus, however the payload requirements soon exceeded its capabilities too so a new rocket was needed. Enter the Orange Cliff:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022l2lLCA7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/l2lLCA7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA distant relative of the Green Condor that used some of the same toolings and engines, and originally using a hydrolox second stage before switching to kerolox, it\u0027s had a few iterations since then culminating with the Orange Cliff Mk5 above. Putting 3000 units of payload into a retrograde tundra orbit isn\u0027t easy, but this thing can \u003Cem\u003Ejust\u003C/em\u003E do it; or complete prograde tundra and any Molniya orbit with ease. And no, I didn\u0027t design it to be like the R-7, that just happened. The Orange Cliff was retired at the same time as the Green Condor, making way for geostationary contracts instead.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen it came time to design a cheap crewed LEO ship, the Orange Cliff rocket found another use launching the Yellow Croissant:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227Gdjql5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7Gdjql5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt might look a little bit ridiculous, plonking a 4m wide pod onto a 2.5m wide rocket, but it\u0027s cheap, effective, reliable and still fits on the 350 ton pad. It can also put the crew bit- an Apollo Block 3 capsule with a custom service module and the Apollo Block 4\u0027s engine- into a good orbit (up to 400km) without using any fuel from the craft itself, leaving the crew free to use all their propellant for contract chasing. Currently on its third iteration (Mk3).\n\u003C/p\u003E\n\u003Cp\u003E\nWhile the Green Condor and Orange Cliff both worked well as contract sat launchers and for getting loads of data units for engines that were later used elsewhere (RL-10 and RD-58 configs that were later used for crewed lunar flights, for example), a time came when all those little rockets started slowing things down too much (Green Condor Mk4 was building in 27 hours!) for relatively modest payouts. It took several days and several pages of A4 paper, but in the end I made these:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229T2hquD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9T2hquD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LsYyIZX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LsYyIZX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Blue Chit (above) and Blue Chip (below) are both geostationary satellite launchers; the Blue Chit carries a total of 5000 units of payload (500 weather, 4500 comms) while the larger Blue Chip carries 10,000 payload (1000 weather, 9000 comms). Both use the same upper stage- the Agena-2000 config of the Agena-8096C- with a hydrolox second stage (RD-57 for the Blue Chit, NK-15-VM for the Blue Chip) and an F-1A first stage that\u0027s 10m longer on the Blue Chip. Despite their size, they build extremely quickly- a little over 4 days for the Blue Chit and barely a day more for the Blue Chip. The first stage was borrowed from an existing rocket, previously seen launching a variety of Blue Chess-class missions including to Mars, Venus, Ceres, Vesta and even out to the gas giants. The F-1A\u0027s combination of high thrust at a low price, high reliability and long burn time is hard to beat.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, the Yellow Pain-au-Chocolat (currently at Mk5) lunar crew ship:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229tRXrRw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9tRXrRw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOriginally adapted from the Yellow Croissant, the Yellow Pain-au-chocolat packs more supplies, more life support and a lot more delta-V thanks to its twin RD-58 propulsion. The design initially used a four booster White Stratus rocket, however this was overkill and a smaller two-booster variant is more than enough to send it on its way to the Moon. Total mass on the launchpad is about 750 tons, \u003Cem\u003Eslightly\u003C/em\u003E too heavy for the 700 ton pad but much lighter than the 1200 ton monstrosity I used to send Gemini pods out to the Moon only a few game years ago.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAnd just for fun, behold! The largest and heaviest rocket I\u0027ve ever launched! (Simulations excluded)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223Kh3Yyk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3Kh3Yyk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbal for scale.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227v8lmoR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7v8lmoR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XQZz49j.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/XQZz49j.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNearly 140 metres tall, weighing over 11300 tons including the payload (of 650 tons) and able to put that payload into orbit with enough fuel to do orbital rendezvous with the upper stage afterwards. The rocket is the Black Empress, while the payload is the core stage for the Interplanetary Ships going to Mars and soon Venus.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nNow to trawl through all the active vessels to see what they are and what they\u0027re doing... This might be easier sorting by planetary body, so here goes:\n\u003C/p\u003E\n\u003Cp\u003E\nEarth:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhite Hubble NST, the nuclear space tug originally intended to assemble the Mars ship in orbit; turned out to be largely unnecessary as the upper stages of the launch rockets could do the rendezvouses.\n\u003C/li\u003E\n\u003Cli\u003E\nThree Blue Backgammon orbital imagery satellites, running that 20 year, 10,000 science digital imaging experiment as fast as they can.\n\u003C/li\u003E\n\u003Cli\u003E\nFour Grey Kebabs, also running the digital imaging experiment.\n\u003C/li\u003E\n\u003Cli\u003E\nThree Super Relays, providing the high-bandwidth communications needed to dump all that digital imaging data down to the DSN stations as fast as possible.\n\u003C/li\u003E\n\u003Cli\u003E\nTwo Grey Tokamak probes, running various science experiments in polar orbits. One is in space high, the other in space low, both continue to send back data at a slow but steady rate.\n\u003C/li\u003E\n\u003Cli\u003E\nGreen Stork, an old science probe launched to the plane of the Moon to spot transfer windows. Science experiments are finished now.\n\u003C/li\u003E\n\u003Cli\u003E\nFour Orange Beach relays in a medium (5Mm) polar Earth orbit, providing communications coverage across both poles and for most of the rest of the planet too.\n\u003C/li\u003E\n\u003Cli\u003E\nTwenty four GPS satellites...\n\u003C/li\u003E\n\u003Cli\u003E\nOne Blue Chip GEO contract sat, just need to run the timers down on the contracts and that\u0027ll disappear.\n\u003C/li\u003E\n\u003Cli\u003E\nAnd White Lagrange, just launched on its way to Mercury but still in Earth\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E right now.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nMoon:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nTwo Blue Meeple science probes in polar orbits, plenty of science still to be run.\n\u003C/li\u003E\n\u003Cli\u003E\nGrey Tokamak M, also in polar orbit. Most of its science is done but the orbital perturbation experiment still has 7 years left to run.\n\u003C/li\u003E\n\u003Cli\u003E\nYellow Profiterole, the Moon station in retrograde orbit roughly in the plane of the Moon\u0027s orbit of Earth. Three crew currently aboard, two of which will be heading down to the surface soon. Two Yellow Pain-au-chocolats docked, one Yellow Muffin reusable Moon lander docked, one White Planck fuel tanker docked.\n\u003C/li\u003E\n\u003Cli\u003E\nYellow Yum-yum, Moon base in Mare Nectaris. Two crew currently aboard, though stress and radiation exposure are building and they\u0027ll be returning to the station and then back to Earth the next time the station\u0027s orbit passes overhead. One Blue Counter resupply rover attached via klaw, Orange Hill 2 rover also attached via klaw for sample storage and transfer.\n\u003C/li\u003E\n\u003Cli\u003E\nYellow Baklava, crewed Moon rover parked beside the Yellow Yum-yum.\n\u003C/li\u003E\n\u003Cli\u003E\nYellow Muffin, crew lander on the Moon\u0027s surface about 3km from Yellow Yum-yum.\n\u003C/li\u003E\n\u003Cli\u003E\nFour Orange Dish relays in highly inclined orbits giving near-total coverage of the Moon\u0027s surface and orbit.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSun:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nFour White Herschel S orbiter probes heading to Saturn, exact targets TBD. Landing attempts may be made depending on delta-V.\n\u003C/li\u003E\n\u003Cli\u003E\nFour White Herschel J orbiter probes heading to Jupiter, each targeting one of the Galilean moons. Landing attempts may be made depending on delta-V.\n\u003C/li\u003E\n\u003Cli\u003E\nWhite Galileo 3, Mercury orbital science probe with nuclear engine heading to Mercury.\n\u003C/li\u003E\n\u003Cli\u003E\nBlue Queen, Mars sample return probe carrying samples back to Earth.\n\u003C/li\u003E\n\u003Cli\u003E\nThree Blue Bishop science probes heading to Saturn, Uranus and Neptune.\n\u003C/li\u003E\n\u003Cli\u003E\nThree Blue Draughtsman probes heading to Mars, Vesta and Ceres. Ceres mission may fail due to poor transfer window, a replacement has been built for the next one.\n\u003C/li\u003E\n\u003Cli\u003E\nWhite Euclid, cluster rover mission heading to Jupiter, currently aiming to land on all four Galilean moons.\n\u003C/li\u003E\n\u003Cli\u003E\nWhite Huygens, orbiter and lander cluster mission heading to Titan.\n\u003C/li\u003E\n\u003Cli\u003E\nTwo White Ptolemy heavy scanning probes heading for Ceres and Vesta. Ceres mission may fail due to poor transfer window, a replacement has been built for the next one.\n\u003C/li\u003E\n\u003Cli\u003E\nWhite Tombaugh, high-speed mission to Pluto to arrive within 5 years of launch.\n\u003C/li\u003E\n\u003Cli\u003E\nMars ship, carrying crew of 3 to Mars.\n\u003C/li\u003E\n\u003Cli\u003E\n \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nMercury:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhite Galileo, science experiments largely completed but still has lots of data to send back.\n\u003C/li\u003E\n\u003Cli\u003E\nBlack Galileo, extreme overkill lander mission that managed to land and then fly about 70km to another biome. No signal to check experiment status.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nVenus:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBlue Knight Venus, scanning and scientific probe in polar orbit. Scans nearly complete, still plenty of science to gather.\n\u003C/li\u003E\n\u003Cli\u003E\nThree Blue Bungalow orbiters in varying orbits. Science largely complete in space high, orbits don\u0027t spend much time in space low.\n\u003C/li\u003E\n\u003Cli\u003E\nThree Blue Bungalow rovers on the surface. Some science left to gather but heavily constrained by available power.\n\u003C/li\u003E\n\u003Cli\u003E\nBlue Draughtsman Venus, science probe in polar orbit. science mostly complete but still gathering orbital perturbation data.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nMars:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nOrange Island, sample gathering rover currently moving through Valles Marineris towards Olympus Mons gathering samples and science data as it goes.\n\u003C/li\u003E\n\u003Cli\u003E\nOrange Canyon 1 lander, the first lander on Mars. Barely functional due to solar panel degradation, no signal to check science status.\n\u003C/li\u003E\n\u003Cli\u003E\nBlue Knight Mars, scanning and science probe in high polar orbit. Scans complete, science ongoing.\n\u003C/li\u003E\n\u003Cli\u003E\nBlue King orbiter and lander, defunct craft that previously gathered surface samples from Mars and its moons and brought them to Blue Queen to be returned to Earth.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nPhobos:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nOrange Valley P orbiter, science probe in orbit. Most science complete, orbital perturbation ongoing.\n\u003C/li\u003E\n\u003Cli\u003E\nOrange Valley P lander, science lander on the surface. Science complete.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nDeimos:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nOrange Valley D orbiter, science probe in orbit. Most science complete, orbital perturbation ongoing.\n\u003C/li\u003E\n\u003Cli\u003E\nOrange Valley D lander, science lander on the surface. Science complete.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nVesta:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBlue Bishop Vesta, science orbiter in elliptical polar orbit. Some science remaining, attempting biome scans.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nCeres:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBlue Bishop Ceres, science orbiter in inclined polar orbit. Some science remaining, attempting biome scans.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nJupiter:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBlue Bishop Jupiter, science orbiter orbiting in plane with the Galilean moons. Flybys of Io, Europa and Callisto completed, flyby of Ganymede will be conducted when orbits allow. Remaining fuel may allow further flybys and capturing into orbit of one of the moons.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThere\u0027s still some way to go in this save, however I won\u0027t be launching too many new vessels as I want to complete the crewed Mars mission (and Venus too) and then let time run by until all the active missions have completed their goals; Blue Bishop Uranus is about 19 years away from arriving, but everything else will be done much sooner.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-08T22:36:09Z","Content":"\n\u003Cp\u003E\nThe crew of the Yellow Yum-yum Moon base are getting stressed out and irradiated, so it\u0027s time for Danny and Arkady to come home. A short drive in the rover to take them back to their lander and then it was time to launch. \u003Cs\u003EDue south, obviously, of course that\u0027s what I wanted you to do, MechJeb...\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sDZDjdV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sDZDjdV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe trip up to lunar orbit was uneventful, however when they arrived at the Yellow Profiterole station they discovered a problem: no docking ports to dock to. The landers have drogue ports on them so need to dock to a probe port, but one is occupied by the other lander and the other by a fuel tanker.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qYqpUSR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qYqpUSR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSimple solution- send the next crew down to the surface in the other lander to free up that port. Problem- the other lander is too heavy for its avionics (probably a life support related glitch, I definitely set them to have a single life support function per ECLSS module but now they have four, and water recyclers are half a ton each!) and so has no control beyond fore/aft \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E. I managed to dock that one back to the station, however this means that the fuel tanker docked to the other port needs to be moved and that means one of the two Yellow Pain-au-chocolats needs to be undocked.\n\u003C/p\u003E\n\u003Cp\u003E\nSolution- undock one of them and have it dock to the lander that\u0027s currently station keeping near the station, transfer the crew over to the Apollo pod and send that home while the tanker moves to free up the port for the lander. A slow orbital ballet played out at painfully low FPS and at a fraction of real time as several different vessels moved towards each other and docked.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002209efmbk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/09efmbk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe tanker undocked, definitely didn\u0027t smash a solar panel due to it being rotated so that it clipped inside the tanker when I hit the button to undock, and moved around to the rear drogue docking port of the station which had just been freed up by Gloria in the Yellow Pain-au-chocolat, who approached the lander and docked, allowing Danny and Arkady to move over and join her before they undocked from the lander and headed up to a higher orbit; there\u0027s a crewed lunar orbit contract with an inclination that matches the station but with a minimum periapsis a bit above its orbit, so they boosted up to a 100km circular orbit for three days before heading home. The lander was then remotely guided in by the remaining crew of the station and docked to the now available docking port to be refuelled and resupplied.\n\u003C/p\u003E\n\u003Cp\u003E\nAs if that wasn\u0027t enough drama for one mission, during re-entry the heatshield was mysteriously unable to shield the Apollo pod from heating and it would have exploded if not for the ignore max temperatures cheat. Not the first time that\u0027s happened, but I thought using the generic 4m shield instead of the proper Apollo one would solve that issue; apparently not. The pod thought it was on fire all the way to the ground and the oceans were invisible, much like other occasions where this has happened.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kMxkxMS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kMxkxMS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDespite the glitches, the mission was a success, grabbing a load of science data from crew orbital photography experiments and bringing the films back home to be developed. Danny\u0027s first Moon landing clearly made a big impression:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Y97j7Ih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Y97j7Ih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOver five years added to Danny\u0027s retirement date, almost 3 to Arkady (I\u0027m guessing he\u0027s landed on the Moon before but not stayed for so long) and a measly 270 days for Gloria, who just stayed in orbit for a while then went home again.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile that was happening, another crewed mission was underway, this time in low Earth orbit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iQa7nGL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/iQa7nGL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTwo weeks later they came back and netted a nice half million or so from two crewed LEO contracts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022i8tL8vi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/i8tL8vi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nInterspersed through all that crew shenanigans were five course corrections- all four White Herschel S probes brought their periapses over Saturn down to more manageable levels suitable for orbital capture (though two suffered from the mysterious boiloff bug and had to be corrected in the save file) and Blue Bishop Neptune also made a course correction, and also had the boiloff bug and had to be save hacked back into action.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QuIAE6j.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QuIAE6j.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228mfTP4k.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8mfTP4k.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThat boiloff bug is a real pain, it seems to strike at random, causes all the liquid hydrogen or oxygen to boil off from a tank for no reason and despite maximum MLI on said tank and has to be cured with a save file hack to restore the missing propellant. I don\u0027t think radiators help with this, and besides those are either too big and expensive to be practical or else are too puny to make any real difference.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe last launch of 1964 is the main body of the Venus ship, which will be making the trip to Earth\u0027s closest neighbour in the near future. Largely identical to the Mars ship except for smaller solar panels and more radiators to combat the greater heat closer to the Sun, it used the same launch rocket as before. Something clearly didn\u0027t work right this time though, because when the solid boosters separated one of them came back and:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WgVQeik.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/WgVQeik.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOops... Still, no real harm done as the rocket kept flying, no control issues from the asymmetric thrust and it made it to orbit with plenty of fuel to spare.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228ANfoIx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8ANfoIx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI should probably have sent this thing into a higher orbit than 150x150km but too late now. I might try bringing the White Hubble nuclear space tug over and using that to push this thing higher, however the previous stability issues when using the NST make that a potentially risky move.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd with mere hours to go until the end of the year, a final task for 1964- circularise a geostationary satellite. The axial tilt is really obvious in this image, even if it\u0027s just simulated by tilting \u003Cem\u003Ethe entire solar system\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zt2xWC2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zt2xWC2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd now it\u0027s 1965!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gokqJKZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gokqJKZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is the year I (hopefully!) put flags and footprints on Mars, but there\u0027s plenty more to do besides that: loads of probes going everywhere from Mercury to Pluto to look after, rovers to monitor, crew to keep an eye on, the Mars sample return mission is a few months from Earth and the final trial by fire to make or break the mission.\n\u003C/p\u003E\n\u003Cp\u003E\nOh, and I somehow managed to blow about 8 million funds on part unlocks today \u003Cspan\u003E\u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/ZrZXodH\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/ZrZXodH\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: I may need to launch a new reusable Moon lander to replace the two that are possibly broken. I also took a look at making a water miner for the Moon, which is \u003Cem\u003Ejust\u003C/em\u003E feasible with a water content of 0.98% around the base, however production of hydrolox for fuel cells would be slow and power-intensive so that idea probably won\u0027t be going much further than the prototypes I simulated.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-12T22:59:07Z","Content":"\n\u003Cp\u003E\nWith the core of the Venus ship now in orbit, the White Hubble nuclear space tug was sent over to grab onto it. It might yet be useful for orbital assembly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022x2MvXSv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/x2MvXSv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221AKUQOH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/1AKUQOH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStaying with a nuclear theme, White Galileo 3 arrived at Mercury and expended its nuclear stage to brake into orbit with a half hour long burn, split in two when the periapsis dropped too low to the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AZnWEau.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AZnWEau.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDue to a design oversight, the probe is equipped with an X-band antenna rather than Ka-band, meaning much slower transmission rates than I\u0027d like and a huge backlog of data building up that will take literally years to be sent back. I looked into sending some powerful relays out there, but this probe doesn\u0027t have a secondary antenna so it wouldn\u0027t work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227wnHOFt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://I.imgur.com/7wnHOFt.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBack to orbital assembly of the Venus ship as the core booster gets launched on a Black Empress rocket, all 11,300 tons of it lumbering off the pad under the power of no less than 25 engines- seven M-1s, twelve F-1As and six kerosene-burning LR-87s that are mostly there for the initial boost off the pad and to balance the consumption rates of hydrogen and kerosene in the boosters.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wPy8LFT.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wPy8LFT.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne second stage orbital rendezvous later...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hsrlGOF.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hsrlGOF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd one painfully slow docking at a fraction of a metre per second and about 3FPS...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MEIEOuj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MEIEOuj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd I\u0027d assembled the single largest object I\u0027ve ever built in orbit in KSP, possibly ever. While the overall mass isn\u0027t as high as the Mars ship was and this thing will eventually be, it\u0027s easily 150 metres long end to end- which is taller than the Black Empress rocket that launched the core booster.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nOuttake where the second stage fuel tank decided to disintegrate for literally no reason at all:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KK2YnXq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KK2YnXq.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAt some point I looked over to the Moon station and realised that there was hardly any liquid oxygen left out there, which is a problem as the crew need that to get home. Dave and Arkady were meant to be going to the surface, but instead they went home after stealing every last drop of lox out of the entire station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YN7Hqea.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YN7Hqea.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen they separated from the service module I sent it to burn straight down; it lasted barely five seconds before running out of lox, so the margins were a bit too close for comfort.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022b7Dnphn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/b7Dnphn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAside from the usual heat related issues and scatterer glitches, the crew returned safely home.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the first time in a long time, there\u0027s nobody on or around the Moon. \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EIn other news, I swapped the F-1A engines on the Blue Chip and Blue Chit rockets for the F-1B, a move which shaved a bit off the launch costs for both rockets, though the Blue Chip had to have its second stage utilisation increased to maintain the delta-V needed for GEO, which reduced the effects a bit. Each launch can net half a million in rewards and about half that in advances so I\u0027ll probably keep doing those just for more KCT point money.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/U4UJwws\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/U4UJwws\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: I finally run out of rockets to build!\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-19T20:34:20Z","Content":"\n\u003Cp\u003E\nPreparations for the Venus mission continue with the launch of two side boosters for the Venus ship:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002214sXU1K.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/14sXU1K.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022In24ryt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/In24ryt.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226fO1hpz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6fO1hpz.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then this happened...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022K49vWnr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/K49vWnr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo I reloaded to a point before the rendezvous, and this happened...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HMusxs2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/HMusxs2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn both images, the parts that are floating are actually still attached to the vessel; the nuclear space tug was swinging around wildly and managed to deliver a baseball bat-like hit to the free-floating booster, sending it flying at a speed that belied its 650 ton mass. So obviously I closed down KSP for the day and came back the next day with some extra cans of Kraken repellent, and docked it all together without any further trouble. The NST was released to fly away, increasing the FPS by approximately 0.3; the game is really, \u003Cem\u003Ereally\u003C/em\u003E slow at this point even with a relatively small craft.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, the production lines in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E fell silent as there was nothing to build:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eJ9mnd2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eJ9mnd2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd aside from the occasional GEO sat to keep the funds balance healthy, I won\u0027t be adding anything else to this list unless I need to fulfil a contract.\n\u003C/p\u003E\n\u003Cp\u003E\nCourse corrections were made by the Blue Queen going from Mars to Earth, and by the Mars ship going from Earth to Mars.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dmRvh1F.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dmRvh1F.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xtZ2gDZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xtZ2gDZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then White Lagrange arrived at Mercury with a serious lack of delta-V for some unknown reason. The capture stage burned to depletion and the craft ended up suborbital, then its braking stage of two SRBs and landing stage of generic hypergolic thrusters brought it down to the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TXNtVjj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TXNtVjj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TK4sMuG.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TK4sMuG.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kGJvLRg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kGJvLRg.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAnd about 2km/s of delta-V was acquired using infinite propellant, because at this stage I\u0027m not in the mood for repeating missions due to weird glitches and my Mercury missions have been plagued with those ever since the first flyby mission ended up way off on its inclination between transfer burn and arrival.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nBlue Draughtsman Mars then arrived at Mars and captured into orbit, netting contract funds and more science.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229gjV2tw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9gjV2tw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd a little while later, Blue Queen arrived back at Earth from Mars- and somehow, inexplicably, it now has \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel in the return capsule!? I\u0027m sure that was missing before, but in any case it wasn\u0027t really needed as the upper stage pointed it in the right direction and spun it up before separation.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226F4lbUZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6F4lbUZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAn extremely long re-entry ensued with the capsule screaming through the sky over... I don\u0027t really know where, but I\u0027d guess Indonesia? I was a bit worried that the heatshield ablator would run out, but just in time the capsule slowed down and then splashed down safely into the ocean with its samples intact.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uB6c2PB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/uB6c2PB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B9MgY5L.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/B9MgY5L.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Mars and Phobos sample return contracts completed a while ago due to a contract glitch, but now they\u0027re actually completed properly. A large amount of data that wasn\u0027t transmitted home also came back in the return capsule, making for a rather crowded experiment summary:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022S4sznGM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/S4sznGM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn between all this I also launched the Blue Draughtsman Ceres 2 and the White Ptolemy C2 to Ceres, but I forgot the screenshots of those.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/TF8iT7V\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/TF8iT7V\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: Three (not so) little words:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:72px;\u0022\u003ECREWED MARS LANDING!\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-20T18:31:41Z","Content":"\n\u003Cp\u003E\nIt\u0027s time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jA4565M.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/jA4565M.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022H7UeGIB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/H7UeGIB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Md7KpBv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Md7KpBv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022guV17eg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/guV17eg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VMFJMv6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/VMFJMv6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MK2woCE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MK2woCE.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAnd then...\n\u003C/p\u003E\n\u003Cp\u003E\nTim: OK people, time to do the flag-planting ceremony. You two stand there and I\u0027ll plant the flag-\n\u003C/p\u003E\n\u003Cp\u003E\nBrian: I thought I was planting the flag?\n\u003C/p\u003E\n\u003Cp\u003E\nTerri: No, I was!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NFHpuiv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NFHpuiv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTim: OK, we\u0027ve all planted flags. Now can we do it \u003Cem\u003Eproperly\u003C/em\u003E this time?\n\u003C/p\u003E\n\u003Cp\u003E\nBrian: ...fine.\n\u003C/p\u003E\n\u003Cp\u003E\nTerri: Spoilsport.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wIHK5cp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wIHK5cp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022g3cEPkx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/g3cEPkx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s been a long time coming, but at last: CREWED MARS LANDING COMPLETE!!! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew did some reports, gathered some samples and did other science-y things for thirty days, before gathering everything they could into the upper compartment and preparing for liftoff. (For redundancy reasons the lander carried 60 days\u0027 worth of food, however the majority of that was stored in the habitation module and service module on top of that, both of which were left behind on the surface. Oops...)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KdBQoJ3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KdBQoJ3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BW5Gx1R.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/BW5Gx1R.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nReturning to orbit was pretty easy, but rendezvousing took time as the Mars ship was at pretty much the exact opposite side of Mars at the time the lander circularised. Two days later they finally got there.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UCbHJt7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UCbHJt7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith most of the fuel gone and minus the heavy hab/service modules, the lander turned out to be pretty agile and with a decent amount of delta-V just from its \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters- information that will be very handy for the Phobos leg of this mission. Docking was a pretty simple process and soon enough the crew were back aboard their ship, along with the precious surface samples that Terri immediately dragged down to the lab for analysis.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022szRCwMr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/szRCwMr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe trans-Phobos burn was performed with the core booster, however there wasn\u0027t enough fuel left in that to do the capture burn too so the remaining fuel was siphoned into the lander and the booster was discarded, sent onto a collision course with the little space p\u003Cs\u003Eh\u003C/s\u003Eotato.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nDuring the series of burns to capture into Mars orbit- initial capture, plane alignment with Phobos, lowering periapsis to 250km and circularisation- the final circularisation burn almost ran into trouble when the two engines performing that burn exceeded their rated burn times and the mean time between failure started dropping precipitously- from hours to less than two minutes! Fortunately the burn completed before either engine failed and by then they were out of ignitions, so the other pair of engines were engaged for the trans-Phobos burn.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe ship\u0027s own pair of engines were used to capture at Phobos, braking to a frankly ridiculous 6m/s orbital velocity. That leaves four ignitions to get back to Earth with- getting out of Phobos orbit could feasibly be done with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, then trans-Earth burn, course correction (which will probably be needed) and capture burn, with a spare pair of ignitions in case of failures.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227XQiwcR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7XQiwcR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0027Landing\u0027 on Phobos is a relative term: the Kerbals\u0027 EVA jetpacks are more than enough to do that, however the contract requires 2 crew and a 12 hour stay so the lander is required. Fortunately, the puny gravity is no match for its \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters, which have oodles of delta-V for the task, and with a relative velocity of less than 5m/s compared to the surface it\u0027s not like it\u0027ll use much fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gh1tawc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gh1tawc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landing site was on the eastern edge of Stickney Crater; fortunately there are plenty of those strange ridges with the nice flat bits in between (probably due to low-resolution terrain mapping from real-life missions, I suspect the real terrain would be smooth), but unfortunately this landing site is on the outer side of Phobos and so will never face towards Mars for some scenic shots. Oh well, I can always do another landing later...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RPmIQGc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RPmIQGc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YpIe27w.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YpIe27w.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDue to the design of the lander, the crew hatch faces vertically up making boarding a little tricky. Not everyone got in on their first attempt...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RsrpmXD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RsrpmXD.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the flag planted and science gathered, the crew returned to orbit moving at speeds of up to 7 metres per second! Wow!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220Hoc4W5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0Hoc4W5.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/jIiDmqj\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/jIiDmqj\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: I could do landings in every biome on Phobos to get all the surface samples, try a precision landing beside the little lander currently parked on the western edge of Stickney or even jetpack down and back up, though that last option is a bit risky due to the limited supplies carried while on EVA. There\u0027s loads of science to be gathered out here and the transfer window home is over a year away.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceman.Spiff","CreatedById":209133,"CreatedDateTime":"2022-01-20T21:10:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224079886\u0022 data-ipsquote-contentid=\u0022198428\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642703501\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/jA4565M.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022jA4565M.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/jA4565M.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/H7UeGIB.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022H7UeGIB.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/H7UeGIB.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/Md7KpBv.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022Md7KpBv.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Md7KpBv.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/guV17eg.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022guV17eg.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/guV17eg.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/VMFJMv6.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022VMFJMv6.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/VMFJMv6.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/MK2woCE.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022MK2woCE.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MK2woCE.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAnd then...\n\u003C/p\u003E\n\u003Cp\u003E\nTim: OK people, time to do the flag-planting ceremony. You two stand there and I\u0027ll plant the flag-\n\u003C/p\u003E\n\u003Cp\u003E\nBrian: I thought I was planting the flag?\n\u003C/p\u003E\n\u003Cp\u003E\nTerri: No, I was!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/NFHpuiv.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022NFHpuiv.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NFHpuiv.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTim: OK, we\u0027ve all planted flags. Now can we do it \u003Cem\u003Eproperly\u003C/em\u003E this time?\n\u003C/p\u003E\n\u003Cp\u003E\nBrian: ...fine.\n\u003C/p\u003E\n\u003Cp\u003E\nTerri: Spoilsport.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/wIHK5cp.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022wIHK5cp.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wIHK5cp.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/g3cEPkx.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022g3cEPkx.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/g3cEPkx.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s been a long time coming, but at last: CREWED MARS LANDING COMPLETE!!! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew did some reports, gathered some samples and did other science-y things for thirty days, before gathering everything they could into the upper compartment and preparing for liftoff. (For redundancy reasons the lander carried 60 days\u0027 worth of food, however the majority of that was stored in the habitation module and service module on top of that, both of which were left behind on the surface. Oops...)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/KdBQoJ3.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022KdBQoJ3.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KdBQoJ3.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/BW5Gx1R.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022BW5Gx1R.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/BW5Gx1R.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nReturning to orbit was pretty easy, but rendezvousing took time as the Mars ship was at pretty much the exact opposite side of Mars at the time the lander circularised. Two days later they finally got there.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/UCbHJt7.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022UCbHJt7.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UCbHJt7.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith most of the fuel gone and minus the heavy hab/service modules, the lander turned out to be pretty agile and with a decent amount of delta-V just from its \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E thrusters- information that will be very handy for the Phobos leg of this mission. Docking was a pretty simple process and soon enough the crew were back aboard their ship, along with the precious surface samples that Terri immediately dragged down to the lab for analysis.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/szRCwMr.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022szRCwMr.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/szRCwMr.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe trans-Phobos burn was performed with the core booster, however there wasn\u0027t enough fuel left in that to do the capture burn too so the remaining fuel was siphoned into the lander and the booster was discarded, sent onto a collision course with the little space p\u003Cs\u003Eh\u003C/s\u003Eotato.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nDuring the series of burns to capture into Mars orbit- initial capture, plane alignment with Phobos, lowering periapsis to 250km and circularisation- the final circularisation burn almost ran into trouble when the two engines performing that burn exceeded their rated burn times and the mean time between failure started dropping precipitously- from hours to less than two minutes! Fortunately the burn completed before either engine failed and by then they were out of ignitions, so the other pair of engines were engaged for the trans-Phobos burn.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe ship\u0027s own pair of engines were used to capture at Phobos, braking to a frankly ridiculous 6m/s orbital velocity. That leaves four ignitions to get back to Earth with- getting out of Phobos orbit could feasibly be done with \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E, then trans-Earth burn, course correction (which will probably be needed) and capture burn, with a spare pair of ignitions in case of failures.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/7XQiwcR.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00227XQiwcR.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7XQiwcR.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0027Landing\u0027 on Phobos is a relative term: the Kerbals\u0027 EVA jetpacks are more than enough to do that, however the contract requires 2 crew and a 12 hour stay so the lander is required. Fortunately, the puny gravity is no match for its \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E thrusters, which have oodles of delta-V for the task, and with a relative velocity of less than 5m/s compared to the surface it\u0027s not like it\u0027ll use much fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/gh1tawc.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022gh1tawc.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gh1tawc.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe landing site was on the eastern edge of Stickney Crater; fortunately there are plenty of those strange ridges with the nice flat bits in between (probably due to low-resolution terrain mapping from real-life missions, I suspect the real terrain would be smooth), but unfortunately this landing site is on the outer side of Phobos and so will never face towards Mars for some scenic shots. Oh well, I can always do another landing later...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/RPmIQGc.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022RPmIQGc.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RPmIQGc.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/YpIe27w.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022YpIe27w.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YpIe27w.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDue to the design of the lander, the crew hatch faces vertically up making boarding a little tricky. Not everyone got in on their first attempt...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/RsrpmXD.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022RsrpmXD.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RsrpmXD.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith the flag planted and science gathered, the crew returned to orbit moving at speeds of up to 7 metres per second! Wow!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/0Hoc4W5.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00220Hoc4W5.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0Hoc4W5.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/jIiDmqj\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/jIiDmqj\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: I could do landings in every biome on Phobos to get all the surface samples, try a precision landing beside the little lander currently parked on the western edge of Stickney or even jetpack down and back up, though that last option is a bit risky due to the limited supplies carried while on EVA. There\u0027s loads of science to be gathered out here and the transfer window home is over a year away.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHard to believe it\u0027s been over a year since this series started!\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-23T13:09:39Z","Content":"\n\u003Cp\u003E\nPhobos\u0027 puny gravity combined with the generous \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E propellant storage on the lander can mean only one thing- biome hopping!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PuT93eA.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PuT93eA.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TjFyJ32.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TjFyJ32.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat little white speck above the lander in both of the above images is the Mars Ship in orbit of Phobos- it\u0027s about 6km away so would probably be clearly visible if not for the 2.5km physics range.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce the photo op was done, the trio split up- two jetted off to two nearby biomes while the third stayed by the lander, all gathering crew reports and surface samples from three different biomes before returning to the lander. The lander then relocated to a crater northwest of Stickney Crater putting three more biomes within reach, and the samples gathered there completed the set.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tXKaKGK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tXKaKGK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022A3LALCr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/A3LALCr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew then returned to the orbiting mothership and made a short burn using the lander\u0027s trio of RL-10 engines to push the whole ship out of Phobos orbit; the burn was about 4m/s in total and the lander\u0027s engines have plenty of ignitions to spare, no need to fire up the big engines on the ship itself if we don\u0027t have to.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pN5xPRs.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pN5xPRs.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe return window to Earth is in about 300 days, more than enough time to process those samples in the onboard lab and send the results back to Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nStaying with crewed interplanetary missions, the last piece of the Venus mission was launched to orbit and docked to the Venus Ship along with its crew. Which makes it sound so easy...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HnEP44q.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/HnEP44q.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSee, I stuck a couple of Apollo Block 4 mission modules together for the Venus Ship to get more films for the terrain and weather photography experiments, since putting duplicate experiments on the same module doesn\u0027t work. I figured the Yellow Croissant was up to the task of rendezvousing and docking since it had plenty of delta-V on its own.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221rxB8zX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/1rxB8zX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat I hadn\u0027t considered was that when the mission modules were docked to the front of it, all the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E was at one end. Whenever I tried to use the translation controls, it rotates and has to counterthrust in the other direction, making it incredibly unwieldy and often as not trying to move in one direction would actually make it go in the other direction as the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fought to keep it pointing straight.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen, at last, I managed to dock the thing to the Venus Ship, I moved the crew over, undocked the Apollo craft and prepared to deorbit- and then suddenly the whole thing was 50km under the ground and everything exploded! And I forgot to save after the docking was complete \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EgNZqj4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/EgNZqj4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe second time I did it, I did so the sensible way- no MechJeb docking mode which was so utterly inept last time, just gently tiptoeing into position at barely 0.1m/s so the thrusters could balance out without the whole craft swerving drunkenly across the sky.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QsDFr68.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QsDFr68.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NGAlLgq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NGAlLgq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis time I saved it!\n\u003C/p\u003E\n\u003Cp\u003E\nAlexei (pilot, and one of my original 4), Dave (scientist) and Gloria (engineer) moved over to their new home and made themselves comfortable, while pilot Victoria said her farewells and returned the Yellow Croissant to Earth.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228p0pssr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8p0pssr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI also took the time to check on my fleet of rovers, sending the White Lagrange and Orange Island to new biomes on Mercury and Mars respectively to gather more science. Mercury produces some frankly ridiculous science returns when landed, with some experiments generating several thousand science each over the course of 90 days, which combined with all the data coming back from the Mars mission, all the other probes orbiting various other planets and moons and those uber-cameras orbiting the Earth with that 20-year, 10,000 science experiment, has produced over a thousand KCT points recently, all of which have been poured into R\u0026amp;D. I\u0027ve also put every science node up to the 2050-2099 nodes (the second last tier) onto the research queue and a few of the final tier as well, with just nine left to add.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HNyxhSe.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/HNyxhSe.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/sShozCt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/sShozCt\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: The Venus mission departs, some probes arrive at their destinations and some contracts get completed. And the Venus ship definitely \u003Cem\u003Edoesn\u0027t\u003C/em\u003E get turned inside out by a Kraken attack caused by physics warping too fast during the departure burn...\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-24T21:28:40Z","Content":"\n\u003Cp\u003E\nCrewed interplanetary mission number 2 is underway as the Venus ship burns for Venus. Nearly all of the transfer burn was done using the side boosters, with the last couple of hundred metres per second done by the core booster.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Tn53QDX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Tn53QDX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022P0ijPyZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/P0ijPyZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd now for some probes doing some course corrections and capture burns, which will be happening A LOT in future. First up, White Ptolemy C2 gets a nice close periapsis over Ceres to capture and start mapping:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022z7UP8wi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/z7UP8wi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext, Blue Draughtsman Vesta arrives at the asteroid belt\u0027s second largest member and captures into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zBxoKSc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zBxoKSc.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pGhOtoo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pGhOtoo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nContract completed, science is gathering and there\u0027s more than enough fuel left on the probe to attempt a landing in the future as well.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile on Mercury, the White Lagrange has made its way over to the rover waypoints and nets a great big payout from the Mercury rover contract, not to mention about ten thousand science per biome in total!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022U59f88d.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/U59f88d.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n(I definitely need to do this earlier in my next RP-1 game!)\n\u003C/p\u003E\n\u003Cp\u003E\nUpon arriving at Venus, a small problem raised its head- the radiators can\u0027t \u003Cem\u003Equite\u003C/em\u003E prevent hydrogen boiloff this close to the Sun. Fortunately, the capture burn occurred in the dark (as is right and proper) and by the time the ship re-emerged into the sunlight, the tanks were cool and the radiators could \u003Cem\u003Ejust\u003C/em\u003E keep them that way.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226ScAoTd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6ScAoTd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AwWiTau.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AwWiTau.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002270ZDKVa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/70ZDKVa.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt this point I discovered something odd- the synoptic terrain and weather photography experiments, brought in triplicate aboard the main lab and those two mission modules, weren\u0027t using up any samples when they were being processed in the lab. In fact, processing the samples in a lab makes them regenerate faster than they\u0027re being used! I don\u0027t know if this is intended behaviour or not, but either way it means those mission modules were largely superfluous- though one of them does have some extra crew experiments so it\u0027s not totally pointless having them there.\n\u003C/p\u003E\n\u003Cp\u003E\nWith all the science coming back, I finally managed to complete the entire RP-1 tech tree:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vnupyOm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vnupyOm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEach of those end nodes will take about a month each to research at current rates so it\u0027ll be a few years yet before it\u0027s properly complete, but as of this point science points have no value any more.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd after a long journey out to Jupiter, the White Herschel quartet began their capture burns and a series of further burns to take them to their respective moons. First to arrive was the White Herschel Io, which by coincidence got a decent view of its target moon on the way past.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002295ifWV6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/95ifWV6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eSx9gqk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eSx9gqk.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nOne problem with time-warping forwards to each successive node is that the operating costs for the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E are still racking up without anything coming in to pay the bills. Long story short, I ran out of money and had to do a GEO contract sat to balance the books.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aGl7O2V.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aGl7O2V.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve stuck a couple more Blue Chips on the build queue in case I need to do this again and have dismantled all but two launchpads- the 700 ton pad for these rockets and an unlimited mass pad which will be used to launch a couple of heavily modified Yellow Pain-au-chocolats to recover the Mars and Venus crews when they come back.\n\u003C/p\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/sRO5UKa\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/sRO5UKa\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: A whole lotta fiddly orbital manoeuvres to get four probes in orbit of four different moons as efficiently as possible, and a glitch that eclipses even the first Mercury probe\u0027s 30 degree plane change in solar orbit...\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-26T21:12:01Z","Content":"\n\u003Cp\u003E\nSo many probes, doing so many things, going to so many places... It\u0027s hard to keep track of what was where when.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, up, the White Herschel probes began arriving at their targets, all aiming for polar orbits to maximise data gathering. This one is at Ganymede, I think?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SRD8Ewq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SRD8Ewq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nExcept for the Io probe, which decided it was going to do this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qoPgwvI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qoPgwvI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSomehow, SOMEHOW, it has managed to reverse its course around Jupiter completely. And boost its periapsis from inside Io\u0027s orbit to outside Europa\u0027s. WHAT!?\n\u003C/p\u003E\n\u003Cp\u003E\nLet me just load the last save to check...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m3zIjcw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/m3zIjcw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYes, a PROGRADE orbit of Jupiter! I suspect that Io encounter may have been involved, though for some reason the Europa probe was also on an escape trajectory out of Jupiter\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and had to be cheated back into place since it happened after I\u0027d done this.\n\u003C/p\u003E\n\u003Cp\u003E\nWith the glitch recovered, the Io probe made it to orbit of Io- but only just!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hAEv6wV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hAEv6wV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMore probes arrived at more moons- this one might be Callisto, or possibly Ganymede...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002289459RJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/89459RJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis one might be at Europa? I honestly can\u0027t tell any more, there have been too many of these identical probes doing too many burns lately.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022T1F5LQU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/T1F5LQU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd rather ironically, the Blue Bishop Jupiter completed its flybys with a pass over Ganymede, but only \u003Cem\u003Eafter\u003C/em\u003E the dedicated orbiter mission had already arrived. BBJ then captured into Ganymede orbit as well to augment the science gathering there.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224JVf0Xl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4JVf0Xl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA few other missions called for attention in between all this Jovian stuff- most importantly the Mars ship\u0027s departure burn to head back to Earth.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mLIUTNa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mLIUTNa.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe lander is staying put because a) I can use the smaller engines to do course corrections more precisely, and b) it has enough delta-V to capture into Earth orbit, whereas the ship itself does not. It also holds all the samples, though the lab has processed them all by now so it no longer matters.\n\u003C/p\u003E\n\u003Cp\u003E\nOver at Vesta, the first White Ptolemy to reach its destination parks itself in a nice polar orbit for optimal scanning, with a decent fuel reserve to change its altitude if necessary.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FI8Awdy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/FI8Awdy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd just when I\u0027m sick of looking at Jupiter, along comes the White Euclid mission to throw four more vessels into the mix, needing four more sets of nodes to somehow land on each of the Galilean moons. The upper stage captured into a pretty eccentric orbit that dipped below Io and above Callisto, then released the four rovers.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222SVxQgv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/2SVxQgv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022b3tNelC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/b3tNelC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce at a safe distance, the small relay was also deployed with its four X-band dishes pointed at the four Galilean moons and the larger Ka-band dish pointed at Earth. Each of the rovers has an X-band omni antenna on it, though their range is probably limited and the elliptical orbit of the relay will make it hard to get a good signal. But it\u0027s worth a try, right?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225ZReSA2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5ZReSA2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs it turns out, these rovers have some kind of problem with the delta-V readouts, which significantly overestimated how much delta-V they had. I found this out the hard way as the Ganymede rover approached Ganymede and the delta-V decreased far faster than it should have, ending up with a shortfall of about 2km/s compared to what had been promised. In addition, one of the two ventral \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters designed to give some throttle control during the final descent didn\u0027t work at all, while its symmetrical copy on the other side worked just fine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002283hnNwo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/83hnNwo.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nOK, so I used infinite fuel here. That 2km/s that just disappeared from the readout made it impossible to land otherwise, and there\u0027s no good reason why that happened since these rovers use all storable hypergolics.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xHAEkMq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xHAEkMq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne bizarre wheel suspension glitch that launched the rover, with almost no fuel left at all, into the air at 30m/s upon landing, later and the rover was safely on the ground.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LZQSr3H.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LZQSr3H.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s plenty of science to gather here before it sets off half way around the moon to reach the rover waypoints. \u003Cs\u003EWatch out for the falling mirrors, angry marines in mech suits and protomolecule monsters!\u003C/s\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/CQ7mJTF\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/CQ7mJTF\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: In a strange twist, the two copies of Blue Draughtsman and White Ptolemy sent to Ceres over a year apart are arriving within days of each other; but the second transfer window was so much better than the first that the second set will capture with fuel to spare while the first will be well short of making orbit. Things Stock KSP Doesn\u0027t Teach You #452- not all transfer windows are created equal, \u003Cem\u003Eespecially\u003C/em\u003E when everything orbits in noticeably different planes.\n\u003C/p\u003E\n"},{"CreatedByName":"Toasty Dyna-Soar","CreatedById":211441,"CreatedDateTime":"2022-01-27T00:33:12Z","Content":"\n\u003Cp\u003E\nThanks for making this really cool series!\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-28T22:50:14Z","Content":"\n\u003Cp\u003E\nBlue Draughtsman C2 arrives at Ceres, brakes into orbit and ends up with over 1300m/s of fuel left over- plenty for a landing attempt once the orbital science is gathered.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Lvrd4oS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Lvrd4oS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSeveral days later, Blue Draughtsman C, which launched a whole year earlier, arrives, brakes as much as it can- and is still over 1km/s short of capturing into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D2zW9B5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/D2zW9B5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe two probes are largely identical, so how did this happen?\n\u003C/p\u003E\n\u003Cp\u003E\nThe answer lies in Ceres\u0027 inclined orbit- both probes launched on the most efficient trajectory possible, minimising total delta-V for the transfer and capture burns combined. This meant that both were aiming to reach Ceres at the point where its orbit crosses Earth\u0027s, however the earlier window required the probe to fly out further towards Jupiter in order to let Ceres catch up whereas the second one could take a lower energy trajectory and still arrive at the same time.\n\u003C/p\u003E\n\u003Cp\u003E\nA few days later, Blue Ptolemy C flew past Ceres, also unable to capture due to that poor transfer trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022opRqtF1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/opRqtF1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was followed in short order by the White Ptolemy C2, which captured into orbit with over 2km/s of fuel remaining. This version did have a few upgrades over the older one, including bigger fuel tanks, but again the difference is stark.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Mlqc89z.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Mlqc89z.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nScanning Ceres took hardly any time at all, but covering 100% of the surface will take time due to the inclination keeping one pole in darkness.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nIncidentally, that\u0027s one possible explanation for the mysterious black diamond on Ceres\u0027 south pole:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ayyM6Dj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ayyM6Dj.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nA quick look over to Jupiter as the White Euclid Io makes yet another pass over Io, bringing its apoapsis down steadily over time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022idFnVjG.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/idFnVjG.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt took days of doing this to realise that instead of spending tens or hundreds of metres per second to enable a future flyby, I could spend tenths of a metre per second by changing the trajectory several orbits in advance. Io is definitely going to be a tricky one to land on, but with enough perseverance \u003Cs\u003Eor cheating\u003C/s\u003E I\u0027ll get there eventually.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the other end of the Galilean moons, White Euclid Callisto arrived for its landing attempt.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k8I4D7x.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/k8I4D7x.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe same issue with the ventral \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters that affected the Ganymede landing struck again, even though I checked both thrusters while the upper stage was still attached and both worked fine; but decouple the upper stage and one stops working, odd. After a long and nervous braking burn, the rover touched down with a mere 3m/s of fuel left in the tanks- \u003Cem\u003Eafter\u003C/em\u003E pumping most of the propellant from the rover itself into the braking stage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022POfVajy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/POfVajy.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTwo down, two to go...\n\u003C/p\u003E\n\u003Cp\u003E\nI took some time to check on the other rovers scattered around the solar system and prodded many into going in search of new biomes. The science returns were considerable, resulting in the single biggest haul of free KCT points I\u0027ve ever had.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PMaiYgk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PMaiYgk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOh yeah, and it\u0027s 1967 already! I\u0027ve been warping from node to node for quite some time and didn\u0027t even notice the calendar tick over.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/KFTxo0C\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/KFTxo0C\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: A really close up view of Saturn\u0027s rings, and three intrepid explorers return from the Red Planet and its innermost \u003Cs\u003Epotato\u003C/s\u003E moonlet.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-29T17:24:59Z","Content":"\n\u003Cp\u003E\nBlue Bishop Saturn arrived at Saturn after many years of travel, but somehow its periapsis increased by a billion kilometres between the last course correction and arriving; I used a bit of infinite propellant to put it back in vaguely the right place, though that also overburnt the engine so its MTBF is down to less than two minutes. Eek...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uouSX7M.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/uouSX7M.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut the views were worth it!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xFUZTo7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xFUZTo7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UXQ7MyL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UXQ7MyL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PoRZA7S.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PoRZA7S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe capture burn worked without any engine failures, resulting in an orbit that covers space high and low but is nowhere near any of the moons to get an encounter. The White Herschel S quartet will have to do those flyby contracts when they get there in a few years\u0027 time.\n\u003C/p\u003E\n\u003Cp\u003E\nA few Io gravity assists came and went before I realised something that should have been obvious from the start- I\u0027m doing this all wrong! Instead of making big course corrections, using tens or hundreds of m/s each time, I could make tiny corrections of tenths of a m/s several orbits in advance to get the same effect. Good to know for the next playthrough, I suppose...\n\u003C/p\u003E\n\u003Cp\u003E\nOver at Venus, the crew chased any last snacks out of the two mission modules before undocking them, then pumped any remaining liquid hydrogen and liquid oxygen out of the core booster before undocking that too. It\u0027s time for them to come home and lugging almost 20 tons of mission module back with them was a waste of delta-V that could instead be used to capture into some semblance of an Earth orbit when they got back.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oOXBeIq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oOXBeIq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA few days later, one of the crew of the Mars ship spotted something out the window...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NoX5uI8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NoX5uI8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EtD61Gg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/EtD61Gg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey were home at last!\n\u003C/p\u003E\n\u003Cp\u003E\nThe capture burn used up the last of the fuel in the ship\u0027s main tanks:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oTGnopx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oTGnopx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBefore the crew undocked in the Mars lander and completed the capture burn into a lower orbit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JFf4xkp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JFf4xkp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vKLmYqQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vKLmYqQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe original plan was to capture into a nice circular orbit to make it really easy to rendezvous with it, however I left MechJeb to execute the burn and at some point one of the engines failed, resulting in it wasting the remaining ignitions with nearly 3km/s of fuel still in the tanks. Boo.\n\u003C/p\u003E\n\u003Cp\u003E\nCue the Yellow Pain-au-chocolat Mk6, hilariously overbuilt for this mission since it was originally intended to meet the Mars ship when the latter was on an escape trajectory. Diana was at the controls, grumbling a little about not getting an interplanetary mission of her own the whole time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022L0U6ckz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/L0U6ckz.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou already got our first ever flight, first crewed orbit AND first Moon landing, Diana, quit whining and let someone else have a turn!\n\u003C/p\u003E\n\u003Cp\u003E\nA simple rendezvous ensued, barely troubling the second stage\u0027s fuel reserves, and soon enough they were ready to dock. Another annoying \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E issue popped up as the upper set of \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters on the Apollo craft refused to fire, so the lander did most of the docking.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RVa8LO9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RVa8LO9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VaEYQuR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/VaEYQuR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAn attempt was made to tow the lander onto a suborbital trajectory, but this failed because the twin RD-58s were blocked by the lander. They undocked, deorbited and \u003Cs\u003Eexploded because I forgot about that stupid heating bug with the Apollo capsule\u003C/s\u003E enjoyed a nice fireworks display as their service module exploded below them.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KXbqdjZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KXbqdjZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt some point during this mission, the top cover of the Apollo capsule went missing; a little worrying as it could have meant the parachutes got cooked, but no harm done in the end.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JyF8p63.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JyF8p63.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter years in space, Tim, Brian and Terri are finally home. They\u0027ve walked on Mars and \u0022walked\u0022 on Phobos, taken a vast number of photographs and produced valuable scientific data, but who cares about that when you can have ALL THE CONTRACTS!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MQO0UD9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MQO0UD9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022C44J1XL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/C44J1XL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Cmdtysx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Cmdtysx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ejf0lT5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Ejf0lT5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe trio also got multi-year additions to their retirement dates, which means nothing now since they won\u0027t be flying again, but it\u0027s a bump about as large as a rookie gets after their first Moon landing and these three had already done at least one Moon landing each.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VemvrXh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/VemvrXh.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/HnTX9Uz\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/HnTX9Uz\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: The end of this report is getting nearer as missions complete their objectives. The last of the Jovian rovers make their landing attempts, the Venus crew return home and a bunch of contracts pay out to alleviate the whole \u0022ran out of funds, again\u0022 thing.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-30T21:21:20Z","Content":"\n\u003Cp\u003E\nAfter far too many gravity assists, it\u0027s finally time for the White Herschel Io to land.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k5Yw6EZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/k5Yw6EZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe descent was dicey, right on the edge of running out of fuel, but in the end the rover landed- and fell over. So I lifted it off the ground a bit, levelled it out and landed again- and it fell over again. Eventually, after using the \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E on the rover and the descent stage together, it stayed on its wheels. As it turns out, I landed right on the side of a big hill (possibly a volcano) with a pretty steep slope.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pd2kjLY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pd2kjLY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n(The blurry terrain in the foreground is because it was glitching a bit.)\n\u003C/p\u003E\n\u003Cp\u003E\nThis was followed in short order by the landing on Europa:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aGaODqP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aGaODqP.png\u0022\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nI know Europa\u0027s surface is covered with fractured ice, but I don\u0027t think this is quite the same thing!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dy8dgzI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dy8dgzI.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D8rQyMh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/D8rQyMh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA series of contracts began paying out- landing on each of the four moons as well as the rover contract for Callisto as that rover arrived first.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a brief burst of time-warping, the Venus Ship is back home already!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wrnXdg8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wrnXdg8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was able to capture into orbit of Earth, however said orbit wasn\u0027t very good. No matter- the Yellow Pain-au-chocolat Mk6A is more than up to the task- it was built to catch the ship on an escape trajectory after all. (The A suffix is due to adding more boosters on the first stage, not needed for the Mars crew since they had the lander and its 4km/s to play with.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sfMRu5P.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sfMRu5P.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nRendezvousing was easy, but getting close enough to dock was incredibly slow because both physics and time warp made the two vessels move by a substantial distance relative to each other, making a close approach impossible. So I \u003Cs\u003Echeated and used set orbit\u003C/s\u003E waited a long, long time to get closer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zdBt4qU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zdBt4qU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDocking was routine, the crew moved over, waved goodbye to their ship and headed back to Earth.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022w7M6Kzd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/w7M6Kzd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nRe-entry was fine (except for the usual heating issue), drogues opened, mains opened, time to decouple the heatshield so it\u0027ll fly away from the- wait why is it coming back?!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Aibmg3o.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Aibmg3o.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll the way to Venus and back, and the last 500 metres nearly killed the crew because the heatshield flew around like a demented frisbee and came *this* close to clobbering the top of the pod at considerable speed.\n\u003C/p\u003E\n\u003Cp\u003E\nNo matter- a safe landing was had by all, the two crewed Venus contracts paid out nearly 3.5 million funds and the crew got 2-3 years added to their retirement dates.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wtTJ5oC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wtTJ5oC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yupNIQd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yupNIQd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd so concludes the crewed missions for this save! No more crew launches are happening- no launches of any kind, in fact- so pretty soon the Original Four of Diana, Alexei, Tim and Ann are going to start retiring.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/0uBOXqA\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/0uBOXqA\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nComing up next time: TITAN.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nOh, and while I remember- that Ceres orbiter that I was so proud of getting into orbit of Ceres with loads of fuel for a landing? Turns out I wasn\u0027t paying attention to the orbit it was in when I left it; I checked the screenshot I took of it with the UI on, which showed a periapsis of... 4km. RIP Blue Draughtsman C2, you \u0022landed\u0022 on Ceres all right, just a bit faster and explodier than intended \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-30T21:29:53Z\u0022 title=\u002201/30/2022 09:29  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 30, 2022\u003C/time\u003E by jimmymcgoochie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-31T22:16:45Z","Content":"\n\u003Cp\u003E\nThis report is nearing its end. \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EBut not before I noticed this flukey asteroid, which I presume managed to snag a gravity assist from the Moon to capture into Earth orbit five years ago without me being aware of its existence.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lm65IMF.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/lm65IMF.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhite Tombaugh completed its blisteringly fast transit to Pluto by flashing past at over 30km/s. An attempt was made to skim through its vanishingly thin atmosphere, but it turns out that even that miniscule amount of air will result in instant combustion at 30km/s...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wm7rDw1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wm7rDw1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224VFDM08.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4VFDM08.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA bit of rover poking finally got a good shot of one with Jupiter in the background:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LNAEyl0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LNAEyl0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then I achieved a technology victory by completing every research node available.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RMC0njR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RMC0njR.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs far as Civilisation 6 is concerned a crewed Mars mission is enough for a science victory and I already did that, but nevertheless- completing the entire tech tree before Apollo 11 launched isn\u0027t too shabby.\n\u003C/p\u003E\n\u003Cp\u003E\nShortly after this, while time-warping ahead to the White Huygens mission, three of my Original Four astronauts retired- Diana, Tim and Alexei in that order. Ann will follow soon enough, followed by the newer astronauts whose retirement dates are all in the mid to late 70s.\n\u003C/p\u003E\n\u003Cp\u003E\nBut back to the main event: TITAN.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223lVgtoE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3lVgtoE.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tFCOykd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tFCOykd.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFour relays were deployed, supposedly into a resonant orbit to ensure even spacing. This was partly successful- yes, they were pretty evenly spaced, but weirdly the first and fourth relays ended up in the same place \u003Cspan\u003E\u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E the fourth was dispatched to a very high orbit for science and to improve coverage, while the other three eventually got moved into elliptical orbits for science high and low.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bcq026H.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/bcq026H.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landers were deployed with very little ability to aim them, but despite that I managed to get 6 out of 7 biomes and two of the landers splashed down, earning splashed and landed science from those biomes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xNFinwK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xNFinwK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223Nhiszv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3Nhiszv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSome of the landers nosedived straight down with a terminal velocity of over 50m/s, like the one above, whereas others spiralled at speeds of between 20-35m/s for no discernible reason. The parachutes were definitely misconfigured though- when partly opened they slowed each probe to under 5m/s, then when fully open they slowed down to less than 0.3m/s! Despite the slow fall, or maybe because of it, most of them didn\u0027t land the right way up.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022koWP1T3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/koWP1T3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere was no Titan landing contract, however there was an atmospheric probe contract which the first lander completed, on top of the contract for a Titan flyby; together they netted about 2.3 million funds.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second lander made a beeline for a lake (most likely methane and/or ethane) and sank upon splashdown; but then I deployed the magnetometer and weirdly it then floated back to the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JKghbbe.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JKghbbe.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMagnetometer retracted and it sinks, magnetometer deployed and it floats. This was later confirmed with another probe that landed in the \u0022seas\u0022 biome and sank nearly 50 metres to the seabed, where it\u0027s properly dark.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Rrbl68x.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Rrbl68x.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut eventually one of them landed the right way up and was lit up by the strange blue twilight near the poles.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022blaY4my.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/blaY4my.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis mission has been spectacularly successful, grabbing a HUGE amount of science and (along with data being transmitted during the time-warping to its destination) has produced a massive quantity of KCT points.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225HEbGna.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5HEbGna.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey no longer matter, of course, since there\u0027s nothing to build or research, but still. Imagine what they could do in the early 50s...\n\u003C/p\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/CEJUVtm\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/CEJUVtm\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nComing up next time: It\u0027ll probably be the final report of this series, aww... But I plan to start a new report of some kind soon, whether that\u0027s a new RP-1 game I have ready and waiting, or possibly GPP/GEP or Beyond Home, both of which can be rescaled to JNSQ scale (and GPP/GEP can be used with JNSQ now, apparently) or I might try JNSQ itself with a focus on more resource harvesting and colony building type play. Or probably that new RP-1 save.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThis biome map looks a bit... suspicious...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226HnduHO.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6HnduHO.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-02-01T17:20:13Z","Content":"\n\u003Cp\u003E\nAll good things must come to an end, and this report is no exception- fourteen months after I started it (some of that was due to a dead GPU and doing another career report as a result), it\u0027s time to wrap up Terranism Space Program with the last missions arriving at their destinations.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst on the list are the four White Herschel S probes. Essentially identical to the four at Jupiter, only with beefy RTGs and slightly better dishes to cope with the longer range, these four won\u0027t be targeting any moon in particular, but rather will be aiming to get flybys of as many moons as possible- and Saturn really does spoil you for choice.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CHJ3Sw7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CHJ3Sw7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFlyby contracts for Mimas, Enceladus, Rhea, Tethys and Iapetus need completing, but with four probes available it should be easy enough to get all of them.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221XtARp9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/1XtARp9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wKdfax3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wKdfax3.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yEBBFsk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yEBBFsk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022etVUVuH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/etVUVuH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDuring these flybys I discovered how puny the SOIs of these moons are- I\u0027m fairly sure that at least one of them has an \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E less than twice its radius meaning space high effectively doesn\u0027t exist.\n\u003C/p\u003E\n\u003Cp\u003E\nThe encounter with Iapetus was particularly fortuitous- that probe had the most delta-V remaining and the trajectory was favourable to attempt an orbital capture, something that it could \u003Cem\u003Ejust\u003C/em\u003E manage with its available fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zIbHgYT.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zIbHgYT.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNot a very picturesque moon, mostly dark grey and barely visible against the backdrop of space even with ambient lighting boosted waaay up, but it\u0027ll yield a nice science bonus.\n\u003C/p\u003E\n\u003Cp\u003E\nAll this Saturnian action came at a cost though- during the long warp to these missions arriving, a number of the Astronaut Corps retired. The rest would retire while time-warping ahead to the Blue Bishop Neptune\u0027s arrival several years later.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SyIp58P.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SyIp58P.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022alQJMI8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/alQJMI8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Neptune flyby contract was completed, then with a bit of trajectory fiddling an encounter with Triton netted a second flyby contract. That encounter wasn\u0027t easy to get since Triton orbits retrograde and the probe was orbiting prograde.\n\u003C/p\u003E\n\u003Cp\u003E\nThe last to arrive was Blue Bishop Uranus, which is where the Kraken made its last stand: first the \u0022warp to node\u0022 stock button managed to overshoot by three hours, messing up the capture burn considerably and resulting in a negative periapsis.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220MaCY3h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0MaCY3h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter fixing the trajectory so the periapsis was a mere 10km inside the upper atmosphere, the probe did a successful atmospheric pass and gathered several minutes of flying high data.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MoU0UO5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MoU0UO5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then I pressed timewarp, and-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022F9qZjYr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/F9qZjYr.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nInstant teleportation to 120km inside the atmosphere, causing the big relay dish to explode and cutting off any further gains from this probe. RIP Blue Bishop Uranus.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter several decades of time warp, where I discovered that at really high warp numbers data transmission is reduced significantly (probably the same Kerbalism bug that reduces science gathering at high time warp and which I\u0027ve come across before in this report and elsewhere), a lot of data had come back- but yet the White Herschel probes had terabytes of data between them, Blue Draughtsman Mars had a few hundred gigabytes still and for some reason Blue Bishop Neptune was on its merry way right out of the solar system.\n\u003C/p\u003E\n\u003Cp\u003E\nAh well, time to land the Blue Draughtsman V on Vesta like I said I would.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229MFpfEK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9MFpfEK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA prominent crater near the north pole was chosen for the landing site and the probe made a flawless landing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NLcOH89.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NLcOH89.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA bit more time-warping and then I decided that the report would end in the year 2000:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wEGNicZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wEGNicZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinal scores: Barely 1200 science short of 400k, how annoying, and over 27,000 KCT points in total including almost 3000 I didn\u0027t even spend.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nFull album: \u003Ca href=\u0022https://imgur.com/a/XSUsx2g\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/XSUsx2g\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThis career has taken up a significant amount of my spare time for over a year. Now that it\u0027s over, I\u0027ll be moving on to something new- but I\u0027ll definitely be back for another RP-1 run in the near future. The mods have changed a lot since I started (pressurants, residuals, research speed tweaks and much more) and next time I won\u0027t be using easy mode settings so the margins will be a lot tighter all round\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll probably come back and create a super-montage of all the best images from the 116(!) Imgur albums for this report, but to finish up, here\u0027s one that I\u0027ll definitely include in my loading screens in future:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Nfc8XG8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Nfc8XG8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003EEND Terran(ism) Space Program\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-02-04T16:43:11Z","Content":"\n\u003Cp\u003E\nMontage can be found here: \u003Ca href=\u0022https://imgur.com/a/Q5CTX3d\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/Q5CTX3d\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBrand new \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1 career report can be found here: \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022199902\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed1537357690\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/206751-its-only-rocket-science-rssrorp-1/\u0026amp;do=embed\u0022 style=\u0022height:194px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}