{"TopicId":204735,"ForumId":51,"TopicTitle":"Working Title(Suggestions Please)","CreatedByName":"Mikenike","CreatedById":196142,"CreatedDateTime":"2021-09-08T01:49:47Z","PageNum":1,"Articles":[{"CreatedByName":"Mikenike","CreatedById":196142,"CreatedDateTime":"2021-09-08T01:49:47Z","Content":"\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:13pt;vertical-align:baseline;\u0022\u003EThe Journey of Tomul Kerman\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022 style=\u0022text-align:center;\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:12pt;vertical-align:baseline;\u0022\u003EThe Higher we soar the smaller we appear to those who cannot fly- Friedrich Nietzsche\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve worked on a few small stories over the last few weeks, here\u0027s one, so far. It was partially inspired by Audacity: Memoirs of a Kerbonaut.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EChapter 1\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ETomul Kerman was interested solely in engineering and the sciences when he was a young Kerbal. Yet he did not realize his dream of going to space until he was 17 years old. He knew in order to do that he must learn about what is out there. His father owned a construction firm and a junkyard. Yet I cannot start a story partway through. We must go back to the beginning, or rather, back 12 years. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ETomul was only 5 when he discovered his passion for aircraft, and by his 6th year he could name nearly every single aircraft in the United Nations of Kerbin’s arsenal and all the United Kerbline’s fleet by merely listening to their engines. He had mastered the art and science of how aircraft worked, and had put up detailed drawings of many different aircraft. He took hours a day envisioning the next big aircraft, and even submitted designs to major firms like the KPMC, or Kerbal Plane Making Corporation, who was the leader in USK aircraft design. The CEO of KPMC called his parents one day asking if he could use the blueprints to manufacture scale models of some of his designs, to which they happily accepted, and KPMC even helped Tomul get a patent for his works. At 7, he had his first scale model flown, quite successfully, no thanks to the amazingly accurate blueprints he provided. By 10, he had made himself known at KPMC, who were practically begging him to work for them when he finished school. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EFast forward another 5 years, he was finishing up his final mandatory schooling year, and after, he planned to enlist in UNK’s Air Force. KPMC was still requesting that he join them when he finished school. But he wanted to fly and to see the subject he so dearly loved go beyond where it was, and the best way to do that was to be a test pilot. Tomul had already shown his amazing reflexes in school, as well as his overall knowledge about any subject you asked him about, especially engineering and science. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAfter the final grades came out, and the smartest kids were revealed, Tomul was at the top of his class, but he wasn’t a brainiac like most others, he was smart, no doubt, but he played it cool, loved to be outdoors or working out. He had lied to his classmates about his intellect so that he wouldn’t be an outcast, but people saw right through the tough guy who didn’t care about grades. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EHe immediately went to the USKAF recruiting office, handed the recruiter his paperwork, and got a crazed look. A perfect score student wanted to be an enlisted person, so the recruiter happily helped him fill out the application for the USKAF’s Academy, which was an advanced level school that was for officers. He was accepted into the Academy later that week, and immediately went to Korado Sprigs where the academy was based. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ENow, two years later he was fulfilling his plan of becoming a prominent test pilot, with over four thousand hours flight time in experimental aircraft, and a little over 3k in regular aircraft in service. He flew in notable aircraft like the Sounder, which was the first aircraft to reach past Kach 5 (Kerbin Mach) at a mere 10K altitude. The only other altitude this had been done at was at 30K feet with an unmanned drone that was liquid fuel powered. His aircraft was specially built with a heat shield at the front, and parachutes for an emergency situation and for landing, as his only way to slow down was friction and drag. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003ETomul was called into the 466th FTS briefing room where he found none other than the squadron CO, Chuck Kerman, as well as two men in suits, one named Gene and the other named Mortimer. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E“Good morning Tomul, I am Gene Kerman, and this is my associate Mortimer, we are with the USK Space Agency. We came here looking for a pair of test pilots for our craft, and we hear that you are the brightest and very finest the 466 has to offer. We are willing to pay you handsomely. Unfortunately this would mean being discharged from the military, honorably, of course, to be able to come work with us.” Gene informed him.\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E“Who is the other candidate?” Tomul inquisitively replied, trying to gauge how serious the two men really were. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E“Fraston Kerman,” Gene shot back, he knew of the fierce rivalry between Tomul and Fraston, and knew that it would make him want to join so that Fraston couldn’t.\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E“You said you were taking two of us, and quite frankly, I don’t like the way Fraston does things. If I go, then you not only get a great pilot, but a person who loves engineering and science. Whereas with Fraston, you get a risk-taker who’s only want is fame and glory. If I sign on, you are going to have to pick someone else who is not Fraston.” Tomul infuriatedly replied. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003E“Then we have a deal, we have a few papers for you to sign now, and I’m sure General Chuck will as well. When you arrive at your barracks, start packing, we will pick you up in a Mounder tomorrow at 12 sharp.” Gene told him.\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022background-color:transparent;color:#000000;font-size:11pt;vertical-align:baseline;\u0022\u003EAfter signing the papers and talking with the General, he realized that Gene and Chuck were old friends and that they had discussed Tomul\u0027s abilities beforehand, and that they only wanted Tomul, and not him and Fraston. He felt played, but he knew that it was the right thing to do. He had recently taken an extremely profound interest in space and spacecraft, even more so than when he had found airplanes, some 12 years ago. \u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-08T12:08:27Z\u0022 title=\u002209/08/2021 12:08  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 8, 2021\u003C/time\u003E by Mikenike\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mikenike","CreatedById":196142,"CreatedDateTime":"2021-09-08T16:56:04Z","Content":"\n\u003Cp\u003E\nWill post 2 chapters here shortly. This series starts slow, but will quickly pick up the pace.\n\u003C/p\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2021-09-09T12:59:29Z","Content":"\n\u003Cp\u003E\nHmmm... I like this Ü\n\u003C/p\u003E\n\u003Cp\u003E\nTwo things i would like to request: First of all, please use normal instead of \u003Cstrong\u003Ebolded\u003C/strong\u003E text. It\u0027s easier for me at least to read. And also, please don\u0027t have two whatevertheyarecalled\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nspaces like between this one and the previous. Thanks in advance (: \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}