{"TopicId":206066,"ForumId":51,"TopicTitle":"The Scrape of Things to Come - Phase 7: Inner Planets Missions","CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-22T05:41:23Z","PageNum":1,"Articles":[{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-22T05:41:23Z","Content":"\n\u003Cp\u003E\nSo, a little while ago in the \u0022What I Did In KSP Today\u0022 thread I threatened to make a mission report thread. And, since I\u0027m not one to make idle threats, here it is.\n\u003C/p\u003E\n\u003Cp\u003E\nA little bit about the save. It\u0027s a sandbox save, no fund or science restrictions. I\u0027m just setting my own restrictions and goals, doing my own thing. I kind of view it as my own little virtual model train set, but in space. With little green aliens running it. Additionally, I\u0027m autopiloting almost everything with MechJeb and Kramax. It\u0027s not that I can\u0027t do this stuff. It\u0027s that I\u0027ve been doing it all for over eight years now, and it\u0027s not my favorite part of the game. So, if any of this makes the scenario uninteresting to you I apologize in advance.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as mods, here\u0027s the mod list:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rCliaRB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002239.17\u0022 height=\u0022394\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/rCliaRB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMostly parts and visual mods. Oh, and OPM. Let\u0027s try to get out to Sarnus this time, shall we?\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as the name of the save, I was sort of thinking of a bit of \u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Shape_of_Things_to_Come\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E, combined with a bit of \u003Ca href=\u0022https://youtu.be/hthl28SEGfk?t=155\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, with the \u0022truth in advertising\u0022 part out of the way, let\u0027s get on to the actual stuff:\n\u003C/p\u003E\n\u003Cp\u003E\n=========================\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the success of the Kerpollo Mun landings, the leadership of the Kerbal Space Agency began to plan the future of their space program. After many executive retreats, consultant-facilitated mission statement exercises, and constituent focus groups, they settled on the following goals for their long-term operations in space:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Create a transportation system that will facilitate regular, low-cost access to space, in order to,\u003Cbr\u003E\n2. Construct and maintain permanent stations and bases in low Kerbin orbit and at other locations in the Kerbin system, in order to,\u003Cbr\u003E\n3. Foster exploration of the Kerbin system, and the other planets, to expand scientific knowledge and the frontiers of Kerbal civilization.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, in support of their first goal, they submitted an ambitious proposal to Kongress. They wished to create a single-stage-to-orbit spaceplane to carry Kerbonauts and cargo into orbit in order to support their future plans for space exploration. Their proposal was for the Independence-Class spaceplane.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227DiUxnUh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002228.71\u0022 height=\u0022294\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/7DiUxnUh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002253xTFAOh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002260.16\u0022 height=\u0022616\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/53xTFAOh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Vvwg0aQh.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.76\u0022 height=\u0022571\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Vvwg0aQh.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bNProKHh.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.76\u0022 height=\u0022571\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/bNProKHh.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022R2WX3Dhh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002270.61\u0022 height=\u0022723\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/R2WX3Dhh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIndependence-Class Spaceplane Specifications\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrew: Three to Seven: Commander, pilot, flight engineer, up to four mission specialists\u003Cbr\u003E\nPassengers: Twelve\u003Cbr\u003E\nLength: 41.6 m\u003Cbr\u003E\nWingspan: 20.3 m\u003Cbr\u003E\nHeight: 8.5 m\u003Cbr\u003E\nEmpty Weight: 91.148 tons\u003Cbr\u003E\nGross Weight: 240.197 tons\u003Cbr\u003E\nMaximum Payload to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E (100 km): 59.5 tons\n\u003C/p\u003E\n\u003Cp\u003E\nThe response was...mixed.\n\u003C/p\u003E\n\u003Cp\u003E\nThe good news: Kongress granted full funding for the spaceplane program, and for the follow-on space station and base programs. The program managers were overjoyed, and immediately set to work translating their marketing brochures and digital presentations into actual engineering documents.\n\u003C/p\u003E\n\u003Cp\u003E\nThe bad news: Well, actually there was quite a bit of bad news. For starters, Kongress made it plain that, as far as launch vehicles went, they were only going to provide budget for the spaceplane. All other previous launch vehicle programs would be retired, and there would be no other launch vehicles forthcoming. So, in the immortal words of trainee engineer Araceli Krebs, \u0022If it don\u0027t fit...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Zw2oogZh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Zw2oogZh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CQf7Hvbh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/CQf7Hvbh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nzGuEZgh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/nzGuEZgh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022...it don\u0027t ship.\u0022 Everything that would be lifted into space would be limited in size and weight to the payload capacity of the spaceplane. This was to give the engineering managers of the space station and Munar base programs no end of consternation.\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, Kongress reasoned that since the spaceplane program had entailed such an unreasonably high research and development cost, and that such cost had resulted in the vehicle\u0027s reusuability and return payload capacity, they decided that one of the ongoing goals of the program should be to reduce ongoing costs by maximizing the reusability of the other components in the space infrastructure. Therefore, Kongress has ordained that component waste should be minimized to the greatest extent possible, and that all components that would otherwise be discarded, such as fuel tanks, structural adapters, etc, should be returned to Kerbin on the spaceplane, to the greatest extent possible. (Whether or not this requirement actually saved the program funds was a matter of eternal debate. But the mandate stood nonetheless.)\n\u003C/p\u003E\n\u003Cp\u003E\nIn any case, after weeks of development, the first spaceplane, christened Independence, rolled out of the production plant and onto the runway, ready for it\u0027s first flight. Because of the radical, untried nature of the vehicle, the upper management decided that the first flight should be a minimally kerballed test flight. A shakedown cruise, of sorts, to work out any bugs in the various systems and ensure that the extensive engineering behind the craft was sound. And so the intrepid first crew of the Independence taxied their vessel out to the runway for its maiden flight...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-18T04:55:39Z\u0022 title=\u002202/18/2024 04:55  AM\u0022 data-short=\u0022Feb 18\u0022\u003EFebruary 18\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-22T07:13:15Z","Content":"\n\u003Cp\u003E\nOn a late morning, Independence is rolled out to the end of the runway for its maiden flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002279yOZ9Ih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/79yOZ9Ih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnboard for the test flight are the first crew:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Jane Knoll\u003Cbr\u003E\nPilot Juliana Koontz\u003Cbr\u003E\nFlight Engineer Dwayne Kohler\n\u003C/p\u003E\n\u003Cp\u003E\nThe computers are aligned. The throttles are set. The brakes are released. And Independence roars down the runway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002229Nofcch.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/29Nofcch.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs she gains speed, she rotates and gradually leaves the ground. Liftoff! Commander Knoll flips a switch and the gear folds into their housings as they leave \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E behind.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223k9UyNVh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/3k9UyNVh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence cruises effortlessly through Mach 1 and continues to gain altitude. After only a minute of flight, the engines reach their peak thrust, pushing the crew back into their seats with over 4Gs of force. As the vessel gains altitude and speed, the thinning air and increased speed take their toll on engine efficiency, and thrust begins to drop. But they still keep accelerating all the way to hypersonic speeds.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ttDzEOxh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ttDzEOxh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs they approach Mach 4, 20,000 meters over Kerbin, the time comes to change engine modes, from open-cycle air-breathing to closed-cycle using internal oxidizer. Although this has been tested many times, this is still considered to be a critical moment in the test flight. Flight Engineer Kohler reviews his checklist, runs down his list of critical parameters from the engine readouts, and gives Commander Knoll a \u0022Go\u0022 for closed-cycle. With a flip of a switch, the engines close their air intakes and begin consuming liquid oxygen. Independence continues its climb to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022I0CUO7vh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/I0CUO7vh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinally, as they reach their target speed, the main engines cut out and Independence cruises on its arc out of the atmosphere. The crew floats weightless in their seats, with the cooling fans removing the mild heat that accumulated in the cabin during their ascent.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002261Gf7Aeh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/61Gf7Aeh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUpon exiting the atmosphere, the crew sets about rigging the ship for orbital operations. They open the cargo bay doors, extend the wing-mounted solar arrays, and deploy the ship\u0027s docking port. Although most of these systems won\u0027t be used on this flight, testing them is still considered to be critical to the test flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022t9yDGKGh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/t9yDGKGh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vhSIcwwh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vhSIcwwh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs they reach their apoapsis, they burn Independence\u0027s main engines to circularize their arc. They have achieved orbit! The crowd in mission control goes wild!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022O4nRQRFh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/O4nRQRFh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter checking out the shipboard systems and receiving a go-ahead from mission control, Independence burns once again on the night side of Kerbin to raise it\u0027s orbit to 400 km, the planned orbit of the space station that the spaceplane will soon begin construction of.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ik7HOKxh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Ik7HOKxh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cbHhsQbh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/cbHhsQbh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce at their full orbit, the crew begin to make more planned tests of the spacecraft systems, including the reaction control system.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226GPbAQvh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/6GPbAQvh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fKLeXeAh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/fKLeXeAh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith all of their objectives completed, the crew settle in for a good night\u0027s rest before their return to Kerbin the next day.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter being awakened by mission control, the crew prepare for reentry. They bring Independence around to face retrograde, and then at the prescribed moment they fire the main engines again to bring her back down into the atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227BOgkVhh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/7BOgkVhh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs Independence glides down towards Kerbin, the crew prepare for reentry. They bring her around to face prograde with a nose-up attitude. They close the payload bay doors and docking port, and retract the solar panels. Since the main engines are no longer needed in closed-cycle, they jettison all of the oxidizer to reduce the ship\u0027s mass. They shift the remaining fuel around in the tanks to adjust the ship\u0027s center of gravity. And, finally, they reconfigure the ship\u0027s computers for atmospheric flight. As they settle into their seats for reentry, Independence begins streaking through the upper atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YIpN4d0h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YIpN4d0h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew are pressed down in their seats, feeling weight for the first time in a day, as Independence enters the thicker parts of the lower atmosphere and begins shedding speed. Finally, when they reach 28,000 meters, they begin to take control and guide the aircraft. The engines are once again switched back to open-cycle mode, and they begin to bring the vessel onto the glide path to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022O6JsdXUh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/O6JsdXUh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs Independence drops below 10,000 meters, her speed drops to around Mach 0.8, and she begins to handle like a regular aircraft. A large, unwieldy aircraft that is low on fuel. As they pass over the mountains west of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E, the crew makes their final adjustments to their flight path to line up with the runway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AyrnFqbh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/AyrnFqbh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tWSejllh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/tWSejllh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEveryone is heaving sighs of relief as Independence appears to have survived the worst of the trials she had to face. However, she is not on the ground yet. Commander Knoll lowers the landing gear and brings her ship in on final approach.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221gdQpL4h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/1gdQpL4h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd touchdown!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jKKXMrTh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/jKKXMrTh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence rolls down the runway and comes to a stop. Mission control breaks out in cheers as the crew exchange fist bumps in the cockpit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022inZeK7rh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/inZeK7rh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence\u0027s maiden flight has been a rousing success, and the program is ready to start hauling hardware into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-12-22T18:04:31Z\u0022 title=\u002212/22/2021 06:04  PM\u0022 data-short=\u00222 yr\u0022\u003EDecember 22, 2021\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003Cbr\u003ETypo\n\u003C/span\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2021-12-22T07:23:12Z","Content":"\n\u003Cp\u003E\nI\u0027m a big fan of sandbox and self-imposed restrictions. \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI will lightly suggest that your landing gear is a bit tall and narrow and may cause you headaches.\n\u003C/p\u003E\n\u003Cp\u003E\nAre those the schramjets? They\u0027re FUN.\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-22T17:19:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224068233\u0022 data-ipsquote-contentid=\u0022206066\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221640157792\u0022 data-ipsquote-userid=\u0022111640\u0022 data-ipsquote-username=\u0022FleshJeb\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, FleshJeb said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m a big fan of sandbox and self-imposed restrictions. \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI know, right? I\u0027ve never been a fan of career or science in KSP. I\u0027m hoping that will change in KSP2, but I\u0027m also not basing my happiness on that.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224068233\u0022 data-ipsquote-contentid=\u0022206066\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221640157792\u0022 data-ipsquote-userid=\u0022111640\u0022 data-ipsquote-username=\u0022FleshJeb\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, FleshJeb said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI will lightly suggest that your landing gear is a bit tall and narrow and may cause you headaches.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, here\u0027s the thing: It has to be tall, otherwise I get tail strikes on the lower engines when it rotates for takeoff. And it\u0027s actually reasonably stable as long as you land relatively level. Kramax puts it down flat every time, so it\u0027s not really a problem for me in this save, but if I were going to fly it manually a lot I\u0027d probably end up putting a couple landing gear on the bottom outboard of the lower engines to act as training wheels.\n\u003C/p\u003E\n\u003Cp\u003E\nBesides, it\u0027s not without precedent:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 data-ratio=\u002278.33\u0022 height=\u0022939\u0022 style=\u0022width:600px;height:auto;\u0022 width=\u00221200\u0022 alt=\u0022Convair_B-58A_Hustler_front_view_061101-F-1234P-021.jpg\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/6/64/Convair_B-58A_Hustler_front_view_061101-F-1234P-021.jpg\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224068233\u0022 data-ipsquote-contentid=\u0022206066\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221640157792\u0022 data-ipsquote-userid=\u0022111640\u0022 data-ipsquote-username=\u0022FleshJeb\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, FleshJeb said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAre those the schramjets? They\u0027re FUN.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey put the go-go in the zoom-zoom! \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-12-22T17:53:59Z\u0022 title=\u002212/22/2021 05:53  PM\u0022 data-short=\u00222 yr\u0022\u003EDecember 22, 2021\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003Cbr\u003EPrecedent\n\u003C/span\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2021-12-22T22:34:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224068345\u0022 data-ipsquote-contentid=\u0022206066\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221640193573\u0022 data-ipsquote-userid=\u002270033\u0022 data-ipsquote-username=\u0022TheSaint\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, TheSaint said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKramax puts it down flat every time\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNevermind then! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224068345\u0022 data-ipsquote-contentid=\u0022206066\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221640193573\u0022 data-ipsquote-userid=\u002270033\u0022 data-ipsquote-username=\u0022TheSaint\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, TheSaint said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThey put the go-go in the zoom-zoom! \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBah, I thought those were OPT engines. I think they\u0027re actually NFA Broadswords. I haven\u0027t used them, but I took a look at the thrust curves on github--All I can say is YES. Also:\u003Cbr\u003E\n\u0022The Broadsword is large and terrifying. So terrifying, in fact, that our engineers have postulated that it works by so deeply frightening the ground that the entire planet tries to run away.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-22T22:39:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224068434\u0022 data-ipsquote-contentid=\u0022206066\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221640212488\u0022 data-ipsquote-userid=\u0022111640\u0022 data-ipsquote-username=\u0022FleshJeb\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, FleshJeb said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNevermind then! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBah, I thought those were OPT engines. I think they\u0027re actually NFA Broadswords. I haven\u0027t used them, but I took a look at the thrust curves on github--All I can say is YES. Also:\u003Cbr\u003E\n\u0022The Broadsword is large and terrifying. So terrifying, in fact, that our engineers have postulated that it works by so deeply frightening the ground that the entire planet tries to run away.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, those are Broadswords. They definitely have enough umph for the application. Especially four of them.\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-23T02:15:50Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EPhase 1 - Kerbin Station\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe first task for the newly minted spaceplane is to begin construction of Kerbin Station, the first permanent space station in low Kerbin orbit. Kerbin Station is to serve multiple purposes:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nProvide a platform for conducting microgravity and Kerbin sciences research.\n\u003C/li\u003E\n\u003Cli\u003E\nProvide a location in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E to assemble cargo loads destined for other locations in the Kerbin system.\n\u003C/li\u003E\n\u003Cli\u003E\nProvide a facility to refuel and resupply spacecraft in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E with consumables lifted from the surface of Kerbin.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cimg alt=\u00220lHO4bPh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002257.32\u0022 height=\u0022587\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/0lHO4bPh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbin Station will be assembled from a variety of standardized modules that will be flown into orbit by the spaceplane fleet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xSXPTRdh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002266.89\u0022 height=\u0022685\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xSXPTRdh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKerbin Station Statistics\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMass: 111.345 tons\u003Cbr\u003E\nLength: 65.4m\u003Cbr\u003E\nWidth: 46.6m\u003Cbr\u003E\nHeight: 33.4m\u003Cbr\u003E\nPermanent Crew: 12\n\u003C/p\u003E\n\u003Cp\u003E\nSo, after Independence had been given some routine maintenance and refueled, her initial cargo was loaded, and the first mission of the new Kerbal adventure was launched.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-08T19:36:52Z\u0022 title=\u002201/08/2022 07:36  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 8, 2022\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003Cbr\u003ESpecification Changes\n\u003C/span\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-24T02:45:16Z","Content":"\n\u003Cp\u003E\nSorry, I was hoping to post the next mission before Christmas started spiraling out of control. But that was apparently not meant to be. So, Merry Christmas, and I will get back to this next week.\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-29T04:39:39Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EMission 101 - Kerbin Station Core\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn the first mission of Phase 1, the goal is to lift the core module of Kerbin Station into orbit, as well as the first Cargo Drone.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mZ0j6aeh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/mZ0j6aeh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe cargo drone is the first in a fleet of standardized vehicles for moving cargo and personnel around the Kerbin system. Cargo drones are specifically designed for moving modules around in close proximity to stations and bases.\n\u003C/p\u003E\n\u003Cp\u003E\nEarly on Day 2, Independence is taxied out onto the runway with her first cargo in her hold.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Hp3k3tyh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Hp3k3tyh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAboard is her flight crew:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Cleveland Kauffman\u003Cbr\u003E\nPilot Gavin Kenney\u003Cbr\u003E\nFlight Engineer Herman Kinney\n\u003C/p\u003E\n\u003Cp\u003E\nAnd her first compliment of specialists:\n\u003C/p\u003E\n\u003Cp\u003E\nPayload Specialist Dwayne Kohler (a veteran of Independence\u0027s maiden flight)\u003Cbr\u003E\nMission Specialist Lily Kemp\u003Cbr\u003E\nMIssion Specialist Edwin Klinger (recently promoted from Corporal)\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Kauffman raises the throttles to 100%, then releases the brakes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sI3pZJNh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/sI3pZJNh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence surges down the runway and takes flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ionuDQKh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ionuDQKh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence once again cruised effortlessly past Mach 1.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zLIEemjh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/zLIEemjh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs Independence reaches further towards space, her engines push harder and harder, peaking at roughly 3.5G. But as the atmosphere thins, and her speed increases, their thrust slackens. And at about 20,000m, Commander Kauffman switches the engines to closed-cycle and Independence continues her climb to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022O9PpiGqh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/O9PpiGqh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinally, Independence reaches her orbital velocity, and Commander Kauffman cuts out the main engines. Independence cruises to apoapsis, then burns her main engines again to circularize her orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uz89Cgth.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uz89Cgth.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter she has achieved orbit, the crew rigs Independence for orbital operations, deploying her solar panels, and opening the cargo bay doors and docking port.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002215Pqpxuh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/15Pqpxuh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSoon after achieving orbit, the crew once again burns the main engines to raise the ship\u0027s orbit to 400km, the operational orbit of Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022At7enuch.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/At7enuch.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter Independence is at her final orbital altitude, the crew releases the struts holding the station core module in place, then activate the cargo erector to raise it into its deployed position.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rAjkqCgh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/rAjkqCgh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the station core has been erected, Payload Specialist Kohler takes control of the cargo drone to dock it to the core module\u0027s zenith port.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fCHfmpjh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/fCHfmpjh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022N9GUiFwh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/N9GUiFwh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the cargo drone has taken hold of the core module, Kohler uses it to transfer the core module to Independence\u0027s docking port.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226Bx1OROh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/6Bx1OROh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the core module is docked, the crew boards the new station module and begins pushing buttons and pulling levers to test all of the new station\u0027s systems. After several hours of testing, the new module is deemed accepted for service, and the crew goes to sleep for the night, waiting for their reentry opportunity the next morning.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dA4soYUh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/dA4soYUh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter receiving their wakeup call from mission control, the crew prepare for reentry. Separating from the newly christened Kerbin Station, Independence orients retrograde and activates her reaction control system.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002201bUYkKh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/01bUYkKh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a brief burn, Independence is once again heading home.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220bR8yeCh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/0bR8yeCh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the burn, the crew prepares for reentry. They reorient Independence prograde with a nose-up attitude. They retract the solar panels, and close the cargo bay doors and docking port. And then, after the rest of the housekeeping, Independence enters the outer atmosphere. As the plasma forms around the shuttle, she begins to rapidly lose speed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MJEXOm9h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/MJEXOm9h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter Independence has lost her velocity and dropped below supersonic speeds, Commander Kauffman begins maneuvering the great craft to bring it in line with the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway glidepath.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uf8VjVEh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uf8VjVEh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence cruises over the western mountains and down to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway. And Commander Kauffman brings Independence down to a textbook touchdown.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aspHkUbh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/aspHkUbh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs Independence completes its rollout, the staff in mission control celebrates the first complete mission of the spaceplane program.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DVezvsnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/DVezvsnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn orbit, the kernel of Kerbin Station orients itself. At this point, all of the station\u0027s power and guidance is provided by the cargo drone. But that will soon change.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gF4ZRoPh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/gF4ZRoPh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-30T03:17:23Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMission 102 - Kerbin Station Center Truss and Escape Pod Hub\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDuring the next station construction mission, Independence will be lifting the station\u0027s center truss and its escape pod hub. The center truss is a critical part of the station\u0027s structure, providing a backbone for the trusses that will provide solar power to the station, as well as housing the station\u0027s batteries, reaction wheels, and it\u0027s probe core for remote operations when there are no personnel on board. The escape pod hub provides a central docking location for the four escape pods which will provide emergency evacuation for station personnel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EKhJFTQh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/EKhJFTQh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBecause this is the first mission that will rendezvous with the station\u0027s core module already in orbit, the crew has been training for days on orbital rendezvous procedures. And on how to spell rendezvous. The crew for this mission:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Jane Knoll\u003Cbr\u003E\nPilot Jackie Kimball\u003Cbr\u003E\nFlight Engineer Araceli Krebs\u003Cbr\u003E\nPayload Specialist Andrew Keene\u003Cbr\u003E\nMission Specialist Keisha Keene (no relation)\u003Cbr\u003E\nMission Specialist Lea Kimbrough\n\u003C/p\u003E\n\u003Cp\u003E\nSo Independence was brought out yet again for her next mission. Her engines roared to life, and she lifted off from the runway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EHR709Vh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/EHR709Vh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew guided her through the atmosphere and out to the edge of space once again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Gjhel5Oh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Gjhel5Oh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd as they circularized their orbit at 100km, they settled in and configured the ship for orbital operations. They had an hour before the first burn to \u003Cs\u003Eroundevous\u003C/s\u003E rendezvous with Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aujK8coh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/aujK8coh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022U7COITOh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/U7COITOh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinally, after an hour of \u003Cs\u003Espinning in their chairs\u003C/s\u003E important scientific observations, they reached their maneuver point and burned for station rendezvous.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dUkH0F4h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/dUkH0F4h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence comes right in alongside Kerbin Station, and the crew burns to match their velocities.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kjNsxjQh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/kjNsxjQh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow they must begin the process of docking. Pilot Kimball assumes control of Independence from the docking control station and the ship orients itself towards Kerbin Station. Meanwhile, Payload Specialist Keene takes control of the cargo drone attached to Kerbin Station and uses it to reorient the station core module for docking. Kimball uses Independence\u0027s \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to draw the two craft closer together.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vEH2VXJh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vEH2VXJh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then, with a clunk and a thunk, the two craft are docked.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HhBJFxeh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/HhBJFxeh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow that the station and spaceplane are hard docked the team can begin transferring Independence\u0027s cargo. They begin by erecting the station modules in the cargo bay, first the escape pod hub, and then the center truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NXklohXh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NXklohXh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QdBckmah.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/QdBckmah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen Andrew Keene once again takes control of the cargo drone and undocks it. He then deftly maneuvers it around to dock with the escape pod hub.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fOrvg6xh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/fOrvg6xh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the drone is docked to the hub, they release the clamps holding the hub to the cargo erector, and the drone carries it over and docks it to its permanent berth on the core module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QMGp1xwh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/QMGp1xwh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mWm6cGGh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/mWm6cGGh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow the center truss must be moved. Keene undocks the drone and maneuvers it around to dock with the truss adapter attached to the end of the center truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uLrpQn8h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uLrpQn8h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd again, the clamps are released and the cargo drone gently carries the center truss over to attach to its port on the core module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nCcVBAdh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/nCcVBAdh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Jea44sah.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Jea44sah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a very stressful hour operating the cargo drone in orbit for the first time, Andrew takes a breather and breaks open his Basic Alcohol Ration (BAR).\n\u003C/p\u003E\n\u003Cp\u003E\nSo now the crew continues to work inside the core module, checking on the new systems that have been added to the station. Then they bed down for the night ahead of reentry tomorrow.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a good night\u0027s sleep, the crew aligns the station for undocking. With a burst of \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, Independence separates from the station and begins its journey home.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jmQyNqWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/jmQyNqWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith a well-placed burn, Independence begins its reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229xMMaGsh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/9xMMaGsh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence plunges through the atmosphere surrounded with an envelope of searing hot plasma. \n\u003C/p\u003E\n\u003Cp\u003E\n(Author\u0027s note: I never get tired of watching this thing reenter.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022N8QIQv2h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/N8QIQv2h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter shedding their velocity and settling into their flight path, Independence cruises over the western mountains.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TdHDUfKh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/TdHDUfKh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then, with a skilled touch, Commander Knoll set Independence down lightly on the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway and brought it to a halt at the end of its rollout.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224zDPSdqh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/4zDPSdqh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Y4GhHBth.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Y4GhHBth.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo now, Kerbin Station has many of it\u0027s major systems. But it still requires power, life support, and emergency evacuation options before it can support a permanent crew.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aj4ERiLh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/aj4ERiLh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-30T22:49:31Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMission 103 - Kerbin Station Port Radiator Truss\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, after a grueling three days of work, Independence\u0027s first sister ship, Liberty, has rolled off of the production line. Her first mission will be to deliver Kerbin Station\u0027s port-side radiator truss. This truss will support one of the stations two main radiator arrays, and provide structural support for the port side solar truss which will be delivered later.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yO2RRkuh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/yO2RRkuh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew for Liberty\u0027s maiden flight will be:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Juliana Koontz\u003Cbr\u003E\nPilot Mercedes Keegan\u003Cbr\u003E\nFlight Engineer Andrew Keene (pulling a back-to-back after his Payload Specialist role on Mission 102)\u003Cbr\u003E\nPayload Specialist Gilbert Keenan\u003Cbr\u003E\nMission Specialist Bianca Kimmel\u003Cbr\u003E\nMission Specialist Ben Kunkel\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the tug has pulled Liberty out to the end of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway, the crew completes the pre-flight checklist. When all of the parameters are in spec, Commander Koontz gives a \u0022Go\u0022, and Liberty roars down the runway to liftoff.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221XKTPbvh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/1XKTPbvh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222ZXSgmvh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2ZXSgmvh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLiberty\u0027s first flight is picture perfect. She soars upwards to orbit, and after their circularization burn the crew rigs the ship for orbital operations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kxAzwcnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/kxAzwcnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iXFUiDth.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/iXFUiDth.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce in orbit, the crew begins preparations for their rendezvous burn, which is only 13 minutes after their circularization burn. Panic ensues. But after a pep talk from Commander Koontz, some soothing words from Mission Control, and the mysterious disappearance of Pilot Keegan\u0027s BAR, the crew rally and the rendezvous burn takes place without incident. Soon, Liberty is approaching Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZWR6NMCh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ZWR6NMCh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith Pilot Keegan guiding Liberty, Payload Specialist Keenan guiding Kerbin Station via the cargo drone, and Mission Specialist Kunkel providing dulcet tones on his saxophone, soon the two craft are lined up and ready to dock.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qXpFMVah.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/qXpFMVah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter docking, the radiator truss is erected for removal from the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WmtCsAdh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/WmtCsAdh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKeenan undocks the cargo drone and guides it, with its attached truss adapter, to dock with the radiator truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LiGUoxZh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/LiGUoxZh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XNG1kw1h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/XNG1kw1h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe radiator truss is released from the cargo erector, and then Keenan guides the drone to dock the radiator truss to the port side of the central truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZlBBNZQh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ZlBBNZQh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cqR1QWjh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/cqR1QWjh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the assembly is completed, the crew checks the newly added systems, and then settles in for the night.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next morning, they bid goodbye to Kerbin Station and ready Liberty for reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vUyemKTh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vUyemKTh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe reentry burn goes off without a hitch, and the crew reorients Liberty and rigs her for reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ikgCY3ih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ikgCY3ih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022szfaqLlh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/szfaqLlh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLiberty passes through the fire of reentry without incident, and the crew brings her around into the flight path to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FJTvnRzh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/FJTvnRzh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fbFyi9Oh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/fbFyi9Oh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith a skilled hand, Commander Koontz brings Liberty in for a landing, completing her first mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iS7i7lWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/iS7i7lWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZzGmARAh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ZzGmARAh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbin Station is reoriented to maximize the input from the cargo drone\u0027s solar panels. The radiator panels on the new truss section will remain undeployed until the habitation module has been berthed in its location.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HM4BpoQh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/HM4BpoQh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-12-31T23:44:15Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EMission 104 - Kerbin Station Port Solar Truss\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo Independence is back up to bat for this mission. This time they will be bringing up the port-side solar truss which will provide half of Kerbin Station\u0027s total power.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xACYgL3h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xACYgL3h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew for this mission:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Barney Kearney\u003Cbr\u003E\nPilot Eli Koonce\u003Cbr\u003E\nFlight Engineer Jaime Kent\u003Cbr\u003E\nPayload Specialist Rachel Killian\u003Cbr\u003E\nMission Specialist Blair Kovach\u003Cbr\u003E\nMission Specialist Norman Koontz\n\u003C/p\u003E\n\u003Cp\u003E\nEarly on the morning of Day 4, Independence is once again rolled out to the runway and lifts off to Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZrfhuhTh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ZrfhuhTh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yYiPjByh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/yYiPjByh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the climb to orbit and circularization, the crew settles in to wait for their rendezvous burn that will bring them to Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xOQ93klh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xOQ93klh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the rendezvous burns, Independence once again finds itself approaching Kerbin Station, and the crew sets about to docking.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pnMnHUIh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/pnMnHUIh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022s6lxxFgh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/s6lxxFgh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uAwJkZLh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uAwJkZLh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow that the crew have docked, they erect the truss in the cargo bay, then bring the cargo drone around to dock with it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227980Ksqh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/7980Ksqh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002253AdPBRh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/53AdPBRh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nExtracting the truss from the cargo bay, Mission Specialist Killian brings it around and docks it to its location at the end of the port-side radiator truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hMCLT3bh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/hMCLT3bh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter making quick work of their mission tasks, Killian remarked, \u0022Wait? That was it?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022c0LiFgBh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/c0LiFgBh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew once again performs their system checks to ensure that the new truss is properly installed. Then they settle in for a good night\u0027s sleep.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next morning Independence once again breaks away from Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229I5MnjXh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/9I5MnjXh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew executes a flawless reentry burn, and after braving the heat of reentry Independence is once again on the flight path to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lNwLSO2h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/lNwLSO2h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bkufHODh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/bkufHODh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter cruising over the ever familiar sights of the western mountains, Commander Kearney brings Independence in for a spot-on landing on the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E runway. Another mission complete.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IRloLGah.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/IRloLGah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YtXAlKEh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YtXAlKEh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo now the port truss of Kerbin Station is complete. On the next flight, the habitation module and the first supply module will be added.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XB0EvSth.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/XB0EvSth.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-12-31T23:44:41Z\u0022 title=\u002212/31/2021 11:44  PM\u0022 data-short=\u00222 yr\u0022\u003EDecember 31, 2021\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-01T20:20:49Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMission 105 - Kerbin Station Habitation Module and Supply Module\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFor Liberty\u0027s second mission, she will be lifting the habitation module and supply module to Kerbin Station in advance of the station\u0027s first permanent crew.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ACAQ1Aqh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ACAQ1Aqh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis will be the first flight crew rotation, with the following crew members from Indpendence\u0027s initial cargo flight taking the yoke on Liberty this time:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Gavin Kenney\u003Cbr\u003E\nPilot Cleveland Kauffman\u003Cbr\u003E\nFlight Engineer Dwayne Kohler\u003Cbr\u003E\nPayload Specialist Herman Kinney\u003Cbr\u003E\nMission Specialist Edwin Klinger\u003Cbr\u003E\nMission Specialist Lily Kemp\n\u003C/p\u003E\n\u003Cp\u003E\nWith what is becoming boring regularity, Liberty lifts off and soars to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wsVHkOdh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/wsVHkOdh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Z6Y7hh5h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Z6Y7hh5h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KgW75vrh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KgW75vrh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter waiting through two revolutions of their 100km parking orbit, the crew performs their rendezvous burns and then moves in to a perfect docking with Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228WwKmy3h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/8WwKmy3h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UaEeUk4h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/UaEeUk4h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rq9rap6h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/rq9rap6h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter docking, the crew erects the habitation module and supply module in the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228qzerzBh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/8qzerzBh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MOzoXlmh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/MOzoXlmh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kdoq1SYh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/kdoq1SYh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen Payload Specialist Kinney takes control of the cargo drone and brings it around to pick up the habitation module. He carries it up to its permanent berth on the station\u0027s core module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YQtgDPHh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YQtgDPHh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SiQ8E6ih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/SiQ8E6ih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aTjWx6Jh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/aTjWx6Jh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter the habitation module has been docked, the cargo drone is brought around again to pick up the supply module and bring it around to its berth on the core module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EHRtPvmh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/EHRtPvmh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jfLyIZkh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/jfLyIZkh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow that the habitation module has been placed in its permanent location, the crew can extend the port radiator and solar panels. The station will no longer be dependent on the tiny panels on the cargo drone for power.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vdEnQRih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vdEnQRih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ODvRsZWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ODvRsZWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EAiPT2jh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/EAiPT2jh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHaving finished their extensive tasks for the day, the crew settles in for a well deserved night\u0027s rest.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next day, the crew breaks Liberty away from Kerbin Station again and prepares for reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002241J1Hwlh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/41J1Hwlh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter their reentry burn, the crew of Liberty brings her in to yet another successful landing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022COgfCVrh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/COgfCVrh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022H8amaACh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/H8amaACh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022F8WqNhMh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/F8WqNhMh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbin Station is almost ready to receive its first permanent crew. They will arrive on the next flight, along with the escape pods that will provide their emergency Kerbin return capability requirements.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YRkLd3Hh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YRkLd3Hh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-03T05:08:23Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EMission 106 - Kerbin Station Escape Pods and Initial Crew \u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin Station has finally reached a point where it is able to support its first crew, with the exception of the escape pods which will allow the crew to return to Kerbin in the event of an emergency on the station. So the next spaceplane mission will lift both the escape pods and the first crew.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uGT1wZfh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uGT1wZfh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe flight crew for Independence will be:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Gavin Kenney\u003Cbr\u003E\nPilot Jane Knoll\u003Cbr\u003E\nFlight Engineer Sierra King\u003Cbr\u003E\nPayload Specialist Araceli Krebs\u003Cbr\u003E\nMission Specialist Keisha Keene\u003Cbr\u003E\nMission Specialist Lea Kimbrough\n\u003C/p\u003E\n\u003Cp\u003E\nThe first crew for Kerbin Station consists of the following veteran kerbonauts:\n\u003C/p\u003E\n\u003Cp\u003E\nCaptain Juliana Koontz\u003Cbr\u003E\nExecutive Officer Mercedes Keegan\u003Cbr\u003E\nChief Engineer Andrew Keene\u003Cbr\u003E\nFirst Engineer Gilbert Keenan\u003Cbr\u003E\nChief Scientist Bianca Kimmel\u003Cbr\u003E\nAssistant Scientist Ben Kunkel\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew taxis Independence out to the runway on a clear morning. After the pre-flight checks, Commander Kenney releases the brakes and brings the throttles to full power. Independence surges down the runway and takes flight, rapidly climbing to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022O8jVZcnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/O8jVZcnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226Nqxi6fh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/6Nqxi6fh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RuzLtkUh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/RuzLtkUh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd, again, after about an hour, two rendezvous burns bring Independence to Kerbin Station. And after some brief maneuvers the two are docked.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HKsOSDxh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/HKsOSDxh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cz5rhI9h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/cz5rhI9h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zGyeMo5h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/zGyeMo5h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe first order of business is to transfer the escape pods to their docking ports on the escape pod hub. The crew erects the escape pods in the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022O2pEKdFh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/O2pEKdFh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen Payload Specialist Krebs brings the cargo drone around to dock with the first pod and carry it to the hub.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fVXypdnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/fVXypdnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B8cCKvph.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/B8cCKvph.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the first pod docked, Krebs brings the drone around again to pick up the second escape pod and dock it to the hub.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022G8EvCQlh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/G8EvCQlh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022e78rBlYh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/e78rBlYh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd now, in accordance with space program regulations, the cargo drone cannot remain parked on an escape pod. So they bring it around and dock it to the open port on the supply module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YoutV7Lh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YoutV7Lh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo now that the escape pods have been successfully transferred, the new crew of Kerbin Station can officially move in to their new home, where they will spend the next 90 days.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ucBexaIh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ucBexaIh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut Independence will be going home the next morning. The crew says their goodbyes, then undocks from Kerbin Station and fires her main engines to begin reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022p9KujE8h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/p9KujE8h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QAeHo8Ih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/QAeHo8Ih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd after yet another unremarkable reentry and landing, Independence rolls to a stop at the end of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222lq0juHh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2lq0juHh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FyCuqSWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/FyCuqSWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, on Kerbin Station, the crew settles in to their new routine of maintaining station systems. The next spaceplane flight will begin to bring up the starboard side truss assemblies to provide additional power and cooling for the new science lab and docking modules to be brought up later.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ilDJoxeh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ilDJoxeh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-05T05:33:08Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMission 107 - Kerbin Station Starboard Radiator Truss\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter another three days of production, the third Indpendence-class spaceplane rolls out of Building 23 at Consolidated Kerbal Aerospace Industries. Christened Freedom, she, like her sister ships, is a marvel of modern Kerbal technology. But, unlike her sister ships, she still has that new spaceship smell.\n\u003C/p\u003E\n\u003Cp\u003E\nFor her first mission, Freedom is tasked with lifting Kerbin Station\u0027s starboard radiator truss into orbit. Like the port radiator truss, this truss will provide heat removal for the station, and also provide structural support for the starboard solar truss. Once the starboard solar truss has been added the station will be deemed at 100% of its cooling and power capacity, although the docking ports on the ends of the trusses will allow for additional truss segments to be added later if necessary.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022r8EDJGlh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/r8EDJGlh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFreedom\u0027s first crew consists of:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Eli Koonce\u003Cbr\u003E\nPilot Barney Kearney\u003Cbr\u003E\nFlight Engineer Rachel Killian\u003Cbr\u003E\nPayload Specialist Jaime Kent\u003Cbr\u003E\nMission Specialist Norman Koontz\u003Cbr\u003E\nMission Specialist Blair Kovach\n\u003C/p\u003E\n\u003Cp\u003E\nFreedom is towed out to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway, carefully, since the ground crew are very afraid of scratching the brand new paint job.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Pm6xtXSh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Pm6xtXSh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCommander Koonce releases the brakes and pulls back on the throttles. They don\u0027t move. He realizes that he needs to pull the cardboard shipping spacers out of the throttle levers. Then he pulls the throttles back and Freedom rolls down the runway and takes flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022n6SNOQhh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/n6SNOQhh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFreedom climbs to orbit, then performs her circularization burn. The crew opens the cargo bay doors, and once the cloud of packing material disperses Freedom is ready for orbital operations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qhTXf4wh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/qhTXf4wh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225kKRxUDh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5kKRxUDh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter an hour of peeling plastic film off of Freedom\u0027s control panels, the crew performs their rendezvous burns and then brings Freedom in to dock at Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Qexmz6Eh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Qexmz6Eh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vzqpIgOh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vzqpIgOh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m1Jgscoh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/m1Jgscoh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter saying their hellos to the Kerbin Station crew, they get to work. Kerbin Station XO Keegan brings the cargo drone around to pick up the truss adapter docked at the end of the port truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OiylPgNh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/OiylPgNh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhile Payload Specialist Kent erects the radiator truss in the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QyXze3ph.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/QyXze3ph.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen the cargo drone is brought around to dock with the radiator truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PDNyywTh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/PDNyywTh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd the radiator truss is brought up to its berth on the center truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GKUDrQdh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/GKUDrQdh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the truss is in place, the crew verifies its systems are connected and functioning. Much the same as the port radiator truss, the starboard radiator panels won\u0027t actually be extended until the laboratory module has been docked to its permanent berth on the core module on a future mission. For now, the crew breaks out their BARs in celebration, and then settles in for a good night\u0027s sleep.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bOQE66Bh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/bOQE66Bh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe next morning, the crews say their farewells. Then they close the hatches and Freedom breaks away from Kerbin Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NsefkyHh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NsefkyHh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA short while later, Freedom burns its main engines to begin its reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eL6awMVh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/eL6awMVh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFreedom reenters the atmosphere and as her structure heats up the smell of burning plastic begins to permeate the cabin. The crew initially panics, but after a minute or so they realize that maybe the factory workers just forgot to remove the protective film from the heat-resistant tiles on the hull. The smell abates after a few minutes, and Freedom settles in to her flight path to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KoqTS3Th.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KoqTS3Th.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith a shriek of rubber on concrete, Freedom touches down on the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway. As the rollout completes, the crew celebrates their successful mission, and the ground crew comes out to tow Freedom back to the hangar for a wash and wax.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eOu6dAah.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/eOu6dAah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbin Station continues to orbit, her crew settling in for another wait until the arrival of the starboard solar truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222wxlsaZh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2wxlsaZh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-07T05:18:01Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMission 108 - Kerbin Station Starboard Solar Truss\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIndependence\u0027s sixth mission will deliver Kerbin Station\u0027s second solar truss. This truss will provide the second half of Kerbin Station\u0027s power requirements, bringing it to 100% of the power required to meet its full operational capability.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225KG793Eh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5KG793Eh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBecause one of the flight crews were taken out of the rotation to become the first crew of Kerbin Station, a crew of new recruits will be flying this mission. This flight crew is:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Keith Kilpatrick\u003Cbr\u003E\nPilot Charles Kern\u003Cbr\u003E\nFlight Engineer Clarice Kopp\u003Cbr\u003E\nPayload Specialist Selma Knotts\u003Cbr\u003E\nMission Specialist Garry Knight\u003Cbr\u003E\nMission Specialist Cleo Kiser\n\u003C/p\u003E\n\u003Cp\u003E\nOn a clear Day 8 morning, Independence is rolled out to the runway. Commander Kilpatrick releases the brakes and runs up the throttles, and Independence takes flight once more.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vBzsMtch.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vBzsMtch.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GttYqwsh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/GttYqwsh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence performs her circularization burn, and the crew rigs the ship for orbital operations. Their rendezvous burn is almost two hours away, so they sigh and pull out a deck of magnetic cards....\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022US1TmdPh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/US1TmdPh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Jor4wqch.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Jor4wqch.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter an hour and a half, Payload Specialist Knotts has successfully defended her title as KSP Spades Champion. The crew take their seats again and perform the rendezvous burns. Independence approaches Kerbin Station for docking.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IpEWjCOh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/IpEWjCOh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224Ci6glth.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/4Ci6glth.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow that Independence is docked, the work can begin. Payload Specialist Knotts erects the truss in the cargo bay while Kerbin Station Commander Koontz guides the cargo drone around to dock with it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222ggNuXZh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2ggNuXZh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J9W6qdWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/J9W6qdWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen the cargo drone brings the solar truss around to its permanent berth on the end of the starboard radiator truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022H7sCDcHh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/H7sCDcHh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the starboard solar truss is docked, the crew performs their system checks to ensure that it is functioning properly. Then they have a hearty celebratory (re-hydrated) dinner with the Kerbin Station crew and settle in for a good night\u0027s sleep before reentry the next day.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002294lYFTvh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/94lYFTvh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe next day, the hatches are closed and Independence breaks away from Kerbin Station once again. Their reentry burn goes off without a hitch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vVy4aenh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vVy4aenh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sxkH63Sh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/sxkH63Sh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIndependence passes through the fire of reentry then glides in to a landing on the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E runway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220pPAMnyh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/0pPAMnyh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KUfHgvWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KUfHgvWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IflQy7Wh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/IflQy7Wh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow Kerbin Station has all of its power and radiator capacity. But, because of clearance issues, the starboard radiator and solar arrays cannot be deployed until the starboard docking port on the core module has been filled. So the next mission will deliver the laboratory module, which will be placed on the starboard docking port of the core module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D82nxw3h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/D82nxw3h.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-07T17:37:33Z\u0022 title=\u002201/07/2022 05:37  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 7, 2022\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-08T05:45:48Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMission 109 - Kerbin Station Laboratory Module and Cargo Drone\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe next step in construction of Kerbin Station is to deliver the laboratory module, where the mysteries of SCIENCE! will be explored.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227q9W61Yh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/7q9W61Yh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, this mission will bring up a second cargo drone, to provide redundancy. After extensive polling, a social media campaign, and online voting, the name selected for the new cargo drone was, \u0022Cargo Drone 2\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew for this mission is:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Cleveland Kaufman\u003Cbr\u003E\nPilot Gavin Kenney\u003Cbr\u003E\nFlight Engineer Herman Kinney\u003Cbr\u003E\nPayload Specialist Dwayne Kohler\u003Cbr\u003E\nMission Specialist Lily Kemp\u003Cbr\u003E\nMission Specialist Edwin Klinger\n\u003C/p\u003E\n\u003Cp\u003E\nLiberty is rolled out to the end of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway for her third mission. As Commander Kaufman releases the brakes and brings the throttles to full power, Liberty takes flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022owW4trXh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/owW4trXh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022d6NCP6lh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/d6NCP6lh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLiberty climbs to orbit, and after her circularization burn the crew rigs the ship for orbit. With only an hour until the first rendezvous burn, the crew barely has time to relax.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022evv6I8Nh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/evv6I8Nh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nL7DfOgh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/nL7DfOgh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe rendezvous burns go well, and soon Liberty is closing in on Kerbin Station once again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cah5Tomh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/cah5Tomh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ftTGAByh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ftTGAByh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KswkfxAh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KswkfxAh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022v5h3Wksh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/v5h3Wksh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter docking, the crew give their greetings to the Kerbin Station crew, then everyone gets to work.\n\u003C/p\u003E\n\u003Cp\u003E\nPayload Specialist Kohler releases the clamps and erects the laboratory module in the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hHBpL2Ph.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/hHBpL2Ph.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCaptain Koontz pilots the new cargo drone around and docks it with the laboratory module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qetZzy0h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/qetZzy0h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen the laboratory module is extracted and docked to its berth on the core module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002269C5izGh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/69C5izGh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jZGPHJGh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/jZGPHJGh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qUmTe51h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/qUmTe51h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the laboratory module is docked to its berth, Cargo Drone 2 is moved to a parking berth on the escape pod hub.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ETtV2UKh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ETtV2UKh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso, to prevent any clearance issues after the radiator and solar arrays have been deployed, Cargo Drone 1, with the truss adapter, is moved to a parking berth on the end of the center truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lU2lBL7h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/lU2lBL7h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith all the necessary preparations made, the crew extends the starboard side radiator and solar panels.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B7ftEF9h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/B7ftEF9h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Au0H7QAh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Au0H7QAh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, Kerbin Station is at 100% of its design capacity for power and heat removal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NG6CTqnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NG6CTqnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter an exhausting day\u0027s work, the crew exchange some fist bumps, eat some hastily prepared snacks, then settle in for a well deserved night of rest.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next morning, they close the hatches to Liberty and break the spaceplane away from the station for reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iCWVvleh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/iCWVvleh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew brings Liberty about and burns for reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sz8U0Ihh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/sz8U0Ihh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter they rig for atmosphere, the ship plunges homeward.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225Bc7iH7h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5Bc7iH7h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLiberty soars over the western mountains, and Commander Kauffman brings her in to her third landing at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222BLScEGh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2BLScEGh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226YgtQXKh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/6YgtQXKh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbin Station is now nearing completion. The crew spends their next day unpacking the various experiments in the laboratory module. The next mission will bring up the second half of the crew complement.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YeisCGsh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/YeisCGsh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-08T23:01:51Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EMission 110 - Kerbin Station Escape Pods and Crew\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFreedom\u0027s second mission will carry two more escape pods to Kerbin Station, along with six more crew members, bringing it to its full compliment of 12.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kjG9Djhh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/kjG9Djhh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFreedom\u0027s flight crew for this mission is as follows:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Jane Knoll\u003Cbr\u003E\nPilot Jackie Kimble\u003Cbr\u003E\nFlight Engineer Araceli Krebs\u003Cbr\u003E\nPayload Specialist Sierra King\u003Cbr\u003E\nMission Specialist Keisha Keene\u003Cbr\u003E\nMission Specialist Lea Kimbrough\n\u003C/p\u003E\n\u003Cp\u003E\nThe additional crew being brought to Kerbin Station are:\n\u003C/p\u003E\n\u003Cp\u003E\nAssistant Pilot Barney Kearney\u003Cbr\u003E\nAssistant Pilot Eli Koonce\u003Cbr\u003E\nAssistant Engineer Jaime Kent\u003Cbr\u003E\nAssistant Engineer Rachel Killian\u003Cbr\u003E\nAssistant Scientist Blair Kovach\u003Cbr\u003E\nAssistant Scientist Norman Koontz\n\u003C/p\u003E\n\u003Cp\u003E\nThe tug tows Freedom out to the end of the runway on a bright sunny morning. Commander Knoll gives a wave, runs up the throttles, and with a roar Freedom takes flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pi7mLK2h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/pi7mLK2h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qA8uaAoh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/qA8uaAoh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter they reach space, the crew performs their circularization burn and rigs the ship for orbital operations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022F8WKHL5h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/F8WKHL5h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oAfH0rBh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/oAfH0rBh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith no time to lose, since the first rendezvous burn is in only half an hour! They hurry through their preparations, and the burn is executed flawlessly. Soon, Freedom is approaching Kerbin Station for docking.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Yo6nPKHh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Yo6nPKHh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ecz6wUuh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Ecz6wUuh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter docking, the new arrivals begin moving their possessions and equipment into their new home. But the rest of the crew gets to work transferring the escape pods. First, Payload Specialist King releases the clamps and erects the escape pods in Freedom\u0027s cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ElgjrSah.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ElgjrSah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen Commander Koontz brings Cargo Drone 2 around to pick up the third escape pod and carry it to its berth on the escape pod hub.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xY1rI03h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xY1rI03h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WeqQYmgh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/WeqQYmgh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen the drone is brought around again to pick up the last escape pod and berth it on the hub.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DtJsgEvh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/DtJsgEvh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AX55nYch.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/AX55nYch.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinally, the cargo drone is undocked from the escape pod and brought around to a parking spot on the end of the escape pod hub.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IlH8KKNh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/IlH8KKNh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, after a good day of work, everyone settles down to the largest gathering of Kerbals in space ever. The wardroom in the habitation module is packed to the rafters.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sAfZ17mh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/sAfZ17mh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a good night\u0027s rest, Freedom breaks away from the station and burns for reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022am84ALXh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/am84ALXh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022brddwAhh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/brddwAhh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter braving the heat of reentry, Freedom lines up with the flight path for the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway, and Commander Knoll brings her in for a perfect landing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NTHXaGXh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NTHXaGXh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002240NYrw5h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/40NYrw5h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sVH30cEh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/sVH30cEh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, back in orbit, the crew of Kerbin Station are bringing the station to full operation. Now that they have a full complement of crew and the science lab, they can begin to conduct scientific experiments. Their first course of experiments will be to determine why the plastic packets their food rations come in are so hard to open.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pRMJA0yh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/pRMJA0yh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe next mission will see the debut of the fourth and final Independence-class spaceplane, and will begin construction of the Kerbin Station docking complex, which will facilitate the assembly of cargoes destined for other locations in the Kerbin system.\n\u003C/p\u003E\n"},{"CreatedByName":"Angelo Kerman","CreatedById":106975,"CreatedDateTime":"2022-01-09T01:23:48Z","Content":"\n\u003Cp\u003E\nLooking good! I like the design of your station and spaceplane. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-09T03:24:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224074893\u0022 data-ipsquote-contentid=\u0022206066\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221641691428\u0022 data-ipsquote-userid=\u0022106975\u0022 data-ipsquote-username=\u0022Angel-125\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Angel-125 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLooking good! I like the design of your station and spaceplane. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks. I\u0027ve actually been flying this spaceplane design, with minor variations, for quite a while.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u002270033\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5279280114\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/91713-110x-mark-iv-spaceplane-system-august-3/page/68/\u0026amp;do=embed\u0026amp;comment=3505525\u0026amp;embedComment=3505525\u0026amp;embedDo=findComment#comment-3505525\u0022 style=\u0022height:252px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-13T05:28:17Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMission 111 - Kerbin Station Docking Complex Spine\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNow Kerbin Station is fully kerballed, and is conducting full science operations. The next step is to equip it as a staging point for operations throughout the Kerbin system.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd, with much fanfare, the fourth and final Independence-class spaceplane is commissioned into service. Christened Opportunity, she will bring the first modules of the new Kerbin Station docking complex into orbit on her maiden voyage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Akogcvih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Akogcvih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOpportunity\u0027s first crew are rookies as well:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Dominic Kozak\u003Cbr\u003E\nPilot Elaine Kohn\u003Cbr\u003E\nFlight Engineer Clayton Kilgore\u003Cbr\u003E\nPayload Specialist Judi Keith\u003Cbr\u003E\nMission Specialist Phillip Kemper\u003Cbr\u003E\nMission Specialist Irwin Kimmel\n\u003C/p\u003E\n\u003Cp\u003E\nClouds are gathering over Kerbal Space Center today, but mission controllers decide that the weather is still clear enough for launch. Commander Kozak guides Opportunity through a clean takeoff, and after the closed-cycle transition she climbs smoothly into space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IZFmdABh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/IZFmdABh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228CvuPMqh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/8CvuPMqh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oQ6NeZDh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/oQ6NeZDh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter performing their circularization burn and rigging for orbit, the crew waits an hour and a half for their first rendezvous burn. They pass their time by playing \u0022I Spy\u0022, which reveals at least six different control buttons they had never seen before.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022N9SFPGlh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/N9SFPGlh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rMozJdnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/rMozJdnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter their pause, they buckle in again and perform their maneuvers. Then they cautiously approach Kerbin Station and bring Opportunity in to dock.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mlmiKqGh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/mlmiKqGh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022szECs8Xh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/szECs8Xh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227bUg8ljh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/7bUg8ljh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew of Kerbin Station greet the new flight crew, and after exchanging some pleasantries, they all get to work. Payload Specialist Keith erects the new docking complex modules in the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227fAMxeJh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/7fAMxeJh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen Captain Koontz brings her cargo drone around to dock with it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002269i2rgph.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/69i2rgph.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe next part is tricky. You see, the docking complex is supposed to be berthed at the nadir port of Kerbin Station\u0027s core module. But, right now, Opportunity is docked at the nadir port of the core module. This was the most intense part of the crew\u0027s training, and resulted in many aborted attempts to balance the docking complex spine on Opportunity\u0027s nose in the simulator. But the final plan that was selected was to dock the spine at an unused port on the station, then wait until Opportunity had returned to Kerbin to place it in its final position. Sierra King was awarded \u0022Engineer of the Month\u0022 for this solution. She won a certificate printed out of Powerpoint and a Karbucks gift card. Captain Koontz guides the cargo drone, laden with its unwieldy load, to dock at the vacant port on the truss adapter berthed at the zenith of the center truss.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pFaqNERh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/pFaqNERh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Wb3Jl8wh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Wb3Jl8wh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTheir cargo thus delivered, the crew of Opportunity settle in with the crew of Kerbin Station for the rest of the day. They bring news of home, exchange jokes and stories, marvel at whatever the heck it is that is going on in the science lab, and share their rations and BARs. Then they settle in for a good night\u0027s sleep.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next morning, the crew of Opportunity bids farewell to Kerbin Station, closes the hatches, and fires the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E. They drift away, then line up and burn for reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hBNyVBVh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/hBNyVBVh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RsTPz8rh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/RsTPz8rh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter reentry, Commander Kozak lines Opportunity up with the flight path for the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E runway, and brings her in for a perfect landing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tNIH4EFh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/tNIH4EFh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225u3ivDWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5u3ivDWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UjHxwbgh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/UjHxwbgh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOpportunity\u0027s first mission has been a great success. Commander Kozak and his crew enjoy a warm welcome home. But back in orbit, the job isn\u0027t quite finished yet...\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-13T05:46:59Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EKerbin Orbit Operations - Y1 D12\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, back at the station, Captain Koontz is getting work done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VlVigREh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/VlVigREh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFirst, Cargo Drone 1 is undocked from its parking spot on the escape pod hub and brought around to dock with the docking adapter that is berthed on the nadir port of the core module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022olTUP6bh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/olTUP6bh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen Cargo Drone 1 removes that docking adapter from the nadir port and moves it to the docking port on the escape pod hub. This clears the core module\u0027s nadir port for the docking complex spine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yApUgQMh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/yApUgQMh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow she takes control of Cargo Drone 2 and uses it to remove the docking complex spine from its parking spot on the central truss. She then maneuvers it to the opposite side of the station and docks it to its permanent location, the nadir port of the core module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DqZxBlih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/DqZxBlih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the spine has been docked, all that remains is to move CD2 back to its parking spot to clear the new docking adapter at the end of the spine, which will become the new standard docking location for spaceplanes arriving from Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iUV6i1yh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/iUV6i1yh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221XrNwSrh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/1XrNwSrh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo now the docking complex spine is in its permanent location and Kerbin Station is ready to receive its next shipment of modules. Only two more spaceplane missions will be required to complete the construction of Kerbin Station!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-13T05:47:44Z\u0022 title=\u002201/13/2022 05:47  AM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 13, 2022\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003Cbr\u003ELayout issues\n\u003C/span\u003E\n"},{"CreatedByName":"AtomicTech","CreatedById":210823,"CreatedDateTime":"2022-01-14T16:48:40Z","Content":"\n\u003Cp\u003E\nConsider me hooked!\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2022-01-15T01:47:04Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMission 112 - Kerbin Station Docking Complex Arms\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe penultimate Kerbin Station construction mission will lift the arms for the docking complex. These will provide additional docking ports for the docking complex, allowing it to host a multitude of spacecraft and payloads in the future as Kerbin Station becomes an orbital dockyard for cargo traveling throughout the Kerbin system.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EU7idV2h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/EU7idV2h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe flight crew for this mission is as follows:\n\u003C/p\u003E\n\u003Cp\u003E\nCommander Charles Kern\u003Cbr\u003E\nPilot Keith Kilpatrick\u003Cbr\u003E\nFlight Engineer Selma Knotts\u003Cbr\u003E\nPayload Specialist Clarice Kopp\u003Cbr\u003E\nMission Specialist Cleo Kiser\u003Cbr\u003E\nMission Specialist Gary Knight\n\u003C/p\u003E\n\u003Cp\u003E\nIndependence is rolled out to the runway for her seventh mission. Commander Kern takes the yoke and runs up the throttles, and Independence takes flight once more and quickly pushes through Mach 1.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002205l7fc6h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/05l7fc6h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022llLDWpqh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/llLDWpqh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCruising smoothly through her flight phase, Independence reaches space. After her circularization burn, the crew rigs her for orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225ul422Xh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5ul422Xh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022taFFw4eh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/taFFw4eh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a brief delay, the crew performs their rendezvous burns, bringing them to within 175 meters of Kerbin Station. Then Pilot Kilpatrick takes the conn at the docking station and brings Independence in to a graceful first docking with the new Kerbin Station docking complex.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JUAFORSh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/JUAFORSh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224sntBQmh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/4sntBQmh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ruFNilrh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ruFNilrh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter docking, Payload Specialist Kopp gets to work erecting the new expansion modules in the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022P1ZMU4hh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/P1ZMU4hh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThen Assistant Pilot Kearney takes control of Cargo Drone 1 and brings it around to dock with the new docking adapter on the end of the starboard docking complex arm in the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NmtG4Zth.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NmtG4Zth.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nReleasing the clamps which hold the starboard arm in place, the cargo drone extracts it from the cargo bay, and Kearney guides it around to dock the arm in its berth on the docking complex spine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022L3cgKwsh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/L3cgKwsh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow Kearney takes command of Cargo Drone 2. He undocks the drone and its attached docking adapter and brings them around to dock with the port docking complex arm.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D0ZzlRnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/D0ZzlRnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MBom4oUh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/MBom4oUh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nExtracting the port arm from the cargo bay, he maneuvers it around and connects it to the port side of the spine. The day\u0027s work is done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EKoCvuCh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/EKoCvuCh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022h0IS38Qh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/h0IS38Qh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222VmmNjnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/2VmmNjnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IzCBhtXh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/IzCBhtXh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTaking stock of a long day of work, the crew open all the hatches into the docking modules and look out of all the windows. Then they enjoy a \u003Cs\u003Edelicious\u003C/s\u003E \u003Cs\u003Enutritious\u003C/s\u003E 100% reconstituted meal together and settle in for the night.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next morning they break Independence away from Kerbin Station and burn for reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cYvUIWih.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/cYvUIWih.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KWepwpnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KWepwpnh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter braving the hot plasma once more, Commander Kern guides Independence into the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E glide path, and then brings her down for a perfect landing on the runway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WzpAqB4h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/WzpAqB4h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sqsgVzGh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/sqsgVzGh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KTDz6xah.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KTDz6xah.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022epljlpYh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/epljlpYh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uVGEvq1h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/uVGEvq1h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbin Station is now almost complete. Only the cupola and airlock modules remain to be added, and those will be brought up by Liberty on the final construction mission, lucky number 13!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lZZXiSWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/lZZXiSWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AtomicTech","CreatedById":210823,"CreatedDateTime":"2022-01-19T17:32:33Z","Content":"\n\u003Cp\u003E\nThis series is a major inspiration for my new one (i.e. using a bad-kass Spaceplane to build stuff)!\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t wait to see what you build next!\n\u003C/p\u003E\n"}]}