{"TopicId":209012,"ForumId":51,"TopicTitle":"RO/RP1 Career - New Player","CreatedByName":"MSteele","CreatedById":222152,"CreatedDateTime":"2022-07-17T04:12:20Z","PageNum":1,"Articles":[{"CreatedByName":"MSteele","CreatedById":222152,"CreatedDateTime":"2022-07-17T04:12:20Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EPREFACE\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHello, I\u0027ve decided to take the plunge and begin a Mission Report for a new career, which is fitting because I\u0027m technically a new player as well. I think it\u0027ll be educational for me over the length of the campaign, and with your help, give me a better understanding on the intricacies of playing. I\u0027ve read and watched a lot of career mission reports, tutorials, and featured content. I think I have a pretty solid idea on how I\u0027d like to progress. That said, I\u0027m not so solid on some of the more advanced applications of the game.\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EKSP EXPERIENCE\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFor all intents and purposes, I consider myself a \u003Cem\u003ENew Player, \u003C/em\u003Edespite playing the game on and off for a couple years, never more than a week or so at a time. I\u0027ve dabbled in both stock and modded KSP. I like the unrestricted feel of stock, but feel I get more of a sense of accomplishment out of an \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP1 install, and feel more invested in the welfare of my Kerbals. I\u0027ve yet to delve into Principia, but from what I\u0027ve seen it is right up my alley. I\u0027m a glutton for punishment. For example, in EverQuest I play a bard and a cleric (Ranger in early expansions). In Eve, I\u0027m part of a Wormhole Corp. In AD\u0026amp;D I roll straight stats in order and play Lawful Good.  In Farming Simulator I start with low funds and no equipment. In college I chose Spanish w/Teaching Cert as my first major - I knew exactly one word in Spanish. In KSP, let\u0027s just go \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP1 (and maybe soon Principia). \u003Cspan\u003EI like the challenges, I guess.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EIMPORTANT GAME SETTINGS\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan\u003EHard mode as a base\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nCommNet: Require signal enabled\n\u003C/li\u003E\n\u003Cli\u003E\nCommNet: Plasma blackout enabled\n\u003C/li\u003E\n\u003Cli\u003E\nDisable X-Plane contracts (Not interested in atmospheric flying)\n\u003C/li\u003E\n\u003Cli\u003E\nPre-launch ignition failures disabled\n\u003C/li\u003E\n\u003Cli\u003E\nHigh dynamic pressure penalty enabled\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003ERELEVANT MODS\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP1 (express install) and associated mods via \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nI can post a list if there is interest\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ESELF IMPOSED LIMITATIONS\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nLimit of one mulligan per launch/maneuver\n\u003Cul\u003E\u003Cli\u003E\nUnless game bug , cat on keyboard, house catches fire, wife aggro, new episode of Rick \u0026amp; Morty.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nTry to stick to historically accurate/near future realistic design and mechanics within limitations of the game and skillset\n\u003C/li\u003E\n\u003Cli\u003E\nNo need to follow historical mission progression - i.e. Sputnik, Gemini, Mercury, Soyuz, Apollo, etc.\n\u003C/li\u003E\n\u003Cli\u003E\nContracts are not the end all be all\n\u003Cul\u003E\u003Cli\u003E\nDo them as needed, but certainly do not live or die trying to get that 3km downrange contract done by JUL 1951.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThe first Mission Report should be ready shortly. I\u0027ll try to keep them short and concise, but I can get windy sometimes. Especially since I like to scour the web for technical drawings, declassified documents, and space science articles (Which I plan to include a link to or at least provide attribution when I use them in the series).\n\u003C/p\u003E\n\u003Cp\u003E\nFeel free to tell me to scale it back or supply even more detail. Additionally, if you don\u0027t like the way something is presented, speak up. If you get annoyed by a certain camera angle I\u0027ve fixated on every report, or if the video/screenshots don\u0027t show relevant info - hit reply and tell me so. If I\u0027m going around my backside to get to my elbow and you have a more elegant solution, speak up. And in the name of all that is Kerbal, let me know if I\u0027m missing a basic gameplay or core mechanic in my reports. You won\u0027t hurt my feelings... remember, I play Eve Online. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003Cspan style=\u0022font-size:8px;\u0022\u003E(Except if you make fun of my voice or my southern accent - Momma says I have the voice of an angel)\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#ff6600;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003ENext Up: Mission 1 - First Flight\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003ETo be continued...\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2022-07-17T05:44:20Z","Content":"\n\u003Cp\u003E\nI think you care for other people\u0027s opinions a bit too much. This is \u003Cem\u003Eyour\u003C/em\u003E mission report! In any case, \u003Cem\u003E\u003Cstrong\u003EF O L L O W E D\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MSteele","CreatedById":222152,"CreatedDateTime":"2022-07-17T09:42:14Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#f39c12;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EMission 1 - First Launch (Correct contract title)\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003ESynopsis\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch a rocket! I think we can handle that much.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EMission Parameters\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nReach 1km altitude and 50 m/s speed\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EDesign Process\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI gathered some design data from the web for our first rocket. It will be a Tiny-Tim as it is colloquially known, or the US Navy 11.75\u0022 Rocket Aircraft Mk 3 Mod 1 . Although this rocket had been in use for several years by 1951 as an ATGM aboard Navy attack aircraft, we still need to test it for our own design purposes. We plan to use it as the booster portion of other sounding rockets.\n\u003C/p\u003E\n\u003Cp\u003E\nJohn Coker built a scale replica of the WAC-Corporal sounding rocket including the booster and documented the process on his site. I used a bunch of his pictures as inspiration for my own design of the Tiny-Tim for KSP.\u003Cbr\u003E\u003Ca href=\u0022http://jcrocket.com/waccorporal.shtml#top\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://jcrocket.com/waccorporal.shtml#top\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAndreas Parsch has an incredible amount of history and documents I was able to glean some information from as well.\u003Cbr\u003E\u003Ca href=\u0022http://www.designation-systems.net/dusrm/app4/index.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.designation-systems.net/dusrm/app4/index.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA Fandom site dedicated to military history has an entry for the Tiny-Tim that I found extremely useful.\u003Cbr\u003E\u003Ca href=\u0022https://military-history.fandom.com/wiki/Tiny_Tim_(rocket)\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://military-history.fandom.com/wiki/Tiny_Tim_(rocket)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA nice little document I found on a War Thunder site (of all places, sheesh) has some pretty useful information and line drawings of the booster in a PDF and jpgs. A lot of images on the site are of in game scenes, and I have a feeling some of the designs were not actually in real world use, but nevertheless helpful.\u003Cbr\u003E\u003Ca href=\u0022https://wiki.warthunder.com/Tiny_Tim\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://wiki.warthunder.com/Tiny_Tim\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd of course Wikipedia.\u003Cbr\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Tiny_Tim_(rocket)\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Tiny_Tim_(rocket)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EYouTube Account of Mission\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EI really need to watch a video on encoding for YouTube - this is pretty bad.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/SiwN5HqjR8Q?feature=oembed\u0022 title=\u0022KSP RO RP1 First Launch\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-17T09:56:04Z\u0022 title=\u002207/17/2022 09:56  AM\u0022 data-short=\u00221 yr\u0022\u003EJuly 17, 2022\u003C/time\u003E by MSteele\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MSteele","CreatedById":222152,"CreatedDateTime":"2022-07-18T05:12:25Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EMission 1 Debrief\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe table below will be updated after each mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HW8fRIB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002216.58\u0022 height=\u0022189\u0022 width=\u00221140\u0022 src=\u0022https://i.imgur.com/HW8fRIB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch and flight went rather well. The flight characteristics of the Tiny-Tim booster with the attached service module (empty), and small avionics nose assembly was surprisingly stable. We satisfied FAE\u0027s contract terms and was awarded a small sum of cash to fund our program even further.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMission Debrief Supplemental\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition to the initial post on research and design, here are a few images that may provide some more insight on the rocket I created and launched for this mission. Most images are of the 4-fin design as requested by the US military, but the designs out of CalTech in the 1940s were initially 3-fins, as depicted in my mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fOKS0ki.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022145.75\u0022 height=\u0022391\u0022 width=\u00221200\u0022 src=\u0022https://imgur.com/fOKS0ki.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe below diagram, although somewhat \u0027old-looking\u0027 was pulled off a fan site dedicated to the War Thunder video game. It has its merits though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MHZySNg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022151.16\u0022 height=\u0022916\u0022 width=\u0022606\u0022 src=\u0022https://imgur.com/MHZySNg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zfn9qxp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002263.67\u0022 height=\u0022319\u0022 width=\u0022501\u0022 src=\u0022https://imgur.com/zfn9qxp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ppKP2Ki.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002261.09\u0022 height=\u0022336\u0022 width=\u0022550\u0022 src=\u0022https://imgur.com/ppKP2Ki.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eI24tnM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002237.20\u0022 height=\u0022279\u0022 width=\u0022750\u0022 src=\u0022https://imgur.com/eI24tnM.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-18T05:13:14Z\u0022 title=\u002207/18/2022 05:13  AM\u0022 data-short=\u00221 yr\u0022\u003EJuly 18, 2022\u003C/time\u003E by MSteele\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MSteele","CreatedById":222152,"CreatedDateTime":"2022-07-18T08:01:57Z","Content":"\n\u003Cp\u003E\nMission 2 Prep\n\u003C/p\u003E\n\u003Cp\u003E\nAs you are probably well familiar with the next set of missions, it will be no surprise to you that I\u0027ll be building a Tiny-Tim WAC-Corporal rocket. The mission requirements are 75km for the Sounding Rockets (Low) contract, and the Karman Line at 100km. Historically, the WAC-Corporal did not breach the Karman Line with this 1st generation engine, so maybe we\u0027ll have to wait for the engine upgrade - but we\u0027ll take the advance funds anyway and wait. Although, we just might be able to squeak past the 100km mark with some shenanigans.\n\u003C/p\u003E\n\u003Cp\u003E\nI read that during the post war V2 research at White Sands, the engineers placed recordable telemetry in one of the fins instead of the payload section of the nose. The reason for this was that when the V2 came back to earth they were mostly destroyed, and tended to break up sometimes due to aerodynamic stresses - destroying the payload in the nose. So they put it in a fin a few times since that part had a reasonable chance to survive. It kind of worked. If I recall correctly, one or two launches returned usable data from the fin-telemetry.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe I\u0027ll apply that idea to my next set of missions. Here\u0027s the deal: When the WAC-Corporal was being developed, they attempted to recover the entire LV. There was a short cable that maintained a strong connection to the fuselage as the nosecone separated for parachute deployment. In my  potential design ideas, I can\u0027t really do that, so I plan to use a 0.3m inline chute and keep the rocket intact with no separating mechanism. This will stretch the rocket a little bit and most likely cause some unwanted drag - thereby possibly preventing the rocket from being able to breach the Karman Line with that weak 1st gen engine.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever - let the shenanigans  ensue: No parachute. Not entirely historically accurate, for sure - but what the hell? Sure, let\u0027s launch the first one normally and gather the science from the first recovery, but any subsequent launches will not have a parachute. Maybe, just maybe we\u0027ll breach 100km - Remember, we are launching at a less than 90 degree angle so our max height will be lower than if we were launching straight up.\n\u003C/p\u003E\n\u003Cp\u003E\nI saw a table in a document on sounding rocket launches and it stated that these particular launch angles were set to 85 degrees. But in most of the pictures I\u0027ve seen and the descriptions of the launch towers - they \u0027look\u0027 straight up and down. Maybe they were 85 degree launches in these pictures and I can\u0027t see such a small difference. Regardless, I\u0027m sticking to 85 degrees because reasons. And Safety!\n\u003C/p\u003E\n\u003Cp\u003E\nHere is a document I found and converted to metric units. It\u0027s pretty neat. Let\u0027s see if it\u0027ll fly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jiQTEuK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022143.92\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/jiQTEuK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MSteele","CreatedById":222152,"CreatedDateTime":"2022-07-20T04:16:06Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cspan style=\u0022color:#e67e22;\u0022\u003ELaunch #2 - 20 May 1951\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/L82ENkUTULM?feature=oembed\u0022 title=\u0022KSP RO RP1 Launch 2\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MSteele","CreatedById":222152,"CreatedDateTime":"2022-07-21T19:15:46Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:26px;\u0022\u003E\u003Cstrong\u003EAugust 1951\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith the successful test of the WAC Corporal, the agency has an influx of science and funds. Despite my leaning toward Early Solid Rockets in the tech tree, I\u0027ve decided it would better to go with Post-War Rocketry for the upgrades to the Aerobee engine. The XASR-1 is a better upgrade right now than a booster from Early Solids.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cJeFaUZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002249.50\u0022 height=\u0022247\u0022 width=\u0022499\u0022 src=\u0022https://i.imgur.com/cJeFaUZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe next goal is to break the Karman Line at 100km. This WAC-Corporal will definitely not do it in its current configuration. There are however, some slight modifications and semi-risky designs I could do to get it over this hump. I don\u0027t think I have a choice. I could launch more of the same and gather more science, but I\u0027ll eventually run out of funds. I \u003Cem\u003Eneed\u003C/em\u003E that Karman Line contract completed!\n\u003C/p\u003E\n\u003Cp\u003E\nSince I picked up the \u0027recovery science\u0027 and there is little else to gain, I\u0027ve removed the parachute from the WAC-Corporal. This will decrease mass a little. Possibly a small amount of drag as well. I tossed around the idea of increasing the launch angle from 85° to 87-88°, to gain more altitude and that is certainly something to think about more.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my research I came across some data that states switching from conical to an ogival shape for the nose (I guess in KSP you choose smooth cone and some sort of peak) results in a 4% increase in altitude for a particular rocket - I think it was the Aerobee 150. Don\u0027t go down that rabbit hole. I  have warned you. I spent hours reading about secant ogive, tangent ogive, LV-HAAK, the LD-HAAK (which btw is also called the von Karman ogive). That\u0027s a deep hole missing freshmen from the 2014 class at Embry-Riddle are still climbing out of. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221NSZ7cn.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002273.69\u0022 height=\u0022395\u0022 width=\u0022536\u0022 src=\u0022https://i.imgur.com/1NSZ7cn.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn the end, to get me more bang for the buck is to increase the amount of fuel in the tank the engine sits on. It has loads of available space since I reduced the utilization on the first rocket. Reducing the utilization allowed me to stay within design specs of the IRL rocket length and not push the engine burn time past 47(52) seconds. I run the risk of an engine failure by pushing it past its rated burn time by such a large amount, but the reward outweighs the risk, in this case.\n\u003C/p\u003E\n\u003Cp\u003E\nBy increasing utilization (fuel), the burn time now sits at 60 seconds. That is thirteen seconds past the rated burn time for this engine. Let\u0027s hope for the best. We can always launch another one... and another...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022krgukFY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u00228.33\u0022 height=\u002252\u0022 width=\u0022624\u0022 src=\u0022https://i.imgur.com/krgukFY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003ELaunch Day\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn Pad WAL-20 in an early afternoon of August. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022o3QhalR.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022123.43\u0022 height=\u0022769\u0022 width=\u0022623\u0022 src=\u0022https://i.imgur.com/o3QhalR.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLiftoff from Wallops Island WAL-20.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IYozSl9.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022104.49\u0022 height=\u0022651\u0022 width=\u0022623\u0022 src=\u0022https://i.imgur.com/IYozSl9.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd at the apoapsis looking down at the curvature of the Earth toward the east into the Atlantic.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cxx8woO.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002277.44\u0022 height=\u0022793\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/cxx8woO.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EDebriefing\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe launch and booster separation went fairly well, although I feel \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003E\u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E\u003C/abbr\u003E auto-staging might be holding onto the booster a tad bit long. Despite this, I was able to complete the contract.\u003Cbr\u003E\nMax altitude: 100.4km - We completed that contract by the skin of our teeth!\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the newly designed Mission Launch Board.\u003Cbr\u003E\u003Cimg alt=\u0022upk1GjL.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002221.35\u0022 height=\u0022193\u0022 width=\u0022904\u0022 src=\u0022https://i.imgur.com/upk1GjL.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-21T19:19:35Z\u0022 title=\u002207/21/2022 07:19  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 21, 2022\u003C/time\u003E by MSteele\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"MSteele","CreatedById":222152,"CreatedDateTime":"2022-07-22T04:35:23Z","Content":"\n\u003Cp\u003E\nLooking at the current state of science experiments, it looks like there is more data to be collected from the upper atmosphere. Telemetry is maxed, but pressure and temperature experiments have a little left to glean some more information from.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oE1Yz22.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022106.78\u0022 height=\u0022772\u0022 width=\u0022723\u0022 src=\u0022https://i.imgur.com/oE1Yz22.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere is also a bit of prize money to be had from the Swiss organization FAI for breaking altitude and speed record contracts, although we may have some problems executing them, as 120km altitude and 1500 m/s speed might be out of our grasp at the moment.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UNljLFr.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022152.24\u0022 height=\u0022373\u0022 width=\u0022245\u0022 src=\u0022https://i.imgur.com/UNljLFr.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI can’t help but compare FAI and the Guinness Book World Records. I’m unsure of that relationship, though. One sounds academic or scholarly and the other … Circus-like? I suppose I’d rather hang a Yuri A. Gagarin medal from the mantle rather than a stick-on golden seal certificate from Guinness. I’d also prefer to be in the company the likes of De Havilland, Doolittle, and Yeager rather than the world’s hairiest family, or the girl with the longest legs.\n\u003C/p\u003E\n\u003Cp\u003E\nRegardless, we’ve got enough funds to ramp up science a little more. 48k will not take us too far, but we’ll get at least one point of science. I want to hold onto about half that amount for purchasing upgrades.\n\u003C/p\u003E\n\u003Cp\u003E\nIt takes around 70 days to build a WAC Corporal, and there is 45 days left on being able to use the XASR-1 engine configuration. Rather than wasting 45 days, I think it’s prudent to build a rocket now and be a little over half finished with it when we get the engine upgrade. We’ll then start building a new rocket with the XASR-1 engine and get it in production when the WAC Corporal finishes.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, the remaining contracts available to choose from are out of reach. We do not have the rockets available to do a sub-orbital trajectory and return or any sounding rockets with a significant payload. Sure, we could build a V2 clone but at this point, the funds just aren’t there to tool and build it.\n\u003C/p\u003E\n\u003Cp\u003E\nI think mid to late 1952, we could do that. In the meantime, we’ll stick with the WAC-Corporal design and whatever else we come up with that will utilize the Aerobee engine and upgrades.\n\u003C/p\u003E\n\u003Cp\u003E\nMid-September 1951 we finished researching Post-War Rocketry and the XASR-1 configuration became available. The design was ready to implement, and we put it into production immediately.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:26px;\u0022\u003EAerobee 100\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Aerobee 100 is built around a .38-meter diameter fuel tank and tops out at 6 meters in length. Slightly larger than the WAC-Corporal, it has a mass 1.8 tons.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Pq5uGJM.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022196.97\u0022 height=\u0022975\u0022 width=\u0022495\u0022 src=\u0022https://i.imgur.com/Pq5uGJM.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe only historical information for this block of Aerobee rocket I found was the diameter and an approximate length. I looked at later iterations of the Aerobee rocket family and applied some of the same principles and aesthetics.\n\u003C/p\u003E\n\u003Cp\u003E\nStill underpowered, due to the limitations of using heavy steel fuel tanks and brick avionics, I had to crank up the burn time again. Twelve seconds more than the rated 40 seconds. This will give me 1731m/s d-v and a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E of 2.62 off the pad. We are due a failure, but let’s hope it doesn’t come sooner than later. We need every bit of science and funding available right now.\n\u003C/p\u003E\n\u003Cp\u003E\nTooling cost an arm and a leg. Especially since for some reason we are being charged to tool the same tank twice. I wonder if I tooled one, and not the other it would fix itself. Too late, though. I spent the funds.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221LiXHQZ.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002258.28\u0022 height=\u0022440\u0022 width=\u0022755\u0022 src=\u0022https://i.imgur.com/1LiXHQZ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt will take around 80 days for the Aerobee 100 to complete. Before that, we’ve got a WAC-Corporal being assembled and it’s about 2/3 done. We’ll gather more science with that, and perhaps complete the rest of the upper atmosphere science with the Aerobee 100 when it finishes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:26px;\u0022\u003E21 October 1951\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNight Launch – WAC Corporal\n\u003C/p\u003E\n\u003Cp\u003E\nMission success. We finished up most of the upper atmosphere science.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Sp1ET8G.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Sp1ET8G.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MiIxgaC.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002220.93\u0022 height=\u0022190\u0022 width=\u0022908\u0022 src=\u0022https://i.imgur.com/MiIxgaC.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext time: Aerobee 100 Launch.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you for reading this far. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-22T04:38:23Z\u0022 title=\u002207/22/2022 04:38  AM\u0022 data-short=\u00221 yr\u0022\u003EJuly 22, 2022\u003C/time\u003E by MSteele\u003C/strong\u003E\n\u003Cbr\u003Eimage\n\u003C/span\u003E\n"},{"CreatedByName":"Vagrant203","CreatedById":202630,"CreatedDateTime":"2022-08-01T19:25:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224155556\u0022 data-ipsquote-contentid=\u0022209012\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221658031140\u0022 data-ipsquote-userid=\u0022222152\u0022 data-ipsquote-username=\u0022MSteele\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/17/2022 at 12:12 AM, MSteele said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn Eve, I\u0027m part of a Wormhole Corp.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo you\u0027re at least mildly insane. \n\u003C/p\u003E\n"},{"CreatedByName":"dylansan","CreatedById":56234,"CreatedDateTime":"2022-10-16T02:12:02Z","Content":"\n\u003Cp\u003E\nThis is a great playthrough, and very similar to how I enjoy playing these kinds of games. I hope to see it continue!\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re looking for more research/inspiration, I just came across this pretty detailed \u003Ca href=\u0022http://rasaero.com/dloads/The%20Aerobee%20Sounding%20Rockets.pdf\u0022 rel=\u0022external nofollow\u0022\u003Eresource\u003C/a\u003E about the Aerobees that might be helpful. Lots of diagrams, descriptions, and photos.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the meantime, I\u0027ve updated to 1.12.3, reinstalled RP-1, and looking forward to seeing what I come up with.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: here\u0027s a link to a \u003Ca href=\u0022https://ntrs.nasa.gov/api/citations/19660005621/downloads/19660005621.pdf\u0022 rel=\u0022external nofollow\u0022\u003Elist of Aerobee launches\u003C/a\u003E from 1959 to 1963, with details about each individual launch. I\u0027ve been trying to decipher the two letter codes used, with no luck. I believe they relate to the scientific purpose of the launch, for example, 4.23 U\u003Cstrong\u003ES\u003C/strong\u003E relates to \u003Cstrong\u003ES\u003C/strong\u003Eolar measurements, 4.71 U\u003Cstrong\u003EP\u003C/strong\u003E involves \u003Cstrong\u003EP\u003C/strong\u003Ehotons, 4.69 C\u003Cstrong\u003EG\u003C/strong\u003E involves a \u003Cstrong\u003EG\u003C/strong\u003Eas flow counter, etc. It seems G\u003Cstrong\u003ET\u003C/strong\u003E stands for \u003Cstrong\u003ET\u003C/strong\u003Eesting, but in all cases I can\u0027t quite figure out what the first letter stands for. What system are you using for your flights? What do XT and WA stand for, for example?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit2: nevermind, I found a \u003Ca href=\u0022https://sites.wff.nasa.gov/code810/files/SRHB.pdf\u0022 rel=\u0022external nofollow\u0022\u003Eresource\u003C/a\u003E that lists Nasa\u0027s identification system (page 35).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-10-17T00:16:38Z\u0022 title=\u002210/17/2022 12:16  AM\u0022 data-short=\u00221 yr\u0022\u003EOctober 17, 2022\u003C/time\u003E by dylansan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSPMaster89","CreatedById":212179,"CreatedDateTime":"2022-11-13T20:34:22Z","Content":"\n\u003Cp\u003E\nI Like both the fact that you are a new player and also the extremely historic accuracy on this ! \n\u003C/p\u003E\n\u003Cp\u003E\nhope this project will go on\n\u003C/p\u003E\n"}]}