{"TopicId":216956,"ForumId":51,"TopicTitle":"The Sky is Not the Limit - STATUS: Gone, but not forever","CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2023-04-30T16:45:31Z","PageNum":9,"Articles":[{"CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2024-05-08T22:21:39Z","Content":"\n\u003Cp\u003E\nHello, everyone. I\u0027ve been a bit busy recently, but I haven\u0027t forgotten that \u003Ci\u003EThe Sky is Not the Limit \u003C/i\u003Eis now a little over one year old! I\u0027m sorry that I haven\u0027t been posting chapters often anymore, but I promise there\u0027s more coming down the pipeline. Here\u0027s to another year. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-05-08T22:21:50Z\u0022 title=\u002205/08/2024 10:21  PM\u0022 data-short=\u0022May 8\u0022\u003EMay 8\u003C/time\u003E by TwoCalories\u003C/strong\u003E\n\u003Cbr\u003EPage 9!\n\u003C/span\u003E\n"},{"CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2024-05-17T23:40:21Z","Content":"\n\u003Cp\u003E\nJust took this really nice photo while planning out new *pssst ss roadhouse expansions* and wanted to put it here, just to show let you know this thread is still alive. It has definitely been slow recently, but I promise that new chapters will be coming really soon.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/L226xfZ.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2024-05-20T04:22:26Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EChapter Twenty-Two: On-Site Laboratory\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/nEfgnld.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nIt was another beautiful morning at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, Koaington. Vankadia\u0027s southern regions were well known for their fair weathered climate. But thousands of Kerbals weren\u0027t there for the weather on July 1st, 1971. KASA was preparing to launch the biggest expansion of SS Roadhouse yet. Well, there had been relatively few expansions until then, but still.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/r1e8qgR.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOnce again, two Jovian-5 stacks are prepared on the launchpad, the foremost carrying the new station module and the one beyond it carrying the crew. They say Mortimer Kerman breaks into tears when he sees the 180,000 Funds of rocket on the pads, but at least the R\u0026amp;D division is happy.\n\u003C/p\u003E\n\u003Cp\u003E\nThe module that\u0027s being added to the station is a laboratory module. It has some more solar and batteries to satisfy the station\u0027s hunger for electricity. It also includes a much-needed airlock. Technically, the station already had an airlock, but it took up half the main module since it was built into. Now that space can be freed up for storage and such. The airlock is also in easy access with the science instrument pallets. The dream is to be able to swap out the science instruments on the two pallets for different ones as time goes on.\n\u003C/p\u003E\n\u003Cp\u003E\nBut first, we need to focus on the current station\u0027s needs. The crew is onboard Roadhouse-3. Ridesharing with them is a care package module carrying food, water, oxygen, and fuel to restock the station\u0027s supply. Roadhouse-3 will be going to orbit first and will dock to the station before the Lab Module launches. From there it will autonomously rendezvous somewhere around one kilometer from the station (we don\u0027t want debris from the discarded Upper Stage to get any closer to Roadhouse) and Roadhouse-3 will dock with it and bring it to the station, before moving to its own home port. That means the pilot of Roadhouse-3 will need to dock a whopping four total times this mission, so we\u0027re bringing in our top gun Jebediah Kerman as mission commander. Coming with him are two new hires, Robert Hallis K. and Luke Perron K. Both of them are scientists, as they will be manning the lab, the main focus of the mission.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/P9SGtKu.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/2u8JkCF.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TlNItjg.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nOrbit established.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/unksq6O.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PpE4iP4.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ufaYkc6.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nExtracting the care package.\n\u003C/p\u003E\n\u003Cp\u003E\nIt took almost a whole day to rendezvous with the station. The supply module doesn\u0027t contain much habitat space, or much anything. It\u0027s just a big dumb container with a docking port, filled to the brim with rations and monopropellant. The greenhorns Robert and Luke passed time by gazing down on Kerbin as well as acclimating to space for the first time.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/k2WxiJX.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nDocking with SS Roadhouse.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dyC7kNf.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter gingerly maneuvering around the radiator and solar panels with the bulky care package, Roadhouse-3 finally made a hard dock with the station. The crew could access the station from there though, but \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E decided that they\u0027d only be waiting a couple hours in the capsule, before retrieving the Lab and docking it, then moving to the crew docking port. It would be simpler than moving to the proper port twice.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UATVUAM.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe Lab launches late at night.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qDDc6tW.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe launch was uneventful, and within a few hours, the Lab was on course for the station.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/VY2EdGP.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/buWbKnE.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u0026lt;\u0026lt;Roadhouse-3, engage!\u0026gt;\u0026gt;\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/lngoJAc.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nRetrieving the Lab Module.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sVIA0LG.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nDocking the lab module.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/A4MWfBK.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nFinally, after almost two days in the capsule, the crew moves up to the station.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7E40qcd.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe station\u0027s so far completed state.\n\u003C/p\u003E\n\u003Cp\u003E\nThe crew gets the day to settle in and unload their supplies and gear. It\u0027s been a long day a work for the crew, and the next 70 days they\u0027ll be spending on the station will actually give them something to do this time, since there\u0027s a lab. We won\u0027t get much science from the lab using samples from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, so the guys at R\u0026amp;D are developing some kind of probe to gather data via flybys of Kerbin\u0027s moons. But that\u0027s not going to appear any time soon, let alone this mission. Everyone at KASA is pretty sick of rendezvouses for the time being.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAuthor\u0027s note:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nHi, everyone. It\u0027s been kind of a while since I last uploaded a chapter. Well, I\u0027ve just not been so motivated to play KSP these days. I guess the whole iffy situation with KSP2 is one factor, but the biggest thing is how buggy and unoptimized my game is. It\u0027s a pain to do anything is Vessel Builder now because I get 2 FPS when I even edit a stage on a vessel of 100 parts. The loading times when launching are horrendous, and 1 out of 6 quickloads leads to a game crash. SS Roadhouse also started wobbling at the joints but I\u0027m not sure if that\u0027s a mod issue or not. Whatever the case, I\u0027ll be taking some time to trim down the mods in my install until it gets stable enough to play, because this is not sustainable, especially keeping the plans I have for this save in mind.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2024-06-01T00:20:03Z","Content":"\n\u003Cp\u003E\nUPDATE: Some trimming down of my mods have made my game performance go from unplayable to still pretty laggy, but also playable. I\u0027ll keep on trimming down my install to get better performance. Maybe I\u0027ll try deleting some of my huge abandoned save games and terminating debris in the mission report save.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyhow, a new chapter will be coming out something soon.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-06-01T00:20:36Z\u0022 title=\u002206/01/2024 12:20  AM\u0022 data-short=\u0022Jun 1\u0022\u003EJune 1\u003C/time\u003E by TwoCalories\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2024-06-02T17:25:52Z","Content":"\n\u003Cp\u003E\nMade some new flags! This one\u0027s the Socialist Union of Zolosten and its air force roundel.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022256\u0022 width=\u0022512\u0022 src=\u0022https://i.imgur.com/MCEV42P.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe flag...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022256\u0022 width=\u0022512\u0022 src=\u0022https://i.imgur.com/ukIByEp.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n...and the Air Force roundel.\n\u003C/p\u003E\n"},{"CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2024-06-14T17:07:11Z","Content":"\n\u003Cp\u003E\nUPDATE: I continue procrastinate making new chapters by making a new lore update! This one only involves the first chapter, setting up some more backstory. I wanted to make some lore for the craters you found on Kerbin, so I did. I also wanted to integrate some lore into why military technology is so advanced (i.e. F/A-18s alongside Apollo 11-esque spacecraft) and why crew seemed to be launched before satellites.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I modified the Vankadian Air Defense Force roundel. Here\u0027s the new one:\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022256\u0022 width=\u0022512\u0022 src=\u0022https://i.imgur.com/aw5FWZB.png%5B/img%5D\u0022\u003E\u003Cimg alt=\u0022img%5D\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022256\u0022 width=\u0022512\u0022 src=\u0022https://i.imgur.com/0w4eBsT.png%5B/img%5D\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-06-14T17:08:13Z\u0022 title=\u002206/14/2024 05:08  PM\u0022 data-short=\u0022Jun 14\u0022\u003EJune 14\u003C/time\u003E by TwoCalories\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedAl1en1","CreatedById":233860,"CreatedDateTime":"2024-06-18T16:33:33Z","Content":"\n\u003Cp\u003E\nI love the flags dude! This mission report is great.\n\u003C/p\u003E\n"},{"CreatedByName":"RedAl1en1","CreatedById":233860,"CreatedDateTime":"2024-06-19T18:59:42Z","Content":"\n\u003Cp\u003E\nTYSM! My first rep!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2024-06-20T17:17:33Z","Content":"\n\u003Cp\u003E\nI\u0027ve been thinking about this mission report for a long time. As of now, my KSP game is quite horribly optimized, and the lag is still painful anywhere in the save file. And for the mission report itself, I\u0027ve noticed that the bulk of any updates I\u0027ve added for the past couple of months are just retcons. Even now I\u0027m not completely satisfied with the storyline. And it\u0027s hard to fix these issues, especially the optimization, because removing mods will probably break the install. Also, old screenshots don\u0027t align with the changing storyline.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I made a decision. I\u0027ve put a lot of thought into this, and I\u0027ve decided that the best course of action is to shelve this report. BUT this won\u0027t be the end of \u003Cem\u003EThe Sky is Not the Limit\u003C/em\u003E. I\u0027m going to start an entirely different thread and a new save file. Consider it a reboot, if you will. I\u0027m doing this so that I can safely remove mods without breaking vessels to optimize my game better, and I can revise the storyline and make it something that I can build upon for not only the report itself, but perhaps some spinoffs, too. The same space race and KASE plots are still going to continue, and once the new save and mission report are created, I\u0027ll make it my goal to quickly catch us back up to where we left off. It was a hard decision to undo a literal year of progress, but I want to be able to take this save to big places.\n\u003C/p\u003E\n\u003Cp\u003E\nThe TL;DR version of this is that this specific thread is going to get shelved due to lag and stuff, but the storyline will be restarted and continued in a different thread.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, like I did say, this report was already a year\u0027s worth of dedication. While I promise that I\u0027ll go through with the reboot of this report, I\u0027ll have to take a bit of a break before I start again. I\u0027ll also have to take that break so that I can lay out a storyline that I\u0027m satisfied with so that I don\u0027t have to do nearly as many retcons.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope you guys are okay with this decision. I\u0027m sorry if the wording is a bit confusing, but I promise this storyline will be continued, just in a different thread, and potentially with a name change.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you all for the continued support of this mission report. -TwoCal\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2024-06-20T17:35:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224400069\u0022 data-ipsquote-contentid=\u0022216956\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221718903853\u0022 data-ipsquote-userid=\u0022228871\u0022 data-ipsquote-username=\u0022TwoCalories\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 minutes ago, TwoCalories said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve been thinking about this mission report for a long time. As of now, my KSP game is quite horribly optimized, and the lag is still painful anywhere in the save file. And for the mission report itself, I\u0027ve noticed that the bulk of any updates I\u0027ve added for the past couple of months are just retcons. Even now I\u0027m not completely satisfied with the storyline. And it\u0027s hard to fix these issues, especially the optimization, because removing mods will probably break the install. Also, old screenshots don\u0027t align with the changing storyline.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I made a decision. I\u0027ve put a lot of thought into this, and I\u0027ve decided that the best course of action is to shelve this report. BUT this won\u0027t be the end of \u003Cem\u003EThe Sky is Not the Limit\u003C/em\u003E. I\u0027m going to start an entirely different thread and a new save file. Consider it a reboot, if you will. I\u0027m doing this so that I can safely remove mods without breaking vessels to optimize my game better, and I can revise the storyline and make it something that I can build upon for not only the report itself, but perhaps some spinoffs, too. The same space race and KASE plots are still going to continue, and once the new save and mission report are created, I\u0027ll make it my goal to quickly catch us back up to where we left off. It was a hard decision to undo a literal year of progress, but I want to be able to take this save to big places.\n\u003C/p\u003E\n\u003Cp\u003E\nThe TL;DR version of this is that this specific thread is going to get shelved due to lag and stuff, but the storyline will be restarted and continued in a different thread.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, like I did say, this report was already a year\u0027s worth of dedication. While I promise that I\u0027ll go through with the reboot of this report, I\u0027ll have to take a bit of a break before I start again. I\u0027ll also have to take that break so that I can lay out a storyline that I\u0027m satisfied with so that I don\u0027t have to do nearly as many retcons.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope you guys are okay with this decision. I\u0027m sorry if the wording is a bit confusing, but I promise this storyline will be continued, just in a different thread, and potentially with a name change.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you all for the continued support of this mission report. -TwoCal\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022150\u0022 src=\u0022https://www.youtube-nocookie.com/embed/S-Xrlf3taEo?feature=oembed\u0022 title=\u0022\u0026quot;Taps\u0026quot;\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI\u0027m sad to see probably my favorite mission report go, but I\u0027m excited for the new one to come out! And take all the time you need to work on the new report and get into it. After all, it\u0027s not fun to read a mission report that the writer\u0027s not into. Thank you for the awesome report, TwoCal!\n\u003C/p\u003E\n"},{"CreatedByName":"Kerb24","CreatedById":214340,"CreatedDateTime":"2024-06-20T18:07:45Z","Content":"\n\u003Cp\u003E\nIf it will lead to a better story, then do it! I\u0027ll be patiently awaiting the return of one of the best mission reports I\u0027ve read!\n\u003C/p\u003E\n"},{"CreatedByName":"RedAl1en1","CreatedById":233860,"CreatedDateTime":"2024-06-23T15:48:08Z","Content":"\n\u003Cp\u003E\nThe sky is not the limit 2: The sky IS the limit.\n\u003C/p\u003E\n"},{"CreatedByName":"TwoCalories","CreatedById":228871,"CreatedDateTime":"2024-07-10T03:58:15Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure if you guys have been keeping up with the news about KSP and Take-Two, but as of now, the closure of the forums is a very real possibility. If it does end up happening, I\u0027d just like to thank you all for everything.\n\u003C/p\u003E\n"},{"CreatedByName":"RedAl1en1","CreatedById":233860,"CreatedDateTime":"2024-07-10T19:46:51Z","Content":"\n\u003Cp\u003E\nNo, Thank YOU for everything you\u0027ve done for the forums. This is sad to see it go. \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\n\u003C/p\u003E\n"}]}