{"TopicId":220798,"ForumId":51,"TopicTitle":"Making Life Difficult (a heavily modded colonisation playthrough)","CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2023-11-13T03:18:39Z","PageNum":3,"Articles":[{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-01-07T22:13:57Z","Content":"\n\u003Cp\u003E\nThe orbital assembly of the IPTV \u003Cem\u003EVanguard\u003C/em\u003E began with the command and habitation section.  I have a lot of trouble with Engine Plates failing mid-flight, so this launch required a lot of structural additions to get it up to orbit. The CHM has a rotating habitat, storm cellar for radiation (essential for its mission to Jool), a lab and a pair of garden modules (one for Agroponics, the other Life Support.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EAraK6n.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.17\u0022 height=\u0022808\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/EAraK6n.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hG9Qwk1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002273.00\u0022 height=\u0022817\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hG9Qwk1.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNext came the Service/Power Module, with a gigantic solar array and a Garnet nuclear reactor capable of putting out up to 400ec/s. It also held the storage for Supplies and Fertiliser. Vanguard has six crew, and the mission to Jool will be long. I may decide to send a freighter along, carrying extra Fertiliser.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223OY9zpQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002273.92\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3OY9zpQ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, the Propulsion/Propellant Module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ML7g1EM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002269.00\u0022 height=\u0022800\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ML7g1EM.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLike the Basilisk, this vessel uses a Verne pulsed fission drive, but it has three times the fuel load. At the front of the PPM is a large reserve of \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E, for use by the landers that the IPTV will carry.  It also serves as a radiation shield.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220vaXlQe.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002271.92\u0022 height=\u0022749\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0vaXlQe.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAlso helping with the radiation is the long truss structure. I\u0027m going to need to move those docking ports so they aren\u0027t blocked by the solar array. I plan to use them to carry a spaceplane and a rover lander. The spaceplane for Laythe, the rover for Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\nI still need to bring up the science instruments package and a heavy lander capable of making a descent to and ascent from Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nA MaterialKits shipment allows the habitat to deploy. With all habitation running, the vessel can support a 17 year journey.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RStbimg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002294.25\u0022 height=\u0022818\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RStbimg.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-01-25T04:31:01Z","Content":"\n\u003Cp\u003E\nIt\u0027s been a while. I\u0027ve been waiting for all the parts of my new PC to arrive... and now they have!\n\u003C/p\u003E\n\u003Cp\u003E\nKSP and most of the mods are installed. Unfortunately, several vessels were lost in transition: \u003Cem\u003EWyvern\u003C/em\u003E, \u003Cem\u003ECentaur\u003C/em\u003E, \u003Cem\u003EAurora\u003C/em\u003E and the Workshop.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m also wrangling with visual mods, trying to get \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u0027S volumetric clouds working. At least Duna stopped being purple.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a few more things I have to do (such as build a new PC cabinet) but then I can continue this series, which I\u0027ve enjoyed making and hope to continue soon.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for bearing with me.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-01-31T23:39:11Z","Content":"\n\u003Cp\u003E\nThe PC cabinet took way longer to build than it should have, but it\u0027s done now. So I was finally able to continue assembling the \u003Cem\u003EVanguard 1\u003C/em\u003E mission to Jool.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst up, the \u003Cem\u003EKnight\u003C/em\u003E \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E. A two-man spaceplane capable of making orbit at Kerbin, so it should have no trouble on Laythe.  Its science capabilities are fairly basic, so future missions to Laythe will have something to do. It has no nuclear engines, so flight time is limited. That may pose less of an issue as infrastructure develops, but that\u0027s not within the scope of Vanguard\u0027s own mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a3TtXgO.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002284.25\u0022 height=\u0022931\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/a3TtXgO.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022o9AC8mb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002279.50\u0022 height=\u0022864\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/o9AC8mb.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNext we have the \u003Cem\u003ELemming\u003C/em\u003E Tylo lander. It\u0027s a single man SSTS-ARTO (Single-Stage To Surface And Return To Orbit) vehicle. Tylo is a demanding moon, so despite its large size, it\u0027s capabilities are also quite limited. Most of the science equipment will be on the rover instead.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022J2Th62I.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002292.42\u0022 height=\u0022741\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/J2Th62I.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022z9U8R7L.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.25\u0022 height=\u0022764\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/z9U8R7L.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI seem to have forgotten to take screenshots of the \u003Cem\u003EHoney Badger\u003C/em\u003E Tylo rover, or the \u003Cem\u003EShrew\u003C/em\u003E lander. They\u0027re visible already docked to the \u003Cem\u003EVanguard\u003C/em\u003E as I brought in the Orbital Science Package.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aJZAGlU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002285.25\u0022 height=\u0022776\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aJZAGlU.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022S6pYSdC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002288.17\u0022 height=\u0022669\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/S6pYSdC.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe OSP contains a large number of experiments which can only be used in orbit. It also includes a communications array, which I somehow neglected to put on either the command, engine or support sections of the vessel. Oops.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EShrew\u003C/em\u003E landers have a full suite of surface science instruments, and cargo space for a set of deployable experiments. With around 2,300 m/s of delta-V, they can easily handle Jool\u0027s less difficult moons.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the \u003Cem\u003EHoney Badger\u003C/em\u003E, it\u0027s carried by a single-use skycrane. Only thinking to test it after having already launched the thing, I found it quite unstable on the ground at Kerbin, where the gravity is simila to Tylo\u0027s. Unforgiving terrain means that I can\u0027t afford to send a rover that can\u0027t drive well. So, after some redesigns and testing, I found that I could fix the instability in only four parts - two M-Beams and a pair of T7 tracks. This would give it a wide base, so it would become impossible to roll. Added mass was negligible. And hey, the end result looked rater fetching, I thought.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UsRWmgO.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.28\u0022 height=\u0022709\u0022 width=\u00221103\u0022 src=\u0022https://i.imgur.com/UsRWmgO.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso  heading out this Jool window, is \u003Cem\u003EJool Surveyor X\u003C/em\u003E.  I couldn\u0027t remember how many I\u0027d already sent, so I decided to name it something with a sense of finality. This probe has a small nuclear reactor on board to ensure it always has enough power for its ion drive, and the drive itself exchanges some efficiency for an extra newton of thrust. Doesn\u0027t sound like much? It\u0027s 50% more.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RMXy62u.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002297.42\u0022 height=\u0022781\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RMXy62u.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs it turns out, KSP\u0027s native alarm clock is wrong. The Jool window is at least a month away, not 5 days. It should be 90 degrees ahead of Kerbin, but it\u0027s more like 70.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLast but not least, I took the liberty of checking out a probe in a strange orbit. It was \u003Cem\u003EJool Surveyor 3\u003C/em\u003E , which had a maneuver node set up in a year\u0027s time to intercept Jool. Considering I just mentioned I\u0027d launched \u003Cem\u003EJool Surveyor X\u003C/em\u003E, which would arrive at Jool at least a year before \u003Cem\u003EJool Surveyor 3\u003C/em\u003E would, I felt this situation was a waste of a scansat. So I renamed the probe \u003Cem\u003ESarnus Surveyor 1\u003C/em\u003E, and changed the maneuver node to raise its periapsis until it crossed Sarnus orbit. As luck would have it, the planet would be in almost exactly the right position!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Bu39l2r.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.92\u0022 height=\u0022799\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Bu39l2r.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt will take 19 years to arrive. \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2024-02-01T00:24:32Z","Content":"\n\u003Cp\u003E\nThat\u0027s honestly the coolest \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E I\u0027ve ever seen.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-01T01:16:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224363544\u0022 data-ipsquote-contentid=\u0022220798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221706747072\u0022 data-ipsquote-userid=\u0022222386\u0022 data-ipsquote-username=\u0022Kerbalsaurus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, Kerbalsaurus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s honestly the coolest \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E I\u0027ve ever seen.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAw, thanks! The OPT Mk2 cockpit looks way better than the stock version.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, before I go to bed:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bukRY62.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022819\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/bukRY62.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EVanguard\u003C/em\u003E is on its way to Jool. 12,000 m/s delta-V, so no concerns about getting stranded out there like \u003Cem\u003EOdyssey\u003C/em\u003E was at Dres. The ship handles fairly well at 3x physics warp, even with the mass of the \u003Cem\u003EKnight\u003C/em\u003E pulling it to one side a bit. Acceleration is about on par with the NERVA NTR, so I made two burns at periapsis. There will be another maneuver in about 200 days to adjust inclination.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI intend to launch one more vessel, a fuel tanker which will also carry a mining vessel. Not all of Vanguard\u0027s landers were fully fuelled as of departure, and that was an intentional decision. I wanted to reduce structural instability at the docking ports. But it does mean that if I failed to send extra \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E along, at least one moon landing would become impossible. Most likely I would cancel the Tylo descent. It\u0027s the most risky part of this entire mission.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-01T17:30:29Z","Content":"\n\u003Cp\u003E\nSeems there was another casualty during the Great PC Migration, the IPTV \u003Cem\u003EEndeavour\u003C/em\u003E. While the crew mysteriously reappeared at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, the ship itself is lost with all data on board.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother mission will have to be sent. This time, I\u0027ll be sure to send a more capable lander.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2024-02-01T19:25:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224363677\u0022 data-ipsquote-contentid=\u0022220798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221706808629\u0022 data-ipsquote-userid=\u002211716\u0022 data-ipsquote-username=\u0022RedDwarfIV\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, RedDwarfIV said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSeems there was another casualty during the Great PC Migration, the IPTV \u003Cem\u003EEndeavour\u003C/em\u003E. While the crew mysteriously reappeared at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E, the ship itself is lost with all data on board.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022150\u0022 src=\u0022https://www.youtube-nocookie.com/embed/S-Xrlf3taEo?feature=oembed\u0022 title=\u0022\u0026quot;Taps\u0026quot;\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-03T02:22:27Z","Content":"\n\u003Cp\u003E\nAs planned, construction of an interplanetary fuel tanker began.  The first section into orbit; the Power/Propulsion Module.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dRJ38l6.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022105.67\u0022 height=\u0022791\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dRJ38l6.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSecond to orbit, the Primary Cargo Module. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222qW2etl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002265.28\u0022 height=\u0022735\u0022 width=\u00221126\u0022 src=\u0022https://i.imgur.com/2qW2etl.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThird, the Ore Processing Module, which includes ore, monopropellant and \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E tanks along with a large converter. This section can be detatched at the destination to be used as an orbital fuel depot, freeing up the tanker to move from moon to moon.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223U6z0fJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.50\u0022 height=\u0022725\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3U6z0fJ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFourth, the \u003Cem\u003EMeerkat\u003C/em\u003E mining lander. This vessel has its own nuclear reactor, since solar is far too weak out at Jool. This arrangement does mean the OPM has no power unless the \u003Cem\u003EMeerkat\u003C/em\u003E is docked with it, but that shouldn\u0027t prove a major obstacle. It just means fuel production will take longer in-game. It saves the extra mass of a second reactor, not to mention the cost.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uAqC1JM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002279.80\u0022 height=\u0022703\u0022 width=\u0022881\u0022 src=\u0022https://i.imgur.com/uAqC1JM.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EwbWZgW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002271.17\u0022 height=\u0022655\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/EwbWZgW.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFifth, fuel and propellant loading. The nuclear pellet transport is a one-off design, so has no name. The \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E tanker is called the \u003Cem\u003ECalypso.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yTErTdJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.50\u0022 height=\u0022744\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yTErTdJ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022G0fbHkf.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002278.17\u0022 height=\u0022847\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/G0fbHkf.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, I sent up an engineer along with a few extra parts that needed installing - a pair of 600kw radiators and a long range comms dish. The radiators would serve the vessel\u0027s own reactor, on a separate loop to the main drive. The two loops would operate at different temperatures, keeping the reactor from being overheated under thrust. As for the dish, it wouldn\u0027t do to lose control of a ship I spent an entire day putting together because I forgot a single component.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m44FfT8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022102.75\u0022 height=\u0022799\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/m44FfT8.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd so, the Inter-Planetary Cargo Vessel \u003Cem\u003EAndromeda\u003C/em\u003E was completed and ready for its voyage to Jool. Unless I build a nuclear smelter facility out there, this will be a one-way trip, as the vessel carries only a third the fuel pellets that the \u003Cem\u003EVanguard\u003C/em\u003E does.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228Pu8OVH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002284.75\u0022 height=\u0022770\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8Pu8OVH.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FtaMaX4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002286.42\u0022 height=\u0022873\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/FtaMaX4.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223nB9aBw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022784\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3nB9aBw.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOff it goes. Inclination burn in about a month. Just over half the fuel pellets are gone. If I can manage a Tylo gravity assist, most of that should be available for moon-hopping after arrival. The Andromeda carries enough \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E, even disregarding the \u003Cem\u003EMeerkat\u003C/em\u003E/OPM, to keep \u003Cem\u003EVanguard\u003C/em\u003E\u0027s landers operational for a number of landings per moon.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOn a separate note, I managed to get the \u003Cem\u003ETarantula\u003C/em\u003E rover to Eve\u0027s Shallows biome, where it scanned a Basalt Formation, completing one contract\u0027s requirements. It required the use of the InfiniteElectricity cheat, but only because the Support version of the triangular truss is glitched.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe next mission will be capturing another asteroid. \u003Cem\u003EHarpy\u003C/em\u003E survived the Great Migration, so I will be using that again. With luck, the rock will be the right size to fulfill another contract.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-04T03:57:08Z","Content":"\n\u003Cp\u003E\nToday I mostly dealt with things within Kerbin\u0027s sphere of influence. The one exception being \u003Cem\u003EVanguard\u003C/em\u003E\u0027s inclination change, lowering the Jool periapsis.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dHzuuze.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002276.00\u0022 height=\u0022899\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dHzuuze.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAfterwards, I moved on to \u003Cem\u003EHarpy\u003C/em\u003E\u0027s intercept of what turned out to be a Class A asteroid.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022odtnrRI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002276.42\u0022 height=\u0022802\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/odtnrRI.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhile Harpy returned to Kerbin with the rock in tow, I began launching sections of a new Minmus base. \u003Cem\u003ESparrow\u003C/em\u003E Base would serve as an ore refinery, fuel storage facility and transit depot for Rare Metals and Exotic Minerals. Below is the Habitat section. The other two sections were Logistics (which included ore storage and converter) and the Fuel Tower.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022050L3I1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002280.50\u0022 height=\u0022875\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/050L3I1.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nA crew composed of one Quartermaster and one Engineer were sent in a new landing/return vehicle. A small hab and supplies ensured they would make it to their destination in comfort.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Nh7804f.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002270.26\u0022 height=\u0022763\u0022 width=\u00221086\u0022 src=\u0022https://i.imgur.com/Nh7804f.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cem\u003EHarpy\u003C/em\u003E entered Kerbin orbit at 500km. Another contract was complete.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225iTYpRC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002272.99\u0022 height=\u0022816\u0022 width=\u00221118\u0022 src=\u0022https://i.imgur.com/5iTYpRC.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Logistics module\u0027s descent. I chose to land the base on the same site as one of my previous bases, marked by a \u003Cem\u003EManticore\u003C/em\u003E \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E tanker. Not due to any specific resource in the area, but because it was on the largest of the Flats, where spaceplanes can easily perform their horizontal takeoffs.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NvpnIHq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002273.67\u0022 height=\u0022871\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NvpnIHq.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022l87e0EH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002283.75\u0022 height=\u0022885\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/l87e0EH.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe purpose of this base is to serve as a destination for Milk Run missions. One of my Paladins came in to land, had the cargo and \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E transferred to it through Local Logistics, then headed back to Kerbin. It reached \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, and remained there while I spent some time deorbiting reusable launchers, recovering them as close to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and as intact as I could manage. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZOLvoqt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002267.88\u0022 height=\u0022763\u0022 width=\u00221124\u0022 src=\u0022https://i.imgur.com/ZOLvoqt.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229krBa1H.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.67\u0022 height=\u0022776\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9krBa1H.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Lxd12hZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002288.17\u0022 height=\u0022792\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Lxd12hZ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere were a couple of issues with the base which required extra missions to correct - the upper 2m docking port was replaced with a cargo container for Rare Metals and Exotic Minerals, which a viewing cupola was placed on top of. I also had to send a radiator to ensure the converter wouldn\u0027t overheat. All changes were made by landing the components nearby and having the base\u0027s engineer install them.\n\u003C/p\u003E\n\u003Cp\u003E\nThe transfer window for returning from Dres is coming up, which means \u003Cem\u003EValkyrie\u003C/em\u003E will soon be heading home.\n\u003C/p\u003E\n\u003Cp\u003E\nI have also learned that three members of  the \u003Cem\u003EEndeavour\u003C/em\u003E crew may actually be aboard the \u003Cem\u003EMatador\u003C/em\u003E DAV, still in orbit of Duna. If this is the case, and not simply the life support panel lying to me, then it is possible the data is still present on board that craft. Certainly worth investigating. But alas, bedtime.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-05T02:50:07Z","Content":"\n\u003Cp\u003E\nToday I completed \u003Cem\u003EMilk Run 4\u003C/em\u003E. Rather than using a Warlock, I decided this time to send up a second \u003Cem\u003EPaladin\u003C/em\u003E. It\u0027s a significantly more expensive vessel, but easier to fly, and as it turned out, easier to land as well. Expense also doesn\u0027t matter so much if you can recover it,\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022659ajZQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002292.67\u0022 height=\u0022792\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/659ajZQ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NJKGF4L.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002282.92\u0022 height=\u0022727\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NJKGF4L.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RiDrIfc.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RiDrIfc.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VOyVeeL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022106.00\u0022 height=\u0022747\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/VOyVeeL.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHaving proven that a \u003Cem\u003EPaladin\u003C/em\u003E could land with a half-load of Commodities, I found that I had just reduced the number of \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E launches needed for a Milk Run mission from three to two, saving me time and effort.\n\u003C/p\u003E\n\u003Cp\u003E\n...I guess I just made the \u003Cem\u003EWarlock\u003C/em\u003E \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E redundant.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220YKHktK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022115.75\u0022 height=\u0022751\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0YKHktK.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOops. Little runway overrun there. The brakes are set to 75%, which is too low to be effective. I need to fix that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226pS2Ec1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022123.18\u0022 height=\u0022627\u0022 width=\u0022509\u0022 src=\u0022https://i.imgur.com/6pS2Ec1.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGained 8 mil from \u003Cem\u003EMilk Run 4\u003C/em\u003E. I\u0027ll be using that to finance the redevelopment of \u003Cem\u003EMirage\u003C/em\u003E Station - adding a new Orbital Workshop module so it can return to operation. \u003Cem\u003ETarasque\u003C/em\u003E Station out at Minmus is busy working on the replacement for \u003Cem\u003EWyvern\u003C/em\u003E, and \u003Cem\u003ELeviathan\u003C/em\u003E is still out at Ike, so I need another orbital shipyard, even if I have to bring MaterialKits and SpecialisedParts up to it from Kerbin instead of manufactured from mined resources. I will also be launching a pair of fragment-drive freighters to carry large quantities of Commodities and construction materials from Minmus to Kerbin. The Commodities freighter will handle future Milk Run missions, having a much larger payload capacity than the \u003Cem\u003EPaladin\u003C/em\u003E, which will be relegated to bringing that payload from orbit to surface. However, it will likely not fill that role for long. It\u0027s overkill delta-V-wise, and landing it full laden involves walking a fine line between stalling and hitting the runway above safe speeds. Something lighter, with more wing area, could fill the role more effectively.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhen I went to investigate the mysterious presence of crew members on the \u003Cem\u003EMatador\u003C/em\u003E DAV, I received a pleasant surprise.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dKxp7DY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002279.17\u0022 height=\u0022745\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dKxp7DY.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EEndeavour\u003C/em\u003E was \u003Cem\u003Enot\u003C/em\u003E lost after all! Merely hidden, as for some reason the \u003Cem\u003EMatador\u003C/em\u003E was classed as a Station instead of a Lander, causing the vessel name to default to the lander\u0027s when they docked. The ship, its crew, and the data, are all perfectly safe.\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact, I discovered that enough fuel had been transferred to the lander that, with parachute assistance, it could make a second descent to Duna (though only at a single landing site, this time.) The engineer repacked the chutes, while the scientist and pilot boarded the DAV.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022R4RrxEa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002285.50\u0022 height=\u0022883\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/R4RrxEa.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227rCecPB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002265.42\u0022 height=\u0022721\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7rCecPB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SXBGS1z.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002299.50\u0022 height=\u0022772\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SXBGS1z.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI remembered to use the aerobrakes this time, though I\u0027m not entirely sure how effective they are in Duna\u0027s thin atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220stf8fT.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0stf8fT.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe pilot went for a walk while the scientist took soil samples. He then planted a flag, and they prepared to return to orbit. This is very much a flags-and-footprints mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022x7Q2DOB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002298.00\u0022 height=\u0022911\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/x7Q2DOB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSuccessful return! Though I did mess up the ascent a bit by leaving Ground Tether on and the airbrakes deployed at liftoff. Even so, the DAV had around 150 m/s delta-V in LDO. \n\u003C/p\u003E\n\u003Cp\u003E\nAfter rendezvous with \u003Cem\u003EEndeavour\u003C/em\u003E and the transfer of crew and data, I sent the Matador to \u003Cem\u003EPhoenix\u003C/em\u003E Station. Keeping the number of separate vessels flying about to a minimum seemed prudent to me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOn a separate note, I have been quite pleased with the performance of my new PC. Where my old desktop would sometimes have lag spikes lasting several seconds when disassembling parts, the new one reduces it to a few frames. Where my old desktop could take ten seconds to load a base on Minmus, the new one does it in two. The only difficulty I have encountered is occasional crashes to desktop, which I have been troubleshooting. Since it also loads KSP faster, crashes aren\u0027t as much of an issue as they would otherwise be. We\u0027ll see if I can eliminate them. Overall, I can feel the improvement.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-06T03:54:49Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003EValkyrie\u003C/em\u003E began its voyage home. Only after performing this burn did I realise I hadn\u0027t sent it to investigate Dres\u0027 three captured asteroid moons. Oh well. It\u0027s hardly an essential part of the mission, and I could certainly send \u003Cem\u003EValkyrie\u003C/em\u003E back to Dres with a new crew after it gets home.  There are a couple of science instruments I could add to the ship, as well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229hybMoV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002294.17\u0022 height=\u0022876\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/9hybMoV.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022frVzGiR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022114.17\u0022 height=\u0022876\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/frVzGiR.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QfxqwK5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002295.17\u0022 height=\u0022893\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QfxqwK5.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe renovation of \u003Cem\u003EMirage\u003C/em\u003E Station required two primary missions, and three secondaries. The first primary lifted a new orbital workshop for turning Kits into vessels. The second was a kit containing the new \u003Cem\u003EMirage Core\u003C/em\u003E station section.  This included extra habitation, hydroponics, solar power generation, power storage, an Orbital Assembly Space for producing kits,  propellant depot for \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003E\u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E\u003C/abbr\u003E, monoprop, fission pellets and fission fragments.\n\u003C/p\u003E\n\u003Cp\u003E\nTwo of the secondary missions carried MaterialKit resupplies. The other brought up four engineers.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hxf35Qe.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002298.50\u0022 height=\u0022897\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hxf35Qe.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AxvLQFg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022107.42\u0022 height=\u0022897\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AxvLQFg.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226MqiNcP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022108.50\u0022 height=\u0022888\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6MqiNcP.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022U1CHN1g.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022114.75\u0022 height=\u0022899\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/U1CHN1g.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe end result is mostly to my liking, but there were a couple of issues.  The solar panels could potentially collide with kits coming out of the assembly space, and the original station parts are all very wobbly even after autostrutting. I\u0027m going to have to figure out where I can move the reactor to that won\u0027t put it too close to the crew spaces. I\u0027m not running any radiation mods but it seems like a good thing to consider anyways. Since I plan to expand the fuel farm with some LH2 tanks, I might be able to move it below that.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the solar panels, we\u0027ll see. I kinda like them where they are, and I don\u0027t want to move the OAS either.  As the station develops, better places might arise.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWith \u003Cem\u003EMirage\u003C/em\u003E\u0027s construction capability returned, and resource storage for everything that might need to be transferred, I launched another kit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qk322AV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.00\u0022 height=\u0022898\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qk322AV.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XMl95jv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022108.25\u0022 height=\u0022895\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/XMl95jv.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs mentioned in my last post, I wanted to replace the Paladin\u0027s Minmus flights with a dedicated freighter. The result was this: the Asgard IPCV. Oh yes, an \u003Cem\u003EInter-Planetary\u003C/em\u003E Cargo Vessel. While the first of its class will be shuttling between Minmus and Kerbin, it has the delta-V, comms and power generation to go between worlds. Even fully laden with commodities, it could reach Jool... \u003Cem\u003Eand return\u003C/em\u003E.  I\u0027ll likely send one alongside the \u003Cem\u003EBasilisk\u003C/em\u003E in the next Duna window, carrying all the MaterialKits, SpecialisedParts and Machinery the \u003Cem\u003ELeviathan\u003C/em\u003E could ever want.\n\u003C/p\u003E\n\u003Cp\u003E\nTwin afterburning fragment drives provide excellent thrust for their efficiency, and without the capacitor faff of more advanced engines.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uWWw98k.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022107.25\u0022 height=\u0022935\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/uWWw98k.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOf course, with Mirage still missing LH2 storage, the liquid hydrogen propellant needed to be shipped up from Kerbin in an expendable refuelling vehicle.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xpUzrxR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002299.75\u0022 height=\u0022936\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xpUzrxR.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow fully operational, \u003Cem\u003EAsgard 1\u003C/em\u003E heads for Minmus. In what must have been a moment of sheer terror for the crew of \u003Cem\u003EMirage\u003C/em\u003E, the freighter and station almost collided at a relative velocity of several hundred meters per second. No damage was done to either vessel except several spacesuits sent to laundry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a9ohzw0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.75\u0022 height=\u0022921\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/a9ohzw0.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSince the freighter can\u0027t land on Minmus (something I may refit it to do at a later date) it needs a cargo lander to lift Commodities from the surface. For this, we have the \u003Cem\u003EArachne\u003C/em\u003E CCV. I think it\u0027s a rather handsome looking craft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GVWCa3x.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002296.25\u0022 height=\u0022907\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/GVWCa3x.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224JbkT8t.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022107.92\u0022 height=\u0022915\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4JbkT8t.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nArrival at Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BzEX3mN.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002299.50\u0022 height=\u0022914\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/BzEX3mN.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDescent.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YwI2ALH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.25\u0022 height=\u0022914\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YwI2ALH.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLanded! Had to wait a while for Sparrow Base to make enough Liquid Fuel to replenish the lander before it could take off. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CDWoC0T.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022101.75\u0022 height=\u0022917\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CDWoC0T.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFully laden, the \u003Cem\u003EArachne\u003C/em\u003E makes its first rendezvous with \u003Cem\u003EAsgard\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hoCEX7p.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022918\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hoCEX7p.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe lander docks and begins transferring the Rare Metals and Exotic Minerals across. Looks like it will take six to eight trips to fill the freighter\u0027s cargo bays. Yeah, that refit is looking increasingly attractive. Question is, what engines should I use for the job?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m actually considering VASIMR, or some variant of electric lithium propulsion, anyway. Asgard already has electric \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E because 2000 isp sounded nice to me. And the on-board nuclear reactor is only a backup for the solar panels at the moment, spending most of its time disabled. I\u0027ll have to test the concept out before I actually install any hardware on my brand new investment. Wouldn\u0027t wanna scratch the paint with an unscheduled lithobrake.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Rn2TqMS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022112.00\u0022 height=\u0022943\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Rn2TqMS.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-06T04:00:48Z\u0022 title=\u002202/06/2024 04:00  AM\u0022 data-short=\u0022Feb 6\u0022\u003EFebruary 6\u003C/time\u003E by RedDwarfIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-07T03:12:20Z","Content":"\n\u003Cp\u003E\nI had to launch a second \u003Cem\u003EArachne\u003C/em\u003E configured for carrying Refined Exotics, since the \u003Cem\u003EAsgard\u003C/em\u003E\u0027s forward cargo bays are set to hold that resource. When the CCV (\u003Cem\u003EArachne 1\u003C/em\u003E) had finished its job, the RCV (\u003Cem\u003EArachne 2\u003C/em\u003E) took its turn. Three visits to the surface later, and \u003Cem\u003EAsgard\u003C/em\u003E was fully loaded.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yrcZdgR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002278.00\u0022 height=\u0022822\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yrcZdgR.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222oG9NTb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/2oG9NTb.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAsgard\u003C/em\u003E returned to Kerbin, completing \u003Cem\u003EMilk Run 5\u003C/em\u003E. It took several burns at periapsis to reach a circular orbit in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E. While the vessel\u0027s thrust is pretty good for its efficiency, the mass of the payload dramatically lowered the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E. However, in the grand scheme of things, the extra faff of a couple extra burns is a bargain compared to the time I\u0027d be spending flying individual \u003Cem\u003EPaladins\u003C/em\u003E out to Minmus to pick up the same amount of resources.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022i7WEpr3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002279.50\u0022 height=\u0022754\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/i7WEpr3.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ftqLUpW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022103.00\u0022 height=\u0022824\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ftqLUpW.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XDXnnR2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/XDXnnR2.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow I had to get all those precious resources down from orbit, and as I said previously, I wanted a lighter, more responsive \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E for the role that would be less likely to splatter itself across the runway. Thus began development of the \u003Cem\u003EGladiator\u003C/em\u003E spaceplane.\n\u003C/p\u003E\n\u003Cp\u003E\nOPT parts are lifting bodies, so I ignored the option of a stock spaceplane entirely. I knew from the off that I wanted to use a pair of Project Eeeloo engines, which can fly in atmosphere indefinitely. Any other engines would be dead weight either in flight or in orbit, so no nuclear lightbulbs or 2m jet engines. This would ensure that the only extra weight being carried at landing would be the payload.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first iteration was a fairly small affair, short and sweet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228P9soVs.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002269.00\u0022 height=\u0022684\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8P9soVs.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qUWyd8R.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002263.25\u0022 height=\u0022724\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qUWyd8R.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223Tluf5O.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002298.50\u0022 height=\u0022756\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3Tluf5O.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI really liked the looks of this little spaceplane. Unfortunately, its performance after acquiring payload made it unviable - despite the rear mounted engines, it was too nose-heavy and consistently hit the ground at high velocity in testing. Technically I could fix this, but only by ruining the craft\u0027s looks.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the end, I actually lost a significant amount of the precious resources because I F5\u0027d just before descent, not while the craft was still near \u003Cem\u003EAsgard\u003C/em\u003E. That wasn\u0027t a mistake I would repeat.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAttempt 2. Lengthened, and with a whole different wing layout. Kinda reminds me of the F-14 Tomcat from behind.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224Q4WHEA.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002291.00\u0022 height=\u0022714\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4Q4WHEA.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022e5eGMJJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002267.50\u0022 height=\u0022745\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/e5eGMJJ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DTBMZw9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022783\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/DTBMZw9.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nResults? Not much better, this time because the craft was too tail-heavy, causing it to stall and flat-spin until crashing into the ground. Reducing the payload by half allowed it to land safely, but that would double the number of trips required, which obviously wasn\u0027t acceptable. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAttempt 3. I liked the previous design, and it was easier to adjust the CoG and \u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E\u003C/abbr\u003E without massively changing the craft\u0027s appearance. I lengthened it once again, adding an OPT 2m docking port module, and rearranged the order of the fuselage sections so the cargo bay would be at the centre of lift. That way, payload would not affect flight characteristics. Or at least, that was the idea. Didn\u0027t quite work out. One of these actually made a water landing while flat spinning at 70m/s. It was damaged, but the engines and cargo actually survived, so I was able to recover the payload and most of the cost of the spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAttempt 4. A bit more jiggery-pokery with the wings and fuel distribution. Also added a pair of carnards on the tail. At first I thought it was a bit weird to give the craft two tailplanes, but I think it works.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vidffAL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vidffAL.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kulrkaQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kulrkaQ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YTaZti0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002263.00\u0022 height=\u0022676\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YTaZti0.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBy this point in the previous flights, the spaceplane would have lost control already. This approach looks good.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ecjnuAt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ecjnuAt.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAirbrakes deployed, slowing down for approach. It\u0027s very easy to overshoot the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kjpcylr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kjpcylr.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI had activated the engines, throttled down to about 20% power, just to ensure it wouldn\u0027t hit stall speed. As it turns out, I needn\u0027t have worried. This version flies like an absolute dream. It came in to land, touching down easily.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022g6qBnuQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/g6qBnuQ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter touchdown, I put the brakes on. However, it veered off the right side of the runway, and in my attempt to counter that, it then went back over the runway and off to the left, where it spun around on the grass until coming to rest. Despite the tumultuous stop, the spaceplane was totally intact. So was the payload.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UTiRduJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UTiRduJ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n4 million. Same as what a single \u003Cem\u003EPaladin\u003C/em\u003E could carry, but it\u0027s smaller, cheaper, and handles better. I think we\u0027re on to a winner, here! I just have to figure out how to steer it properly...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-07T03:15:40Z\u0022 title=\u002202/07/2024 03:15  AM\u0022 data-short=\u0022Feb 7\u0022\u003EFebruary 7\u003C/time\u003E by RedDwarfIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2024-02-07T03:48:29Z","Content":"\n\u003Cp\u003E\nI do notice that a lot of your SSTOs have a very Vaos-esque style to them. Was he inspiration to your builds?\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-07T04:41:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224364893\u0022 data-ipsquote-contentid=\u0022220798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221707277709\u0022 data-ipsquote-userid=\u0022222386\u0022 data-ipsquote-username=\u0022Kerbalsaurus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, Kerbalsaurus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI do notice that a lot of your SSTOs have a very Vaos-esque style to them. Was he inspiration to your builds?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNope. If I\u0027ve watched any of their videos, it was a long time ago. Googling their spaceplanes, I can kinda see what you mean, but if anything my own spaceplanes are inspired by IRL craft and concepts like the SR-71 and the Reaction Engines Skylon.\n\u003C/p\u003E\n\u003Cp\u003E\nI used to put carnards on the nose of my spaceplanes, but I\u0027ve come to see that as the lazy option for getting a spaceplane to work in KSP. Having a proper tailplane is harder, and therefore more rewarding when it works.\n\u003C/p\u003E\n\u003Cp\u003E\nThe high wings are so I can mount larger landing gear without having the plane looking like it\u0027s on stilts.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I just like engine nacelles.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-09T21:31:34Z","Content":"\n\u003Cp\u003E\nThe final \u003Cem\u003EGladiator\u003C/em\u003E \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E of \u003Cem\u003EMilk Run 5\u003C/em\u003E offloaded the last of the Refined Exotics, and returned to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pkexkSt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002277.42\u0022 height=\u0022838\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pkexkSt.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226kSqKWr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002225.32\u0022 height=\u002279\u0022 width=\u0022312\u0022 src=\u0022https://i.imgur.com/6kSqKWr.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI now have more money than sense. Hooray!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMore upgrades for \u003Cem\u003EMirage\u003C/em\u003E, specifically the LH2 storage tanks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MKmtsTg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002281.67\u0022 height=\u0022864\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MKmtsTg.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStorage tanks completed and attached. Moved the solar arrays so they\u0027d be less likely to interfere with the Orbital Assembly Space. I\u0027ll likely move them again when I get round to replacing the current reactor setup with something less silly. Another kit was brought up for orbital construction.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aleYq9y.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002288.00\u0022 height=\u0022772\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aleYq9y.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRan out of MaterialsKits halfway through, so I decided to install a much larger storage facility. It contained nothing on launch, so won\u0027t solve the stalled construction by itself. I needed further resupply missions for that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QbHYT8G.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002295.25\u0022 height=\u0022792\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QbHYT8G.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FHZlrYn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002285.67\u0022 height=\u0022826\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/FHZlrYn.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nConstruction complete! Based on the \u003Cem\u003EAsgard\u003C/em\u003E but heavily modified, the \u003Cem\u003EAntelope\u003C/em\u003E IPFV is an interplanetary-capable propellant carrier. Its first mission will be heading out to Minmus, fillimng the tanks there, then returning to \u003Cem\u003EMirage\u003C/em\u003E to fill the station\u0027s storage tanks. After that, I will likely send it to Duna alongside \u003Cem\u003EBasilisk\u003C/em\u003E at the next Duna transfer window. Then Leviathan won\u0027t have any resourcing concerns whatsoever.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lT5O8TN.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.50\u0022 height=\u0022795\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/lT5O8TN.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBig fuel tanks means a lot of fuel. I realised that the \u003Cem\u003EManticore\u003C/em\u003E FTV was simply too small, and I needed to launch a higher capacity replacement. That vehicle, even mostly empty, ended up weighing 100 tons. I had to design a whole new booster to lift it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JnI8fUy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002279.17\u0022 height=\u0022861\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JnI8fUy.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aF5WP5w.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002273.50\u0022 height=\u0022836\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/aF5WP5w.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Y0Uupbo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002280.42\u0022 height=\u0022830\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Y0Uupbo.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022esnhq4Y.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022106.75\u0022 height=\u0022791\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/esnhq4Y.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI learned from this landing that these landing legs are actually far better than the SpaceX-derived ones I usually use. Those would have no doubt exploded on landing, but these handle the heavy booster with no issues whatsoever.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve actually forgotten what I named this. I\u0027d have to reopen KSP to find out. It has four Wolfhound engines, about the most efficient \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E orbital engines I could have used while retaining decent thrust. Despite its size, this vessel is actually quite easy to fly, even when full.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LArRyAa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002278.92\u0022 height=\u0022845\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LArRyAa.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xoSPHkl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002278.92\u0022 height=\u0022927\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xoSPHkl.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022d3zPMiq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002272.67\u0022 height=\u0022857\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/d3zPMiq.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt can fully fuel the Antelope in around four trips from Minmus\u0027 surface. I found that \u003Cem\u003ESparrow\u003C/em\u003E\u0027s fuel storage wasn\u0027t quite sufficient. I will probably send another \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E tank. to increase the base\u0027s capacity.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn other news, Wayfarer 4 reached the periapsis of its 200 day orbit of Jool, coming close enough to gather science in Near Jool space. I tried to lower the periapsis enough to scrape the atmosphere, but the instruments failed to function. I then found that I was having terrible lag after dropping below 200,000m, which continued even after the probe started rising again. According to Task Manager, the CPU core running KSP was going 100% at each of these lag spikes, so I\u0027m not sure what exactly was going on. It\u0027s possible that the Volumetric Clouds mod was requiring a lot more processing power at Jool than it does anywhere else, due to the sheer size of the planet. Even Eve wasn\u0027t causing this kind of issue.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sE39Qf0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sE39Qf0.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-11T14:56:06Z","Content":"\n\u003Cp\u003E\nI had several contracts that needed fulfilling, and since there was nothing on the alarms coming up before the next transfer window several months away, I decided now was a good time for it.\n\u003C/p\u003E\n\u003Cp\u003E\nStarting with \u003Cem\u003ESkua\u003C/em\u003E Base, a fuel refinery for the Mun. It needed habitation for eleven Kerbals, which is wildly overkill for a refinery (which at best needs a single Engineer or Miner on board, unless it has to pull Ore from Planetary Logistics, in which case a Pilot or Quartermaster is required), so I may consider expanding the facility later if I ever figure out what the Mun is useful for.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022imXxsDs.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002277.16\u0022 height=\u0022919\u0022 width=\u00221191\u0022 src=\u0022https://i.imgur.com/imXxsDs.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nxqkWPD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.50\u0022 height=\u0022871\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/nxqkWPD.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iCIO1iq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002299.00\u0022 height=\u0022834\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/iCIO1iq.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k8wAt1E.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022102.50\u0022 height=\u0022783\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/k8wAt1E.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OZq7qqj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022112.42\u0022 height=\u0022838\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OZq7qqj.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI only discovered after this that the base needed radiators to disappate heat from the drills and converter. I sent an extra mission with radiators, a life support recycler, and storage for Supplies and Fertiliser.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe next contract required a station for Minmus for ten Kerbals, with a viewing cupola and 1,000 units of monoprop on board. I figured this could serve as the habitat for a later station or interplanetary craft, even if it\u0027s not very important right now.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the same time, I sent a second fuel tank out to \u003Cem\u003ESparrow\u003C/em\u003E Base, to expand the fuel farm.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AqC8UPh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002295.00\u0022 height=\u0022797\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AqC8UPh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOh yeah, the new FTV is called the \u003Cem\u003EOlympus\u003C/em\u003E. I thought that was fitting, given its size.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-12T11:50:23Z","Content":"\n\u003Cp\u003E\nFinal shuttle run of the \u003Cem\u003EOlympus\u003C/em\u003E FTV, all tanks on the \u003Cem\u003EAntelope\u003C/em\u003E now full. The \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E tanker then burns for Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TEz4ndv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002298.50\u0022 height=\u0022856\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TEz4ndv.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227dN2FNo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002299.00\u0022 height=\u0022835\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7dN2FNo.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GY2u0nS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002283.50\u0022 height=\u0022906\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/GY2u0nS.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, Antelope proceeds to dock with \u003Cem\u003EMirage\u003C/em\u003E. The station lost its solar arrays in a Kraken incident, and strangely hasn\u0027t tried to shake itself to bits since. As they were only ever a backup to the on-board reactor, and there are still a couple of small panels for emergency life support, I see no urgent need to replace them. This also means nothing is blocking the orbital assembly space anymore.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qMLyMgN.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022822\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qMLyMgN.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMirage\u0027s \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E tanks were filled. Antelope still contained a considerable amount of propellant. I will definitely be sending the vessel to Duna at the upcoming transfer window.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSomething else that needs to go to Duna is \u003Cem\u003EPhoenix\u003C/em\u003E Station. I have a contract to send a station with IRSU capability, supporting 13 Kerbals, with three scientists on board. All to be fully assembled at launch. The contract awarded 334k VF on accepting, and 866k VF on completion.\n\u003C/p\u003E\n\u003Cp\u003E\n...this thing cost more than that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022U0oi7uR.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022104.50\u0022 height=\u0022774\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/U0oi7uR.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TvzBwp3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022104.17\u0022 height=\u0022773\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TvzBwp3.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002244FlaWy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002287.25\u0022 height=\u0022859\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/44FlaWy.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220AMYE1x.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002295.17\u0022 height=\u0022880\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0AMYE1x.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220CQiuqG.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002297.25\u0022 height=\u0022830\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0CQiuqG.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JgMxFUn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022113.42\u0022 height=\u0022853\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/JgMxFUn.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022upV4tNx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022102.17\u0022 height=\u0022873\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/upV4tNx.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI elected to use a Nuclear Salt-Water Rocket for the interplanetary propulsion. It was the most lightweight option, which I needed in order to fit everything onto a single masive booster. The station is equipped with a gravity hab, logistics module, science lab, and a fuel tank for \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E. That tank was empty at launch. I intend to fill it in Duna orbit using either the \u003Cem\u003EAntelope\u003C/em\u003E or the \u003Cem\u003EManticore\u003C/em\u003E FTV currently docked with \u003Cem\u003ELeviathan\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIt will then be able to use the \u003Cem\u003EMatador\u003C/em\u003E DAV to continue the Duna exploration program.\n\u003C/p\u003E\n\u003Cp\u003E\nOn a side note, technically there already is a \u003Cem\u003EPhoenix\u003C/em\u003E Station around Duna. It consists of a single hydroponics module, intended for keeping smaller exploration ships stocked while waiting for the return window. The space program has reached the point where this is no longer neccesary, as all exploration craft carry their own hydroponic gardens and plentiful supplies.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhile the three scientists were actually aboard \u003Cem\u003EPhoenix\u003C/em\u003E Station during launch, I had a few extra crew members to send up separately. One Quartermaster to man logistics, and three tourists, all with contracts to either fly by, orbit, or land on Duna.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228O0AIU5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002295.17\u0022 height=\u0022947\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8O0AIU5.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-14T03:42:55Z","Content":"\n\u003Cp\u003E\nIn an effort to recover some funds and make the whole endeavour profitable, a mission was launched to attach a control probe and parachute packs to the \u003Cem\u003EPhoenix\u003C/em\u003E\u0027s lifter, which I\u0027d forgotten to do in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022V6c1KNB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002267.88\u0022 height=\u0022799\u0022 width=\u00221177\u0022 src=\u0022https://i.imgur.com/V6c1KNB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zu2Aakm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022854\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zu2Aakm.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FLTBttE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.17\u0022 height=\u0022792\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/FLTBttE.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pf0XKBh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002293.67\u0022 height=\u0022907\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pf0XKBh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt all looked so promising. Alas, t\u0027was not to be.\n\u003C/p\u003E\n\u003Cp\u003E\nWithout airbrakes to slow the massive booster, nor enough spare fuel in the tanks, the stage was never able to slow to a safe velocity for even the drogue parachutes to deploy. The lifter hit the ocean at high velocity, destroying pretty much everything of value.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xZSIraQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002276.75\u0022 height=\u0022903\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/xZSIraQ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zr06HXB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zr06HXB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis was rather pretty, though.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnother contract involved getting crew reports from a pair of locations on Gilly. This mission was an absolute breeze, the only risk being if I accidentally timewarped into terrain.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YP5CWpK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002277.50\u0022 height=\u0022847\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/YP5CWpK.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sJ45E2Q.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sJ45E2Q.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYet another contract asks for a scan of a Duna Meteorite. While I could probably survey every Duna biome with the \u003Cem\u003EMatador\u003C/em\u003E, the lander has no scanning arm, and having to repeatedly land and take off from Duna in a craft with its low margins would be both time consuming and risky. As such, I designed a rover to do the job. At launch, its only science instrument was a Surface Scanner. Having realised I forgot the Scanner Arm, the thing that inspired this project in the first place, I sent up a mission to add one... except I got distracted and used that flight to carry deployable science experiments instead. I only realised after reaching orbit. So I sent \u003Cem\u003Eanother\u003C/em\u003E mission up, which finally installed the device. Let\u0027s hope it survives entry into Duna\u0027s atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nI have updated the \u003Cem\u003EKrakatoa\u003C/em\u003E Ultra-Heavy Lifter (50 tons to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E, reusable) with proper landing legs that don\u0027t explode.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221KqCOGo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/1KqCOGo.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lp8Cgmg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/lp8Cgmg.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UkX4SKU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002296.50\u0022 height=\u0022840\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UkX4SKU.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227liw4lW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/7liw4lW.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B7f6GPO.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002292.50\u0022 height=\u0022805\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/B7f6GPO.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the \u003Cem\u003ELeopard\u003C/em\u003E Rover. The on-board habitat, cupola, recycler and hydroponics farm allow the vehicle to operate for around 200 days with a crew of four. It has a pair of advanced RTGs, solar panels, and an \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003E\u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E\u003C/abbr\u003E fuel cell for power generation, to ensure that its hungry life support systems are always powered. Over 8,000 units of EC battery storage ensures that the 0.75 scale monster wheels can keep on trucking for a very long time. It also has a Bon Voyage controller, so I should be able to just set destinations and let it go while I handle other missions.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cem\u003EMatador\u003C/em\u003E\u0027s scientific instruments will be transferred to the \u003Cem\u003ELeopard\u003C/em\u003E, as a cheaper alternative to adding them prior to launch.\n\u003C/p\u003E\n\u003Cp\u003E\nOn a final note, I find it odd that the original Bison command pod is more aesthetically pleasing to me than the Bison 2\u0027s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yNb5Ca4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022111.00\u0022 height=\u0022792\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yNb5Ca4.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bUrUKqF.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002286.00\u0022 height=\u0022864\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/bUrUKqF.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI tried to dock it with the 2m port but the wheels got in the way.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAntelope\u003C/em\u003E will carry \u003Cem\u003ELeopard\u003C/em\u003E to Duna at the next window. It has plenty of delta-V to spare - 16,000 m/s. I considered increasing the size of the sustainer stage so Leopard could make the transit to Duna by itself, but rejected it on the basis that part of my philosophy for this entire series was that I didn\u0027t want to send whole armadas of vessels out at the same transfer window, because making sure they all arrive safely is a pain. That\u0027s also exactly how I ended up with the \u003Cem\u003ERonin\u003C/em\u003E flying off into deep space. Better to have only two craft transit to Duna, even if it will split up on arrival.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNext up, Eve contracts. I\u0027ve got a tourist who wants a flyby, and a World Firsts requiring that I send something to Eve and land it back on Kerbin. That can be a command pod. I\u0027m thinking I\u0027ll design a dedicated interplanetary crew transport, and have it bring whatever command pod carries the tourist up dock with it (has to to transfer tourists anyway) and bring it with for the whole mission.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-14T03:43:34Z\u0022 title=\u002202/14/2024 03:43  AM\u0022 data-short=\u0022Feb 14\u0022\u003EFebruary 14\u003C/time\u003E by RedDwarfIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-14T17:35:37Z","Content":"\n\u003Cp\u003E\nFor the Eve mission, I knew most of the science that was easily collected has already been done so by \u003Cem\u003EValiant\u003C/em\u003E, so there was no need for any scientific instruments to be brought along besides a single scanner arm, to carry out a scan of a Gilly Ridgeline. Therefore, the transport vessel could be a fairly lightweight affair, with enough habitation and life support to carry a number of Kerbals interplanetary, and nothing else. It would be lifted in two sections, Command and Propulsion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Jr1FwD0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002286.42\u0022 height=\u0022848\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Jr1FwD0.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tg6Fnba.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022102.75\u0022 height=\u0022845\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tg6Fnba.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPut together, we have the IPTV \u003Cem\u003EComet\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nCrew were launched separately, along with the MaterialKits for the hab ring inflation, and the scanner arm.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022W9PsemI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.92\u0022 height=\u0022848\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/W9PsemI.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WhJDCJF.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002298.25\u0022 height=\u0022848\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/WhJDCJF.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBy the time the craft was ready to go, only twelve days remained to the Eve transfer window. I took the opportunity to let Tarasque do a bit more work on \u003Cem\u003EWyvern II,\u003C/em\u003E then sent \u003Cem\u003EComet\u003C/em\u003E on its way..\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bcinb9H.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022840\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/bcinb9H.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SKvQXi8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022835\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SKvQXi8.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Eve \u0026gt; Kerbin window opens in about 40 days. Kerbin to Duna in 160.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-15T03:14:02Z","Content":"\n\u003Cp\u003E\nAfter the kerfuffle with the \u003Cem\u003ERonin\u003C/em\u003E \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E flinging itself away from Eve and me sending it off to Jool instead, I realised there was an opportunity to send a replacement in the current Eve transfer window.\n\u003C/p\u003E\n\u003Cp\u003E\nEquipped with twin Project Eeloo nuclear jets, and a powerful nuclear aerospike, this new spaceplane ought to have the oomph to break free of Eve\u0027s cloying atmosphere. I had been quite concerned that the \u003Cem\u003ERonin\u003C/em\u003E would be unable to do this, but hadn\u0027t found a way to incorporate a third engine.\n\u003C/p\u003E\n\u003Cp\u003E\nI call this new vessel the \u003Cem\u003ESamurai\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lpVN0oP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002299.00\u0022 height=\u0022816\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/lpVN0oP.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022z6b6ywu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.67\u0022 height=\u0022801\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/z6b6ywu.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qm89fAh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.25\u0022 height=\u0022798\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qm89fAh.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI was able to get the spaceplane to orbit using only the Eeloo engines - in fact, when I tried lighting off the aerospike in one attempt, I lost parts to overheating as a result of atmospheric friction. I could have avoided that by throttling down, but the main reason not to use the aeropike was so I wouldn\u0027t have to send up two different tankers. The Eeloo engines use Liquid Fuel, while the aerospike requires Liquid Hydrogen.\n\u003C/p\u003E\n\u003Cp\u003E\nOne hastily assembled tanker flight later, and the \u003Cem\u003ESamurai\u003C/em\u003E was ready for its interplanetary burn.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PzJvH7W.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002291.00\u0022 height=\u0022914\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PzJvH7W.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tX8vfZ4.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.42\u0022 height=\u0022803\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tX8vfZ4.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LGF4UyP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002284.25\u0022 height=\u0022798\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/LGF4UyP.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOff it goes!\n\u003C/p\u003E\n\u003Cp\u003E\nDue to the limited life support, it was launched uncrewed. The \u003Cem\u003EComet\u003C/em\u003E can dock with it after arrival. It will need another refuel after Eve capture, so I\u0027m going to have to launch another tanker after it. Nothing super fancy like the \u003Cem\u003EAntelope\u003C/em\u003E, since there\u0027s no time to build anything that size, and the spaceplane should only need enough fuel for one descent into Eve\u0027s atmosphere. The Eeloo engines mean it can fly indefinitely. There is no reason to return it to orbit until the end of the mission, unless Supplies or Habitation run out.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-15T03:15:36Z\u0022 title=\u002202/15/2024 03:15  AM\u0022 data-short=\u0022Feb 15\u0022\u003EFebruary 15\u003C/time\u003E by RedDwarfIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbalsaurus","CreatedById":222386,"CreatedDateTime":"2024-02-15T03:18:59Z","Content":"\n\u003Cp\u003E\nThere is no kill like overkill.\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-15T17:58:04Z","Content":"\n\u003Cp\u003E\nThis is the tanker design I came up with for refuelling the \u003Cem\u003ESamurai\u003C/em\u003E at Eve. The \u003Cem\u003EHarrier\u003C/em\u003E FTV carries enough Liquid Fuel and LH2 for a single Eve descent/ascent. The nuclear lightbulb engine means it can reach Eve without having to dig into the payload. 50k VF would be expensive for a single-use engine, if I weren\u0027t swimming in funds.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u00221t6dovK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002276.11\u0022 height=\u0022889\u0022 width=\u00221168\u0022 src=\u0022https://i.imgur.com/1t6dovK.png\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ETarasque\u003C/em\u003E Station is running low on Specialised Parts, which it needs to continue work on \u003Cem\u003EWyvern 2\u003C/em\u003E. I could have sent several carriers to Minmus, but instead chose to have \u003Cem\u003EMirage\u003C/em\u003E construct a freighter that could shift huge amounts of the resources about, and when \u003Cem\u003EWyvern 2\u003C/em\u003E comes online, it can ferry MaterialKits and Specialised Parts from there to wherever in the Kerbol system they might be needed. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022joBJSSa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022873\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/joBJSSa.png\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022QoE6Kk0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.50\u0022 height=\u0022905\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/QoE6Kk0.png\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Eve to Kerbin transfer window is coming up, so Valiant departed Gilly for a circular orbit high over Eve. It\u0027ll be another week or two before it heads home. The stock alarm clock lied to me again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022wQ1atcZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002281.92\u0022 height=\u0022913\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wQ1atcZ.png\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-16T22:34:11Z","Content":"\n\u003Cp\u003E\nIn an effort to avoid the faff of deorbiting reusable boosters, while recovering more of the cost of the launch vehicle, I began working on a new cargo spaceplane for carrying MaterialKits up to \u003Cem\u003EMirage\u003C/em\u003E Station. This resulted in two variants of a viable design, the \u003Cem\u003EBerserker\u003C/em\u003E and \u003Cem\u003EMarauder\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAnticipating that I would need a lot of thrust to reach orbit with such a heavy payload, I fitted the \u003Cem\u003EBerserker\u003C/em\u003E with four Project Eeloo engines, two OPT Turbo-Ramjets and a pair of nuclear aerospikes. That was reduced to a single aerospike when I found that two of them could run through the LH2 supply in the time it took the spaceplane to reach the end of the runway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rH1lGc3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002274.25\u0022 height=\u0022837\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/rH1lGc3.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022v877oq3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002279.67\u0022 height=\u0022849\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/v877oq3.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo far, so good. It was perfectly capable of reaching orbit, but the weight of the craft meant it needed to use the Eeloo drives in closed-cycle mode until reaching 300 m/s, This was not exactly optimal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RWHgiLx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002288.50\u0022 height=\u0022871\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RWHgiLx.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u00222kLSJ2V.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002276.75\u0022 height=\u0022885\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/2kLSJ2V.png\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022BesbJXx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022101.42\u0022 height=\u0022877\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/BesbJXx.png\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022kEONjvq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022876\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kEONjvq.png\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPerfect landing! Though I did have a couple of failed attempts, until I realised that autostrutting the nose gear was a bad idea.\n\u003C/p\u003E\n\u003Cp\u003E\nNext up, \u003Cem\u003EMarauder\u003C/em\u003E. I figured the nuclear aerospike and the turbo-ramjets were actually unneccesary, and in fact were only required because of the weight of the fuel \u003Cem\u003Ethey were using\u003C/em\u003E. So I removed them, leaving just the four Project Eeloo engines. I\u0027m starting to wonder if the \u003Cem\u003ESamurai\u003C/em\u003E would have been better served without the aerospike, too.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B5shsaI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002294.17\u0022 height=\u0022874\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/B5shsaI.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qvLDSdC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.75\u0022 height=\u0022871\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/qvLDSdC.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uyx613w.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/uyx613w.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI think this might be the best screenshot I have ever taken.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022M4IHozI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022872\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/M4IHozI.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224alkYmK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022107.17\u0022 height=\u0022874\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4alkYmK.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225VnXrgP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002297.50\u0022 height=\u0022874\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5VnXrgP.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOverran the runway, no damage. I tweaked the landing gear in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E afterwards to ensure that it would have enough braking power to stop, next time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEvaluating these designs, I think the \u003Cem\u003EBerserker\u003C/em\u003E might have some promise as an Eve cargo \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E, but It\u0027s far too expensive to justify using it in anything but niche roles - 700,000 VF, vs 330,000 VF. It\u0027s even possible the \u003Cem\u003EMarauder\u003C/em\u003E could be an Eve \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\u003C/abbr\u003E as well, in which case it would have no use whatsoever. I like the name too much, though, so I might reuse it for a different design.\n\u003C/p\u003E\n\u003Cp\u003E\nIn general, the \u003Cem\u003EMarauder\u003C/em\u003E is a highly effective design, and one I anticipate I\u0027ll be using a lot. When \u003Cem\u003EMirage\u003C/em\u003E completes the \u003Cem\u003EAsgard 2\u003C/em\u003E, I\u0027ll be using it to hault up MaterialKits and SpecialisedParts for transport to \u003Cem\u003ETarasque\u003C/em\u003E Station.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-16T22:36:57Z\u0022 title=\u002202/16/2024 10:36  PM\u0022 data-short=\u0022Feb 16\u0022\u003EFebruary 16\u003C/time\u003E by RedDwarfIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-17T21:06:39Z","Content":"\n\u003Cp\u003E\nAsgard 2 has been launched. I forgot to take any screenshots of it, but it basically looks like \u003Cem\u003EAsgard 1\u003C/em\u003E with larger forward cargo bays and half the fission particle capacity.\n\u003C/p\u003E\n\u003Cp\u003E\nLifting MaterialKits was easy enough that I nearly filled \u003Cem\u003EMirage\u003C/em\u003E\u0027s storage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gAqzqws.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gAqzqws.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNot all the flights went to plan, but that was entirely my fault. This particular Marauder was damaged by 8x physics warp.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oRydvOB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oRydvOB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UUEZmx2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UUEZmx2.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe landing was not a conspicious success, but it \u003Cem\u003Edid\u003C/em\u003E land, despite having lost an engine, a vertical stabiliser and a tail canard.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSpecialisedParts are a different matter. They\u0027re heavier than MaterialKits, making takeoff more difficult, and reducing delta-V after reaching \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. To remedy this, I tried sticking a 2m turbofan on the tail.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MYrr6QZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002271.92\u0022 height=\u0022697\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MYrr6QZ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt worked well enough.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll have to send up quite a few of these missions to completely fill \u003Cem\u003EAsgard 2.\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2024-02-18T21:26:48Z","Content":"\n\u003Cp\u003E\nToday was a busy day!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCall me a flip-flopper, but I decided maybe SSTOs weren\u0027t the best option for bulk transport after all. Oh, I fully plan to keep using them to stock \u003Cem\u003EMirage\u003C/em\u003E,  but the \u003Cem\u003EAsgard 2\u003C/em\u003E was thirsty for resources in a way only a 300 ton-to-\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E launcher could satisfy. This is the \u003Cem\u003EPolecat\u003C/em\u003E MK/SPCV, atop the new \u003Cem\u003EBlizzard\u003C/em\u003E booster stack. I launched it twice, filling the freighter\u0027s SP cargo bays to... 2/3rds full. Yeah.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TsIIgow.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/TsIIgow.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ea3y5Lp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Ea3y5Lp.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022T4T7JAU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002277.25\u0022 height=\u0022785\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/T4T7JAU.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IC6c9Xy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002296.75\u0022 height=\u0022798\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/IC6c9Xy.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002242bK5Kz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/42bK5Kz.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IWnBj3b.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/IWnBj3b.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy first time making use of the inflateable heatshield, and having it work properly. All my previous experience of it usually resulted in the spacecraft flipping around.  I know it\u0027s standard practice to put one at either end, but that always looks silly to me,\n\u003C/p\u003E\n\u003Cp\u003E\n(EDIT: Just remembered I used it for the \u003Cem\u003ETarantula\u003C/em\u003E rover. Though in that instance it was a much smaller payload, with an aeroshell to make it look like one of NASA\u0027s rover capsules.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022x1XNxDX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002285.75\u0022 height=\u0022762\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/x1XNxDX.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226TZF8BS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002294.75\u0022 height=\u0022717\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6TZF8BS.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022r1qvMzZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002292.17\u0022 height=\u0022812\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/r1qvMzZ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dmdEqGC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002285.25\u0022 height=\u0022771\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/dmdEqGC.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe booster followed it down. It has many, many parachutes. Some more neccesary than others.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002208RGbw3.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/08RGbw3.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Eq5h2gY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Eq5h2gY.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs stocked as I could be bothered, I sent \u003Cem\u003EAsgard 2\u003C/em\u003E off to Minmus. Heavy as it is, and with limited \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E, several burns were needed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GXKewcq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002295.75\u0022 height=\u0022829\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/GXKewcq.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OQEt5A7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022108.25\u0022 height=\u0022744\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OQEt5A7.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fJPRLlB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002293.92\u0022 height=\u0022766\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fJPRLlB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mvNSq8w.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002273.00\u0022 height=\u0022804\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mvNSq8w.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs the Eve to Kerbin transfer window opened,\u003Cem\u003E Valiant\u003C/em\u003E headed home.  I\u0027d considered leaving the ship\u0027s engineer behind at Gilly, but only thought of that when it was too late. Heaven knows how I\u0027m going to scan those Gilly ridgelines.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228hYEtQm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002288.67\u0022 height=\u0022757\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8hYEtQm.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAsgard 2\u003C/em\u003E arrived at Minmus and rendezvoused with \u003Cem\u003ETarasque\u003C/em\u003E Station. Even after bringing up an empty \u003Cem\u003EFerret\u003C/em\u003E MKCV from the surface, there still wasn\u0027t enough storage on \u003Cem\u003ETarasque\u003C/em\u003E for all the MaterialKits the freighter was carrying. To avoid any Kraken-y mishaps, I sent \u003Cem\u003EAsgard 2\u003C/em\u003E away after the transfer was complete. \u003Cem\u003EFerrets\u003C/em\u003E can shuttle between them later if neccessary.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PnnRrUM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002297.17\u0022 height=\u0022812\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/PnnRrUM.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228lUSb0o.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.17\u0022 height=\u0022884\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/8lUSb0o.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe return window at Duna also opened up, and \u003Cem\u003EEndeavour\u003C/em\u003E made its own burn for Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yv6yaHr.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yv6yaHr.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fCzNzKa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002282.00\u0022 height=\u0022679\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fCzNzKa.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnnoyingly,\u003Cem\u003E Tarasque\u003C/em\u003E Station\u0027s reactor overheated and melted down during timewarp, despite having adequate cooling in all other situations. I was forced to send a replacement, which I fitted much more effective cooling arrays to.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ik7yRMB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ik7yRMB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022H0WeREd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/H0WeREd.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022p3VNZpY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002295.17\u0022 height=\u0022758\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/p3VNZpY.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESarnus Surveyor\u003C/em\u003E made its first burn, bringing its apoapsis out to Jool orbit. It will make another burn in a few months to intercept Sarnus.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tQFaKZL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002289.00\u0022 height=\u0022759\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tQFaKZL.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Duna transfer window arrived. Three craft orbiting Kerbin made their escape burns. Only the first, \u003Cem\u003EPhoenix\u003C/em\u003E Station, was able to do so on a single pass, with its nuclear saltwater rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Pn7qN4i.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002293.42\u0022 height=\u0022846\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Pn7qN4i.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220VeDuny.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.42\u0022 height=\u0022788\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0VeDuny.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s a spicy meatball!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBasilisk\u003C/em\u003E went next.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hQuLxit.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002297.75\u0022 height=\u0022685\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hQuLxit.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd last, but certainly not least, \u003Cem\u003EAntelope\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wgk9paZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wgk9paZ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zwNx7KI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002286.00\u0022 height=\u0022764\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zwNx7KI.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wgk9paZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022120.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wgk9paZ.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nComing up, the arrival of the \u003Cem\u003EComet\u003C/em\u003E and \u003Cem\u003ESamurai\u003C/em\u003E at Eve.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-18T21:33:06Z\u0022 title=\u002202/18/2024 09:33  PM\u0022 data-short=\u0022Feb 18\u0022\u003EFebruary 18\u003C/time\u003E by RedDwarfIV\u003C/strong\u003E\n\u003C/span\u003E\n"}]}