{"TopicId":221042,"ForumId":51,"TopicTitle":"Quintuple star system i\u0026#039;ve been working on, heres an orbit visualization","CreatedByName":"Astra Infinitum","CreatedById":221662,"CreatedDateTime":"2023-12-01T19:48:02Z","PageNum":1,"Articles":[{"CreatedByName":"Astra Infinitum","CreatedById":221662,"CreatedDateTime":"2023-12-01T19:48:02Z","Content":"\n\u003Cp\u003E\nDidnt know where to post this because it\u0027s not a mod im working on or will robably ever be a mod so I think this is the best place.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been spending alot of time making planet maps and textures, star textures, planet and star configs, and learning Kopernicus much more in-depth. I though about making a Quntuple system being that I\u0027ve never seen one in any KSP planet pack, correct me if I\u0027m wrong. So I made one recently. It consists of 2 binary pairs that each orbit their barycenter, and those 2 barycenters which are the center for each binary, orbit a singularity/black hole. I made a quick video to show what I made. Here\u0027s to much more learning.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCheck it out below!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/5lRsETHe_QY?feature=oembed\u0022 title=\u0022KSP Custom Quintuple Star System (x2 Binary Pairs orbiting a Black Hole)\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUpdate: 4/10/2024\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the amazing feedback everyone, I really appreciate the constructive criticism. I couldn\u0027t thank you enough for how much it means. Thanks. I will take your recommendations and advice and incorporate them into my creations for all future endeavors. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EGeorge \u003C/strong\u003E- No I did not but now that you mention it, I will definitely try that out!! Ill post results.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDr. J.D. Peabody \u003C/strong\u003E- I\u0027m a bit confused on the 3rd step in your explanation, but everything you mentioned leading into the 3rd step I actually wholeheartedly agree with because believe it or not I already have firsthand experience with the tripled razor theory of the internal destabilization vectors so I knew they would have to be maintained on equal fronts in all planes. I could fill you in on all of my research or even send you my files. Aside from that, It\u0027s just the work of getting there without disorienting the universal aspect of the entire quasi-modal self-ionization of positive and negative gravimetric functional calibrations.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-04-10T11:38:28Z\u0022 title=\u002204/10/2024 11:38  AM\u0022 data-short=\u0022Apr 10\u0022\u003EApril 10\u003C/time\u003E by Astra Infinitum\u003C/strong\u003E\n\u003C/span\u003E\n"}]}