{"TopicId":25464,"ForumId":51,"TopicTitle":"Long-term Laythe Mission (pic heavy) - ^_^ With Part 45 ^_^","CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-05-04T20:31:45Z","PageNum":6,"Articles":[{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-07-04T10:07:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003EWhile we\u0027ve been able to maintain compatibility over the last couple of updates, unfortunately this one isn\u0027t such a case. The new crew management system changed the format for saving crews (to something much better), and the new format isn\u0027t compatible with the old version. Instead of risking breaking things even more by writing some sort of upgrade logic, we decided it was better to just break compatiblity and start fresh.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EI too have heavily invested in Laythe. Sad day.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-04T11:22:46Z","Content":"\n\u003Cp\u003EIndeed. Personally i have nothing on Laythe yet, but i do have 19 ongoing missions all over the system. Oh well - i hope new stuff will make up for the losses. Crew management for once should be fun.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-04T15:06:44Z","Content":"\n\u003Cp\u003EOr, you could stay with 0.20.2 for a little while. Me, I sometimes keep two versions of KSP going at once (or at least two versions with different mods installed). You could keep a 0.20.2 just for the Laythe mission?\u003C/p\u003E\n"},{"CreatedByName":"Agent30632","CreatedById":58734,"CreatedDateTime":"2013-07-05T13:35:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EOr, you could stay with 0.20.2 for a little while. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat and then look for a save converter to convert from 0.20.2 to 0.21?\u003C/p\u003E\u003Cp\u003EAlso, the \u0022Oops\u0022 doesn\u0027t sound good. Did you delete the save by accident?\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-07-05T17:54:42Z","Content":"\n\u003Cp\u003EThe \u0022oops\u0022 has me worried, what happened????\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-06T02:18:35Z","Content":"\n\u003Cp\u003EI have today off...write-up of the \u0022oops\u0022 is coming soon.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-06T06:44:24Z","Content":"\n\u003Cp\u003ENo one died, right? Guys are A-OK out there?\u003C/p\u003E\n"},{"CreatedByName":"Cashen","CreatedById":71281,"CreatedDateTime":"2013-07-06T16:58:48Z","Content":"\n\u003Cp\u003ELooking forward to seeing more. Honestly reading this thread is what inspired me to start my own mission log thread.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-06T18:04:28Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ELong-term Laythe Mission - Part 11\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003ETL;DR version: The boys explore islands.\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWe last saw Aldner on Hellou Island after he explored the islands of the Manley Crater formation. Rather than continue north, he flew back to Manley Base to refuel for an expedition to the southeast.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3tUEPcs.jpg\u0022 alt=\u00223tUEPcs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CXts3Sr.jpg\u0022 alt=\u0022CXts3Sr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ENelemy\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBut before Aldner heads south, it\u0027s Nelemy\u0027s turn. Thompbles has a rule that only one of the BirdDogs should be away from their bases at a time, just in case something goes wrong and rescue options are needed. Nelemy\u0027s general plan for his Northeast Expedition is shown below.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3QJOpMu.jpg\u0022 alt=\u00223QJOpMu.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter checking that everything, including emergency provisions for months, is packed onboard the BirdDog 2, and TRIPLE checking that he has the nose gear lowered, Nelemy takes off to the northeast, skimming the ridge top, since he likes to fly that way.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bf9YkFV.jpg\u0022 alt=\u0022bf9YkFV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OSn4MSl.jpg\u0022 alt=\u0022OSn4MSl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022BirdDoggie to Kurt! I\u0027m coming by for a flyover, Dude!\u0022\u003C/p\u003E\u003Cp\u003EKurt: \u0022Negative, BirdDoggie. The pattern is full.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Ha, ha! I\u0027ll go name an island after you!\u0022\u003C/p\u003E\u003Cp\u003EKurt: \u0022Just be careful out there, Nelemy. Fly safe.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude, I always fly safe. BirdDoggie out!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3CoSDsJ.jpg\u0022 alt=\u00223CoSDsJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy takes the BirdDog 2 up over 9,000 meters for the flight out in order to minimize fuel consumption while staying below 10,000 meters where the BirdDog has a tendency to pitch up violently if not watched carefully. I\u0027ve done some testing, and it turns out that the culprit in causing these pitch-ups (aside from having to hold a fairly high pitch-up trim to begin with in the thin air at 10 km) is the high position of the air intakes. I originally placed them high to give the plane more ground clearance for roving, but the drag on the intakes does cause an upward pitch. Below, as Nelemy approached his first target island, he steers toward the low-lying land on the left side (the general procedure when approaching an unexplored island looking for a good place to land, since there tend to be beaches with low slopes in those areas).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jMxMJzK.jpg\u0022 alt=\u0022jMxMJzK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first bay area looks to have fairly steep slopes, so Nelemy checks out the next, smaller, bay. It looks good, so he takes the BirdDog2 in for an easy touchdown:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rlPyvXm.jpg\u0022 alt=\u0022rlPyvXm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JuGEnBj.jpg\u0022 alt=\u0022JuGEnBj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iI1Lhkr.gif\u0022 alt=\u0022iI1Lhkr.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yo, Thompbles, Dude! Are you there?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Yes, Nelemy. What can I do for you?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I have safely landed, and I\u0027d like to name this place Kurt Island, after Kurt Kerman my good friend.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Roger, Nelemy. An island for Kurt. Very thoughtful.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude, don\u0027t worry, I can name the next one after you!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022No need, Nelemy. You already gave me a lake. You drive safely now. Laythe Base out.\u0022\u003C/p\u003E\u003Cp\u003EBelow is an overview of the western bay area of Kurt Island. Some nice beachfront property, but not particularly flat.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XraaMRl.jpg\u0022 alt=\u0022XraaMRl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy puts the BirdDog2 in rover mode and checks out the peninsula that shields the main bay. Peninsulas are often just ridges, but this one flattens out into an acceptable landing area. Then he drives back off the peninsula and circles the bay looking over the property. In my universe, kerbal astronauts are allowed to claim some property and mineral rights at all of the places they explore, as part of their compensation for going on such risky missions.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TaKTS4y.jpg\u0022 alt=\u0022TaKTS4y.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Xm6UPQC.jpg\u0022 alt=\u0022Xm6UPQC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAround on the other side of the bay, Nelemy spies a small island offshore in the ocean and decides to swim over to it, which I do at warp speed and while holding down Shift to make things faster.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FtliwDH.jpg\u0022 alt=\u0022FtliwDH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Gah! Damn!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Nelemy? What\u0027s wrong?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I stopped and swam out to a little island...but the BirdDoggie has rolled into the ocean!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Damn. Didn\u0027t you set the brake?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I did! I\u0027m sure I did!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022How far out is it? Can you reach it?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: *splashing noises* \u0022I\u0027m going to get it now.\u0022 *puff* *gasp*\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5TaA85M.jpg\u0022 alt=\u00225TaA85M.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy reaches the BirdDog2 and climbs on board.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JDoij8k.jpg\u0022 alt=\u0022JDoij8k.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I\u0027m on board. The brake is set, just like I said.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Mmmm...if you say so. It shouldn\u0027t roll with the brake set. Are the wheels touching bottom? Can you drive it out?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022No, Dude. It\u0027s floating. But the air intakes are almost completely out of the water. I think I can start up the jet engine and drive it to land.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK. Be very careful. Use minimum thrust and cut the engine as soon as the wheels touch bottom. Don\u0027t try to come driving ashore under power, or you can end up shooting out too fast. Remember Kurt\u0027s tests of the DogFish.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude, I was there. Here goes!\u0022\u003C/p\u003E\u003Cp\u003ENelemy fires up the jet engine and tools along a 1 m/s. He tried to turn the plane, but it ends up going ashore on the island instead of the mainland.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dk1RAd2.jpg\u0022 alt=\u0022dk1RAd2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, Nelemy brings the plane around and drives it back across to the mainland. Coming straight across, the water is actually very shallow and only requires a small burst from the jet engine at the deepest part where the wheels lose contact with the bottom.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t06HOPo.jpg\u0022 alt=\u0022t06HOPo.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022WooHoo! I\u0027m back to the main shore! Motor boating is great!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Ah...OK. Carry on. Just be sure to set the brake whenever you stop and get out.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude, the brake was set. I have it set now and the rover wheels can\u0027t move the ship, so the brakes work. Something weird must have happened!\u0022\u003C/p\u003E\u003Cp\u003EIndeed, something weird did happen. The brakes WERE set on the plane. But when I swam Nelemy out to the little island and ran him around there at Physics Warp 4, the plane was responding to the physwarp by sliding down slope and into the water. So be very careful about running your kerbals around at warp speed when there are ships near by. Alas, since the kerbals don\u0027t know about this, they\u0027re probably going to think Nelemy is some sort of Mr. Squirmy Brake-Non-Setter.\u003C/p\u003E\u003Cp\u003EAnyway... Nelemy also checked out a little north bay where there was a very skinny peninsula that looked like to might be fun to drive on. That\u0027s #4 on the map below (#1 is where he landed, #2 is the first big peninsula he drove out on, and #3 is where he put the BirdDog2 into the drink).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/V80RYen.jpg\u0022 alt=\u0022V80RYen.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GN4LLyj.jpg\u0022 alt=\u0022GN4LLyj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter exploring the bay area, Nelemy headed cross country in the rover/plane to continue gathering samples and checking out possible base locations.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENOTE: Brotoro\u0027s Rules For Driving Laythe Rovers.\u003C/strong\u003E My kerbals have rules for driving their rovers (don\u0027t go too fast, especially in known dangerous situations), but whereas they get paid to carefully explore alien words, I don\u0027t. So I have different rules that I follow, since I\u0027m just playing a game. For example, I\u0027m allowed to race a rover across the surface at high rates of warp and through dangerous terrain just so I can get to the next place quickly. If this means there are occasional smash-ups of the rover, well, that\u0027s what quicksaves are for. I don\u0027t hold those accidents against my kerbals. But if I do smash up the rover, I go back through that section of the trip at a slow speed following the kerbals\u0027 rules, just to prove it can be done (and if damage occurred then, I\u0027d be stuck with it). Then I\u0027m allowed to continue like a maniac. My rovers (especially the Fido...less so the BirdDog) are designed to travel fast and be stable across moderate terrain even at 3X and 4X warp. But I don\u0027t just fly everywhere because propellant is dear out at Laythe, so I use roving to decrease the need for jet fuel.\u003C/p\u003E\u003Cp\u003EBelow, Nelemy finds that the area on the south side of Kurt Island (opposite the offshore island there) is a good broad area for landing and setting up a base. This is #5 on the previous map. Then he continues on to the east coast and takes off for the next island:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7Jz0Flv.jpg\u0022 alt=\u00227Jz0Flv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/w4xw4ej.jpg\u0022 alt=\u0022w4xw4ej.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, Nelemy approaches the next island. Much of its shoreline appears to be steep, so he heads over toward the big bay area on the left to search for a landing site. Unfortunately, the left side of that bay has very steep slopes, and the right side is fairly steep. So Nelemy decides to do an up-slope landing to the right side, high enough up that the slope is fairly gentle. He brings in some extra speed, as advised by Aldner for upslope landings, and puts the plane down at about 70 m/s instead of the usual less-than-50 speed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cXVVsxh.jpg\u0022 alt=\u0022cXVVsxh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JohcL1F.jpg\u0022 alt=\u0022JohcL1F.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QcpchlQ.gif\u0022 alt=\u0022QcpchlQ.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022BirdDogie calling Thompbles!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022What\u0027s up, Nelemy?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I\u0027ve landed safely, and I\u0027d like to name this place J Island. That\u0027s just the letter \u0027J\u0027, Dude.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022J? Why, may I ask?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I\u0027m naming it after my uncle J. He owns the J-Mart stores... I think we don\u0027t want to name things only after politicians and scientists... we want the support of business people, too, you know!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK, I\u0027ll send it in. Ummm...isn\u0027t J kind of a funny name?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022It\u0027s his middle initial. He doesn\u0027t like his first name.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Not too many kerbals have middle initials. What\u0027s his first name that he doesn\u0027t like?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022He\u0027s from Frostbite Falls...they all have middle initials up there. His full name is Bullwinkle J Kerman.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Ah, well then preferring J makes perfect sense. Drive safely going down hill. Thompbles out.\u0022\u003C/p\u003E\u003Cp\u003EThe high-slope landing site put him pretty high up on the island, so he drove to the 1821-meter high peak for some samples and a photo op.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gbHAmAg.jpg\u0022 alt=\u0022gbHAmAg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow is an overview shot of J Island, in case anybody is scouting out nice sites. #1 is Nelemy\u0027s landing path. #2 is the peak. #3 is where he headed next, down slope to a likely looking lowland...probably the best landing spot on the island, which Nelemy named J Beach.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iem0ya9.jpg\u0022 alt=\u0022iem0ya9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OZEhGus.jpg\u0022 alt=\u0022OZEhGus.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJ Island didn\u0027t seem too exciting, so Nelemy left soon for the next island, which the geologists were particularly interested in since it looks like a large volcanic island. But as Nelemy approached, there didn\u0027t seem to be any good landing sites on thefront, left, or right sides, so he flew on over the south end of the island. The large indentation in the second picture below is not the main caldera of the island, it\u0027s just a side canyon.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SSI6sdX.jpg\u0022 alt=\u0022SSI6sdX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2KyZSSF.jpg\u0022 alt=\u00222KyZSSF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen he got to the far side of the island, he spotted a low shelf that looks good, and brought the BirdDog2 in for a landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DweTZSI.jpg\u0022 alt=\u0022DweTZSI.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XtK0Ej2.jpg\u0022 alt=\u0022XtK0Ej2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wHdihU8.jpg\u0022 alt=\u0022wHdihU8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yo, Thompbles! I\u0027m down safe. I\u0027d like to name this big volcano Mac Island!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022After Mac Kerman, the CEO of Fruity Computer company?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yeah, Dude! Another captain of industry. A great technological innovator. Also, another one of my uncles.\u0022\u003C/p\u003E\u003Cp\u003EKurt: \u0022You\u0027ve got a lot of famous uncles.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022What can I say, Dude? They\u0027ve got a famous nephew. Must run in the family!\u0022\u003C/p\u003E\u003Cp\u003EThe problem with the landing site Nelemy found is that it was on the southeast side of the island, but the best route into the central caldera is on the north side of the island. So, time for some driving. Still, being that the caldera is a long way up, it took a lot of driving upslope at a shallow angle to gain altitude. \u0022Contour driving\u0022 is an important technique for herding your rover up a steep incline. Just aim a little above the contour lines and keep your speed at about 10 m/s. You can steadily gain altitude at a meter or two per second. When you come to a sharp angled slope line, be ready to turn upslope as you cross it, or you can end up heading too much down hill. The BirdDog can handle 2X and sometimes 3X physwarp when driving along moderate slopes like this, but you have to keep giving it some uphill-turn to counteract the natural tendency of rovers to slide down slope under time warp in KSP.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DtyTg6M.jpg\u0022 alt=\u0022DtyTg6M.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEventually Nelemy came to a more level area high up (#2 on the map below) that overlooked some moderately flat areas that might have made a better landing site, since they would have been closer to the route up into the caldera (#3 on the map).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EcjbbII.jpg\u0022 alt=\u0022EcjbbII.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lXbGlT5.jpg\u0022 alt=\u0022lXbGlT5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow we see Nelemy heading up the high pass (above Laythe\u0027s \u0022dune level\u0022) and then topping the ridge for his first view into the central caldera. Downhill and rough terrain...drive slow!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kMj1DQU.jpg\u0022 alt=\u0022kMj1DQU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/E7EVfEG.jpg\u0022 alt=\u0022E7EVfEG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy scouted out the lowest point in the bumpy-bottomed caldera, eventually finding a location at 270 meter elevation. It was a sharp-bottomed depression, so he didn\u0027t drive the rover down into it, and instead walked down to plant a flag.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zAnCBrG.jpg\u0022 alt=\u0022zAnCBrG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lN1eVDQ.jpg\u0022 alt=\u0022lN1eVDQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy spent an extra day in the caldera getting all the samples the geologists could want. Below, night camp in Mac Caldera.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KaLvrdx.jpg\u0022 alt=\u0022KaLvrdx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot wanting to do a tedious drive back up all that distance, Nelemy found a long slope and just pointed the BirdDog2 uphill and gave it full throttle and lifted off to fly out of the caldera easily. BirdDogs get in and out well. He then pointed mostly south and headed for the last island on his itinerary, a long, thin, moderately low island. Landing on the north point was simple.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1oxhdSo.jpg\u0022 alt=\u00221oxhdSo.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tEB1qXL.jpg\u0022 alt=\u0022tEB1qXL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022BirdDoggie here! Thompbles there?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I read you load and clear, Nelemy.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I would like to name this island PD Island, Dude.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022PD? Another uncle from Frostbite Falls? Wait...is this the guy who owns the PD TV network?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yes indeedy, Dude! His first name is Xavier, but he hates it, so he goes by PD.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I didn\u0027t even ask.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022It\u0027s important for our space program to have the support of media people, you know.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022True enough. I\u0027ll radio it in.\u0022\u003C/p\u003E\u003Cp\u003EThe best piece of real estate appears to be a flat area in the center of the island, which Nelemy is rolling into below a bit too fast after coming down from the central high point. The south end of the island also has a nice landing area, and a small offshore island that Nelemy took a swim out to (after very carefully setting the brake...and I carefully did NOT time warp). It wasn\u0027t a long swim...only 75 meters or so.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PXRRIe7.jpg\u0022 alt=\u0022PXRRIe7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QmCnuZd.jpg\u0022 alt=\u0022QmCnuZd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bQfqtQ2.jpg\u0022 alt=\u0022bQfqtQ2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen it was time to fly home, Nelemy shifted most of the remaining fuel to the front tank (for improved balance), and set Laythe Base as the Target so he could steer to the pink marker on the Navball (since this stretch of water would be out of sight of all land). Then he took off and headed up to 9,500 meters...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NNUcXV4.jpg\u0022 alt=\u0022NNUcXV4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...and ran into some mysterious trouble. The plane was trying to pitch up violently, much more so than normal, and it was very difficult to control. I was mystified at first... Had it been a mistake moving the fuel around? Not...moving it back only made matters worse. I flew along a while giving it lots of down elevator until I eventually noticed that the pitch trim had apparently gotten set to maximum-up. Setting this back down (with lots of Alt-s keypresses) got the plane under control. It turned out (since I was able to sometimes replicate this weird behavior), that if I click outside the KSP window onto my Dock, the pitch trim can suddenly get set to some weird value. It doesn\u0027t happen most of the time, but I did get it to happen again. OK... so remember to be careful about wildly clicking outside of the window when flying.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oue1GCc.gif\u0022 alt=\u0022oue1GCc.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy landed safely back at Laythe Base and refueled at the original GasStation. His trip has used 209 out of 300 units of fuel in the BirdDog2\u0027s tanks. The map below shows his route.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Z3kI6AJ.jpg\u0022 alt=\u0022Z3kI6AJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fSXOaxL.jpg\u0022 alt=\u0022fSXOaxL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EAldner\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOnce Nelemy was safely back home, Thompbles gave Aldner the go-ahead to make his expedition to the southeast from Manley Base. For his first island, he was going to aim for the narrow isthmus, figuring there would be low flat areas there. But he spotted and interesting colored depression on the main part of the island, so it took the BirdDog in there.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kOu62yC.jpg\u0022 alt=\u0022kOu62yC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jX2J7Cq.jpg\u0022 alt=\u0022jX2J7Cq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/arqM7Mz.jpg\u0022 alt=\u0022arqM7Mz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022Yo, Cap\u0027n Thompbles? Are you on the horn?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I\u0027m here, Aldner. What\u0027s up?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022I was out doing a little flying, and I happend to find an island. Imagine that. I\u0027d like to name it Thompson Island, if you would be such a fine fellow as to radio that in the the big wigs at KSC.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Named after Professor Thompson Kerman, the guy who taught us everything we needed to know about rendezvous and docking?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022That\u0027s the guy: Dr. Rendezvous. Very famous scientist, him. But kind of dull at parties. Only talks about rendezvous.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I\u0027ll phone it in.\u0022\u003C/p\u003E\u003Cp\u003EBelow, an overview of Thompson Island. The discolored depression had a lake in the bottom, which Aldner checked out. The water in that lake seemed to have unusually low density, since he only floated at eyeball level in it. He took samples.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DiwXM5F.jpg\u0022 alt=\u0022DiwXM5F.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AgjMFvD.jpg\u0022 alt=\u0022AgjMFvD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2DTvcHX.jpg\u0022 alt=\u00222DTvcHX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe terrain of the island was suitable for some fairly high-speed roving, so Aldner investigated the southeast corner of the main part of the island, which had some wide moderately flat areas, and the south shore of the main part of the island, which had a beach area suitable for landings (below). He then came back to the isthmus area that he had intended as his initial target. It was not particularly flat, but there were good landing areas near the shore. The second picture below shows the overview toward the narrow south part of the island.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2rq4ktK.jpg\u0022 alt=\u00222rq4ktK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/g6EBxhN.jpg\u0022 alt=\u0022g6EBxhN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI know that many people find driving rovers to be a boring activity, but I rather enjoy it at times. It sometimes amazes me to think that one of the developers spent days and days lovingly handcrafting every square foot of this terrain (or, more likely, spent a considerably shorter amount of time herding a terrain-generation program to make some landscape he liked the looks of), so it seems a shame if nobody ever comes to look at it. And, if you have a well designed rover and some driving skills, you can blast along at higher warp speeds and cover lots of ground fast when you get bored. Below, Aldner drives into a small harbor near the southwest end of the island as Kerbol starts to get too low to keep the rover\u0027s batteries charged. So he stopped to camp for the night and slept out under the stars.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TRUMYUA.jpg\u0022 alt=\u0022TRUMYUA.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dBDUkY0.jpg\u0022 alt=\u0022dBDUkY0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe next morning, Aldner hopped over the the next island to the west. The landing prospects didn\u0027t look immediately great to the left or right, but he found a low lying area on the east coast of the island to set down.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DNgfQqD.jpg\u0022 alt=\u0022DNgfQqD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/T68hKzY.gif\u0022 alt=\u0022T68hKzY.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022Greetings from tomorrow, Mayor Thompbles. Rise and shine!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: *yawn* \u0022I\u0027m here, Aldner. What\u0027s up?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022I found yet another island, sir. This place seems to be littered with them. Can I keep it? I\u0027d like to name \u003C/p\u003E\u003Cp\u003Eit Stomp Island.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022After Stomp Kerman, the head of the KSC rover division?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Absolutely, sir. Maker of fine Fidos. Famous for it.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Noted. What\u0027s your plan for today?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Well, somebody seems to have inconveniently located a gigantic ridge of rock between me and the possible caldera of this \u003C/p\u003E\u003Cp\u003Elittle island, so I guess I\u0027ll drive around it.\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK. Keep your eye on the road.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Always do, mon Capitan. Always do. Aldner out.\u0022\u003C/p\u003E\u003Cp\u003EBelow, the drive around the ridge looked longer but less steep to the north, so off Aldner went for some contour driving. This actually got quite steep in places, but nothing the BirdDog couldn\u0027t handle. Aldner even got out and took some samples on some of the slightly-less-steep areas.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bSZKFd2.jpg\u0022 alt=\u0022bSZKFd2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rGRnfup.jpg\u0022 alt=\u0022rGRnfup.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI got a little rambunctious in my speed-driving after coming around and heading north and making my way down the slopes to the flatter north areas of the island...and blew both rover wheel tires. I got Aldner out to fix the tires, but when I right-clicked and chose to fix the wheel, the plane bucked up violently, slamed back down (and knocked Aldner over)... and the wheel was unfixed. I did it again...same result. Uh, oh...is there some sort of limit to how many times you can fix a wheel? No... but what was happening on this slope, with both wheels blown, is that the re-inflation of the tire would kick the nose of the rover up, and then it would smash back down and blow the tire again. Ah. So, I extended the nose gear to lift the blown tires off of the surface, and then they were easily fixed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DdXIIGt.jpg\u0022 alt=\u0022DdXIIGt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe southwest part of the island has some wide flat inland areas that would be great for mining resources (if there are any there to be mined). If I had known, I could have just landed there...but Aldner is all about saving fuel on these long trips, so he picked the first landing spot he saw. In the second picture below, Aldner drives down into the nice depression in the south central part of the island. After sampling there, and having a nap, Aldner took off south for the next island.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BCJMzNd.jpg\u0022 alt=\u0022BCJMzNd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1RasTbx.jpg\u0022 alt=\u00221RasTbx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rYP0LdD.jpg\u0022 alt=\u0022rYP0LdD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn his way to the next big island, Aldner passed a small double-island that didn\u0027t look too exciting. The next island was large and had mostly highlands...but there was a low area to the right that he aimed for. This turned out to be a large peninsula, and Aldner put the BirdDog down in a upslope landing on a moderate slope there.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Gs12f1e.jpg\u0022 alt=\u0022Gs12f1e.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Tc4it9B.jpg\u0022 alt=\u0022Tc4it9B.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022Ground control to Major Thompbles. Take your protein pills and put your earphones on.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022What?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022I just liked the sound of that. I caught a big one this time, sir. I\u0027d like to name it Macey Island, please.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022After General Macey Kerman of the Kerbal Air Force?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Yes, sir. Big supporter of the space program.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Yes he is. You\u0027re being strangely appropriate in your naming choices today, Aldner. Are you feeling OK?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Fit as a fiddle, sir. Just wanting to thank people who\u0027ve been very helpful in my career.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK. Noted. I\u0027ll send it in.\u0022\u003C/p\u003E\u003Cp\u003EMacey Island is large indeed, but it has high ridges and very steep sides (once you get beyond the peninsula and adjoining low inland area), so Aldner decided not to try driving across it. I\u0027m sure this was disappointing to the geologists because there was an interesting caldera feature on the far east end of the island...but Aldner figured he might pick that up on the way back home, if he had the fuel. Instead, he drove south along the big peninsula and the low inland area to get samples, then took off for the next island south.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xQ4ZFYy.jpg\u0022 alt=\u0022xQ4ZFYy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4ZiI7pP.jpg\u0022 alt=\u00224ZiI7pP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/X7JeWIM.jpg\u0022 alt=\u0022X7JeWIM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe next island south also was mostly rough highlands, but there was a peninsula poking out to the west. The peninsula had a pronounced ridge, but it flatted out on one side into a suitable landing area. Aldner drove the rover to the mainland of the island, then up over a ridge into a smooth depression (in the center of the second picture below). The ridge would make a good seawall protection against tsunamis for a base area here. He decided to spend the night.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1TrBlQf.jpg\u0022 alt=\u00221TrBlQf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2nnC0ZN.jpg\u0022 alt=\u00222nnC0ZN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4TPo7kI.jpg\u0022 alt=\u00224TPo7kI.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022Yo, Thompbles.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Hi, Aldner. I expected you to call sooner.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022The satellites were not in view when I landed. Rude of them, I say.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022We have more on order. Friendlier ones.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Good to hear. I\u0027m naming this Dean Island, after Admiral Dean Kerman of the Kerbal Navy. Those Navy types with their carriers sure come in handy when you land your spaceship in the ocean and need a ride home.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK, Aldner. A good island?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022This part\u0027s OK. It does have the advantage that the giant green thing in the sky is not hanging right over my head all the time. It\u0027s closer to the horizon where a well-behaved gigantic green thing should be.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK, Aldner. Have a good night\u0027s sleep.\u0022\u003C/p\u003E\u003Cp\u003EThe next day, after a little more sampling, Aldner took off and headed east and a bit south. The parts of Dean Island that he passed over were not overly inviting. Below we see his next target rising into view far to the east.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/K0IxkWi.jpg\u0022 alt=\u0022K0IxkWi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe next island turned out to be a bit of a problem, with no low-lying smooth landing sites. So this was going to require a landing in the highlands, which did not look overly smooth. In fact, this was the first island where Aldner wasn\u0027t able to find a suitable landing spot on his first pass. But after his pass low over the highlands to check things out in more detail, he came back around a put the plane down in a scooped out area with a slight downslope. It wasn\u0027t very big, so he came in low over the bordering south ridge, then landed. Downhill landings entail a longer runout, but he did it with room to spare.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kPckHgN.jpg\u0022 alt=\u0022kPckHgN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8VbDHwC.gif\u0022 alt=\u00228VbDHwC.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022Captain Thompbles. Pick up the phone, please.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022What\u0027s up, Aldner\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Eventually landed. Please submit the name Harv Island for this bumpy piece of land.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022After which Harv Kerman?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022After Harv Kerman, President of HOC Aerospace, makers of fine aircraft components.\u0022\u003C/p\u003E\u003Cp\u003EBelow, Harv Island with an arrow showing Aldner\u0027s landing path. The terrain was kind of rough, so he did not stay long. This island was as far south as Aldner got on this trip, with the landing site at 55 degrees south latitude.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UXcacDQ.jpg\u0022 alt=\u0022UXcacDQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner headed east and a little north to the next island. There was a fine view of Vall and Tylo to enjoy as he flew. There was a low area on the north side of the island, so he landed the BirdDog there. The third picture below shows an overview of the island looking from the south end.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FkeF1ax.jpg\u0022 alt=\u0022FkeF1ax.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/k97Kp8e.jpg\u0022 alt=\u0022k97Kp8e.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gWxce4B.jpg\u0022 alt=\u0022gWxce4B.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022Aldner to Thompbles. Come in, O Mighty Chief.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Hello, Aldner. Does another new island want to come home with you?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022This one\u0027s kind of small, and fairly rough. I\u0027d like to name it Danny after Danny Kerman, the greatest actor from the silent movie era.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Hold it right there, Buster. Keaton Kerman was the greatest actor of the silent film era.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Oh, I know there are some who say that, sir, but I like Danny 2,462 times more than Keaton Kerman. Danny\u0027s films are much funnier.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022A rather precise claim. But so noted. Are you staying for the night?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022No. I\u0027ll get samples then make the short hop north to the bigger island.\u0022\u003C/p\u003E\u003Cp\u003EIndeed, with Kerbol low in the sky (and soon to set behind Jool sitting low in the western sky), Aldner made a short flight across to the next island. The peninsula he was targeting looked rather rough, so he aimed instead for a low area where that peninsula connects to the main body of the island and landed the BirdDog near a small lake there.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nnmI0hn.jpg\u0022 alt=\u0022nnmI0hn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/k4HivzE.jpg\u0022 alt=\u0022k4HivzE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yNRzmlF.jpg\u0022 alt=\u0022yNRzmlF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022And...I\u0027m down for the night.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Roger, Aldner. I copy you down. You haven\u0027t done much roving on the last few islands. Are you going to leave this one without much of a look-over as well?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Ah, I hear you, O Subtle One. No...this one looks like a keeper. I do a lot of roving tomorrow.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022And the name?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022What? Oh. Just \u0027Keeper Island\u0027 is fine. Now I need some supper.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK, if that\u0027s what you want. Eat safely.\u0022\u003C/p\u003E\u003Cp\u003EBelow...Keeper Island, as seen from the south. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BvXS0DO.jpg\u0022 alt=\u0022BvXS0DO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESoon after landing, Kerbol sets behind the bulk of Jool. And off to the northwest, Aldner notices that Vall and Tylo are shortly going to have an alignment. Unlike the last alignment I saw from GasStation3, this one happened for a manned ship so that I could view it zoomed in from cockpit view. Below is an animated GIF of Vall passing in front of Tylo (with Tylo held still for the image), Also, unlike my previous Vall/Tylo alignment image, this one was taken from 48Ã‚Â° 30\u0027 South latitude, so Vall does not pass right in front of Tylo.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/h5G7Y65.jpg\u0022 alt=\u0022h5G7Y65.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TnV45gf.jpg\u0022 alt=\u0022TnV45gf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/B0oB86b.gif\u0022 alt=\u0022B0oB86b.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs long as I was doing some astronomical observations, I also spotted a flickering pixel near Jool (lined up over the tail of the plane in the image below) that is the moon Bop. And the picture below that shows the view from the cockpit at maximum zoom...the disc of Bop is visible. And the final astronomical observation (third image below) shows the flickering pixel of the moon Pol that was visible the next morning.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HA9vTc0.gif\u0022 alt=\u0022HA9vTc0.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SALWAI3.jpg\u0022 alt=\u0022SALWAI3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5PUFzI8.gif\u0022 alt=\u00225PUFzI8.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe next day, Aldner drove northward across the island. The north slope of the island is a long moderately steep incline, so Aldner decided to have some fun. He lowered the nose gear and let the BirdDog start rolling faster and faster. At just below 50 m/s, it lifted off and started gliding. He then kicked in the jet engine at 1/3 throttle, and headed north.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LeilatD.jpg\u0022 alt=\u0022LeilatD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IJdS3iM.jpg\u0022 alt=\u0022IJdS3iM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe island to the north was a moderately small, long and narrow island. The geologists wanted samples from this once since not not on the rim of the big Laythe Impact Feature, but slightly inside, so Aldner landed near the central bay area of the island.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/96F8U6d.jpg\u0022 alt=\u002296F8U6d.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022Yo, Thompbles. This is Aldner checking in.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Morning, Aldner. What\u0027s up?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Oh it\u0027s much later in the day in this neck of the woods, sir. I just made the flight over to the next island north. Small. Sandy. But a nice looking place.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022What are you going to name it?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Another name? I\u0027ve done almost two dozen of these things already.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Well, you don\u0027t HAVE to name it...\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022No, that\u0027s fine. I\u0027ll just call it 24.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u002224?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Yes, sir. Excellent hearing there. I\u0027m going to do some roving. Aldner out.\u0022\u003C/p\u003E\u003Cp\u003E24 Island has a smaller island off its northwest end, so Aldner swam the approximately 280 meters there, just for giggles. Then he swam back, hopped in the BirdDog, and headed off for another island. Since his fuel level was down below 50%, mission rules dictated that he start heading back toward Manley base, but he was allowed to stop at other islands along the way.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Vu0JQwV.jpg\u0022 alt=\u0022Vu0JQwV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PnzEVSt.jpg\u0022 alt=\u0022PnzEVSt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAldner: \u0022Yo, Thompbles. How\u0027s things back at base?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Hi, Aldner. All\u0027s well. Everything going well on your end?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Things are fine. Except I missed lunch. I could go for some fried chicken about now*\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Well, you\u0027ll have to eat mush like the rest of us.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022I\u0027m going to name the next island Chicken Island.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Chicken Island? You\u0027re a bit strange today, Aldner.\u0022\u003C/p\u003E\u003Cp\u003E(Thompbles writes the name on the map and ponders the result.)\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Ah. I see now. The Chicken Keeper 24-hour grill at KSC Town does serve the best fried chicken around.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Now that you mention it, that\u0027s true, sir. And Rubylee often gives free meals to her favorite astronauts.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022You don\u0027t say. Well, bon appetit.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Thank you, sir. Busy now...coming in for landing. BirdDog out.\u0022\u003C/p\u003E\u003Cp\u003E*Now don\u0027t argue with me about whether or not kerbals have chickens. You\u0027ve heard all those birds around the Kerbal Space Center, so I\u0027m sure they have some form of domesticated poultry, so the name \u0027chicken\u0027 will do fine for that.\u003C/p\u003E\u003Cp\u003EChicken Island is a good sized island, most of which is relatively smooth highlands, but Aldner found a nice beach on the northeast shore to land on. He then drove up onto the high plateau, then over to the northwest corner of the island where a peninsula reaches out toward Macey Island. In fact, I could not tell from my maps for sure if Chicken and Macey were actually disconnected islands.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lFjP8uy.jpg\u0022 alt=\u0022lFjP8uy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RDgK4tl.jpg\u0022 alt=\u0022RDgK4tl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, Aldner drives down to the peninsula area between Chicken and Macey Islands. The overview images below, looking back towards Chicken island, shows that there is indeed a gap between the two islands. Aldner spent the night on the peninsula.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LdfEPhC.jpg\u0022 alt=\u0022LdfEPhC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lLV5zJ0.jpg\u0022 alt=\u0022lLV5zJ0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the morning, Aldner took off from Chicken Island for a short flight north along the east coast of Macey Island. The big caldera in the eastern part of Macey Island appears to have blown outward to the east, so it provides a corridor to the caldera from the shore. Aldner sets the BirdDog down on the beach.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qKWQuKK.jpg\u0022 alt=\u0022qKWQuKK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hCH34l2.jpg\u0022 alt=\u0022hCH34l2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vav47rn.jpg\u0022 alt=\u0022vav47rn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe drive up into Macey Caldera involves topping the ridge (about a kilometer high), and then down into the caldera (which reaches a low point of 418 meters). After some sampling and lunch, Aldner takes off on the final leg of his expedition, back to Manley Island. He passes over another small island north of Macey, as he heads north at 9,500 meters.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HL9OMbz.jpg\u0022 alt=\u0022HL9OMbz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cxXs5ZZ.jpg\u0022 alt=\u0022cxXs5ZZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dPkCdru.jpg\u0022 alt=\u0022dPkCdru.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow: Aldner safely back at Manley Base. He returned with 74 units of fuel, so he had used 226 units of jet fuel for this expedition.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/F2OFRaJ.jpg\u0022 alt=\u0022F2OFRaJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd a nice map:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NN4SRvd.jpg\u0022 alt=\u0022NN4SRvd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENext Installment... \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPart 12:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EA tale of woe and jeopardy...and surprise snacks from the heavens.\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-07T06:57:10Z\u0022 title=\u002207/07/2013 06:57  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 7, 2013\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EmissionGeneration","CreatedById":71859,"CreatedDateTime":"2013-07-06T18:13:42Z","Content":"\n\u003Cp\u003EThese are simply Amazing, and again, can\u0027t wait for the next Installment. Do you have any other Missions like this you\u0027ve worked on in the Past, or is this the first?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-06T18:17:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003ELong-term Laythe Mission - Part 12\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003ETL;DR version: A tale of woe and jeopardy...and surprise snacks from the heavens.\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAfter Aldner returned from his Southeast Expedition from Manley Island, it was time for Nelemy to make his Northwest Expedition from Fido Base on Dansen Island. Nelemy\u0027s general plan is shown below. Of special interest is the island on the bottom-left of the map: An equatorial island that is being considered for a second base on Laythe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pzRkB1F.jpg\u0022 alt=\u0022pzRkB1F.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy again carefully checked out and packed the BirdDog2, then lit the fire and took off to the north. He actually ran into a spot of trouble right away while flying north at about 9,500 meters. I was off messing around in map view and when I came back I found the plane pitched straight up and zooming upward over 10,500 meters, and I couldn\u0027t get it back under control. But after trying all sorts of things (\u0022I\u0027ve tried A! I\u0027ve tried B! I\u0027ve tried C! I\u0027ve tried D! Tell me what else I can try!\u0022), I managed to to roll out into stable flight at 5,000 meters... and Nelemy could continue on his way. Sorry about that, Nelemy. But he got safely to the northern arc of Jenlan Island. There was no need to name this island because it was one of the three large islands named for the crew of the first kerbal expedition to Laythe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YJfWEES.jpg\u0022 alt=\u0022YJfWEES.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W4fTfn8.jpg\u0022 alt=\u0022W4fTfn8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy was able to land the BirdDog2 easily on a peninsula that jutted south from the north arm of Jenlan Island. Geologists were particularly interested in getting some samples from here to see if the large circular feature of the island was an impact feature or volcanic.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/B3Vfkp8.jpg\u0022 alt=\u0022B3Vfkp8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cxJcKAY.jpg\u0022 alt=\u0022cxJcKAY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oUgz5JM.jpg\u0022 alt=\u0022oUgz5JM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022BirdDoggie to Thompbles! I\u0027ve landed on Jenlan, and I\u0027m heading off to the big ridge. It looks steep!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Roger, Nelemy. You don\u0027t have to go all the way up. Just get samples from the base of the ridge.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Roger wilco, Dude!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SBoXTNL.jpg\u0022 alt=\u0022SBoXTNL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy did some contour driving up and around the ridge (it looks like a mountain in the picture below, but that\u0027s just the end of a long, high ridge line). The slope started getting pretty steep, and looking ahead showed it would get even steeper, so Nelemy got some samples at that point. Then he took a page from Aldner\u0027s book of tricks and turned downhill and let the BirdDog2 roll faster and faster until it took off before he even started the engine.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fVEOlHD.jpg\u0022 alt=\u0022fVEOlHD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, Nelemy flew across the huge Jenlan Bay, and then continued westward over the island.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VzjJ67e.jpg\u0022 alt=\u0022VzjJ67e.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yo, Thompbles, Dude!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Yes, Nelemy. What\u0027s up?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I\u0027m leaving Jenlan island. The areas all around the bay looked steep and no-fun-rugged, but Jenlan\u0027s backside is much nicer looking, with some wide smooth areas.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I\u0027m sure he\u0027ll be happy to hear that.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude, I\u0027m talking about the island!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I copy.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022There are some small islands off to my left. This close one looks kind of rugged, but the ridges all run the same direction...it would probably be possible to land if you were to come in parallel to them.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Are you going to land there?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022No, Dude! I\u0027m just scouting out big islands. Just making a report, Dude.\u0022\u003C/p\u003E\u003Cp\u003EBelow: Jenlan\u0027s backside, and a couple small islands Nelemy passed on his way to the next island.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tNtvU0K.jpg\u0022 alt=\u0022tNtvU0K.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yZ54tyq.jpg\u0022 alt=\u0022yZ54tyq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy was originally aiming for the peninsula shown below, but it looked too rough, so he flew on further and brought the BirdDog2 in for a landing on the beach of the bay south of the peninsula. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Rgd7uJU.jpg\u0022 alt=\u0022Rgd7uJU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cqs7WuX.jpg\u0022 alt=\u0022cqs7WuX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Thompbles calling BirdDog2. Come in.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yo, Dude... This is BirdDoggie. What can I do for you?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Telemetry showed that you came to a stop, but you didn\u0027t report in. How\u0027s it going?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022No problems, Dude. I just decided to have lunch. Oh! I want to name this place Adly Island, after our good friend, Adly Kerman, the first kerbal to return from Eve, AND the only kerbal to have visited Magic Boulder. The guy is awesome.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Roger, Nelemy. I\u0027ll send it in.\u0022\u003C/p\u003E\u003Cp\u003EBelow is an overview of the south part of Adly Island. The bulk of the island is highlands far off to the north, on the horizon in this view. The arrow shows Nelemy\u0027s landing path. Nelemy puttered around a little, bagged a few rocks, and had second lunch. After a little roving, he got bored and decided to take off to the next island.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gEfjG8V.jpg\u0022 alt=\u0022gEfjG8V.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy came in for a landing on a peninsula at the north end of the next island. The slope of the land right at the shore was a little steep, but he just had to fly over the lip of sand and land into the flat area beyond.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6DM42uM.jpg\u0022 alt=\u00226DM42uM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/M3dRycr.gif\u0022 alt=\u0022M3dRycr.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yo, Thompbles...come in!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Hi, Nelemy. All is well?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yeah, no worries. I\u0027ve landed on the next island, and I\u0027d like to name it Bobgan Island after Bobgan Kerman, the first kerbal to land on Dres, and a good buddy of mine.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK, Nelemy, I\u0027ll log that. Nelemy, I can\u0027t help but notice that you are going through these islands pretty fast and not really doing much exploration. We\u0027re using up all this jet fuel so you can do a more thorough investigation of these islands.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude, OK. I\u0027ll do more roving around a collecting samples. Sorry.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022And don\u0027t forget the take pictures to document the sampling locations.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Oh, yeah! The camera. I think it\u0027s in snack bag #4. I\u0027ll do that!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK. Drive safely, and keep in touch. Laythe Base out.\u0022\u003C/p\u003E\u003Cp\u003ESo Nelemy spent some time roving along, occasionally stopping to collect samples and leave candy wrappers on the landscape. Below, we see the BirdDog2 coming to a lake on the western shore that misses being a bay because of a rather narrow strip of land dividing it from the ocean. Nelemy gets out to check the water, but finds that it has the usual \u0022bottom of the helmet\u0022 density. (I should write a paper on using floating kerbals as hydrometers.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yG0FSEO.jpg\u0022 alt=\u0022yG0FSEO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fN98jFJ.jpg\u0022 alt=\u0022fN98jFJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, an overview of Bobgan Island seen from the south. Nelemy landed on the peninsula at the north end, rovered along in the rougher terrain over to the little lake on the far left, then to the lake in the middle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yHqJQet.jpg\u0022 alt=\u0022yHqJQet.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter spending some time by the central lakes of Bobgan Island, Nelemy took of for the next island.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cz3KAt0.jpg\u0022 alt=\u0022cz3KAt0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt the next island, Nelemy came in to the low area surrounding a round lake that was separated from the ocean by a ridge. The ridge made the ocean shoreline steep, so Nelemy banked around to land by the left lake shore parallel to the ridge...but was going to overshoot, so he kept going across the lake and landed on the opposite shore.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XZJG2gN.jpg\u0022 alt=\u0022XZJG2gN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Xn8qpD0.jpg\u0022 alt=\u0022Xn8qpD0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yo, Thompbles, Dude...Answer the phone.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Hi, Nelemy. What\u0027s up?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I\u0027ve safely landed on the next island. I\u0027d like to name it Milski Island after Milski Kerman, the first kerbal to land on Gilly, and a good friend of mine.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK, Nelemy, I\u0027ve got it. Be sure to drive safely. Base out.\u0022\u003C/p\u003E\u003Cp\u003EBelow is an overview of Milski Island, henceforward also known as \u003Cspan style=\u0022color:#FF0000;\u0022\u003EThe Island Of Doom\u003C/span\u003E (cue ominous music). #1 marks where Nelemy landed. #2 marks the spot where the ominous music is emanating from. There...how\u0027s that for subtle foreshadowing?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OpD34Ja.jpg\u0022 alt=\u0022OpD34Ja.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, Nelemy takes BirdDog2 up the slope of a ridge with an unusual saw-tooth top...like the teeth of a skull. The sky is a dark and ominous clear sunny blue, and a flock of vultures is strangely not seen circling overhead. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pSOJl4f.jpg\u0022 alt=\u0022pSOJl4f.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOK... this was actually my second time driving the rover up this ridge. The first time, I was zipping along a 3X phys warp, and I flew over the top and smashed down into a sharp valley on the other side, ripping off a wheel. OK...I\u0027m not going to hold that against Nelemy (see my note about my rules for driving rovers on Laythe in Part 11)... so this was the re-do, with me driving safely along at 1X speed, following the contour up the slope and around the end of the ridge. But what I thought was the last peak on the ridge was not. And I was coming along a bit too high. So when I turned the corner expecting some more slope, I found myself with the BirdDog2 straddling along the sharp top of a ridge. Arrgh! Nooooo! Turn!\u003C/p\u003E\u003Cp\u003EToo late. The rear end of the rover/plane bottomed out on the ridge and ripped off the jet engine. It\u0027s the small black thing rolling slowly and mockingly down the far side of the ridge. So much for my safe-driving re-do. I was screwed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VYNLW88.jpg\u0022 alt=\u0022VYNLW88.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Thompbles! Dude! I\u0027m sorry! I\u0027m sorry!\u0022 *master alarm sounding in the background*\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Nelemy? What\u0027s wrong?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I\u0027m sorry, man! I was trying to be careful! I was!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Calm down, Nelemy. What happened.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude...I was driving over a ridge and bottomed out! There was a ripping noise. My engine indicators are all red.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK, just take it easy.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022I\u0027m stranded without that engine. I can\u0027t get back home!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I know. Look, don\u0027t worry. We have rescue options. Don\u0027t worry. First, get out and check the damage. Maybe only the sensors are damaged.\u0022\u003C/p\u003E\u003Cp\u003EAlas, no. Nelemy carefully rolled back, then got out to get a look at the damage. Engine off. That BirdDog is never flying anywhere again.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ernpw9B.jpg\u0022 alt=\u0022ernpw9B.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HflifTN.jpg\u0022 alt=\u0022HflifTN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Nelemy to base.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I\u0027m here, Nelemy. What did you find?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yeah, Dude, I screwed the pooch. The engine is ripped right off the back of the plane.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK. Get back on board and see if you can carefully drive the rover off of that ridge. Go slow.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022OK, Dude.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022I\u0027m going to need you to scout around with the rover and find the best landing location on the island. We\u0027ll need to send you a rescue ship. Could be the SSTUBBY, or maybe Aldner\u0027s BirdDog piloted remotely. We have multiple options. Don\u0027t worry. I\u0027m working on the problem.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022OK, Dude. Thanks, man.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Laythe Base calling Fido. Kurt, are you there?\u0022\u003C/p\u003E\u003Cp\u003EKurt: \u0022Yeah, Thombles. What\u0027s up?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Nelemy had a roving accident. I need you to come back and help me plan the rescue.\u0022\u003C/p\u003E\u003Cp\u003EKurt: \u0022Is he OK?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Yes, he\u0027s fine. Lost the jet engine while roving. Roving still works. But we need to arrange to get him back here. We\u0027ll use the SSTUBBY to retrieve him. but I could use your help with the maneuvers. And he\u0027ll need to be coached in flying the ship.\u0022\u003C/p\u003E\u003Cp\u003EKurt: \u0022Roger. I\u0027m on my way back now.\u0022\u003C/p\u003E\u003Cp\u003EBelow, Kurt in the Fido, exploring the plateau area east of Joysina Lake. The area is not perfectly flat, but has large flatsections separated by low ridges. A good place for a base or mining operations, especially because it\u0027s near the equator and high up where tsunamis couldn\u0027t touch it. But that report is forgotten for now as Kurt drives back to base quickly, but carefully.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LFizbYX.jpg\u0022 alt=\u0022LFizbYX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XM6mQW3.jpg\u0022 alt=\u0022XM6mQW3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vUcB6Ic.jpg\u0022 alt=\u0022vUcB6Ic.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Laythe Base calling Aldner. Laythe Base calling Aldner.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Thompbles? It\u0027s the middle of the night. What\u0027s up?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Sorry to wake you. Nelemy knocked the engine off of his BirdDog on top of a ridge. We are going to try to use the SSTUBBY to retrieve him, but if that fails I\u0027ll need you to fly back here in your BirdDog, and then pilot it remotely to pick him up. Hopefully that won\u0027t be necessary. But exploration flights are on hold for now, and please monitor the radio in case you have any suggestions.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022OK, understood. Nelemy\u0027s OK, I take it?\u0022\u003C/p\u003E\u003Cp\u003EThhompbles: \u0022Yes, he\u0027s fine. I\u0027ll be in touch. Base out.\u0022\u003C/p\u003E\u003Cp\u003EOK. Rescue plan step 1: The SSTUBBY is a small SSTO rocket that is parked at Laythe Space Station. It can land via parachute, then boost back into orbit. BUT, in order for it to have maximum fuel to make orbit, it can\u0027t use too much for reentry and landing. So in order to get it into a orbit where it can reach Nelemy at 23 degrees north latitude, one of the nuclear Tugs was needed to move SSTUBBY into position. Below, Laythe Tug 9, which has been parked in a 90 km orbit since it delivered its payload (the BirdDog2 and GasStation3) to Laythe. It has over 1500 units of fuel onboard, which should be plenty for the operation. Thombles started by adjusting Tug 9\u0027s orbit to rendezvous with Laythe Station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2Kwrohy.jpg\u0022 alt=\u00222Kwrohy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce Tug 9 got to the station, Thompbles remotely docked it to the rear end of the SSTUBBY (the SSTUBBY still had an adapter and docking port covering its rocket engine, so there was no need to undock the SSTUBBY first).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yY0vwkO.jpg\u0022 alt=\u0022yY0vwkO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/z3HFakE.jpg\u0022 alt=\u0022z3HFakE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext, the Tug needed to take SSTUBBY and change its orbital plane to pass over Milski Island. BUT, plane change maneuvers are very expensive in the low orbit where Laythe Space Station lives, so first the Tug boosted SSTUBBY out to an 800 km orbit, then did the plan change maneuver there (see below). Possibly some other altitude would have been more optimal, but I guessed that 800 km would work. Still...plane change maneuvers take a lot of propellant, especially when the SSTUBBY is fully fueled and heavy.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y1RtyKl.jpg\u0022 alt=\u0022y1RtyKl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter scouting around in the rover, Nelemy determined that the best landing area would be the wide shallow bowl area south of the ridge where he lost his engine.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qsYNLrc.jpg\u0022 alt=\u0022qsYNLrc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, the SSTUBBY separated from the Tug. Then it separated the separator and docking port that was covering its rocket engine.....which popped across and re-docked itself to the Tug. Tricksy little separator. OK...I\u0027ll separate that from the Tug later.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ddHJCpv.jpg\u0022 alt=\u0022ddHJCpv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/g0xfHvS.jpg\u0022 alt=\u0022g0xfHvS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen it was a matter of waiting for Laythe to rotate Milski Island under the SSTUBBY\u0027s orbit...and with Kurt remotely controlling the ship, the rocket engine was fired to drop it from orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bSnS8nO.jpg\u0022 alt=\u0022bSnS8nO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe SSTUBBY descended at a steep angle toward Milski Island (at the top of the image). The landing trajectory is shown below.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/V1t5BD8.jpg\u0022 alt=\u0022V1t5BD8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VBuVrsp.jpg\u0022 alt=\u0022VBuVrsp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe steep entry angle from the 800 km orbit caused a great entry flame show, followed by Mach effects. I\u0027m glad I don\u0027t yet live in a universe with deadly reentry heat damage effects.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/te8yvPk.jpg\u0022 alt=\u0022te8yvPk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe parachutes were deployed in reefed condition...then the landing legs were extended.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gIqTi6u.jpg\u0022 alt=\u0022gIqTi6u.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ri9Vcuu.jpg\u0022 alt=\u0022ri9Vcuu.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, the parachutes are fully deployed, and the SSTUBBY lands at 8.3 m/s...which is a bit bouncy, but the gear can handle it. The SSTUBBY landed 3.5 km from Nelemy\u0027s rover (and 7.5 km from the jet engine on the ridge top).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OlP4erD.jpg\u0022 alt=\u0022OlP4erD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iNxOmAo.jpg\u0022 alt=\u0022iNxOmAo.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XQyWDix.jpg\u0022 alt=\u0022XQyWDix.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy drove over to the SSTUBBY and climbed on board to start doing system checks with Kurt over the radio. They started what would be a couple days of checkouts and simulations to get Nelemy familiar with the ship and the maneuvers planned.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/w8eLiaG.jpg\u0022 alt=\u0022w8eLiaG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3HOoe7i.jpg\u0022 alt=\u00223HOoe7i.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4nZoQzl.jpg\u0022 alt=\u00224nZoQzl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Wait...what, Dude? What do you mean I\u0027m going to have to spend two months in the Space Station?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022This is all using a lot of fuel. So to minimize the fuel usage, we\u0027ll have you wait in the space station until the new large base module arrives...then you can ride down in that when we land it here.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022But, Dude! Two months? I don\u0027t want to spend two months alone in the space station. Why can\u0027t I just use the SSTUBBY to come back down to Fido Bay?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Because that would use up another 10 tons of fuel and oxidizer to bring the SSTUBBY down and back up again...but its free if we bring you down in the new base station when it arrives. You\u0027ll be doing useful things in the station...we need some better imaging of some areas from orbit and some other things.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Man...this sucks.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Yo, Thompbles. There is an alternative method.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Aldner? Dude! What\u0027s the alternative method?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022The two Lewis and Clark landers from the original Laythe expedition are still in orbit. I\u0027ve been looking over the misson reports, and both landers have enough RCS fuel to deorbit and land on Laythe via parachute.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Cool! Let\u0027s do that!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022What? Those landers are over 14 years old. Besides, Nelemy hasn\u0027t been checked out on that hardware.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude! I landed on Pol with a Lewis lander, if you\u0027ll remember. I could fly one of those things blindfolded.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022The Laythe landers had a different configuration. Besides...didn\u0027t they drop their landing gear with their side tanks?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022He won\u0027t need landing gear. The main bodies of those landers have four chutes. They would land softer than they originally did.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022And what happens when it lands and the chutes cut off...and it falls over and smashes the capsule on the ground?\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Not a problem. I\u0027ve studied the engineering diagrams. The CoM is located ahead of the chute mounts. It will land nose first.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022See? No problem, man!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK...how about landing guidance? Those landers were flown long before we had our landing guidance computers.\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Again, not a problem. We have the aiming points used by the original crew. And we can simulate using our computers.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022But...14 year old hardware...\u0022\u003C/p\u003E\u003Cp\u003EAldner: \u0022Look...the landers are in a 260 km orbit. The Tug needs to bring the SSTUBBY back down to the space station\u0027s orbit anyway, so it won\u0027t cost any more delta-V to stop there along the way. Nelemy can check out the landers. And if the systems are still good, he can use this option. If there are any problems, he\u0027ll just quietly go to the space station and wait like a good little astronaut.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Yeah! Deal!\u0022\u003C/p\u003E\u003Cp\u003EBelow...Aldner at Manley Base, coming up with crazy ideas. Otherwise he wouldn\u0027t have had much of a part in this episode.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vsezzCb.jpg\u0022 alt=\u0022vsezzCb.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway... First we have to get Nelemy back into orbit. This involved some prep work (like making sure all the parachutes on the SSTUBBY were repacked in case anything went wrong and they\u0027d be needed). It also involved waiting for Laythe to rotate and line up Milski Island again with the orbit of the Tug. This was simple because it wasn\u0027t necessary to wait for the Tug to be in the correct position in the orbit...the Tug would drop down later to pick up the SSTUBBY, and it would match as needed then. So with the orbit passing overhead, Nelemy started up the SSTUBBY\u0027s jet engines at full throttle. Just as it started lifting off, he kicked in the rocket engine and boosted the ship up to 80 m/s, then cut off the rocket engine. Below, we see the initial boost, and the landing gear starting to fold up.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/p73zCvr.jpg\u0022 alt=\u0022p73zCvr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, the jet engine phase of the boost as the SSTUBBY is lifted up to 13 km on the fuel-sipping jets. Then the rocket engine was ignited again and the jet engines were shut down before they could flame out. The SSTUBBY continued on into orbit on rocket power.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2cDUDp5.jpg\u0022 alt=\u00222cDUDp5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LGaUCX6.jpg\u0022 alt=\u0022LGaUCX6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022All right! I\u0027m in spaaaaaace! 74 by 84 km orbit, within a couple degrees of the Tugs orbital plane! I have some fuel left, so I\u0027ll circularize at 84 km if I can.\u0022\u003C/p\u003E\u003Cp\u003EKurt: \u0022Great job, Nelemy. You did good.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Right on, Dude! Now send that Tug for me. I have a lander to go inspect!\u0022\u003C/p\u003E\u003Cp\u003ETime for some more orbital ballet with the Tug. Out in its big orbit, it did a small plane adjustment, then dropped in to rendezvous and dock with the SSTUBBY. It\u0027s times like this that I really appreciate the fuel-frugal nature of nuclear engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/szEalC9.jpg\u0022 alt=\u0022szEalC9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RPjKH4T.jpg\u0022 alt=\u0022RPjKH4T.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext, the Tug boosted the now-much-lighter SSTUBBY (and now-lighter Tug) into an elliptical orbit with its apoapsis 800 km above the equator. This orbit was not circularized...it was just so the plane shift burn could be made far out where it\u0027s cheap to do so. Once the big elliptical orbit was back over the equator, the Tug was used to rendezvous with the old Lewis and Clark landers, which were docked together in a 260 km equatorial orbit 14 years ago when the original crew left them behind.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/w3rMxZ7.jpg\u0022 alt=\u0022w3rMxZ7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NGUwxGq.jpg\u0022 alt=\u0022NGUwxGq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy EVA\u0027d over to the old landers while the Tug and SSTUBBY maintained stationkeeping. Nelemy made sure all the parachutes were packed, then got onboard the Lewis lander.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WWMU3OQ.jpg\u0022 alt=\u0022WWMU3OQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SyXJCir.jpg\u0022 alt=\u0022SyXJCir.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Nelemy to base! I\u0027m on board the Lewis lander. Man, this brings back memories.\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022OK. First, start checking out the systems.\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude! The snack compartment is almost full!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022THAT\u0027s the first thing you checked??\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Dude! There are ChocoGoober bars in there! They haven\u0027t made those in years!\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Look, Nelemy, just start checking the systems. Um... are there any Cit Cat bars in there?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Let\u0027s see... Yup! You want me to bring you some?\u0022\u003C/p\u003E\u003Cp\u003EThompbles: \u0022Um...sure. But let\u0027s do the system checks now.\u0022\u003C/p\u003E\u003Cp\u003EWell, who would have believed it? All of the systems seemed to work perfectly. The RCS tanks were 89% full...more than enough. There was even 1.2 units of fuel left in the main engine tanks. Test firings of the RCS thrusters showed they worked fine. Amazing. So Thompbles moved the Tug away, and Nelemy separated the Lewis from the Clark and oriented for the retro burn.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1U2HgFN.jpg\u0022 alt=\u00221U2HgFN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe old mission records from the first Laythe landings showed where the trajectory had to be aimed out beyond Dansen Island to drop the ship onto the island from the same 260 km orbit it was still in (since that was the orbit the Mark Twain was in that released the Lewis lander, and to which the Lewis lander returned). Nelemy would have to start the retro burn right above Ocean Probe 8. First he fired the main engine to use up the small amount of fuel it had (he hadn\u0027t tested this, but it wouldn\u0027t have mattered if it failed to fire, since there was enough RCS to bring the ship down). The LV-909 fired and quickly burned out. Then Nelemy used the RCS to complete the retro burn. The trajectory needed to be adjusted until it was about twice the distance from the east coast of Dansen as Mariliza Island is located. Ah, the memories.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W94dofG.jpg\u0022 alt=\u0022W94dofG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cytvVGW.jpg\u0022 alt=\u0022cytvVGW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, the Lewis lander is on a descent course as Jool rises above the horizon. Nelemy oriented the ship tail first...although he didn\u0027t expect to be able to hold that attitude because of the CoM location. Then, radio blackout as the ionization of reentry enveloped the ship. That\u0027s a sight I didn\u0027t see the last time the ship entered this atmosphere. And today it really is a REentry.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4ULGu2b.jpg\u0022 alt=\u00224ULGu2b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Edx7OjD.jpg\u0022 alt=\u0022Edx7OjD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENelemy: \u0022Whoa! Eyeballs out! Just like in the centrifuge at KSC!\u0022\u003C/p\u003E\u003Cp\u003EEven with RCS, Nelemy couldn\u0027t hold the ship tail first and it fliped around nose first, so he went from four G\u0027s of \u0022eyeballs in\u0022 to four G\u0027s of \u0022eyeballs out\u0022. Below, the Lewis passes over Fido Bay. Kurt watched his friend come over like a flaming meteor.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uRaDOW9.jpg\u0022 alt=\u0022uRaDOW9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll four chutes came out in reefed condition, and Nelemy was a happy camper. Then all four chutes fully deployed, and Nelemy floated down at 4 m/s, about 16.5 km beyond Laythe Base.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0pFOdft.jpg\u0022 alt=\u00220pFOdft.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TYNYZkh.jpg\u0022 alt=\u0022TYNYZkh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow, Nelemy used the RCS thrusters to slow the ship a little more. The ship touched down on its nose, then fell over on its side with no damage. Fourteen years later, the Lewis Laythe lander had returned to Dansen Island on Laythe!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o75JYRs.jpg\u0022 alt=\u0022o75JYRs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IsmDuCv.jpg\u0022 alt=\u0022IsmDuCv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOf course, even the best plans can go awry. After landing, Nelemy found that he could not exit the ship because the hatch was obstructed by the ground. But some quick work with the RCS thrusters fixed that. And Nelemy was out, safe and sound on Laythe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VTV1abn.jpg\u0022 alt=\u0022VTV1abn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pdgdvUL.jpg\u0022 alt=\u0022pdgdvUL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EKurt was already in the Fido and racing to the touchdown point.\u003C/p\u003E\u003Cp\u003EKurt: \u0022Look! Is that a kerbal?\u0022\u003C/p\u003E\u003Cp\u003ENelemy: \u0022You\u0027re damn right it is! Now come pick me up!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/naIboOz.jpg\u0022 alt=\u0022naIboOz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3BIE5BB.jpg\u0022 alt=\u00223BIE5BB.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow: Kurt returned Nelemy to Laythe base where Thompbles greeted them with open arms. Then they partied.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/47GHoaM.jpg\u0022 alt=\u002247GHoaM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe job isn\u0027t done until the loose ends are tied up... so after the party when Nelemy was crashed out, Thompbles took care of the SSTUBBY and Tug 9, rendezvousing them with Laythe Space Station. Once there, the SSTUBBY was separated from the Tug and docked to the station. Then the Tug was docked to the station. Of its original supply of 1511 units of fuel, the Tug had used up 856 units of fuel. That left it with slightly more fuel than it would need to return to Kerbin (but instead of offloading that fuel to the station, it was used up for this rescue). The SSTUBBY was refueled from propellant in the station\u0027s tanks.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OVwlZ3n.jpg\u0022 alt=\u0022OVwlZ3n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aajGyDV.jpg\u0022 alt=\u0022aajGyDV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wg3ITb3.jpg\u0022 alt=\u0022wg3ITb3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow I wish that I had sent out another BirdDog and GasStation in that last launch window from Kerbin instead of a secondary base station and rover. Extra BirdDogs would always be useful, and GasStations positioned on various islands would make the fleet more flexible. And while the SSTUBBY was fun, it would be more fuel efficient to do a rescue with a remote-controlled BirdDog, especially if the kerbal is stranded at a high latitude. I guess I know what I\u0027m sending out in the next launch window.\u003C/p\u003E\u003Cp\u003EOoops...Forgot the map:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VG1qjhI.jpg\u0022 alt=\u0022VG1qjhI.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-08T06:32:15Z\u0022 title=\u002207/08/2013 06:32  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 8, 2013\u003C/time\u003E by Brotoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-06T20:00:22Z","Content":"\n\u003Cp\u003EI\u0027m glad Nelemy made it back in one piece, and an antiquated piece of space hardware made it back to Kerba firma... or Laythe firma. Planning on putting a memorial around the Lewis lander?\u003C/p\u003E\u003Cp\u003E\u0027Here lays Lewis, savior of Nelemy: Breaker of jets\u0027\u003C/p\u003E\n"},{"CreatedByName":"Weegee","CreatedById":72084,"CreatedDateTime":"2013-07-06T22:34:31Z","Content":"\n\u003Cp\u003EThis series is awesome. I love all the thought that goes into the posts. I particularly enjoyed the reference to Rocky and Bullwinkle in part 11 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-06T23:28:13Z","Content":"\n\u003Cp\u003EExcellent read as always. I\u0027m glad everything ended well. Scene with old lander having it\u0027s final moment of fiery glory? Priceless. You so should place a memorial there. Even if it will get wiped out by Shockwave 21 it\u0027s still great moment.\u003C/p\u003E\n"},{"CreatedByName":"Sesni","CreatedById":50625,"CreatedDateTime":"2013-07-07T00:22:26Z","Content":"\n\u003Cp\u003EI knew all the youtuber references. Also, is 24 island a reference to 42???????\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-07-07T03:07:39Z","Content":"\n\u003Cp\u003EFantastic! The more of this saga I read, the more inadequate I see all my own pathetic efforts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI hope you get all these Kerbals back home before the Supernova of \u002721 fries the whole Kerbal system.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-07T03:34:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sesni\u0022 data-cite=\u0022Sesni\u0022\u003E\u003Cdiv\u003E?.. Also, is 24 island a reference to 42???????\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s part of the name chickenkeeper24\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2013-07-07T04:17:35Z","Content":"\n\u003Cp\u003EAwesome story as usual. Are you going to embark on a massive evacuation of all of the Laythe bases when 0.21 comes out?\u003C/p\u003E\n"},{"CreatedByName":"jocax188723","CreatedById":62648,"CreatedDateTime":"2013-07-07T07:37:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CosmicX1\u0022 data-cite=\u0022CosmicX1\u0022\u003E\u003Cdiv\u003EThose canards just look backwards, they\u0027re actually meant to be that way round. I there\u0027s a Russian jet fighter that has wings like that, but I can\u0027t remember what it\u0027s called.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s the SU-47 Berkut, I think. The US of A also built a forward swept fighter prototype named the X-29.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-07-07T10:17:28Z","Content":"\n\u003Cp\u003EI\u0027ll say it again - love your work. I was looking forward to 11 \u0026amp; 12.\u003C/p\u003E\u003Cp\u003EHad a good laugh at your physics-warp-sliding-plane. Been there.\u003C/p\u003E\u003Cp\u003EYour Tylo-Vall conjunction animated gif was awesome.\u003C/p\u003E\u003Cp\u003EKudos too for being disciplined with Quickloading. Makes for a much better story when dealing with adversity.\u003C/p\u003E\n"},{"CreatedByName":"Agent30632","CreatedById":58734,"CreatedDateTime":"2013-07-07T17:34:55Z","Content":"\n\u003Cp\u003ESo, was the jet engine why you said \u0022Oops\u0022 a few post back?\u003C/p\u003E\u003Cp\u003EAlso, I wonder what happens when Laythequake 0.21 comes (What, last time it was a Tsunami, so why not an earthquake on Lathye?).\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-07T18:56:17Z","Content":"\n\u003Cp\u003EYes. Knocking the engine off of my shiny new BirdDog was my Oops.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-08T02:37:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EmissionGeneration\u0022 data-cite=\u0022EmissionGeneration\u0022\u003E\u003Cdiv\u003EThese are simply Amazing, and again, can\u0027t wait for the next Installment. Do you have any other Missions like this you\u0027ve worked on in the Past, or is this the first?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry...didn\u0027t see your post that was sandwiched in between my posting 11 \u0026amp; 12.\u003C/p\u003E\u003Cp\u003EI\u0027ve written up all my major KSP missions. Some are posted here on the forum, but all of them can be found using the \u0022Brotoro\u0027s KSP Mission Pages\u0022 text link in my signature.\u003C/p\u003E\n"},{"CreatedByName":"GJames","CreatedById":58866,"CreatedDateTime":"2013-07-14T15:14:28Z","Content":"\n\u003Cp\u003EThese are great as usual, but I can\u0027t help but wonder what 0.21 will bring... Also, Alt-x resets aircraft trim, handy in case it gets moved around accidentally.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-07-17T16:32:37Z","Content":"\n\u003Cp\u003ESince the next 0.21 update will ultimately destroy your saves, maybe the next mission objective would be to evacuate Laythe and bring the colony\u0027s inhabitants home? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}