{"TopicId":27939,"ForumId":51,"TopicTitle":"Ion Engines Everywhere; My Attempt to Land As Many Places As Possible","CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-05-21T15:03:45Z","PageNum":1,"Articles":[{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-05-21T15:03:45Z","Content":"\n\u003Cp\u003EI decided the other day that LV-909\u0027s and Rockomax 24-77\u0027s, even LV-1\u0027s, are the coward\u0027s engines for landers. Having figured this out I started designing landers using only ion engines in an attempt to land as many places as possible. I may end up with only a few successes, but it\u0027s worth it to make the effort. \u003C/p\u003E\u003Cp\u003EI started easy and went for Minmus. The only mods here are parts from KW, and Mechjeb for the transfer stages of the later crafts. This little booster was enough to get the lander, inside the fairings now, into LKO. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Minmusiontakeoff.jpg\u0022 alt=\u0022Minmusiontakeoff.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI used the ion engines to get to from LKO to Minmus orbit. It didn\u0027t really take that long, I just made 3 or 4 consecutive burns (or discharges, maybe?) at Kerbin periapsis. The probe itself is made up of 3 ion engines, 1 xenon tank, 3 small landing legs, 2 gigantor solar panels, and a few small batteries, all of the other structural elements were covered with the small, OX-STAT panels. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Minmusiontransit.jpg\u0022 alt=\u0022Minmusiontransit.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe initial approach was easy enough, I juts had to make sure I kept in the sun the whole time. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Minmusapproach.jpg\u0022 alt=\u0022Minmusapproach.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd success, the first mission went pretty well. I didn\u0027t quite have enough power to run all 3 engines at maximum, but I had enough thrust to land.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Minmuslanding.jpg\u0022 alt=\u0022Minmuslanding.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHaving never been to Gilly I decided to head there next. This little baby got my Eve orbital transfer stage up to LKO. And I never realized that docking clamps could be angled like that, I kind of like the way that looks. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Gillylaunch.jpg\u0022 alt=\u0022Gillylaunch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFairings are awesome...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Gillyfairing.jpg\u0022 alt=\u0022Gillyfairing.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGiven Gilly\u0027s small size and proximity to the sun, I made this probe much simpler than the last one. It\u0027s made up of just 2 ion engines, a single xenon tank, 4 OX-4B panels, and a few OX-STAT panels. With the transfer stage I plotted a course to Eve.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Gillyeveorbit.jpg\u0022 alt=\u0022Gillyeveorbit.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a very high altitude encounter with Eve I set up an encounter with Gilly and jettisoned the transfer stage. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Gillyeve.jpg\u0022 alt=\u0022Gillyeve.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe approach went well enough, Gilly has a ridiculously small gravity well. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Gillyapproach.jpg\u0022 alt=\u0022Gillyapproach.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow come on, that was just too easy. I think I could have done that with a single ion engine at half power. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Gillysurface.jpg\u0022 alt=\u0022Gillysurface.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor the next mission I decided on a tougher target, also one that I\u0027ve never been to, Ike. I needed a slightly bigger rocket this time for the larger probe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Ikelaunch.jpg\u0022 alt=\u0022Ikelaunch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd after getting into orbit around Duna and dipping into the atmosphere to slow down a bit I set up an Ike encounter. This moon is huge in relation to its planet. The probe is a bit bigger this time, it has 7 ion engines, 3 gigantor panels, 3 OX-4B\u0027s and a number of OX-STAT\u0027s, still just a single xenon tank. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Ikeduna.jpg\u0022 alt=\u0022Ikeduna.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe capture and approach to Ike went well enough. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Ikeapproach.jpg\u0022 alt=\u0022Ikeapproach.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut this one never really stood a chance. Those gigantor panels are juts too heavy for how much power they give, and even then they weren\u0027t enough to fully power all 7 engines. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Ikelitho.jpg\u0022 alt=\u0022Ikelitho.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStay tuned for more as I try again with Ion Ike Lander Part Deux. Here\u0027s a small preview of my new probe lander. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/ionIkepartdeux.jpg\u0022 alt=\u0022ionIkepartdeux.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Francesco","CreatedById":58274,"CreatedDateTime":"2013-05-21T15:12:48Z","Content":"\n\u003Cp\u003Ewell this was an interesting piece to read, and I don\u0027t mean to discourage you, but your second mission to Ike is likely to fail again:\u003C/p\u003E\u003Cp\u003Ethe only places where ion engine-based ships have a TWR \u0026gt; 1 are Minmus, Gilly, Bop and Pol.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-05-22T14:24:57Z","Content":"\n\u003Cp\u003EOh ye of little faith, don\u0027t despair so easily. But I\u0027m getting ahead of myself. Let\u0027s start with my second attempt at an Ike landing. I like this design a lot, but it too has problems. A single xenon tank is just not enough to do anything with 8 ion engines, and the in-game description of the ion engine is wrong. It doesn\u0027t use 12 energy/sec, it uses 14.5, that\u0027s a big difference when every little bit of mass counts. So this mission also ended in failure. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Ionike2failedlaunch.jpg\u0022 alt=\u0022Ionike2failedlaunch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo with those issues in mind I redesigned my lander again. This time I have just 5 ion engines, but 3 xenon tanks, 2 of which will be dropped during the final descent stage. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/IonIke2launch.jpg\u0022 alt=\u0022IonIke2launch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou can see the 2 extra xenon tanks hanging below the central engine on the right here. And with 20 OX-4B\u0027s and 50 OX-STAT\u0027s I should have enough power to run all 5 engines at max (the decrease in solar panel efficiency is very slight at Duna orbit, about 1.95 energy/sec instead of 2 for the 4B\u0027s, but I still took that into account ). \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/IonIke2approach.jpg\u0022 alt=\u0022IonIke2approach.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd this is my strategy for landing. The most fuel efficient way is, I think, to come in at a shallow angle and bring your horizontal velocity to 0 around the same time you land. That obviously won\u0027t work here, I need to keep the solar panels at as close to an ideal orientation as possible. Which means landing with the sun directly overhead. To do this I have to bring my horizontal velocity down to near 0 m/s at a very high altitude, then gradually drop straight down, allowing me to come in at near full throttle. \u003C/p\u003E\u003Cp\u003EI started at an orbit around 70km above the surface and brought my horizontal velocity down, all the while keeping my vertical velocity around 50 m/s. Then I gradually reduced my vertical velocity as I dropped straight down. This is horrendously fuel inefficient, but that\u0027s why I have 2 extra tanks. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/IonIke2mechjeb.jpg\u0022 alt=\u0022IonIke2mechjeb.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt around 20km Ike\u0027s gravity becomes too powerful for 4 ion engines to counter. So I made sure that my main xenon tank was topped off and dropped the other 2, taking the mechjeb unit with them. You can see all 5 engines now activated as I continue my slow descent. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/IonIke25engines.jpg\u0022 alt=\u0022IonIke25engines.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EArrgghh!!! Of course I had to land on a hill, bounce off, and break one of my landing legs. And things only went, um, downhill from here. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/damehillike.jpg\u0022 alt=\u0022damehillike.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow back out of the simulator (upside down upon loading, of course) I\u0027ll try for real this time. I gave myself a little by of horizontal velocity in the hope that I would come down somewhere a little flatter and continued down the same as before. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Ionike2landing.jpg\u0022 alt=\u0022Ionike2landing.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMade it. This time I came down in a flat area, and slow enough not to bounce. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/IonIke2ontheground.jpg\u0022 alt=\u0022IonIke2ontheground.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll try out Bop and Pol next. The decreased efficiency of the solar panels at that distance from the sun should make things interesting. But I think those will be the only other possibilities. The Mun seems almost doable, the engines have a high enough TWR for it, but I can\u0027t figure out a way to actually power them without adding too much mass. Even using the Kosmos solar panels, which give much higher energy/ton don\u0027t work because they are too big to fit anywhere.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-05-25T00:53:55Z","Content":"\n\u003Cp\u003EFor my Pol and Bop landers I decided to just do everything at once and launch both together. Both landers are on top, the Bop lander is a bit bigger with 3 ion engines and a few extra solar panels, the Pol lander has just 2 engines and 4 gigantor panels.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/PolBoplaunch.jpg\u0022 alt=\u0022PolBoplaunch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI went for Bop first because that lander is on top. I used the transfer stage to get almost into orbit, then released the lander and finished off the orbital insertion.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Bopapproach.jpg\u0022 alt=\u0022Bopapproach.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBop is a bit treacherous being so absurdly mountainous. But, I landed easily, well, if you don\u0027t consider what happened next. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Boplanding.jpg\u0022 alt=\u0022Boplanding.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStupid hills... But the probe survived intact. It really only needs one panel once it\u0027s on the ground, so I\u0027m not doing this one over again.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Bopcrash.jpg\u0022 alt=\u0022Bopcrash.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBack to the Pol lander, I used an encounter with Tylo to get into the right inclination and bump my apoapsis up to Pol\u0027s orbit. Once in orbit I dropped the transfer stage into Pol and began my descent. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Polorbit.jpg\u0022 alt=\u0022Polorbit.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother steady approach. Pol is bit less hilly than Bop, but still fairly uneven. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/polapproach.jpg\u0022 alt=\u0022polapproach.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd another successful landing, after I stopped sliding. This time everything stayed intact though. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/Pollanding.jpg\u0022 alt=\u0022Pollanding.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd now, just because I can, I give you the manned ion lander. This seems like a good idea. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/mannedion.jpg\u0022 alt=\u0022mannedion.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI went for Minmus and landed next to a rover that\u0027s been exploring there. The lander is about the same as my first Minmus lander, I just added the chair and a few extra solar panels to let me use full thrust. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/mannedlanding.jpg\u0022 alt=\u0022mannedlanding.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA reunion on Minmus. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1191.photobucket.com/albums/z469/grandyd/Kerbal/Ion%20landers/minmusmeeting.jpg\u0022 alt=\u0022minmusmeeting.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-05-26T18:48:44Z","Content":"\n\u003Cp\u003EAwesome beat me to it. Now go do the same on Moho or Eloo \u0026gt;\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2013-12-18T03:40:40Z","Content":"\n\u003Cp\u003EYou inspired my Ion driven Gilly lander - which worked great. I tried taking a very similar probe to yours to Minmus though, and there was no way it had the power to kill the velocity before smashing into the surface. I had enough power to throttle two engines to 100%, and it wasn\u0027t even remotely survivable. What\u0027s the trick?\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-12-18T16:37:12Z","Content":"\n\u003Cp\u003EThanks, it\u0027s been a while since I\u0027ve looked at this thread. \u003C/p\u003E\u003Cp\u003EI think all of my Minmus landers had three ion engines, but two should be enough, it depends on how you are powering them. The big solar panels weigh a lot and are the least efficient in terms of electricity generated / mass. Using smaller ones, or a bunch of the OX-STAT always helps. \u003C/p\u003E\u003Cp\u003EAs for landing, my strategy is always to start out in a relatively high orbit, maybe 25km over Minmus, and kill all horizontal velocity (you might also want to angle up a little to keep your vertical velocity from going too high). Then drop straight down while keeping your vertical velocity in check. This is really inefficient way of doing it, but it\u0027s the safest way.\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2013-12-18T22:03:40Z","Content":"\n\u003Cp\u003EThanks, the weight advice makes a lot of sense. I was far more concerned about running out of power than keeping it light, and had two gigantors with a lot of battery reserves. Plus, I came in from about 8km height. It\u0027ll be a while before I can try this now I\u0027ve restarted in .23 career mode, but I\u0027m looking forward to it.\u003C/p\u003E\n"},{"CreatedByName":"JiWint","CreatedById":78150,"CreatedDateTime":"2013-12-23T20:13:18Z","Content":"\n\u003Cp\u003Ehere,let me give you an advice.\u003C/p\u003E\u003Cp\u003EIon powered DUNA lander...impossible? What about WINGS?\u003C/p\u003E\u003Cp\u003EMeet the flying duna rover\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OzjlEXC.png\u0022 alt=\u0022OzjlEXC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI tried to land it,but then it began spinning like a hell,and after that I saw mysterious white column...\u003C/p\u003E\n"}]}