{"TopicId":30343,"ForumId":51,"TopicTitle":"The \u0026quot;Dejah Thoris\u0026quot;","CreatedByName":"Tokay Gris","CreatedById":58301,"CreatedDateTime":"2013-05-30T23:18:27Z","PageNum":1,"Articles":[{"CreatedByName":"Tokay Gris","CreatedById":58301,"CreatedDateTime":"2013-05-30T23:18:27Z","Content":"\n\u003Cp\u003EAfter the tedious work of refuelling the \u0022Colin Campbell\u0022 I thought I\u0027d go for something different for a change.\u003C/p\u003E\u003Cp\u003EI decided to go look for the artifacts on Mun.\u003C/p\u003E\u003Cp\u003EBut after the first luckless try with the good old \u0022Falcon\u0022, I realized the design had serious flaws.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/04/screenshot5.png\u0022 alt=\u0022screenshot5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst off: It doesn\u0027t have any lights. It has way too little delta-V, it can be used only once, because the descent stage is dropped shortly before touchdown. And the worst part: it fell over trying to touch down in the darkness (rescue mission was successful).\u003C/p\u003E\u003Cp\u003ESo I designed the \u0022Falcon MK II\u0022, christened the first one off the production line \u0022Dejah Thoris\u0022 and took her for a spin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot491.png\u0022 alt=\u0022screenshot491.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis beauty has a large footprint, so it is not likely to tip over, it comes equipped with a rover for two and it can easily take off again, make rendevous with the accompanying \u0022Pollux MK 2\u0022, refuel and look some other place.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot493.png\u0022 alt=\u0022screenshot493.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce docked to the cruiser, it can then make the journey to Mun with ease. A bit wobbly during thrust, but nothing serious. This will be corrected in the next version.\u003C/p\u003E\u003Cp\u003EThe \u0022Dejah Thoris\u0022 proved to be quite stable on descent and due to the large footprint sits firmly on the ground.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot497.png\u0022 alt=\u0022screenshot497.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe data from the two mapsats around Mun is rather crude, so on the first landing site near Muns south pole didn\u0027t find any artifacts, contrary to the mapsat-data.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot513.png\u0022 alt=\u0022screenshot513.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOr I just didn\u0027t find it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot506.png\u0022 alt=\u0022screenshot506.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA flag was planted anyway. I decided to test the rover on a more worthwhile spot, because I was not sure it could be reattched and even if it could be reattached, if the junior docking port could keep it in place during liftoff.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot510.png\u0022 alt=\u0022screenshot510.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERefuelling was easy after I disabled the RCS thrusters on the rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot522.png\u0022 alt=\u0022screenshot522.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe second landing was paydirt. Very shortly before actual touchdown I noticed I was almost on top of the artifact.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot532.png\u0022 alt=\u0022screenshot532.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rover was taken for a spin, which proved to be the literal truth. The space underneath the \u0022Dejah Thoris\u0022 is quite narrow, one wheel got stuck on the nuclear engine and the rover lay flat on its back. A good thing it is pretty light and has RCS-thrusters, so I was able to turn it around again. It dawned on me at that time that the ASAS module was totally useless. There is nothing on the rover to give it any torque. This also will be corrected in the next version and the ASAS module replaced with an SAS module witch should be more use anyway.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot534.png\u0022 alt=\u0022screenshot534.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGetting the rover underneath the \u0022Dejah Thoris\u0022 again proved to be rather tricky. But I managed to do it in the end. One short burst of the RCS-thrusters and it was again firmly attached again.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot538.png\u0022 alt=\u0022screenshot538.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELuckily the junior docking port that holds the rover in place was strong enough to hold it in place during takeoff.\u003C/p\u003E\u003Cp\u003EAnother orbital docking, this time to the still in orbit \u0022Castor\u0022 support vessel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hirnstroeme.files.wordpress.com/2013/05/screenshot545.png\u0022 alt=\u0022screenshot545.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFilled up again and ready for the next artifact!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-31T06:01:01Z","Content":"\n\u003Cp\u003ENicely done!\u003C/p\u003E\u003Cp\u003EI especially like the clever use of wings to get around the limitations for having landing legs on the same vehicle as LV-Ns.\u003C/p\u003E\n"},{"CreatedByName":"Tokay Gris","CreatedById":58301,"CreatedDateTime":"2013-05-31T08:12:59Z","Content":"\n\u003Cp\u003EThanks!\u003C/p\u003E\u003Cp\u003EThe wings also make the footprint quite large and reduce the chance of tipping over.\u003C/p\u003E\u003Cp\u003EI am not at home right now, I will provide the .craft-File later.\u003C/p\u003E\n"},{"CreatedByName":"Tokay Gris","CreatedById":58301,"CreatedDateTime":"2013-06-01T21:28:06Z","Content":"\n\u003Cp\u003EAfter the experience on Mun, I am currently putting together a major operation together to go to Minimus.\u003C/p\u003E\u003Cp\u003EComplete with two satelites, an orbiting research station, two orbital tugs, a reusable lander (a revised Falcon MK II, the \u0022Zeb Carter\u0022) and a revised 2-kerbal-rover.\u003C/p\u003E\u003Cp\u003EPics on monday....\u003C/p\u003E\n"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2013-06-01T23:03:37Z","Content":"\n\u003Cp\u003EIf you want to find that anomaly at the South pole you may need to look a little deeper. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHave a look here: \u003Ca href=\u0022http://imgur.com/a/dr8AP#0\u0022 rel=\u0022external nofollow\u0022\u003EBill and Jeb\u0027s Excellent Adventure\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThis was done before rover wheels.\u003C/p\u003E\n"},{"CreatedByName":"Tokay Gris","CreatedById":58301,"CreatedDateTime":"2013-06-02T01:45:41Z","Content":"\n\u003Cp\u003EThe \u0022Zeb Carter\u0022 is currently descending on Minimus... the satelites found something.\u003C/p\u003E\n"},{"CreatedByName":"Tokay Gris","CreatedById":58301,"CreatedDateTime":"2013-06-02T03:54:58Z","Content":"\n\u003Cp\u003EOh well... Mapsat found it. Jeb, Bob and Bill didn\u0027t. And they had a rover...\u003C/p\u003E\n"}]}