{"TopicId":31704,"ForumId":51,"TopicTitle":"Jeb\u0026#039;s MÃƒÂ¼n shenanigans (picture heavy)","CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-06-06T16:08:26Z","PageNum":1,"Articles":[{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-06-06T16:08:26Z","Content":"\n\u003Cp\u003ESo, I took Jeb into a lander and landed on the MÃƒÂ¼n. This got weird after that mostly because sleep deprivation. Of course the first thing you should always do is plant your flag!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3wmtoBT.png\u0022 alt=\u00223wmtoBT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb took a nap in the lander to ease his nerves after the landing, when he woke up he was greeted by a beautiful Sunset over Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ufq1Itf.png\u0022 alt=\u0022Ufq1Itf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBefore he ran out of daylight, Jeb EVA\u0027d over to a fairly large rock...for science.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uqGqBcn.png\u0022 alt=\u0022uqGqBcn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDay One:\u003C/p\u003E\u003Cp\u003EJebediah awakens and decides that he will encompass Kerbin. I didn\u0027t have the heart to tell him that he\u0027s about two million kilometers away.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/A1gZBDL.png\u0022 alt=\u0022A1gZBDL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was time to explore! Jeb picked a direction and flew off towards it...Gracefully...\u003C/p\u003E\u003Cp\u003E...Yeah maybe not so graceful.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/U2tL2k2.png\u0022 alt=\u0022U2tL2k2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EQuickly coming to the conclusion that the way he chose was cursed, he went the opposite direction! On his satellite map he saw an interesting looking trench about 10 kilometers from base and decided to refuel his pack and head off. On the way he passed over a shallow ditch. how fascinating.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/j8k3F4L.png\u0022 alt=\u0022j8k3F4L.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDo y\u0027all see that? Right above Jeb\u0027s helmet is the second moon of Kerbin; Minmus! or a speck of dirt on the lens.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0sZORQR.png\u0022 alt=\u00220sZORQR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd finally, Jeb realized just as he about made it to the edge of the trench, he was almost out of EVA fuel. Uh, oh. Jeb flew as close to base as he could (0.2 Km from where he was standing:huh:) and had to walk the remaining distance...And i decided that I wasn\u0027t going to deal with that so I took a break.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zxwXB9i.png\u0022 alt=\u0022zxwXB9i.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMore soon!\u003C/p\u003E\n"}]}