{"TopicId":32203,"ForumId":51,"TopicTitle":"My Overly Complicated First Mun Landing","CreatedByName":"starkllr","CreatedById":67760,"CreatedDateTime":"2013-06-09T20:22:19Z","PageNum":1,"Articles":[{"CreatedByName":"starkllr","CreatedById":67760,"CreatedDateTime":"2013-06-09T20:22:19Z","Content":"\n\u003Cp\u003EIt took three NERVA-powered spacecraft, and plenty of good luck, but the Kerbal Space Agency has finally achieved the goal of landing a Kerbal on the Mun and returning him to Kerbin! \u003C/p\u003E\u003Cp\u003EThe mission truly lived up to the KSA\u0027s motto: Ex Kerbia Cum Ardua. \u003C/p\u003E\u003Cp\u003EIn an effort at methodical thinking and infrastructure-building, the KSA first built a refueling station in LKO. Kerbin Orbital Terminal Alpha would serve as a home base for the future Kerbin-Mun Taxi spacecraft, and Kerbonauts would return to Kerbin aboard Kerbin Return Capsules docked at the station (so that our ships to the Mun would not need parachutes or any means of bringing their crew back home).\u003C/p\u003E\u003Cp\u003EWe then launched a smaller version of the same station into Munar orbit. Munar Orbital Terminal Beta would serve as the destination for the Kerbin-Mun Taxi, and would also be the home base for the Mun Lander. It was launched into LKO on a heavy booster, and flew to the Mun under the power of a NERVA engine.\u003C/p\u003E\u003Cp\u003EIt didn\u0027t quite work out that simply. We had...difficulties...getting the Munar Orbital Terminal Beta into Munar orbit, and it ended up in a \u0022backwards\u0022 orbit. We didn\u0027t realize this until too late, however.\u003C/p\u003E\u003Cp\u003EWe then launched the Mun Lander into LKO, where it would wait for the Kerbin-Mun Taxi to rendezvous with it for the voyage to the Mun. This went without incident, as the mighty NERVA propelled both craft into Munar orbit...a correct Munar orbit.\u003C/p\u003E\u003Cp\u003EOur cameramen fell down on the job, sadly, so our photographic record only begins with the actual Mun landing...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/5069296/First%20Mun%20Landing%21.jpg\u0022 alt=\u0022First%20Mun%20Landing%21.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe flag was planted by Neilbin and Milikin Kerman...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/5069296/Munar%20Flag%20Planting.jpg\u0022 alt=\u0022Munar%20Flag%20Planting.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile, the Kerbin-Mun Taxi burned a massive amount of fuel reversing its orbit to dock with the Munar Orbital Terminal and pay a visit to Jebediah Kerman...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5069296/Approaching%20Station%20in%20Munar%20Orbit.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/5069296/Approaching%20Station%20in%20Munar%20Orbit.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5069296/Taxi%20docket%20to%20Munar%20Station.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/5069296/Taxi%20docket%20to%20Munar%20Station.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately, this didn\u0027t leave the Taxi with enough fuel to rendezvous with the Mun Lander upon ascent from the Munar surface. So a robotic Mun tanker was launched, to rescue Neilbin and Milikin...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5069296/unmanned%20tanker%20leaves%20kerbal.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/5069296/unmanned%20tanker%20leaves%20kerbal.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe tanker successfully rendezvoused with the Mun Lander, and rather than burn too much fuel to reverse orbits and dock with the Munar Orbital Terminal, the robotic tanker brought the Mun Lander back to Kerbin orbit, and the Kerbin Orbital Terminal Alpha...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5069296/Final%20approach%20to%20space%20station.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/5069296/Final%20approach%20to%20space%20station.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5069296/Lander%20docks%20at%20space%20station%21.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/5069296/Lander%20docks%20at%20space%20station%21.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter a brief stay in Kerbin orbit, Neilbin and Milikin boarded a Kerbin Return Capsule and headed back to the KSC...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5069296/FLoating%20to%20landing.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/5069296/FLoating%20to%20landing.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd, after a long and unprecedented and horribly dangerous journey, our two pioneering Kerbonauts set foot back on native soil!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/5069296/Home%20at%20Last%21.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/5069296/Home%20at%20Last%21.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMany lessons were learned for future Munar exploration:\u003C/p\u003E\u003Cp\u003EEnsure that Munar orbits are established in the correct direction.\u003C/p\u003E\u003Cp\u003EMake sure the lander\u0027s legs extend past the engine bell! We were very fortunate the lander didn\u0027t tip over.\u003C/p\u003E\u003Cp\u003ENow that this goal has been accomplished, the next challenge is to build a rover for motorized Mun exploration!\u003C/p\u003E\n"}]}