{"TopicId":32940,"ForumId":51,"TopicTitle":"Sub-orbital trajectory rescue","CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-06-14T12:49:18Z","PageNum":1,"Articles":[{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-06-14T12:49:18Z","Content":"\n\u003Cp\u003EEllo,\u003C/p\u003E\u003Cp\u003EYesterday i decided to try to take a risk, and get Bob, who had landed on the mun, back into munar orbit with the little fuel he had left.\u003C/p\u003E\u003Cp\u003EOnly, after a while, i realised i wouldn\u0027t have enough fuel to actually get into orbit. I slowed down as much as possible, but eventually i was left on RCS alone which wasn\u0027t even strong enough to stop my craft from accellerating.\u003C/p\u003E\u003Cp\u003ESo i quickly made Bob jump out of the craft. Pressed the wrong key, he got in again, i got him out again, only i couldn\u0027t move him away before he hit the ground going about 120 m/s. He got flung away by the blast and is now on a suborbital trajectory with a non-responsive jetpack. He\u0027s going about 500 m/s at this point i believe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/3ftzc.jpg\u0022 alt=\u00223ftzc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m not really here to ask for help, rather looking for stories from people who\u0027ve done similar rescues :-). Objective being simply to either catch him or slow him down enough to not splatter into the ground at 500 m/s.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-06-14T12:58:34Z","Content":"\n\u003Cp\u003EWithout working jetpack? I guess it\u0027s possible, but hard to pull off. You\u0027d have to ger functional ship very near falling Kerbal, then send one of the crew EVA with KAS connector attached to his back. Rescuer would close in on Bob, attach connector to him and return to capsule. Then reel cable with dangling Bob back until connector locks in the winch. And then just do braking burn or go orbital. And pray some weird physics twist won\u0027t cause your entire ship to disintegrate. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-06-14T13:02:33Z","Content":"\n\u003Cp\u003EI should really have chosen Jeb for this mission \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Only he was already airborne.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-06-14T13:09:01Z","Content":"\n\u003Cp\u003EAt least you are near the Mun, not Kerbin. No atmo \u002B low(er) gravity = plenty of time for rescue. You can catch Bob a kilometer above the surface, and with good enough engines still manage to brake or accelerate into orbit.\u003C/p\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-06-14T13:52:46Z","Content":"\n\u003Cp\u003ELol, that sounds like a crazy mission. How much time is left until Apoapsis and crashdown? It might be not too late to start a super-fast rescue craft from Kerbin:) I think the rescue itself might be possible without any mods, you \u0022just\u0022 have to get a ladder/pod entry close enough for him to grab it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AnalogAddict","CreatedById":59758,"CreatedDateTime":"2013-06-14T14:44:50Z","Content":"\n\u003Cp\u003EI\u0027ve saved Jeb from literally the same situation, except it was a parachute jettison explosion that flung him spaceward. Although I could utilize the RCS backpack, my final trajectory was near identical to OPs with 0 RCS fuel left... had it not been for the munar orbital module he probably would have smashed into the ground. My orbital module was fairly close as I was prepping to launch to rendezvous when the mishap occured. I was able to save him near his apoapsis with plenty time to spare. The most aggravating part is the clunky ship you have to maneuver close instead of the agile EVA\u0027d Kerman.\u003C/p\u003E\n"},{"CreatedByName":"AustralianFries","CreatedById":57660,"CreatedDateTime":"2013-06-14T18:13:33Z","Content":"\n\u003Cp\u003EI did a similar rescue mission. I was doing a direct lift-off transfer to Duna, and at around 30km, an engine over heated. This caused the ship to go haywire, spin out, and send parts flying through the air. The capsule survived, but nothing was attached to it. Bob jumped out and raised the AP as high as possible his thrusters ran out. The AE was 213km, so I assembled a rescue ship and rendezvoused with Bob, getting close enough for him to grab onto the extra module.\u003C/p\u003E\n"},{"CreatedByName":"Mazlem","CreatedById":57206,"CreatedDateTime":"2013-06-14T18:52:00Z","Content":"\n\u003Cp\u003EOh yea I do that sort of thing all the time. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/32394-The-coolest-stunts-we-ve-pulled-in-KSP?p=402081\u0026amp;viewfull=1#post402081\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/32394-The-coolest-stunts-we-ve-pulled-in-KSP?p=402081\u0026amp;viewfull=1#post402081\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-06-14T18:55:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AustralianFries\u0022 data-cite=\u0022AustralianFries\u0022\u003E\u003Cdiv\u003EI did a similar rescue mission. I was doing a direct lift-off transfer to Duna, and at around 30km, an engine over heated. This caused the ship to go haywire, spin out, and send parts flying through the air. The capsule survived, but nothing was attached to it. Bob jumped out and raised the AP as high as possible his thrusters ran out. The AE was 213km, so I assembled a rescue ship and rendezvoused with Bob, getting close enough for him to grab onto the extra module.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEpic! That should be like on some KSP video, complete with the Hollywood music and stuff! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-06-14T18:58:05Z","Content":"\n\u003Cp\u003Ecould be possible. good luck.\u003C/p\u003E\n"},{"CreatedByName":"AustralianFries","CreatedById":57660,"CreatedDateTime":"2013-06-14T19:01:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EEpic! That should be like on some KSP video, complete with the Hollywood music and stuff! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHeh, yeah. I want to start a Youtube channel one of these days. I have a 3D intro ready and have started editing a few videos... But I don\u0027t know if I\u0027ll upload them. I scrap projects alot.\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-06-14T20:09:40Z","Content":"\n\u003Cp\u003EHello!\u003C/p\u003E\u003Cp\u003ELooks awesome Mazlem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Must be even more epic with the higher gravity.\u003C/p\u003E\u003Cp\u003EBut, im sad i have to say, Bob died. Im currently working on the demo-version since i can\u0027t download a full version yet - my internet is giving me problems :-( (don\u0027t worry, i am buying the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\u003Cp\u003EI already had two Kerbals in-flight around Kerbin. I brought Jeb down from his orbit as fast as his little engine would let him, then modified my clunkily assembled triple-recovery craft (i had only single-seater command pods, and only a tri-coupler, so i was forced to bring 3 command pods) with alot more SRB\u0027s, fuel and extra-powerful engines, but it didn\u0027t have enough fuel to make an orbit \u002B munar transfer. By the time i cancelled Jeb\u0027s failed rescue attempt, poor Bob had already reached the apoapsis of his trajectory. So there was nothing i could do except watch him vanish in a puff of smoke when he hit the Mun :-(.\u003C/p\u003E\u003Cp\u003EIs there any way i can bring him back? Can i send Jeb to the Mun to pick up his dust and then fire a jet-engine at it to melt it into Bob again? I got a little bit fond of him. He was my Neil Kerbstrong :-(.\u003C/p\u003E\u003Cp\u003EAlso, is there any way you can recover a Kerbal who has bounced into terrain, so he can use his RCS-pack again? That malfunction was really what killed bob.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-06-14T20:21:36Z","Content":"\n\u003Cp\u003EDon\u0027t worry. Unless your Kerbal-generating piece of game code is bugged, sooner or later you will get Bob back (uh, Big Three is still hard-coded into game, right? Nothing changed?).\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-06-14T20:26:19Z","Content":"\n\u003Cp\u003EYaaaay thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003EWhile waiting i\u0027ll have Lembur fly around. It seems to be generating him for the time being :-).\u003C/p\u003E\u003Cp\u003EIf not, i suppose Bob will come back once i download and start a save on the full version.\u003C/p\u003E\u003Cp\u003EIf the big three is hard coded, means i won\u0027t lose Jebediah (and Bill) either, next to Bob. That\u0027s great \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI\u0027ll try to get you some screenshots of when i do make successfull return trip from the mun :-).\u003C/p\u003E\n"},{"CreatedByName":"legoheli","CreatedById":47640,"CreatedDateTime":"2013-06-14T20:30:06Z","Content":"\n\u003Cp\u003EI\u0027ve done a sub-orbital rescue in high Moho orbit. It all came down to me being a moron because:\u003C/p\u003E\u003Cp\u003EFirst I made a Moho lander with not enough dV to get back to Kerbin.\u003C/p\u003E\u003Cp\u003EThen, I made one that could, and flew it to Moho, but ended up in an orbit retrograde to the orbit of my first mission.\u003C/p\u003E\u003Cp\u003ESolution? Burn with the first mission to get as close as possible to the orbit of the rescue vessel, then EVA burn the rest of the way.\u003C/p\u003E\u003Cp\u003EUnfortunately, the only proof I have of this is that there\u0027s an empty craft called \u0022Moho and back\u0022 orbiting Moho and a flag on the planet...\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-06-15T08:23:07Z","Content":"\n\u003Cp\u003EI find it a wise idea to put a single docking port somewhere on every ship. That way you can use a tug to pull it back (assuming you don\u0027t have KAS), or just refuel it entirely.\u003C/p\u003E\n"}]}