{"TopicId":33278,"ForumId":51,"TopicTitle":"Roving Lander to the Mun","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-16T14:35:17Z","PageNum":1,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-16T14:35:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EPART 1: Lander R\u0026amp;D\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EEnough of following tutorials! It\u0027s time to solo! So now I\u0027m going to Mun in a ship of my own design. And no more just landing, planting a flag, and going home. No, this time I\u0027m taking a rover. After spending several days of unsatisfactory experimentation with different ways of attaching a separate rover to a lander and trying to solve the \u0022vertical-to-horizontal\u0022 problem, I noticed that some kind soul has graciously tweaked Damned Robotics to work in 0.20, so I decided to go with a roving lander with DR components. Rather ambitious for a noob like me but that\u0027s what happens when you give a bonobo (my main hobby is flint-knapping) control of a space program with unlimited funding \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003ESo, I spent the next day tinkering with the roving lander design until I got something I liked. The basic concept is that the lander\u0027s main wheels are on rotating arms that are parallel with the fuel tank for flight and swing out for roving. The thing lands vertically on 4 legs as normal. Then, I swing the arms out and retract the legs on that side, causing the lander to fall over onto its wheels. Retract the other legs, adjust the angle of the arms for stability, and away I go. When I\u0027m ready to go home, I extend the top legs, then pivot the arms to angle the body up more than 45^, then extend the legs on the bottom to stand back up on all 4 feet. While roving, the lander is a 3-wheeler using a Firespitter Fighter Tailwheel at the rear. In fact, I put such a wheel top and bottom and the arms can rotate 360^, so the lander can roll with either side up and can flip itself from 1 side to the other if need be. Also has solar panels on both sides in case 1 side\u0027s break off in an accident.\u003C/p\u003E\u003Cp\u003EThe lander is controlled with a combination of all the stock plus the 10 custom action groups, the DR GUI, right-clicking on various parts, and the keyboard. The action groups are as follows:\u003C/p\u003E\u003Cp\u003E1: Wheel brakes on (for parking)\u003C/p\u003E\u003Cp\u003E2: Retract/extend tailwheels. When retracted, acts as tailskid (additional parking brake, important when tipping the lander over).\u003C/p\u003E\u003Cp\u003E3. Landing spotlight toggle (they come on when I hit the G key to lower all 4 legs at once)\u003C/p\u003E\u003Cp\u003E4. Toggle upper port leg\u003C/p\u003E\u003Cp\u003E5. Toggle lower port leg\u003C/p\u003E\u003Cp\u003E6. Toggle upper starboard leg\u003C/p\u003E\u003Cp\u003E7. Toggle lower starboard leg\u003C/p\u003E\u003Cp\u003E8. Toggle driving headlights\u003C/p\u003E\u003Cp\u003E9. Toggle both upper legs\u003C/p\u003E\u003Cp\u003E0. Toggle both lower legs\u003C/p\u003E\u003Cp\u003EHere are some pics of the lander during ground tests on Kerbin to make sure all this worked:\u003C/p\u003E\u003Cp\u003EInitial vertical landing configuration: \u003Cimg src=\u0022http://i.imgur.com/5WfYKuT.jpg\u0022 alt=\u00225WfYKuT.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENOTE: I built it with the arms facing forward thinking they\u0027d needed to be out of the way of the legs. Turns out they work fine facing back, but I never changed this. But I can rotate them manually to any position I want so no big deal.\u003C/p\u003E\u003Cp\u003ETipped over to start roving:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZG7wcrA.jpg\u0022 alt=\u0022ZG7wcrA.jpg\u0022\u003E]\u003C/p\u003E\u003Cp\u003ERoving along:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wL25BQy.jpg\u0022 alt=\u0022wL25BQy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EParked for EVA:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ckMzXhF.jpg\u0022 alt=\u0022ckMzXhF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStarting to stand back up:\u003C/p\u003E\u003Cp\u003EThis is also the emergency take-off position in case I can\u0027t get it all they way back upright. I figure that in low gravity, I can give it just a light kick off the ground and immediately kill the engine, shift the wheels and legs back into balance, then fly away before hitting the ground again.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mRvjod4.jpg\u0022 alt=\u0022mRvjod4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBack up and ready to go home:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WIz4PGb.jpg\u0022 alt=\u0022WIz4PGb.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell, everything\u0027s strong enough to do this in Kerbin\u0027s gravity so it will work on the Mun. Of course, it might work too well there, which is one reason the lander is designed to drive either side up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. But no way to determine that without going there so let\u0027s get this thing off the ground.\u003C/p\u003E\u003Cp\u003E*** TO BE CONTINUED ***\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-18T12:18:34Z\u0022 title=\u002206/18/2013 12:18  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 18, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003Cbr\u003Echange from showing Flickr links to the actual pics shown on Imgur\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-16T15:14:13Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EPART 2: Getting it Off the Ground\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOnce I had the lander, I needed to put a rocket under it. This was a bit tricky because I use Ferram Aerospace and that roving lander is hardly aerodynamic. So first thing I went to Fairing Factory, only to discover that 1) it can\u0027t make a fairing to fit around the lander and 2) even if it could, it doesn\u0027t seem to have been updated to 0.20 yet. Thus, nothing for it but to launch the thing naked and hope for the best.\u003C/p\u003E\u003Cp\u003EOne of the nice things about Ferram Aerospace is that if you put nose cones on your side tanks, the delta-v requirement goes way down (provided you can satisfy the OTHER requirements, which can be difficult). Instead of the standard ~4500m/s to reach LKO, you only need ~3000m/s. So, it really wasn\u0027t that hard at first to build a working rocket, which I did yesterday afternoon. Directly under the lander was a long, narrow tank with an atomic rocket. To this I attached a single pair of the 3-section fat metal tanks, each with a Skipper beneath and a nosecone atop. With this configuration, I did a test launch to orbit and back down to make sure it would fly and the staging worked.\u003C/p\u003E\u003Cp\u003EAnd all that worked perfectly. But re-entry failed. See, up to that point, Ferram Aerospace had a problem with B9 Aerospace and the fix was to use a DLL from the Deadly Reentry mod. Rather than just pull out that DLL, I had installed the entire mod while dinking around with aircraft. But I hadn\u0027t done any rocketry with it, so now I discovered that the 1-man capsule tumbled totally uncontrollably. While the capsule didn\u0027t burn up, the parachute did so the thing fell like a stone and killed the test pilot.\u003C/p\u003E\u003Cp\u003EAt this point, I had go to a meeting 100 miles away. When I got back, I started looking for how to use the Deadly Reentry DLL without installing the full mod, and discovered that Ferram Aerospace 0.9.5.11 had just come out and no longer needed Deadly Reentry at all. So I knocked Deadly Reentry out, put in the new FA version, and tried another test launch.\u003C/p\u003E\u003Cp\u003EAnd now my previously successful rocket was a total failure. All went well until I started trying to lean it over, at which point it would tumble uncontrollably. I tried all sorts of ascent profiles and adding more and more tailfins to no avail, so it was back to the drawing board. The README of FA says that long, tall rockets work better than short, fat ones so I redesigned the ascent stage with that in mind.\u003C/p\u003E\u003Cp\u003EI eventually came up with this configuration. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jIWgqGW.jpg\u0022 alt=\u0022jIWgqGW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs before, the transfer stage is still a nuke with a single long tank. The ascent stage however, is 4 double stacks of long tanks with the vectoring engines under them. 8 tailfins in total, 1 on each booster and 4 on the nuke. Note the long asparagus fuel lines now required when trying to make your rocket as long as possible. Also note I forgot to turn the lander\u0027s wheels down before launch \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. And actually, Bill is just the test pilot here, but given the high likelihood of failure I took his picture in case it was needed for his funeral. Jeb gets to do the actual mission because he never complains \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EAnyway, this thing can achieve LKO on the 4 side tanks, leaving the nuke tank full with WAY more delta-V than needed. However, all this fuel will let me tweak my Munar orbit in case I want to land in a particular place. Note, however, that it DOES NOT like to fly straight with that naked lander, so the ascent through the atmosphere is rather intense.\u003C/p\u003E\u003Cp\u003ESo, now it was time to \u0022Locate Jebediah Kerman\u0022, stuff him in the can, and do it for real. And AGAIN I forgot to rotate the wheels down \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. But I fought it into orbit with about 3200 delta-v:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IZ98lED.jpg\u0022 alt=\u0022IZ98lED.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen it was burning at Munrise:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/H3DRLqt.jpg\u0022 alt=\u0022H3DRLqt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd into Munar orbit at about 115km more or less. Still have a lot of transfer fuel so I can pick my spot. And I STILL haven\u0027t moved the wheels back \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/T13nXIG.jpg\u0022 alt=\u0022T13nXIG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll burns done manually watching the arcs move on the map view. The ship has MechJeb but that\u0027s just a safety net.\u003C/p\u003E\u003Cp\u003EAnd this is where I left Jeb for the night. When I get another chance, I\u0027ll bring him down and finally see if the roving lander functions as intended.\u003C/p\u003E\u003Cp\u003E*** TO BE CONTINUED ***\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-18T12:22:39Z\u0022 title=\u002206/18/2013 12:22  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 18, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003Cbr\u003Echange from Flickr links to Imgur pics\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-17T03:01:57Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EPART 3: Landing, Roving, and Ascent\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWell, since I started this thread, I\u0027ve learned that Imgur lets you do direct links that Flickr no longer does, so now all the pics are in an album at Imgur here: \u003Ca href=\u0022http://imgur.com/a/ncdNK\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/ncdNK\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnyway, it was time to put this beast on the ground and see how the roving lander worked. I aimed to come down in a big crater on the light side, which I\u0027d heard made for a decent place to land.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NkQJIsL.jpg\u0022 alt=\u0022NkQJIsL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI did the de-orbit burn with the transfer stage, then dumped it. It still had like 3/4 fuel. Later, I would discover I needed that fuel in the lander. So, back to the drawing board there. It would work on Minmus as-is, but for Mun weight needs to be shifted upstairs. \u003C/p\u003E\u003Cp\u003EAs it happened, I did come down on the light side but behind the crest of a hill, so it was pretty dark. Still, all nice and safe, although only 1/2 a tank of lander fuel left after burning during landing. BTW, the \u0022ASAS hill trick\u0022 I used on Minmus doesn\u0027t work on Mun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pcMIPE6.jpg\u0022 alt=\u0022pcMIPE6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, I swung out the arms, retracted the bottom pair of legs, and toppled over just as intended onto the wheels. But then I extended the tailwheel so it would roll, and this had enough force to toss the whole vehicle up into the air and it came down on its side.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/azO3yXI.jpg\u0022 alt=\u0022azO3yXI.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFortunately, I\u0027d planned for this sort of thing with all the action groups for the legs so with them, swinging the arms around, and using the roll, pitch, and yaw keys, I managed to work the thing upright. And nothing broke off in all this, so I was pretty happy. So then off I went across the surface heading for the sun, with the intention of just crossing the ridgeline so I could get a better view of the terrain.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DelJmgr.jpg\u0022 alt=\u0022DelJmgr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs long as I kept the speed at 10m/s or less, I had absolutely no problems controlling, staying upright, and controlling direction. However, between me and the highest ridgeline on the horizon was a smaller ridge I didn\u0027t see coming. When I went over the top of it and started down the other side, my speed shot up and before I could slow down I flipped over, breaking off the top solar panel. And with no real prospect of ever getting to sunlit terrain, I decided I was in a good enough place for Jeb to plant the flag. So, with some more squirming around with the arms and legs, I managed to get the thing rightside up again so the ladder would work (I suck at EVA and didn\u0027t feel up to using it to get back in the inverted hatch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xtkfLBE.jpg\u0022 alt=\u0022xtkfLBE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOK, so now to get off this rock. I debated staying on the ground or going to orbit, but I figured I had a better chance of getting close enough for a rescue in orbit than on the ground, so opted for that. I was unable to get completely back up on all 4 legs--it kept flipping over backwards--so I did the aforementioned back-up takeoff method from the \u0022howitzer position\u0022. And I couldn\u0027t even get that as vertical as on Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vmyCwuj.jpg\u0022 alt=\u0022vmyCwuj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe takeoff was pretty hairy and I almost crashed, but I managed to get up and into orbit. Sadly, this used all by my last drop of fuel, so now poor Jeb is a Munar satellite until I feel up to mounting a rescue mission. However, at least he\u0027s still got 1 solar panel so he can watch TV and play his X-box until help arrives. That is, if he can ever stop looking out his tiny window and grinning.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AV4nAWO.jpg\u0022 alt=\u0022AV4nAWO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ELESSONS LEARNED:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1. More fuel in Munar landers.\u003C/p\u003E\u003Cp\u003EMy big problem here is that all the delta-v maps I\u0027ve been able to find are for outward-bound trips only. I\u0027ve never found a homeward-bound delta-V map (other than that needed to get into orbit at the other body). Anybody got such a thing?\u003C/p\u003E\u003Cp\u003E2. Bigger Headlights\u003C/p\u003E\u003Cp\u003EThe omnilights (from B9 I think) just don\u0027t throw enough light. They\u0027re like porch lights, pretty much only good for attracting bugs without illuminating the surrounding areas. If I\u0027d been able to see the small ridge in front of me before I crossed it, I might still be roving around Mun and have some daylight pics of the surface.\u003C/p\u003E\u003Cp\u003E3. Roving Landers are Fun\u003C/p\u003E\u003Cp\u003EBut I probably won\u0027t be using them again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-18T12:24:45Z\u0022 title=\u002206/18/2013 12:24  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 18, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003Cbr\u003Eswapped 1st pic\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-18T04:36:14Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPART 4: Planning the Rescue Mission\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhen we left our hero, Jeb was marooned with no fuel in a rather inconvenient Munar orbit, inclined about 40^ and somewhat eccentric, 30km x 50km.\u003C/p\u003E\u003Cp\u003EMeanwhile, back at KSP, the boffins were trying to figure out how to save him. Jeb\u0027s ship lacking a docking port, there are essentially 2 options:\u003C/p\u003E\u003Cp\u003EPLAN A: Use a KAS winch and dismountable port to refuel, then let Jeb fly himself home. This is preferable because the Kerbsonian Museum wants his capsule to display next to his 1st Minmus capsule. However, it turns out to be rather complicated.\u003C/p\u003E\u003Cp\u003EPLAN B: Just take an empty seat and have Jeb EVA over, abandoning the roving lander.\u003C/p\u003E\u003Cp\u003EEasy enough to make a ship to do both and I like having back-up plans. So, I needed 1) to learn how to refuel with KAS, 2) learn how to rendezvous, and 3) learn how to fly in EVA, all while designing a refueling ship.\u003C/p\u003E\u003Cp\u003EMy 1st thing was the winch so I created a couple of rovers and walked back and forth between them with the winch cable. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bwhpyms.jpg\u0022 alt=\u0022bwhpyms.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn this operation, I learned several important things. Most importantly, the dismountable port can\u0027t be attached to the connector on the end of the cable like the hooks and magnet. So, this means 2 round trips, 1 to take the port and stick it on Jeb\u0027s ship, then go back and get the cable over to the port. OK, I think I got that, so now to try it in space, along with rendezvous and EVA.\u003C/p\u003E\u003Cp\u003EWhile this had all be going on, the boffins had been working hard and unveiled the newest creations from KW Rocketry. Not only did this include the fairings I\u0027d ordered but also a collection of cool new tanks and engines. So I slapped the spare roving lander atop a KW SSTO lower stage, and shot it into the best approximation I could make at Kerbin of Jeb\u0027s Munar orbit. The fairing REALLY helped launching the roving lander in the FAR atmosphere.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lNxvKYm.jpg\u0022 alt=\u0022lNxvKYm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I built a refueler, also using KW parts. The actual refueling vehicle is a 3-man capsule with 1 seat emptied via Crew Manifest. This covers Plan B. And I\u0027ve got a spare Kerbal aboard in case the 1st EVA goes horribly wrong, so that\u0027s Plan A.5 I guess \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E. Anyway, the stock 1440 tank with a nuke under it, balanced RCS about this stage\u0027s CG, and finally and the winch on top with 2 ports (in case I fumble one accidentally), all within reach from the hatch. All this sitting atop a big pile of KW parts that\u0027s considerably overkill on the delta-v, but I don\u0027t want to have to send another rescue mission after this tanker \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fhKUHvJ.jpg\u0022 alt=\u0022fhKUHvJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4RpR6Di.jpg\u0022 alt=\u00224RpR6Di.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENOTE: This isn\u0027t the original configuration of the winch, but the final version. Originally, the winch sat flat on the top of the capsule, and thereby hangs a sad tale. See, I got this thing into HKO to simulate coming down to Jeb, manually matched up orbits with the target lander, used MechJeb to synchronize the rendezvous to 100m, managed to RCS my way within 15m, grabbed one of the ports and set off for my 1st EVA flight. After flailing around hopeless for a long time learning to fly, so long that we passed into Kerbin\u0027s shadow, which made everything much worse, and using 25% of the jetpack fuel, I finally got the port on the target. And the game instantly crashed. So I restarted from an autosave only now I knew better how to fly EVA so got the port on and went back to the tanker for the cable. And there wasn\u0027t any connector on the winch!?!?!?! Did I drop it somehow? AARRGGHH!!! I KNOW I put it on there in the VAB, having to rotate it around to make it stick. Anyway, nothing for it but to deorbit and fix the vehicle. So I go to the VAB, take the nosecone off to see the winch better, and I see this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OXZA16i.jpg\u0022 alt=\u0022OXZA16i.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EApparently when I thought it had stuck, it had actually just dropped in the air behind the ship. It\u0027s rather difficult to tell when you do it right because the green balls totally hide the part and by now the rocket\u0027s CG was down near the bottom a long way away. So I fixed this and this time decided to test it on the ground and even though there was now a connector, the winch wouldn\u0027t work, for several different reasons, each of which had to be discovered individually. Glad I was doing this on the ground \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I finally had to put the winch atop the circular girders to make it work. But I couldn\u0027t test actually moving the cable anywhere because before a Kerbal can grab it, it has to be released. And with the tanker on the pad, releasing the cable makes it fall all the way through the length of the ship and even through the grating below, totally out of reach. Still, everything finally appeared functional so I decided to test it in space by itself before giving the rendezvous part another go. And yup, it worked there, too, because there cable doesn\u0027t fall when you\u0027re in orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SWJCOYv.jpg\u0022 alt=\u0022SWJCOYv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, now I\u0027m set to give Plan A a final test before taking the show on the road to rescue Jeb.\u003C/p\u003E\u003Cp\u003E*** TO BE CONTINUED ***\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-18T21:49:55Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPART 5: Saving Private Jebediah\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAfter a successful refueling test in Kerbin orbit--er, um, well, PARTIALLY successful. The whole KAS thing finally worked as intended and the target lander got refueled. However, I deorbited both it and the tanker what I thought was far enough apart in time that I could switch back and forth, with the idea of taking a cool pic with both of their parachutes as they came down on the island in the big crater bay. Unfortunately, I couldn\u0027t switch fast enough so while Bill and Bob came down fine in the tanker, Doodle plummeted to this death in the lander. This put the kibosh on the press conference and photo op planned for the occasion, especially because Doodle\u0027s widow hadn\u0027t packed a black dress for the trip out to the crater. Oh well...\u003C/p\u003E\u003Cp\u003EAnyway, after this, Captain Bill and Redshirt Bob were hustled back to KSC and blasted off-planet just before the police arrived. I think it was Heinlein who said, \u0022When the ship lifts, all bills are paid. No regrets.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CK0Ubgq.jpg\u0022 alt=\u0022CK0Ubgq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile, Jeb was told to furl his solar panel and pack up his Xbox in preparation for rescue. He was in a highly inclined retrograde orbit so Bill and Bob had to tinker with their trajectory a couple times en route to line up with Jeb as best they could, especially as they initially would have been going prograde.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dlXmFUU.jpg\u0022 alt=\u0022dlXmFUU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/88R1knV.jpg\u0022 alt=\u002288R1knV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut all in all, they didn\u0027t do too bad a job. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EiFqt6v.jpg\u0022 alt=\u0022EiFqt6v.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen they just had to rotate their apses around and shrink down to Jeb\u0027s level. I did that part, then let MechJeb2 set up the synchronization and get within 100m, after which I RCS\u0027d my way into 15m at 0 relative speed and waited for the sun to come up before sending the redshirt out to face horrible death aka EVA.\u003C/p\u003E\u003Cp\u003EBut this is where Redshirt Bob bungled the job. Always before in practice, he\u0027d jumped out the hatch as soon as the ships were close so did so out of habit and grabbed one of the ports outside the hatch. He was just about to shove off for Jeb\u0027s ship when Bill told him to wait a few minutes, so he went back inside with the dismountable port still on his back. When the sun rose, he jumped out again and the 1st port was gone, so was glad the KSP boffins had thought to provide 2 of them. So he grabbed the 2nd port and jetting over to Jeb\u0027s ship.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/r9LNKpz.jpg\u0022 alt=\u0022r9LNKpz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd he managed to get there without kicking it spinning all over, which he\u0027d done several times in practice. He grabbed Jeb\u0027s ladder and reached for the port. AND. IT. WOULD. NOT. GIVE. HIM. A. RIGHT. CLICK. MENU. AAAARRRRGGGGHHHH!!!!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YEMUCRd.jpg\u0022 alt=\u0022YEMUCRd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI suppose ending the 1st aborted EVA with the 1st port on his back screwed up his \u0022inventory\u0022 system. Anyway, nothing for it but for Bob to jet back to the tanker. He did so, noticing it had drifted about 150m away, but he\u0027s gotten good at EVA flying with all the practice so this wasn\u0027t a problem.\u003C/p\u003E\u003Cp\u003EWith Plan A in a shambles, it was time to try Plan B, having Jeb abandon ship. So Bill nudged the tanker back to 15m from Jeb and off he went. Considering he\u0027d never done an EVA, he did amazingly well, grabbing the tanker\u0027s ladder on the 1st attempt, right on the hatch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FsRGt1B.jpg\u0022 alt=\u0022FsRGt1B.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, somewhat deflated but still glad to have Jeb back, the tanker shoved off for home. The Kerbsonian will have to wait a while longer to get the capsule, but it\u0027s in a safe orbit so maybe someday.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W7kWPzj.jpg\u0022 alt=\u0022W7kWPzj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EReturn and re-entry were uneventful. This time there was a photo op \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iuL5b15.jpg\u0022 alt=\u0022iuL5b15.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd there this story ends for the time being. Jeb\u0027s ship can rot. I\u0027ve got other projects to get on with \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2013-06-18T22:54:15Z","Content":"\n\u003Cp\u003EGreat job with the mission! Just a tip, \u0022H\u0022 is the key you want to press to place the KAS dismountable portsÃ¢â‚¬â€œ it has no context menu (kinda confusing but it still works I suppose). I wish you luck on your future missions! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-18T23:32:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OrbitusII\u0022 data-cite=\u0022OrbitusII\u0022\u003E\u003Cdiv\u003EGreat job with the mission! Just a tip, \u0022H\u0022 is the key you want to press to place the KAS dismountable portsÃ¢â‚¬â€œ it has no context menu (kinda confusing but it still works I suppose). I wish you luck on your future missions! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the props. That was only my 3rd Kerballed flight outside Kerbin orbit so I\u0027m kinda happy with just getting Jeb home, although I\u0027m steamed I couldn\u0027t get his ship, too, after all the preparation.\u003C/p\u003E\u003Cp\u003EH didn\u0027t work, either. Both right-click and normally do the job but once the 2nd port was on Bob\u0027s back, it was totally dead, even unable to be dropped. I\u0027m assuming was this because he ended his 1st EVA with the 1st port on his back. Very annoying. That was 1 thing I hadn\u0027t done in practice because I didn\u0027t expect to ever do it.\u003C/p\u003E\u003Cp\u003EEVA seems to screw a lot of things up. I\u0027ve noticed the reported times in the End Flight report get thrown off if you do an EVA in the middle. Also, switching from Kerbal to ship tends to make the EVA-ing Kerbal let go of any ladder he was holding at the time of the switch. Like when in practice I got the cable connected, I had Bob hanging onto the target ship. But when I switched to the docked ships to transfer the fuel, Bob came loose and was adrift about centered between the ships during the transfer. This was highly annoying because he\u0027d kicked the target into a wild gyration when he put the port on it, so catching it was a major pain, and he had to catch it again to disconnect the cable from the port when the transfer was done.\u003C/p\u003E\u003Cp\u003EBut I keep telling myself it\u0027s just an alpha game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2013-06-19T00:00:19Z","Content":"\n\u003Cp\u003EI like the idea of the \u0022transformable\u0022 lander.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-06-19T03:47:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pipcard\u0022 data-cite=\u0022Pipcard\u0022\u003E\u003Cdiv\u003EI like the idea of the \u0022transformable\u0022 lander.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, but I\u0027m sure it\u0027s been done long before now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027m not too happy with this design. OT1H, it has the fuel for tiny rocks like Minmus but OTOH, its whole mechanism requires a fair amount of gravity for it to stand up and lie down without bouncing over the horizon, and where there\u0027s that much gravity, it doesn\u0027t have enough fuel. So I think if I ever try something like this again, it\u0027ll naturally be rather bigger and will probably gently lower itself onto its wheels instead of acting like a springtail bug \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"}]}