{"TopicId":34905,"ForumId":51,"TopicTitle":"Testing my new SSTO, or \u0026quot;The new kid needs a name\u0026quot;","CreatedByName":"Matze1984","CreatedById":60686,"CreatedDateTime":"2013-06-26T21:14:05Z","PageNum":1,"Articles":[{"CreatedByName":"Matze1984","CreatedById":60686,"CreatedDateTime":"2013-06-26T21:14:05Z","Content":"\n\u003Cp\u003ELong time ago I created my firt SSTO and had some fun with it on missions to the Mun and back. Unfortunately it won\u0060t get get much further to any other planet. If I could reach the nearest one than there is no return. So I decided to design a new one with at least one nuclearengine for much more fuelefficient travels.\u003C/p\u003E\u003Cp\u003EAfter several houres I came up with this nice spaceplane. Now all what is left are the testfights to find the flaws in my design and make the tiny adjustmends. Actually nothing realing an usual to me than, that was what I thought.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img46/4456/09e9.png\u0022 alt=\u002209e9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo lets check all systems and get it going.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img46/4451/6xev.png\u0022 alt=\u00226xev.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat a surprise it is flying realy good despite it is not tuned right now. Let see how fare she gets. Afer climbing higher and higher through the atmosphere it is time to start the rockets.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img96/1969/a52.png\u0022 alt=\u0022a52.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYaeh! It got into orbit with quite a bunch of fuel left, especially compared to my first SSTO.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img845/8724/zsb7.png\u0022 alt=\u0022zsb7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo after simply reaching a 300 km to 300 km Orbit it is time to land this nice new spaceplane back at KSC. Lets get down. Uh, coming in a bit hot.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img46/2136/gq.png\u0022 alt=\u0022gq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo this point everything went quite smooth, but as I got in the thicker layer of the atmosphere my luck was gone. The SSTO got out of control and started spinning around wildly. I tried as hard as I could to get it back under control but at nearly 1 km over the ocean the was nothing left but to abort. As the cockpit was gliding down to safety I watched the mainpart going left and right up and down still tumbling around. And than it did come directly towards me.\u003C/p\u003E\u003Cp\u003ENNOOOOOOOOOO!!!!!! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\u003Cp\u003E*splash*\u003C/p\u003E\u003Cp\u003EOMG I am still alife, you are kidding me aren\u0060t you?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img20/3005/i4b.png\u0022 alt=\u0022i4b.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe mainpart just missed me with only millimeters and kind of \u0022landed\u0022 in the water. Hey, it seems she swimmes much better than she is flying. OK I take this as an omen, so from now on she shall be known as \u0022Ocean Spirit\u0022.\u003C/p\u003E\u003Cp\u003EToday she is well fitted and nearly perfect balanced, got her to the Mun right now as well. So Duna Im coming for you.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img441/6652/7kl.png\u0022 alt=\u00227kl.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2013-06-26T22:50:44Z","Content":"\n\u003Cp\u003EI think Orca sounds like a good name.\u003C/p\u003E\n"},{"CreatedByName":"Mefi282","CreatedById":63817,"CreatedDateTime":"2013-06-27T18:32:37Z","Content":"\n\u003Cp\u003EFirst this plane is awesome! Is it possible to deliver payloads into orbit with it?\u003C/p\u003E\n"},{"CreatedByName":"Odo","CreatedById":69000,"CreatedDateTime":"2013-06-27T18:45:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nutt007\u0022 data-cite=\u0022Nutt007\u0022\u003E\u003Cdiv\u003EI think Orca sounds like a good name.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEVE Online?\u003C/p\u003E\n"}]}