{"TopicId":36338,"ForumId":51,"TopicTitle":"Best moment of KSP so far","CreatedByName":"Hello moto","CreatedById":66294,"CreatedDateTime":"2013-07-08T18:46:46Z","PageNum":1,"Articles":[{"CreatedByName":"Hello moto","CreatedById":66294,"CreatedDateTime":"2013-07-08T18:46:46Z","Content":"\n\u003Cp\u003EAfter half completing my monstrous main body of my first mother ship which comes up to 500 parts so far, I needed to go to be. So I hyper edited it to 100k orbit and launched one of my prototype missiles which fires 2x8 separations just before it reaches the target at it. It struck and when I reloaded it I found out that the main bridge was completely destroyed. However, upon closer inspection (It was on the dark side of the planet) I found that the auxiliary bridge was still operational! So I told bob to go de-orbit it to see what it would look like, and see if Jeb was still on board. He wasn\u0027t happy but that didn\u0027t stop me from editing him to about 1 km away. He disembarked his capsule and flew the long voyage over. The ship looked like a hunk of dead metal (which it was) but that didn\u0027t deter bob. Quickly looking through the engineering section, everything looked good. So he clambered across the hull to the auxiliary bridge. He activated the ship and luckily everything still worked out right. Firing up the engines, the ship tilted up for some strange reason, so I then spent ten minutes trying to toggle certain engines off and on to correct the course and eventually entered a very gradual descent. Flames licked the hull but I didn\u0027t care, my beast was hurtling towards the ground with bob realizing he was about to be reborn. It crashed spectacularly.\u003C/p\u003E\u003Cp\u003EOverall it was a thrilling 20 minutes which made me feel as though I had come across a derelict battle ship, damaged in some battle in the past, and I felt like the explorers who would board it and turn systems on. That\u0027s why I love this game so god damn effing much.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-07-08T19:14:09Z","Content":"\n\u003Cp\u003EThe best part of KSP is that you can make up your own stories with the kerbals and the spacecraft you build. This game requires imagination for maximum enjoyment \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hello moto","CreatedById":66294,"CreatedDateTime":"2013-07-09T02:55:14Z","Content":"\n\u003Cp\u003EThat gives me an idea to have a bunch or different ships derelict in different orbits and you have to explore them all and scavenge what you can and find various things to help out in travels\u003C/p\u003E\n"}]}