{"TopicId":38624,"ForumId":51,"TopicTitle":"The Adventures of the KERdog","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-07-25T02:04:55Z","PageNum":1,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-07-25T02:04:55Z","Content":"\n\u003Cp\u003ESo 1st thing I did in 0.21 was build an airplane. Not just any airplane, but the KERdog (pun on cur dog). After much frustration, I\u0027ve given up on VTOLs so built this plane as a STOL. MUCH easier, MUCH simple, MUCHO better. It can, in its basic configuration, leave the ground at 20m/s in about its own length, and can make a full stop landing in about 1.5 lengths. So I had some fun flying it around in and out of tight spots and flagging all the newly jagged islands south of Airbase Island.\u003C/p\u003E\u003Cp\u003EIt\u0027s a strange beast. The ladder on 1 side of the cockpit made it pull to the right so I added an airscoop on the other side to balance that, which it did better than I\u0027d hoped.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gc7BVeU.jpg\u0022 alt=\u0022gc7BVeU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I decided to drive a big rover over the mountains W of KSC towards that easter egg out there. But the rover wrecked negotiating the 1st major mountain pass, stranding 4 newly recruited Kerbals on the mountainside. Just the job for the KERdog. It normally being a single-seater, I slapped 4 lawn chairs on the belly and went out to the crash site.\u003C/p\u003E\u003Cp\u003EThe crash site:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GYzr6BG.jpg\u0022 alt=\u0022GYzr6BG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb was flying KERdog. He circled the location a couple of times and decided the only option was to land in the deep, crater-like valley below the wreckage. So it was a steep approach but the KERdog practically parachutes in with its huge wing. Jeb landed no problem.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/s5yPuri.jpg\u0022 alt=\u0022s5yPuri.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen it was a matter of rolling the 4 stranded Kerbals (Lanski, Gerton, Sigwise, and Seeely) down the hill to the KERdog and strapping them upside down into the lawn chairs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uy4EiTu.jpg\u0022 alt=\u0022uy4EiTu.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb now had to take off. He had about 50m before a pretty steep cliff in front. KERdog normally takes off with just 1/3 power but Jeb decided he needed to firewall it. So with the 4 other Kerbals hanging on below, Jeb roared up out of the canyon, nearly scraping the cliff wall all the way up.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/r1nOgAM.jpg\u0022 alt=\u0022r1nOgAM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll went well and soon KSC was visible ahead.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3CfiTeP.jpg\u0022 alt=\u00223CfiTeP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a safe landing, the 5 Kerbals climbed atop the KERdog for a picture to commemorate the event.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/r2rJywj.jpg\u0022 alt=\u0022r2rJywj.jpg\u0022\u003E\u003C/p\u003E\n"}]}