{"TopicId":39246,"ForumId":51,"TopicTitle":"A new game, a new name, a new flag... Same dodgy rocket building.","CreatedByName":"Milkshakefiend","CreatedById":70644,"CreatedDateTime":"2013-07-26T23:05:17Z","PageNum":1,"Articles":[{"CreatedByName":"Milkshakefiend","CreatedById":70644,"CreatedDateTime":"2013-07-26T23:05:17Z","Content":"\n\u003Cp\u003EIn honour of .21 I decided to RP it up a little and make my own aerospace company. Ladies and Kermen, I present to you Delta Aerospace! My mission: Explore the Kerbol system, establish extraterrestrial outposts, Do Science and most importantly - leave no Kerbal behind. \u003C/p\u003E\u003Cp\u003ENo time was wasted in \u0027designing\u0027 a rocket, and finding a crew to man took no time at all - Jeb threatened to flush the keys to the rocket down the toilet if he, Bill and Bob didn\u0027t get to go first. \u003C/p\u003E\u003Cp\u003EThe flight recorder went down during takeoff, however it did reestablish connection in time to catch the splendor of the new MÃƒÂ¼nar surface from orbit\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bbBQQBC.jpg\u0022 alt=\u0022bbBQQBC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanding was broadly textbook - the new SAS really makes gently touchdowns with zero surface velocity a breeze. The computer upgrades were kept secret to Jeb - he just thinks all the video games have given him superkerbal reflexes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pS4syZD.png\u0022 alt=\u0022pS4syZD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn spite of the crews protests, an remote-controlled rover scouted the surroundings before letting the crew set foot on the new MÃƒÂ¼n\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Zvh8oXQ.png\u0022 alt=\u0022Zvh8oXQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb thought he had found proof of extraberbestrial life, however mission control informed him it was part of the rocket they landed in and that no, it wouldn\u0027t fit in the soil sample cargo hold.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CImP0Ef.jpg\u0022 alt=\u0022CImP0Ef.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHaving declared the surface free of tripping hazards and collected a few samples, the rover returned and redocked\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/N3pfG67.jpg\u0022 alt=\u0022N3pfG67.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHaving broken the handheld camera and exhausted the allotted oxygen supply for this leg of the mission, the crew returned and set a course for Kerbin. Fate was against them though, as a miscalculation left the triumphant trio stranded in an elliptic orbit around Kerbin, With electrical systems running low on charge and oxygen dwindling, it was up to Team 2 to rescue the veterans.\u003C/p\u003E\u003Cp\u003EAlthough the view up here was fantastic, the standby team were keen to rendezvous with the Mun lander\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YJLKMZI.jpg\u0022 alt=\u0022YJLKMZI.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EClosing to within visual distance, the rescue team radioed the Mun team \u0022Hows the air up there? Thick with CO2 yet?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/m9O70DV.jpg\u0022 alt=\u0022m9O70DV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs commander, Jeb is last out of the ship. The rest of the team joke about Jeb stranding them through his refusal to stop and radio for directions and debate closing the airlock\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VsXn9Ns.png\u0022 alt=\u0022VsXn9Ns.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs the rescue ship departs, no tears are shed for the dying vessel as it is left to drift for eternity\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ypt9anl.jpg\u0022 alt=\u0022Ypt9anl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill and Bob look slightly worried as the resue craft reenters - in the rush to get a rescue team to them, little thought was paid to the higher weight of the return craft and the ramifications this would have on the parachutes...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rtiHCW9.jpg\u0022 alt=\u0022rtiHCW9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...Massive success! The untested double-layer parachute deploys and slows the craft.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/c9n63GG.jpg\u0022 alt=\u0022c9n63GG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the debrief the standby team are given commendations for the first successful orbital rescue. Jeb is given a slap for not listening during initial briefings.\u003C/p\u003E\u003Cp\u003EWork commences on Mun Lander MK II - more efficient engines, a larger fuel tank and a larger oxygen supply are fitted as a result of the first failed mission.\u003C/p\u003E\u003Cp\u003EMunar touchdown is gentle. Bill confirms green lights across the board - lack of power, fuel or electricity won\u0027t stop the team this time. After several vicious rounds of rock paper scissors lizard Spock, Bill descends to the virginal soil\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sXehjTf.jpg\u0022 alt=\u0022sXehjTf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe marvels at the desolate grandeur as he plants the mission flag\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SCh2bh5.jpg\u0022 alt=\u0022SCh2bh5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe others disembark and look upon the stark wasteland\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wJ9iAx3.jpg\u0022 alt=\u0022wJ9iAx3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHaving (finally) successfully completed the initial phase of the mission the trio return to their cramped vessel. Bill waves goodbye as the rockets throttle up - he\u0027ll be returning soon with a more spacious vessel, but he misses the alien landscape already.\u003C/p\u003E\u003Cp\u003EToday was a busy day:- A semi-successful MÃƒÂ¼n landing, a subsequent stranding during return, followed by my first rescue mission and finally a successful landing and return. Planning has begun for a larger lander capable of unlimited time on the Mun as well as the supply missions to keep the mission going.\u003C/p\u003E\u003Cp\u003EFor those interested, below are the company logo, Mun and Minmus mission flags I designed. I used Inkscape which was remarkably simple. Any tips from people used to workin with vector art would be greatly appreciated.\u003C/p\u003E\u003Cp\u003ECompany logo\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UR0piVy.png\u0022 alt=\u0022UR0piVy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMun and Minmus mission flags\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zKbnoB0.png\u0022 alt=\u0022zKbnoB0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Porg48z.png\u0022 alt=\u0022Porg48z.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks for reading - I\u0027ll update the post when the next phase of the mission goes ahead!\u003C/p\u003E\u003Cp\u003E~M\u003C/p\u003E\n"},{"CreatedByName":"DesertWolf","CreatedById":74456,"CreatedDateTime":"2013-07-26T23:58:39Z","Content":"\n\u003Cp\u003EAwesome. I like your flags, simple yet elegant. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: Btw, what were you using for mods, especially rover storage.\u003C/p\u003E\n"},{"CreatedByName":"Milkshakefiend","CreatedById":70644,"CreatedDateTime":"2013-07-27T03:41:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DesertWolf\u0022 data-cite=\u0022DesertWolf\u0022\u003E\u003Cdiv\u003EAwesome. I like your flags, simple yet elegant. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003Cp\u003EEdit: Btw, what were you using for mods, especially rover storage.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks very much. I was shooting for simple - elegant is a bonus!\u003C/p\u003E\u003Cp\u003EThe rover storage was from ST Spacetech - \u003Ca href=\u0022http://kerbalspaceprogram.com/st-spacetech-landing-program-v1-0/\u0022 rel=\u0022external nofollow\u0022\u003ESpaceport Link\u003C/a\u003E - but I also use bits from NovaPunch, KW, AIES, IonCross, etc.\u003C/p\u003E\u003Cp\u003EBeware though - that rover storage is a pain. It\u0027s quite difficult to design a rover that can actually fit through the doorway. Smaller wheels would help alot here - something I haven\u0027t got in the myriad mods I use lol.\u003C/p\u003E\n"}]}