{"TopicId":40396,"ForumId":51,"TopicTitle":"The Kethane Travelling Circus Book 1: Duna","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-01T03:36:58Z","PageNum":1,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-01T03:36:58Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 1: TESTING\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFirst off, I\u0027d like to dedicate this to whoever it was posted up that he successfully did a manned grand tour of the Kerbol system in 10 years with what looked like an ion ship. Magnificent! Too bad I got interrupted while I was reading it so didn\u0027t reply to that thread and now I can\u0027t find it. Oh well.\u003C/p\u003E\u003Cp\u003EAnyway, to business. Kethane. Previously only known as a source of blue flames when drunk Kerbals had been eating too many snacks, recently it\u0027s been discovered throughout the Kerbin system and there\u0027s no reason not to expect to find it everywhere else. The promise this gives of ending fuel shortage problems inspired the boffins to create the Kethane Travelling Circus. This will consist of a mobile space station known as the KethLab Mothership, which will refine Kethane into LOF and monopropellant for itself and various other ships. Some of the various other ships are the drilling rigs that will provide Kethane to the Kethlab Mothership, so it\u0027s sort of a self-perpetuating monstronsity. Other uses will include dedicated landers and whatnot to explore the various systems visited as the KTC moves around, to be sent out from home and left at that planet. This is because the main purpose of the KTC is just to cruise all around the Kerbol system in a long, \u0022lost weekend\u0022 sort of expedition, doing whatever comes to mind at the time, leaving a long trail of discarded boosters, tugs, tankers, and Kerbals in its wake.\u003C/p\u003E\u003Cp\u003EFirst on the agenda is the despoiling of Duna and Ike. The highlight of this gig will be the DORK, a name decided upon because somebody else has already used DERP. The DORK is the Duna Overflight Requiring Kethane, previous working title having been Keth-o-Plane (thanks to King Snoke for the name). Basically a jet using the Kethane engines. Light weight, huge wing, intended for very thin air. Here it is during testing on Kerbin, where it was able to take off at 15m/s:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Dajm7Sc.jpg\u0022 alt=\u0022Dajm7Sc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMuch to my surprise, the 0.21 SAS was able to get this thing off the ground, just a routine launch. But then, I\u0027m not using FAR like I was in 0.20. I strongly suspect this thing would be impossible in FAR, or would need to be an SSTO. I\u0027ve had 1 successful SSTO and don\u0027t wish to repeat the experience so I\u0027ve very glad I was able to launch it as a rocket. I have no idea at all whether this will work on Duna but that\u0027s why Kerbalnauts get paid like the lab rats they are \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003ESo then I built the KethLab Mothership gave it a thorough shakedown, testing docking ports and moving it around.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/84xq4Y2.jpg\u0022 alt=\u002284xq4Y2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe KethLab Mothership is the essentially vertical part, the upper half being the KethLab and the lower half with all the docking ports being the Mothership, each launched individually, plus the tug (not show) to move it around. In the lower right, you can see the DORK and its tug really did get to orbit. That was 1 launch. In the lower left is Ike Rig #1 Kethane drill. This was 2 launches to get here, one for the rig and the Keth Scan/MapSat probe formerly attached to where it\u0027s now docked, and the transfer tug for both (neither shown). Something like this will eventually happen at Duna when the DORK loads its fuel tanks before attempting re-entry. Another pleasant surprise in all this was that the solar panels didn\u0027t hit each other or other ships, because I sure didn\u0027t know they had clearance beforehand.\u003C/p\u003E\u003Cp\u003EOK, the basic design of the KethLab Mothership worked, so it was time to see if I could move it as a unit or would have to assemble it at Duna, so up went the transfer tug I\u0027d designed for it and off went the rig and the DORK to their separate fates. I have long-standing habits of not trusting multi-part ships to stay together, least of all not wobble, and the same goes for copious amounts of Space Tape. So, I built the tug double-ended and tried it first as a tractor, in a free-return figure-8 orbit around Mun and back to repeated aerobraking tests at Kerbin. Everything worked perfectly, yet another surprise.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6Zu1GTq.jpg\u0022 alt=\u00226Zu1GTq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce I was back where I\u0027d started, I switched ends with the tug and tried the same trip as a pusher. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TPu5Z0A.jpg\u0022 alt=\u0022TPu5Z0A.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAmazingly, this was just as stable as using it as a tractor. Because the pusher mode as zero chance of burning any parts of the KethLab Mothership and seems just as practicable, that will be how I\u0027ll do it for real. Which means I can get rid of the long outriggers for the engines and the associated strutting. Hell, I can get rid of lots of lacing struts all over the thing because rockets seem much more structurally secure in 0.21. With things as they are, including the tug the KethLab Mothership has 275 parts, which seems to be bogging even my top-end, liquid-cooled computer. That needs to change.\u003C/p\u003E\u003Cp\u003ENot mentioned so far is the infrastructure on Duna to support the DORK. This will be another Kethane drill and a fuel bowser rover to move raw Kethane between the drill and the DORK. The drill will have rudimentary housing for whichever poor Kerbal I end up stranding as permanent gas station attendant (working the KAS on the bowser). There are also plans to get most of the infrastructure set up before sending out any Kerbals because they can\u0027t do much more than plant flags and work KAS anyway, so they\u0027ll go out in another ship that\u0027s capable of getting home, and will have a lander to get down to the DORK base that\u0027s already been set up by remote control.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T14:35:06Z\u0022 title=\u002211/02/2013 02:35  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ramnrmeul","CreatedById":48560,"CreatedDateTime":"2013-08-01T17:18:17Z","Content":"\n\u003Cp\u003EWhy is the rover called a \u0027Bowser\u0027 rover?\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-01T17:44:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ramnrmeul\u0022 data-cite=\u0022ramnrmeul\u0022\u003E\u003Cdiv\u003EWhy is the rover called a \u0027Bowser\u0027 rover?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor some reason people in the aviation business say \u0022bowser\u0022 where everybody else in the world says \u0022fuel truck\u0022. Same sort of vocational slang thing as sailors saying \u0022port\u0022 and \u0022starboard\u0022 instead of \u0022left\u0022 and \u0022right\u0022. I used to work in the aviation industry so I picked up the term. Because the Duna side of the KTC operation is basically an airport, and the rover\u0027s job is to refuel the DORK, I naturally call the rover a bowser.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-03T19:22:36Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 2: The 1st Wave Launches\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOK, after thorough testing, including an actual landing on Duna to test parachutes, it was time to get the Kethane Traveling Circus on the road. So, after creating a new save game and copying the craft files over (to simulate all the testing having been done in a simulator without anything actually leaving the ground), I set to work.\u003C/p\u003E\u003Cp\u003EThe KTC\u0027s Duna gig is currently envisioned as consisting of 3 waves:\u003C/p\u003E\u003Cp\u003E1. Getting the Kethane drills to Duna and Ike (including mapping both for Kethane and surface features), and getting the refining station in Duna orbit.\u003C/p\u003E\u003Cp\u003E2. Creating the airbase on Duna by sending over the Dork and the bowser.\u003C/p\u003E\u003Cp\u003E3. Finally sending out Kerbals to actually use this stuff.\u003C/p\u003E\u003Cp\u003EThe 1st wave is the biggest and most complex, and just getting it off the ground was the job for today session. This wave consists of 3 interplanetary ships, the Ike Package, the Duna Package, and the KethLab MotherShip. The Ike and Duna Packages are drills and probes, with the Duna drill intending to be essentially a permanent fixture at the future airbase, while the Ike drill will hump Kethane down from Ike to the orbital refinery, to keep the ships fueled. All 3 ships were assembled in orbit from 7 launches and 5 dockings. This all took lots of real time and nothing exciting happened (thanks to all the testing). The rest of this post will just show how this happened. Boring stuff, but I\u0027m somewhat proud of having suffered through it. Most of the 7 launches used my standard ascent stage for 20-30ton payloads, which I\u0027ve been using for several months now. Being an unimaginative sort, I just call it \u0022the lifter\u0022. So there\u0027s not a lot of rocket variation in the pics, either.\u003C/p\u003E\u003Cp\u003EAnyway, 1st up was the Ike drill/probe combo:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YNZgvqS.jpg\u0022 alt=\u0022YNZgvqS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen the Duna drill/probe combo:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EfdL301.jpg\u0022 alt=\u0022EfdL301.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen 2 nearly identical transfer tugs, 1 for each drill/probe combo. The only difference in the tugs is that they have lights in different places so I can tell them apart visually.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bTuc76T.jpg\u0022 alt=\u0022bTuc76T.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese 4 launches and 2 dockings resulted in the fully assembled Ike Package.....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5KI8ou6.jpg\u0022 alt=\u00225KI8ou6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E....and Duna Pakage:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/q2QPXhp.jpg\u0022 alt=\u0022q2QPXhp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen the KethLab MotherShip, which required 3 launches and 3 dockings. The MotherShip going up:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1gK5Yur.jpg\u0022 alt=\u00221gK5Yur.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe extra docking involved in this assembly was just switching the MotherShip\u0027s small auxiliary tug from 1 end to the other. Don\u0027t know if I\u0027m really going to take this little tug all the way to Duna, but it might be useful so for now it\u0027s in.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wi0lEHH.jpg\u0022 alt=\u0022wi0lEHH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe KethLab was the only really different launch vehicle. I don\u0027t have any empty tank mods and all the docking ports made TAC Fuel Balancer go nuts, so in the end I opted to burn the tank empty on the way up and made an asparagus-ish thing, which as you can see I normally don\u0027t do. The above issues also necessitated putting a separator between the small tug and the main KethLab, turning the tug into a disposable booster, which I jettisoned just before docking by shifting into reverse with RCS once I was more or less lined up with the MotherShip, firing the separator, then coming back forward with RCS.\u003C/p\u003E\u003Cp\u003EThe KethLab on the pad showing its crossfeeding nature:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gqQhW5n.jpg\u0022 alt=\u0022gqQhW5n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJettisoning the KethLab booster during the docking process:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XYkFoGL.jpg\u0022 alt=\u0022XYkFoGL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen there was the transfer tug for the KethLab MotherShip. As shown in Episode 1, this was originally built to be used as a tractor but testing showed it worked just as well as a pusher, so I redesigned it to become a dedicated pusher. This let me reduce the part count somewhat by pulling the engines in closer to the middle. This was also launched with the standard ascent stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Nuok2ci.jpg\u0022 alt=\u0022Nuok2ci.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd so at last all 3 ships were complete. The KethLab MotherShip deployed its panels and antennae to make sure they worked, then stowed the panels to await the transfer window. The antennae of course are stuck open but testing showed they survive aerobraking just fine so no big deal. And no big deal if they don\u0027t, because they don\u0027t do anything anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nQF4gbR.jpg\u0022 alt=\u0022nQF4gbR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd so, there we are. The 1st Wave of the Kethane Traveling Circus is set to go. Tune in next time for the trip to Duna. I expect there\u0027ll be some drama then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-04T22:25:08Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 3: 1st Wave Departure and Arrival of Ike Package\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith everything sitting in ~90km orbit ready to go, there was nothing to do but run time forward until Day 59 and the launch window. None of the tugs had used enough fuel during assembly to warrant the hassle of sending up tankers. So, fast forward and off we go. \u003C/p\u003E\u003Cp\u003EThis was my 1st attempt in KSP at doing a flotilla of ships in the same launch window so at the back of my mind I was always worried they\u0027d all arrive at once, despite knowing from that other game this probably wouldn\u0027t happen. SO I just burned them 1 after the other, waiting only long enough between them to create nodes and come around the orbit to them, trusting to this slight time difference, imperfections in the burns, and mid-course tweaks to spread them out manageably far apart at the Duna end.\u003C/p\u003E\u003Cp\u003EFirst off the mark was the KethLab MotherShip with its untested redesigned pusher tug. It worked fine, no wobbles being detected at all.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/z3TEX97.jpg\u0022 alt=\u0022z3TEX97.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen the Ike Package:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ecuHhYB.jpg\u0022 alt=\u0022ecuHhYB.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELast to go was the Duna Package:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VWxA4fa.jpg\u0022 alt=\u0022VWxA4fa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, the 1st Wave flotilla was FINALLY underway. Sure enough, there was no need to worry about the next ship arriving while trying to do the aerobrake on the 1st. Despite leaving 1st, the KethLab MotherShip ended up being about 4 weeks behind 1st-arriving Ike Package, with Duna Package being 10 days behind Ike Package. This time difference allowed the Ike Package to complete Phase 1 of its mission with 2 days to spare before Duna Package arrives. So the rest of this episode will just be about the Ike Package.\u003C/p\u003E\u003Cp\u003EThe Ike Package has the most demanding job in the 1st Wave. Phase 1 of the Ike Package\u0027s mission was to 1) map Ike, 2) scan Ike for Kethane, 3) obtain a load of Kethane, and 4) get the Kethane into Ike orbit to await the arrival of the KethLab MotherShip. Because the Ike Package as no refining capability, all fuel required for these objectives had to come from Kerbin so the delta-V budget was rather tight. That will change once the KethLab MotherShip arrives, but for Ike Package Phase 1, everything had to go essentially flawlessly. And none of the later stages had been tested, just calculated on paper, so I wasn\u0027t sure it would all work. So, after offering a libation to the Delta-V Gods, I gave it a go.\u003C/p\u003E\u003Cp\u003EUpon arrival, much depended on the initial aerobrake maneuver. Every one is different and there are no hard-and-fast rules so I feel no shame in F5/F9 until I get it right, to simulate Mission Control running simulations \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. As it turned out with this ship, aiming for an 11km periapsis worked swimmingly. During the pass, I got down to 10km and was slightly worried. Here, the Ike Package passes a high mountain, glad it wasn\u0027t directly ahead:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZGdRSKs.jpg\u0022 alt=\u0022ZGdRSKs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe aerobraking put me into an elliptical orbit with an apoapsis about 2.3Mm out, about 3/4 as far out as Ike. Which was where I was going anyway. Perfect! It took negligible delta-V to circularize this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/L5Sy9D3.jpg\u0022 alt=\u0022L5Sy9D3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo then it was just a matter of riding around waiting for the best phase angle, like I did coming out here to begin with, then a mere fart of a burn to coast out to Ike. While setting up this maneuver node, I had a strange thing happen that I\u0027ve never seen before. There came a point while pulling on the gizmos that it showed me captured into Ike orbit immediately upon entering its SOI. And doing this cost only 35 delta-V!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4s9Bakk.jpg\u0022 alt=\u00224s9Bakk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENaturally, I had to give it a try, for bragging rights if nothing else. But I didn\u0027t trust it so Mission Control simulated this, too (F5/F9 again). Turns out, the above picture was a lie. What happened was, I actually hit Ike\u0027s SOI at about where the ascending node is shown, and from there nearly an instant lithobrake before I could do anything. So, if you ever get something like this, be VERY CAREFUL \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. After I reloaded the quicksave, I just did the normal thing and all went well.\u003C/p\u003E\u003Cp\u003EWell, I\u0027d done all I could in the delta-V battle. I\u0027d used about 1050m/s leaving Kerbin. After that, getting into a 235km equatorial Ike orbit had coast about 250m/s total. So now it was time to see if what I had left was enough to complete Phase 1. First step was to pump some fuel into Doodlebug Ike*, the mapping probe, and send it on its way. I only gave it about 1/2 a tank. It needed a fair amount to get into a polar orbit but it\u0027s very light so didn\u0027t need much, and I was worried I might not be able to get any excess fuel back once Ike was mapped.\u003C/p\u003E\u003Cp\u003E*NOTE: \u0022Doodlebug\u0022 is oilfield slang for guys who use explosives and geophones to detect oil here on Earth. Being an old oilfield hand, and because you DRILL for Kethane, I use oilfield terms for all my Kethane stuff.\u003C/p\u003E\u003Cp\u003ESo, Doodlebug Ike detached from the Ike Package and set off on its mission with about 8 days remaining before the arrival of the Duna Package.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2Y6pEMs.jpg\u0022 alt=\u00222Y6pEMs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst it went up to 252km at 80.43^ inclination for a broad-picture mapping scan, then down to 87.8km at 85.9^ for Kethane scanning and to fill in the gaps in the map. Mapping planets is boring but doesn\u0027t hold a candle to scanning for Kethane. GEEZ, that takes a long time, even at 100x time warp, even on a small place like Ike, tying up the computer until it\u0027s done. But finally, with about 2.5 days remaining before the next ship arrives, I figured I knew enough to commit the Ike Rig No. 1 (another oilfield term) to a landing on a Kethane field. I was waiting to find one that was reasonably close to the equator to minimize delta-V, on reasonably flat ground for a safe landing, had at least 16,000 \u0022barrels\u0022 in it to fill the rig\u0027s tanks, and was on the sunny side so I could get to work immediately. I finally found such a place so made sure the rig\u0027s fuel tanks were full then finished the break-up of the Ike Package into Ike Rig No. 1 and Tug Ike.\u003C/p\u003E\u003Cp\u003EIke Rig No. 1 landed successfully and got a gusher right off the bat.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YHvIapS.jpg\u0022 alt=\u0022YHvIapS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt only took about 1/2 a day to fill its tanks, finishing just as the sun was setting. Now the rig had to get back up into orbit and rendezvous with its tug. In this loaded condition, it had a 1.81 TWR and 737 delta-V. Would that be enough?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cKjmGXk.jpg\u0022 alt=\u0022cKjmGXk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, I put the rig up into a 20km orbit, about all it had fuel for (about 230 delta-V left). Then I brought the tug down to it and linked them up, on the opposite end from the way they\u0027d gone out, and pumped the rig\u0027s remaining fuel back into the tug. Here\u0027s the result:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fttAZte.jpg\u0022 alt=\u0022fttAZte.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, I\u0027ve now got 850m/s delta-V to lug 16,000 barrels of Kethane to Duna orbit. Playing with maneuver nodes before I quit indicated lithobraking on Duna only takes 170m/s so I\u0027m pretty confident I can make it to the KethLab MotherShip when it arrives in a month. Besides, by then I\u0027ll have 2 more tugs I can scrounge fuel from if necessary.\u003C/p\u003E\u003Cp\u003ESo, I\u0027m happy. The 1st Wave is off to a good start. Next, we\u0027ll see what happens with the Duna Package.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-06T16:43:27Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 4: The Duna Package Arrives\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E2 days after the events above, the Duna Package duly arrived.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qQo4Pxh.jpg\u0022 alt=\u0022qQo4Pxh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt had the seemingly simple task of mapping Duna for topography and Kethane, then establishing the expeditionary airbase in a convenient place to investigate any anomalies discovered. But the devil is in the details. Note the small size of the probe in the pic above, no bigger than a beer keg thanks to having to sit atop the generator. Pre-launch testing had shown that bringing the whole package in with a polar orbit, while it made life easy for the probe, was a real pain for the rest of the package, mostly because all the other main components of the KTC will be in equatorial orbits, meaning Tug Duna would become essentially useless. So, the package had to come in equatorial, which put a strain on the probe then getting into polar orbit. Much paper calculations showed that if the package settled into about a 500km equatorial orbit, Doodlebug Duna would have just enough juice to establish itself in a 87.8km orbit inclined 85.9^. So no quick, high-altitude mapping this time, just the slow, low-altitude orbit doing mapping and Kethane together. Oh well.\u003C/p\u003E\u003Cp\u003ESo, now to aerobrake into an orbit of the correct size. Because the Duna Package had a different configuration and was coming in with less velocity, data gained from the Ike Package couldn\u0027t be used directly, but could be fed into the simulator back at Mission Control to figure out how to aerobrake the Duna Package. Eventually, the boffins decided (several F5/F9 tweaks later) that a periapsis of about 11800m would probably work.\u003C/p\u003E\u003Cp\u003ESo down went the Duna Package. Here it is discovering a terrain feature that has now been officially named Aerobrake Valley.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VWzvqQg.jpg\u0022 alt=\u0022VWzvqQg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis resulted in a 435km apoapsis on the other side, which would have to do. Was the probe up to it? Only 1 way to find out. So Doodlebug Duna pumped its tiny fuel tank full and set off. Much to everyone\u0027s surprise, it made it into the desired orbit with about 200m/s to spare. It then began its task of mapping Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5AXlTKj.jpg\u0022 alt=\u00225AXlTKj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt this point, the KethLab Mothership was still 20 days out. I figured I\u0027d need all of that to map something as big as Duna but Doodlebug Duna managed it in 7. Of course, that\u0027s 7 days at no more than 50x time warp so that was about 3.5 real hours of watching paint dry. I really HATE scanning for Kethane \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. So the folks at Mission Control decided to take the week off and party. When they staggered back to the office with massive hangovers, the task was essentially done and now it was time to pick a landing zone. This time, the requirements were:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Ereasonably close to the equator to save as much lander delta-V for the descent as possible,\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ereasonably good supply for extended use\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ereasonably flat ground, both for lander safety and to serve as an airfield for the DORK,\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ein fairly low ground to give the lander\u0027s parachutes the best chance, and\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ereasonably close to at least 1 anomaly because the DORK\u0027s endurance on a tank of fuel at Duna is totally unknown.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAs the boffins spun their map displays around, they were appalled to note that none of the Kethane fields met all these requirements. Most were in high latitudes and in forbidding terrain. But they finally noticed there was one field straddling the equator that was almost centrally located between the 3 anomalies detected. It had a good supply of Kethane. But it was at medium altitude and from what they could tell of the terrain from orbit, it wasn\u0027t particularly flat. However, all the other choices were worse so it had to be this one.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wowz6Un.jpg\u0022 alt=\u0022wowz6Un.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo the remains of the Duna Package came down to a 50km orbit and split up into Airbase Duna and Tug Duna. With Airbase Duna fully fueled up, Tug Duna still had about 1/3 of its fuel left. It had expended about 1600m/s to get here.\u003C/p\u003E\u003Cp\u003EI confess that spot landings are not my forte and I\u0027ve only ever done 1 Duna landing before. But pre-launch testing showed that the current incarnation of MJ, my usual crutch, can\u0027t make spot landings on Duna so I had to do it myself. Fortunately, all I had to do was hit somewhere in a big green blob, although I really wanted to be as close to the eastern edge as possible, because from what I could tell that looked the flattest. So, I just used MJ to set a target mark on the surface and keep me pointed retro while I did the burns and watched what my path was doing. I set the target in the center of the blob right under my orbit and guesstimated 3 Kethane hexes east of it as the lead required by the atmospheric drag and Duna\u0027s rotation. Then I fired the engines and down I went. I warped at 5x until I hit the atmosphere, watching in the map how my path was moving. It had crept 1 hex west toward the target mark so I figured I was good. From here on, I flew it from the main view.\u003C/p\u003E\u003Cp\u003EChutes deployed passing through 20km, although they didn\u0027t start to streamer until about 15km. 2 big drogues, 2 big circles, and 8 radials.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QRXvAsL.jpg\u0022 alt=\u0022QRXvAsL.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe lower I got, the less flat the terrain looked. In fact, it appeared that I was heading for a rather tall hillside so I stood on the throttle in hopes of coming down in the lower, flatter place just before the hill. And then it was just control velocity and come down as gently as possible, hoping for the best. A real 2 minutes of terror there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI still ended up on the hillside. But fortunately, and totally by chance, I happened to hit a shoulder sticking out from the main massif, which was relatively flat on top. Terrain altitude at landing site 2500m. But 1st things first. Let\u0027s see if I managed to hit the green blob.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ykYrhfP.jpg\u0022 alt=\u0022ykYrhfP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EKETHANE! YAY!\u003C/p\u003E\u003Cp\u003ESo, um, where are we, anyway?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6HvGQGI.jpg\u0022 alt=\u00226HvGQGI.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EÃƒâ€¡a c\u0027est bon, ÃƒÂ§a! I hit the eastern edge of the field, right where I really wanted to be but had no real hope of ending up. Lesson learned: Duna\u0027s atmosphere doesn\u0027t do squat to arrest your forward progress on a 1/4-of-the-planet descent from 50km. I ended up right were my path came down last I looked at it about 40km up.\u003C/p\u003E\u003Cp\u003EOK, but now the big question: is this a good place for an airfield?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/X1K0dhv.jpg\u0022 alt=\u0022X1K0dhv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUm, well.... maybe. There\u0027s a reasonable amount of flat ground in the immediate vicinity of Airbase Duna and the DORK is a SSTOL (SERIOUSLY short takeoff and landing) plane. If this was Kerbin, I\u0027d say no problem. But this is 2500m up on Duna so no telling until the DORK arrives in the 2nd wave. On the bright side, however, the rolling sand dunes stretching to the horizon don\u0027t seem to impose any obstacles to rover travel. Thus, the bowser\u0027s landing doesn\u0027t have to be that close to the Airbase; it can drive here, and it or hopefully the DORK can fetch wayward Kerbals when their lander arrives (now moved up to the 2nd wave). When they get here, they\u0027ll have a home already established (thanks to the Hitchhiker on the Airbase).\u003C/p\u003E\u003Cp\u003ETune in next time for the arrive of the KethLab MotherShip, which should be uneventful, although once it gets here the reassembled Ike Package will have to carefully rendezvous with it to deliver its load of Kethane. Will it have enough fuel?\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-10T05:34:18Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 5: KethLab MotherShip Arrives\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo, following the dramatic landing of Airbase Duna, nothing at all happened for another 20 days. Then the KethLab MotherShip, despite being the 1st to leave Kerbin, finally arrived. It was poking along at a mere 950-odd m/s so only needed to aim for a 11800m periapsis during aerobraking. It was so slow and so relatively high that there were no fireworks at all, nor any close encounters with terrain features. The previously deployed antennae suffered no harm.\u003C/p\u003E\u003Cp\u003EEDIT: And despite having 3 joints made up of docking ports with no struts of any kind, there was zero wobble in the ship the whole flight, including aerobraking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/L1lJWvb.jpg\u0022 alt=\u0022L1lJWvb.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, the KLMS did manage to spot Aerobrake Valley on its way back up, so the place is now definitely marked on the map. Lucky for future Duna expeditions, it runs pretty much E-W along the equator about 90^ west of where Airbase Duna landed.\u003C/p\u003E\u003Cp\u003EAnyway, I wanted a 150km orbit for the KLMS, at least until I learned that wasn\u0027t convenient for all the other stuff flying around. The aerobrake put the me at 146.5km, close enough:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iPOV4lU.jpg\u0022 alt=\u0022iPOV4lU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, with the KLMS safely in Duna orbit, it was time to see if the Ike Package could get its load of Kethane to it. When we last saw the Ike Package a month ago, it was in a 20km equatorial orbit around Ike with 850m/s dV left in its tanks. Most of the boffins back at Mission Control were confident this was enough to rendezvous with the KLMS but some were skeptical because EVERY mission so far has always taken more fuel than expected. But try it must, so the Ike Package waited for a good opportunity and then burned for a 200km orbit at Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8dmCiO0.jpg\u0022 alt=\u00228dmCiO0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a couple of orbits, Ike Package synched up with the KethLab MotherShip and burned down to it. When the smoke cleared, all was fine with 363m/s left in the tanks.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SLz9VUI.jpg\u0022 alt=\u0022SLz9VUI.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDocking was uneventful and happened just as the combined assembly swung around to the daylight side of Duna. So it was pile on full sail (12x Gigantor solar panels), crank up the Kethane-burning generator for good measure, and go right into refining. The 16000 units of Kethane proved to be enough to totally refuel the Ike Package and almost refuel the KLMS, too, all before the sun went down. 1 more trip to Ike should be enough to top off the KLMS, refuel Tug Duna, and still have enough raw Kethane left over to fill up the DORK when it arrives.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZXjodkK.jpg\u0022 alt=\u0022ZXjodkK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, apart from this 1 trip back to Ike, Phase 1 of the Duna Gig 1st Wave is complete. In preparation for this last little bit, the combined ships secured for sea and waited an orbit to pose for a picture back in the sun, the longest thing I\u0027ve yet had in space.\u003C/p\u003E\u003Cp\u003EEDIT: rotating this mass for a good picture angle also produced zero wobble in the docking ports.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/55478QF.jpg\u0022 alt=\u002255478QF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, the stuff in the Duna system is pretty much just waiting on the arrival of the 2nd Wave, which won\u0027t be for a long while (next launch window plus travel time). But back on Kerbin, that time will be spent in feverish redesign work. Last-minute tests showed the KE-J65 engines of the DORK probably wouldn\u0027t work on Duna at all. So now the boffins are scrambling to verify this and, if it does prove to be a major problem, come up with some other way to accomplish the same mission. What will happen next? Who knows? Who cares?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-10T05:48:15Z\u0022 title=\u002208/10/2013 05:48  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 10, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-19T01:31:45Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 6: Meanwhile, Back on Kerbin....\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith the 1st Wave of the KTC safely at Duna and doing its various jobs, preparations began to launch the 2nd Wave, the highlight of which was to be the DORK (Duna Overflight Requiring Kethane). This had passed initial flight and launch tests with flying colors, but an unexpected problem arose with its powerplant, the KE-J65 Zero-Bypass Kethane Turbine. Further testing discovered that this engine cut in and out totally unpredictably, making it unsuitable for any imagined use.\u003C/p\u003E\u003Cp\u003ESo the engineers set to work redesigning the engine (my 1st and only hack of a CFG file), resulting in the KE-J85D, designed for better performance in a light aircraft and with the air intakes tweaked to work better in Duna\u0027s thin air. 2 of these were hastily retrofitted to the DORK which, along with several other minor modifications, resulted in it becoming the Mk III.\u003C/p\u003E\u003Cp\u003EBy this time, the new simulator (aka HyperEdit in a separate saved game) was up and running at KSC so for the 1st time it was actually possible to get decent flight data for the conditions on Duna, instead of just high altitude at Kerbin. This showed that while the new engine could be expected to perform adequately, the whole DORK airframe had a tragic flaw. It could enter the atmosphere and fly around no problem, but despite its incredible STOL performance on Kerbin, it was incapable of slowing down to less than about 80m/s on landing. This proved totally disastrous in the hilly sand dunes around Airbase Duna\u0027s location, every single landing attempt ending in multiple fireballs. There was thus nothing for it but to go back to the drawing board.\u003C/p\u003E\u003Cp\u003E2 teams set to work, one attempting to retain as many features of the DORK as possible, especially the need to burn Kethane because that was the whole point of the mission. The other team investigated electric power, abandoning the whole Kethane thing. Both teams at first tried to retain the DORK\u0027s interior seating for 3 Kerbals which, combined with attempts to increase wing area, resulted in rather large designs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2ukNhac.jpg\u0022 alt=\u00222ukNhac.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere we see some of the bigger ideas. Going clockwise, top left is the DORK Mk III. It could fly on Duna but couldn\u0027t land. Top right is the DEF (Duna Electric Flier), utilizing a massive RTG and carrying a Hitchhiker as well. Sadly, on Kerbin, it couldn\u0027t even reach the equivalent altitude of Airbase Duna. Bottom right is the DORK 2 or \u0022Double DORK\u0022, essentially the same fuselage as before but with twice the wing area. This designed was unable to fly on Kerbin without tumbling uncontrollably. Finally, in the bottom left is the DRUNK (Duna Recon Using Natural Kethane). This dropped seating to 2 but both were still inside, and was the 1st to use a hybrid Kethane-electric power plant. It worked well enough put into the Duna simulator, where it was able to enter the atmosphere and land safely. However, it lacked the power to take off again. By this time, the engineers were beginning to realize they needed not only more wing but less weight, so these big designs were abandoned.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/u9OIGsJ.jpg\u0022 alt=\u0022u9OIGsJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo now smaller designs appeared. On the left is the DORK 3, little more than wings and the KE-J85D engine with 2 lawn chairs taped on the front. This proved to have the same problems as the original DORK only worse--the engine was far too powerful for this light plane so it never advanced beyond testing on Kerbin. The electric team, meanwhile, made the DEB (Duna Electric Biplane), also going for the minimalist approach. While this flew quite well, testing on Kerbin showed that it could only fly heading away from the sun, its operational parameters were too limited, although it probably would have flown well on Duna. And finally, somebody suggested abandoning wings entirely and using a balloon, resulting in the DKZ (Duna Kethane Zeppelin). However, the unavailability of a suitable balloon left this project in the mock-up stage.\u003C/p\u003E\u003Cp\u003EFinally, just when the whole idea of flying around on Duna seemed on the verge of defeat, some mad genious combined the best features of several of these failed designs and created the DOH (Duna Overflight Hybrid):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PUkwKWs.jpg\u0022 alt=\u0022PUkwKWs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt has the 2 open seats of the DORK 3, the Kethane-electirc hybrid propulsion system of the DRUNK upgraded to 2 engines, and 2 sets of the original DORK\u0027s wings from the auspicious flights of the DEB. High-altitude tests on Kerbin showed promise, especially if there was lower gravity to help, so the DOH was loaded into the simulator and tested under Duna conditions.\u003C/p\u003E\u003Cp\u003EAND IT WORKED!!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wubIry0.jpg\u0022 alt=\u0022wubIry0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt successfully entered the atmosphere and dropped into a flying regime, able to hold altitude at 5km. And then it successfully landed at 30m/s despite bouncing over several sand dunes, and taxied up steep hills. And then, wonder of wonders, it was able to take off again. It requires a long run to build up speed and needs to go uphill for a ski-jump effect, but once off the ground it can gain altitude and maneuver around. Everything about it is clumsy: the landing runs are extremely long and bumpy, it takes off like an albatross, and it turns like a cow, but it\u0027s tough enough to handle this, won\u0027t nose over, and in general gets the job done.\u003C/p\u003E\u003Cp\u003EI\u0027m also quite pleased with the Kethane-electric hybrid power plant I thought up. This combines solar panels with the Kethane generator and some fuel tanks. When the solar panels don\u0027t provide enough, the generator kicks in and makes up the shortage, burning a little Kethane in the process. The result is continuous electric power in a fairly light package and an extremely long range, regardless of sunshine. It\u0027s probably not as efficient as total electric but for something that can\u0027t have sun-tracking panels due to its motion and doesn\u0027t always face the sun, it\u0027s a pretty good compromise.\u003C/p\u003E\u003Cp\u003EBuilding an airplane that can fly on Duna was harder than making my 1st SSTO. I\u0027m quite proud of myself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E. Anyway, now the KTC is back in business. Next up will be the launch (at least) of the 2nd Wave, and soon thereafter the DOH will be exploring Duna.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-29T01:06:32Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 7: \u0022Um, launch windows.....?\u0022\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EBuilding an airplane that can fly on Duna was harder than making my 1st SSTO. I\u0027m quite proud of myself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E. Anyway, now the KTC is back in business. Next up will be the launch (at least) of the 2nd Wave, and soon thereafter the DOH will be exploring Duna.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, the irony. Given the total lack of problems the 0.21 SAS had with launching the DORK, I figured the D\u0027OH would be routine, too. NOT!! It had too much lift to survive launch on a rocket so there was nothing for it but to turn it into a spaceplane by appending a SABRE-powered SSTO ascent stage onto its butt. Getting the D\u0027OH to LKO proved at least as difficult as making it fly on Duna. This was doubly the hardest challenge I\u0027ve ever met in KSP.\u003C/p\u003E\u003Cp\u003EBut this epic tale will have to be told later. See, once the boffins had finally sorted out this problem and were hoisting their tankards in celebration, some junior lab assistant spoiled the party by reminding everybody that Duna wasn\u0027t the only stop on the KTC\u0027s tour. Nope, according to the Kerbal Almagest (aka Alex\u0027s Launch Window site), it would have to go to Dres next and a window to get stuff there from Kerbin before stuff at Duna could get there was coming sooner than the next Duna window. Plus, there was a Jool window at about the same time and we needed to use it. Needless to say, that junior lab assistant will not be invited to any more parties \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E. But the half-drunk and HIGHLY annoyed senior boffins couldn\u0027t deny what he said so there was nothing for it but to push the deadmen aside and get back to work on not just 1 but 2 major design projects with fast-approaching deadlines.\u003C/p\u003E\u003Cp\u003ESo, Dres. This place not having anything of apparent interest, the mission there is just to survey, refuel, and continue on, leaving nothing but a flag and maybe a transfer tug. For this, the KTC needs both a lander and a probe/Kethane rig/transfer tug package. And to keep from having to do another crash research program for every other future KTC destination, the boffins made the probe big enough to be retrieved and the rig and lander capable of landing on Moho, Dres, Val, and Eeloo. The lander can also do Laythe although it needs refueling on the ground, which is something to worry about later, there being a deadline now. Writing these planet names on the chalkboard--Moho, Dres, Laythe, Val, Eeloo--some halfwit decided to name these craft after the suggested Roman numbers. Thus, the lander is the 1555 (aka MDLV) and the rig is the 1505. That\u0027s about as imaginative as my ship names go; deal with it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. In any case, the plan is that both will become permanent additions to the KTC, going everywhere else it goes. To this end, the mapping probe is big enough to return to the rest from its polar orbit.\u003C/p\u003E\u003Cp\u003EHere\u0027s the 1555 Lander all ready for its launch window. Note the innovative design employing 2 radially mounted 1-man lander cans and the absence of landing gear to save weight. When manned, one of the cans defaults to the \u0022control from here\u0022 part and if the crew doesn\u0027t remember to change that to the probe core up top, the thing flies in circles. But what do you expect from a rush job? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d6GAikD.jpg\u0022 alt=\u0022d6GAikD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd below is the 1505 Package. It can only lift 8000 barrels of Kethane, 1/2 the usual amount, but that\u0027s what I get for designing it for higher gravities. All the other combinations of engines were rather worse and anyway, DEADLINE. Note the massive probe sitting on the nose.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/H3LXwXK.jpg\u0022 alt=\u0022H3LXwXK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the Dres situation more or less under control, attention turned to Jool. Not that anybody knows when the KTC will get there, but pre-staging its system-specific equipment will take 2 waves, the composition of the 2nd depending on the results of the 1st, so best to get started early. The basic plan is to send the usual probe/rig/tug package permanently to Pol as the primary fuel source within the Jool system now and in the future, to survey all the other moons (with an eye towards Val and Bop as alternate fuel sources), to land on Tylo purely for propaganda purposes, and to do something cool with airplanes on Laythe. What happens on Laythe, however, is totally dependent on where the Kethane there turns out to be. Oceanic fields cannot be exploited with current technology and there ain\u0027t much land area, so the chances are good that there will be no useable Kethane on Laythe. If there is, then great. Land some permanent airbases and colonists. If not, then any Laythe base or colony will require a rather complex fuel shuttle service from other moons, which I haven\u0027t even begun to think about yet. So, the 1st order of business is to map all the moons for Kethane.\u003C/p\u003E\u003Cp\u003ETo accomplish this task, behold the Probe Cluster. It\u0027s just my standard interplanetary tug modified to carry 4 small probes, 1 each for Laythe, Val, Tylo, and Bop. All this is intended to stay in the Jool system.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kRngyvH.jpg\u0022 alt=\u0022kRngyvH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s certain there\u0027ll be Kethane somewhere on Pol, however, and whatever happens in the Jool system will need it. So here\u0027s the probe/rig/tug package to get it. In an effort to reduce the tippiness of the Ike Rig, this one\u0027s short and wide. Also, its probe is smaller and its got a Kethane-burning generator to eliminate its dependence on sunshine.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t66rdl2.jpg\u0022 alt=\u0022t66rdl2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd finally, there\u0027s the Tylo Lander, simply designed to allow 1 Kerbal to go down, plant a flag, and return. No point in taking it elsewhere so it\u0027ll remain here in case somebody else needs it in the future.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o0r0hwd.jpg\u0022 alt=\u0022o0r0hwd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll in all, getting all this going required 9 launches and 4 dockings. All routine stuff, the standard KW Rocketry lifter and the same tugs seen before. It just took a lot of time. And all this had to be done before I can get into the 5 or so launches needed for Duna\u0027s 2nd Wave and get on with the exploits of the D\u0027OH.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-05T03:58:48Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 8: Duna 2nd Wave \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOK, with the pre-staged equipment to Dres and Jool en route, it was time to get the Duna\u0027s 2nd Wave up and at \u0027em. So, first up was another KethLab to take the place of the KethLab-MotherShip when it shoves off for Dres. Nothing much to see here, same refinery structure as before with the standard tug.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ziWKkFS.jpg\u0022 alt=\u0022ziWKkFS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext, the Duna Bowser, a rover equipped with seats for 4, 2 KAS winches, tanks for every type of fuel, and a small-scale Kethane refinery to make whatever\u0027s needed. It\u0027s job mainly to shuttle raw Kethane between Airbase Duna and the D\u0027OH but it can also refuel the lander that will take the crew down to Duna. Airbase Duna\u0027s solar panels will provide the electricity necessary for the refinery to work. This thing is so light it can do with a built-in transfer stage instead of a tug.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oK6Nbpe.jpg\u0022 alt=\u0022oK6Nbpe.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut all this infrastructure needs a crew so below we have here the Kerbal Kans and the Duna Lander attached to their tug. The tug is the left-hand part, then the lander with the other engines and all the parachutes, and then 2 Hitchhikers with a jolly crew of 8 pressed Kerbals who are only now just waking up from the lumps on their heads. Neilvis, Lenfal, Samlorf, Obbal, Neweny, Cambles, Franklin, and Adgas. It\u0027s only 130-odd days until they launch window so they have plenty of time to learn their menial duties from the instructional videos and can \u0022do science\u0022 in the meantime \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Zjjl8cR.jpg\u0022 alt=\u0022Zjjl8cR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe plan for all this is that the lander and the can with the umbrellas will stay in the Duna system with the Ike Package and whatever goes down to stay on Duna. This will include at least 2 Kerbals in the lander, although the lander can get back up again if need be.\u003C/p\u003E\u003Cp\u003EBut the star of this show is the D\u0027OH, the last-minute replacement for the DORK. Its extremely high lift made it impossible to launch vertically so there was nothing for it but to turn it into a spaceplane SSTO. Making that fly was just as hard as making the D\u0027OH itself fly on Duna. Here\u0027s the result just starting its tale-off roll at KSC:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/S1yzsln.jpg\u0022 alt=\u0022S1yzsln.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat we have here is a separate SSTO ascent stage grafted onto the rear of the biplane D\u0027OH. This ascent stage consists of a big central fuel tank with docking port, some extra fuel and B9 SABRE engines hanging on the sides, and then the B9 Heavy Wings to keep it all airborne and heading in the right direction. The whole thing is a tail-dragger using the D\u0027OH\u0027s main gear up front and some small tailwheels under the ascent stage\u0027s big wing. It flew itself off the runway at 50m/s and continued up with low forward speed but high right of climb (thanks to all the wing).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y6vQw2N.jpg\u0022 alt=\u0022y6vQw2N.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStill, the whole thing was able to limp its way into orbit at 84km after switching the SABREs to rocket mode at 25km and about 1000m/s after 15 or so minutes of flight. The big wings are on radial separators so can be ditched as needed leaving just the engines. The original plan was to jettison the big wings once in orbit but it occurred to the boffins that they might be needed for aerobraking at Duna so until they crunch all the numbers (as in, F5/F9 a few times at Duna), they\u0027re staying attached.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t0HpKGC.jpg\u0022 alt=\u0022t0HpKGC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, once the D\u0027OH was up, I docked a modified standard transfer tug to it. The modification was to add 6 radial Kethane tanks around it Given that the KethLab-MotherShip is already pushing part count and the D\u0027OH is also, it might be prudent to park the D\u0027OH in orbit away from the KLMS and have the tug go get the Kethane it might need for its descent to Duna. I like to keep my options open \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-07T04:12:53Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 9: Housekeeping\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELots of activity today but nothing very spectacular. The Great Plan is in motion and this was just one of the more boring phases of it.\u003C/p\u003E\u003Cp\u003ETo begin with, I realized that the Hitchhiker components of the Kerbal Kanz lacked RTGs so would be unable to move around between the KLMS and anything else as intended. There was thus nothing for it but to send up the New, Improved, Limited Edition Kerbal Kanz Mk II complete with RTGs. And because I was feeling lazy, that\u0027s all I did, meaning I left the Duna Lander tacked on to the new Kanz on the same lifter. Then I docked the new version to the original, EVA\u0027d all 8 Kerbals from the old Kanz to the new, ditched the old Kanz, turned the new ones around and docked them back. So now I\u0027ve got 2 Duna Landers for a bit of redundancy there should hilly ground prove the undoing of the 1st.\u003C/p\u003E\u003Cp\u003EKerbal Kanz at start of EVAs:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/40ehKGU.jpg\u0022 alt=\u002240ehKGU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinal configuration of Kerbal Kanz with 2 landers.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yTl5fnX.jpg\u0022 alt=\u0022yTl5fnX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHaving gotten that cleared away, it was time to send off Jool\u0027s 1st Wave, previously launched and waiting in orbit. I hadn\u0027t expected this for another 100-odd days (due to the Launch Window web site not showing a window before then) but Kerbal Alarm Clock swore it was a good time to go and I had to agree. So, off went those 3 ships.\u003C/p\u003E\u003Cp\u003EThing is, though, I\u0027m a fireman. I had today off but was still on-call and damn if somebody didn\u0027t fall over and get hurt right in the middle of the 2nd transfer burn. Nothing for it but to stop the game and go to the call, resulting in that ship using WAY more delta-V than planned. Oh well, them\u0027s the breaks. But I figured the other ships in the flotilla, plus the KLMS when it arrives, would pick up the slack so I went with it. Then I started burning the 3rd ship and damn if I didn\u0027t have to go to another call, which caused equally bad delta-V consequences for it. \u003C/p\u003E\u003Cp\u003EWell, that tore it. Now I\u0027d blown my delta-V budget so I had to send out some tankers. Still being lazy, I just shot off a couple copies of the transfer tug used to push the Kerbal Kanz. They\u0027ll arrive with plenty of fuel to solve any problems as they don\u0027t have to push any payloads out there. And for good measure, while I was at it I launched identical tugs/tankers to LKO to go to Duna with the 2nd Wave and to Dres as well when their windows come up.\u003C/p\u003E\u003Cp\u003EThe tugs aka tankers all looked like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XeB7gIx.jpg\u0022 alt=\u0022XeB7gIx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBottom line, I ended up doing 5 transfer burns for Jool, my biggest flotilla yet. Kerbal Alarm Clock says they\u0027ll arrive within a 20-day span but none closer than 5 days apart. I\u0027ll see how the mid-course trajectories change that. But anyway, here they all are headed to Jool:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9wHeHcy.jpg\u0022 alt=\u00229wHeHcy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen it was time to do some tidying up at Duna in preparation for the 2nd Wave\u0027s arrival. Last we checked in there, the Ike Rig was docked with the KLMS having delivered its 1st load of Kethane. So I sent it back down to Ike, got another load, brought it back to LDO, and finished refueling those members of the Duna 1st Wave that needed it. And then back to Ike for a 3rd load. This stopped in a higher orbit to transfer raw Kethane to the D\u0027OH when it arrives. What\u0027s left will be taken back down to the KLMS to become LFO and mono.\u003C/p\u003E\u003Cp\u003ESo, quite a busy day all, in all. Just none of it really exciting. Box score:\u003C/p\u003E\u003Cp\u003E5 Launches: New set of Kerbal Kanz and Duna Lander, 4 tankers\u003C/p\u003E\u003Cp\u003E4 Rendezvous: New Kerbal Kanz, Ike Rig #1 with Ike Tug twice and Ike Package with KLMS once\u003C/p\u003E\u003Cp\u003E5 Dockings: New Kerbal Kanz twice, Ike Rig #1 with Ike Tug twice, and Ike Package with KLMS once\u003C/p\u003E\u003Cp\u003E5 Transfer Burns to Jool: Probe Cluster, Pol Package, Tylo Lander, and 2 tankers\u003C/p\u003E\u003Cp\u003E8 EVAs\u003C/p\u003E\u003Cp\u003E2 Landings on Ike\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-07T15:17:43Z","Content":"\n\u003Cp\u003EThanks to whoever gave this thread a 5-star rating \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-15T16:23:59Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 10: Off for Dres\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI finally had another chance to play this morning so took the opportunity to continue the KTC game. As things stood when I started, I had the following stuff going on:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAt Duna:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAirbase Duna on the surface, Kethane tank full\u003C/p\u003E\u003Cp\u003EKethLab-MotherShip in a 146km orbit at Duna\u003C/p\u003E\u003Cp\u003EIke Rig #1 full of Kethane in a 200km orbit around Duna\u003C/p\u003E\u003Cp\u003EDoodlebug Duna in about a 90km polar orbit around Duna\u003C/p\u003E\u003Cp\u003EDoodlebug Ike in about a 90km polar orbit around Ike\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EOutward Bound for Jool (but not far beyond Minmus yet)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EProbe Cluster\u003C/p\u003E\u003Cp\u003EPol Package\u003C/p\u003E\u003Cp\u003ETylo Lander\u003C/p\u003E\u003Cp\u003EJool Tanker 1\u003C/p\u003E\u003Cp\u003EJool Tanker 2\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EIn LKO\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1505E Package waiting on Dres window\u003C/p\u003E\u003Cp\u003E1555 Lander Package waiting on Dres window\u003C/p\u003E\u003Cp\u003EDres tanker waiting on window\u003C/p\u003E\u003Cp\u003ED\u0027OH SSTO waiting on Duna window\u003C/p\u003E\u003Cp\u003EDuna Bowser waiting on window\u003C/p\u003E\u003Cp\u003EKethLab Duna waiting on window\u003C/p\u003E\u003Cp\u003EDuna Tanker waiting on window\u003C/p\u003E\u003Cp\u003EEDIT: Kerbal Kanz and Duna Landers waiting on window. (Knew I had 8 things in orbit)\u003C/p\u003E\u003Cp\u003ENothing else needed building or launching so it was just advance time to the Dres window due in about 80 days, then off we go. The 3 Dres-bound ships look just like they did when I launched them a few posts above so no need for more pics of them. Thus, only 1 pic this time, showing the map view after I finished the Dres burns. While waiting for the Dres window, the Jool-bound flotilla almost reached Dres\u0027 orbit. Anyway, that\u0027s 8 interplanetary ships underway at once. And in 20-odd days, I\u0027ll add 5 more bound for Duna. This is starting to get complicated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/94V0xvZ.jpg\u0022 alt=\u002294V0xvZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDres itself is already unexpectedly complicated and will become more so. This is my 1st time going there and I went in assuming it would be just a routine transfer. Wrong. First off, due to nuke engines not having a lot of thrust, the burns were 10-12 minutes. This, combined with the node placement dictated by the ejection angle, made the 1st half of the burn be pointing literally straight down at Kerbin, and my parking orbits weren\u0027t high enough for this to work. So I improvised. 1 ship I did the burn in 2 parts with an elliptical orbit between. The other 2 I just did the burn later, once Kerbin was mostly out of the way.\u003C/p\u003E\u003Cp\u003ENeedless to say, I didn\u0027t have an encounter either way, nor even \u0022closest approach\u0022 markers, but I figured no big deal, I\u0027ll just tweak that once out of Kerbin\u0027s SOI. That\u0027s when I discovered Dres has a TINY SOI that\u0027s bloody hard to hit. The upshot of all this was that even with tweaking burns from just beyond Minmus, the best I could manage was to at least get closest approaches down to 300-500km for the various ships. Now having looked at the Wiki, I see the SOI is only 32.8km. Egad! But I figure some mid-course tweaks down the road a ways will finally get me encounters.\u003C/p\u003E\u003Cp\u003EAnd hopefully by then, the 3 ships heading there will be spread out somewhat in time. Another unanticipated problem with a tiny target is that units of flotillas will tend to arrive very close together. I hope I end up with enough time between the ships to give each the attention it needs. But I don\u0027t yet have any encounters so I have no way of knowing just yet. In any case, this is going to be interesting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003ESo, I learned all that. I also learned doing the 2-part burn is more efficient that delaying a 1-piece burn. The ship with the 2-part burn only needed about 60m/s to get a close approach whereas the other 2 needed about 250m/s. Lucky I packed a lot of fuel; I don\u0027t think this will be a problem when I get there.\u003C/p\u003E\u003Cp\u003EAll this mucking about with Dres consumed all my available playing time for today so the Duna stuff will have to wait some more. Sorry.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-15T21:28:36Z\u0022 title=\u002209/15/2013 09:28  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 15, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-16T18:18:01Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 11 -- Duna 2nd Wave Departs\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOK, I had a couple hours to spare so I ran time forward, did a few mid-course tweaks to the Jool flotilla, then FINALLY got around to sending the Duna 2nd Wave on its way. YAY!\u003C/p\u003E\u003Cp\u003EThis flotilla consists of 5 ships:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe Kerbal Kanz, consisting 8 Kerbals in 2 Hitchhikers, 2 Duna Landers, and a transfer tug,\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKethLab Duna, a copy of the KL part of the KethLab-MotherShip already at Duna,\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Duna Bowser Mk II, a rover to go with Airbase Duna,\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Duna Tanker, and last by certainly not least,\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe D\u0027OH SSTO!\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAll this stuff had been in orbit already for 154 days or so. The press-ganged Kerbals had spent this time watching instructional videos on how to do their jobs at Duna and beyond. And they probably did some science of some sort, too, although that really isn\u0027t in their job description. In any case, I\u0027m sure the Kerbals were glad finally to get moving, as seen here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zrVoVb3.jpg\u0022 alt=\u0022zrVoVb3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll of the ejection burns went smoothly, the longest being about 6 minutes for the Kerbal Kanz. Most of them got Duna encounters from the get-go but I did have to tweak 2 of them once they got out of Kerbin\u0027s SOI.\u003C/p\u003E\u003Cp\u003EHere\u0027s the mighty D\u0027OH SSTO taking a last look back at Kerbin shortly after finishing its transfer burn. It\u0027s still got its big wings just in case they\u0027re needed for aerobraking at Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oY347Gl.jpg\u0022 alt=\u0022oY347Gl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, in total, at this moment I have 13 interplanetary ships coasting outward bound on their transfer orbits: 5 for Jool, 3 for Dres, and now 5 more for Duna. As you can see here, the Duna flotilla will arrive 1st, then Jool considerably later, and finally Dres well behind that. In the meantime, the KethLab-Mothership will depart for Dres about 100 days after the arrival of the Duna 2nd Wave.\u003C/p\u003E\u003Cp\u003EHere\u0027s what it all looks like from the map:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y81cUuR.jpg\u0022 alt=\u0022Y81cUuR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you can\u0027t read the KAC display, the arrival times for the Duna 2nd Wave are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E Duna Tanker: 74d 4h\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ED\u0027OH SSTO: 75d 19h\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKethlLab Duna: 77d 10h\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBowser Duna: 78d 2h\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKerbal Kanz: 78d 22h\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe shortest interval between arrivals is 16 hours between the 3rd and 4th. That should be more than enough to jump between 1 and the other as needed. We\u0027ll see. I guess I\u0027m getting better at doing transfer burns because the Duna 1st Wave was spread over 20 days or so. I occurs to me that I should deliberately add some inefficiency so I get a wider spread, but I\u0027ll only do that if the above spacing proves to be a problem.\u003C/p\u003E\u003Cp\u003EAnyway, the plan in general is for the D\u0027OH and the Bowser to land at Airbase Duna. 2 Kerbals will then go there in 1 of the landers and FINALLY start exploring the place with the D\u0027OH. The other lander will stay in Duna orbit as a spare. And the more I think about it, the more I think I\u0027ll leave the KethLab-MotherShip at Duna. I really don\u0027t see a need to lug all its docking ports all over the system and they\u0027d probably be more useful at Duna, which will soon start to be rather heavily populated. Thus, KethLab Duna will get renamed, linked up with the Hitchhikers of the Kerbal Kanz, and take the other 6 Kerbals off to Dres and then wherever.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-16T20:48:42Z\u0022 title=\u002209/16/2013 08:48  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 16, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-24T03:06:10Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 12 -- Duna 2nd Wave Arrivs\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo, after 80-odd days in transit, interrupted by me doing quite a few mid-course burns for the 13 different ships then en route, the 5 ships of the Duna 2nd Wave arrived at their destination. They had undergone quite a bit of course tweaking because when they were about 2/3 out, I realized they were all going to be in retrograde orbits, so I had to change that, which took several small burns for each ship. This also delayed their arrival by about a week, reordered their arrivals, and also bunched them rather closer together, so I expected things to be interesting. They were.\u003C/p\u003E\u003Cp\u003EFirst off, the D\u0027OH got an unexpected early encounter with Duna (as in, it wasn\u0027t shown on the map) that DID turn out to be retrograde. D\u0027oh is right! Even worse, it was WAY out there, only being within Duna\u0027s SOI for 14 minutes. Not being sure if I\u0027d get a 2nd encounter at the expected place afterwards, I had to burn hard to get captured and flip the orbit to prograde. This took about 1200m/s, more than the ejection burn. Fortunately, the D\u0027OH\u0027s tug still had about 3600m/s in the tanks so this wasn\u0027t a problem, just an annoyance, although the burn was nearly as long as my time in Duna\u0027s SOI. In the pic below, you can see Duna there in the distance backlit by the Sacred Strut.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jQw8YyR.jpg\u0022 alt=\u0022jQw8YyR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs a result of this burn, the D\u0027OH got captured into a comet-like orbit with a Pe of about 20km and an Ap of 43 MILLION. It took it 3 days to get down to Pe from there. 3 days after everything else was already safely in orbit, and it came at Duna from the opposite direction as all the other ships.\u003C/p\u003E\u003Cp\u003EThe other ships all arrived with nice prograde orbits on the same day, spread fairly evenly all through it. That alone was OK but each ship needed several tweaks to fine-tune its Pe for aerocapture. All this meant that about once an hour, I was changing to a different ship to do one of its tweaks. This made things a bit hectic and worrisome but as it happened, I always had time to finish what I was doing with 1 ship before having to deal with the next, so nothing fell through the cracks.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rae8MZh.jpg\u0022 alt=\u0022rae8MZh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere you can see the wad of 4 ships approaching from the left with the D\u0027OH\u0027s orbit coming in from the right. As you can see, Ike got in the way of one of them but not enough to be a real problem.\u003C/p\u003E\u003Cp\u003EI was asked to collect some data on aerocapture for a guy writing a computer program to simulate it, so here are the dry details:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MY2nI4e.jpg\u0022 alt=\u0022MY2nI4e.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: No fireworks from any of these ships.\u003C/p\u003E\u003Cp\u003EThe Duna Bowser and its integral transfer tug/deorbit stage.\u003C/p\u003E\u003Cp\u003EPe set at 90km: 12.7km, got down to 12.4\u003C/p\u003E\u003Cp\u003EVelocity at 90km: 1426\u003C/p\u003E\u003Cp\u003EAp Afterwards: 110.5\u003C/p\u003E\u003Cp\u003EI wanted this one in a 50km orbit but any lower Pe would have been a lithobrake.\u003C/p\u003E\u003Cp\u003EKethLab Duna (soon to be renamed something else)\u003C/p\u003E\u003Cp\u003EPe set at 90km: 14.0km, got down to 13.6\u003C/p\u003E\u003Cp\u003EVelocity at 90km: 1255\u003C/p\u003E\u003Cp\u003EAp Afterwards: 200\u003C/p\u003E\u003Cp\u003EI wanted this one somewhere between 150 and 250 so considered this close enough.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xJAEWOV.jpg\u0022 alt=\u0022xJAEWOV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Kerbal Kans and landers, which had the Ike flyby. On the way in at 200km, this one also passed within 16.8km of KethLab Duna which was by then already in orbit.\u003C/p\u003E\u003Cp\u003EPe set at 90km: 13.0, got down to 12.7\u003C/p\u003E\u003Cp\u003EVelocity at 90km: 1390\u003C/p\u003E\u003Cp\u003EAp Afterwards: 314\u003C/p\u003E\u003Cp\u003EI wanted this one at 300 because it\u0027s going to be completely broken up. 1 lander will go down with 2 Kerbals, the other lander will got to the KethLab MotherShip in a 146km orbit, and the Hitchhikers with 6 Kerbals will go to KethLab Duna.\u003C/p\u003E\u003Cp\u003EThe Duna Tanker was the last of the 4-ship wad.\u003C/p\u003E\u003Cp\u003EPe set at 90km: 13.3, got down to 12.9\u003C/p\u003E\u003Cp\u003EVelocity at 90km: 1360-1390. I forgot to check but it should have been about in this ballpark.\u003C/p\u003E\u003Cp\u003EAp Afterwards: 303\u003C/p\u003E\u003Cp\u003EI wanted this one at 300 and this was definitely close enough. Also, this was the only one where I got what I wanted the 1st try without having to \u0022simulate\u0022 with F5/F9.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9sQudDS.jpg\u0022 alt=\u00229sQudDS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd finally, 3 days later, the D\u0027OH SSTO arrived. I kept the big rear wings on it and am unsure if they hurt or helped. Unlike the others, this one was just aerobraking because it had captured itself with its engine 3 days before.\u003C/p\u003E\u003Cp\u003EPe set at 90km: 15.5, got down to 15.3\u003C/p\u003E\u003Cp\u003EVelocity at 90km: 1226\u003C/p\u003E\u003Cp\u003EAp Afterwards: 886\u003C/p\u003E\u003Cp\u003EI wanted this at 50km but unlike the D\u0027OH by itself (which passed atmospheric entry tests no problem), the added SSTO stage and transfer tug on the back made it somewhat unstable. Even in the thin upper air of Duna, it wanted to wander off so I had to fly it all the way while in the atmosphere and decided I really didn\u0027t want to try it in thicker air further down. But as mentioned above, it had plenty of delta-V in the tug so was about to power itself down to the desired orbit no problem.\u003C/p\u003E\u003Cp\u003ESo, after spending a whole afternoon flying rockets, I got the whole flotilla safely to its various places around Duna. Duna\u0027s surroundings are now pretty congested \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/N0KGVTx.jpg\u0022 alt=\u0022N0KGVTx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFrom outside in, at 314-315km are Kerbal Kans and Ike Rig #1, then the Duna Tanker at 303. Next is KethLab Duna at 200, then the KethLab MotherShip at 146. At 50km are the D\u0027OH, the Bowser, and the tug that brought Airbase Duna in the 1st Wave.\u003C/p\u003E\u003Cp\u003EThe plan for next session, after some juggling, docking, refueling as needed, and putting some Kethane in the D\u0027OH, is to make 3 landings: the Bowser, a lander with 2 Kerbals, and the D\u0027OH. And then stash the spare lander at the KethLab MotherShip (which will probably be renamed KethLad Duna) and put the remaining Kerbals on KethLab Duna (which will probably be renamed KethLab Traveling Circus). This all has to be done fairly quickly because the Dres Flotilla is due to arrive in about 2 weeks. I hope to do some exploring with the D\u0027OH before then.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-24T22:32:35Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE LUCKY 13 -- Duna 2nd Wave Landings\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAfter all this time struggling to get my airplane on Duna, I had to impose strict self-discipline on myself to do the necessary housekeeping in Duna orbit. This consisted of:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EDetaching the tug from Duna Station (nee KethLab MotherShip) and docking it with the Kerbal Kans\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEVAing Obbal and Samlorf Kermin from a Hitchhiker into the Duna Lander 1\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESplitting the Kerbal Kans between the landers and sending Duna Lander 1 down to a 50km orbit attached to the Kerbal Kans tug\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESending the rest of Kerbal Kans with the MotherShip Tug to rendezvous with KethLab Traveling Circus (nee KethLab Duna)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESplitting the Hitchhikers (and 6 Kerbals) loose on both ends from the MotherShip Tugs and Duna Lander 2, moving them out sideways and switching ends with them, and docking them to KethLab Traveling Circus. Then docking the MotherShip Tug to Duna Lander 2 \u003Cimg src=\u0022http://i.imgur.com/9C3pWJZ.jpg\u0022 alt=\u00229C3pWJZ.jpg\u0022\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESending Duna Lander 2 and the MotherShip Tug to dock back with Station Duna\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESending the D\u0027OH\u0027s tug up to get Kethane from Ike Rig #1, then back down to the D\u0027OH to load its Kethane tanks\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI suppose I should also have docked Ike Rig #1 to one of the available refinery ships/stations to make fuel and sent it back to get another load on Ike, but this was the limit of my patience. So, now, FINALLY, I started doing what I came here for: colonizing Duna. It\u0027s a small start, only 2 Kerbals, but they\u0027ve got great mobility so can see where best to put the larger settlements.\u003C/p\u003E\u003Cp\u003E1st thing to go down was the Duna Bowser Mk II, a rover with tanks for all types of fuel and the small-size refinery. Its primary purpose is just moving raw Kethane from Airbase Duna to the D\u0027OH but it can also refuel landers. It does this with KAS winches and the electricity for refining comes from the solar panels on Airbase Duna. Anyway, I did my usual low, flat, 1/4-of-the-planet landing approach from 50km and came down using the engines, 1 big chute, and 12 radial chutes, all done manually.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kb3dkea.jpg\u0022 alt=\u0022kb3dkea.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was rather proud of this landing. I came down within 2.7km of Airbase Duna and didn\u0027t bust any tires. I tried the Steam Gauges radar altimeter for this landing but found it hard to read--it would be more useful at night IMHO.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZYdIdBC.jpg\u0022 alt=\u0022ZYdIdBC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext came the D\u0027OH. Its tug gave it about 300m/s worth of rocket fuel plus a full load of Kethane, then separated. The D\u0027OH used its SSTO ascent stage for the last time, establishing a de-orbit trajectory a bit short of Airbase Duna so the discarded bits wouldn\u0027t hit the latter and itself being able to fly the rest of the way. Once the de-orbit burn was over, the D\u0027OH finally shed its big wings on the off chance they\u0027d make the rest of the ascent stage tumble into the D\u0027OH.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Z3I468d.jpg\u0022 alt=\u0022Z3I468d.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe D\u0027OH entered the atmosphere just fine and eventually found enough air to level out, passing over Airbase Duna at about 6km. It then made a big circle off to the north and came back for a landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3GlkXWt.jpg\u0022 alt=\u00223GlkXWt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s been a month or 2 since I\u0027d flown the D\u0027OH so I was a bit rusty with its peculiar flying habits. As such, I rather botched the landing and managed to flip the thing twice. But the Duna Gods were with me because it landed on its wheels with no damage and came to a nice stop about 2km on the far side of Airbase Duna, from which point it taxied back to base.\u003C/p\u003E\u003Cp\u003EThen it was time to bring down the 1st colonists, Obbal and Samlorf. I\u0027ll leave enough stuff in the Duna system to get them home if needed but their mission is to stay there forever. I did the same sort of landing with them as I did with the Bowser but forgot the lander had nuclear engines so starting retroburning at 30km from the target wasn\u0027t soon enough. As such, they ended up landing about 5.8km from Airbase Duna. But again the Duna Gods smiled and they came down in a very flat place in the dunefield \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/71ZXSws.jpg\u0022 alt=\u002271ZXSws.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen it was a simple matter of driving the Bowser out to them and bringing them home. They repacked all the chutes on their lander, the Bowser, and Airbase Duna when they got there, plus each planted a flag. Then they climbed into the Hitchhiker of Airbase Duna to unpack and see how the supplies had held up. After all, Airbase Duna had been away from Kerbin for 263 days so far. All was fine.\u003C/p\u003E\u003Cp\u003EBefore embarking in the D\u0027OH to begin their explorations, they decided to watch the instructional videos 1 more time. So Samlorf went in to do this but Obbal paused a moment to enjoy the view of Airbase Duna\u0027s equipment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8MULgTO.jpg\u0022 alt=\u00228MULgTO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext time (hopefully), the FLIGHT OF THE D\u0027OH!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-24T22:35:37Z\u0022 title=\u002209/24/2013 10:35  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 24, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-25T19:51:51Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 14 -- The Flight of the D\u0027OH!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAfter Obbal and Samlorf had watched the instructional video on the D\u0027OH again, Mission Control told them to get busy. Judging from the angle of the shadows, it was late morning and Mission Control determined they probably had enough daylight to reach their 1st objective, the anomaly detected in the depression WNW of Airbase Duna. So, the Hitchhiker\u0027s hatch opened, the floor tilted to dump the Kerbals out, and all interior surfaces became electrified to keep Obbal and Samlorf from hanging onto anything. Once they\u0027d been dumped outside, the hatch slammed and locked behind them. So, they had no choice but to mope over to the D\u0027OH and gave it the preflight inspection they\u0027d learned. And this gives me a chance to show off its features.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/J3yhwaj.jpg\u0022 alt=\u0022J3yhwaj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere Obbal checks out the tail and pulls the string starter on the Kethane-burning generator mounted in the fuselage. You can see the KAS refueling port is conveniently located back here and the Kethane tanks are visible inboard on the lower wing, 3 each side. The fuselage tail is squared off from where the SSTO ascent stage decoupled. Note the 4 rudders mounted on the wing trailing edges instead of the tail fins. This keeps the yaw forces balanced so you don\u0027t get any roll when using the rudders. VERY helpful in general but especially in Duna\u0027s thin air.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WvYdwC2.jpg\u0022 alt=\u0022WvYdwC2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith Samlorf in the left seat and Obbal in the right, they check their controls and communications. The probe core is their seat back. The engines, main gear, and even the crew seats are all mounted on I-beams. Note the solar arrays on the upper wing. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/79143-AncientGammoner\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EAncientGammoner\u003C/strong\u003E\u003C/a\u003E was nice enough to weld these up for me out of 24 of the regular single panels, reducing the D\u0027OH\u0027s part count by 46 at a stroke, which REALLY helped with lag at the airbase. Thanks again, buddy!\u003C/p\u003E\u003Cp\u003EWith all systems go and no apparent damage from the rough landing, away they went. At the 2500m altitude of Airbase Duna, the D\u0027OH can become airborne at about 48m/s but it really needs to be going up a hill to do so, staying up when the ground goes down on the other side. Fortunately, finding a hill to climb is no problem in the dunefields at the airbase \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Once in the air, you have to fight to keep it there so I don\u0027t retract the gear until I\u0027m sure of things. Then it takes carpal-tunnel-inducing S-key work until it gradually builds up speed to about 90m/s. After this, you can set SAS (turn it off for a second, then back on again) and it will hold the climb you want.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7dXDYR7.jpg\u0022 alt=\u00227dXDYR7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the pic above, Samlorf\u0027s got it settled into a VERY slow, steady climb and has gained about 500m of altitude in the 7km traveled since take-off. Also, I marked the flightpath on the ISA MapSat display (it\u0027s off towards the left edge a bit above center). The plan was to fly 090 most of the way, then turn 045 to the objective to fly through a red gap between 2 white mountains. I knew from testing I could reach a bit over 5000m but also know from aerobraking that many of those white areas are considerably higher than that.\u003C/p\u003E\u003Cp\u003EAs the D\u0027OH flew along, Mission Control kept an eye on the Kethane consumption and noticed it wasn\u0027t using any. Apparently the sunshine\u0027s more intense on Duna than on Kerbin despite being further from the sun. I guess thin atmospheres and no ozone layers have their advantages. So, some accidental science done \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E. In any case, eventually Mission Control became convinced the D\u0027OH didn\u0027t need a full load of Kethane to complete the mission. So, in an effort to increase the climb rate and ceiling, the TAC Fuel Balancer dumped 4 of the 6 tanks, keeping just 300 units as a reserve. While this went against every KSP habit in my body, I figured I could get away with it. After all, it never rains on Duna \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/s9sZYxq.jpg\u0022 alt=\u0022s9sZYxq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the lightened load, the D\u0027OH was able gradually to claw its way up to 6290m altitude, the highest recorded on the trip. This occurred just before the turn to the NE through the low gap in the hills behind the D\u0027OH. Samlorf was glad he had all this altitude because making the turn cost him about 800m. That\u0027s one of the drawbacks of thin air. But on the plus side, now being lighter, the D\u0027OH regained 6200m much quicker than it had before.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/N3iDYps.jpg\u0022 alt=\u0022N3iDYps.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEventually, the ground below suddenly dropped into a deep valley in the center of which was a big mountain, probably the rebound spike of a huge but very ancient crater. The map was leading the Kerbals to the mountain so they flew low over the top, taking full advantage of the unobstructed view from their seats to scan the terrain. But they saw nothing unusual, just the usual scatter of boulders. Once across the top, they noticed the anomaly was at their 4 o\u0027clock so they dove down and started circling the mountain clockwise about 1/2way up its slope. This almost proved their undoing because Samlorf was a bit aggressive in trying to do a split-S instead of a gradual descent. As he should have remembered from the instructional videos, sudden changes of directions don\u0027t work well in thin air--the plane tends to switch ends while continuing in the same direction, and that\u0027s what happened here. So down they went in a tumbling tailspin. Fortunately, however, they were by then over the deep valley surrounding the central mountain so were able to regain control and pull out with about 200m to spare, thanks to the relatively thick air down near the bottom.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wSn8IXA.jpg\u0022 alt=\u0022wSn8IXA.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, the D\u0027OH climbed back up like a champ in that thicker air so soon they were again 1/2way up the mountain and circling around it as planned. Samlorf was now doing all the scanning because Obbal could no longer see through the puke on the inside of his visor. Suddenly, Samlorf saw a boulder that looked much bigger than the others so he flew closer. It was a boulder, but huge, and carved to look just like the St. Jeb!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zgkkjrK.jpg\u0022 alt=\u0022zgkkjrK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo Samlorf brought the D\u0027OH around and landed on the flat ground around the moutain\u0027s feet. Given its huge wing, in the thick air down there, the D\u0027OH didn\u0027t want to quit flying even with all 16 airbrakes open, so they ended up probably 3-5km away from the anomaly. But no problem, they just taxied to it at about 20m/s. The flight had lasted exactly 59 minutes, all in real time because the D\u0027OH don\u0027t like warping \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E. At an average speed of about 100m/s and given the dogleg in their course, Mission Control estimates The Face is about 330km from Airbase Duna, but the D\u0027OH flew for about 360km.\u003C/p\u003E\u003Cp\u003EBy now, Obbal had remembered one of the instructional videos about pulling his arm up into his sleeve and then using it to wipe the inside of his visor, so he could enjoy the sights. As such, while Samlorf was busy shutting down the D\u0027OH, Obbal jumped from his seat, ran to what could only now be called an artifact, jetpacked to the top, and planted his flag. Samlorf joined him as quickly as he could.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bpKHnUr.jpg\u0022 alt=\u0022bpKHnUr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFACE PLANT! From their vantage point, Obbal and Samlorf looked down the valley to east and saw Ike hanging there on the horizon, eerily illuminated by the mid-afternoon sun effects on the alien atmosphere. This vista awed them; it was way better than the underside of the big bridge at Kerb City, which is all they\u0027d seen in as long as they could remember before the KSP Pressgang caught them. They realized they were the 1st Kerbals to see this and would be the only ones for a long time. They also realized they had a plane that flew reasonably well, a company car, and a whole planet to explore. They hadn\u0027t been on Kerbin in nearly a year but suddenly they didn\u0027t miss it. The spirit of St. Jeb touched them. They came down from The Face no longer galley slaves but willing participants. Of course, with it getting late in the day and not having much Kethane left, they had to camp out under the D\u0027OH\u0027s wings to await a new day, but given their lifetime living under a bridge, this seemed just like home to them.\u003C/p\u003E\u003Cp\u003EMeanwhile, back at Mission Control, the boffins were pouring over a satellite image of the D\u0027OH parked next to The Face. Assuming its length at 9m, The Face must be 65-70m from crown to chin.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-25T19:57:25Z\u0022 title=\u002209/25/2013 07:57  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 25, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-25T20:09:40Z","Content":"\n\u003Cp\u003EBeing in a somewhat celebratory mood after the above, I\u0027d like to thank all those who read this thread, which I see now has over 2000 views. Along the way, it picked up 5 stars and I\u0027ve gotten several rep points for it, so I figure somebody out there\u0027s interested even if nobody but me is posting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. So thanks to whoever you are.\u003C/p\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2013-09-26T20:01:53Z","Content":"\n\u003Cp\u003ELove these posts! I could never do any of this, even with MechJeb! Good luck with your future stuff!\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-26T22:57:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Poryy\u0022 data-cite=\u0022Poryy\u0022\u003E\u003Cdiv\u003ELove these posts! I could never do any of this, even with MechJeb! Good luck with your future stuff!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for your interest.\u003C/p\u003E\u003Cp\u003EBut don\u0027t sell yourself short. What you see here is the 1st time I\u0027ve done most of this stuff myself. I only discovered KSP in June, after all; I wasn\u0027t here before the Great Forum Disaster and the oldest version I\u0027ve ever had was 0.20. I mean, look at my lack of ribbons. I only just now got the (IMHO underappreciated) fight wings and black dot on the Duna ribbon for the above D\u0027OH flight. Apart from a few insignificant probes to learn the mechanics of interplanetary transfer, the KTC is my 1st interplanetary expedition.\u003C/p\u003E\u003Cp\u003EWhat I\u0027m saying is, just jump in at the deep end. There is only 1 true difference in gameplay and game mechanics between going to Mun/Minmus and going anywhere else: the game-time required. The orbital mechanics in the flight and the need for enough delta-V are exactly the same. Simply put, you can go to Kerbin\u0027s satellites any time the mood strikes you and will only have to wait to do the transfer burn for no more than 3/4 of your ship\u0027s orbit around Kerbin (about 15 minutes of game time), and the travel time is measured in game hours or a few days. With the other planets, however, you might have to wait 3/4 of a Kerbin year to get a similar alignment on your target. And then of course, it can take anywhere from a month to a year to coast all the way out there.\u003C/p\u003E\u003Cp\u003EBottom line: In terms of flying the ship, if you can get to Minmus, you can get to Moho, Eeloo, and all points in between. Sure, you need a different ship designed to different specs, but there is absolutely zero difference in the actual flying of it. So, the only thing stopping you from going anywhere you please is making up your mind to give it a try.\u003C/p\u003E\u003Cp\u003EAnd FWIW, MJ is pretty useless for the bulk of this. It can\u0027t do interplanetary transfers worth a damn and it is utterly unable to land at a specific point if the planet has an atmosphere. So you have to do all such things by hand whether you have MJ or not. Where it comes in handy is in giving you info on the state of your ship and your obit, and in handling the small-scale, boring, routine chores you\u0027ve done 100 times already, or in running a 10-minute transfer burn while you do something more important like a debeer/rebeer cycle \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"HAMsmith","CreatedById":78111,"CreatedDateTime":"2013-10-02T16:31:29Z","Content":"\n\u003Cp\u003ELove it, keep the reports coming!\u003C/p\u003E\n"},{"CreatedByName":"1D-1()T","CreatedById":75340,"CreatedDateTime":"2013-10-02T22:32:54Z","Content":"\n\u003Cp\u003ESeconded. loving it so far \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-10-02T23:26:32Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEPISODE 15 -- THE D\u0027OH CONTINUED\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe next morning, Obbal and Samlorf crawled out from under the D\u0027OH\u0027s wings and rooted around in the hollow rear fuselage looking for snacks. While so engaged, Mission Control called to inform them that their job for the day was to fly to the next anomaly SE of their current position. This immediately presented a technical difficulty because the D\u0027OH\u0027s rather low rate of climb dictated leaving Face Valley via the canyon to the east, straight towards the rising sun. Due to the angle of attack they\u0027d have while climbing, the leading edge of the wing would keep the solar panels in the shade until mid-morning and they wanted to save the Kethane they still had for emergencies given they were so far from home. So, they pointed the D\u0027OH east (keeping in mind it\u0027s a tail-dragger with a positive AoA while on the ground) and waited until the solar panels said they were at 50% efficiency. Then they taxied a bit down Face Mountain to where a reasonably flat shoulder stuck out, faced the sun again, and took off. This time, Obbal was flying and Samlorf acting as observer.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pR86frB.jpg\u0022 alt=\u0022pR86frB.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the above pic, I drew another purple line on the ISA map showing the flight path for today. It followed the canyon as it curved from E to SE from Face Mountain, nearly sea level at the bottom but slightly higher than the D\u0027OH can fly on either side.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IxaC4Lv.jpg\u0022 alt=\u0022IxaC4Lv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis canyon eventually opened out into a huge depression, so wide that Obbal and Samlorf couldn\u0027t see the surrounding mountains from the middle of it, even from 6200m altitude. In fact, they got up to 6302m, setting a new altitude record for the D\u0027OH. As before, however, they couldn\u0027t hold this but today they were able to hold about 6230m, a bit higher than yesterday. They reached this altitude just as they were leaving the canyon and starting the long haul across the depression.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PYSwusT.jpg\u0022 alt=\u0022PYSwusT.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFollowing their map, they made a slight course change over the depression and eventually saw the surrounding mountains appear on the far side with a gap between to the SE just as shown on the map. Their objective was up that gap to the SE so they headed that way. Soon, the ground rose beneath them and they began to worry that it might end up being higher than the ground at Airbase Duna, above which the D\u0027OH\u0027s landing characteristics had never been tested. It\u0027s VERY hard to judge height and distance on Duna due to its relatively small size, all looking the same, and the atmosphere always looking like sunset all around the compass regardless of altitude or time of day. Good thing they\u0027d installed the new radar altimeter they\u0027d brought out from Duna so could be reassured the ground wasn\u0027t too high. Eventually, checking the map, they decided they were close enough to find the objective by taxiing so put down.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SVuvuWC.jpg\u0022 alt=\u0022SVuvuWC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis area is still dunefields but the dunes are shorter, less steep, and further apart than around Airbase Duna, so makes for a better airfield. It\u0027s also a little below 2000m altitude. It would be a great place for a colony if there was any Kethane there. Perhaps the anomaly will provide an excuse to build here. In any case, thanks to the lower altitude, the D\u0027OH wouldn\u0027t quit flying until it slowed to less than 30m/s. The flight lasted 68 minutes which, at an average speed of 100m/s, means the D\u0027OH traveled about 408km this trip, again without a drop of Kethane burned.\u003C/p\u003E\u003Cp\u003EOnce on the ground, Obbal and Samlorf spent almost as much time looking for the objective. First they looked at their ISA map and got their position lined up as well as possible with that of the anomaly. Nothing seen, either then or on the landing approach. From this they knew the anomaly was much smaller than The Face so they\u0027d have to get very close to see it, closer than the coarse-grained map allowed. So, after about 30 minutes of taxiing back and forth across the area and nothing seen but sand and scattered boulders, they held their position while Mission Control manipulated all the data it had every which way (as in, used Google and YouTube for help) and instructed the Kerbals to patch the positional data from the D\u0027OH\u0027s spaceflight computer (aka to turn on MJ\u0027s surface info box) into their GPS system so they\u0027d really know exactly where they were. Then Obbal taxied some more until, 42 minutes after landing, they were reasonably sure they were exactly where Mission Control swore the anomaly was. Still nothing.\u003C/p\u003E\u003Cp\u003EAt this point, Obbal and Samlorf were getting a bit fed up. They decided that perhaps their perch way up on the D\u0027OH\u0027s nose was too high to see the thing and they\u0027d have better luck if they dismounted, perhaps being able to silhouette the anomaly against the horizon. So they climbed down the ladder, moved far enough away from the D\u0027OH that it didn\u0027t block much of their view, and stood back-to-back, sliding slowly around in a circle so each of them could sweep the whole horizon to spot anything the other had missed. Still nothing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7gYAwK4.jpg\u0022 alt=\u00227gYAwK4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo they reported and so they stood until the speed of light allowed an answer from Mission Control. Mission Control said it had given up on finding the thing and Samlorf was to plant his flag to mark the spot for future reference. But at this point, Samlorf discovered he didn\u0027t have a flag*. It must have fallen out of his pocket somewhere, probably during the tailspin after passing over Face Mountain. So, on this rather anti-climatic note, Samlorf and Obbal again made camp under the D\u0027OH\u0027s wings with the knowledge they be returning to Airbase Duna come the dawn.\u003C/p\u003E\u003Cp\u003EBut if it had been a snake, the anomaly would have bitten them. IOW, the thing\u0027s buried.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/62Wvoe5.jpg\u0022 alt=\u002262Wvoe5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E*NOTE: When the Kerbals got off the D\u0027OH, they moved like they were using jetpacks, always facing away from the camera. So, I went back to KSC then back to the D\u0027OH. and that solved that problem, but still neither of them had a flag, despite only 1 flag having been planted since they were last inside a ship.\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2013-10-03T00:05:33Z","Content":"\n\u003Cp\u003EThis is some impressive work! Especially for a first major excursion. I\u0027ve been wanting to attempt something bigger*, but I\u0027ve been held back by lack of a success with lifter engineering (and frustration with performance issues on a 3-year old computer). I figure I\u0027ll take another stab at it with 0.22, hoping for some performance increase, and maybe running a proper program from first-principles to re-learn some things I may have missed (and get research, of course).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*than I\u0027ve done before, not bigger than this crazy project\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-10-03T01:33:02Z","Content":"\n\u003Cp\u003EThanks to all (visible and invisible) for the props.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E@ Jarin:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EDon\u0027t wait for 0.22 (no telling how long that will be), go for it now. Updates might break your saves but they can\u0027t erase the experience and knowledge you gain.\u003C/p\u003E\u003Cp\u003EI\u0027ve found 3 things very useful when it comes to building lifters, which is an extension of building mission payloads:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EKerbal Engineer Redux, although it isn\u0027t accurate unless you put fuel lines where needed. It\u0027s also essential to make landers for other planets unless you like doing paper calculations outside the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EStretching struts as far as possible above and below anywhere the rocket\u0027s diameter changes. The Heavy and Medium struts contained in TT\u0027s Modular Multiwheels and Omniwheels are great for such uses.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAccepting that smaller rockets are better than big rockets, even if they lack the awesomeness factor of the monsters some folks make. The smaller the payload, the less rocket you need to get it anywhere. And smaller rockets are easier to get right the 1st time, save on fuel for the same total amount of payload mass, and have lower part counts, which is an issue for me even with a pretty new computer due to KSP\u0027s inherent limits. Of course, this means you have to fly flotillas instead of 1 big ship but if you can fly 1 ship to whatever destination, you can fly half a dozen because they\u0027re all doing the same thing.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}