{"TopicId":40518,"ForumId":51,"TopicTitle":"Munbase Serenity","CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-08-01T18:27:09Z","PageNum":1,"Articles":[{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-08-01T18:27:09Z","Content":"\n\u003Cp\u003Esince the update broke the old saves, its time to plan and build a new munbase. this time it will be bigger, better, badder and maybe even less likely to explode than my old one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E i let myself inspire by some base and rover designs and came up with some neat things.. i think.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Ebut lets begin the planning and building, shall we\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPhase 1\u003C/strong\u003E - planning and building all the parts\u003C/p\u003E\u003Cp\u003Efirst we need a lifter to get all this stuff into orbit and to the mun. this, i call the \u0022Keriane 1\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/T3jqyVnZKO/lifter.png\u0022 alt=\u0022lifter.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere is also a Keriane Heavy with 4 side boosters for very heavy payloads. this vehicle utilizes KWRocketry and the Procedural Fairings mods.\u003C/p\u003E\u003Cp\u003Eonwards to the munbase modules. next, we need someplace for the kerbals to live. one cannot expect them to hang around in their EVA suits forever.\u003C/p\u003E\u003Cp\u003Ethis hab can hold up to 6 kerbals with all the snacks and comfort they could dream of. plus this module is able to deorbit and land on its own.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/eGlwxWxqmm/hab.png\u0022 alt=\u0022hab.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Egotta love those B9 parts! who says they are only good for planes? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethis is the equipment module (as you can probably see, heavily inspired by katateochis constellation project). it holts several tools like a kethane drill, kethane converter, a generator with RTG and Solar Power, and a small damned robotics articulated telescope from the Ordan Industries modpack.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/nke9EheYnc/equipment.png\u0022 alt=\u0022equipment.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethis thing was a BEAST to balance out... but it too is able to land on its own. (ok maybe i\u0027ll ask mechjeb for a little help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E )\u003C/p\u003E\u003Cp\u003Enow, we need some rovers. Kerbals love rovers. and explosions. well.. mostly explosions, but rovers too.\u003C/p\u003E\u003Cp\u003Ei plan on sending 2 of my Ferret rovers up. one fitted with exploration and scanner stuff and the second with a crane arm for basebuilding. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/XDCslOrxRv/rover.jpg\u0022 alt=\u0022rover.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ebut how to drop them safely onto the munar surface.. ? well, how about this?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/MV8eJhjHyW/rover_pod.png\u0022 alt=\u0022rover_pod.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ei just pray this will work on the mun too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Eall modules will be transferred unmanned, the crew will arrive when everything is in place and ready for science and stuff.\u003C/p\u003E\u003Cp\u003Ethe crew of 6 will be carried into LKO with 2 launches of the Keres OTS (Orbital Taxi Systen) i already use this proven craft to get my kerbals up to my space station and back again.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/y4NmScFUoi/keres_taxi.jpg\u0022 alt=\u0022keres_taxi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...and from there, they will take the Mun-Bus to the Base. This Bus will transfer Crew between the Munbase and LKO and can be refueled at the base.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/kj7epQXZIc/munbus.jpg\u0022 alt=\u0022munbus.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eso far so good. the plan looks solid to me. i hope the execution will be solid as well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eto be continued...\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-01T18:40:47Z","Content":"\n\u003Cp\u003EDamn, I wish I\u0027d thought mine through as thoroughly as you have! Say, could you give any tips on landing sideways modules?\u003C/p\u003E\u003Cp\u003EEdit: Where do I find the lit up habitat thing?\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-08-01T18:47:01Z","Content":"\n\u003Cp\u003Eplace 2 identical tanks on both sides so they drain simultaneously, add a docking port on top to get the correct orientation on the navball and spend hours on getting the CoT and CoM exactly the same..... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESAS and RCS helps a lot with stability, especially in the last landing phase.\u003C/p\u003E\u003Cp\u003Ethe lit up habitat is the crew container from the B9 Aerospace mod.\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-01T20:45:52Z","Content":"\n\u003Cp\u003EI see, are you going to dock your modules together? I sense competition between you and I \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cashen","CreatedById":71281,"CreatedDateTime":"2013-08-01T21:42:43Z","Content":"\n\u003Cp\u003EWow, that base design using the B9 crew module is really fantastic. Good work. Very inspiring.\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2013-08-01T21:46:29Z","Content":"\n\u003Cp\u003EVery nice! Should this be in Mission Reports?\u003C/p\u003E\u003Cp\u003E...Say nothing.\u003C/p\u003E\u003Cp\u003ENOTHING.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-08-02T06:55:21Z","Content":"\n\u003Cp\u003EPhase 2 - sending the junk over\u003C/p\u003E\u003Cp\u003Ewith everything on order and standing ready, its time to begin shipping everything to the mÃƒÂ¼n. so let\u0027s start our engines and get this thing going!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/O2j9eH54rn/first-launch.jpg\u0022 alt=\u0022first-launch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewith the power of the Keres Heavy Rocket, lifting such payloads is child\u0027s play and after a short time, we reach munar orbit.\u003C/p\u003E\u003Cp\u003Eas soon as we are in the right position we start our breaking burn to descend on the surface. the transfer stage is jettisoned and will crash somewhere into the mun. the equipment module is now on its own.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/swdapOCCtt/descending.jpg\u0022 alt=\u0022descending.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Efirst rule when playing such missions: USE QUICKSAVE! some may consider it cheating. i think of it as a feature to protect my nerves and my keyboard from being smashed.... just like the module in the first two landing trys \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/T2kYDMW5wO/splosion.jpg\u0022 alt=\u0022splosion.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ebut eventually we reach the surface safe and in one piece. easy noooow.... and touchdown! the dodo has landed!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/XWxdKfQoa5/touchdown.jpg\u0022 alt=\u0022touchdown.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethe other lanches were not that much different from this one (including some \u0027splosions) so i think i\u0027ll take a shortcut here and present you... the Munbase Serenity! ready for end assembly and waiting for the crew to do important science and stuff \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/TfAuPbmhUW/base_landed.jpg\u0022 alt=\u0022base_landed.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill Kerman will lead this expedition because Jeb is needed for some.. very special.. erm.. testflights. and Bob is afraid of heights. He and his chosen team of five other extraordinary stup... curageous Kerbals are already standing by to be transferred.\u003C/p\u003E\u003Cp\u003Eto be continued\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-08-02T07:36:54Z","Content":"\n\u003Cp\u003EOooh, shiny base! Can\u0027t wait to watch it grow. Also, what mods are you using for your parts? I want to get into some more heavy mods, but I\u0027m afraid of having to redesign all of my (mostly) stock craft.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-08-02T08:10:30Z","Content":"\n\u003Cp\u003EB9 and KWRocketry. many great and shiny parts and i love them! i couldn\u0027t imagine going pure vanilla again.\u003C/p\u003E\u003Cp\u003Edamned robotics and KAS for the mechanical stuff and connecting the modules together.\u003C/p\u003E\u003Cp\u003Eand mechjeb for information displays, node finetunting and SmartASS.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-08-02T08:22:31Z","Content":"\n\u003Cp\u003EAnd the fairings? Those look like fairing factory.\u003C/p\u003E\u003Cp\u003EEdit: nevermind! I see you\u0027re using procedural fairings. I might download that!\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-08-05T17:08:38Z","Content":"\n\u003Cp\u003EPhase 3 - all your base are belong to us\u003C/p\u003E\u003Cp\u003Eafter 2 launches of my keres orbital transport system, the munbus is ready to depart and deliver the 6 heroic kerbals to the mun. for science and stuff! now lets just hope there is enough fuel in this thing to get them there safe and sound... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/ZFVPpCAo2l/travel1.jpg\u0022 alt=\u0022travel1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewith literally the LAST DROP of fuel, the munbus arrived at the base and touched down somewhat rough, but safe and DIDNT BREAK SOMETHING! thats a first for Bill piloted capsules! i better don\u0027t tell them just yet, that this was a one way trip.. because of a monumental oversight, there is no KAS port on the munbus, so i can\u0027t refuel that damn thing... well.. thats life \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/DWeSUWKVhb/travel2.jpg\u0022 alt=\u0022travel2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewell, lets get this show on the road! Bill readied the Ferret HD assembly rover and started building the base. the first thing is to get the generator going, you can\u0027t do sheet without power on the mun. \u003C/p\u003E\u003Cp\u003Ewith the Ferret\u0027s assembly arm he plucks it from the equipment lander and deploys it in the middle of the base.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/AVHDF9GphW/building1.jpg\u0022 alt=\u0022building1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Enote to myself: this things are still very heavy on the mun. we need some stronger supporting legs on the next rover...\u003C/p\u003E\u003Cp\u003Enext, the kethane converter is positioned. but whats that.. i can\u0027t deploy the landing legs of the converter... damn.. no juice left, the probe on the converter isn\u0027t responding to my commands.\u003C/p\u003E\u003Cp\u003Ewhat to do now?...\u003C/p\u003E\u003Cp\u003Elooks like bill has to get his own hands dirty and hook it up to the power generator manually. this is only a minor setback for my highly brainwash... erm.. trained kerbal personnel \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/cNeQpFsD32/building2.jpg\u0022 alt=\u0022building2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Elast but not least, the kethane drill unit and the scientific telescope are deployed and hooked up to the generator.\u003C/p\u003E\u003Cp\u003Enow everything is coming together nicely. i like it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/UIpuGtTxSc/building3.jpg\u0022 alt=\u0022building3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand success! the munbase is now ready for operation. Bill parks the Ferret and makes his way to the habitat, where the rest of the crew is already getting the party going.\u003C/p\u003E\u003Cp\u003Enow the last question will be: what color do kerbals get when drunk and hungover? i think we shall see soon enough. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/VOwMYqqY9M/2013-08-04_00029.jpg\u0022 alt=\u00222013-08-04_00029.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/sh/n2p32zflefyhj79/7n8M5WZpx3/2013-08-04_00030.jpg\u0022 alt=\u00222013-08-04_00030.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-05T17:43:11Z","Content":"\n\u003Cp\u003EThis is incredibly similar to the constellation thing - I love it, it interests me why there isn\u0027t, like, a separate solar panel thingy for the base instead of sticking them in the hab modules\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-08-05T18:25:13Z","Content":"\n\u003Cp\u003Eyou could tell? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Eyes i was heavy influenced by katateochi\u0027s magnificent constellation mission and had to do something similar. only on a smaller scale.\u003C/p\u003E\u003Cp\u003Epower is crucial to survive on the mun, so the hab is completely self sustaining.\u003C/p\u003E\u003Cp\u003Ewell.. there IS a connector on the hab.. but i was too lazy at the end \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-05T18:39:09Z","Content":"\n\u003Cp\u003EWell, the way I\u0027m doing it is with different modules for different things - The hab will be connected via a jr and standard docking port to the solar panel array that is also modular. I have to say though, your way involves kethane - mine involves expeditions which I\u0027m sure you\u0027ll do but that\u0027s the focal point for me\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-08-05T20:13:42Z","Content":"\n\u003Cp\u003Ei believe that finding resources and be able to process them will be the key for colonizing other worlds. so kethane is a must have for me.\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-08T12:15:11Z","Content":"\n\u003Cp\u003EI agree, I do like the kethane Idea - whens the next update on your base?\u003C/p\u003E\n"}]}