{"TopicId":40707,"ForumId":51,"TopicTitle":"Flight 0-2-Oscar-Oscar-Mike","CreatedByName":"Westo454","CreatedById":12702,"CreatedDateTime":"2013-08-02T20:32:15Z","PageNum":1,"Articles":[{"CreatedByName":"Westo454","CreatedById":12702,"CreatedDateTime":"2013-08-02T20:32:15Z","Content":"\n\u003Cp\u003EMission Report\u003C/p\u003E\u003Cp\u003EMission #0092\u003C/p\u003E\u003Cp\u003EDepartment: Atmospheric Flight\u003C/p\u003E\u003Cp\u003EPilot/Crew: Hamvin Kerman\u003C/p\u003E\u003Cp\u003EStatus: MIA\u003C/p\u003E\u003Cp\u003EScout Flight 0-2-Oscar-Oscar-Mike (OOM) was a scheduled scout flight to an odd valley almost directly north of the Kerbal Space Center. The Valley, spotted, but almost totally ignored by another flight, 0-1-Oscar-Oscar-Mike, which was en-route to the north pole. It was a standard flight, in the although newly developed, largely reliable W-1 \u0022Sparrow\u0022 Aircraft.\u003C/p\u003E\u003Cp\u003EThe flight went normally, quickly reaching cruising altitude of 6,000 Meters, and turning north. Every 5 Minutes, the pilot checked in with mission control.\u003C/p\u003E\u003Cp\u003EAfter approximately 20 Minutes, the pilot reported he was over the valley. The following is the last audio communication with the aircraft.\u003C/p\u003E\u003Cp\u003EPilot: Mission Control, Flight 0-2-Oscar-Oscar-Mike.\u003C/p\u003E\u003Cp\u003EMission Control: Flight 0-2-Oscar-Oscar-Mike, Mission Control, go ahead.\u003C/p\u003E\u003Cp\u003EPilot: Approaching the valley now, preparing for descent.\u003C/p\u003E\u003Cp\u003EControl: Roger Oscar-Oscar-Mike, We are standing by for an image.\u003C/p\u003E\u003Cp\u003EPilot: Copy, sending image now.\u003C/p\u003E\u003Cp\u003E*Brief Pause*\u003C/p\u003E\u003Cp\u003EControl: Image received, standing by for landing confirmation. Over and out.\u003C/p\u003E\u003Cp\u003EPilot: Roger, over and out.\u003C/p\u003E\u003Cp\u003EApproximately one minute following this communication, live flight readouts indicated that the pilot had used his ejector seat. approximately 20 seconds following the ejection, all contact with the flight was lost, including live flight readouts.\u003C/p\u003E\u003Cp\u003EThe only image ever received is herein attached\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AgfOzHM.jpg\u0022 alt=\u0022AgfOzHM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethe valley appears to be an ancient, giant footprint, although it is beyond us what could possibly create such a massive footprint.\u003C/p\u003E\u003Cp\u003E-Signed\u003C/p\u003E\u003Cp\u003EEd Kerman,\u003C/p\u003E\u003Cp\u003EMission Director.\u003C/p\u003E\n"},{"CreatedByName":"Westo454","CreatedById":12702,"CreatedDateTime":"2013-08-04T23:53:05Z","Content":"\n\u003Cp\u003ERE: Mission Report\u003C/p\u003E\u003Cp\u003EInvestigation Report\u003C/p\u003E\u003Cp\u003EMission #0092\u003C/p\u003E\u003Cp\u003ECase File #0034\u003C/p\u003E\u003Cp\u003EInvestigator: Bob Kerman\u003C/p\u003E\u003Cp\u003EA secondary flight over the valley indicates no sign of any wreckage. According to the pilot\u0027s report, there is no sign of any kerbal having ever been present in the valley. This is quite strange, since the last coordinate for the flight were directly over the valley.\u003C/p\u003E\u003Cp\u003EThat was until I received the weekly tracking station report. According to the report, there was quote \u0022High Velocity Debris, appearing from nowhere\u0022 above the last known location of this aircraft. The debris continued out into a solar exit orbit. Before the debris exited, we trained a radio telescope on it, and low and behold, we received the live flight data transmission from the debris.\u003C/p\u003E\u003Cp\u003EThere is, however, no sign of the pilot. The live flight data indicates that the pilot left the cockpit almost immediately after ejecting. All indicators would seem to suggest that he should have survived, but we are receiving no EVA suit signal from the valley, nor is there any indication that he was ever in the Valley.\u003C/p\u003E\u003Cp\u003ECommander Jebediah, however, approved a tertiary flight, to search for the missing pilot, he would approve no landing however. the pilot\u0027s report indicated a trough through the snow on one of the slopes, which ended abruptly. there were no tracks leading away from it. Weather satalites have indicated there has been no precipitation of any kind since the incident. we can only assume the worst, and hope for the best.\u003C/p\u003E\u003Cp\u003ELt. Commander Bill has deemed that there is suffient evidence indicating the pilot died on the mountain, tearing up his EVA suit on the tumble down the slope. He has ordered the case closed. In compliance, I now do so, and close the case formally.\u003C/p\u003E\u003Cp\u003EAtmospheric Flight Pilot Hamvin Kerman Hereby declared KIA.\u003C/p\u003E\u003Cp\u003ECase File #0034 Closed, Investigation Concluded.\u003C/p\u003E\u003Cp\u003ESigned\u003C/p\u003E\u003Cp\u003EBob Kerman\u003C/p\u003E\u003Cp\u003ELt. Commander, Kerbal Space Command\u003C/p\u003E\u003Cp\u003EDirector, Investigative Services.\u003C/p\u003E\u003Cp\u003E-Private Note, Bob Kerman:\u003C/p\u003E\u003Cp\u003EI can\u0027t help thinking that I missed something, that there is something more to be found. Command won\u0027t authorize another mission to that valley, I may have to do it myself.\u003C/p\u003E\n"}]}