{"TopicId":42517,"ForumId":51,"TopicTitle":"Jebediah Kerman overcomes the impossible in first mun landing.","CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-08-14T21:26:02Z","PageNum":1,"Articles":[{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-08-14T21:26:02Z","Content":"\n\u003Cp\u003EI just completed my first mun landing and return with Jeb doing the voyage solo in the tiny capsule. It was quite eventful... \u003C/p\u003E\u003Cp\u003EThe launch started out well...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jk7ZZ0f.png\u0022 alt=\u0022jk7ZZ0f.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever after the first stage separated I noticed a blank patch on the staging thingys... \u003C/p\u003E\u003Cp\u003ENow most people would abort the launch and return to Kerbin if something like this happened:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iYSoGXR.png\u0022 alt=\u0022iYSoGXR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat black hole on the bottom of that middle tank was supposed to have an atomic engine to be used on the way to the mun and back, apparently it fell off at some point. However, I decided to press on regardless, Jeb showed no concern at the development and so it was decided the trip could be done on with the puny orange radial engines of the lander if necessary. \u003C/p\u003E\u003Cp\u003ENow a few things I missed getting pics of, the horrid debris field that I left after using the last drips of fuel in the second stage to go to the Mun rather than to deorbit the stage, and the atrocious landing where the lander tipped over and had to be righted by opening the closing the gear while jiggling the torque...\u003C/p\u003E\u003Cp\u003Ebut the result is.... Success!! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/J55SKzN.png\u0022 alt=\u0022J55SKzN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb plants the flag, inscription: One small waddle for a Kerbal, one giant flop for Kerbalkind. \u003C/p\u003E\u003Cp\u003ENow I did think that it was now time to launch a rescue mission, as Jeb had used up half of the fuel in the lander\u0027s return stage while landing, I didn\u0027t think he had enough to get back to mun orbit. and also while he was on the surface, this happened:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/To3S4MV.png\u0022 alt=\u0022To3S4MV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Mun return stage, now just a floating fuel tank due to the engine dropping off totally powered down as I forgot to add a battery and solar panel.\u003C/p\u003E\u003Cp\u003EAs the capsule had NO RCS, I had planned that it would hold still and the return stage would do the acctive part of the docking, but with no power, Jeb will have to dock with a drifting unpowered spaceship using only engines...\u003C/p\u003E\u003Cp\u003EHis situation looked grim, and I was about to start constructing a rescue ship, however, Jeb\u0027s excited little face showed no fear, he had already overcome an engine falling off and a sideways landing...\u003C/p\u003E\u003Cp\u003ESo I undocked the capsule from the lander base and launched him on his way\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D7bUeJy.png\u0022 alt=\u0022D7bUeJy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESuccesss, he made it to orbit and managed to time the launch perfectly for a quick rendezvous with the stricken return stage. I don\u0027t have any pics of the no-RCS to no-power docking, however the result was success!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9nAxgXH.jpg\u0022 alt=\u00229nAxgXH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ehaving picked up the fuel tank, so began a puny-engine burn back to Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/O9hPai2.png\u0022 alt=\u0022O9hPai2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESuccess! Jeb looks even happier than usual to be back home!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hnDzPIW.png\u0022 alt=\u0022hnDzPIW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe even manages to splash down within sight of the KSS (the little yellow marker is a rover test I parked outside the VAB so I could see the KKS on the map easily.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mRZHgJl.png\u0022 alt=\u0022mRZHgJl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, the legend of Jebediah Kerman grows ever greater as he overcomes, a fallen off engine, a sideways landing, half his fuel gone and a no-rcs to no-power docking. \u003C/p\u003E\u003Cp\u003ESo, multiple disasters, but in the end, Jebediah overcame it all to perform a successful Mun landing! Hooray!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JRyock7.png\u0022 alt=\u0022JRyock7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd that was the story of my highly eventful first ever Mun landing. \u003C/p\u003E\u003Cp\u003EThanks for reading!\u003C/p\u003E\u003Cp\u003EWallace.\u003C/p\u003E\n"},{"CreatedByName":"JakeGrey","CreatedById":61242,"CreatedDateTime":"2013-08-14T21:49:13Z","Content":"\n\u003Cp\u003ENow that\u0027s some impressive work. Nice lander design too, if a little over-engineered.\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-08-14T22:04:49Z","Content":"\n\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Thanks, I realised after landing that I probably didn\u0027t need the RCS, but I\u0027m glad I went with the chunky legs instead of the toothpicks as otherwise Jeb would probably have been stuck. I snapped a few toothpick legs off on my unmanned landings, so I was reluctant to trust Jeb\u0027s life to a landing with them. I need a little more practice to reliably get a soft enough landing for them.\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-15T03:40:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wallace\u0022 data-cite=\u0022Wallace\u0022\u003E\u003Cdiv\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Thanks, I realised after landing that I probably didn\u0027t need the RCS, but I\u0027m glad I went with the chunky legs instead of the toothpicks as otherwise Jeb would probably have been stuck. I snapped a few toothpick legs off on my unmanned landings, so I was reluctant to trust Jeb\u0027s life to a landing with them. I need a little more practice to reliably get a soft enough landing for them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou should put rcs on the upper stage \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E)\u003C/p\u003E\u003Cp\u003EAs for landing legs, I used the small legs on an Eve lander once, they worked reliable as an crumble zone. Unfornatly they did not all break all the time, if it was so I could dropped the decopler on them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-08-15T03:58:26Z","Content":"\n\u003Cp\u003ENice landing! Now to Minmus!\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-08-15T04:05:19Z","Content":"\n\u003Cp\u003EVery impressive, though I\u0027d have tried to launch with the bottom stage attached to use the RCS to dock. The though of docking with no RCS makes me want to cry.\u003C/p\u003E\u003Cp\u003EEDIT: Actually never mind, your RCS tank was in the way! Silly me.\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-08-15T11:11:09Z","Content":"\n\u003Cp\u003EEven if the docking port wasn\u0027t in the middle of the lander, there was no way the whole lander would have got back into orbit. I used about 3/4 of the fuel in the whole lander for the the decent, so there would have been no way it could have got back up with lower half attached. As it was it had just enough to get into orbit, and rendezvous with the tank. \u003C/p\u003E\u003Cp\u003ELuckily the tinyness of the engines and the way they are oriented helped in the docking as they were pointing the right way to slow it during the approach, and the reaction wheels in the pod are super effective, I\u0027m sure I couldn\u0027t have done it with a bigger craft. If i\u0027d remembered to put a battery and panel on the tank, then my original plan would have worked a treat, the old power loss thing has caught me out before, I really must start making a check of each stage as I build.\u003C/p\u003E\n"}]}