{"TopicId":43917,"ForumId":51,"TopicTitle":"My first SSTO to orbit and back","CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2013-08-26T07:55:10Z","PageNum":1,"Articles":[{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2013-08-26T07:55:10Z","Content":"\n\u003Cp\u003EHey guys! I\u0027ve been making tons of ships, but never had the desire to fly one from base to orbit and back again.\u003C/p\u003E\u003Cp\u003EAfter spending a lot of time designing my latest SSTO I figured it was time to make my first complete mission. The mission was basically about testing it\u0027s stability on re-entry, but it turned in to a full on return to base. No take-off pics since the mission was thought up as an afterthought. This thing is VTOL capable, but is more effective as an STOL. Standard flight profile though.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ErXuu\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s fun to fly! SSTO\u0027s can be frustrating to make, but I think I can appreciate it more now knowing that it\u0027s capable of being a useful craft. Not the best atmospheric plane, but it wasn\u0027t designed to be.\u003C/p\u003E\u003Cp\u003ENow to find a new project. I was thinking about making larger or interplanetary SSTO\u0027s in the future, but we\u0027ll see.\u003C/p\u003E\u003Cp\u003EHope you enjoyed!\u003C/p\u003E\n"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2013-08-26T08:24:59Z","Content":"\n\u003Cp\u003EMake sure you submit it to the \u003Ca href=\u0022https://tinyurl.com/bu43ax5\u0022 rel=\u0022external nofollow\u0022\u003EK-Prize forum\u003C/a\u003E!\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2013-08-26T08:48:58Z","Content":"\n\u003Cp\u003EFairly new to the forum so I hadn\u0027t seen that before. Looks like I\u0027ll have to push this thing and see if I can get to the Mun or something for extra kudos. \u003C/p\u003E\u003Cp\u003EThanks for the advice!\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-08-28T05:47:02Z","Content":"\n\u003Cp\u003EGrats on getting orbital! I\u0027m still in the sub-orbital phase, but closing in on the right tweaks. It was nice of the devs to put that mountain range just west of the space center. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2013-08-29T00:36:26Z","Content":"\n\u003Cp\u003EThanks! Ya now that I know how tall it is it actually is kind of nice to use the mountains as a reference on your way back to base. What tweaks are you working on to get orbital?\u003C/p\u003E\n"}]}