{"TopicId":44134,"ForumId":51,"TopicTitle":"Back from my first Minmus landing!","CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-08-28T05:25:58Z","PageNum":1,"Articles":[{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-08-28T05:25:58Z","Content":"\n\u003Cp\u003EIt was routine until the landing. I wanted to check out a Kethane deposit that was just tuning into day, and didn\u0027t want to wait an orbit. I could see the mountains highlighted by the rising sun, so no biggie, right? I retro into the shade of a mountain and land. At an angle, sure, but I\u0027m down. Quick save.\u003C/p\u003E\u003Cp\u003EThank goodness for quick save.\u003C/p\u003E\u003Cp\u003EJeb got to flag the moon, so Bill is leading. He gets out of the capsule, and the lander wobbles a bit. He climbs down, plants his flag, and watches the lander slowly, surely tip over. In getting out of the way of the falling lander, Bill begins an uncontrollable slide down the hill, closely followed by the lander. Yeah, quick load time.\u003C/p\u003E\u003Cp\u003EI hopped the lander down the hill to a less steep bit, had Bill plant his flag, and got the heck out of there! The only other remarkable event was a sweet gravity assist from Mun on the way back that led to an aero brake de-orbit and landing. I think I got the whole trip back for 600m/s.\u003C/p\u003E\u003Cp\u003EAll in all, one of my favorite expeditions. Good job, Bill! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheHockeyPlayer","CreatedById":73665,"CreatedDateTime":"2013-08-28T05:39:00Z","Content":"\n\u003Cp\u003EI\u0027m sure the event was a sight to behold! I remember my first few missions on Minmus... Ah, those were the days. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"}]}