{"TopicId":46806,"ForumId":51,"TopicTitle":"On this day...","CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2013-09-28T21:54:58Z","PageNum":1,"Articles":[{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2013-09-28T21:54:58Z","Content":"\n\u003Cp\u003EI landed on the Mun!!! I owe the guys in the mechjeb thread an apology, I thought it was broken... LOL... but I have it sussed now.\u003C/p\u003E\u003Cp\u003EYou say \u0022the Mun, really, big deal!\u0022\u003C/p\u003E\u003Cp\u003EYes, for me, it is a big deal. This wasn\u0027t just ANY walk to the Mun, I was thinking of the future, for moons and planets further away, I launched a DOUBLE mission. \u003C/p\u003E\u003Cp\u003EThe first rocket carried the lander and one Kerbal... the other, a rocket with two kerbals and enough fuel for a return journey. \u003C/p\u003E\u003Cp\u003EOne Kerbal remained in orbit with the command rocket... two kerbals landed and planted their flags! The lander then took off, approached the command rocket, docked, the lander was evacuated and then jettisoned. The command rocket returned and because there was plenty of fuel, the huge fuel tank was jettisoned and they landed at KSP base.\u003C/p\u003E\u003Cp\u003EThinking to the future.... I can now establish a mun base... and think of the places further afield... yes, it won\u0027t be that easy all the time.\u003C/p\u003E\u003Cp\u003ENOW.... I have a question...\u003C/p\u003E\u003Cp\u003ECan anyone recommend a fuel transfer mod that actually works, please? I had one, but it didn\u0027t actually transfer anything. Thinking further afield where every drop will be vital, this will be most important. If there is any easier way, without a mod, care to explain?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EOn this day, the 29th September, 2013, Kerbals arrived from next door in the spirit of peace, and claimed the mun for themselves and mapped out the location of the future military base to keep trespassers off.\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe landing took me till about 1am... I then went to bed and now, I\u0027m making plans... before anything else, I\u0027m going to try and land on top of the Vertical Spaceship Hanger.... then I can truly call myself an explorer. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2013-09-28T22:31:22Z","Content":"\n\u003Cp\u003Egood for you my friend \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E \u0022one small step..\u0022 and all that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2013-09-28T22:47:34Z","Content":"\n\u003Cp\u003EYou can transfer fuel by alt \u002B clicking the two tanks you want to transfer. For mods you could use fuel balancer or KAS.\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2013-09-29T01:04:54Z","Content":"\n\u003Cp\u003EIndeed in no other game landing on the moon is \u0022A small step for [in the eyes of] the community, a great leap for [me]\u0022. Congratulations!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-09-29T01:28:43Z","Content":"\n\u003Cp\u003ECongratulations! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Landing on the Mun for the first time is certainly a huge accomplishment, and one any player should be proud of.\u003C/p\u003E\u003Cp\u003EI\u0027m especially intrigued by the fact that you chose the method you did instead of a direct-ascent lander or an Apollo-style mission. That\u0027s certainly something you don\u0027t often hear about for a first-time Mun landing.\u003C/p\u003E\u003Cp\u003EBut anyway, since you\u0027ve demonstrated that you know how to rendezvous and dock two spacecraft and how to encounter, land on, and return from another body, you really know almost all you need to know to do the same just about anywhere else in the Kerbol system. The rest is all about designing the right ship that can get to the right place at the right time for the mission.\u003C/p\u003E\u003Cp\u003EHappy launches!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EWhile we\u0027re on the subject: September 29 is also the 25th anniversary of \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EDiscovery\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E STS-26, the first Space Shuttle launch in the aftermath of the \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EChallenger\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E disaster. Certainly an auspicious anniversary to share your first Mun landing with!\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-29T01:32:29Z\u0022 title=\u002209/29/2013 01:32  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 29, 2013\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"superdude14862","CreatedById":64727,"CreatedDateTime":"2013-09-29T02:01:50Z","Content":"\n\u003Cp\u003EGood work! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E A mun landing is a pretty big milestone in KSP. It it the beginnings of interplanetary travel, and beyond...\u003C/p\u003E\u003Cp\u003EGood luck on that future mun base! Watch out for mun bugs. Or at least that\u0027s what I tell my kerbals to keep em on their toes. \u003C/p\u003E\u003Cp\u003EDo kerbals even have toes?\u003C/p\u003E\n"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2013-09-29T07:05:19Z","Content":"\n\u003Cp\u003EI have been to the Mun.... but I cannot get to the top of the VSP Hanger.... LOL...\u003C/p\u003E\u003Cp\u003EThank you one and all, especially for the advice about fuel transfers... I\u0027ll look into that.\u003C/p\u003E\u003Cp\u003EI still have a great deal to learn, thins morning, after posting that, I sent a base to the Mun, there is a new crater there... in fact, TWO craters... the next attempt ended the same way. \u003C/p\u003E\u003Cp\u003EI would have tried a third time, but I think the kerbals gave an audible sigh of relief when I had travel 80K\u0027s to pick up my new car....\u003C/p\u003E\u003Cp\u003ESo... \u003C/p\u003E\u003Cp\u003EI\u0027m guessing they are nervous again... time to recheck my design and double check every thing every step of the way... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2013-09-29T08:00:11Z","Content":"\n\u003Cp\u003ENothing against mech jeb, but it feels so much more rewarding doing it by hand.\u003C/p\u003E\u003Cp\u003EAnyway, congratulations!\u003C/p\u003E\u003Cp\u003E(Btw Minmus is easer to land on)\u003C/p\u003E\n"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2013-09-30T00:58:57Z","Content":"\n\u003Cp\u003EThat is my next destination...\u003C/p\u003E\u003Cp\u003EI find that if not for mechjeb, I wouldn\u0027t touch this game... honestly... personal choice...\u003C/p\u003E\u003Cp\u003EAnd I know for a fact that there is no such word as \u0022easier\u0022 or \u0022easy\u0022 in the Kerbal vocabulary... there is either NO, HARD or DEATH! Take your pick! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"chrischambers","CreatedById":69113,"CreatedDateTime":"2013-09-30T07:07:20Z","Content":"\n\u003Cp\u003Eit is great to learn and do the actions yourself, but I found that after the 100th time, you become bored and your mind start to wander. \u003C/p\u003E\u003Cp\u003EI discovered MechJeb, who has refresh my interested, as I can know kick off a launch, or set to flight path to a plant, and then do off and do something else, was it carries out the procedure.\u003C/p\u003E\u003Cp\u003EI still enjoy landing \u0022and Crashing\u0022 and docking the crafts, but in time, I and see this becoming a job for MechJeb, if the next release is not done release soon :-).\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-09-30T07:14:34Z","Content":"\n\u003Cp\u003ECongratulations on your \u0022giant leap\u0022!\u003C/p\u003E\n"}]}