{"TopicId":47716,"ForumId":51,"TopicTitle":"Mupollo 11, or how I learned how to land on a celestial body the hard way.","CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2013-10-08T10:37:11Z","PageNum":1,"Articles":[{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2013-10-08T10:37:11Z","Content":"\n\u003Cp\u003EThis is a short venture into my first extraterrestrial landing.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/9oyM8\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EDuna and Minimus are next. I\u0027ll eventually install Kethane and start mining. Thanks for being an awesomely supportive community, and thank you for taking a look!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T10:46:40Z\u0022 title=\u002210/08/2013 10:46  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by sharpspoonful\u003C/strong\u003E\n\u003Cbr\u003EForgot my opening line!\n\u003C/span\u003E\n"},{"CreatedByName":"Astraph","CreatedById":80902,"CreatedDateTime":"2013-10-08T16:11:24Z","Content":"\n\u003Cp\u003EMy fiancee sends her sympathies to Jessica. She had to endeure two weeks of designing \u0026amp; testing my SSTO \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EStill, that rocket looks pretty huge... What was its power \u0026amp; mass?\u003C/p\u003E\n"},{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2013-10-08T17:02:35Z","Content":"\n\u003Cp\u003EIt is an overall 584.75T, with the lander being 15.30T, and the overall Dv was roughly 6697. There was extra fuel to give myself a bit of maneuvering space, and to get the lander back into munar orbit for a recovery ship (the one in LKO) to take them back to Kerbin.\u003C/p\u003E\u003Cp\u003EJessica\u0027s response: \u0022To be fair, I got to play Skyrim while you were playing with your rocket. Not even mad...\u0022 and \u0022Awww, you put me on the mun!\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T17:10:14Z\u0022 title=\u002210/08/2013 05:10  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by sharpspoonful\u003C/strong\u003E\n\u003Cbr\u003EJessica\u0026#039;s response\n\u003C/span\u003E\n"},{"CreatedByName":"Astraph","CreatedById":80902,"CreatedDateTime":"2013-10-08T17:17:01Z","Content":"\n\u003Cp\u003EI used the Saturn V presented on the wiki, which is around 700 tonnes, if I remember correctly. Not something to be proud of, taking into account my lander was far smaller... On the other hand, I don\u0027t use MechJeb \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd gaming girlfriends/fiancees unite - I had to delay my first landing so that she\u0027d see Jebediah put the flag on the Mun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-10-08T17:20:15Z","Content":"\n\u003Cp\u003ENicely done! Also nice to have such a chill... girlfriend? Fiancee? Wife? Ah well, nice to know she\u0027s OK with it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2013-10-08T18:32:22Z","Content":"\n\u003Cp\u003E@ Astreph: I used MechJeb to show me how to land, and watched a tutorial on youtube. I did the landing guidance once, then reloaded to try on my own. But the Hohmann transfer, and munar orbit was done manually. I use mechjeb for rendezvous, ascent guidance from Kerbin, and for the info panes. I know, its the controversial hot button right now, but it is an excellent tool for teaching. Thank you though, and Jessica sympathizes with your fiancee! \u003C/p\u003E\u003Cp\u003E I really want to establish a small colony in that spot, as it is fairly flat, and on the edge of some interesting craters (to do some sweet jumps off of). With this being my first landing, I might be able to utilize a smaller lift in my next landing.\u003C/p\u003E\u003Cp\u003E @ Specialist290: Thank you! She is a really relaxed girlfriend, and will leave me to my own devices so long as a eventually sleep. If I don\u0027t, I get scolded. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for the weight, I used my 50T LKO lift design. Mostly because after I had crunched the numbers for the required Dv and figured the weight of the lander, It was only off by 1000\u002B or so Dv, so it cut some R\u0026amp;D time out of the equation. Kind of like how NASA did with the Mercury missions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T18:45:26Z\u0022 title=\u002210/08/2013 06:45  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by sharpspoonful\u003C/strong\u003E\n\u003Cbr\u003ESpelling. Adding content. Adding a K here and there....\n\u003C/span\u003E\n"},{"CreatedByName":"Astraph","CreatedById":80902,"CreatedDateTime":"2013-10-08T21:39:48Z","Content":"\n\u003Cp\u003EDon\u0027t take the MechJeb reference as a way to depreciate your effort. From what I see, this mod has some features I\u0027d love to see in vanilla game (such as easily accessable mass \u0026amp; power values)... As long as you make your most challenging manouvers yourself, I don\u0027t care whether there\u0027s MechJeb onboard \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI checked by Saturn V spin-off... Well, I overestimated the mass - it\u0027s 565 tonnes in start position, with 10,300 KN of starting thrust (5*Mainsail \u002B 8*solid boosters). Damn, I need to finally get a grip on Tsiolkovsky\u0027s equation so that I won\u0027t be like \u0022I have no idea what I\u0027m doing\u0022 when experimenting with new lifter designs...\u003C/p\u003E\n"},{"CreatedByName":"suzin.felipe","CreatedById":67820,"CreatedDateTime":"2013-10-09T09:20:55Z","Content":"\n\u003Cp\u003EWow, that was a huge lander!\u003C/p\u003E\u003Cp\u003EMy first landing was with the \u0022Toyota Corolla\u0022 type lander. took me ages to go big as you did in the first try.\u003C/p\u003E\n"},{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2013-10-11T10:44:31Z","Content":"\n\u003Cp\u003EIf \u0027Merica could, then I could.\u003C/p\u003E\u003Cp\u003EFOR GLORY.\u003C/p\u003E\u003Cp\u003E@Astraph: Sorry if it sounded defensive, it wasn\u0027t. I\u0027m just tired of people having to defend themselves for using a plugin is all.\u003C/p\u003E\n"}]}