{"TopicId":52810,"ForumId":51,"TopicTitle":"Reaching for the Stars [PH] - Jane\u0026#039;s VI 3 Feb 15","CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-12T04:25:20Z","PageNum":6,"Articles":[{"CreatedByName":"Fizwalker","CreatedById":78337,"CreatedDateTime":"2015-02-03T20:49:34Z","Content":"\n\u003Cp\u003EA few questions about some of the pre-WWII history in this timline! (Which may help with determining where Japan fell when sides were determined.... )\u003C/p\u003E\u003Cp\u003EDoes Japan maintain it\u0027s Alliance with England during RftS WWII?\u003C/p\u003E\u003Cp\u003EDoes Japan invade China?\u003C/p\u003E\u003Cp\u003EDoes the U.S. try to counter Japan\u0027s moves in China?\u003C/p\u003E\u003Cp\u003EIf the U.S. does try to pressure Japan to cease it\u0027s conflict, how aggressively does it do so? Is there a coherent overall strategy to it?\u003C/p\u003E\u003Cp\u003EIf there is a show down between Japan and the U.S., do the Japanese back down, or do they plunge the Pacific into war?\u003C/p\u003E\u003Cp\u003EIf there is a war, does the U.S. have the political will to finish it, or do the Japanese hold off the U.S. and end it with a negotiated peace? (Think if Japan attacked Pearl Harbor \u003Cem\u003Eafter\u003C/em\u003E it declared war on the U.S. instead of before.) Would lingering animosities spur the Japanese into trying to out-do the U.S. and other Colonial powers?\u003C/p\u003E\u003Cp\u003E(China, if it survives to be a going concern, might also develop it\u0027s own space program to counter a Japanese one.)\u003C/p\u003E\u003Cp\u003EIn Real History, Japan and Britain were allies up until the late 1930\u0027s, when the treaty came up for renewal. Due to the Japanese adventures in China and under pressure from the U.S., Britain let the treaty expire. If Japan isn\u0027t running amok in China, there is a good possibility that the Alliance would be renewed (which might mean that Russia would have to worry about two fronts rather than one.)\u003C/p\u003E\u003Cp\u003EIf the Japanese are fighting the Chinese, then whether Japan joins a side becomes more interesting. Britain might maintain the alliance just to keep another conflict from erupting on the other side of the world from where it needs to concentrate, and to maintain it\u0027s own possessions in the Far East (much like how the Triple Entente and the U.S. let Japan take German possessions in the Pacific during WWI in reality.) On the other hand, if the U.S. isn\u0027t involved in the war in Europe, then it would be free to deal with Japan and may bring even more pressure on Britain, perhaps even sooner than in real history. In this timeline, Japan might have it\u0027s own space program as well.\u003C/p\u003E\u003Cp\u003EVery interesting reading!\u003C/p\u003E\u003Cp\u003EOn another note, will RftS configs work along side the RO configs? Or are they mutually exclusive? \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E Is there another location to get the ReStock Parts Pack? It seems to be lost since the SpacePort transitioned to Curse..... \u0026gt;.\u0026gt;\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit#2:\u003C/strong\u003E I\u0027d like to use the RftS engines for my own alternate history--tho probably renamed to be Japanese/Chinese I think. (Might ask you a few questions about that at a future date, if you have the time! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ) Thank you in advance!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-03T21:16:00Z\u0022 title=\u002202/03/2015 09:16  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 3, 2015\u003C/time\u003E by Fizwalker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-02-04T03:32:12Z","Content":"\n\u003Cp\u003EFizwalker: the divergence is quite far back (during the US Civil War, in fact). Japan has developed somewhat differently (and in particular relevance to China the Sino-Japanese War is different and less one-sided) but Japan remains the obvious proxy for Britain to ally with against Russia and thus the Anglo-Japanese alliance still occurs. Indeed, it is the promise of Japanese aid in securing India against Russia which makes Britain feel sufficiently secure to not come to an entente with Russia (or, therefore, France).* Most of your questions, I think, presuppose a 1930s situation [i[far closer to real history (or, said differently, a divergence much later) than is the case with RftS.\u003C/p\u003E\u003Cp\u003E*I am very much persuaded by the argument that the reason Britain decided to join the Franco-Russian entente was its fear of the indefensibility of India (without which Britain felt it would no longer be a Great Power) in the face of Russian invasion--or at least indefensibility without compromising sufficiently with the tenets of British rule (i.e. giving in to Indian demands for self-government) so as to form a large enough Indian Army to do the task itself.\u003C/p\u003E\u003Cp\u003EAn additional factor in the (differing) development of Japan is that its model, Prussia/Germany, is a far different creature in RftS. Lacking nearly twenty years of Wilhelm I and Bismarck, instead developing for that same period under Friedrich III, Germany has begun to resemble much more the England of the latter\u0027s wife. With the political power of the army broken after an attempted coup, with the conservative elements in the Reichstag finally deciding that far from implicit support of the Kaiser (a tolerable policy even under the odiously liberal Friedrich) they must actively limit the authority of his firebrand son, and with said son due to his early escapades making overtures to the left-liberals and even the hated SPD...well, if the Meiji Constitution is based on the German one as it was in real history, it too will be a different creature.\u003C/p\u003E\u003Cp\u003EI do still think the genro will look to Germany as a model, though somewhat less than in OTL (i.e. real history). Russia, of course, cannot be a model, nor can strife-ridden, reactionary Austria. France may be a dictatorship in all but name, but for all its conservatism it is a populist dictatorship, run by the son of a lawyer, and no fit model for Japan. Germany is a stable constitutional monarchy, one where the Kaiser has far more power than Britain.\u003C/p\u003E\u003Cp\u003ETherefore the constitutional settlement in Japan--designed by genro who have seen the dangers of the military in politics in their model power, Germany, as well as the danger of the people in politics (as they feared OTL) will be different, different enough that the (equivalent of the) Taisho period does not come to an end.\u003C/p\u003E\n"},{"CreatedByName":"Fizwalker","CreatedById":78337,"CreatedDateTime":"2015-06-22T16:42:07Z","Content":"\n\u003Cp\u003EVery interesting, it seems the Pacific rim is a bit more peaceable in your timeline! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Looking forward to reading more of this, (if it isn\u0027t dead)\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-23T06:36:24Z","Content":"\n\u003Cp\u003EThanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s...hibernating. Though if you haven\u0027t read the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/109088-RftS-Jane-s-All-the-World-s-Hunters-of-the-French-Civil-War-19-Feb\u0022 rel=\u0022external nofollow\u0022\u003Eother thread\u003C/a\u003E you should, though even that is a few months out of date.\u003C/p\u003E\u003Cp\u003EAlthough actually with RO more or less OK for 1.0, I\u0027ve been feeling the urge to get back in to this. I never posted all the Jane\u0027s aircraft (1.0 QA/Exp/etc bit all my time, then updating RO for 1.0), and I have a spreadsheet full of LVs....\u003C/p\u003E\u003Cp\u003EPotential spoiler (per Bujold, author reserves the right to Have A Better Idea), a German spaceplane from a few years later:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/tXEc9bz.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/tXEc9bzl.jpg\u0022 alt=\u0022tXEc9bzl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote: amazingly enough, I reentered that successfully in RO (though I had to make some changes to the gear).\u003C/p\u003E\u003Cp\u003EEDIT: Oh yeah, re: the Pacific Rim. I still haven\u0027t fully decided whether Japan is involved in the Second World War; I\u0027m vascillating between a China-Japan conflict (with China a Russian ally and Japan for the League) and both nations at (grudging) peace.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-23T06:39:19Z\u0022 title=\u002206/23/2015 06:39  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by NathanKell\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2015-06-23T09:56:34Z","Content":"\n\u003Cp\u003ELooks good! It\u0027s like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://forum.nasaspaceflight.com/350x129xindex.php,qaction=dlattach,3Btopic=16860.0,3Battach=129270,3Bimage.pagespeed.ic.m8b9_DQvAf.jpg\u0022 alt=\u0022350x129xindex.php,qaction=dlattach,3Btopic=16860.0,3Battach=129270,3Bimage.pagespeed.ic.m8b9_DQvAf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://rt0023gv.eresmas.net/fotosyuri/shinden.jpg\u0022 alt=\u0022shinden.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ehad a baby \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-26T02:46:25Z","Content":"\n\u003Cp\u003EIt\u0027s actually more modeled on the \u003Ca href=\u0022http://www.astronautix.com/lvs/vonn1952.htm\u0022 rel=\u0022external nofollow\u0022\u003EVon Braun shuttle / ferry rocket\u003C/a\u003E. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(There\u0027s a model from Fantastic Plastics, actually.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-26T02:48:53Z\u0022 title=\u002206/26/2015 02:48  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by NathanKell\u003C/strong\u003E\n\u003C/span\u003E\n"}]}