{"TopicId":53265,"ForumId":51,"TopicTitle":"THE DUNA MISSIONS: Alpha and Beta - A Carrer Mode Duna Base!","CreatedByName":"Blip","CreatedById":85737,"CreatedDateTime":"2013-11-16T03:08:05Z","PageNum":1,"Articles":[{"CreatedByName":"Blip","CreatedById":85737,"CreatedDateTime":"2013-11-16T03:08:05Z","Content":"\n\u003Cp\u003ECheck out the new Duna Mission Beta, where I land the new base and its rover!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIPE\u0027s Duna Plans\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAfter IPE - the Interplanetary Exploration and Synthetic Foodstuff Corporation, or Interplanetary Explorers for short- few successful missions to Mun and Minmus, they decided it was time to leave the Kerbin system and look toward the other planets. They needed an efficient way to acquire science, especially surface samples, from the far off world of Duna. Thus, the Duna Lander Depot was conceived. The plan was to launch a three man nuclear tug towing a station into orbit around Duna. The station would remain in orbit, and be equipped with landers, which can be easily dispatched from the station with a crew of two to pick up surface samples, or unmanned as a rescue for the crew of a broken lander. Any spacecraft docked with the station, then, would have unrestricted access to Duna surface samples - all the crew would have to do is hop in a lander. To minimize size, the landers would be equipped with external seats instead of command pods, and no RCS systems would be attached. This is the first time IPE would attempt RCS-less docking, and mission control was worried about this design, but engineering refused to change.\u003C/p\u003E\u003Cp\u003EThe mission would be crewed by three of the greatest astronauts in IPE history: Mission Commander Sonfel Kerman (the popular, arrogant one), Engineer Wilney Kerman (the attractive, stupid one), and Pilot Melfrod Kerman (the only one who knows what he\u0027s doing). Melfrod was a little sour about giving the title of commander up to Sonfel, especially after Melfrod and Wilney had flown the successful Minmus mission together, with Melfrod in command.\u003C/p\u003E\u003Cp\u003EOn the Launchpad:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y0NLsSUl.png\u0022 alt=\u0022Y0NLsSUl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESonfel: Let me press the launch button. I\u0027m the mission commander, after all.\u003C/p\u003E\u003Cp\u003EMelfrod: Well, okay, its the red one on the left.\u003C/p\u003E\u003Cp\u003E*Sonfel begins hitting random buttons*\u003C/p\u003E\u003Cp\u003EMelfrod: That\u0027s not it. Not that one either. Nope!\u003C/p\u003E\u003Cp\u003EMelford: I\u0027ll just press it for you.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/h3rzAy5l.png\u0022 alt=\u0022h3rzAy5l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESonfel: I did it!\u003C/p\u003E\u003Cp\u003EMelfrod: Nope, I did.\u003C/p\u003E\u003Cp\u003EThe trio rocket through the sky, pushed along by the Century launch stage. They easily reach a 100x100 orbit, and begin their ejection burn:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XTtsoj6l.png\u0022 alt=\u0022XTtsoj6l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow it was time for the crew to endure months together, waiting for their Duna encounter.\u003C/p\u003E\u003Cp\u003EWilny: Are we there yet?\u003C/p\u003E\u003Cp\u003EMelfrod: No.\u003C/p\u003E\u003Cp\u003ESonfel: Are we there yet?\u003C/p\u003E\u003Cp\u003EMelrod: *sigh* Yes, we\u0027re there.\u003C/p\u003E\u003Cp\u003EDespite Melfrod\u0027s apparent sarcasm, Sonfel rushed to the window, and saw an incredible sight:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QAErHZcl.png\u0022 alt=\u0022QAErHZcl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey actually were there! And it was time to aerobrake.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TUv0AVRl.png\u0022 alt=\u0022TUv0AVRl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe crew reached a stable orbit, then moved the landers from where they were stowed to protect them from reentry to their primary places along the station:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XekJyOvl.png\u0022 alt=\u0022XekJyOvl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was nearly time to make the first landing on Duna. First, however, it was time to bicker about who would make that first landing.\u003C/p\u003E\u003Cp\u003EWilny: I\u0027m an engineer. If the lander breaks, I\u0027m the only one who can fix it!\u003C/p\u003E\u003Cp\u003ESonfel: Of course - Wilny and I are going. Melfrod, you stay here.\u003C/p\u003E\u003Cp\u003EMelfrod: But I\u0027m the only one who can actually land the lander!\u003C/p\u003E\u003Cp\u003ESonfel: I\u0027ll be fine. I need to plant the first flag on Duna in my own honor!\u003C/p\u003E\u003Cp\u003EMelfrod: Okay... Just remember - cut your thrust once you touch down!\u003C/p\u003E\u003Cp\u003ESonfel, of course, failed to heed this advice. Upon landing, he didn\u0027t cut his thrust, and the lander began flipping. He and Wilny were flung from the lander, but luckily it ended up on it legs. They made their way back to the lander, and planted a flag. In honor of their rough landing, the site was named Head over Heels. Here they are preparing for their return:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iv5NzWOl.png\u0022 alt=\u0022iv5NzWOl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a successful rendezvous, even without RCS, the crew load their samples into the tug, undock, and return home. With their invaluable scientific information, IPE is beginning to design a base for Duna, capable of storing four kerbals and equipped with a two man rover. Stay tuned for Duna Mission Beta!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-17T15:49:57Z\u0022 title=\u002211/17/2013 03:49  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 17, 2013\u003C/time\u003E by Blip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Blip","CreatedById":85737,"CreatedDateTime":"2013-11-17T18:23:36Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EThe Duna Base\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIPE has begun developing a new base, specifically suited for Duna. It would have housing for four kerbals, and come equipped with a two-man rover as well - allowing easy crew transfer from landers to the base and back. The base would also have four mystery goo containers, to provide new science to the guys back at Mission Control. The base is designed to be transported by a standard tug, and placed under the orbit of the station, where it could easily be serviced by landers.\u003C/p\u003E\u003Cp\u003EThe new mission would go as follows: The tug and base would go out to Duna orbit, and plane change into a new phasing orbit with the Station. The base would be released, and land near Duna\u0027s equator. The tug would then rendezvous with the station, refuel it, and transfer two crew members to a lander. They would land, grab surface samples, and return. Then the tug would undock, and head for home.\u003C/p\u003E\u003Cp\u003EThe crew this time: Base Commander - Sonfel Kerman; Base Engineer - Wilney Kerman; Mission Commander - Rodos Kerman; Scientist - Bobzon Kerman; and Tug Pilot - Melfrod Kerman.\u003C/p\u003E\u003Cp\u003EMelfrod was happy that Sonfel would be tucked away in a Base habitat module all flight, so the two would minimize communications. Rodos is a little more competent then Sonfel, and definitely not as arrogant; Rodos\u0027s main job is as an engineer, but he has training to land the Duna lander and is on the mission to escort for Bobzon down to Duna\u0027s surface.\u003C/p\u003E\u003Cp\u003ELaunch:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PdSTtmxl.png\u0022 alt=\u0022PdSTtmxl.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/NAezQTEl.png\u0022 alt=\u0022NAezQTEl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs the final stage of the Century launcher propels them out of Kerbin SOI, a Munar gravity assist comes up, and the boys decide to try it. At least it looks really cool.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/c3WZLP9l.png\u0022 alt=\u0022c3WZLP9l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey use the last of the fuel in the Century to raise their orbit partway up to Duna\u0027s, then finish off with the Tug\u0027s main engines. The five then wait a few months before Duna appears:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eHlPvrEl.png\u0022 alt=\u0022eHlPvrEl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMelfrod notices something as they approach: Duna\u0027s moon Ike seems to be in a good position to reach from the Station in orbit around Duna. Maybe they could head there next time? Of course, Sonfel thinks its a terrible idea.\u003C/p\u003E\u003Cp\u003EWilny, on the other hand, is exited at the prospect of doing more cool stuff in the Duna system. He can\u0027t wait to land their base!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0Yb8p0Pl.png\u0022 alt=\u00220Yb8p0Pl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe crew then establish their phasing orbit around Duna, and prepare to release the base for landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BcpjUgul.png\u0022 alt=\u0022BcpjUgul.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2eXuo8gl.png\u0022 alt=\u00222eXuo8gl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe base heads off, not a minute too soon for Melfrod. Exited to get rid of Sonfel, he begins instructing the two in the proper landing procedures that they forgot last time.\u003C/p\u003E\u003Cp\u003EMelfrod: Remember, cut your thrust when you land. You have more chutes this time, so it\u0027ll be better to cut before you touch down than to risk flipping the base.\u003C/p\u003E\u003Cp\u003ESonfel: I know what I\u0027m doing. Everything was fine last time!\u003C/p\u003E\u003Cp\u003EWilny: How about I pilot it this time round?\u003C/p\u003E\u003Cp\u003ESonfel: No!\u003C/p\u003E\u003Cp\u003EBut somehow, the landing goes off without a hitch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zxKGLgdl.png\u0022 alt=\u0022zxKGLgdl.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/WgWGgzfl.png\u0022 alt=\u0022WgWGgzfl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESonfel disconnects the rover and decides to go out and find a mountain. However, he\u0027s pretty impatient, and ends up just christening a nearby dune.\u003C/p\u003E\u003Cp\u003ESonfel: I\u0027m naming this dune Alkali Dune, and the base will be Alkali Base. Write that down and send it to Mission Control, Wilny.\u003C/p\u003E\u003Cp\u003EWilny: I hope you don\u0027t think they\u0027ll find this funny, \u0027cause I sure don\u0027t.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rSBpHRJl.png\u0022 alt=\u0022rSBpHRJl.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2diDs8nl.png\u0022 alt=\u00222diDs8nl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the meantime, Melfrod rendezvoused the Tug with the Station and docked.\u003C/p\u003E\u003Cp\u003EMelfrod: Okay, we\u0027re docked. I\u0027m going to begin fueling up the station, and you two can head over to a lander.\u003C/p\u003E\u003Cp\u003ERodos: Sure thing. I\u0027ll just check that the landers are in good shape, then we\u0027re good to go land.\u003C/p\u003E\u003Cp\u003EBobzon: It\u0027s so cool to be in space!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DRcf1ell.png\u0022 alt=\u0022DRcf1ell.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/WOTGIqbl.png\u0022 alt=\u0022WOTGIqbl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBobzon and Rodos, disconnect from the main station, and prep for landing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/weht9Ntl.png\u0022 alt=\u0022weht9Ntl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey touch down during a beautiful Kerbolrise, made even better by the tinge of Duna\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003EBobzon: Wow.\u003C/p\u003E\u003Cp\u003ERodos: This is incredible.\u003C/p\u003E\u003Cp\u003EBobzon: We have to name this landing site after this!\u003C/p\u003E\u003Cp\u003ERodos: How\u0027s \u0022Kerbolrise over the Dunes\u0022 sound?\u003C/p\u003E\u003Cp\u003EAnd thus, Kerbolrise over the Dunes was christened as the thrid flag on Duna. The boys are quite happy with themselves.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ee2WVhdl.png\u0022 alt=\u0022Ee2WVhdl.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/8aawWCYl.png\u0022 alt=\u00228aawWCYl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey return to the station and load their samples back into the main craft, and prepare to return home.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xomKZ9nl.png\u0022 alt=\u0022xomKZ9nl.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/LACBuPil.png\u0022 alt=\u0022LACBuPil.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs they begin their burn to leave Duna SOI, an surprise Ike encounter pops up. Melfrod, who was so intrigued by Ike earlier in the mission, decides to use the flyby as both a gravity assist and a way to get science! Maybe then the IPE will consider his proposal to land at Ike next.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/l76ZEHZl.png\u0022 alt=\u0022l76ZEHZl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter Melfrod takes an EVA report, the crew head home. Time to plan the next mission!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/99r3AW6l.png\u0022 alt=\u002299r3AW6l.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/VwC9jkNl.png\u0022 alt=\u0022VwC9jkNl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext time, the IPE heeds Melfrod\u0027s advice and sends up a little Ike lander, capable of going from the Station to Ike, landing, and returning!\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-17T19:05:44Z","Content":"\n\u003Cp\u003EThis is a cool story. Can\u0027t wait for more.\u003C/p\u003E\n"}]}