{"TopicId":54171,"ForumId":51,"TopicTitle":"Interview with Jeb - first Kerbal in orbit around Mun","CreatedByName":"iMAniaC","CreatedById":94023,"CreatedDateTime":"2013-11-24T02:54:45Z","PageNum":1,"Articles":[{"CreatedByName":"iMAniaC","CreatedById":94023,"CreatedDateTime":"2013-11-24T02:54:45Z","Content":"\n\u003Cp\u003EI started playing KSP roughly a week ago. I started out as a total newbie and jumped into Career mode with close to zero research. This is kind of how it went, presented as an interview with Jeb.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWe\u0027re here with a Kerbal who does not need introduction; he is the only Kerbal that has ever been in space; Jebediah Kerman! (Accompanied by a KSC PR Liaison). So, Jeb, you recently orbited Mun, and can you tell us, what is the first step in achieving that?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EWell, first, you have to get into an orbit around Kerbin and then, when Mun is approximately at 45Ã‚Â° of your target apoapsis, you gun the throttle and hope--\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWait, wait, hang on. You\u0027re saying you went to Mun with only a vague idea of how to do it?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EPretty much.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003EWhat Jeb is trying to say is that he knew exactly what he was doing.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThis isn\u0027t the first time you have flown without using all the instruments available to you, though, is it?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EThat\u0027s correct. All of the launches until we finally made a stable orbit were made without the use of SAS.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhy is that?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003ENo one told me that the [Command Pod] Mk 1 had SAS, so I--\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003EJeb can assure everyone that he knows all the rockets inside out and his decision to forego the use of SAS in those crucial first flights was a completely conscious one.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EBut I\u0027ve used the SAS ever since I found ou--\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003EEver since that was the most productive thing to do, yes.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EAnd now that I know about--\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003E- has decided to use -\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003E--the flight planner, it\u0027s going to be a vital part of every future mission.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOkay. But anyway, you set a course to Mun without a flight planner. Was the lack of a flight planner connected to those several flights out to Mun\u0027s orbit which did not actually orbit Mun?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EYes.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003ENo.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EI simply mis--\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003EThose were planned flights to check out Mun\u0027s orbit without Mun actually interfering with the orbit itself.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI see... Well, when you finally got into orbit around Mun, what was the first thing you did?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EFirst, I sent back the test results from the [sC9000] Science [Jr.] Bay from high Mun orbit and collected data from the [Mystery] Goo [Containment Unit] canisters which would return with me to Kerbin. Then I waited until I would reach the periapsis so that I could slow down and get to an orbit around Mun. Then, while in low orbit, I collected data of the Science Bay and Goo canisters again, in order to take them back with me to Kerbin.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat did you think about Mun, seeing it up close?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EIt\u0027s not just a huge rock, it\u0027s beautiful. It\u0027s the reason we\u0027re out there.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnd then you just headed back home with a mission well done?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EWell, almost. At some point my orbit had become skewed relative to the equator, so I had to use some thrust to get back to the right plane. This was also the point at which I realised that I was dangerously low on fuel.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003EPlannedly low on fuel, yes.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBut you recovered and established a perfect path back to Kerbin, I take it?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EActually, since I was so low on fuel, I decided to swing by Kerbin and thrust when I was in that orbit\u0027s apoapsis.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESmart move. So you entered an elongated orbit around Kerbin first?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EYes. ... And no. It wasn\u0027t a complete orbit, because it was so elongated that it would actually cross Mun\u0027s gravitational pull again and slingshot me out into space unless I did some corrections before that.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003EAs planned. As planned.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003ELuckily, --\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003E- Plannedly -\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003E-- the apoapsis came up before Mun so it would never get to that point.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYou said you were low on fuel. Were you ever concerned that you wouldn\u0027t have enough fuel to avoid the encounter with Mun and get thrown into space?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003E...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003EJeb isn\u0027t going to dignify that question with an answer. He has complete confidence in the fuel calculations of our people on the ground.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EErm... Yes. Well, anyway, there was enough fuel and I made it back into Kerbin\u0027s atmosphere, landing in the sea a short distance from the shore.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThat sounded like a very intense experience. What was your thoughts when the command module broke the surface of the water? Did you let out a sigh of relief?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003EActually, at that exact moment, I heard the science module with its Goo containers break off from the command module, so all the scientific results I was taking back were gone... So I\u0027m taking off again tomorrow in a slightly more sturdy rocket.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPR Liaison: \u003Cem\u003EAccording to schedule. This was all planned.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThere you have it folks, Jebediah Kerman! Not only the first Kerbal to go into orbit around Mun, but also the first planning to do it twice!\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-24T10:44:41Z\u0022 title=\u002211/24/2013 10:44  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 24, 2013\u003C/time\u003E by iMAniaC\u003C/strong\u003E\n\u003Cbr\u003EFixed apoapsis -\u0026gt; periapsis\n\u003C/span\u003E\n"}]}