{"TopicId":54991,"ForumId":51,"TopicTitle":"To the Frozen North!","CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2013-12-02T16:11:41Z","PageNum":1,"Articles":[{"CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2013-12-02T16:11:41Z","Content":"\n\u003Cp\u003EDocumentation and commentary of my first base that\u0027s an actual base, and not just a collection of ships landed near each other and called a base. For the sake of my sanity, and viewers\u0027 computers and/or smartphones, I\u0027ve opted to just provided a link rather than jamming all 45 pictures and accompanying text into the thread. Enjoy if you will, or don\u0027t, I\u0027ll admit it\u0027s probably not the most impressive mission ever done nor the most amusingly documented. But maybe someone will like it. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/GUZkh\u0022 rel=\u0022external nofollow\u0022\u003EAn at home test of my new modular base design. While such a test could easily have been carried out on the fields just outside the KSC, that would not have been the Kerbal way. After all, is it really science if it hasn\u0027t been strapped to a rocket first?\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr. Speed","CreatedById":72133,"CreatedDateTime":"2013-12-02T17:35:07Z","Content":"\n\u003Cp\u003ENice, definitely gonna copy the frame of your base. On which planet or moon are you going to put that base? I bet you could go to the MÃƒÂ¼n with that overpowered crew vehicle!\u003C/p\u003E\u003Cp\u003ESo, is the docking port still stuck there? haha\u003C/p\u003E\n"},{"CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2013-12-03T13:48:13Z","Content":"\n\u003Cp\u003EThe base frame is pretty simple. RC-001S Remote Guidance Unit with a M-2x2 Structural Panel on top, a M-1x1 Structural Panel attached to the 2x2 on the front and rear edges with a pair of TR-2L Ruggedized Vehicular Wheels on either side of the 1x1s. Put a Rockomax HubMax Multi-Point Connector on top of to 2x2 with a Structural Fuselage on the front and rear connectors, add docking ports and battery. Accessorize as desired, and drive carefully, it is a bit top heavy. \u003C/p\u003E\u003Cp\u003EProbably shoot for Minmus first, since it has such nice, flat expanses to set up on. The Mun or Minmus wouldn\u0027t be a problem for my crew transport, it\u0027s got \u002B10,000 dv. Though I\u0027d probably want to take off the upper stage SRBs. Firing off engines you can\u0027t shut down while trying to make precision course adjustments just can\u0027t go right. And unfortunately no, the docking port got itself deleted at some point, probably the first time I switched back to the VAH. Oh well, that\u0027s what the pics are for.\u003C/p\u003E\n"}]}