{"TopicId":55165,"ForumId":51,"TopicTitle":"Retro/Pro/Spective (picture heavy)","CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-04T09:08:10Z","PageNum":1,"Articles":[{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-04T09:08:10Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 0\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/lTmjAZc.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/bqCnxo3.jpg\u0022 alt=\u0022bqCnxo3.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EBob: Oh well. We are too far already. Couldn\u0027t they warn us a little bit earlier?\u003C/p\u003E\u003Cp\u003EBill: Huh? What is it, Bob?\u003C/p\u003E\u003Cp\u003EBob: It\u0027s news from KSC.\u003C/p\u003E\u003Cp\u003EJeb: Yay! What are they up to? Another interplanetary mission?\u003C/p\u003E\u003Cp\u003EBob: Something bigger. There seems to be some kind of commotion back home. They are starting a research program.\u003C/p\u003E\u003Cp\u003EBill: Isn\u0027t there already a research program running? You know, that we are a part of?\u003C/p\u003E\u003Cp\u003EBob: Well, it will be different in some ways, and I don\u0027t yet understand what exactly is going on. But they are asking every crew currently on a mission to, uh, \u0022observe and assess surrounding situation and write it down as a report for further review on arrival at KSC\u0022.\u003C/p\u003E\u003Cp\u003EBill: Ouch. Could you repeat this one please?\u003C/p\u003E\u003Cp\u003EJeb: Ah, Wernher\u0027s sort of stuff, definitely.\u003C/p\u003E\u003Cp\u003EBob: Indeed it is. So they want a report from us. The more details about places we\u0027re currently around, the better. But I don\u0027t know what exactly they want, and we are about to leave Jool\u0027s SOI, it\u0027s too high to come up with anything useful.\u003C/p\u003E\u003Cp\u003EBill: Well, it\u0027s big. And green.\u003C/p\u003E\u003Cp\u003EBob: Yeah... I\u0027ll mention it...\u003C/p\u003E\u003Cp\u003EJeb: Oh, look, they are also broadcasting some new designs! Spaceplanes again, I must see it!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003ERight, hello everyone. \u003C/p\u003E\u003Cp\u003EHere, if you don\u0027t mind, will be another picture-heavy and somewhat randomly-ordered story about different KSP missions, based on my current (and first, actually) playthrough that started out as a sandbox game with mostly stock components and in time developed into career mode with several mods (though I have stored a bifurcation point and will possibly resume it sometime with mostly stock again).\u003C/p\u003E\u003Cp\u003EThe story catches up with our heroes on board the thing called Pro Pulse 4 SC, and I\u0027ll introduce other characters and elaborate on ongoing events gradually in posts to come, reaching both into the past and the future relative to the conversation above.\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EBy the way, all pictures are clickable.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-08T20:41:26Z\u0022 title=\u002212/08/2013 08:41  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 8, 2013\u003C/time\u003E by Konnor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-04T09:44:45Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/KhHnlrq.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/tqyqX7q.jpg\u0022 alt=\u0022tqyqX7q.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBob: Uh, Jeb. Is it the plane from that recent broadcast?\u003C/p\u003E\u003Cp\u003EJeb: Yeah. And there is some odd feeling about it. Like...\u003C/p\u003E\u003Cp\u003EBob: What, like this new design is, again, made of same old components?\u003C/p\u003E\u003Cp\u003EJeb: No, it just seems familiar. Like, I\u0027m not sure exactly, but someone back at KSC told me about it earning some prizes* even before we left for Laythe...\u003C/p\u003E\u003Cp\u003EBill: Wait, Bob, what\u0027s wrong with old components?\u003C/p\u003E\u003Cp\u003EBob: Nothing wrong, Bill. It\u0027s just new research program and its bold statements. Advancing our technology even further, expanding the reaches of Kerbal Civilization, that kind of stuff.\u003C/p\u003E\u003Cp\u003EBill: Well, the \u0022second Laythe wave\u0022 came with this new engineering computer. A nice thing to have, by the way.\u003C/p\u003E\u003Cp\u003EBob: I know. But they are promising something even more substantial. Takes time, I guess.\u003C/p\u003E\u003Cp\u003EJeb: What exactly it\u0027ll be, I wonder. They could at least have sent this plane with second wave instead of that awful Aeris-based nonsense.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/OmAJr7Z.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ZlmlrOW.jpg\u0022 alt=\u0022ZlmlrOW.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBob: You\u0027ve managed to reach Laythe\u0027s orbit with it, Jeb.\u003C/p\u003E\u003Cp\u003EJeb: Yeah, and Scott has managed to land it there. He shared some opinions about its handling, and I wouldn\u0027t repeat his exact words. It would be embarrassing if someone else hears us.\u003C/p\u003E\u003Cp\u003EAnd this is Scott Kerman** trying to land that Aeris-based spaceplane on Laythe:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/uaz95JS.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ZWHwm0e.jpg\u0022 alt=\u0022ZWHwm0e.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt took off from Kerbin rather easily, but simulations proved it to be extremely challenging to control in low-speed flight at sea level due to center of mass and aerodynamic center alignment. Nevertheless, Scott overcame all these difficulties and ended up the fourth Kerbal to set foot on Laythe\u0027s sands. Here Jeb, Bill and Bob are greeting him at (not yet complete) Solaris Base:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/SopeRMo.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/fyWwtJV.jpg\u0022 alt=\u0022fyWwtJV.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBob: I think I remember... There was something wrong with atmospheric simulations back on Kerbin. All sorts of designs which were thought to be all right actually proved to be incapable of reaching orbit...***\u003C/p\u003E\u003Cp\u003EJeb: Yeah, there was something like that in the broadcast too. Lemme check... Whoa, what is THAT?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/l1TitI3.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/qQGMom8.jpg\u0022 alt=\u0022qQGMom8.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBill: Eh... Do they actually fly?\u003C/p\u003E\u003Cp\u003EJeb: I want one of these. No, I want them both! But we are such a long way from home...\u003C/p\u003E\u003Cp\u003EBob: What is it, rover wheels? Ah, Qubit family. I see.****\u003C/p\u003E\u003Cp\u003EJeb: Oh well, I didn\u0027t even try out Archibald\u0027s original Qubit. And here they are, nicer and better.\u003C/p\u003E\u003Cp\u003EBill: Are you sure they are better?\u003C/p\u003E\u003Cp\u003EJeb: Just look at them! How can they not be?!\u003C/p\u003E\u003Cp\u003EBob: Actually Archibald reported some problems with Qubit during his flight around large islands...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/SS3TjLa.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ghVmHMS.jpg\u0022 alt=\u0022ghVmHMS.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAbove is Archibald Kerman descending to Solaris Base from orbit. Definitely excited.\u003C/p\u003E\u003Cp\u003ELater, when Jeb, Bill and Bob were already leaving Laythe\u0027s sphere of influence, Archibald had a time of his life exploring some other islands, despite all handling oddities:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/hM6TPaJ.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/oPIVa92.jpg\u0022 alt=\u0022oPIVa92.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHe eventually found a promising equatorial area for the upcoming second Laythe base, which he named Orient. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/5ABsDqD.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/qRzMyHX.jpg\u0022 alt=\u0022qRzMyHX.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut back to our trio.\u003C/p\u003E\u003Cp\u003EJeb: Oh come on, problems just make it more fun. And it was nothing to worry about, really. He got back so Solaris, anyway.\u003C/p\u003E\u003Cp\u003EBill: Extreme angle of attack forcing to throttle up during landing to avoid stall is nothing to worry about?\u003C/p\u003E\u003Cp\u003EJeb: Exactly!\u003C/p\u003E\u003Cp\u003EBob: There is an incoming transmission from Laythe. It\u0027s Dermund...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* What Jeb refers to here is \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/11214?p=557403\u0026amp;viewfull=1#post557403\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Eboolybooly\u0027s entry in the K Prize thread\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E (upon which the spaceplane they are discussing is based).\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E** This name really came up in the Astronaut Complex\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*** That was, actually a transition to Ferram Aerospace Research mod\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E**** \u0022Qubit family\u0022 is largely inspired by \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/27552\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EBrotoro\u0027s BirdDog from Long term Laythe thread\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E. I liked the idea but did not want to copy his design so I made something functionally similar (but less thought-out). The problems they are discussing, though, are caused by transition to FAR: my rover/plane hybrids do not work that well with more realistic aerodynamics.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-05T09:28:01Z\u0022 title=\u002212/05/2013 09:28  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 5, 2013\u003C/time\u003E by Konnor\u003C/strong\u003E\n\u003Cbr\u003ELarger thumbnails.\n\u003C/span\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-05T09:17:59Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/FWkwUCT.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ejgfhap.jpg\u0022 alt=\u0022ejgfhap.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDermund Kerman landed on Laythe between Scott and Archibald, all three of them comprising the crew of so called Second Laythe Wave - an armada of five interplanetary Pro Pulse transport ships that also brought some hardware for both base and station. Above is a picture of him entering atmosphere in the Jet Elevator - somewhat overcomplicated SSTO-capable VTOL lander for operations on Kerbin and Laythe. An interplanetary \u0022connector\u0022 is seen here too, not yet detached: it was used for docking maneuvers back home and for deorbiting burn here as well, to save fuel from its main tanks.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/nRYfoFj.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/nuHUk6f.jpg\u0022 alt=\u0022nuHUk6f.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDermund ended up about a kilometer away from the base itself, mostly to minimize possible damage if something went wrong.* So Jeb, Bill and Bob took a rover and picked him up after the landing:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/APBWgG2.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/1YReG1W.jpg\u0022 alt=\u00221YReG1W.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut that was some time ago. Back to Pro Pulse 4 SC command pod...\u003C/p\u003E\u003Cp\u003EDermund: Hello there guys, how are you holding up? I mean, other than being crowded in this compartment for a next year or something?\u003C/p\u003E\u003Cp\u003EBill: Now that you mention it... This cabin could really be more spacious.\u003C/p\u003E\u003Cp\u003EBob: Well, sticking a pod to a transport and calling it an interplanetary manned ship wasn\u0027t the best idea KSC ever came up with.\u003C/p\u003E\u003Cp\u003EJeb: Oh come on, we are in space! And heading home!\u003C/p\u003E\u003Cp\u003EBob: Yeah, it could be worse, I guess. But anyway, Dermund, how is it going there on Laythe?\u003C/p\u003E\u003Cp\u003EDermund: Well, remember those two probes we brought? I\u0027ve been tracking them recently, and now they are gone.\u003C/p\u003E\u003Cp\u003EBob: What do you mean, \u0022gone\u0022? You were supposed to send them into Jool\u0027s atmosphere...\u003C/p\u003E\u003Cp\u003EDermund: And we did. One of them even landed. In some sense, that is.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/K9WA8ps.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Ndd16Es.jpg\u0022 alt=\u0022Ndd16Es.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBill: Wow, that thing is really hot! And way too dense, too!\u003C/p\u003E\u003Cp\u003EDermund: Contact was lost shortly after altimeter went negative.\u003C/p\u003E\u003Cp\u003EBob: Ah, so it went just as planned. And the second probe?\u003C/p\u003E\u003Cp\u003EDermund: No luck there, it\u0027s been on the dark side for too long and ran out of power. No data from this one, alas.\u003C/p\u003E\u003Cp\u003EBob: At least we got these readings. Could you upload it to KSC?\u003C/p\u003E\u003Cp\u003EDermund: There is a problem with that, Bob: we\u0027ve only got singular readings, and they want something with statistical significance.\u003C/p\u003E\u003Cp\u003EBob: Oh well. A pity.\u003C/p\u003E\u003Cp\u003EDermund: But we did upload our own readings from Laythe. And that should be something! Well, gotta go, guys, see you!\u003C/p\u003E\u003Cp\u003EJeb: Yeah, greetings to Scott and Archibald down there.\u003C/p\u003E\u003Cp\u003EDermund: Will do. Dermund, out.\u003C/p\u003E\u003Cp\u003EThe probes can also be seen here, attached to a transport ship:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/PANxTvz.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/0LdRyt3.jpg\u0022 alt=\u00220LdRyt3.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is actually the Pro Pulse 4 SC, a ship Jeb, Bill and Bob are on currently on board, but at some earlier time, approaching Jool. There is also an odd looking device with wheels and landing gear - a mobile refueler for spaceplanes at the surface of Laythe; and, attached to another side, is Qubit with a \u0022connector\u0022 similar to that of a lander mentioned above. The whole assembly was unmanned during its flight to Jool system, and only after reaching Laythe\u0027s orbit did Archibald board Qubit\u0027s crew pod.\u003C/p\u003E\u003Cp\u003ENext up: historical note on interplanetary transport ships.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* And decrease the lag, of course; which didn\u0027t actually help, since \u0022observed lag radius\u0022 was 1.5km.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-05T12:19:59Z\u0022 title=\u002212/05/2013 12:19  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 5, 2013\u003C/time\u003E by Konnor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-06T10:52:47Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/OtT8gPn.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/y1XgH52.jpg\u0022 alt=\u0022y1XgH52.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis picture shows an unmodified Pro Pulse just after orbiting burn, with orbital insertion stage not yet detached. This ship was at the core of the Second Laythe Wave. But before I delve into the details, I think I should give some historical background of interplanetary travel in this story - events that influenced this design.\u003C/p\u003E\u003Cp\u003ESeveral years earlier, Jebediah Kerman\u0027s Junkyard and Spaceship Parts Co won a tender to send a Kerbal to Duna. Well, in fact, Jeb\u0027s company was the only participant of this tender, and its organizer as well, but when Rockomax Conglomerate and other rivals heard about it, Jebediah was already in space, in a contraption called The Trident:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/zT7B6hG.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/HsZcKUb.jpg\u0022 alt=\u0022HsZcKUb.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut this spacecraft was thought to have only enough power to get from Duna to Kerbin, but not for a there-and-back-again trip, and therefore, another stage was needed. Rockomax did not give up and managed to beat Jeb\u0027s company this time (\u0022Because I was in space, dang it, not able to work on the ship!\u0022, Jeb later commented) - that\u0027s how Trident Propulsion System came to life:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/cI3WvnN.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/hePTcYD.jpg\u0022 alt=\u0022hePTcYD.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFacing an alternative of either leaving right away or waiting for another day or two, Jeb grudgingly agreed to dock with it and headed to Duna:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/moo5w4m.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/czDHQfh.jpg\u0022 alt=\u0022czDHQfh.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBy the time he got there, all of the propulsion system\u0027s stages were spent and ditched, so only a Trident itself remained:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/rqShCxy.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/4RaY0hg.jpg\u0022 alt=\u00224RaY0hg.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EActually, this whole assembly was essentially multistage; like a regular early-days-Kerbin-viscinity rocket scaled up in number of stages. This design philosophy was cranked up to the extremes and proved to be cumbersome and suboptimal: it had two Poodle engines in separate stages, having to haul one as a deadweight while another was used; it also could do just fine without these three \u0022breaking\u0022 engines, but they were added anyway; and ditched in Duna\u0027s atmosphere:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/zk2n8rT.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/rdKMgZ7.jpg\u0022 alt=\u0022rdKMgZ7.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut the ship did its job and landed, even managing to settle on a slope:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/xBdi2fh.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/I1S2J5s.jpg\u0022 alt=\u0022I1S2J5s.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd finally (after one preceding automatic mission) Jeb became the first Kerbal on Duna:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/CDVekis.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/xzVn7Gm.jpg\u0022 alt=\u0022xzVn7Gm.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESpending some time there contemplating the sunset, he eventually decided to get back home. The return trip was thought to be another round of multistage madness, but it turned out that only aerospikes had to be ditched...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/LsJIhDG.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/XFUeASn.jpg\u0022 alt=\u0022XFUeASn.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...while the rest of the ship got back to Kerbin without even using its ion engine:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Itrvl5I.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/IPwCYhn.jpg\u0022 alt=\u0022IPwCYhn.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor some time the main achievement of Jeb\u0027s trip was considered to be the trip itself - a fact that getting to Duna and back was possible and even easier than perceived before. Moreover, several subsequent Duna missions (and even one mission into Jool system - the First Laythe Wave) went on without any separate interplanetary vehicle (to save time spent on docking). But later, when the demand arose for transferring large amount of hardware, a combined effort was undertaken to design a next generation of Interplanetary Propulsion System. The name was shortened later to Pro Pulse, and a total of five ships was built, with some variations. But more on that in one of the following parts. As for now...\u003C/p\u003E\u003Cp\u003EBill: You know, Jeb - it\u0027s not fair you\u0027ve been to Duna and we haven\u0027t.\u003C/p\u003E\u003Cp\u003EBob: Yeah, that\u0027s how the planners at KSC work. Remember Mun and Minmus missions? Three-seat pod, just like the one we are in now, but one-seat lander.\u003C/p\u003E\u003Cp\u003EJeb: Yeah, and I was hanging in the orbit both times!\u003C/p\u003E\u003Cp\u003EBob: You had other duties as a commander...\u003C/p\u003E\u003Cp\u003EJeb: Well, commander or not, but know what - we should visit Duna when we back home.\u003C/p\u003E\u003Cp\u003EBob: Indeed. But with some more viable mission plan, so that we don\u0027t get stranded there like Roddos and Thompfel.\u003C/p\u003E\u003Cp\u003EJeb: Wait, what? Are they really stranded?\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-07T19:54:16Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 4\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/It8fNV6.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/MVhItha.jpg\u0022 alt=\u0022MVhItha.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe definition of \u0022stranded\u0022 is, to some extent, vague. Having a clearly stated goal, a state of the art experimental vehicle at your disposal, a whole new planet to explore and even a shelter somewhere within your reach are not usually the things associated with being stuck somewhere, but Jeb does not take into account the fact the said shelter is the only possible way of reaching orbit, and it does not have enough fuel...\u003C/p\u003E\u003Cp\u003EAfter the success of Trident an interest in the red sandy planet was rising. Mission planners at KSC now had enough public attention and resources to supervise several missions at once, so not one but three ships were sent to Duna. First one, with Hudvey, Roddos and Thompfel, was planned to become a core of Carryall Station:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/RkOBlba.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/oLHLxLL.jpg\u0022 alt=\u0022oLHLxLL.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThen the Windtrap lander, for continuous operations on the surface:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/MmwczD5.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/BzZFNGD.jpg\u0022 alt=\u0022BzZFNGD.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd then the Light Tank, a fuel storage for the station:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/slvKYqn.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QUFZxV4.jpg\u0022 alt=\u0022QUFZxV4.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EApart from being (again) overdesigned - some fuel tanks had to be dropped on arrival to clear access to docking ports - this mission went rather well and led to a creation of first space station beyond Kerbin\u0027s SOI:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/wJZZ0qp.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/EbbgSky.jpg\u0022 alt=\u0022EbbgSky.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut, while Roddos and Thompfel were preparing for descent, and Hudvey tried to get used to a role of mission commander, another ship somewhat unexpectedly entered Duna\u0027s SOI. As it was figured out while it tried to dock, the planners made another new \u0022brilliant\u0022 decision to send a medium-sized rover to Duna while launch window was still open, but forgot to warn the station crew about it. Moreover, this rover was meant to be delivered to the surface docked to the Windtrap lander (to save time spent on landings, as well as an effort to build its own descend stage).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/AwXgDFM.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/escf5SP.jpg\u0022 alt=\u0022escf5SP.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAt least the rover still had enough fuel in its interplanetary tanks for deorbiting burn, but controlling it with engines off-center was really a nightmare for everyone involved. And of course the whole assembly was too heavy for the chutes to slow it down enough:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/9rnDNOf.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/5E6YUOn.jpg\u0022 alt=\u00225E6YUOn.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEngines were most likely needed even without that extra load, but with it, breaking burn took more fuel as the lander acted as a skycrane, having first to drop the rover and only then settle on the ground several meters away:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/KxpITMJ.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/anXLe1F.jpg\u0022 alt=\u0022anXLe1F.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThompfel and Roddos were not yet concerned about getting back. It was the shiny new Quad Rover that occupied their thoughts, and a mission to reach Duna\u0027s northern ice cap:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/bK3sluT.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/BE63ER9.jpg\u0022 alt=\u0022BE63ER9.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso at that time nobody was exactly sure how much fuel does the lander need. Only after the invention of engineering computer it became clear that it is barely able to reach orbit with full tanks. But after all these maneuvers, its tanks where half-empty (or half-full, as Jeb would put it)...\u003C/p\u003E\u003Cp\u003EJeb: Hey, that\u0027s just like when we landed on Laythe.\u003C/p\u003E\u003Cp\u003EBob: Yeah, and we spent \u003Cem\u003Eall\u003C/em\u003E our fuel.\u003C/p\u003E\u003Cp\u003EBill: At least we knew then that second mission was already underway...\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-12-07T21:41:03Z","Content":"\n\u003Cp\u003EDon\u0027t give up on those two guys. Rescue missions are great source of experience. And satisfaction if succesful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-07T21:41:31Z\u0022 title=\u002212/07/2013 09:41  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 7, 2013\u003C/time\u003E by Scotius\u003C/strong\u003E\n\u003Cbr\u003EA typo.\n\u003C/span\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-08T20:40:56Z","Content":"\n\u003Cp\u003EThese two guys will have their share of adventures in this story.\u003C/p\u003E\u003Cp\u003EAnd of course I\u0027m not going to abandon them. Or anyone (or anything).\u003C/p\u003E\u003Cp\u003ENo new part today, though; sorry.\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-09T21:44:32Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 5\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EEven as Bill and Bob were preparing to reunite with Jeb on the surface of Laythe, a large-scale activity was in progress back on Kerbin.\u003C/p\u003E\u003Cp\u003EJet Elevator, a lander Dermund would later use, passed SSTO-capability test:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/19uQM4O.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/gcNi8sS.jpg\u0022 alt=\u0022gcNi8sS.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EScott reached Kerbin\u0027s orbit as well with Solaris SSTO shuttle - here it is being refueled:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Rw0vbIo.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/7pyBcfY.jpg\u0022 alt=\u00227pyBcfY.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd Archibald successfully tested the Qubit in both plane and rover modes:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Fs2BYWM.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/rvwiVnN.jpg\u0022 alt=\u0022rvwiVnN.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile, a new generation of interplanetary transport vehicle finally came to life. Unlike its predecessor, the Trident Propulsion System, this spacecraft was designed to be operated without detaching any parts during interplanetary missions; it was, nevertheless, launched with a multistage rocked, but once docked with payload, the only thing that could come off was this payload itself. Even though with this approach its dry tanks would have become a dead weight, it would\u0027ve been easier to maintain, as only refueling would be necessary. For payload, each ship featured a large port on one side and, as per original plan, three regular-sized ports for three-port connections; two smaller ports were provided as well on top of fuel tanks, just in case.\u003C/p\u003E\u003Cp\u003EThe first ship of the series, Pro Pulse 1, would carry the lander and a control module for Solaris Station:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/LGFhrDT.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/4K0t7GD.jpg\u0022 alt=\u00224K0t7GD.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESecond one, Pro Pulse 2, would deliver the habitat module for the base called Apartment 1 (with all three kerbonauts on board), and the Fuel Depot*, fuel storage for jets:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/PQIKJYQ.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/NMEF24a.jpg\u0022 alt=\u0022NMEF24a.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPro Pulse 3 docked with Scott\u0027s spaceplane after it was refueled. There is also a rover seen here: it\u0027s Quad Rover II, a redesign of the machine Thompfel and Roddos landed on Duna with - now with its own descent stage:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/nADX5u8.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/G4Reuuh.jpg\u0022 alt=\u0022G4Reuuh.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThese three ships all had triple-adapters that were thought to enhance payload stability. But in reality, this didn\u0027t happen. To the contrary: payload connected like this tended to wobble even more than with single-port attachments, and sometimes some of three ports failed to attach. This led to a decision to use only a single regular-sized port in next models; the idea to fit one of the ships with a crew pod also came up at this time; the pod would also serve as 2.5 to 1.25 adapter, as it had just the right size for a regular docking port. To distinguish this unique feature set from other ships in the series, this spacecraft got a two-letter suffix \u003Cem\u003ESC\u003C/em\u003E, meaning \u003Cem\u003ES\u003C/em\u003Eingle port and \u003Cem\u003EC\u003C/em\u003Eontrol pod; its payload were Qubit and Mobile Refueler, another odd rover (seen here without its descent facilities that were added later and required some re-docking):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/432HSCU.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2ozSBAx.jpg\u0022 alt=\u00222ozSBAx.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe last ship also had only one forward port but crew pod was not necessary, as only Jeb, Bill and Bob were to return to Kerbin with that wave. It was, therefore, named Pro Pulse 5 \u003Cem\u003ES\u003C/em\u003E (for \u003Cem\u003ES\u003C/em\u003Eingle port) and docked with hub module for the station and an orbital fuel storage called Heavy Tank (seen here with an orange fuel tank that is actually part of ascent stage and will be detached before leaving):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/WtpNVoL.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/du91MGA.jpg\u0022 alt=\u0022du91MGA.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJeb: And now we are heading back. To complete the loop, so to say. Also, did I ever tell you that without any payload this thing is much easier to control?\u003C/p\u003E\u003Cp\u003EBill: Have you tried to control it \u003Cem\u003Ewith\u003C/em\u003E the payload?\u003C/p\u003E\u003Cp\u003EJeb: Oh, no, but it\u0027s obvious, right? Anyway, I wonder, what payload will this craft transfer next?\u003C/p\u003E\u003Cp\u003EBob: If my suspicions are correct, it well be sorely obsolete when we reach Kerbin.\u003C/p\u003E\u003Cp\u003EBill: Um. Why?\u003C/p\u003E\u003Cp\u003EBob: Well, I\u0027ve got this feeling reading this new spaceplane report from KSC...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* Obviously based on \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/27552\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EBrotoro\u0027s GasStation\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-10T21:36:11Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 6\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBob\u0027s intuition did not fail him, and this is what he \u003Cem\u003Ewould\u003C/em\u003E see had he an ability to look into the future:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/6G4apcl.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/bseDsMd.jpg\u0022 alt=\u0022bseDsMd.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut due to the lack of said ability, what he actually saw in the previously mentioned report was just this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/suyPIoy.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/fpaPo4W.jpg\u0022 alt=\u0022fpaPo4W.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBill: Oh, I didn\u0027t know they could make wings swept back that much.\u003C/p\u003E\u003Cp\u003EBob: They are saying a technology to make wings of any form has been discovered.\u003C/p\u003E\u003Cp\u003EJeb: Well, that\u0027s great: large sweepback angle should be good for high-speed flight. And not as heavy as deltas.\u003C/p\u003E\u003Cp\u003EBill: And why are the tailfins on wings?\u003C/p\u003E\u003Cp\u003EJeb: The farther back rudder is, the better control it offers. And here, wingtips seem to be behind the fuselage.\u003C/p\u003E\u003Cp\u003EBob: And it was orbital flight, too. With much less rocket fuel than Solaris shuttle would use, and successful flatspin recovery during descent.\u003C/p\u003E\u003Cp\u003EThe Psi Shuttle, spaceplane our heroes are discussing, was the first successful attempt to make a small and fuel-efficient SSTO plane* to replace Solaris Shuttle tested earlier on Laythe. Its task was similar: to transfer a kerbonaut from surface to an orbital station (or other way around) using as little fuel as possible. Psi shuttle features two FL-T200 LFO tanks and one Mk1 jet fuel tank, hence its fuel capacity is 150\u002B180 units of liquid fuel and 220 units of oxidizer, while Solaris shuttle and Aeris 4A use as much as 150\u002B720 units of fuel and 880 units of oxidizer to achieve essentially the same task.\u003C/p\u003E\u003Cp\u003ENow, this task, as simple as it is, actually applies some requirements; the craft must be able to dock with a station and therefore must have:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Ea docking port (preferably medium-sized)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERCS thrusters and some storage of monopropellent\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAn optional requirement is to have a docking port aligned with the center of mass so that the plane attached to a transport ship does not disrupt its symmetry (that\u0027s why both Solaris and Psi have a forward-facing port and an Mk2 cockpit). But because it is possible to attach two spaceplanes to a transport ship, this requirement is not mandatory, and an attempt to make a spaceplane without heeding it has been made, too:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/WJ6PcNd.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/rvJ936A.jpg\u0022 alt=\u0022rvJ936A.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is The Wasp, and it does away with 80 \u002B 135 units of fuel and 165 units of oxidizer, while sporting a two-kerbal crew pod, but with upward-facing docking port (actually, forward port configuration should also be possible; it just does not look cool). This fuel efficiency record was not really impossible to beat, yet it took some time to actually do it, and will be covered later. But at that time, investigation into reusable spaceplanes and their capabilities went on, with some some less useful results like this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ZA498Jq.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/kmAeOB9.jpg\u0022 alt=\u0022kmAeOB9.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...and more useful, such as the Gradient S:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/1qBty1H.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/AgXpFQ3.jpg\u0022 alt=\u0022AgXpFQ3.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...which was the first spaceplane able to deliver a small (1.25m-diameter, that is) satellite into orbit (and hence the \u003Cem\u003ES\u003C/em\u003E suffix in its name); and the Gradient M:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/0l81bT9.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/jLq9d7N.jpg\u0022 alt=\u0022jLq9d7N.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBob: Oh yes, finally something new!\u003C/p\u003E\u003Cp\u003EBill: Yeah, I\u0027ve never seen anything like that. What a nice cockpits and other stuff.\u003C/p\u003E\u003Cp\u003EJeb: You know, these engines are even nicer! Here it is said they can operate as either a jet or a rocket. Wow, is this even possible?\u003C/p\u003E\u003Cp\u003EBob: Apparently, now it is possible. Synergistic Air-Breathing Rocket Engine.\u003C/p\u003E\u003Cp\u003EJeb: I want home, now!\u003C/p\u003E\u003Cp\u003EBill: Look, there is another odd thing...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/kEyihUQ.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/IEmXTKp.jpg\u0022 alt=\u0022IEmXTKp.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJeb: Wha... A propeller? On a rover? Nice!\u003C/p\u003E\u003Cp\u003EBob: Oh, why would... Ah, I see. Apparently, our Duna explorers have faced some troubles with their glider, and this the possible solution...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* compatible with FAR; previous attempt from Part 1 worked well but only with vanilla aerodynamic model.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-11T18:59:05Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 7\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/0NQAqHr.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/TALLJjA.jpg\u0022 alt=\u0022TALLJjA.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EExcited as they are on this picture, Roddos and Thompfel soon stumbled upon some handling issues their rover had. First, its center of mass was higher than they would have wanted, though this, on the other hand, provided good ground clearance. Second, its wheelbase was rather narrow: not something to worry about while going straight, but makes sharp turns inadvisable. Each of these issues alone was bearable, but together they made Quad Rover hard to control on uneven terrain Duna is well known for, limiting safe speed to just about 10 m/s and requiring accurate and tentative driving - not something most Kerbals are accustomed to.\u003C/p\u003E\u003Cp\u003EStartled by these news from Duna, KSC planners decided that another means of reaching an ice cap was needed*, and began to research a different method of covering large distances, also known as flying. Taking into account the lack of oxygen in Duna\u0027s atmosphere, they had to refrain from using ever-so-attractive air-breathing engines and quickly found out that conventional rockets can, in fact, work with atmospheric planes, which this test flight and landing undeniably proved:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/O39fAri.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/uDyjhiL.jpg\u0022 alt=\u0022uDyjhiL.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut another thing this prototype with two toroidal aerospikes proved was its insatiable hunger for fuel (and oxidizer, of course): a short trip to an old airfield drained its tanks almost completely. Moreover, while its wings were enough on Kerbin, in thinner atmosphere the lift they provided was thought to be inadequate. An attempt had been made to remedy both these shortcomings:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/J2jiZkq.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/x5csvF1.jpg\u0022 alt=\u0022x5csvF1.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...but this didn\u0027t actually turn out well either. Even though this thing, controlled remotely, managed to land several times (one time it didn\u0027t even lose any wing parts), it was too heavy and hard to control. So a question came up during one of debriefings: \u0022If nuclear engines, known for their fuel efficiency, are not efficient enough, then what is?\u0022\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/AAC5e5v.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/WkjaQfp.jpg\u0022 alt=\u0022WkjaQfp.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo there was an answer: ion engines! Two of these were able to speed up this small prototype aircraft enough for lift off. Actually, it lifted off at about 5 m/s**. Some more prototypes were constructed - like this one with smaller (and lighter) wings, landing with two brave Kerbals on board:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/e21ONvE.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/3eJt0TI.jpg\u0022 alt=\u00223eJt0TI.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEventually, the final version, in which girders were replaced with lighter beams, was dubbed Ornithopter Xenon and sent to Duna:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/yS8bjQt.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/aakDrc5.jpg\u0022 alt=\u0022aakDrc5.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBelow it is about to enter an atmosphere, just after detaching its interplanetary engines (another set of engines also seen here was meant to be used for deorbiting burn, but interplanetary stage had enough fuel for that):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/pxBGx9E.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/WtIioI5.jpg\u0022 alt=\u0022WtIioI5.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter bleeding off its orbital speed, Ornithopter Xenon glided close to the rover:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Aowj3ta.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/3ekW8L6.jpg\u0022 alt=\u00223ekW8L6.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAt that time Thompfel and Roddos had their first chance to evaluate its gliding capabilities***. They actually overshot and had to turn it around and only then attempted to land, all of that without any help from the engines. This went rather well, although was far from easy:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/iBKgmyF.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/aoqTTxv.jpg\u0022 alt=\u0022aoqTTxv.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThey overshot again, but not much this time, just about three kilometers, which they easily covered in their rover:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/RO8ygfg.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/56tuet0.jpg\u0022 alt=\u002256tuet0.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd finally, our intrepid adventurers boarded their new flying device (the first aircraft to fly somewhere other than Kerbin), activated the engines and took off into the alien sky, learning in the process how to actually control it:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/9Ojhrl3.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/aUzEeTi.jpg\u0022 alt=\u0022aUzEeTi.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe fact that an ion-powered glider is actually viable thing on Duna was expected, but still a bit surprising. This aircraft could not operate continuously at full power there (not enough solar panels that far from the Kerbol), but could really take off on its own, though only at above 30 m/s did its wings provide enough lift. For a cruise, a third of full thrust was usually enough, and at that throttle setting solar panels provided more electric charge than engines consumed, at least when the sun was high. Moreover, it could indeed cover large distances at idle power, as a glider.\u003C/p\u003E\u003Cp\u003EBut it had its issues too. An alignment of center of mass and aerodynamic center was addressed during construction but apparently they ended up too close to each other which caused pitch-up tendencies even with two Kerbals on board. Together with high angle of attack required for straight and level flight that easily could cause the stall that was hard to recover from. It was also very hard to drop speed during descent in that thin atmosphere with its small drag. Well, the look on these faces really says it all:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pyG5Hdb.png\u0022 alt=\u0022pyG5Hdb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethough I wonder how Jeb would look if he were there...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* the real reason was, of course, my lack of patience\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E** with stock aerodynamics; FAR transition made lift-off impossible\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*** I\u0027m just assuming they controlled it remotely, as I do not use RemoteTech or any similar mod.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-13T16:38:42Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 8\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBob: Ion engines in atmosphere... It is as ridiculous as it sounds.\u003C/p\u003E\u003Cp\u003EJeb: Oh come one, but they work! And it\u0027s awesome!\u003C/p\u003E\u003Cp\u003EBob: Makes me wonder how powerful those engines are. The shouldn\u0027t be that strong, you know.\u003C/p\u003E\u003Cp\u003EBill: Well, they need electricity for that. Unlike some other engines that actually produce electricity.\u003C/p\u003E\u003Cp\u003EIt is certainly a well-known fact that ion engines require lots of electricity to work. Which can be drawn from solar panels, of course, but father away from Kerbol efficiency of panels decreases, difference being noticeable even between Kerbin and Duna. Kerbol, however, isn\u0027t the only possible power source, and Kerbals have been using several alternatives for a long time. In fact even this ship is using one such alternative, though for different purpose: nuclear power.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/arMgvt5.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/sGR8cCW.jpg\u0022 alt=\u0022sGR8cCW.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENow, LV-N engine is a rather peculiar creation of Kerbalkind: while it does feature the reactor somewhere inside, this reactor is used solely for heating of propellants to provide thrust, while its heat can potentially be used for other things too, like, well, heating something else. Apparently, Kerbal scientists were thinking along this route when they came up with an idea to make a reactor as a separate thing, without an engine around it. Together with another groundbreaking discovery - that of a generator somewhat similar to some stuff used in RTGs - this idea led to a method of generating large amounts of energy without any assistance from the sun.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/hTFwNU7.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/d6mH34n.jpg\u0022 alt=\u0022d6mH34n.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIts drawbacks were large weight and a tendency to output even more heat than actually needed, and that this extra heat could easily melt something, like other equipment or even Kerbals. Some safety systems were designed, to deactivate that other equipment or even the reactor itself, but to operate constantly, this heat was had to be dissipated somewhere - to the atmosphere, for instance. Or, if such silly thing as an atmosphere was not available anywhere close, radiated to vacuum. As a result, shiny blue retractable thingies facing the sun had to be replaced with glowing dark-red retractable thingies facing away from the sun, but that was a small price to pay for almost indefinitely available energy.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Q5UfcxI.png?1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/eY8bvx9.jpg?1\u0022 alt=\u0022eY8bvx9.jpg?1\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut electricity was not the only thing these new reactors were capable of. A feature that made old LV-Ns famous - producing thrust in an efficient manner - was within their capability, too. Only this was done with some help from thermal rocket nozzles that had to be attached directly to the reactor. As an interesting note, this combination did not need any oxidizer to actually work, only liquid fuel.\u003C/p\u003E\u003Cp\u003EA task to test this propulsion method was entrusted to Macdon, Burcan and Dilfen, who used the spacecraft shown above to get to the Mun, and then, with almost identical spacecraft, to Minmus:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ZpbP18u.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/lpmeXAz.jpg\u0022 alt=\u0022lpmeXAz.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...where they tried to land using this transfer stage. This didn\u0027t end all too well:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/jTSABpj.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/MLg2XVR.jpg\u0022 alt=\u0022MLg2XVR.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...but at least nobody was injured, and all three of them returned back to Kerbin with some help from lander\u0027s engine.\u003C/p\u003E\u003Cp\u003EAfter these two missions the KSC researchers managed to enhance both the reactor and the nozzle designs, which resulted in increased efficiency previously possible only with ion engines. But unlike them, this new type of engine provided relatively good thrust. And therefore, it was chosen for the next generation of interplanetary transport vehicle that would bring the Third Laythe Wave to the Jool system.\u003C/p\u003E\u003Cp\u003EBut first, some words should be said about the first wave - it will be covered in the next part.\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-14T12:36:00Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 9\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOn the grass near the runway at KSC a curious installment can be seen, standing there for a few years already:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/EDodm7D.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Z2YGbrT.jpg\u0022 alt=\u0022Z2YGbrT.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPilots approaching this runway often use it as a reference point, especially when returning from orbital flights at night, but its true function is to serve as a memorial to the first venture into the Jool system, and a reminder of some poorly thought-out decisions made back then.\u003C/p\u003E\u003Cp\u003EThis structure is, in fact, a replica of a lander that was a part of the First Laythe Wave. That lander, in turn, is almost an exact copy of the Windtrap lander used by Thompfel and Roddos to land on Duna. The main difference is the lack of RCS thrusters - which is not so terrible thing in itself, as they are really needed for precise maneuvers during docking, and these maneuvers can be performed by a ship one is docking to - but even without RCS ports the assembly taken to Laythe sported three spherical monopropellent tanks. This was the first shortcoming of that mission, but it is negligible compared to the second one: the lander had barely enough Delta-V to achieve an orbit even on Duna, so on Laythe it was really a one way ticket to the surface.\u003C/p\u003E\u003Cp\u003EBut this fact was discovered much later, while then, after several launches to Duna, Jool System was chosen as a next target for exploration, and a mission had been sent with Jeb, Bill and Bob on board:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/0H09ZPp.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Sbwl6ov.jpg\u0022 alt=\u0022Sbwl6ov.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs it had already been known (thanks to spectral analysis) that Laythe\u0027s atmosphere contains oxygen, the main task of that mission was to test the viability of air-breathing engines. And so a rather powerful turbojet plane was constructed, the Jet Alone - it is seen on the previous picture on top of the whole assembly, and on this picture as well:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/pRyWC9o.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/b8QARkW.jpg\u0022 alt=\u0022b8QARkW.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe lander mentioned above was the second part of that interplanetary stack, and the third was a hitchhiker container with docking ports that served as a habitat module during flight, when piloting was not required.\u003C/p\u003E\u003Cp\u003EWhen the piloting was required, it was, of course, Jeb who took up this task - here, for instance, he is performing an aerobraking in Jool\u0027s upper atmosphere:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/FdUEjlD.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/C1t0L6O.jpg\u0022 alt=\u0022C1t0L6O.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJeb managed to achieve an encounter with Laythe after two revolutions around Jool, both times passing through gas giant\u0027s atmosphere (first time for an aerocapture, and second to bleed off some extra speed):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ioEnmEd.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/u4qW9AR.jpg\u0022 alt=\u0022u4qW9AR.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt should be noted though, that interplanetary nuclear engines did not last as long as it was hoped for, so within Jool\u0027s system lander\u0027s aerospikes had to be activated:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/mn4PviG.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/d2JD2vB.jpg\u0022 alt=\u0022d2JD2vB.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter establishing 100 km orbit around Laythe, lander\u0027s tanks were almost empty. But nevertheless, it was time to explore this beautiful moon, and Jeb separated the plane from the lander:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/6OuskB5.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/RRX3pOE.jpg\u0022 alt=\u0022RRX3pOE.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd soon was ready for a deorbiting burn:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/iSetL3h.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/SV1dIVB.jpg\u0022 alt=\u0022SV1dIVB.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-15T13:23:16Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 10\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJeb\u0027s plane, the first aircraft in Laythe\u0027s atmosphere, was not actually a spaceplane; it was an atmospheric aircraft with two turbojet engines, but it had that small deorbiting adapter that was jettisoned just after the burn. Eventually, Jeb descended into the lower atmosphere and activated his main engines, which did indeed work there:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/EQo2YBs.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/uJD2nmk.jpg\u0022 alt=\u0022uJD2nmk.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHe then found a place to land and marked that epic achievement of Kerbal civilization with a flag:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Fv4uu56.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QEiaBdT.jpg\u0022 alt=\u0022QEiaBdT.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd then in no time he headed off to the shore, to check out Laythe\u0027s ocean:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/bfCIQCx.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/1HrzEo5.jpg\u0022 alt=\u00221HrzEo5.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe location Jeb chose for a landing was, however, a rather steep shore, not a perfect spot to land something heavier. So after some discussion with Bill and Bob - who were in task of actually landing something heavier - Jeb took off again, searching for a better landing spot:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Wk3tXH2.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/6RIrz25.jpg\u0022 alt=\u00226RIrz25.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHe soon found one, on a peninsula of another large island. Not equatorial area, alas, but an orbit he previously established was not equatorial either.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/LhINdqR.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/yDE3xOX.jpg\u0022 alt=\u0022yDE3xOX.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile, Bill and Bob detached their lander from the habitat module - which now actually became an orbital station:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/NGqvIJj.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/7DobBBv.jpg\u0022 alt=\u00227DobBBv.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand used almost all their remaining fuel for the precisely calculated deorbiting burn, putting their lander on a trajectory that would lead it to the same peninsula Jeb selected as a place to settle. There, after one small correction and successful landing, the founded the Solaris Base, a first settlement on Laythe:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/5vGWu9P.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/eUI5nTx.jpg\u0022 alt=\u0022eUI5nTx.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...where they would spend a long time, waiting for a second mission to arrive...\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-16T11:20:22Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 11\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/VcSc77L.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/b0i3XEh.jpg\u0022 alt=\u0022b0i3XEh.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile on Carryall station, Hudvey Kerman received an emergency transmission from his colleagues on the surface. He immediately relayed it to KSC, and several minutes later it reached the Pro Pulse 4 SC, still on return trajectory from Jool:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022This is Hudvey Kerman, Carryall station. Roddos and Thompfel have reached northern ice cap and found their target, but report some malfunction with Ornithopter Xenon and are not able to take off. Repeat, Roddos and Thompfel unable to take off.* Hudvey, out.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBill: Oh... Are they okay? Can we contact them?\u003C/p\u003E\u003Cp\u003EBob: They should be. Hudvey would have told otherwise.\u003C/p\u003E\u003Cp\u003EJeb: We can contact them, but the signal delay would be several minutes. And there is nothing we can do to actually help...\u003C/p\u003E\u003Cp\u003EBill: Why were they heading to that ice cap, anyway?\u003C/p\u003E\u003Cp\u003EAs had been mentioned earlier, one unkerballed mission preceded Jeb\u0027s roundtrip to Duna. It was called the Harvester and consisted of a small probe and a small rover, packaged together and sent in one launch:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/4ur20Hv.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/SwxqhsF.jpg\u0022 alt=\u0022SwxqhsF.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBack then, en experience in interplanetary flights was basically nonexistent, so the planners did not bother with orbit adjustments - the task was to get this craft to Duna orbit, no matter which orbit, so it ended up in almost polar orbit. The following picture shows the probe, that would stay on that orbit, separated from the rover:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/XmZ1df2.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/xdwA8cP.jpg\u0022 alt=\u0022xdwA8cP.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...while the rover deorbited using its tiny engines:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ix59Gox.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/w3nn2y0.jpg\u0022 alt=\u0022w3nn2y0.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIts landing scheme featured a drogue chute on that deorbiting stage, to slow it down:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/FOqwBlE.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/WxiDFRz.jpg\u0022 alt=\u0022WxiDFRz.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThen that stage was jettisoned, and main chutes were deployed, two side-mounted ones that were thought to be enough for a small rover like that...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ONawTO9.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QCZ5YMl.jpg\u0022 alt=\u0022QCZ5YMl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...but they weren\u0027t; the landing broke two wheels out of four:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/SPxdaqM.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/6Pfe5jS.jpg\u0022 alt=\u00226Pfe5jS.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhile it could still move, it was extremely slow and required very accurate driving. And this rover was the target that Roddos and Thompfel tried to reach all this time. Which they finally did, and at last, fixed its wheels:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ZFSwGDf.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/H5xoEoI.jpg\u0022 alt=\u0022H5xoEoI.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBill: So... They were tasked to \u003Cem\u003Erescue\u003C/em\u003E that old rover?\u003C/p\u003E\u003Cp\u003EBob: In some sense, yes.\u003C/p\u003E\u003Cp\u003EJeb: And now someone has to rescue \u003Cem\u003Ethem\u003C/em\u003E!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* With FAR, it was no longer possible for this glider to take off.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-17T10:13:36Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 12\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAn experiment with ion propulsion on Duna was an interesting one, but largely impractical. Even if pitch-up problems were fixed, other issues would remain; atmosphere on Duna was simply too thin for such type of aircraft, and with landing speeds like that, it was just not safe. But what would happen with such a glider in a denser atmosphere? This question obviously did cross the minds of Kerbal scientists, and a second edition of ion glider, Ornithopter Xenon II, had been sent to Eve sometime between first and second Laythe waves:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/8sUrh9I.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/JiwpbKl.jpg\u0022 alt=\u0022JiwpbKl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis glider was a bit heavier than its predecessor, with larger xenon storage, but, most importantly, it did not suffer from pitch-up tendencies. It was also the first spaceship of any type to enter Eve\u0027s SOI, and later its atmosphere:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/In220w7.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/FKo8H7L.jpg\u0022 alt=\u0022FKo8H7L.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...which had almost teared it apart during descent. That could indeed happen, as SAS microcorrections caused some kind of positive feedback loop, so SAS had to be deactivated. Several minutes later, when the glider slowed down enough, it became clear that flying in this atmosphere was incredibly easy... and incredibly slow\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/gijm0iv.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/omjti9X.jpg\u0022 alt=\u0022omjti9X.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUnpowered flight with about 1 m/s descent rate has also shown another aspect of Eve\u0027s atmosphere: a stunning beauty it can reveal, especially during sunrise:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/QiNrlMs.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/z5pu9Sq.jpg\u0022 alt=\u0022z5pu9Sq.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESeveral minutes later, the glider finally touched the ground and came to a stop:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/dqHqMZf.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Imn8o1s.jpg\u0022 alt=\u0022Imn8o1s.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt could take off* there but, unlike on Duna, was almost incapable of gaining speed. Flying at about 20 ms/s did not provide any sufficient benefit over wheeled means of transport. But nevertheless, this first venture into Eve\u0027s horrific atmosphere was considered a success.\u003C/p\u003E\u003Cp\u003EAnd a kerballed mission is yet to come...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* But not with FAR installed.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-18T11:48:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 13\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThat \u0022mayday\u0022 message from Duna re-ignited the research of atmospheric flight in atmospheres lacking oxigen. But unlike the first time, new technologies were now available. Propeller-driven rover had been indeed considered an option:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/omjm0ny.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/BdDFLAW.jpg\u0022 alt=\u0022BdDFLAW.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...but stranded Duna researchers needed not a rover but something to reach an orbit, or at least some way to get to the lander near the equator. And so, nuclear power was chosen as a propulsion method. With the development of nuclear reactors and thermal rockets, another option was within the grasp of Kerbal scientists, the thermal turbojet. It was, basically, almost the same thing as a thermal rocket, but used an atmosphere as a propellent, so it was possible to use it even on Duna as long as the reactor lasted (which is about several years). Here is the Nucleon T, the first prototype of a plane with this type of engine:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/n72kd1v.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/JyS8KMG.jpg\u0022 alt=\u0022JyS8KMG.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut flying within an atmosphere is one thing, while reaching an orbit is much harder. Even though the thermal turbojet, after some additional development, became capable of switching to traditional propellents, it was not powerful enough to leave the atmosphere. Therefore, something else was needed in order to send this aircraft to Duna, and SABRE engines came to help:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/IiPjM1V.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/X5k90ZC.jpg\u0022 alt=\u0022X5k90ZC.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis contraption was capable of reaching Kerbin orbit, without even detaching anything. But landing it as it is, with SABRE boosters, was extremely hard even on Kerbin and probably impossible on Duna. And so another SSTO aircraft was constructed, the Duna Scientific Rescue Craft, or DSRC:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/zCxy3hY.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Wb6JyoU.jpg\u0022 alt=\u0022Wb6JyoU.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAt this time, a rescue plan was finally approved. Three planes would land on Duna\u0027s surface somewhere near the equator: two DSRCs and one Nucleon-class craft. The latter would reach the ice cap and pick Thompfel and Roddos. They would then fly it to the landing site where each of them would board his own DSRC and establish an orbit, where they should rendezvous with a transport ship that would bring them back to Kerbin.\u003C/p\u003E\u003Cp\u003EHere is this ship, the Pro Pulse Thermal, just before the circularization burn:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/lsUlyLU.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/0HthkiM.jpg\u0022 alt=\u00220HthkiM.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is the same design that was chosen for the Third Laythe Wave, with a thermal rocket and a large storage of liquid fuel, but without any oxidizer. Below it is seen on its way to Duna, with \u0022port extenders\u0022 deployed and all planes attached (note two Nucleon-class planes, for symmetry and as a backup):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/awosrfX.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/tnUvxAP.jpg\u0022 alt=\u0022tnUvxAP.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-19T09:59:41Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 14\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith Duna rescue mission en route, KSC started to put together a third venture to the Jool system. First concern was to provide some better way of evacuation, should the need arise. The colony on Laythe actually does have some means of getting the crew from surface to the orbit - the Jet Elevator and the Solaris Shuttle, currently docked to the station:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/guqhsXh.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Wj2z0XS.jpg\u0022 alt=\u0022Wj2z0XS.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut these are inefficient and the spaceplane has some controlling issues, so it was decided to send another two spaceplanes; this is the final version of Psi Shuttle, a pinnacle of yesterday\u0027s technologies:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/SpXC8r2.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/mZenLN1.jpg\u0022 alt=\u0022mZenLN1.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt is rather old design, almost deprecated, some say, and surpassed by the two-seat SABRE-employing Wasp in terms of fuel efficiency, but it is better suited for rough terrain landings and has a docking port aligned with its center of mass and center of thrust. The latter feature was not needed this time though, as two aircraft - controlled by Hansen Kerman and Jerfrey Kerman - were attached symmetrically to the transport ship:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/OWtIzFz.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/9XIK3aJ.jpg\u0022 alt=\u00229XIK3aJ.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe assembly on top is a laboratory, where Hansen and Jerfrey will try to commence some research. The first structure like that was tested on Kerbin earlier:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/L8SCiLA.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/dyZ2DVE.jpg\u0022 alt=\u0022dyZ2DVE.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut the home planet was already studied rather thoroughly and for groundbreaking discoveries Kerbals had to research something new - like maybe a moon of Jool almost entirely covered by oceans...\u003C/p\u003E\u003Cp\u003ENote that laboratory for Laythe has wheels: it is supposed to be mobile to some extent. But it also requires a generator to power it; while in space, it will use the ship\u0027s generator, but to power it on the surface, another nuclear-powered generator would arrive separately, and would be mobile, too:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/0K961Yn.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/bBhg7ue.jpg\u0022 alt=\u0022bBhg7ue.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn fact, two ships like that had been assembled. There are also two rovers on the picture above, as this whole laboratory-generator setup was planned to operate on different island than current Solaris Base is.\u003C/p\u003E\u003Cp\u003ETo transfer Kerbals between these two islands, several options have been considered. The piston engine-powered propeller aircraft, like the one below,\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/fMnnSVV.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/PDuQENN.jpg\u0022 alt=\u0022PDuQENN.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ewere, unfortunately, rejected, as they provide no real benefit over jets other than looking cool. Now, the \u003Cem\u003Enuclear\u003C/em\u003E-powered propeller aircraft,\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/WeADz00.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/URbB5h6.jpg\u0022 alt=\u0022URbB5h6.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ewhile still looking cool, could operate for years without refueling, but, alas, due to some hardware incompatibility with electric propellers (only fixed later) were rejected too. So the final choice was the nuclear-powered turbojet, not unlike those sent to Duna, but smaller:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/HASt7Sn.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/cYcgJlQ.jpg\u0022 alt=\u0022cYcgJlQ.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt was named Nucleon EZ T, and combined longevity and speed (able to reach supersonic speeds on Kerbin); two of them were delivered to LKO (with the same system of SABRE boosters).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/cxqvJ7c.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/IueCyzn.jpg\u0022 alt=\u0022IueCyzn.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe plane attached to the front of the transport ship on the picture above is the Diamond, a relatively fuel-efficient subsonic jet with two-seat cockpit, a more conventional option in case if something goes wrong with nuclear reactors. Between the Diamond and a transport ship, a lander can be seen: it is designed to land on Vall, collect scientific data and get back to Kerbin; this task was entrusted to Jerfal, who would, probably, visit Laythe too, but won\u0027t stay there for long.\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-20T13:57:19Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 15\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/La5IW1n.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2WuhaVT.jpg\u0022 alt=\u00222WuhaVT.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe rescue ship with four planes was not the only mission during that launch window. Another one has been sent, with Burcan Kerman on board. This is his ship performing an engine-assisted aerocapture:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/yLaJodr.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/rYl2XM6.jpg\u0022 alt=\u0022rYl2XM6.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPart of Burcan\u0027s assignment was to supervise that rescue operation until control could be passed over to Carryall station. But his main target was Ike:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/xgEaGBe.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/MhSDVWl.jpg\u0022 alt=\u0022MhSDVWl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDuna\u0027s only satellite did not attract KSC\u0027s attention yet, but now it was a time to remedy that. Below is Burcan\u0027s lander burning retrograde, while interplanetary part of his hip remained in orbit:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/rWzxRDI.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/GK2bBFn.jpg\u0022 alt=\u0022GK2bBFn.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHis lander sported all current scientific equipment, including the magnetometer, so that Burcan could collect all important data and samples and so on, but he still had a feeling that something was missing...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ZMDOCQA.png?1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/qcZLO4A.jpg?2\u0022 alt=\u0022qcZLO4A.jpg?2\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat missing part was a ladder. Of course, not a problem on a small moon like Ike, especially for such an experienced fellow as Burcan (who had already visited both Mun and Minmus) but still, KSC ship designers should follow their checklists with more attention...\u003C/p\u003E\u003Cp\u003ESome time later, Burcan re-docked with the interplanetary part, leaving lander\u0027s engine and a fuel tank in orbit:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/9aXggQU.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/SEpL58P.jpg\u0022 alt=\u0022SEpL58P.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd then headed back home:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/qlXeAiT.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/CmB9pCX.jpg\u0022 alt=\u0022CmB9pCX.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-21T20:19:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 16\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Vcc2rUd.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/XpJKUYs.jpg\u0022 alt=\u0022XpJKUYs.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile on Duna, it was raining spaceplanes. Two DSRC (Duna Scientific Rescue Craft), one of which is shown above, deorbited one after another and landed in equatorial lowlands, where air density was barely enough to slow them down during landing (but landing speed still was dangerously high).\u003C/p\u003E\u003Cp\u003EThen a Nucleon TD1 entered atmosphere (using its own turbojet in liquid fuel mode and external fuel tank):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/gbsdPzo.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/cvNwCw4.jpg\u0022 alt=\u0022cvNwCw4.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt landed too, but on more elevated ground, as it was not as heavy as twin-engine DSRC:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ohqQbfQ.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/d7TDli3.jpg\u0022 alt=\u0022d7TDli3.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd its landing speed was noticeably lower, which was really important, since the ice cap is rather high above the \u0022sea level\u0022.\u003C/p\u003E\u003Cp\u003EAfter this landing test, it immediately took off and headed north:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/2HPKOaM.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/U8i6s4o.jpg\u0022 alt=\u0022U8i6s4o.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEventually it reached a pole, which happened to be a scary place where the ground slips from under the wings (the picture does not show the rotation of the planet, which was easily visible from above):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/XrUYiHl.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/F98ga9o.jpg\u0022 alt=\u0022F98ga9o.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENot too far from there, our stranded Duna explorers were waiting:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/mJjDlcL.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/EIZdziU.jpg\u0022 alt=\u0022EIZdziU.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter long and uneventful flight back to the equator they finally reached the place where spaceplanes were parked. There they spent the rest of the night, fiddling with scientific equipment (because taking off in the dark was considered too dangerous):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/2pAHvEv.png?1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/KqJzTnf.jpg?1\u0022 alt=\u0022KqJzTnf.jpg?1\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThey took off in the morning, again one after another:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/hDr2vaN.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/pZfRTJz.jpg\u0022 alt=\u0022pZfRTJz.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOf course, the SABRE engines were in closed-cycle mode, but each plane had a rather large fuel storage, and Duna\u0027s gravity and atmosphere are not as hard to escape as those on Kerbin, and soon our heroes performed a docking to the interplanetary transport ship, that would - finally - take them home:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/QnJp3fI.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QPZpiAO.jpg\u0022 alt=\u0022QPZpiAO.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-22T20:09:07Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 17\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/shwmmZl.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/mZiNNQ1.jpg\u0022 alt=\u0022mZiNNQ1.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGetting back from Jool is a lengthy business, and Pro Pulse 4 SC was still on return trajectory when Roddos and Thompfel were picked up by the rescue mission. In fact, that rescue mission, and Burcan\u0027s Ike ship, both got back to Kerbin while Jeb, Bill and Bob were still en route.\u003C/p\u003E\u003Cp\u003EBurcan was first to arrive:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/cDrgOtU.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/oQo8sPZ.jpg\u0022 alt=\u0022oQo8sPZ.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBelow his ship is about to enter the atmosphere:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/YbNbrKl.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/BrOAX4o.jpg\u0022 alt=\u0022BrOAX4o.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBecause lander\u0027s engine with fuel and RCS tanks had been jettisoned earlier, it could not deorbit on its own. Therefore, two options were considered: aerocapture with subsequent orbit, and then a return ship could be sent from Kerbin to pick up the lander; and direct descent, where the whole ship would enter atmosphere and then detach the interplanetary stage, which would then be destroyed.\u003C/p\u003E\u003Cp\u003EBy this time, an interplanetary stage was already obsolete. It could be retrofitted, of course, but since KSC now commanded virtually unlimited resources, it was easy for them to assemble and launch another one. And so, a second option was chosen.\u003C/p\u003E\u003Cp\u003EBut as a twist of fate, Burcan separated that stage when he was about one kilometer from the ground, moving at terminal velocity, and most of that stage survived an impact and was recovered. Burcan himself, of course, landed on parachutes:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/PYYRbVB.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/eCJkhXR.jpg\u0022 alt=\u0022eCJkhXR.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERoddos and Thompfel reached Kerbin several hours later. This time, an interplanetary stage was left in orbit, because each of them had a spaceplane that could be used to deorbit, reenter atmosphere...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ZKpOUEP.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/JGmSFLP.jpg\u0022 alt=\u0022JGmSFLP.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/hkNBCSL.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/1iyJlOZ.jpg\u0022 alt=\u00221iyJlOZ.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...and land at KSC:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/SFpNZ3l.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/JLhTwfm.jpg\u0022 alt=\u0022JLhTwfm.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/fbVaG9D.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/bOM0P49.jpg\u0022 alt=\u0022bOM0P49.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOverall, this whole affair was a major success: scientific data from Duna and Ike was invaluable and resulted in yet another breakthrough of Kerbal science. But more important, two brave explorers were finally home after the journey to Duna, longest one in Kerbal history.\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-23T17:52:41Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 18\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/1lY7j10.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/62YyJXq.jpg\u0022 alt=\u002262YyJXq.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBill: Glad they\u0027re back.\u003C/p\u003E\u003Cp\u003EJeb: And we will meet them soon!\u003C/p\u003E\u003Cp\u003EBill: And all these research! They say these first experiments ever conducted on Duna.\u003C/p\u003E\u003Cp\u003EBob: So I\u0027ve been wondering... transmitting instrument readings yields less results than measured. Don\u0027t you think it\u0027s strange? Is there a data loss or something?\u003C/p\u003E\u003Cp\u003EBill: Well, it\u0027s always better to have a sample itself than some readings.\u003C/p\u003E\u003Cp\u003EBob: Yes, it makes sense with surface samples and such. But measured gravity or temperature? Can\u0027t we just digitize it and send back via reliable connection?\u003C/p\u003E\u003Cp\u003EBill: I heard it is possible sometimes with reports...\u003C/p\u003E\u003Cp\u003EJeb: Guys, I have an idea! Let\u0027s land this ship! That way we won\u0027t lose any data!\u003C/p\u003E\u003Cp\u003EBob: Uh, Jeb... It is an interplanetary transport. It\u0027s not designed to land.\u003C/p\u003E\u003Cp\u003EBill: Yeah, engine thrust is not enough to...\u003C/p\u003E\u003Cp\u003EJeb: I know, I know, but we have four docking ports, let\u0027s strap some chutes to them and that\u0027s it!\u003C/p\u003E\u003Cp\u003EBob: And where do we get those chutes? We have none on board.\u003C/p\u003E\u003Cp\u003EJeb: We just ask KSC guys and they\u0027ll send us some. With docking ports, and maybe a tripe adapter...\u003C/p\u003E\u003Cp\u003EBob: I doubt it. They won\u0027t agree.\u003C/p\u003E\u003Cp\u003EBill: Look, they are uploading some details on our return. There\u0027s that spaceplane...\u003C/p\u003E\u003Cp\u003EBy this time, Jeb Bill and Bob were only one week away from Kerbin, and KSC have indeed came up with a plan to get them to the ground. A spaceplane was constructed - not only for that purpose, but for possible use on Laythe also - but it was its first actual use after some test flights to low Kerbin orbit and back:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/yFJEMh2.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/0CEpNmK.jpg\u0022 alt=\u00220CEpNmK.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt was named Delta Shuttle, and this time, unlike those test flights, it ventured a bit further, to the Nexus II station at 200 km orbit:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/5cINwoQ.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/gMWFuh3.jpg\u0022 alt=\u0022gMWFuh3.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Pro Pulse would than dock this station too, and there it would stay until its further fate is decided, while Jeb, Bill and Bob would use the shuttle to get back to KSC.\u003C/p\u003E\u003Cp\u003EBut KSC\u0027s activity was not limited to that shuttle launch. A rather late observation surfaced during this period: laboratory sent earlier to Laythe was not capable of resource-mining, and, even though Jool launch window has long passed, a transport ship had been sent, on obviously suboptimal trajectory, with mobile refinery and two mobile generators as a payload:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Vvm2BNy.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/KzurImF.jpg\u0022 alt=\u0022KzurImF.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThen a first mission to Moho was prepared and assembled in orbit in three launches - here is the whole assembly on escape trajectory from Kerbin:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/fAHhYHr.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/itIHboL.jpg\u0022 alt=\u0022itIHboL.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAt the same time, KSC directed its attention to less distant places, as there was still something to explore on Mun and Minmus. Roory Kerman performed a test of the Mun Cruiser, new research rover for low-gravity environments. Its launch vehicle happened to be an overkill (it was, after all, designed for much heavier payload),\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/KhyUDJP.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/UFgrk7H.jpg\u0022 alt=\u0022UFgrk7H.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eso more of that rocket reached the Mun then was really needed, but that could not thwart Roory\u0027s mission to explore southern crater:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/oGc8You.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/FXtPhxI.jpg\u0022 alt=\u0022FXtPhxI.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENot only did this rover have all scientific equipment, but also a set of engines and fuel tanks - that were barely enough to get back to Kerbin, but Roory managed to do it:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/1y8yH58.png?1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/6DqDPUV.jpg?1\u0022 alt=\u00226DqDPUV.jpg?1\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2013-12-24T13:47:25Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 19\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/KvpJcGL.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/VIDPBoC.jpg\u0022 alt=\u0022VIDPBoC.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHome, sweet home. A blue dot in the window: when they\u0027ve spotted it, all this journey - thundering roar of engines shooting them off into the night sky, terrifying size of the green gas giant, settlement on sandy shores with alien waters lit by distant sun, arrival of successors who would take care of what they started, mindnumbingly long return - everything suddenly seemed like it was a moment ago, or maybe just yesterday. Now that little dot filled their thoughts - and the windows as well, growing larger and larger.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/n6w3NA2.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/H5vawIT.jpg\u0022 alt=\u0022H5vawIT.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAn aerocapture: the standard procedure, done many times both live and over remote controls. Felt different this time, though: almost home, but not there yet:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ErHjUsM.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Rg559DY.jpg\u0022 alt=\u0022Rg559DY.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe station had been waiting for them, and they had to wait also, performing all necessary correction with perfect precision, without even thinking.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/PmHuCQx.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/LaMlMde.jpg\u0022 alt=\u0022LaMlMde.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOne last burn to synchronize orbits. The sun hid away behind Kerbin again: something not seen very often in interplanetary space. Docking, with only one moon in the sky - the Mun, no less, not just some alien celestial body.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/agERn8f.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/t2N7v9w.jpg\u0022 alt=\u0022t2N7v9w.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlmost there: transmitting crew reports, transferring to the shuttle, updating descent profile, waiting for proper alignment to deorbit.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/12I4Ath.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/VXLGeQ6.jpg\u0022 alt=\u0022VXLGeQ6.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn atmosphere again, but this time to stay - shooting through the dark-blue sky lit by rising sun - not so distant anymore:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/C6oHNVN.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/wLOmcc6.jpg\u0022 alt=\u0022wLOmcc6.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt was around noon at KSC when they saw the first glance of the runway. Now only a few minutes away...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/yQxrBzs.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/LUjh4Pp.jpg\u0022 alt=\u0022LUjh4Pp.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDescent; lowering landing gear; touchdown; breaks. And finally on the ground:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/XRRUvN7.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/t7oU1wD.jpg\u0022 alt=\u0022t7oU1wD.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHome, sweet home...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EAt this point, the story caught up with my actual game progress (there are some extra pieces, but they don\u0027t really fit anyway).\u003C/p\u003E\u003Cp\u003EIt means that I have to play the next parts through and then write summaries, which will take time.\u003C/p\u003E\u003Cp\u003EOr just skip the writing part, unless anyone is interested in reading these summaries.\u003C/p\u003E\n"}]}