{"TopicId":56384,"ForumId":51,"TopicTitle":"Aurora II(a) SSTO: A New ComSat Network (Image Heavy)","CreatedByName":"Blu_C","CreatedById":39941,"CreatedDateTime":"2013-12-16T18:48:45Z","PageNum":1,"Articles":[{"CreatedByName":"Blu_C","CreatedById":39941,"CreatedDateTime":"2013-12-16T18:48:45Z","Content":"\n\u003Cp\u003EKept a lot of notes about this particular mission, so if you want the TL;DR here is an album \u003Ca href=\u0022http://imgur.com/a/nyrca#0\u0022 rel=\u0022external nofollow\u0022\u003E(LINK)\u003C/a\u003E that keeps it to the highlights.\u003C/p\u003E\u003Cp\u003ERecently, thanks to a several missions, most notably its first mission to leave the sphere of Kerbin and a couple probes landed on the Mun (in addition to Jeb landing on Minimus) enough research was done that it was determined a space plane that was worthwhile could be developed. A bevy of research craft were made starting with the X-1 that was developed as an atmospheric research craft and learn how aerodynamic forces interacted with a craft at different altitudes and airspeeds. The X-2 was a simple single seat space plane capable of sub-orbital hops, allowing research into how reentry forces would impact an air frame. Finally the X-3, a project with many difficulties that had to be overcome, endeavored to create the KSC\u0027s first official SSTO space plane.\u003C/p\u003E\u003Cp\u003EChristened the Aurora, this new SSTO had a very modest cargo bay and was the first Aerospace craft to successfully launch a satellite into orbit and land at the KSC again. It so out-shined expectations that it was sent back to the design team to have it\u0027s cargo capacity increased substantially. Once the re-design was completed the result would be the most complex craft ever deployed by the Kerbal Space Program.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/swSIOaE.png\u0022 alt=\u0022swSIOaE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBehold the Aurora II(a), seen here in it\u0027s take-off configuration. Eager to prove the capabilities of the new craft the scientists de-orbited the old KS1 model communication satellites and tasked their new SSTO to deliver a payload of the newer KS2\u0027s to replace the old, obsolete model. A total of five satellites were stowed in the cargo bay and the lengthy process of preparing the craft for take-off was began.\u003C/p\u003E\u003Cp\u003EThe Aurora II actually has a problem in that it\u0027s fuel capacity for the jet engines is actually too large. Only 50 units of fuel are needed for each engine to reach orbit (and have some left over for landing), but the tanks for them hold over 300 units each! As such the extra fuel was taken out. Afterwards the main tanks in the body were set to balance their fuel loads, both to maintain a favorable center of gravity and to make sure the rocket engines didn\u0027t run dry. This is a hugely important step, during early tests Jeb once forgot to set the the fuel load to balance. It was a very embarrassing walk back to the KSC, and Bob still hasn\u0027t let up about it. Also the probes themselves had all their monoprop. drained form the tank and were sent up empty to be filled from the Aurora II\u0027s own tank once orbit was achieved. This was both to keep the CG properly forward and to reduce mass. The Aurora II\u0027s own Monoprop tank was about 20 units short, again to save weight and ensure there was enough fuel, given the size of the payload.\u003C/p\u003E\u003Cp\u003EWith the craft prepared Bill and Bob drew straws to see who would have to go up with Jeb. Bob won, much to Bill\u0027s displeasure. Flaps were deployed to 15 degrees, the jet engines were switched, and the Aurora II began to roar down the runway.\u003C/p\u003E\u003Cp\u003ERotation speed for the Aurora II in this configuration is ~125m/s and takes roughly 2/3 of the runway. You have to be really careful while close to the ground not to break the rocket engines since they stick out so far in back. Once you\u0027re airborne, however, just retract the gear, pitch up to 35 degrees, and retract the flaps. Even so heavily loaded the jet engines are powerful enough to reach roughly 100m/s climb in short order. This attitude is held until about 14km up, where the nose is lowered in order to give the craft time to pick up speed. These particular engines will function quite high, able to continue burning as high as 22km easily. Over 18km the throttle is gradually trimmed back to be safe and avoid an asymmetrical burnout, but with the air being so thin the Aurora will continue to gain speed with as little as 1/3 throttle. Eventually, though, the jet engines just won\u0027t cut it any more...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/I710LN1.png\u0022 alt=\u0022I710LN1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is Jeb\u0027s favorite part! Time to punch it and nose up to 35 degrees again. The fuel budget is really tight for this mission so the RemoteTech 2 flight computer is used to allow fine control over the attitude and make for the most efficient burn possible. The flight computer is actually used quite a bit from here on out, though the exact parameters are picked out by the pilot. Generally speaking the nose is held up at 35 degrees until the time to apoapsis reaches 50-60s, which happens much faster than you would think. Even though they haven\u0027t yet broken 30km Jeb is getting ready to lower the nose.\u003C/p\u003E\u003Cp\u003EThe biggest danger during this phase is lowering it too much. Even though the atmosphere is really thin up this high it does cause you to lose energy so too shallow of an assent will waste fuel as you fly through all that air. On the flip side if you are too steep you are wasting fuel fighting gravity rather than letting the wings do the lifting. It took about a half dozen flights to begin to learn the optimal angle during the early tests for the Aurora II, and it can change significantly depending on the payload.\u003C/p\u003E\u003Cp\u003EOne thing that has been suggested by the scientists, but not tried yet, is climbing up to ~20km on the jet engines, then beginning to dive to pick up more airspeed while still running the engines before skipping back up again. If this worked it would mean more speed could be gained using the efficient jet engines, allowing larger payloads still to reach orbit. Obviously this would require taking more liquid fuel along, possibly making those large wing tanks prove their worth. This was not done here, however, because testing is still needed and there were concerns that the heat would get too high resulting in air frame damage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8NsE1IA.png\u0022 alt=\u00228NsE1IA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce above 50km the atmosphere has thinned sufficiently to enter the orbital configuration, which is a fancy way of saying the Aurora II is rolled onto its back. The throttle is cut for this maneuver to save fuel, but that is fine as the current apoapsis is 74km and the Aurora II is only taking this initial burn to 80km. The reason this is so important is that the only two solar panels the Aurora II has are on the bottom and power is necessary to run its life support systems. Even with it\u0027s sizable battery power will not last for the duration of the mission so keeping those panels pointed toward the sun is critical. As a bonus this roll gives Jeb and Bill a great view of the planet below (though Bill doesn\u0027t seem to appreciate it).\u003C/p\u003E\u003Cp\u003EInitially placing the satellites into a higher 100km orbit was considered, and is possible with the Aurora II\u0027s fuel reserves, but it cuts things very close and so the lower altitude was decided on to provide a safety margin. One important consideration was that at such a low altitude and with only 5 satellites making up the network they actually won\u0027t have line-of-sight to each other. A sixth satellite was considered and it may be possible to deploy 6 in a single mission, but again things were decided on the side of caution. Luckily these satellites don\u0027t need to communicate with each other, only to the GeoStationary ones above, relaying communications to and from the far side of Kerbin. So in this case 5 satellites will work fine, even though normally 6 is the ideal.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fl79Kxk.png\u0022 alt=\u0022fl79Kxk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce reaching the target 80km Jeb fires up the rockets for the insertion burn. That maneuver node you see is just there to mark where the burn would be taking place and how much delta-V was required to circularize. We aren\u0027t actually paying attention to it though, burning straight prograde into an eccentric orbit. While we want the 5 satellites in a ~80km orbit what we really want is for them to have an orbital period equal to that of an 80km perfectly circular orbit (31m15s) so that they remain roughly equidistant from each other. Some \u0027wobble\u0027 is fine as long as they don\u0027t drift out of position.\u003C/p\u003E\u003Cp\u003ETo that end what we are doing is burning for an orbital period of 37m30s at which point we will deploy one satellite every orbit for 5 orbits. The satellites will then circularize under their own power using RCS. Beyond the orbital period we don\u0027t actually care what our final apoapsis ends up being, so long as the periapsis is somewhere around 80km. Most of the burn is done with the main rocket engines, however fine tuning is done with the Aurora II\u0027s own RCS thrusters to ensure the orbital period is exactly 37m30s. Once this is complete final checks are done, making sure everything is in order. All remaining RCS is pumped into the satellites, giving them just over 20 units each, and the Aurora is positioned so that when the satillites are released they\u0027ll drift away in the direction I want. In this case they are released toward Kirbin. Having them drift pro or retrograde is just asking for them to collide with the Aurora II when the circularize, and as it was there were several that came within meters of striking the Aurora II.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/H2M37nj.png\u0022 alt=\u0022H2M37nj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese are really basic satellites; they don\u0027t need to do much. Single RCS tank, 2 RCS thrusters, antena, OKTO2 probe body, battery, and 2 solar panels, and an attachment port for KAS in case I decide they need to be refueled in the future. They are each secured in the cargo bay Clamp-o-Tron Jr.\u0027s and released using action groups (1 group for every satellite). Technically I could have used decouples or seperators, but I felt that Clamp-O-Trons felt more in the spirit of a fully reusable craft. Also there is the risk of the ejection force altering the orbits or leaving unnecessary junk. With the Clamp-O-Trons things just nicely drift apart when the magnetic clamps are disengaged. Simple and elegant.\u003C/p\u003E\u003Cp\u003EEach satellite was released well in advance of it\u0027s burn so that they would have ample time to drift away from the Aurora II. The OKTO2 probe has a 3km antenna integrated into it so the satellites could be deployed with their antenna retracted. All I had to do was activate the Aurora II\u0027s own antenna (cleverly hidden inside along with a probe body and the main battery) so it could relay commands. Between the Action Groups for controlling the Aurora II and those for controlling the satellites I had to really think about how to properly organize everything and even so I ended up using the abort button to toggle the RCS thrusts on and off for the cargo (to keep them from firing inside the bay and \u0027ruining\u0027 the satellites).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iqaJ8os.png\u0022 alt=\u0022iqaJ8os.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce the probes reached the Periapsis they activated their RCS system and burned retrograde to circularize. I quickly found that burning a little early, and a little high would help make a more circular orbit - though again the critical thing here is not how circular but rather the Orbital Period. We are aiming for 31m15s, and so long as the Periapsis stays above 70km I\u0027ll be happy.\u003C/p\u003E\u003Cp\u003EOne thing that worried me was that the RCS thrusters would take forever to get the velocity change, but it turns out that these probes are so light even 2 thrusters have a lot of pep. Another concern was that 20 units of RCS fuel wouldn\u0027t be enough to circularize. In fact it is plenty. Half as much could have been taken and there still would have been some left over. Oh well, that means they have a nice reserve, so refueling won\u0027t be necessary for some time. Once the orbit was established the name was changed from Aurora II probe to ComSat KS-2-A, which is a pretty boring name but Bill picked it out. At least it has the advantage of identifying what model the satellite is, what it is for, and which individual one it is. Now just to do this for the four more times for B through E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xPv6ddZ.png\u0022 alt=\u0022xPv6ddZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt only took ~3 hours of mission time to deploy all the satellites into their orbits but the mission had to be significantly longer in order to wait for the KSC to be in position to attempt a landing. It isn\u0027t too critical in this case because plenty of fuel and oxidizer was left over, but it is good practice. In the past the orbit was always brought down right to the surface, but the heating can get pretty intense even with the wings slowing the descent. Coming from such a high altitude Jeb was concerned that the steeper angle would prove to be too much and so chose to set the periapsis at only 10km. Of course he could have circularized down first, but who wants to wait ANOTHER orbit?\u003C/p\u003E\u003Cp\u003EAfter the deorbit burn the rear most tanks were drained into the front one, which was set to balance its liquid fuel load with the wing tanks. The Oxidizer could have been dumped but was kept as ballast, keeping the center of gravity forward of the center of lift. The ballast probably wasn\u0027t necessary but at the very least fuel that is returned can be used for future missions.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zdvOtQ2.png\u0022 alt=\u0022zdvOtQ2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere the RemoteTech 2 flight computer is used again, this time to hold the nose at 20 degrees. The high attitude will help give a higher angle of attack. Higher AoA = More lift = Slower descent. In the past a 10 degree up was always used, however nothing this steep had been attempted. The plan was to dip into the atmosphere and then skip up slightly with the wings, while using flaps and air breaks to slow down. Even with this precaution, and the higher periapsis than usual, things got pretty hot - about 100 degrees more than any of the test flights - but it was still well within safety parameters and neither precaution was probably necessary. The skip also kicked the Aurora II much higher than expected, ultimately getting up to something like 40km again (up from ~30).\u003C/p\u003E\u003Cp\u003EIn order to counteract this full air breaks and full 45 degrees of flaps were applied. The nose was also lowered to reduce the angle of attack (though not below the horizon, as Jeb has learned that only tempts the reentry gods). Normally flaps generate additional lift, but they also increase drag and above 20 or 30 degrees they increase drag much more than any additional lift, so surely It was then that he realized that 40km up there isn\u0027t much air for the flaps or air breaks to catch. While they did start noticeably slowing the Aurora II it quickly became apparent that it wasn\u0027t anywhere near enough. Well, it is a Kerbal mission, so you know what time it is now.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EpIbbIZ.png\u0022 alt=\u0022EpIbbIZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESNAFU! Unfortunately by the time the problem was noticed it was too late to use the trick of making turns to bleed off airspeed, so much to Bill\u0027s dismay they sailed over KSC going just over Mach 5 at 34km above sea level. You can see in the picture that Bill is just resigned to his fate, knowing that at best he will be walking home and at worst he\u0027ll be SWIMMING. It was at about this time that the scientists back home realized that if they had dumped the Oxidizer the lighter craft may have been slowed by the air more. Oh well, something to keep in mind for next time.\u003C/p\u003E\u003Cp\u003EJeb is made of the right stuff, hoewver, and looking down at the KSC in glee as he comes up with a plan.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/St5dOfu.png\u0022 alt=\u0022St5dOfu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce the altitude had dropped far enough he pulled the Aurora II into a turn and reactivated the jet engines to keep from stalling. The hardest part of the maneuver is actually figuring out where to point the nose to get roughly headed back to the runway. Having overshot so much (by the time the turn was made Jeb and Bill were quite far over the ocean) there really weren\u0027t any references to fly by. Thankfully it turns out that Jeb is really good at dead reckoning and was able to more or less line up with the runway from that far out. Once they were able to see the airstrip only minor tweeks were necessary.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7Dkk4EA.png\u0022 alt=\u00227Dkk4EA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe awesome glide ratio of the Aurora II really came into play for the last bit, letting it fly quite slow now that it was so light. Even having overshot by so much, pulled a turn, and only carrying the most minimal power for the flight back the Aurora II came in very high. Ample use of airbreaks and full flaps, plus a lowered nose were more than enough to correct that issue this time, and the landing was almost perfect. All that was left was to activate the wheel motors and taxi back to the hangar. Bill claims he never doubted for a moment that Jeb would figure something out. Who knows, he may even be telling the truth.\u003C/p\u003E\u003Cp\u003EWhy are you telling them to put something else in the cargo bay so we can do that again? Just let me undo my seat belt so I can esca -- err... -- switch out with Bob.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lH2Wkmy.png\u0022 alt=\u0022lH2Wkmy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the end result of the mission. There is an extra satellite in there, which is a Moho probe waiting for it\u0027s transfer window. Those links you see going toward the bottom of the image are targeting a relay station I have on the surface of the Mun, acting as the lynch pin for a network giving intermittent coverage of the whole Munar surface in preparation for a massive scientific survey.\u003C/p\u003E\u003Cp\u003EList of mods used: FAR, Deadly Reentry v4, RemoteTech 2, TAC Fuel Balancer, TAC Life Support, Kerbal Alarm Clock, B9 Aerospace, Precise Node, Enhanced Nav Ball, Kerbal Attachment System (for the probes only), Kerbal Engineer Redux, KW Rocketry, Texture Reduction Packs (Squad, KW, and B9).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T18:50:33Z\u0022 title=\u002212/16/2013 06:50  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by Blu_C\u003C/strong\u003E\n\u003Cbr\u003Eminor edits\n\u003C/span\u003E\n"}]}