{"TopicId":56780,"ForumId":51,"TopicTitle":"Went to Duna and back!","CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-12-19T01:12:01Z","PageNum":1,"Articles":[{"CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-12-19T01:12:01Z","Content":"\n\u003Cp\u003EThis might not be so exciting to people who go to Jool and back without breaking a sweat, but I actually sent a Lander to Duna and then I rendezvoused with an orbiting fuel station and returned to Kerbin! This is my first successful interplanetary lander that I actually returned to Kerbin, and I just thought I\u0027d let you guys know what I\u0027ve been up to.\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2013-12-19T01:17:42Z","Content":"\n\u003Cp\u003EAwesome! It feels great to bring live Kerbals home from interplanetary space.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-19T01:20:21Z","Content":"\n\u003Cp\u003ECongratulations! And I haven\u0027t been to Jool myself, either!\u003C/p\u003E\n"},{"CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-12-19T01:22:46Z","Content":"\n\u003Cp\u003EThanks! And be sure to visit Jool sometime! That planet has all sorts of things you can explore.\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-12-19T01:23:07Z","Content":"\n\u003Cp\u003EI remember how I felt when I first did that...much happiness was to be had.\u003C/p\u003E\u003Cp\u003ECongrats!\u003C/p\u003E\n"},{"CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-12-19T01:23:39Z","Content":"\n\u003Cp\u003EThanks man. I have yet to do it again, maybe on another planet.\u003C/p\u003E\n"},{"CreatedByName":"Leatherneck","CreatedById":77501,"CreatedDateTime":"2013-12-19T01:33:05Z","Content":"\n\u003Cp\u003EGreat job! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI only just got my first rover onto Duna about an hour ago, which you\u0027d think I\u0027d have accomplished sooner with 176 hours put into KSP. Partly out of procrastination, partly to master the Mun/Minmus and Docking, and partly because I thought it was going to be far more daunting. Fortunately, it was not nearly as bad as I thought it would be. I may have experienced rapid vehicle dis-assembly with the sky crane in the process, but I got the rover on the surface long enough to transmit some science. Too bad I forgot a solar panel...\u003C/p\u003E\u003Cp\u003EHowever, I did get a good spot with the rover to land on, so I think a manned mission is the next step. I agree that it is really even more rewarding though when you make a manned round trip.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2013-12-19T02:05:23Z","Content":"\n\u003Cp\u003EIn many ways Duna is nicer than the joolian moons. The red atmposphere is so beautiful and there\u0027s quite a variety of places to land and check out. The margin between the regular surface and the icecap is one of the nicest places. It doesn\u0027t change colour suddenly, it blends through all sorts of pinks before finally going white.\u003C/p\u003E\n"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2013-12-19T02:25:44Z","Content":"\n\u003Cp\u003EI still get the chills whenever I home in to planet other than Kerbin... I never get tired of that, whether it is Moho or Eeloo or anything in between.\u003C/p\u003E\n"},{"CreatedByName":"panfish5","CreatedById":74937,"CreatedDateTime":"2013-12-19T02:53:40Z","Content":"\n\u003Cp\u003EI have only done one interplanetary return mission on ike. I completely over engineered on everything and when I got back to Kerbin I only used 3/4 of my tank.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6JhqR5J.png\u0022 alt=\u00226JhqR5J.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI plan on doing a return mission from a joolian moon or grand tour of all the moons but haven\u0027t done anything yet. (Ikes creepy man once I sent a one way mission there and 2 of the three kerbals died due to accidents...)\u003C/p\u003E\n"},{"CreatedByName":"CoriW","CreatedById":57866,"CreatedDateTime":"2013-12-19T04:37:56Z","Content":"\n\u003Cp\u003ECongratulations!\u003C/p\u003E\u003Cp\u003EOn my save I try to only use time warp when necessary and not for interplanetary ships. This of course results in tons of missions within Kerbin\u0027s SoI while I wait for my interplanetary ones to reach their destinations, although KSP usually updates before any of them can get anywhere... xD\u003C/p\u003E\n"},{"CreatedByName":"jsfalconero","CreatedById":89120,"CreatedDateTime":"2013-12-19T04:54:16Z","Content":"\n\u003Cp\u003ECongratulations Lieutenant! Same goes to all the first time planetary landers on this thread. Keep up the good work! Once you\u0027ve mastered the art of interplanetary transfers the whole system opens up to you. \u003C/p\u003E\u003Cp\u003EAre you in career or sandbox mode? I\u0027ll be honest, I literally visited every moon in the game before I even tried for Duna on my career save. You\u0027re quite likely doing better than I am!\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-12-19T05:22:15Z","Content":"\n\u003Cp\u003ENothing beats the first Mun landing, but the first Duna landing is a close second.\u003C/p\u003E\n"},{"CreatedByName":"DeathFromBelow","CreatedById":27284,"CreatedDateTime":"2013-12-19T20:30:46Z","Content":"\n\u003Cp\u003ECongrats! The first successful Duna mission feels as good as mastering docking or making it back from the Mun for the first time. \u003C/p\u003E\u003Cp\u003EWhat do you want to do next? Back in my .18.4 save I decided to head on to Laythe after landing on Duna a couple times. In .22 my capstone was sending a big rover to Duna for some mountain climbing day trips. That\u0027s the great thing about this game, it seems like there\u0027s always another engineering challenge to try.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2013-12-19T21:27:41Z","Content":"\n\u003Cp\u003EBOOM! Welcome to the Red Planet Club!\u003C/p\u003E\n"},{"CreatedByName":"LtHeckard","CreatedById":83627,"CreatedDateTime":"2013-12-21T05:37:15Z","Content":"\n\u003Cp\u003EI was on Sandbox, but I did it all without cheating! I do feel quite proud of myself.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-12-21T06:47:36Z","Content":"\n\u003Cp\u003EGood job! I remember how amazed I was that I could manage to rendezvous and dock two ships around faraway planets (with the added incentive that if you don\u0027t do it, you aren\u0027t getting home).\u003C/p\u003E\n"}]}