{"TopicId":62400,"ForumId":51,"TopicTitle":"After Mint comes Vanilla: my most disasterous successful mission so far","CreatedByName":"breakthrough","CreatedById":75359,"CreatedDateTime":"2014-02-07T00:44:02Z","PageNum":1,"Articles":[{"CreatedByName":"breakthrough","CreatedById":75359,"CreatedDateTime":"2014-02-07T00:44:02Z","Content":"\n\u003Cp\u003EAfter a series of missions to Minmus not-so-creatively named Mint 1 through Mint 4, I had unlocked the gravity scanner and the lab module. I then whipped up what I thought was a slick biome-hopping lander that would get resupplied at a orbiting lab to get gobs and gobs of science from just a few launches to the Mun. \u003C/p\u003E\u003Cp\u003EThe Vanilla 1 mission sets out for the Mun with a brave lander pilot named Danry, a not so brave one named Macfred, and two scientists whose names I can\u0027t remember because they don\u0027t show up on the main screen after boarding the lab module. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/11jw3L6.png\u0022 alt=\u002211jw3L6.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/32zri5U.png\u0022 alt=\u002232zri5U.png\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/es1N4\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E530 hours of KSP logged and the first mission I decide to show off ends up being the first time one of my rescue missions needed another rescue mission.\u003C/p\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2014-02-07T08:32:33Z","Content":"\n\u003Cp\u003EI like that use of the swept wings, especially as lander leg mounts... even if they weren\u0027t wide enough. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2014-02-07T13:30:33Z","Content":"\n\u003Cp\u003EI think it was more the stability triangle. Three legs sounds as if it should be stable, but generally isn\u0027t that good. I usually go with a minimum of four, and more usually six landing legs spread wide. With three the distance from center of mass to the edge of the flat on the triangle formed by the legs isn\u0027t that far. It can be easy to tip if a nudge comes from the wrong direction.\u003C/p\u003E\n"}]}