{"TopicId":62923,"ForumId":51,"TopicTitle":"Eve Train : Kerbal Recovery","CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-02-12T01:51:04Z","PageNum":1,"Articles":[{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-02-12T01:51:04Z","Content":"\n\u003Cp\u003EEve is a jerk. Mission Control got quite agitated about the fact that many Kerbals were left on the 0.22 surface of Eve and ignored whilst 0.23 was fooled with. Ultimately, it was decided to build a train, send it to (0.22) Eve, and carry them all back to a vehicle that could take them all home.\u003C/p\u003E\u003Cp\u003ETests of the train on Kerbin were quite successful. 8 Kerbals, all in a nifty row in an engine and 7 cars.\u003C/p\u003E\u003Cp\u003ELandings of the train engines on Eve, alas, were not. Wanted to land two identical engines for balancing purposes, plus to have a backup in case one exploded. (2 different attempts):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CluGxxt.jpg\u0022 alt=\u0022CluGxxt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3Hdxh9F.jpg\u0022 alt=\u00223Hdxh9F.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAttempt # 3 sadly crashed into the stray refueling tank that was in the area and no data was recovered (i.e. somebody didn\u0027t hit the screen capture buttons quickly enough...)\u003C/p\u003E\u003Cp\u003EThis WILL end well. So much for work for the rest of the week.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-02-12T02:14:00Z","Content":"\n\u003Cp\u003EWhy on Kerbin are you trying to land your trains on lander legs!? They have perfectly functional wheels. Land \u0027em sideways, wheels-down, and you won\u0027t have these problems (as long as you pack enough parachutes, that is).\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-02-12T02:34:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EWhy on Kerbin are you trying to land your trains on lander legs!? They have perfectly functional wheels. Land \u0027em sideways, wheels-down, and you won\u0027t have these problems (as long as you pack enough parachutes, that is).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe legs are only there to allow the middle bit to survive after the two train engines detach (it drops on to the legs). Hangover from a previous mission. It\u0027s hard to see the orientation of everything because it was all crashed... Anyway, I managed to get one of the two engines properly landed just a few minutes ago:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zvWdQJM.jpg\u0022 alt=\u0022zvWdQJM.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-02-14T02:45:47Z","Content":"\n\u003Cp\u003EHAH! Got 4 cars attached. Seating capacity = 5. (3, mind you, are in the cheap seat section because they point backwards.) As soon as I can find some level ground I can reorient them. Bit of a design flaw - the cars are very utilitarian: no ability to brake them and I seem to be on an infinite tilted plane. The first one that I detached from its lander rolled more than 2 KM before I could catch up to it with the engine. Hence the reason why the other 3 are backwards, I wasn\u0027t detaching them from the lander until I was directly behind them to dock and stop them from rolling away.\u003C/p\u003E\u003Cp\u003EGonna be a long 40 KM drive to collect the first 2 stranded Kerbals.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d2sChfV.jpg\u0022 alt=\u0022d2sChfV.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2014-02-14T18:11:50Z","Content":"\n\u003Cp\u003EMy first thoughts when I saw this were made of nostalgic pride\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VfeXp1B.jpg\u0022 alt=\u0022VfeXp1B.jpg\u0022\u003E\u003C/p\u003E\n"}]}