{"TopicId":64156,"ForumId":51,"TopicTitle":"My First Career mission to Minmus","CreatedByName":"Gaurdsman111","CreatedById":104162,"CreatedDateTime":"2014-02-24T13:16:13Z","PageNum":1,"Articles":[{"CreatedByName":"Gaurdsman111","CreatedById":104162,"CreatedDateTime":"2014-02-24T13:16:13Z","Content":"\n\u003Cp\u003EHaving now been to the Mun, and exploring a lot of Kerbin, I decided that the next logical step would be to go to the Minmus. I didn\u0027t want to take a single Kerbal craft (having only the original capsule to use), because that means only one surface sample, crew report or otherwise. So I decided to go with a three Kerbal design that would hopefully result in a lot more science. I also added a lot of ladders, and a science bay. I give you the resultant craft:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NHuj1ex.jpg\u0022 alt=\u0022NHuj1ex.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1uDwkfY.jpg\u0022 alt=\u00221uDwkfY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YUgSzoc.jpg\u0022 alt=\u0022YUgSzoc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xTIzFw2.jpg\u0022 alt=\u0022xTIzFw2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LsvCf2f.jpg\u0022 alt=\u0022LsvCf2f.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, although the launch went fine, and the craft got to Minmus almost perfectly, I discovered a minute problem - it didn\u0027t have enough fuel to get back...\u003C/p\u003E\u003Cp\u003EThis is where the second craft came in. I immediately launched the emergency spare and sent it into space to rendezvous with the stranded craft. Whilst there I would complete I crew extraction into the new craft and bring the whole bunch back safely, at the cost of the science (I didn\u0027t add a comms unit). However, I didn\u0027t notice until I had rendezvoused that I had had test pilot Neddo along for the entire time! he had been in the ship testing systems when it had been emergency launched! So now the idea that the crew could be extracted was out of the window, we never leave a man behind. Here at KSC the hubbub was incredible, until Neddo radioed across to us all. He said that he thought he might be able to tug the stricken ship back within aero braking distance of Kerbin. this would be incredibly dangerous, one wrong move and all 4 would perish.\u003C/p\u003E\u003Cp\u003EKSC gave Neddo the green light, and he took the craft off of autopilot and began to line himself up. Using the new satellite top as a rest (finances weren\u0027t happy about this), he began thrusting the craft slowly into the back of the stricken craft. After about 10 minutes of thrusting, the engine cut out and was automatically jettisoned. Neddo had successfully saved both the lives of all 4, and also science data! Jebediah promised him a beer upon landing. Mission successful!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wwZ4Os3.jpg\u0022 alt=\u0022wwZ4Os3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LtyOpwe.jpg\u0022 alt=\u0022LtyOpwe.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jdy57vQ.jpg\u0022 alt=\u0022jdy57vQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o9rH0Aa.jpg\u0022 alt=\u0022o9rH0Aa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0NUdtIG.jpg\u0022 alt=\u00220NUdtIG.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-02-24T19:42:41Z","Content":"\n\u003Cp\u003EWelcome aboard. Very good save there, quite dramatic and requiring of some skill \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003EFor future reference, though, you can transfer data between pods and science parts during EVA. Move the Kerbal up very close to the part you want to get data from, and right-click on the part. If you\u0027re close enough, you\u0027ll see an option to collect, extract, download, or whatever the data (different messages for different parts). However, there are limits. A given Kerbal can only carry 1 copy of the same thing at a time, and I think a capsule can only contain 1 copy of the same thing at a time. IOW, if you had 2 surface samples from the same biome, you\u0027d have to put them in separate capsules and make 2 trips to move them. However, the Mobile Lab can contain multiple copies of the same data, although the Kerbal can still only carry 1 copy at a time.\u003C/p\u003E\n"},{"CreatedByName":"Gaurdsman111","CreatedById":104162,"CreatedDateTime":"2014-02-24T19:58:45Z","Content":"\n\u003Cp\u003ENow you see I did this mission before the data transfer was available, now days there is no need for such dramatisism \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EGlad you thought it was worth the time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}