{"TopicId":65145,"ForumId":51,"TopicTitle":"Triskelion Station Mk. II","CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-08T00:26:13Z","PageNum":1,"Articles":[{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-08T00:26:13Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EPart mods included: MechJeb, KAS, Universal Docking Ports, Kethane, Service Compartment Tube, MMI(modified).\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ETable of Contents:\u003C/p\u003E\u003Cp\u003E1. Intro/Construction of the Triskelion\u003C/p\u003E\u003Cp\u003E2. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71809-Triskelion-Station-Mk-II?p=1099807\u0026amp;viewfull=1#post1099807\u0022 rel=\u0022external nofollow\u0022\u003EMission 1: Rescue!\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E3. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71809-Triskelion-Station-Mk-II?p=1110596\u0026amp;viewfull=1#post1110596\u0022 rel=\u0022external nofollow\u0022\u003EMission 2: Kethane\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E4. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71809-Triskelion-Station-Mk-II?p=1217712\u0026amp;viewfull=1#post1217712\u0022 rel=\u0022external nofollow\u0022\u003EMission 3: Joolian Fuel Economy/Laythe Floating Base\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI was playing my game, making my little space station when I had a revelation. The layout of the station that I have in mind would make a good generation ship. It could fit many engines, store huge amounts of fuel, carry many kerbals, multiple landers, etc. I should be able to make it easily fly round trips to any planet in the kerbolar system. I decided thus to share my current experience and progress with the community.\u003C/p\u003E\u003Cp\u003E-------------------------\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EA short history of the Triskelion project\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBefore I began the Triskelion project, I was concerned primarily with research. Interplanetary missions were key to gaining sufficient understanding of the universe to do things like measure the nearby air pressure and make parachutes capable of preventing crashes. The culmination of my efforts resulted in the Eve Orbiter Probe, named for its first successful flight to Gilly and Eve.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yObys8Q.jpg\u0022 alt=\u0022yObys8Q.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt the top of the rocket is a probe powered by a single xenon engine, but loaded with enough xenon to last for nearly a day of constant full throttle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SDhfcXz.jpg\u0022 alt=\u0022SDhfcXz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the latest version of the probe in orbit over Moho. The first version of the probe didn\u0027t have the solar panels. On its maiden voyage, the probe\u0027s last nuclear engine was jettisoned during the escape burn from Gilly. It was several hours of stopping and starting the xenon engine to burn down to aerobrake altitude of Eve.\u003C/p\u003E\u003Cp\u003EIt was with this probe I did the crucial research that has enabled me to begin this project. With it I have landed probes on every planet except Eeloo and every moon in the entire kerbolar system.\u003C/p\u003E\u003Cp\u003ETriskelion Station began as many stations do, an orange tank with ports floating in space. The core of the station had a Mainsail engine for maneuvering. One launch at a time, three more tanks were launched and docked with the core, forming the first proper shape of the station. A modular design that allowed for much customization, refueling trips began and new modules providing extra function to the station quickly turned Triskelion into a dynamo of space goodness. Three fuel drone were launched in order to ferry fuel to ships that were unable to dock directly with Triskelion, as well as a xenon drone to deliver fuel to satellites designed to fly over Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hHz6iad.png\u0022 alt=\u0022hHz6iad.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first version of Triskelion Station. Note the Mainsail engine, the large ports around the engine, and the Gigantor XL solar panels at the front. Center port: xenon ferry drone, right port: fuel ferry drone.\u003C/p\u003E\u003Cp\u003EThe fuel ferry drones turned out to be too cumbersome, so they were replaced with a new, more maneuverable ferry drone:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SyVK1L8.png\u0022 alt=\u0022SyVK1L8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThree redesigned fuel drones are delivered to Triskelion in a single launch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/G1nqJla.jpg\u0022 alt=\u0022G1nqJla.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first Triskelion in all its splendor.\u003C/p\u003E\u003Cp\u003EThe project was not without its setbacks. Going back to my origins as a researcher, I discovered the hard way that the large docking ports on the station were installed backwards. The required a complete relaunch of the station. I woefully de-orbited the functioning Triskelion Station and in my impatience attempted to design a rocket that could deploy the entire station at once.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lLc6bMk.png\u0022 alt=\u0022lLc6bMk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis design did not work.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Zasc5JE.jpg\u0022 alt=\u0022Zasc5JE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelieve it or not, this design DID work, but only with outer tanks, not with the core.\u003C/p\u003E\u003Cp\u003EFor a while, I gave up on the project, and went on to other pursuits. I recently returned to the Triskelion Project, and have had a string of well-documented successes!\u003C/p\u003E\u003Cp\u003E-------------------------------------\u003C/p\u003E\u003Cp\u003ETriskelion Mk. II\u003C/p\u003E\u003Cp\u003ESo I finally got it in me to relaunch the station proper, one tank at a time. I fixed the docking ports and set the new tower up. So far so good. Another setback would be too frustrating.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UgcwalQ.png\u0022 alt=\u0022UgcwalQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECore plus one tank. Three fuel drones installed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bLHVH6t.png\u0022 alt=\u0022bLHVH6t.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Triskelion Mk. II in it\u0027s first form.\u003C/p\u003E\u003Cp\u003EI designed an entirely new refueling vessel for the station that uses the large port.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HbARijy.png\u0022 alt=\u0022HbARijy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERefueling vessel docked with Triskelion Mk. II. Every tank on the vessel as seen was full at the time of docking. Approximately 1.5 orange tanks worth of fuel added per trip.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PWIqwNn.png\u0022 alt=\u0022PWIqwNn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA simple cupola module and monoprop storage module were easy to launch and install. The monoprop module has an elongated snout to make it fit in between two wide modules.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yHPCOET.jpg\u0022 alt=\u0022yHPCOET.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe xenon module is slightly less wide than a typical wide object, making it easy to fit next to the monoprop module.\u003C/p\u003E\u003Cp\u003ENow that the station functions as a fuel platform for all celestial ships, it\u0027s time to expand the station to its next form. The first and most difficult of all the expansion tanks has been installed, the core extension. I had to line up the docking ports so they were exactly aligned to the ports on the front core tank. It was actually easier than I thought it would be.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Sc3c6uh.png\u0022 alt=\u0022Sc3c6uh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe core expansion installed. This is the present state of Triskelion station.\u003C/p\u003E\u003Cp\u003E--------------------\u003C/p\u003E\u003Cp\u003EThe future; my vision:\u003C/p\u003E\u003Cp\u003EAs I was imagining the final shape of the station, I had a revelation. If I attached and filled enough tanks, I could make a generation ship! All I need is enough fuel and I can get anything to make a round-trip to anywhere. My goal is to make a ship that:\u003C/p\u003E\u003Cp\u003E1. Can carry at least 10 kerbals.\u003C/p\u003E\u003Cp\u003E2. Has at least 2 reusable moon landers.\u003C/p\u003E\u003Cp\u003E3. Has at least 5 reusable orbiter probes.\u003C/p\u003E\u003Cp\u003E4. Can perform a round trip to any planet in the kerbolar system plus at least one moon of the destination planet.\u003C/p\u003E\u003Cp\u003E5. Has at least one reusable entry vehicle for large planets and bodies with atmospheres.\u003C/p\u003E\u003Cp\u003E6. Has independently maneuverable modules to place on the rear ports, such as engines and weapons systems.\u003C/p\u003E\u003Cp\u003EHere\u0027s my plan for the ship\u0027s design:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dsW3RzO.png\u0022 alt=\u0022dsW3RzO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhile not shaped like its namesake, it still has an aesthetically pleasing trefoil design.\u003C/p\u003E\u003Cp\u003EI will update here with my progress.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-17T17:37:13Z\u0022 title=\u002206/17/2014 05:37  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 17, 2014\u003C/time\u003E by Saltpeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-10T01:47:30Z","Content":"\n\u003Cp\u003EThe process of attaching the rear tanks has been exceptionally difficult. I had to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71849-I-have-a-docking-puzzle/page2\u0022 rel=\u0022external nofollow\u0022\u003Econsult with local aerospace experts\u003C/a\u003E for a solution to the problem. I have employed some exotic tools called MechJeb and Docking Alignment Indicator to facilitate these delicate maneuvers. I am very slowly making progress assembling the greater Triskelion Station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZbRQE0a.png\u0022 alt=\u0022ZbRQE0a.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe tanks are not yet properly docked up. Note the ruggedized MechJeb module. Donory Kerman is happy to have the assistance after struggling for weeks.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-10T03:50:20Z","Content":"\n\u003Cp\u003EOne of the tanks appears to be faulty. Only one of the docking ports ever seems to succeed to connect. A relaunch may be necessary.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-03-10T14:58:06Z","Content":"\n\u003Cp\u003EYou are definitely channeling your inner Whackjob \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Good luck with this monster.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-11T19:55:46Z","Content":"\n\u003Cp\u003EContinuing difficulty resulted in extensive discussion with experts on alternatives to the unreliable docking method. I\u0027ve employed a new exotic item, dynamic struts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/z8Ws4R2.png\u0022 alt=\u0022z8Ws4R2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDynamic struts not shown. The rearmost tank(foreground in picture) is being phased out as a result of the effectiveness of these new struts. It will be released and deorbited once the liquid fuel is emptied.\u003C/p\u003E\u003Cp\u003EConstruction can now continue as planned.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-12T01:12:09Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RRNVyCc.png\u0022 alt=\u0022RRNVyCc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDynamic struts are performing flawlessly so far. 7 tanks up, 19 to go! Note the strut storage module.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-13T00:49:15Z","Content":"\n\u003Cp\u003EEight tanks attached! I can now start expanding Triskelion Generation Ship beyond the core!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bSNT8v1.png\u0022 alt=\u0022bSNT8v1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDetail of the dynamic struts that have replaced the lateral ports on the rear tanks. The front tanks will continue to be attached by triple lateral ports.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-13T02:08:01Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TRTsk8I.jpg\u0022 alt=\u0022TRTsk8I.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETriskelion Generation Ship at 10 tanks. The two newest tanks are in the foreground and were both successfully triple-docked on the first try. MechJeb is especially good at this. Note the debris field forming around the station. Hubris trumps Kessler Syndrome.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-13T09:42:45Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3gVXmcd.png\u0022 alt=\u00223gVXmcd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne of the three rings of the trefoil is one tank away from completion. MechJeb\u0027s docking autopilot cannot achieve this dock because it approaches along one port\u0027s axis. I need to get both columns of ports lined up at the same time, which means I have to approach from the axis that bisects the angle made by the two columns of ports. MechJeb\u0027s Smart A.S.S. will assist me in a manual dock. I should be able to do this without too much difficulty.\u003C/p\u003E\u003Cp\u003EIf it turns out to be anywhere near as difficult as the multi-axis docking from before, I will settle for incomplete rings, a biohazard trefoil instead of a trefoil knot. That will make the final construct 20 tanks large instead of 26.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-13T09:49:42Z\u0022 title=\u002203/13/2014 09:49  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 13, 2014\u003C/time\u003E by Saltpeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-17T11:39:41Z","Content":"\n\u003Cp\u003EI was able to dock 4/6 ports. Sufficient in its own right, however...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7NOTBJ5.jpg\u0022 alt=\u00227NOTBJ5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA design oversight on my part: There are two lamps on each tank, two over two columns of ports, and one blank to be the side that gets attached to the station. This time, there are two columns of ports that need to be attached, so there are conflicting lamps, which caused the docking error. I will drop the fuel and spare monoprop into the station and deorbit this tank, and design a new tank with one lamp to act as a keystone tank for each loop of the trefoil. 6 of the 26 tanks in the station will be this modified design.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-13T22:50:30Z","Content":"\n\u003Cp\u003EWell. It would seem that the great minds of the KSP have developed a larger fuel tank. In the interest of part efficiency, I am planning a complete redesign of the Triskelion to use these tanks. I will be able to make the entire station with seven tanks, in the original triskelion shape that I so enjoy. I will require no wonky space struts, no tanks connected by Seniors. It will be fancy, it will be beautiful, it will have far more powerful engines than the current Triskelion is capable of fielding, and it will be far less of a strain on ground control\u0027s computers.\u003C/p\u003E\u003Cp\u003EIt would take 12 such tanks to match the total fuel capacity of the Triskelion Mk. II\u0027s design, but that\u0027s a compromise I am willing to make in exchange for part efficiency and ease of construction.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T01:03:40Z","Content":"\n\u003Cp\u003EMy first test of the new launch system for the Triskelion Mk. III was a success. A simple 7-tank asparagus setup using the new Kerbodyne tanks and engines. Once I was down to one engine, I decided to see how far it could take me. This happened:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pvpHtbv.png\u0022 alt=\u0022pvpHtbv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EComplete happenstance; a Jool Encounter was not planned, but certainly not unwelcome. Unfortunately, it seems that MechJeb is not compatible with these new parts. I was enjoying not having to do manual Hohmann transfers. The final part of the test will be to achieve Jool orbit. I have my doubts given remaining fuel.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T01:44:37Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nZAQ1oc.png\u0022 alt=\u0022nZAQ1oc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe flight did not make it to Jool orbit. Donory Kerman, captain of the Triskelion Mk. II, issued the following statement:\u003C/p\u003E\u003Cp\u003E\u0022Aww.\u0022\u003C/p\u003E\u003Cp\u003EA four-tank asparagus will be used in the proper launch of the Triskelion Mk. III station core. It will rendezvous with the Triskelion Mk. II where Donory Kerman will make a station to station transfer. As tanks are added to the station, they will be filled with the supplies of the Triskelion Mk. II. In the meantime, ground control has worked on replacing the old MechJeb with a module capable of supporting these new parts.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T02:10:48Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lcBHW8z.png\u0022 alt=\u0022lcBHW8z.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the delivery platform for the Triskelion Mk. III station core. One of the added benefits of these new tanks is that it makes the rockets absolutely beautiful. I was never a fan of that prison orange hue.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T03:15:33Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UuGnaqb.png\u0022 alt=\u0022UuGnaqb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMechJeb has been successfully upgraded. The docking computer is massively improved! The Mk. II and Mk. III have been docked, and an entire 1.5 Rockomax tanks worth of fuel has been transferred.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sw6BBSK.jpg\u0022 alt=\u0022sw6BBSK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDonory Kerman is also pleased to be done with the prison orange hue. The KSP couldn\u0027t have asked for a better commander of this lengthy mission. His incessant cheerfulness is as refreshing as it is distressing.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T06:36:00Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jLIS3vk.png\u0022 alt=\u0022jLIS3vk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFour of the Mk. II\u0027s tanks have been de-orbited. In the meantime, My efforts to prevent collisions between the solar panels and the tanks has resulted in a new problem. Since I was keeping in mind the need to leave room open for those panels, I thought to put in ports on the north end of the tanks. The result? Useless ports:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Nkr72LI.png\u0022 alt=\u0022Nkr72LI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh well. They might come in handy in the future. Somehow.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T18:50:10Z","Content":"\n\u003Cp\u003EI have been having extraordinary difficulty with the old multi-port docking procedures. In fact, I\u0027ve been unable to dock more than one port at a time on these new extra-large tanks*. I am pursuing alternate means of docking. Perhaps in the process I can solve the dilemma about the north docking ports.\u003C/p\u003E\u003Cp\u003E*I\u0027ve even edited the persistence file to make all the ports\u0027 states \u0022Ready\u0022 after undocking, reloading, and letting them snap back in while being perfectly aligned, and still only one of three would dock up.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T19:41:04Z","Content":"\n\u003Cp\u003EIn the engineering spirit, KSP scientists have created a monster:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wi7kZfx.jpg\u0022 alt=\u0022wi7kZfx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETaking advantage of the supernatural physical properties of cubic octagonal struts, a large port has been attached radially to the tank. Jebediah Kerman himself had this to say:\u003C/p\u003E\u003Cp\u003E\u0022Only one port will connect? Then make a station that connects tanks by one port. Here, have a port! It\u0027s on the house.\u0022 \u003C/p\u003E\u003Cp\u003EThe Triskelion Mk. IV will dock with the Triskelion Mk. III, which is still docked with the Triskelion Mk. II. Amateur astronomers observing the station\u0027s construction have taken to calling it Triskception Station.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T21:30:25Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Z8ax46R.png\u0022 alt=\u0022Z8ax46R.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the ungodly chimera of Triskelion station. Another tank from the Mk. II has been deorbited. The auxiliary monoprop storage module is full, and a new one will have to be designed. Preferably one that doesn\u0027t protrude so far from the center axis of the station. I think I know what I\u0027m going to do with the extra space beneath the solar panels.\u003C/p\u003E\u003Cp\u003EWait...what\u0027s that? Enhance...enhance...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7Ay9Apf.png\u0022 alt=\u00227Ay9Apf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere appears to be a Universal Docking Port sandwiched between a tank and an adapter block. This is unacceptable. Time to launch the Triskelion Mk. V.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-14T22:22:14Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tJk5jm3.png\u0022 alt=\u0022tJk5jm3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Triskelion Mk. V has docked with the Mk. IV. I am proud to say that the new radial Senior ports are working beautifully. KSP executives are negotiating with the Kerbal government to retain their funding after this very expensive diversion, but with the legendary Donory Kerman\u0027s support, the populace is expected to be won over. The decommissioning of Triskelion Station Mk. II can continue as scheduled. Followed by the decommissioning of the Mk. III and now the Mk. IV.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-14T22:41:27Z","Content":"\n\u003Cp\u003EThis is a really interesting series. Looks like you could really use a gigantic Fuel Ship, though.\u003C/p\u003E\u003Cp\u003EInterested in a craft file for this guy? Its a single-launch ship, just over 100 parts in its final state.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pTgsTg1.png\u0022 alt=\u0022pTgsTg1.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-15T03:23:41Z","Content":"\n\u003Cp\u003EHmmm. The original intention of Triskelion Station was as a refueling post, but since I am repurposing it as a generational-class interplanetary vessel, I might need another ship to serve as refueling post. Sure, I\u0027ll take your ship\u0027s craft file. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I\u0027m sure Donory will want to take lots of pictures of the docking of the Triskelion with this fuel depot.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-15T04:04:35Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VpLcWy9.jpg\u0022 alt=\u0022VpLcWy9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe time has come to say goodbye to the Triskelion Mk. II! The liquid fuel has been emptied from all the orange tanks, the xenon module has successfully been transferredto the Mk. V, and all other modules are deemed obsolete and will be redesigned. Deorbit has begun.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-15T05:23:03Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rfqm9iA.jpg\u0022 alt=\u0022rfqm9iA.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs a fiercely loyal commander, Donory Kerman has never acted beyond his orders. When the order came to de-orbit the Triskelion Mk. III and IV, he stayed at his post on the Mk. III. Ground Control realized their mistake and immediately ordered him to EVA over to the Mk. V.\u003C/p\u003E\u003Cp\u003EDonory is safe and sound and ground control is using remote guidance to continue the deorbit. Let us never speak of this again.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-15T05:40:25Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fS8gcEN.jpg\u0022 alt=\u0022fS8gcEN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBeauty shot of the Triskelion Mk. V\u0027s four-tank core configuration. The Xenon module is clearly visible on top. Not only are the solar panels raised far above the tanks, but they are oriented out of phase with the tanks, so that tank extensions will go in between the panels. The tanks are a bit wobbly due to being attached by a single port, but it\u0027s more than acceptable given the circumstances. MechJeb can compensate for imperfections in the design.\u003C/p\u003E\u003Cp\u003EI am currently debating whether to continue with the seven-tank triskelion design or a ten-tank biohazard trefoil design. The 10-tank config holds more fuel, has room for more engines, and has more convenient symmetry. The 7-tank config is more in the spirit of the station\u0027s name. If the triskelion shape isn\u0027t tenable, it can be modified easily enough.\u003C/p\u003E\n"}]}