{"TopicId":65145,"ForumId":51,"TopicTitle":"Triskelion Station Mk. II","CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-08T00:26:13Z","PageNum":6,"Articles":[{"CreatedByName":"Syre","CreatedById":57614,"CreatedDateTime":"2014-04-23T22:19:47Z","Content":"\n\u003Cp\u003EGood god man. I am so impressed with this \u0027project\u0027.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T00:34:16Z","Content":"\n\u003Cp\u003EAre you still in need of an SSTO Escape pod craft?\u003C/p\u003E\u003Cp\u003EBecause I built this thing. It can achieve orbit pretty effectively. It\u0027s Drone-driven. With some jet engine padding it can land like a feather. Its super-easily controlled, and stable. Has huge room for error - you can fly it like a ******ed dog and still get it in orbit. (Following basic Jet-powered SSTO rules, of course). Carries four Kerbals at a time, and consists of a subtle 63 parts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iioYcKG.jpg\u0022 alt=\u0022iioYcKG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBuilt with the assumption that it doesn\u0027t need to dock - just setpakc some kerbals to it and be on your way.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T00:42:58Z","Content":"\n\u003Cp\u003EI need a proper jet, not a rocket with jet engines. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E You\u0027ve seen the pictures of what I\u0027m trying to make.\u003C/p\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2014-04-24T01:05:13Z","Content":"\n\u003Cp\u003ESpacetruck for the win!!!! Your escape pod is rather nice as well.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T01:07:59Z","Content":"\n\u003Cp\u003EOops.\u003C/p\u003E\u003Cp\u003EJeb complains that craft is not a Jet. Insists some minor changes be made to make craft qualify as a Jet.\u003C/p\u003E\u003Cp\u003EEngineers make some small changes so that the craft is now a Jet.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nXBvC9f.png\u0022 alt=\u0022nXBvC9f.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T01:33:26Z","Content":"\n\u003Cp\u003EOooooh. Can it land well?\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T01:45:05Z","Content":"\n\u003Cp\u003EIT CAN! With the one design flaw that pops the lower two jets off on touchdown. :/ \u003C/p\u003E\u003Cp\u003EI\u0027ve got a good idea on how to patch that up though.\u003C/p\u003E\u003Cp\u003EI\u0027ll be honest. I threw this together and it somehow ended up being the most stable Jetcraft I\u0027ve ever made. It\u0027s also the fastest cruiser, and very maneuverable. The craft gently coasted onto the runway. The broken jets was just a positioning issue.\u003C/p\u003E\u003Cp\u003EThis thing is mind-blowingly fast after the rocket fuel (for completing the orbit and deorbiting) is depleted!\u003C/p\u003E\u003Cp\u003EI\u0027m gonna mess around with this a while and get it nice and awesome. Mainly fix that jet-breaking landing profile.\u003C/p\u003E\u003Cp\u003ELanding\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UnRLHMD.jpg\u0022 alt=\u0022UnRLHMD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanded\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8y7Q22c.jpg\u0022 alt=\u00228y7Q22c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECruising toward KSC. Still accelerating hard at just over Mach 5, but my exit\u0027s coming up. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FDELqFU.jpg\u0022 alt=\u0022FDELqFU.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T01:59:51Z","Content":"\n\u003Cp\u003ENew version cleared that problem right up. In the landing test I actually messed up a bit and landed quite hard, but nothing was damaged. It took the rough landing like a champ.\u003C/p\u003E\u003Cp\u003ECool angle\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pnc4RNN.png\u0022 alt=\u0022pnc4RNN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EComing in to land\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ovYUCMm.jpg\u0022 alt=\u0022ovYUCMm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanded and unharmed\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fWDNzo4.png\u0022 alt=\u0022fWDNzo4.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T02:00:52Z","Content":"\n\u003Cp\u003EThat\u0027s fantastic. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I\u0027ll have to give it a trial run once you\u0027ve perfected it. It just might be the hero\u0027s chariot worthy of the Triskelion crew.\u003C/p\u003E\u003Cp\u003EWait a second. That jet doesn\u0027t jettison those pods, does it? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I was hoping for the pods to parachute down after being jettisoned from the craft.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T02:12:52Z","Content":"\n\u003Cp\u003ECurrently they don\u0027t jettison. The plane lands whole at this point. In fact I\u0027m currently orbit-testing it. Didn\u0027t even revert after the test landing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Just took right off. I had only spent a tiny bit of the jet fuel in the landing demo anyway. \u003C/p\u003E\u003Cp\u003EAnd this thing can just go straight up to the upper atmosphere by brute force. No need to gradually glide to elevation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rAyXCqi.jpg\u0022 alt=\u0022rAyXCqi.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T02:29:52Z","Content":"\n\u003Cp\u003EIf you can make the jet so it jettisons the three pods and can still land well, I\u0027ll totally use it.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T03:23:54Z","Content":"\n\u003Cp\u003EI outdid myself on this one. This idea was new to me.\u003C/p\u003E\u003Cp\u003ESelf de-orbiting capsules.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3XziGnI.png\u0022 alt=\u00223XziGnI.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T03:28:09Z","Content":"\n\u003Cp\u003EAs much as I adore that idea, I need the capsules to be jettisoned at low altitude because I want them to land right on the KSC. Can I do that with that jet?\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T03:43:05Z","Content":"\n\u003Cp\u003ESort of. It\u0027s tricky though. Low throttle, still fly the plane afterward, etc. Very touchy and many catastrophic results in testing\u003C/p\u003E\u003Cp\u003EIll make something better for fly by drops reliably.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T03:47:44Z","Content":"\n\u003Cp\u003EThanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Sounds like the results I was getting with my own plane.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T04:46:50Z","Content":"\n\u003Cp\u003EI\u0027m able to get a plane to safely drop three pods at KSC, but it\u0027s ugly, and it just seems to me that it would be way more logical to just land the plane in one piece. Who tears a perfectly good plane apart 200 feet over the runway anyway? That\u0027s just....backwards....\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T04:52:50Z","Content":"\n\u003Cp\u003EThink of it as a bomber, but it drops kerbals instead of ordnance.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T05:11:35Z","Content":"\n\u003Cp\u003ENah I figured something out. I think you\u0027ll like it.\u003C/p\u003E\u003Cp\u003EThe front (3 pods) detaches as a unit with its own wings and can guide itself where you want independently of the jet. Then when ready you break it apart and it all falls to earth.\u003C/p\u003E\u003Cp\u003E...Except that the jet seems to unload and vanish if it goes too far.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T05:23:37Z\u0022 title=\u002204/24/2014 05:23  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by Camaron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T05:19:44Z","Content":"\n\u003Cp\u003EOooooooh! And the jet lands well?\u003C/p\u003E\u003Cp\u003EI did notice that happening with the pods when I was testing my plane.\u003C/p\u003E\u003Cp\u003EBut you know what? If the plane unloads and vanishes, I\u0027m fine with that. As long as it doesn\u0027t crash. We can pretend that it landed safely somewhere.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T05:27:50Z\u0022 title=\u002204/24/2014 05:27  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by Saltpeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-24T22:16:53Z","Content":"\n\u003Cp\u003EI have begun docking the kethane equipment to the Triskelion. I will also take the time to deorbit the old science probes. It was a spectacular lack of foresight that I forgot to add antennae to them, especially the ones without the non-reusable science modules. I will design a better probe for the next interplanetary mission at a later time.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rTz5Jq6.png\u0022 alt=\u0022rTz5Jq6.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-25T06:26:20Z","Content":"\n\u003Cp\u003EThe Triskelion is now fully equipped for the mission, minus the storage facility. The storage facility is going to be another station in the same vein as Hexaflexagon. The refinery module alone is itself a small station, and the Triskelion is going to haul it, even though it doesn\u0027t really have to. KSP scientists had this to say:\u003C/p\u003E\u003Cp\u003E\u0022Oh, you think flying around a lot and hauling some kerbals is sooooo cool, do you? That\u0027s dumb! You\u0027re dumb! We\u0027re not satisfied until we\u0027ve tortured that vehicle! Muahahahahaha!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/V338KFs.png\u0022 alt=\u0022V338KFs.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Syre","CreatedById":57614,"CreatedDateTime":"2014-04-25T08:50:55Z","Content":"\n\u003Cp\u003EMan! That plane is awesome haha\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-25T09:01:12Z","Content":"\n\u003Cp\u003EThere is one last task that can be accomplished without bringing the kerbals home first: The delivery of the storage facility to Minmus orbit. The same design as Hexaflexagon Station will be used, with some minor changes:\u003C/p\u003E\u003Cp\u003E1. Storage room for Xenon.\u003C/p\u003E\u003Cp\u003E2. Extra storage for Monoprop.\u003C/p\u003E\u003Cp\u003E3. Senior ports instead of XL universal ports.\u003C/p\u003E\u003Cp\u003EDesigns are underway for the new station.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-25T14:54:24Z","Content":"\n\u003Cp\u003EActually, If you can wait a few days, I\u0027ve already nearly finished what you would call Hexa - 2. All my new parts are here. I just have to backup my stuff and build the new system. It Is (Hexa 2) finished actually - I\u0027d just add some mono tanks and Xenon and its good to go after the launcher is completed. This thing is absolutely spectacularly huge. And I just remembered its double-octagonal, not double-hexagonal. Already tested to be flyable.\u003C/p\u003E\u003Cp\u003EAs for making a pod-dropping plane, its looking like rear-dropping is a must as for plopping three pods in style. Frontal dropping is dangerous, and the glider takes too long and the main craft unloads.\u003C/p\u003E\u003Cp\u003EEdit: Got the new plane into orbit.\u003C/p\u003E\u003Cp\u003EIt has bad flight stability (Working on that) But acheieved orbit with LOTS more of the space-worthy rocket fuel, meaning it can get where it needs to go, and can probably meet you from fairly high orbits. Not to mention you can always just juice it back up from one of the big ships - has a front dock. Also landed well and made easy work of the pod drop after deorbiting from a circularized 500km\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/GX3gh\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ELatest Version on a Docking test at 160km. Also, it is radically more stable in-flight.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/q1djWp2.jpg\u0022 alt=\u0022q1djWp2.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T17:17:44Z\u0022 title=\u002204/25/2014 05:17  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by Camaron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-25T19:39:37Z","Content":"\n\u003Cp\u003EIt\u0027s almost ready.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LSfZL0F.png\u0022 alt=\u0022LSfZL0F.png\u0022\u003E\u003C/p\u003E\n"}]}