{"TopicId":65145,"ForumId":51,"TopicTitle":"Triskelion Station Mk. II","CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-08T00:26:13Z","PageNum":9,"Articles":[{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-05-09T04:55:45Z","Content":"\n\u003Cp\u003EI have a finalized version of Emerald Grinder for you. As a note, feel free to name it whatever you want in your universe, same as the Titans. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn case you missed it, here is the link to the Large Generators / Xenon Tanks / Batteries, which are necessary for Emerald Grinder.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/2p589le82qlxgce/Camaron_Edits_MMI.rar\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/2p589le82qlxgce/Camaron_Edits_MMI.rar\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd here is the exact version of Kethane Mod I used with it: Kethane 0.8.5, just in case you want to be absolutely certain we have the same Kethane configs\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/23979-Kethane-Pack-0-8-5-Find-it-mine-it-burn-it!-0-23-5-(ARM)-compatibility-update\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/23979-Kethane-Pack-0-8-5-Find-it-mine-it-burn-it!-0-23-5-(ARM)-compatibility-update\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd, of course, The craft itself:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/xnso6po6p5lly7s/Emerald_Grinder_Type_II_WL_B.rar\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/xnso6po6p5lly7s/Emerald_Grinder_Type_II_WL_B.rar\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe final Emerald Grinder has four small converters on it which will activate and refuel everything on the ship as it drills, when the drills are triggered. Likewise, the deactivate when the drills are retracted. It also has two more drills, two more G30 generators, double the SAS modules to combat it\u0027s cumbersome nature, and has had it\u0027s outer columns re-positioned so that the Landercan at the bottom is right above the ground - your kerbal can simply walk up to it and grab the ladder, no flying or jumping or other acrobatics.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/KV3DF\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EIt launches with three probes bound to it. the probes can be used in polar orbit to do the Kethane scanning without bothering your massive primary ships to deal with polar orbiting. If you don\u0027t want probes, just rip them off in the editor.\u003C/p\u003E\u003Cp\u003EAction Controls:\u003C/p\u003E\u003Cp\u003EGear: Toggle Legs\u003C/p\u003E\u003Cp\u003EBrakes: Deactivates all Converters\u003C/p\u003E\u003Cp\u003E4 - Toggle Ion Engines.\u003C/p\u003E\u003Cp\u003E5 - Toggle Nuclear Engines.\u003C/p\u003E\u003Cp\u003E6 - Activate SAS Modules.\u003C/p\u003E\u003Cp\u003E7 - Deactivate SAS Modules (Very important function when pairing to another bigger ship, so the crafts don\u0027t conflict.)\u003C/p\u003E\u003Cp\u003E8 - Activate everything on the probe.\u003C/p\u003E\u003Cp\u003E9 - Deploy Drills, activate Converters.\u003C/p\u003E\u003Cp\u003E0 - Retract Drills, deactivate Converters.\u003C/p\u003E\u003Cp\u003ETell me if you find any problems. Enjoy.\u003C/p\u003E\u003Cp\u003ESide Note - From what I can tell the Kethane Converters are both WAY off, mathematically speaking. Example - as it generates fuel from Kethane, my ship was \u003Cstrong\u003Egaining\u003C/strong\u003E weight. And fast, too. Interestingly, the fuel is the closest-to-accurate of the bunch. The ratio on the Xenon is even worse, and the ratio on monoprop is just outright broken.\u003C/p\u003E\u003Cp\u003EWhat I\u0027m getting at is this - how would you like if I figured out the appropriate weight ratios and reconfigure the converter\u0027s rates? If you like that idea, I\u0027ll do it. For the sake of keeping things matched, if you don\u0027t like that idea, I\u0027ll leave them alone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-10T08:20:53Z\u0022 title=\u002205/10/2014 08:20  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 10, 2014\u003C/time\u003E by Camaron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-05-10T10:45:58Z","Content":"\n\u003Cp\u003EI believe the medium converter is a one-to-one weight ratio. The large one is supposed to be slightly more efficient. I don\u0027t mind kethane existing as compressed fuel that\u0027s more weight-efficient to have around as long as you can cover the energy cost of conversion. I\u0027d prefer to keep it as is. I have nothing against mods that make the game easier in some ways, as long as it\u0027s not like god-moding. Having lots of xenon and monoprop isn\u0027t really a big deal to me, since they don\u0027t have much weight in the first place. ;\u0026gt;.\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-05-10T19:50:02Z","Content":"\n\u003Cp\u003EEdit: removed bulky Kethane discussion. It was boring anyway, you guys haven\u0027t missed anything.\u003C/p\u003E\u003Cp\u003ERegardless, Saltpeter, I hope you have tons of fun with Emerald Grinder and your newest Triskelion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-11T06:54:55Z\u0022 title=\u002205/11/2014 06:54  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 11, 2014\u003C/time\u003E by Camaron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-05-11T02:32:11Z","Content":"\n\u003Cp\u003ESomething has to justify the expense of landing on a surface, mining it, and bringing it back into orbit. I\u0027m more concerned with the usefulness of kethane, the amount of kethane-equivalent fuel lost in the process of refining it and bringing it to space. The mass can be whatever you think is right, I just want gainful quantities of fuel.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-05-11T03:13:20Z","Content":"\n\u003Cp\u003EThen I will leave it as-is! I still feel like I want to bring it up to the Kethane Devs. We\u0027ll see if there\u0027s anything they want to say about that.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-05-11T20:09:53Z","Content":"\n\u003Cp\u003ESorry about the delay, pilot error in my Combusting Personal Translation VehiclE (CPTiVE) resulted in an unscheduled metallobraking maneuver into the hatch module of someone else\u0027s CPTiVE. No one was seriously injured. We\u0027ll return to your regularly scheduled programming in a couple days.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-05-11T20:36:05Z","Content":"\n\u003Cp\u003EYou broke it. It\u0027s dead.\u003C/p\u003E\u003Cp\u003EOh BTW are those damaged mining rigs still there? I would enjoy building a claw-based recovery Rover if you would like. Seems a shame to completely waste 300K Kethane on the ground.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-11T20:41:25Z\u0022 title=\u002205/11/2014 08:41  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 11, 2014\u003C/time\u003E by Camaron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-05-11T22:43:05Z","Content":"\n\u003Cp\u003EI don\u0027t think the damaged rig is still there. That was a 126k kethane loss. The other 150k is still intact, I just need to recover the tank, which is proving most difficult.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-05-12T01:03:44Z","Content":"\n\u003Cp\u003EI forgot that I hate rovers, because rover wheels are disastrously incapable of their jobs. Nevermind that.\u003C/p\u003E\u003Cp\u003EAfter painfully reminding myself how needlessly difficult such a thing is, I would recommend you also abandon that effort. There\u0027s a mod, (I don\u0027t know what it\u0027s called) that involves a fuel hose that can be manually attached with a Kerbal\u0027s help. It might be a mod worth adopting for future incidents like this.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-15T22:18:08Z\u0022 title=\u002205/15/2014 10:18  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 15, 2014\u003C/time\u003E by Camaron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pyranz","CreatedById":109052,"CreatedDateTime":"2014-05-17T09:56:53Z","Content":"\n\u003Cp\u003EYou can place landing wheels next to the r.wheels to take the weight, whilst still having traction.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-05-23T10:30:28Z","Content":"\n\u003Cp\u003EJust want to let the viewers at home know that it\u0027ll be a while longer before I can get back to this. Don\u0027t worry, I have not abandoned the adventure!\u003C/p\u003E\n"},{"CreatedByName":"Pyranz","CreatedById":109052,"CreatedDateTime":"2014-05-26T19:43:32Z","Content":"\n\u003Cp\u003EAnd here was me, convinced it was already gone. It is the exam time of year, so I can understand your position if that\u0027s the case \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-05T20:42:19Z","Content":"\n\u003Cp\u003EWell, I\u0027ve not been in school for about three years now. Just, life things happened. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Like I mentioned earlier, there was a car accident(no one was injured), a lot of thinking, some changes, etc. Have to get it sorted out, settle into the new routine. But once that\u0027s done, I will return to the Triskelion project, I promise. @.@\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-16T13:05:20Z","Content":"\n\u003Cp\u003EAlright! The time has come to continue the epic adventure of Donory Kerman and crew! Schematics for brilliant new vessels have been uploaded to the KSP. KSC scientists are crowd-sourcing their rocketry from maker hobbyists and especially fanatical players of the official game of the space program, and are confident that these uneducated shut-ins are the solution they need to the complex problems they face getting kethane off of Minmus. Preparations are being made as we speak to launch the new generation of kethane production! The miner and ferry modules are being retired. In a satellite press conference, Donory and Jebediah weighed in on the old vessels:\u003C/p\u003E\u003Cp\u003EDonory: \u0022Terrible.\u0022\u003C/p\u003E\u003Cp\u003EJebediah: \u0022Not even found lying by the side of the road would produce such roadkill.\u0022\u003C/p\u003E\u003Cp\u003EJerwin and Merkin: \u0022Let\u0027s do the going-to-the-moon dance again! We\u0027re going to the moon!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-16T14:30:19Z","Content":"\n\u003Cp\u003EBill Kerman has returned! Apparently the KIA has completed their debriefing and psychotherapy of Bill and have given him the greenlight to fly the new Croud-Sourced Kethane Collector, or CKC. Bill had this to say:\u003C/p\u003E\u003Cp\u003E\u0022It\u0027s more like a really fancy module than a ship, really. The damn Mechjeb was installed the wrong way, so I had to fly in the reverse all the way from launch to Minmus. Dropping the booster tanks fixed it, but so much wasted fuel...wasted fuel...all those years...\u0022\u003C/p\u003E\u003Cp\u003E...before the transmission cut out. Here is an \u003Ca href=\u0022http://static.comicvine.com/uploads/original/11111/111111271/2991103-fetal-man.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eartist\u0027s impression of Bill\u0027s current status\u003C/a\u003E. There appears to be some artistic license with this impression. In the image, Bill\u0027s skin is a color not yet observed of any living thing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IGJIXhX.jpg\u0022 alt=\u0022IGJIXhX.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-16T14:35:21Z\u0022 title=\u002206/16/2014 02:35  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 16, 2014\u003C/time\u003E by Saltpeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-16T15:24:05Z","Content":"\n\u003Cp\u003EThe CKC has docked with the Triskelion and is providing fresh fuel to the ship! With a device like this, the Triskelion could conduct a major operation in Joolian space without any need for expensive rescue missions! The crew obvious has many comments:\u003C/p\u003E\u003Cp\u003EDonory: \u0022It\u0027s beautiful!\u0022\u003C/p\u003E\u003Cp\u003EJebediah: \u0022Definitely better than the last attempt!\u0022\u003C/p\u003E\u003Cp\u003EJerwin and Merkin: \u0022We\u0027re not going to the moon, are we? ;_;\u0022\u003C/p\u003E\u003Cp\u003EBill: \u0022It...it was so quiet on Ike. The gentle libration of Duna played its silent music for me. It is the only peace I\u0027ve ever known...\u0022\u003C/p\u003E\u003Cp\u003EBob: \u0022Bill, are you okay?\u0022\u003C/p\u003E\u003Cp\u003EJim: \u0022Why are the drills still online?\u0022\u003C/p\u003E\u003Cp\u003EThe CKC will continue to make trips down to Minmus until the Triskelion is completely restocked, at which point it will transfer over to Minmusopolis and commence supply runs to its massive tanks. Finally, the Triskelion will return to Hexaflexagon Station and await the attachment of a second CKC. This means Bill Kerman will be a permanent resident of Minmus. KSP doctors and Donory and Jebediah and Bob and I-think-Jerwin-too think it\u0027s best for Bill and the crew if he stays close to Kerbin, in the isolation he seems to enjoy.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wnGZKax.png\u0022 alt=\u0022wnGZKax.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T00:55:20Z","Content":"\n\u003Cp\u003EThe Triskelion is fully fueled! It took three trips of the CKC to fill up the tanks from 20% capacity. That\u0027s not bad! The mission is almost over! All that\u0027s left is to navigate the CKC to Minmusopolis and return the Triskelion to Hexaflexagon Station for refit and debriefing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GIRS0St.png\u0022 alt=\u0022GIRS0St.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T01:20:11Z","Content":"\n\u003Cp\u003EThe CKC has docked at Minmusopolis. Since Minmusopolis doesn\u0027t actually have any housing, Bill will have to make himself comfortable in the CKC\u0027s capsule. Probably for the best, the walls of the capsule are padded.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OIW6fxQ.png\u0022 alt=\u0022OIW6fxQ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T02:13:42Z","Content":"\n\u003Cp\u003EA near miss is still a miss. And the Triskelion crew couldn\u0027t be happier.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QcPoUUW.jpg\u0022 alt=\u0022QcPoUUW.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T02:58:53Z","Content":"\n\u003Cp\u003EThe mission is complete! Kethane has been shown to be an extremely useful substance for lengthening missions and reducing the need for costly refueling launches. Exactly what everyone hoped it would be! And Donory thinks the hex planet overlay is cool!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xoKwRA1.jpg\u0022 alt=\u0022xoKwRA1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStay tuned \u0027til next time, when the Triskelion embarks on its longest, most difficult mission yet!\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T04:22:08Z","Content":"\n\u003Cp\u003EIn the first mission, the Triskelion became too low on fuel to make the planned Joolian grand tour. That gets remedied today, in style!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EJoolian Fuel Economy/Floating Base on Laythe\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1. Establish a floating base off the coast of any Laythan island with crew capacity of 3, science tools, a kethane mining/processing plant, and the ability to move across the surface of the ocean.\u003C/p\u003E\u003Cp\u003E2. Deliver an amphibious vehicle to Laythe for land exploration.\u003C/p\u003E\u003Cp\u003E3. Establish kethane mining operations on Bop and/or Pol. Scan Vall for kethane deposits. Briefly consider trying to land a CKC on Vall and change mind.\u003C/p\u003E\u003Cp\u003E4. Transfer from Jool to Eeloo and collect science.\u003C/p\u003E\u003Cp\u003E5. Return to Jool and deliver a kerbal to the floating base for permanent residence.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T06:00:02Z","Content":"\n\u003Cp\u003EThanks to the discovery of a coastline roughly half a mile east of the KSC, scientists have been able to test the floating base before shipping it to Laythe. The first test was promising!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DLXZP2P.png\u0022 alt=\u0022DLXZP2P.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T06:29:01Z","Content":"\n\u003Cp\u003EA few tests later and something serviceable appeared! This will be the basic construction block for the base. I want it to be a port of sufficient size to simultaneously dock a VTOL spaceplane and the proposed amphibious vehicle, as well as contain all of the necessarily modules to complete the mission.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4Wixt29.png\u0022 alt=\u00224Wixt29.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T19:06:34Z","Content":"\n\u003Cp\u003EFurther testing has resulted in this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HCdK2aG.png\u0022 alt=\u0022HCdK2aG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(5x5)\u002B9 squares of free space, easy walk-on ramps from the water for kerbals, smooth handling across water, max speed 4 m/s. This should be large enough for my needs. I\u0027m calling it Barghest Barge, for reasons that would be obvious to Scott Manley.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-06-17T22:17:27Z","Content":"\n\u003Cp\u003ESomehow, KSC scientists managed to launch an enormous flat object faceward into a 100km orbit with plenty of fuel left for maneuvers.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gQc3KsA.png\u0022 alt=\u0022gQc3KsA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe next launch will have the Barge travel to Hexaflexagon Station to dock with the Triskelion.\u003C/p\u003E\n"}]}