{"TopicId":66256,"ForumId":51,"TopicTitle":"Poryy\u0026#039;s Stories - Khoine Base","CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-03-19T19:25:09Z","PageNum":1,"Articles":[{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-03-19T19:25:09Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EKhoine Base Minmus:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E Dilfred jumped as the landing engine slammed on, decelerating the massive load of Khoine base to 7.7 m/s in less that a minute. With a hiss, the mobile base\u0027s RCS system rotated the huge object sideways. The Poodle landing stage separated and the base\u0027s RCS system fired downwards, gently lowering the mobile base onto it\u0027s wheels. At the control panel, Dilfred neatly turned on the brakes and raised the vehicle up onto it\u0027s legs. When the base came to a rest, Dilfred tapped the door to the restroom cubicle. \u0022Geneny? Are you in there?\u0022 Dilfred was only answered by a gurgling noise and a feeble cough. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAuthor Note:\u003C/span\u003E\u003Cem\u003EPoor Geneny was screaming all the way, so I thought I would be nice and let Dilfred do the site evaluation.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hT8TkMw.png\u0022 alt=\u0022hT8TkMw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E Dilfred shook his head and jumped out the roof hatch on the newly landed Khoine base. He activated his EVA pack and carefully flew to the pair of Gigantor solar panels, unfolding each one and letting them deploy. After he was done, he looked around at his surroundings. They had landed on a pale green, low-lying flat area. Within a kilometer lay a pale turquoise hill, leading up to the huge plateau that was their objective. He grinned as he looked, imagining all the science that could be done here. He opened the hatch again and spoke into the radio. \u0022Geneny! Tell Jeb 9K to set out the experiments! We\u0027ve got work to do!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/j1ftEnW.png\u0022 alt=\u0022j1ftEnW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E An hour later, the experiments were ready. Geneny had just finished examining the Thermometer and Goo results, and Dilfred was working on an analysis of a gravity and seismic scan. He finished, and put the pen down, carefully transmitting all of the data. He finally finished and began scrubbing out a materials bay. He spotted a bit of cold mush on the side and tasted it. \u0022Hey! Geneny! Grab some of the ground! It tastes like mint! Needs some chocolate chips, though.\u0022\u003C/p\u003E\u003Cp\u003E A calm mechanical voice interrupted him. \u0022I have determined we have learned all we can from this specific area. We should move uphill to the Slopes.\u0022 \u0022Not now, Jeb 9K. You know the rules. I\u0027m allowed to name this basin whatever I want.\u0022\u003C/p\u003E\u003Cp\u003E Dilfred left the craft again, and placed a flag naming the basin as Alby Basin, after the first Kerbal to land on Minmus. He lingered out there for another minute, marveling at the faraway globe of Kerbin.\u003C/p\u003E\u003Cp\u003E Dilfred moved soundlessly aside to let Geneny drive the base, still in shock about how small Kerbin really was. Geneny shrugged, disengaged the brakes, folded the panels, and raised the landing gear. With a blast of RCS, Khoine Base started rolling uphill, reaching up to 33 m/s and flying over any bumps in the turquoise ground. Geneny spotted a flat patch at the top of the hill, and fired RCS backwards, bringing the speeding base to a halt.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nnLhkxu.png\u0022 alt=\u0022nnLhkxu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E The base gently drifted downwards on a plume of monopropellant. Geneny extended the landing legs, but when the hovering object hit the Minmusian surface, there was a metallic tearing noise. Dilfred quickly went on EVA.\u0022The back left landing leg\u0027s completely sheared off. I have no idea why.\u0022 Dilfred quickly got a sample of the ground. The ground was almost completely composed of alternately soft and frozen mint ice cream, with large cracks. \u0022Looks like it hit a frozen bit, then sunk.\u0022 Said Dilfred.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAuthor Note:\u003C/span\u003E \u003Cem\u003EI have no idea why this happened. I\u0027m guessing that the leg got caught on one of the side-mounted material bays, or actually broke after the start of the trip, and only fell off when the base stopped. Until I know for sure, I\u0027m sticking with Dilfred\u0027s explanation.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E \u0022It\u0027s no problem.\u0022 Said Geneny. \u0022We have 3 more, and there\u0027s always the wheels.\u0022 \u0022Don\u0027t worry. I\u0027m not questioning your driving skills...\u0022 Said Dilfred.\u003C/p\u003E\u003Cp\u003E\u0022Save it. I almost wrecked the base.\u0022 \u0022I said drop. it. Now help me set out the experiments. We\u0027re in a new area now.\u0022\u003C/p\u003E\u003Cp\u003E After a hard hour of sciencing, they finally completed their entire suite of experiments and began scrubbing the Goo and Materials Bays. Finally, they finished doing all the work and transmitted the data. 500 science.\u003C/p\u003E\u003Cp\u003E When the transmission had finally reached the blue and white globe on the horizon, Dilfred noticed that it was nearly night. He folded up the solar panels, turned on the brakes, and told Geneny. Over-night Dilfred slept underneath the spare cleaning supplies, and Geneny slept on probe core controller\u0027s chair.\u003C/p\u003E\u003Cp\u003E When it was finally daytime again, they awoke and began moving immediately. This time, Dilfred was controlling the 3 probe cores in the front, with Jeb 9k looking for new areas to explore. To get to the plotted location, Southwest Mesa, Dilfred had turned the RCS system up to maximum power. Suddenly, the base left the ground and began to tilt sickeningly sideways. The probe cores mounted on the front providing torque to counteract the spin, and Dilfred frantically thrusted backwards with the RCS. A moment later, the unweildy, flying base hit it\u0027s apoapsis and Dilfred panicked. He moved to thrust directly upwards, but was only rewarded with a cough and blinking warning light. \u0022Monoproppelant out!\u0022 Dilfred yelled and threw himself backwards as the base smashed into the minty ground at 35 m/s and bounced four times. The initial impact wrecked the wheels and tore off the auxiliary batteries on the bottom of the craft. The second bounce ripped off the probe cores and Jeb 9k, and the third ripped the entire front off the base. The final bounce brought the skidding base to a halt, with the front of the lab module stuck in the ground and the rear elevated.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAuthor Note:\u003C/span\u003E\u003Cem\u003EAnd that, my friends, is why you should make quick saves.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jhc4fDv.png\u0022 alt=\u0022jhc4fDv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E Dilfred regained conciousness and yelled \u0022Damage report!\u0022, but the multitude of screaming alarms and red lights answered his question. The base had lost all methods of control. They were stranded on Minmus.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-23T12:52:18Z\u0022 title=\u002203/23/2014 12:52  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 23, 2014\u003C/time\u003E by Poryy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-03-21T01:56:22Z","Content":"\n\u003Cp\u003EIs this mission report seriously so horrible that it deserves no feedback whatsoever?\u003C/p\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-03-22T13:38:09Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EKhoine Base Part 2:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKSC\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe signal hit KSC like a lightning bolt. A simple SOS, repeating 22 times and then shutting off due to lack of power. Athens VAB team, lead by Elbnie Kerman, was already building a rescuer based on the same platform as the base. They called it Orpheus Minmus, and 2 days later it was climbing into the sky for it\u0027s 5 day rescue mission.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/O0Q7oXc.png\u0022 alt=\u0022O0Q7oXc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/z2lBKSU.png\u0022 alt=\u0022z2lBKSU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kEmreod.png\u0022 alt=\u0022kEmreod.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMinmus\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EGeneny: What do we have?\u003C/p\u003E\u003Cp\u003EDilfred: Well, we have a CO2 scrubber and 2 days of snacks left. Minmus\u0027 surface is edibile, but I recommend we don\u0027t eat too much of it. The water tanks were torn off, but we\u0027re on a ball of ice cream, so if we melt some and drink the liquid we\u0027ll be fine.\u003C/p\u003E\u003Cp\u003EGeneny: Communications?\u003C/p\u003E\u003Cp\u003EDilfred: None. Antenna is burnt out. We have one solar panel, and 4 battery banks, so that should give us enough power for the CO2 scrubber and the heating.\u003C/p\u003E\u003Cp\u003EGeneny: I think I can rig something from one of the wrecked probe cores. Do we have any tools?\u003C/p\u003E\u003Cp\u003EDilfred: We both have sample gathering hammers and I think there\u0027s a soldering iron in the lab. What are you planning on making?\u003C/p\u003E\u003Cp\u003EGeneny: A beacon. If KSC sends a rescue probe, I want it to land near us. \u003C/p\u003E\u003Cp\u003EDilfred: Can you find Jeb 9K? \u003C/p\u003E\u003Cp\u003EGeneny pulled a crumpled mess out of the ground. It looked like it had fallen off a train.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FLcGzLy.png\u0022 alt=\u0022FLcGzLy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGeneny: Yep. He\u0027s out of commission. I think KSC can remove the intelligence core and put him in a new body.\u003C/p\u003E\u003Cp\u003EDilfred sighed. Jeb 9K had been a good partner. \u003C/p\u003E\u003Cp\u003EDilfred: Let\u0027s get some snacks. We have some candy bars left, and a container of moffins. \u003C/p\u003E\u003Cp\u003EGeneny looked at the sad wreck of the base. \u003C/p\u003E\u003Cp\u003EGeneny: No cleaning for a while, I guess.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-23T12:54:20Z\u0022 title=\u002203/23/2014 12:54  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 23, 2014\u003C/time\u003E by Poryy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-03-23T12:54:51Z","Content":"\n\u003Cp\u003EAdded Pictures\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-03-23T14:27:35Z","Content":"\n\u003Cp\u003ENice. Great Narrative.\u003C/p\u003E\u003Cp\u003EI like the spartan rescue unit!\u003C/p\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-03-23T16:21:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wallygator\u0022 data-cite=\u0022Wallygator\u0022\u003E\u003Cdiv\u003ENice. Great Narrative.\u003Cp\u003EI like the spartan rescue unit!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt needed much dV. I gave it 13000. Trials on Duna are pending.\u003C/p\u003E\n"}]}