{"TopicId":68394,"ForumId":51,"TopicTitle":"Rescue Mission... Asteroid Simulator?","CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-06T15:34:59Z","PageNum":1,"Articles":[{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-06T15:34:59Z","Content":"\n\u003Cp\u003EHello there! Here\u0027s a little story of a broken capsule, a stranded Kerbal, and a revolutionary ride home...\u003C/p\u003E\u003Cp\u003ESo I was carrying out my 2nd Minmus landing on my recent career mode game, and everything had worked (sorta) well until then. Halfway through Minmus\u0027s SOI, right at the Periapse, a staging error caused the capsule to be jettisoned from all the other engines prematurely. The capsule was stranded, and already on its way back on a crazy orbit.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThis is KSP! I can\u0027t leave a man behind! \u003C/em\u003EI thought (despite leaving Jeb in Minmus orbit from three missions ago, and I still have yet to reach him), so I quickly launched another rocket. It was the exact same model of capsule as the first that went up, so they both had docking ports and parachutes. We could make it back... the problem was catching up to the darn thing.\u003C/p\u003E\u003Cp\u003EBecause I had never slowed down at Minmus, the stranded capsule was coming back on a crazily huge and eccentric orbit. That\u0027s when I had my great epiphany: This was just practice for when the asteroids start raining down! With renewed vigor, I set about it.\u003C/p\u003E\u003Cp\u003EI started in a very standard fashion. 100km parking orbit, then I first had to align the orientation of each orbit, then began using maneuver nodes and midcourse corrections to systematically work my way closer and closer to the dying capsule. Finally, I was on a similar orbit with about 125km of separation distance between the capsules. That\u0027s when things started going poorly.\u003C/p\u003E\u003Cp\u003EFor some reason, the Map View began glitching out and refusing my maneuver node placements. Or rather, it wouldn\u0027t let me use maneuver nodes in the spots that I needed them in. I had to fly this thing manually to get it close enough. Using Kerbin and the rough location of the ship, I pointed downwards (not sure there is a \u003Cem\u003Edownwards in space... it looked downwards to me)\u003C/em\u003E and made a four second burn. I looked at the map view... and I had only 5km of separation at the intersect!\u003C/p\u003E\u003Cp\u003EThe rest of the mission was absolutely smooth. I caught up to the capsule, hooked on, and even managed to get some Goo observations before firing my engines and towing the stranded capsule back. Now, I could have jettisoned the capsule and done both separately, but c\u0027mon. It\u0027s KSP. I re-entered with both capsules docked together! After splashdown, I\u0027m sure the boys back at Mission Control were breaking out the champagne and cigars over the success of my 67-day mission.\u003C/p\u003E\u003Cp\u003ESo that\u0027s my story! I believe this adventure was great practice for when I\u0027m ready to take on an asteroid!\u003C/p\u003E\u003Cp\u003EBTW, I didn\u0027t take any pictures during the mission... I will, however, be taking a bunch more just in case such a thing ever happens again! If you need proof, see B1-BattledroidCommander. We were sharing screens on Skype.\u003C/p\u003E\u003Cp\u003EThanks a million for reading!\u003C/p\u003E\n"}]}