{"TopicId":69494,"ForumId":51,"TopicTitle":"What is with these guys? ... Bob, Bill and Jebediah","CreatedByName":"Angvar","CreatedById":107332,"CreatedDateTime":"2014-04-16T01:48:59Z","PageNum":1,"Articles":[{"CreatedByName":"Angvar","CreatedById":107332,"CreatedDateTime":"2014-04-16T01:48:59Z","Content":"\n\u003Cp\u003E*We find ][van sitting in a smoke filled office cleaning his KAK-47 and drinking from a bottle of kvodka*\u003C/p\u003E\u003Cp\u003EThese three so called \u0022Heroes of the People\u0022 are nothing but bad news I am telling you ...\u003C/p\u003E\u003Cp\u003EJebediah ... Bah! ... Lead pilot of our Kerbin research studies ... first Kerbmonaut to orbit planet ... first one to orbit Mun and return. With such success of course we pick him to be first to actually land on Mun. What happens? He gets lander within 20 meters of lunar surface then pitches sideways smashing lander into thousands of pieces. Eh ... It was sad but these things are bound to happen and he died a great hero of the people. \u003C/p\u003E\u003Cp\u003ETwo days later I go to Kerbmonaut complex and who do I find? Je-bah-diah !!! There he was drinking kvodka and harassing the waitresses. I have to ask,\u0022Jebediah how is it that your are being here?\u0022. He babbles something about cobbling together parts from crashed lander and EVA pack and some other nonsense about a mythical space kraken. Then he passes out and the next day he claims amnesia. I wanted to fire him but apparently it would have been bad for the people\u0027s morale, so I simply ground him for further investigation.\u003C/p\u003E\u003Cp\u003ESo we decide to give Bill a chance. He makes it to Mun lands and takes off no problem. What does he do then? Ejects the stage of lander with the solar panels and batteries *slams kvodka bottle onto desk* I can not be believing it, but it happened. So there he is stuck in space with no power. Oh well another hero of the people making the ultimate sacrifice.\u003C/p\u003E\u003Cp\u003EOk so third time is charm yes? No, Bob gets to Mun ... lands,takes off .... runs out of fuel *sighs*. Another Kerbmonaut satellite orbiting the sun \u003C/p\u003E\u003Cp\u003EI decide to give Je-bah-diah one more chance, even though I know there is something fishy about this guy. We make rescue ship and on first test flight what does Jeb do? He goes EVA and loses ship. He becomes Kerbins newest satellite and a constant reminder of mistakes made on my watch of this program.\u003C/p\u003E\u003Cp\u003EAt this point I am thinking it is best to learn from mistakes and move on. There are plenty of other foo ... errr ... brave Kerbals who can do this job. By this time Bill and Bob were orbiting so far out around the sun that I deemed it unnecessary to mount rescue mission. I did the merciful thing and self destructed their rockets. \u003C/p\u003E\u003Cp\u003ETo be honest it was a relief to have them out of my hair ... after all, between the three of them they were responsible for the loss of nearly 600 million krubals worth of space craft.\u003C/p\u003E\u003Cp\u003EWith them gone we actually started to see some success. Multiple probe missions to both moons and finally landings and safe returns from both.\u003C/p\u003E\u003Cp\u003ESo one day while celebrating our glorious achievements at the Kerbmonaut complex, guess who walks up to congratulate me? Bill and Bob. I am utterly dumb founded. \u0027What are you doing here?, you are both dead, lost in space.\u0022 The dumb one just says \u0022We got out and pushed.\u0022 Bah!!\u003C/p\u003E\u003Cp\u003EImmediately I go the tracking center and see if Jeb is still in orbit and you know what? He is still there but to my amazement he is still alive. In orbit for over a year, no food or water and still alive? That is when I knew there was something terribly wrong with these guys. But of course the people demanded that I save their great hero and again I have Je-bah-diah on my hands.\u003C/p\u003E\u003Cp\u003EI am having two theories. One,*slams fist on desk* They are spies!!! They are flying my rockets across the sea and giving them to the Kamericans who using their Kollywood movie magic to fake these so called \u0022accidents\u0022.\u003C/p\u003E\u003Cp\u003EThe other possibility is they are zombies and utterly indestructible. Which if that is the case I am thinking we might have a bigger problem than I had realized.\u003C/p\u003E\u003Cp\u003EI have tried firing them, next day they are back at work their commissions reinstated. Fine, so I ground them, only to find them always sneaking onto my rockets. I tell Kudrum to pilot rocket and once it is on the launch pad who do I find in cockpit? Jeb or Bill or even worse Bob!!!\u003C/p\u003E\u003Cp\u003EI do not know what to do, I am guessing I just needed to vent *drinks more kvodka and finishes polishing his gun* \u003C/p\u003E\u003Cp\u003EI am just feeling that I have to warn people. Watch out for these guys there is something very wrong with them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-16T01:55:59Z\u0022 title=\u002204/16/2014 01:55  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 16, 2014\u003C/time\u003E by Angvar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-04-16T02:28:06Z","Content":"\n\u003Cp\u003EIt has to be those dastardly Kamericans! Jeb supposedly splattered himself across the surface of Tylo, yet he was back at Mission Control a week later!\u003C/p\u003E\n"}]}