{"TopicId":70169,"ForumId":51,"TopicTitle":"Kerbin circumnavigation","CreatedByName":"lewisd","CreatedById":66947,"CreatedDateTime":"2014-04-22T18:35:44Z","PageNum":1,"Articles":[{"CreatedByName":"lewisd","CreatedById":66947,"CreatedDateTime":"2014-04-22T18:35:44Z","Content":"\n\u003Cp\u003EI just wanted to share something I accomplished on the weekend, and see who else has ever tried it. (stock or otherwise)\u003C/p\u003E\u003Cp\u003EI built a plane that can circumnavigate Kerbin without landing or refueling. It took about 5 hours to fly all the way, at Mach 1, give or take a bit. I wasn\u0027t able to use physics acceleration, since it gets unstable and the autopilot isn\u0027t able to hold it\u0027s heading any more.\u003C/p\u003E\u003Cp\u003EI didn\u0027t want to have to spend 5 hours flying it myself, so I needed some kind of autopilot. Using stock SAS doesn\u0027t work over that length of time, as the heading it holds isn\u0027t relative to the surface, so as you fly forwards, your pitch relative to the surface increases. Instead, I used MechJeb\u0027s SAS in surface mode. I set a 90 degree heading, 0 roll, and ~4 degree (I think) pitch angle. The throttle was barely on once it reached cruising altidude, around 15km.\u003C/p\u003E\u003Cp\u003EThere\u0027s a bit of intake spam (3 intakes on the end of each wing) but I think it would work fine without them. It wasn\u0027t flying overly high, and the engine was barely on, so it shouldn\u0027t need much intake air. The solar panels also aren\u0027t necessary. It does need all the struts, to keep the wings from flapping like crazy, and the body from flexing. Without the struts strengthening the body, any pitch change makes the body flex back and forth, which makes it virtually impossible to land.\u003C/p\u003E\u003Cp\u003EAfter landing, it still had 70% of it\u0027s fuel left, so it could probably have done another couple circles around Kerbin. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027m not sure what it\u0027s stability charactaristics are like when empty though, so I don\u0027t know if it would actually fly.\u003C/p\u003E\u003Cp\u003EDone with KSP 0.23.5, and some mods (as best I can remember):\u003C/p\u003E\u003Cp\u003E- FAR (I much prefer the more realistic drag model)\u003C/p\u003E\u003Cp\u003E- MechJeb2 (as an autopilot)\u003C/p\u003E\u003Cp\u003E- Engineer (didn\u0027t really need it, just added it out of habit)\u003C/p\u003E\u003Cp\u003E- RealChutes (drag chutes for landing, not really needed)\u003C/p\u003E\u003Cp\u003E- TAC Fuel Balancer (keeping the tanks all balanced to keep it stable)\u003C/p\u003E\u003Cp\u003EEDIT: I should add, the ability to quicksave while in the atmosphere that was added in 0.23.5 was absolutely \u003Cstrong\u003Eessential\u003C/strong\u003E for pulling off this flight. Otherwise when I crashed the first landing attempt, that would have been 5 hours down the drain. Thanks Squad! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ztyZo\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-22T19:05:36Z\u0022 title=\u002204/22/2014 07:05  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 22, 2014\u003C/time\u003E by lewisd\u003C/strong\u003E\n\u003C/span\u003E\n"}]}