{"TopicId":71844,"ForumId":51,"TopicTitle":"Mun how I loathe you sometimes.","CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-05-09T16:49:30Z","PageNum":1,"Articles":[{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-05-09T16:49:30Z","Content":"\n\u003Cp\u003EIt\u0027s time to colonize Minmus. So I get my modules ready for departure. I\u0027ve done the trip to Minmus a bunch of times manually, so I just fire of MechJeb, launch to plane/redezvous, and alt\u002Btab to answer some email. I come back to KSP and my module is out of Kerbin\u0027s SOI, and I need 8000dV to get to Minmus. WTH?!?!?\u003C/p\u003E\u003Cp\u003ERevert to Launch.\u003C/p\u003E\u003Cp\u003EManually create the node.\u003C/p\u003E\u003Cp\u003EOh.\u003C/p\u003E\u003Cp\u003EWhoever said the Mun isn\u0027t large enough to provide decent gravity assists, whatever. I got a huge, unwanted assist.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-05-09T17:02:29Z","Content":"\n\u003Cp\u003EThe Mun is the bane of my Minimus Exploration Office.\u003C/p\u003E\n"},{"CreatedByName":"ArcFurnace","CreatedById":109240,"CreatedDateTime":"2014-05-09T17:06:25Z","Content":"\n\u003Cp\u003EThe Mun isn\u0027t large enough that deliberately going for a gravity assist is worth the fuel. \u003Cem\u003EAccidental \u003C/em\u003Egravity assists, now, those it\u0027s quite good at. \u003C/p\u003E\u003Cp\u003ESeriously, I\u0027m trying to drop back into Kerbin\u0027s atmosphere, stop getting in the way.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-09T17:27:15Z","Content":"\n\u003Cp\u003EI\u0027ve been going to Duna a bit lately, Ike does the same thing. \u0022Oh, you\u0027ve got your aerobraking all set up? Let me just fix that for you.\u0022\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-05-09T17:41:15Z","Content":"\n\u003Cp\u003EI have used Ike to my advantage though. I prefer equatorial orbits for various reasons, but I was coming in at an inclination of above 45, and of course the burn needed to fix that can get pricey. But, there was Ike in my way, or was it? Burned slightly and let Ike throw me into a equatorial orbit around Duna for less than what it would have cost me at Duna. This was before I had really figured out Radial/Normal and how to use it to my advantage.\u003C/p\u003E\n"}]}