{"TopicId":76458,"ForumId":51,"TopicTitle":"First Munar Rover Mission","CreatedByName":"DeskLamp","CreatedById":113302,"CreatedDateTime":"2014-07-01T23:03:22Z","PageNum":1,"Articles":[{"CreatedByName":"DeskLamp","CreatedById":113302,"CreatedDateTime":"2014-07-01T23:03:22Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/cjh1n\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI also tried the same mission on minmus, minus the screenshotting. I managed to land, but I decoupled the rover and took off in the lander and realized my electricity was out, so I put the lander back down on it\u0027s side and took a solar panel from the rover and slapped it onto the lander(thank goodness I packed a kerbal) using KAS. Then I flipped up using the Reaction Wheels and successfully returned to Kerbin. After driving the rover some time, I eventually got up to a good speed and tried to turn, rolled the rover, shattering the other panel. So it will become obsolete after it runs out of it\u0027s current battery power.\u003C/p\u003E\u003Cp\u003EFeel free to leave any tips or suggestions if you see anything that can be improved on. Besides the clearly obvious nose cones.\u003C/p\u003E\u003Cp\u003E[modedit: Redundant BBCode munched. Have fun!]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-02T03:36:39Z\u0022 title=\u002207/02/2014 03:36  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 2, 2014\u003C/time\u003E by DeskLamp\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-07-04T02:00:48Z","Content":"\n\u003Cp\u003EMost impressive \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI noticed that during the landing, you took a few screenshots from inside the lander can. Did you actually land while in IVA view? If so, nicely done indeed!\u003C/p\u003E\u003Cp\u003EI also like the nice, compact rover design as well.\u003C/p\u003E\n"},{"CreatedByName":"DeskLamp","CreatedById":113302,"CreatedDateTime":"2014-07-05T14:29:07Z","Content":"\n\u003Cp\u003EI did indeed land in the IVA view, but I first ensured that the ground I was coming down on was flat before I was certain I could switch over to IVA.\u003C/p\u003E\n"}]}