{"TopicId":76924,"ForumId":51,"TopicTitle":"KSA - Moon and beyond [RSS]","CreatedByName":"Thrust","CreatedById":110981,"CreatedDateTime":"2014-07-08T00:03:56Z","PageNum":1,"Articles":[{"CreatedByName":"Thrust","CreatedById":110981,"CreatedDateTime":"2014-07-08T00:03:56Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EKSA - Moon and beyond [RSS]\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EI\u0027ve finally got time to put this all together. Whole week of gameplay, different small missions, many successful designs and even more failures. I use many mods, the most important is \u0022Real Solar System\u0022 (some of them I tweaked a bit, to match the rest, like Realism Overhaul without rescaling). That\u0027s why Moon, not Mun.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPart 1. - Prologue.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis program started 7 years ago, when some crazy guy said: \u003Cem\u003E\u0022Lets go to other planets\u0022\u003C/em\u003E. Easy to say. A space agency was brought to life. Finances were not a problem, so they immediately started developing equipment...\u003C/p\u003E\u003Cp\u003EP-1 was a series of small impact probes. Only one launched successfully, and hit the lunar surface. Next was P-2, a microsatellite with science. Two are currently still operational, one around Mars, and one near Venus. P-3 small probe, built and launched together with P-2 to explore the surface of Mars and Venus. Both successfully landed. The Venus one broke shortly after landing, it transmitted only small part of expected data. Another launch to replace it was planed, but never happend.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xG8xo0q.jpg\u0022 alt=\u0022xG8xo0q.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EP-5 micro rover. Two were sent to Mars, but didn\u0027t last for long. Complete failure.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/051uMUU.jpg\u0022 alt=\u0022051uMUU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext is the first manned Moon landing. Building a rocket for this was a real challenge. During the first manned launch one of the launch clamps failed, and the craft ended flying sideways 300m above surface. Thats why Jeb is not the first Kerbal on the Moon. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KyOHgUC.jpg\u0022 alt=\u0022KyOHgUC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBackup crew launched in second rocket 12 hours later (this time I decoupled some of the clamps before launch).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3MNcIyC.jpg\u0022 alt=\u00223MNcIyC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECommander of this mission Bill Kerman, and Endred Kerman, undock the lander, and deorbit. Flight engineer Bob Kerman is waiting in command module.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/omiF015.jpg\u0022 alt=\u0022omiF015.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter touchdown, the crew is preparing for EVA. They deploy solar panels, anthenas, lader, and small lunar rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ArvLN13.jpg\u0022 alt=\u0022ArvLN13.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill leaving first footprints. Endred joins him, and is first to ride the lunar rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mYnzAiP.jpg\u0022 alt=\u0022mYnzAiP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBoys take a short trip to collect some rocks, and surface samples.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/x0WWloc.jpg\u0022 alt=\u0022x0WWloc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanding site is in south of Ocean of Storms {\u0022Oceanus Procellarum\u0022).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cjSk6BR.jpg\u0022 alt=\u0022cjSk6BR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter 5 hours the lander crew is ready to rendezvous with command module on orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DlPD6Fo.jpg\u0022 alt=\u0022DlPD6Fo.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was realy tight on fuel, to complete circularization they burned with monopropellant. The CM actualy moved to dock with the lander. Bob saves the day.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8IFf84D.jpg\u0022 alt=\u00228IFf84D.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter some boring maneuvers and 4 more days, they finally return. (sorry no screenshots from this phase).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/X1sqlGv.jpg\u0022 alt=\u0022X1sqlGv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo be continued...\u003C/p\u003E\n"},{"CreatedByName":"Strayed","CreatedById":105854,"CreatedDateTime":"2014-07-08T00:36:51Z","Content":"\n\u003Cp\u003ECool series!\u003C/p\u003E\u003Cp\u003ECan\u0027t wait to see what happens next\u003C/p\u003E\n"},{"CreatedByName":"Thrust","CreatedById":110981,"CreatedDateTime":"2014-07-09T23:59:19Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 2. - Pre-flight testing.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThree more missions to the Moon were launched. Unfortunately none succeeded. One rocket failure during launch (hit the launch clamp), and two lander failures (both when detaching fairings on top stage, damaged landing leg, and fuel tank explosion). With Mars transfer window soon, everyone focused on testing equipment that will fly there.\u003C/p\u003E\u003Cp\u003ETwo main parts were selected, lander \u0022Ares\u0022, and inflatable \u0022DropBase3\u0022. This is one of many short launches, to see if it works.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ScsW9L0.jpg\u0022 alt=\u0022ScsW9L0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt some altitude the tank was detached, and parachutes deployed...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/abUeeRF.jpg\u0022 alt=\u0022abUeeRF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...the two parts separated 2km above ground...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TYvxunZ.jpg\u0022 alt=\u0022TYvxunZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...maybe not this time...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9FGgNdN.jpg\u0022 alt=\u00229FGgNdN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...and that is why we need more tests. With more vertical speed it works. The base, when fully deployed looks like this. Living space for 5 astronauts, and supplies for 3 months.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OQWn9QV.jpg\u0022 alt=\u0022OQWn9QV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the meantime, brave Kerbals return from vacation only to find out that all space flights were canceled.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tnnMyV2.jpg\u0022 alt=\u0022tnnMyV2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJebediah was so frustrated that he will never again go to space, that he requested reassignment to \u0022experimental aircraft\u0022 program.\u003C/p\u003E\u003Cp\u003EHere we have three top test pilots standing near the X-6 rocketplane. From left: Jebediah, Jedfrey, and Nedzor.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/p917bww.jpg\u0022 alt=\u0022p917bww.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENedzor took Jebediah on a short testflight with old X-4, officially to do some atmosphere analysis.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QZ66p6c.jpg\u0022 alt=\u0022QZ66p6c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENedzor: \u0022Tower, can we make some maneuvers before landing? Jebediah is asking me how many G this plane can withstand.\u0022\u003C/p\u003E\u003Cp\u003ETower: \u0022Emm...Sure, as long as you don\u0027t crash. Stay below 2000.\u0022\u003C/p\u003E\u003Cp\u003ENedzor: \u0022Roger.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Qo19EQ5.jpg\u0022 alt=\u0022Qo19EQ5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb was the first Kerbal in space. He experienced similar G during ballistic re-entry.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/s20h0xZ.jpg\u0022 alt=\u0022s20h0xZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd tailslide before landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4KQHw5J.jpg\u0022 alt=\u00224KQHw5J.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA few weeks later, equipment for Mars was ready to launch. Before that, the new lifter had to be tested.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vvFMxnl.jpg\u0022 alt=\u0022vvFMxnl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E70 tons to LEO. After 3 successful test launches it was safe enough to lift more valuable cargo (and more wobbly). \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TSUfIby.jpg\u0022 alt=\u0022TSUfIby.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStaging. Just look at the size of this fairing. It\u0027s almost as tall as rest of the rocket.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zixBBEX.jpg\u0022 alt=\u0022zixBBEX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMars test ship on orbit. It detached that small tank on rear and waited for service module (a.k.a. tug) that will be pushing it. Below you can see one of the refuel tanks, carrying fuel for the service module. Two of these were needed. And the actual service module launching from KSC (i have only this one screenshot).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Hw5IZVs.jpg\u0022 alt=\u0022Hw5IZVs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEverything assembled and ready to go. From left to right: Habitat module for 6 crew members, with 2 capsules docked, and life support module (scrubbers, filters etc.); Drop module with docked inside Ares lander and DropBase3 under fairings, plus heat shield and deorbit unit; Docked Service module with supplies for 2 years, fuel, and nuclear engine.\u003C/p\u003E\u003Cp\u003ETwo astronauts visited it, to check all systems. With everything working, they programed flight computer to launch at next transfer window, undocked their capsule, and watched as the ship begins its journey.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ja9KvSR.jpg\u0022 alt=\u0022Ja9KvSR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo be continued...\u003C/p\u003E\n"}]}