{"TopicId":80535,"ForumId":51,"TopicTitle":"Ad Lunam - Final Update 2015-05-31","CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-08-02T21:32:00Z","PageNum":5,"Articles":[{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-02-01T23:43:42Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EAd Lunam - Super Departures\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EToday the Patriots of the 19th KSA send their SeaHawk (Osprey) off to Duna, while the Rebels and their ilk take their much more luxurious Kraken\u0027s Harvest out for the same trip. Who will win on this Super Sunday? We\u0027ll find out, but we\u0027ve got a few things on the pregame agenda to take care of first....\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EEutocius 3 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 176 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Anuchin\u003C/p\u003E\u003Cp\u003EHeight: 32.7\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 115.6\u003C/p\u003E\u003Cp\u003ECost: 95,223\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0367_eu3.jpg\u0022 alt=\u002220150104_ksp0367_eu3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe training missions continue! This time Milzer and Meldo sent Podner and Mac off to Minmus in yet another Duster, with no changes needed for the transfer to Minmus. This little 2-seater isn\u0027t all that bad. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0371_eu3.jpg\u0022 alt=\u002220150104_ksp0371_eu3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis time our crew of trainees had some work to do: a temperature survey contract for three points on Minmus. Not a bad deal, given how much it paid out, but it would test the fuel limits of the Eutocius 3. All three were for temperature scans, one while landed the other two a small distance above the surface. First they had to get to Minmus. \u003C/p\u003E\u003Cp\u003EThis flight began at the worst possible time, and had to perform a large plane change maneuver. Bad planning on my part. Had I waited another 2 hours it wouldn\u0027t have been an issue. No worries, though, as this ship already had too much fuel. The transfer stage was enough to complete the initial Minmus capture, and was left on a sub-orbital trajectory.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0380_eu3.jpg\u0022 alt=\u002220150104_ksp0380_eu3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the transfer to Minmus complete, the crew wasted no time in making their first landing. They performed the first temperature survey while on approach to the surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0383_eu3.jpg\u0022 alt=\u002220150104_ksp0383_eu3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EObligatory flag snapshot:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0396_eu3.jpg\u0022 alt=\u002220150104_ksp0396_eu3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe plan was to liftoff and dock with the old Eutocius Station, except I forgot the station was in a retrograde orbit (as is standard for my moon stations), and took off prograde. Oh well. Next up were more temperature surveys.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0399_eu3.jpg\u0022 alt=\u002220150104_ksp0399_eu3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith that completed, Podner and Mac said their goodbyes and made for Kerbin. One more crew leveled up! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0431_eu3.jpg\u0022 alt=\u002220150104_ksp0431_eu3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EThe Survery Contract That Wasn\u0027t\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 186 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003E\u0022Hey M! Wanna go for a drive?\u0022 Milzer came bounding into Meldo\u0027s office, jumped over the top of a chair a sat grinning. Meldo wasn\u0027t sure what to make of it. \u003C/p\u003E\u003Cp\u003E\u0022Not particularly. Why?\u0022\u003C/p\u003E\u003Cp\u003EA slip of paper slid across Meldo\u0027s desk. A contract. \u0022Survey contract for this spot up north of the lake. Somebody-or-other\u0027s Folly. I figured we could take the van and head out!\u0022\u003C/p\u003E\u003Cp\u003E\u0022While there\u0027s a flight in progress? The Eutocius 3 is on its way back from Minmus.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Aaah. That\u0027ll take seven more days. C\u0027mon!\u0022 Milzer jumped over the desk and practically dragged Meldo outside. \u0022The sunlight\u0027ll be good for ya!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0436_survey.jpg\u0022 alt=\u002220150104_ksp0436_survey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was all smiles and sunshine until they made it to the top of the hill behind KSC. That\u0027s when Meldo pulled out a map to find this \u0022Shepdin\u0027s Folly.\u0022\u003C/p\u003E\u003Cp\u003E\u0022M, this is well over 100 kilometers away! It\u0027ll take us forever to drive there!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Just a few days.\u0022\u003C/p\u003E\u003Cp\u003E\u0022And even more to drive back. Look, there\u0027s nothing but rough terrain between here and there. Shouldn\u0027t we just send a jet?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Where\u0027s the fun in that?\u0022\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003E\u0022Flight 008 to Lake Tower. Requesting permission to take off on runway 09.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Permission granted Gersted. Let us know what you find out there.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0441_survey.jpg\u0022 alt=\u002220150104_ksp0441_survey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGetsted buried the throttle and went screaming down the runway. He climbed quickly to a cruising altitude and set course NNE. Since M\u0026amp;M had decided not to drive to Shepdin\u0027s Folly, flying was the next best option. The X-8 is small and nimble enough land almost anywhere, and was the practical choice for completing the mission. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0445_survey.jpg\u0022 alt=\u002220150104_ksp0445_survey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022It\u0027ll be ok, little jet.\u0022 Gersted gave the ship a little pat for encouragement as it screamed through the skies, creating a trail of plasma in their wake. A strange vibration had built up in the cockpit, not enough to be dangerous, but perhaps enough to scare a jet and its little green pilot. With a plane this powerful these seismic surveys would be done in no time. \u003C/p\u003E\u003Cp\u003EAnd then Getsted saw Shepdin\u0027s Folly. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0452_survey.jpg\u0022 alt=\u002220150104_ksp0452_survey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Flight 008 to Lake.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Lake, go ahead X-8.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah. I can land almost anywhere, just not at the target sites. A wee bit mountainous out here. Has anybody bothered to look up why this place is named Shepdin\u0027s Folly?\u0022 The radio was silent for a few moments, finally crackling back once somebody had found the answer. \u003C/p\u003E\u003Cp\u003E\u0022Renamed from Lonely Mountain in honor of Lt. Shepdin Kerman, bomber pilot during The War. Lost in action after attempting to fly directly over the mountain to surprise an advancing enemy force. Final location unknown, presumed lost.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0453_survey.jpg\u0022 alt=\u002220150104_ksp0453_survey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Ok Lake, I\u0027m headed back your way now. Don\u0027t care to have this sad little mountain renamed again. X-8 out.\u0022\u003C/p\u003E\u003Cp\u003EObligatory post-flight photo (lots of these \u0022obligatory\u0022 photos in this update it seems....):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150104_ksp0464_survey.jpg\u0022 alt=\u002220150104_ksp0464_survey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003EIt was decided later that building a craft capable of landing at all three survey points would cost more than the penalty from just canceling the contract. Milzer was still slightly bitter about it, and was heard to remark \u0022I told you we should\u0027ve just driven there!\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EProject ORTHO - Eagle-2 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 320 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E\u002219th\u0022\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: S/EFT-2\u003C/p\u003E\u003Cp\u003EOrbiter: ORTHO-1 \u0022Wanderer\u0022\u003C/p\u003E\u003Cp\u003EHeight: 37.8m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: Classified\u003C/p\u003E\u003Cp\u003ECost: Classified\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150106_ksp0476_eagle2.jpg\u0022 alt=\u002220150106_ksp0476_eagle2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EProject ORTHO might have been transferred to the KSA, but it was still a military program at its core. And the second launch of Wanderer was a perfect example of that. Major Danbus was back in the pilot\u0027s seat, with a second military kerbal, Haldan, riding along as payload engineer. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150106_ksp0484_eagle2.jpg\u0022 alt=\u002220150106_ksp0484_eagle2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat that payload was, how heavy the vehicle was, and even which orbit it had been placed into was information no one at KSC was provided. The payload had arrived already tucked away inside its \u0022fairing,\u0022 and was loaded on the Wanderer under the watchful gaze of some \u0022advisors.\u0022 None of it made Gene very happy. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150106_ksp0517_eagle2.jpg\u0022 alt=\u002220150106_ksp0517_eagle2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Wanderer returned for a successful and safe landing four hours later. No further information was provided. The crew did of course line up for the customary post-flight photo-op. Some things never change. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150106_ksp0525_eagle2.jpg\u0022 alt=\u002220150106_ksp0525_eagle2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EThabit 4 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 322 - Lake Fortunate \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Zagoskin\u003C/p\u003E\u003Cp\u003EHeight: 22.8\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 50.4\u003C/p\u003E\u003Cp\u003ECost: 56.336\u003C/p\u003E\u003Cp\u003EAnother launch for the Planetary Science department, this time bound for Duna. As a late arrival to the mission payload, it was decided the Thabit 4 science satellite would have its own transfer vehicle. That also allowed for the completion of another outstanding contract: test the NTRs in Kerbin Orbit. (Which of course I completely forgot to do before sending it to Duna. The observant will also notice the complete lack of NTRs on said satellite. Hmm.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0530_thabit4.jpg\u0022 alt=\u002220150107_ksp0530_thabit4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor now it was just placed into a parking orbit, and we\u0027ll get back to it shortly.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0535_thabit4.jpg\u0022 alt=\u002220150107_ksp0535_thabit4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EWczesnie 145 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 383 - Sky\u0027s Reach Cosmodrome, Facility 11\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESpace Launch Consortium of the Highlands (SLCH)\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Wczesnie\u003C/p\u003E\u003Cp\u003EHeight: 30.0\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 113.4\u003C/p\u003E\u003Cp\u003ECost: 75,642\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0537_wcz145.jpg\u0022 alt=\u002220150107_ksp0537_wcz145.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnly the Rogue 18th KSA had launched from the Sky\u0027s Reach Cosmodrome in the years since the collapse of the CCHR. The leaders of the breakaway Republic of Kerzakhkerb, which claimed all lands between the Great River in the north and the deserts in the south, felt the time had come for their return to the stars. They reached an agreement with the junkyard company their predecessors had sold Sky\u0027s Reach to and set about making the ancient launchsite operational. If Highlanders were to join the Diophantus mission to Duna aboard the Kraken\u0027s Harvest, then they would launch from Sky\u0027s Reach or not at all. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0540_wcz145.jpg\u0022 alt=\u002220150107_ksp0540_wcz145.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Wczesnie 145 is just another in the long line of Wczesnie launches, a design that dates all the way back to the early years of the space race. Some modern polish had been applied to the design, some changes for stability, others only recently possible, but otherwise it was the same old ship. Overpowered and over-fuelled, it made its way to orbit and the Harvest with ease. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0545_wcz145.jpg\u0022 alt=\u002220150107_ksp0545_wcz145.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMilzer and Meldo had sent out invitations to every space program on the planet to join them on the Diophantus Mission to Duna. A seat was guaranteed to any two kerbals the other programs saw fit to send, and the Highlanders chose Danlong and Melden, both highly respected scientists in their respective fields. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0557_wcz145.jpg\u0022 alt=\u002220150107_ksp0557_wcz145.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs it so happens, they arrived at the Kraken\u0027s Harvest just a bit early. (And naturally right at sunset. What else would you expect from KSP?)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EHydra-2 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 386 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Hydra Custom\u003C/p\u003E\u003Cp\u003EOrbiter: Hydra Shuttle X-01\u003C/p\u003E\u003Cp\u003EHeight: 39.5\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 226.0\u003C/p\u003E\u003Cp\u003ECost: 184,361\u003C/p\u003E\u003Cp\u003EThe first official launch of crews for the Kraken\u0027s Harvest was also the final launch from Lake Fortunate for the so-called Rebel Space Agency. Half a year had transpired since the Kraken\u0027s Harvest had launched, so this launch was naturally in the middle of the night. \u003C/p\u003E\u003Cp\u003EMilzer and Meldo had gathered the crew in the conference room the previous day, giving them the rundown on exactly what would happen when. Afterwards they addressed the grounds crews and other facility personnel. Once the Hydra was clear of the tower, every kerbal left behind at Lake Fortunate would set about shutting down the facility and preparing it for being mothballed. Once complete, those who would prefer to keep working in the field were to head for the Southern Space Center and the ISC, where they were promised work. It was both a sad and happy day. \u003C/p\u003E\u003Cp\u003EQuietly and without much pomp, Milzer and Meldo went to the flagpole behind the Astronaut\u0027s complex to plant their flag. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp9052_flag.jpg\u0022 alt=\u002220150107_ksp9052_flag.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Do you think this\u0027ll still be here when we get back?\u0022 \u003C/p\u003E\u003Cp\u003E\u0022Why would somebody move our flag Meldo?\u0022\u003C/p\u003E\u003Cp\u003EHe waved his hand, motioning to include all of Lake Fortunate. \u0022I mean this whole facility, all these kerbals, all our friends. Will they come back when we do?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hard to say, M. Hard to say.\u0022 He glanced up at the reddening sky. \u0022Sun\u0027s about to go down. Let\u0027s get suited up.\u0022\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp9283_hydra2.jpg\u0022 alt=\u002220150107_ksp9283_hydra2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launch lit up the Lake and the surrounding hills, and was watched by every kerbal who had helped them along. They piled into carts, hung out atop buildings, and some even climbed atop the water tower just to watch. What with this being KSP though, where the exhaust of rockets produce nearly zero light, the actual launch lit up nothing. And I hadn\u0027t yet started fiddling with adding lights to the bottoms of rockets... so no pretty pictures. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E So enjoy that recreation instead.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0581_hydra2.jpg\u0022 alt=\u002220150107_ksp0581_hydra2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd then, just like that, the last remaining crews of the 18th Kerbal Space Agency had left Kerbin behind. Aboard the Hydra-2 were mission commanders Milzer Kerman and Meldo Kerman, along with Pilots Gersted, and Jebediah, Engineers Derbald, Gilvin, Podner, Billy-Bobford, and Bill, and Scientists Gusbrett, Mitwig, Sigcas, Mac and Bob.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0594_hydra2.jpg\u0022 alt=\u002220150107_ksp0594_hydra2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ERendezvous with the Harvest was easy enough. The Highlanders had already set about getting the ship rigged up and ready to fly, and had started turning the lights on in the cabins. The Hydra came in to dock at one of the ports adjacent to their Wczesnie. Meldo was hoping they hadn\u0027t already taken the good bunks. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0598_hydra2.jpg\u0022 alt=\u002220150107_ksp0598_hydra2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith so many ships coming and going, M\u0026amp;M decided the time was right for sending the construction bots and the refueller off to their fiery demise. The construction bots were already docked up with one another, so all they needed to do was jet over to the refueller and couple up. After that, the combined craft burned retrograde and reentered over the Desert Continent where it broke up and burned away. (Though two of the bots managed to survive reentry!)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0621_bots.jpg\u0022 alt=\u002220150107_ksp0621_bots.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow to bring the last of the crews up.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EISC-A2-02 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 387 - Southern Space Center\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESpace Agency of the ISC\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Custom A2\u003C/p\u003E\u003Cp\u003EHeight: 29.5\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 64.8\u003C/p\u003E\u003Cp\u003ECost: 45,567\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0639_isc-002.jpg\u0022 alt=\u002220150107_ksp0639_isc-002.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe second launch from the ISC was also victim of a poorly-lit night, though Newwin and Dercal weren\u0027t too concerned. It wasn\u0027t like they needed to see the empty air go by while they were leaving Kerbin, what with this being a fully automated crew taxi. They hardly even noticed the plane-change required to reach the Harvest in its 20 degree orbit from their 30 degree South launch site. And they arrived in no time at all.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0653_isc-002.jpg\u0022 alt=\u002220150107_ksp0653_isc-002.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEven with all these kerbals on board the Harvest there were still plenty of free bunks available. The ship can transport 96 on a bad day, and was kitted out well enough to handle this tiny crew of 20. \u003C/p\u003E\u003Cp\u003ESo as to not overtax the supercomputer this Universe simulation was running on, M\u0026amp;M decided to go ahead and undock the Hydra 2. It was then moved into a higher parking orbit, where it will remain until the Kraken\u0027s Harvest returns to Kerbin in several years time.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150107_ksp0666_hydra2.jpg\u0022 alt=\u002220150107_ksp0666_hydra2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBarvey in the SOCH\u0027s Wczesnie 145 also took the opportunity to bid his comrades farewell and return to Kerbin. landing safely in the ocean south of the Desert Continent. Likewise, the ISC-A2 was deorbited automatically, returning to the Southern Continent. Lots of free space around the Harvest, so we must be getting close to our transfer burn.\u003C/p\u003E\u003Cp\u003EWe still have one more crew to send up, though.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EOrenji-2 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 387 - Forgotten Islands Space-O-Plex\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EForgotten Islands Space Program\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Cantemir\u003C/p\u003E\u003Cp\u003EHeight: 25.3\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 114.0\u003C/p\u003E\u003Cp\u003ECost: 319,877\u003C/p\u003E\u003Cp\u003EAnd the final group for the Diophantus Mission are two kerbonauts from the Forgotten Islands: Deruki and Lorim. This will likely be the last launch from the Forgotten Islands Space-O-Plex as well, as Sensei Bo has rounded up his flock and is heading for the ISC to join their space program. Seems to be the popular harbor for out-of-work spacekerbs. This launch, however, still needed to be finished.\u003C/p\u003E\u003Cp\u003EAs with all the other crew launches for the Harvest, this one occurred at night. Because why not.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0681_orenji2.jpg\u0022 alt=\u002220150108_ksp0681_orenji2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe little Fuji craft found its way to the Harvest with ease, though Deruki couldn\u0027t decide which docking port he wanted to use. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0696_orenji2.jpg\u0022 alt=\u002220150108_ksp0696_orenji2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith all crews present and accounted for, the Diophantus Mission to Duna aboard the LDRS-02 Kraken\u0027s Harvest was ready to go! All it needed to do now was wait for the transfer window to open up....\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EEagle-3 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E\u002219th\u0022\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: S/EFT-3\u003C/p\u003E\u003Cp\u003EOrbiter: ORTHO-1 \u0022Wanderer\u0022\u003C/p\u003E\u003Cp\u003EHeight: 37.8\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 509.8\u003C/p\u003E\u003Cp\u003ECost: 262,679\u003C/p\u003E\u003Cp\u003EWe can\u0027t forget the Patriots, now can we? Their crew of five for the Osprey Mission were lined up and strapped in aboard the Wanderer: Mission Commander Dudry Kerman, Pilots Herhat and Jack Kerman, and Scientists Enlan and Donnie Kerman. Today\u0027s flight crew includes Danbus and Nelfen, the only two pilots qualified for the ORTHO.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0715_eagle3.jpg\u0022 alt=\u002220150108_ksp0715_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother near-nighttime kickoff. At least I already have lights placed around the KSC launchpad for just such an occasion.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0720_eagle3.jpg\u0022 alt=\u002220150108_ksp0720_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETypical shuttle ascent, with the solid rocket boosters cut off somewhere around the 12-13 kilometer mark. Following that the Wanderer glided to orbit underneath the large external fuel tank. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0738_eagle3.jpg\u0022 alt=\u002220150108_ksp0738_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ERendezvous with the Falconaerie and the Osprey took place at night, as usual, so the crew waited until sunrise to dock up. They used the docking adapter installed on the first Eagle flight, though with the Wanderer in this configuration it almost isn\u0027t needed. (In the original arrangement, the docking port in the cargo bay is flush against the crew cabin, making docking to a 2.5m part impossible.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0762_eagle3.jpg\u0022 alt=\u002220150108_ksp0762_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Osprey crews took a couple days to get everything transferred onto the ship, while the crews on the station packed their belongings ad prepared to return to Kerbin. The Falcons that brought them were about to be retired, and without a craft for an emergency exit Gene and the other ground controllers didn\u0027t want crews on the station. And the station lifeboats weren\u0027t scheduled for completion for another year.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0763_eagle3.jpg\u0022 alt=\u002220150108_ksp0763_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo with everything situated, the crews said their final goodbyes and went their separate ways. The Wanderer backed away from the station with a gentle push of RCS, and that was that. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0769_eagle3.jpg\u0022 alt=\u002220150108_ksp0769_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe reentry burn had them targeting a short reentry, coming in for a 90-degree landing at KSC again. That approach had worked well for the classified Eagle-2 mission, and it was planned to use it on all future landings. As typical, the Wanderer was turning the air to plasma over K2, providing a night light show for the goats and monks that live atop the mountain.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0793_eagle3.jpg\u0022 alt=\u002220150108_ksp0793_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanding the Wanderer involves these wonderful 30 degree downpitch descents. They can be a bit unnerving, but are essential for maintaining proper airspeed. Much less and the craft can go into a flat spin. Here it is on approach to the space center.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0797_eagle3.jpg\u0022 alt=\u002220150108_ksp0797_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd the final landing requires a flare to all-but force the craft to stall out. It drops down pleasantly on its back tires afterwards, and the slightly complicated trip is over. Another reusable shuttle recovered, 50 percent intact.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0800_eagle3.jpg\u0022 alt=\u002220150108_ksp0800_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe crew of the returning Eagle-3, lined up for the obligatory post-flight photo. From left to right: Jervan, Sigley, Anny, Danbus, Donmore, and Nelfen Kerman.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150108_ksp0809_eagle3.jpg\u0022 alt=\u002220150108_ksp0809_eagle3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EThe teams are all on the field and the crowds are cheering like lunatics, so let\u0027s get this Duna party started!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EThabit 4 Departure Burn\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 38 - Low Kerbin Orbit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFirst out of the gate is the Thabit 4. This probe was sent along early to conduct some initial surveys and to have maps and photos ready for then the Harvest arrived a few munths afterward. It had been sitting in a parking orbit for a good long time now.\u003C/p\u003E\u003Cp\u003EOf course its transfer burn was 100% in the dark, so there are no photos. Here\u0027s a shot of it leaving Kerbin behind.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150112_ksp0822_thabit4.jpg\u0022 alt=\u002220150112_ksp0822_thabit4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKraken\u0027s Harvest Departure Burn\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 150 - Low Kerbin Orbit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDiophantus Mission - International Kerbal Explorers (IKE)\u003C/p\u003E\u003Cp\u003EAnd the coin flip goes to the Rebels and the Kraken\u0027s Harvest. They opted for first possession, and set up their burn for about 4 hours before the transfer window. Leaving from an inclined orbit puts them at a bit of a disadvantage, but it\u0027s nothing their secondary isn\u0027t expected to be able to handle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150112_ksp0834_kh.jpg\u0022 alt=\u002220150112_ksp0834_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Kraken\u0027s Harvest was designed to make the transfer to Duna with a single burn, and that\u0027s exactly how it was done here. The eight NTRs burned for 8 minutes and 52 seconds resulting in a change in velocity of 1019m/s. That meant part of the burn was done with the ship pointing towards Kerbin, but that was accounted for with the higher than normal parking orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150112_ksp0839_kh.jpg\u0022 alt=\u002220150112_ksp0839_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ship rattled a bit during the burn, with some of the less-than-perfectly-docked joints exposing some gaps. This game REALLY needs docking ports that lock together physically instead of using magic like magnetic force to stay together. And I could have assembled it a bit better, too.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150112_ksp0853_kh.jpg\u0022 alt=\u002220150112_ksp0853_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENine minutes later and the Kraken\u0027s Harvest was intercepted by Duna, bringing their possession for the first quarter to a close. Expected arrival time in 290 days. Pretty ugly periapsis at Duna there, but the team is expected to make some adjustments between the first and second quarter.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150112_ksp0857_kh.jpg\u0022 alt=\u002220150112_ksp0857_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EOsprey Departure Burn\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 150 - Low Kerbin Orbit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOsprey Mission - \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u002219th\u0022\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150112_ksp0860_osprey.jpg\u0022 alt=\u002220150112_ksp0860_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESecond possession of the first quarter goes to the Osprey and it crew of Patriots. With similar vessel characteristics to the Harvest, the Osprey is also capable of completing the Duna transfer in a single burn. Being considerably smaller and in a less-inclined orbit, the Osprey only needed 5 minutes 10 seconds and 992m/s to complete its transfer to the Duna endzone.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150112_ksp0865_osprey.jpg\u0022 alt=\u002220150112_ksp0865_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFive minutes later and the Osprey was also intercepted by Duna. Total transfer time: 271 days. Meaning the Patriots aboard the SeaHawk (Osprey) have the lead at the end of the first quarter. The experts in the booth tell us the higher-inclination orbit of the Rebels is what caused them to fall behind in the first 15 minutes of play, but advise it might come to help them later as they chose their landing sites.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150112_ksp0870_osprey.jpg\u0022 alt=\u002220150112_ksp0870_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow back to the studio for this word from our sponsors....\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003ERelax. Peaceful nothingness awaits you. Relax and watch as the stars gently tumble around you. Relax and drift off into the best sleep of your life. Relax.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0872_harvest.gif\u0022 alt=\u002220150201_ksp0872_harvest.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EJoin us at the Red Dust Duna Resort, where kerbals go to Relax.\u003C/p\u003E\u003Cp\u003E(And for those of you who like vegging-out in HD: \u003Ca href=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0872_harvest_lg.gif\u0022 rel=\u0022external nofollow\u0022\u003E1600x1000\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EWhat the Future Brings....\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EWinter\u003C/span\u003E Release is coming, all too soon, but the changes it brings are most welcome. Especially the change to stock aerodynamics. And resources (or at least Regolith), finally, which will make craft like the Kraken\u0027s Harvest even more useful. Suddenly everywhere except Moho is within reach provided I send out a refinery ahead of time. \u003C/p\u003E\u003Cp\u003EAnd yet I\u0027m split.... Largely because I had intended to start over completely when Release arrived. Y\u0027know, many months from now, not just around the corner as it now seems. And yet there are things I still want to do and finish with this save. We\u0027re a long way away from Duna, and I really want to finish these two expeditions. There\u0027s still the crew bound for Jool to consider, and some other things that have been put in motion that will become clear in the next couple of updates. And yet many of the upcoming changes will completely break things, especially aero. So I have some thinking to do. \u003C/p\u003E\u003Cp\u003EFor now though, I\u0027ll just sit here and be hypnotized by the Kraken\u0027s Harvest as it spins its way away from Kerbin..........\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:26:05Z\u0022 title=\u002206/21/2015 10:26  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ElJugador","CreatedById":18783,"CreatedDateTime":"2015-02-02T00:10:19Z","Content":"\n\u003Cp\u003EWhoo! Whatta pair of updates. I don\u0027t think there\u0027s really that much to worry about. 1.0 is still a couple months away. And you have a decent amount of spare time, right? Just relax, believe in yourself, you\u0027ll finish these before the big one-point-oh update is out, I think everyone knows you can. And development won\u0027t end there ...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-02T00:13:27Z\u0022 title=\u002202/02/2015 12:13  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 2, 2015\u003C/time\u003E by ElJugador\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-02-02T00:45:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ElJugador\u0022 data-cite=\u0022ElJugador\u0022\u003E\u003Cdiv\u003EWhoo! Whatta pair of updates. I don\u0027t think there\u0027s really that much to worry about. 1.0 is still a couple months away. And you have a decent amount of spare time, right? Just relax, believe in yourself, you\u0027ll finish these before the big one-point-oh update is out, I think everyone knows you can. And development won\u0027t end there ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. And hey - I\u0027ve got all the time in the world. This week. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Worse comes to worst I\u0027ll just leave 0.90 installed and \u0022finish\u0022 out what I\u0027ve got in the works. I already (kinda, sorta, maybe) have a transition plan in place, so no worries. I\u0027ll just have to unreef the sails and see where the solar winds take things.\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2015-02-02T21:09:13Z","Content":"\n\u003Cp\u003EI encourage you to keep this going, at least to a point where you\u0027re happy. Heck, I\u0027m still nursing a save along in .24, having started it back in .19 or .20...\u003C/p\u003E\u003Cp\u003EAlso, awesome post(s)/ship(s). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-02-02T22:45:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commander Zoom\u0022 data-cite=\u0022Commander Zoom\u0022\u003E\u003Cdiv\u003EI encourage you to keep this going, at least to a point where you\u0027re happy. Heck, I\u0027m still nursing a save along in .24, having started it back in .19 or .20...\u003Cp\u003EAlso, awesome post(s)/ship(s). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks!\u003C/p\u003E\u003Cp\u003EI\u0027m going to take a cautious \u0022wait and see\u0022 approach as to what breaks with all the aero changes and part rebalances, and just keep trucking for now. Besides, I have an idea..... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Or I suppose I could say I\u0027ve had ideas and options about how to handle this for several months now and have nearly decided on one particular one. We shall see....)\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2015-02-04T05:47:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022 data-cite=\u0022Cydonian Monk\u0022\u003E\u003Cdiv\u003EThanks!\u003Cp\u003EI\u0027m going to take a cautious \u0022wait and see\u0022 approach as to what breaks with all the aero changes and part rebalances, \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom the looks of your planes, they\u0027ll probably fly fine with the new areo model, heck, they\u0027d probably fly just fine with FAR. And I don\u0027t think the part rebalance is going to be too drastic. Worst comes to worst, you can edit some save files.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-02-04T15:16:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003EFrom the looks of your planes, they\u0027ll probably fly fine with the new areo model, heck, they\u0027d probably fly just fine with FAR. And I don\u0027t think the part rebalance is going to be too drastic. Worst comes to worst, you can edit some save files.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have it on good authority that my shuttle flys a bit _too_ well in FAR.... So well that it can barely reenter if one is also using Deadly Reentry. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E The more I think about it and the more I hear about the new aero, the more I realize there may not be too many issues. It\u0027ll be the part rebalancing that kills things if anything.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-02-20T03:27:45Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EAd Lunam - By The Dying Light of The MÃƒÂ¼n\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EEagle-4 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 154 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003E\u002219th\u0022\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: S/EFT-4\u003C/p\u003E\u003Cp\u003EOrbiter: ORTHO-1 \u0022Wanderer\u0022\u003C/p\u003E\u003Cp\u003EHeight: 37.8\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 518.7\u003C/p\u003E\u003Cp\u003ECost: 282,679\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150122_ksp0000_eagle4.jpg\u0022 alt=\u002220150122_ksp0000_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe time has come to expand the Falconaerie, for no other reason than \u0022because it\u0027s there\u0022 and \u0022building stations is what a shuttle does.\u0022 At present the long-term crew capacity of the station is a measly 4, so Gene and Wernher thought it best to send up a small habitat module. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150122_ksp0018_eagle4.jpg\u0022 alt=\u002220150122_ksp0018_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEagle 4 was another routine launch of the Wanderer, and ascended gracefully into the heavens atop a jet of hot glowing death. At the helm was our veteran pilot Danbus, with Jervan, Geneble and Donmore along to help with the installation of the new module. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150122_ksp0025_eagle4.jpg\u0022 alt=\u002220150122_ksp0025_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launch vehicle only needed one minor tweak to change fuel flow in the external tank. The new hab module isn\u0027t too much on the heavy side, so the tank was configured for \u0022medium\u0022 payloads. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150122_ksp0039_eagle4.jpg\u0022 alt=\u002220150122_ksp0039_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe habitat module itself was mostly empty space. Two hitchhiker units (which I rate at 2-kerbals each for long-term occupation), a short structural tunnel, and some extra batteries and supplies storage. Were I still using TAC that would be O2 and H2O instead of monoprop. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150122_ksp0069_eagle4.jpg\u0022 alt=\u002220150122_ksp0069_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENew on this trip were several small cameras in the cargo bay. They weren\u0027t too useful for docking, what with the giant module in the way, and I need to tweak their positions to get prettier shots. The new habitat module was installed adjacent to the laboratory, and will serve as the bunk space for the next interplanetary crew while they await construction of their ship. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150123_ksp0073_eagle4.jpg\u0022 alt=\u002220150123_ksp0073_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe crew of 4 spent a few days at the Falconaerie getting everything installed and hooked up. There hasn\u0027t been a regular crew here for some time, as I\u0027m between versions of HGR and haven\u0027t worked out an \u0022escape boat\u0022 design I\u0027m happy with. Maybe I\u0027ll go back to the Radish/Falcon once OrionKerman has released the newer one. Maybe I\u0027ll use the Tantares Gemini instead. Or maybe I\u0027ll work out a stock solution using the Spaceplane\u002B parts. Not sure yet. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150123_ksp0081_eagle4.jpg\u0022 alt=\u002220150123_ksp0081_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EReentry was tough this time around, and Danbus grossly overshot KSC. The Wanderer was still moving around 1,600m/s when it cruised overhead. Hmm. Can\u0027t ditch in the ocean because water is death. Not high enough to make the next major landmass. This is a problem. Our veteran pilot put the ship in a fairly steep dive and managed to only be 20kms out once the ship was back in the thickest part of the soup. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150123_ksp0086_eagle4.jpg\u0022 alt=\u002220150123_ksp0086_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESoon enough the Wanderer was banking around towards KSC and a decision had to be made: Abort landing to the island airstrip, or continue back to KSC and maybe fall short. Unfortunately the craft also had a say in the matter....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150123_ksp0087_eagle4.jpg\u0022 alt=\u002220150123_ksp0087_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJust a few degrees from being aligned with KSC the ship pitched violently upwards. (Insert choice of 4-letter nautical term here.)! \u0022I\u0027ve used this maneuver at least 6 times now!\u0022 screamed our usually level-headed pilot. \u0022Why?!\u0022 The Wanderer still had some fuel left over from orbital operations, and its stunned and irritated pilot somehow managed to regain control using the OMS engines... a mere 100m above the ocean. (Dark magic and witchcraft I tell ya.)\u003C/p\u003E\u003Cp\u003EIsland landing it is. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150123_ksp0089_eagle4.jpg\u0022 alt=\u002220150123_ksp0089_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDanbus collected his wits and somehow convinced the misbehaving orbiter to move into an approach on the island, and things were looking good...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150123_ksp0095_eagle4.jpg\u0022 alt=\u002220150123_ksp0095_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E... except it came down cross-wise, blew out one of the rear tires, and started tumbling and exploding. Ahh! AHHHHH!!!! \u003C/p\u003E\u003Cp\u003EEver play pinball? Air hockey? Well, that\u0027s what the cockpit of the Wanderer was doing, banging around inside that old hanger. If the crew hadn\u0027t been strapped in as well they likely would\u0027ve been doing the same inside. Thankfully (ha!) the ship had crashed while moving towards the hanger, otherwise the crew compartment might well have been lost. (There\u0027s a bit if a glitch with the position of the island runway when using RSS... and a steep drop off of the edge.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150123_ksp0098_eagle4.jpg\u0022 alt=\u002220150123_ksp0098_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA quick break and a change of shorts later, and all 4 of our very lucky crew climbed out of the wreckage. These kerbals, I tell ya, sometimes they\u0027re hardy little dudes. \u003C/p\u003E\u003Cp\u003EObligatory post-flight photo. No clue who\u0027s who, given the quick change in flight suits. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150123_ksp0102_eagle4.jpg\u0022 alt=\u002220150123_ksp0102_eagle4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe accident investigation board has been formed, and they\u0027ve all but shut down operations at Cape Kerbal. It\u0027ll certainly be awhile before another shuttle is launched, as the Wanderer was still the only bird in the flock. The additional two orbiters under construction will be held, pending likely design changes. \u003C/p\u003E\u003Cp\u003EThere\u0027s very little chance the 19th KSA will have the next interplanetary ship ready before the Eve transfer window. \u003C/p\u003E\u003Cp\u003EPersonally, I\u0027ve got no clue what caused this. It wasn\u0027t like I stalled or went into a flat spin. Instead it _felt_ like the CoL was suddenly way ahead of the CoM, which is almost impossible given how I\u0027ve got the wing designed. Strange magics and dark powers, these Krakens. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EISC-A2-03 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 172 - Southern Space Center\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESpace Agency of the ISC\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Custom A2\u003C/p\u003E\u003Cp\u003EHeight: 27.7\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 67.2\u003C/p\u003E\u003Cp\u003ECost: 44,085\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150124_ksp0001_a2mun.jpg\u0022 alt=\u002220150124_ksp0001_a2mun.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile, down on the South Continent the ISC continued to pursue its space program, with some help from the grounds and operations crews of the old \u0022Rebel\u0022 18th KSA. A MÃƒÂ¼n landing is the goal all space programs reach for, and the next step for the ISC was to complete a MÃƒÂ¼nar flyby. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150124_ksp0015_a2mun.jpg\u0022 alt=\u002220150124_ksp0015_a2mun.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJaysef from the Forgotten Islands was aboard as pilot, with Lodrigh Kerman on hand to fix anything that might break. The A2 capsule had so far proven to be quite reliable, so there was a good chance Lodrigh was just along for the ride. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150124_ksp0023_a2mun.jpg\u0022 alt=\u002220150124_ksp0023_a2mun.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe second stage of the Custom-A2 launch vehicle had almost enough to complete the MÃƒÂ¼nar transfer, but ultimately fell a bit short and the A2 needed to help itself along. Oh well, just some new space debris. Eventually I\u0027ll need to send a few crews up with claws to clean up space. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150124_ksp0027_a2mun.jpg\u0022 alt=\u002220150124_ksp0027_a2mun.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe extra burn time from the split Trans-Munar Injection meant the free-return trajectory was slightly less than optimal. Jaysef needed to perform a short burn on the far side of the MÃƒÂ¼n to bring them back to a proper return intercept. Meanwhile Lodrigh was busy taking readings and making other engineering observations. Or whatever it is kerbal engineers do when not learning how to tie their shoes. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150124_ksp0031_a2mun.jpg\u0022 alt=\u002220150124_ksp0031_a2mun.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe return trajectory placed the A2 perfectly inside the borders of the ISC. The Southern Space Center was the original target, but any landing that\u0027s not inside enemy territory is a good landing. Especially if you can walk away from it. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150124_ksp0036_a2mun.jpg\u0022 alt=\u002220150124_ksp0036_a2mun.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EPosing for the always popular post-flight photo: Lodrigh on the left and Jaysef on the right. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150124_ksp0046_a2mun.jpg\u0022 alt=\u002220150124_ksp0046_a2mun.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EWczesnie 146 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 181 - Sky\u0027s Reach Cosmodrome, Facility 11\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESpace Launch Consortium of the Highlands (SLCH)\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Wczesnie\u003C/p\u003E\u003Cp\u003EHeight: 31.6\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 115.4\u003C/p\u003E\u003Cp\u003ECost: 86,529\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0059_wcz146.jpg\u0022 alt=\u002220150126_ksp0059_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESpace junk is a serious matter. Left unattended, satellites and spent stages have the potential to transform otherwise tranquil orbits into a Kafka-esque nightmare. So when a series of \u0022deorbiting\u0022 contracts fell on the desk of the Commissioner of Space Operations at Sky\u0027s Reach, he felt it was his duty to accept them and complete them. Besides, it\u0027d give the recently restarted space agency in the Highlands some much needed funds. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0072_wcz146.jpg\u0022 alt=\u002220150126_ksp0072_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother Wczesnie was plucked from atop the bottomless pile of ICBMs and converted to include the standard crew capsule and a new Tantares functional cargo block. This required a small amount of reconfiguration, and left the craft a bit shorter than normal on its Ã¢Ë†â€ v budget. More than enough to reach and deorbit its first target. Pilot Barvey and Engineer Joegard were activated for this mission, and spent all of five minutes in training. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0075_wcz146.jpg\u0022 alt=\u002220150126_ksp0075_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe FCB has proven to be a nice way to sneak a claw into orbit. Also works well on a ship that also needs a launch escape system, such as the Wczesnie. Below we can see the ClawSat moving out of the FCB under its own power, and the Wczesnie 146 moving to dock with it. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0083_wcz146.jpg\u0022 alt=\u002220150126_ksp0083_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe target of today\u0027s contract is an unauthorized satellite launched by a certain rogue space agency: the Thabit 3. Nobody on the ground was exactly sure what this satellite was doing, but they had some ideas. Espionage. Orbital weapons. Tofu. Either way it had to go. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0100_wcz146.jpg\u0022 alt=\u002220150126_ksp0100_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ship \u0022clawed\u0022 the satellite and Joegard ventured out to hook up some fuel lines and sever certain control circuits. He found a distinct lack of cameras, weapons, and bean curd, but felt it best to not publicly embarrass anyone on the ground by bringing that up. This was a dangerous satellite and it simply must go. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0108_wcz146.jpg\u0022 alt=\u002220150126_ksp0108_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Wczesnie 146 refueled from what little propellents the satellite had left, and set it on a fatal descent. Barvey unlatched the Claw, undocked from it, and burned back into a safe orbit. They were able to confirm the destruction of the rogue object by watching it burn up well below them. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0116_wcz146.jpg\u0022 alt=\u002220150126_ksp0116_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0126_wcz146.jpg\u0022 alt=\u002220150126_ksp0126_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFollowing the fireworks they set up a course for home, landing just south of Sky\u0027s Reach. Mission accomplished! The skies are safe again!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150126_ksp0147_wcz146.jpg\u0022 alt=\u002220150126_ksp0147_wcz146.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EWczesnie 147 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 182 - Sky\u0027s Reach Cosmodrome, Facility 11\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESpace Launch Consortium of the Highlands (SLCH)\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Wczesnie\u003C/p\u003E\u003Cp\u003EHeight: 35.6\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 133.4\u003C/p\u003E\u003Cp\u003ECost: 92,929\u003C/p\u003E\u003Cp\u003ENot quite so fast. The commissioner of the SLCH advised Barvey and Joegard to not get too comfortable, as there was still a second rogue satellite to deal with. This time in a day-long nearly circular polar orbit. So the Wczesnie 147 was prepped and fitted out with a slightly leaner second stage to help make it to the higher orbit of this satellite. Even then they\u0027d need to siphon-off fuel to properly deorbit their target. By some unknown necessity this was a night launch, so here\u0027s an entirely fake night-vision shot:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150128_ksp0151_wcz147.jpg\u0022 alt=\u002220150128_ksp0151_wcz147.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBarvey and Joegard were afforded little to no rest and zero extra training for this mission. \u0022It\u0027s the same as what you just flew. How much training could you need?\u0022 The lack of sleep could explain why they decoupled from the second stage while it still had some propellent remaining. Might also explain why they shot off into orbit without remembering to dock with the claw... which they had to go back for. Nothing like wasting fuel when you\u0027re already on a budget. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150128_ksp0156_wcz147.jpg\u0022 alt=\u002220150128_ksp0156_wcz147.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EClaw retrieved they set out for their target: a large satellite in a nearly perfect polar orbit. Messenger. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150128_ksp0162_wcz147.jpg\u0022 alt=\u002220150128_ksp0162_wcz147.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Looks like a big mouse, doesn\u0027t it? Gold floppy ears and an antenna for a nose.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Maybe mutant capitalist mouse with four mutated ears, Joegard.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150128_ksp0165_wcz147.jpg\u0022 alt=\u002220150128_ksp0165_wcz147.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinding a place to grab this satellite proved difficult, and they eventually settled on a spot just above a large solar array. (Which eventually broke off.) Joegard once again got out to hook up lines and cut power to the control circuitry, and once again found a distinct lack of offensive content. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150128_ksp0167_wcz147.jpg\u0022 alt=\u002220150128_ksp0167_wcz147.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA contract is a contract though, so after draining the Messenger of its fuel the crew set about removing it from the skies. Which made for another interesting light show.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150128_ksp0168_wcz147.jpg\u0022 alt=\u002220150128_ksp0168_wcz147.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150128_ksp0174_wcz147.jpg\u0022 alt=\u002220150128_ksp0174_wcz147.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELike the Wczesnie 146, the 147 landed just a few kms from Sky\u0027s Reach. They could probably walk home from this landing too, but decided instead to wait around for a pickup. And maybe get some sleep.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150128_ksp0217_wcz147.jpg\u0022 alt=\u002220150128_ksp0217_wcz147.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EHawk 2 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 185 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003E\u002219th\u0022\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Hawk\u003C/p\u003E\u003Cp\u003EHeight: 56.6\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 376.4 \u003C/p\u003E\u003Cp\u003ECost: 215,603\u003C/p\u003E\u003Cp\u003EWith their normal operations curtailed and the Erne mission to Eve on hold, an opportunity was presented to Gene and Wernher to finally launch the Hawk 2 MÃƒÂ¼n mission. The Hawk launch vehicle they had stacked up in the VAB had been planned for use on the large interplanetary stage of the Erne, but a quick change was all that was needed to mount the Hawk 2 payload to it instead.\u003C/p\u003E\u003Cp\u003EWernher was less than thrilled with the idea though, to the point of refusing to go along with it, so Gene had to give the orders himself. He only informed a handful of personnel of the launch - just those that needed to know. That secrecy would go out the window as soon as the craft was rolled to the pad and launched, so both rollout and launch were scheduled to occur under the cover of darkness. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0187_hawk2.jpg\u0022 alt=\u002220150129_ksp0187_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0199_hawk2.jpg\u0022 alt=\u002220150129_ksp0199_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJervan, Geneble, and Anny, the three kerbonauts chosen by Gene as the most reliable and trustworthy, were well on their way to the MÃƒÂ¼n before anyone further up the chain of command was aware of the launch. Gene had some autonomy in decision making, and this mission had been greenlit and built-out many mÃƒÂ¼nths before. Except that he\u0027d been explicitly told to put it aside until the Duna mission was prepared and underway. And then again until the Eve mission was launched. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0218_hawk2.jpg\u0022 alt=\u002220150129_ksp0218_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe watched as the crew set about \u0022extracting\u0022 themselves from the launch fairings. The Hawk 2 was a bit different, in that it would use the MÃƒÂ¼nar transfer stage to complete the capture and the first parts of the lander\u0027s descent. That would give them enough propellent to work in the highly-inclined orbit required to reach the second landing site. So instead of extracting the MEM from the transfer stage, the command module extracted itself, and spun around to dock.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0225_hawk2.jpg\u0022 alt=\u002220150129_ksp0225_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith that maneuver complete, Gene retired to his office. He was there when the Senator and his aides burst in unannounced. \u0022You\u0027ve really done it this time!\u0022 The Senator had all but thrown the door open, and moved angrily towards Gene flanked by his ever-present assistants.\u003C/p\u003E\u003Cp\u003E\u0022Senator,\u0022 Gene motioned towards the chairs on the opposite side of his desk. \u0022Please, have a seat.\u0022 \u003C/p\u003E\u003Cp\u003E\u0022No! No more seats! And no more kid gloves. Look, we\u0027ve tried everything with you. Memory wipes, ostracization, hard labour, more memory wipes. You name it, it\u0027s been tried. Now for some fool reason the rest of the Council wants you alive. Why? I\u0027ll never understand. But me? I think it\u0027s high time we try something a bit more,\u0022 he glanced back at his aides, \u0022permanent. Boys?\u0022\u003C/p\u003E\u003Cp\u003EGene started to back away from his desk as the two advanced. They reached inside their jackets, pulled out two tasers, grinned, then turned quickly to face the Senator. \u0022What in the name of the Kraken is going on here?\u0022 The aides glanced at each other, one of them shrugged, then they simultaneously zapped him. \u003C/p\u003E\u003Cp\u003EGene was dumbstruck. One of the kerbals was searching the crumpled mass on the floor and looked up to the other. \u0022Think you could\u0027ve waited a bit longer there Pods? Sheesh.\u0022 \u003C/p\u003E\u003Cp\u003E\u0022I thought that was your job!\u0022 He kicked the Senator to make sure he was out then turned to Gene. \u0022Gene Kerman? I\u0027m Podoly. This is Lengee. We used to fly for you, back... before.\u0022 He kicked the Senator again to make sure he wasn\u0027t faking. \u0022We\u0027re a bit short on time so I\u0027ll save the rest for later. Please come with us.\u0022\u003C/p\u003E\u003Cp\u003EGene grabbed a few things from his desk and stuffed his pockets. \u0022Are you the rebels?\u0022\u003C/p\u003E\u003Cp\u003ELengee laughed. \u0022Rebels? Dude doesn\u0027t know.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Gene, the rebel nations are all fakes. Just more arms of the Council reaching out to keep Kerbin in its stranglehold. No no, we\u0027re the Resistance. Which, well, I guess, yes. That makes us the rebels.\u0022 Podoly looked at his watch. \u0022We\u0027ve got to go. Now.\u0022\u003C/p\u003E\u003Cp\u003EThey ran through the halls of mission control to a specific emergency exit, their escape route seemingly planned in advance. Outside a small cart was waiting and all three climbed aboard. They wheeled towards the hanger as fast as the cart would go, electric motors sparking and whining in a way no electric motors should ever spark or whine. Podoly touched his ear (wherever that is) and spoke into the air. \u0022Copy that Mother, headed your way now.\u0022 \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp0007_extract.jpg\u0022 alt=\u002220150208_ksp0007_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere were no planes on the tarmac. Gene had expected to see something. Anything. \u0022Where are we going?\u0022 No response. They squealed onto the runway, the small cart\u0027s tires gripping as best they could, and hauled _it_ eastbound along the center stripe. A rumble and more squeals behind them prompted Gene to look back. \u0022There\u0027s a plane landing! Are you mad?!\u0022\u003C/p\u003E\u003Cp\u003EA strong hand pulled him back into the cart and strapped him into his seat. \u0022Chill, man! That\u0027s our ride! Hold on to something and keep your head down!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp0008_extract.jpg\u0022 alt=\u002220150208_ksp0008_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022What!?\u0022 The plane was roaring ever closer. Gene could hear the screech of the tires and the scraping of metal as it barreled down the runway towards them. \u0022What about Wernher and Carl?\u0022 he screamed. Lengee shook his head and tapped at his ear. The jets behind them were reversed and loudly clawing at the think Kerbin air. A shadow passed over and seconds later they were bouncing violently upwards and backwards. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp0018_extract.jpg\u0022 alt=\u002220150208_ksp0018_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETheir \u0022ride\u0022 pitched up quickly, throwing them to the back of the cargo bay with a crash. Gene cracked his head on something, the pain causing a bright flash of light. The ramp closed and darkness swallowed everything.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp0033_extract.jpg\u0022 alt=\u002220150208_ksp0033_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen Gene came to they were flying South over the open ocean. Someone had dragged him to a seat at the front of the cargo bay and applied a bandage to the side of his head. He felt it, groaned when the pain flashed through him, then looked around. The cargo bay was empty, save for the wreckage of the cart and the kerbal sitting next to him. Carl Kerman, chief of RATS.\u003C/p\u003E\u003Cp\u003E\u0022I had wondered when you\u0027d come back to us. That was quite a bad bump you had, and not the smoothest extraction.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Carl.\u0022 Gene tried to stand up, but slumped right back down, missing his seat. \u0022How did you get here? Where\u0027s Wernher?\u0022\u003C/p\u003E\u003Cp\u003E\u0022He doesn\u0027t know.\u0022 somebody whispered. Gene looked across the plane to see two kerbals in the shadows he\u0027d missed for his grogginess.\u003C/p\u003E\u003Cp\u003E\u0022Know what?\u0022 Gene looked around quickly. \u0022What aren\u0027t you telling me?\u0022\u003C/p\u003E\u003Cp\u003ECarl patted him on the shoulder and helped him back into the jumpseat. \u0022Don\u0027t worry about it. We extracted Wernher earlier. Here.\u0022 Carl put a nice set of earphones on Gene\u0027s head. \u0022This music should help you relax. We\u0027ll be safe soon enough.\u0022\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/io0uqrp9dco\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EHere\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E or \u003C/span\u003E\u003Ca href=\u0022https://soundcloud.com/yael-wolfenson/ella-fitzgerald-louis\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ehere.\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe music was indeed quite relaxing, something from a long-forgotten memory. A dark room? Rows of dim lights overhead? In no time at all Gene was asleep, all the worries of the day left far, far behind. As though they were only a dream.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150219_ksp0559_extract.jpg\u0022 alt=\u002220150219_ksp0559_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EHawk 2 Landing\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 78 day 155 - Surface of the MÃƒÂ¼n\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003E\u002219th\u0022\u003C/span\u003E Kerbal Space Agency (?)\u003C/p\u003E\u003Cp\u003EAnny was all set up to perform the MÃƒÂ¼nar capture burn when Jervan pushed him out of the seat. \u003C/p\u003E\u003Cp\u003E\u0022Hey!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Sorry pal, you\u0027re not a pilot anymore. Forget already? I\u0027d hate for you to end up crashing us into the MÃƒÂ¼n or something.\u0022 Anny growled back and moved into the lower seat. Jervan almost felt sorry for the kid. It really wasn\u0027t Anny\u0027s fault they\u0027d taken his wings away, just a result of an audit revealing his name had been a typo all along. Not that anyone had told Anny that. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0231_hawk2.jpg\u0022 alt=\u002220150129_ksp0231_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the capture burn complete, Jervan and Geneble set about preparing the lander for their descent. Jervan nudged his engineer while going over the final system checklist. \u0022Think this thing\u0027ll actually work? It\u0027s been in storage for some time now.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Just a couple years. Should be fine. Those capsules Jeb the Junker sells have been sitting in storage for a few decades and they seem to work.\u0022\u003C/p\u003E\u003Cp\u003EAll checks complete so Jervan pulled the hatch shut. \u0022We\u0027ll be back in a few hours Anny. Don\u0027t go touching the flight controls without us, ok?\u0022\u003C/p\u003E\u003Cp\u003E\u0022You take too long I might just come down there after you. Don\u0027t think I won\u0027t.\u0022\u003C/p\u003E\u003Cp\u003EAnd with that they were off. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0241_hawk2.jpg\u0022 alt=\u002220150129_ksp0241_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDescent was easier than usual with the powerful transfer stage. Previous MÃƒÂ¼n mission had needed to burn continuously until touchdown. They were able to complete the descent in two short burns. The Hawk 2 could\u0027ve landed on the transfer stage, but Jervan cur it off short of the target.\u003C/p\u003E\u003Cp\u003E\u0022Geneble, you won\u0027t believe what I\u0027m seeing down here. Get the camera. I\u0027m going to hover over the site.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0252_hawk2.jpg\u0022 alt=\u002220150129_ksp0252_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBelow them was the largest vessel either had ever laid their eyes on. A deep slate grey, giving off a metallic sheen. Nearby was what looked to be an entrance to a tunnel and another small, obviously kerbal-built lander.\u003C/p\u003E\u003Cp\u003E\u0022What does this mean?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well, for starters it means Anny and Herhat weren\u0027t the first kerbals on the MÃƒÂ¼n. But I guess we knew that.\u0022 He twisted the lander around again to get a better look at the larger craft. \u0022Get strapped in. I\u0027m going to bring us down between the other lander and this hatch-looking thing.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0256_hawk2.jpg\u0022 alt=\u002220150129_ksp0256_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGeneble was first to exit, given he was sitting closest to the \u0022egress/ingress hatch.\u0022 It was a term he liked to sprinkle into polite conversation to sound educated, as simpler words like \u0022door\u0022 or \u0022round thing\u0022 were simply too pedestrian and too... foreign. \u003C/p\u003E\u003Cp\u003E\u0022Wow. Look at the old lander!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Engineers\u0022 Jervan huffed as he closed the round thing and made his way down the ladder. \u0022You\u0027re all the same. Fly halfway across the galaxy to find a clearly alien ship, and the only thing you\u0027re interested in is the ancient MÃƒÂ¼n lander sitting next to it.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0260_hawk2.jpg\u0022 alt=\u002220150129_ksp0260_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Why is it still here?\u0022 Geneble climbed onto the craft a checked the cabin. \u0022Nobody\u0027s inside. What happened to the crew?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well, we could follow the footprints.\u0022 Jervan looked down at the regolith. \u0022If there were any. Strange. Maybe they\u0027re inside that base thing?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0263_hawk2.jpg\u0022 alt=\u002220150129_ksp0263_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA few hops later and they were over at the hatch. Jervan climbed onto the door and started wrenching it open. \u0022This is creepy. Why are the lights still on? And this panel? Looks like an airlock.\u0022\u003C/p\u003E\u003Cp\u003E\u0022It\u0027s probably using radiation as an energy source. A radioisotope thermoelectric generator or something like it.\u0022 It was a word Geneble had heard in school, and it sounded good. \u003C/p\u003E\u003Cp\u003E\u0022Maybe.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150129_ksp0270_hawk2.jpg\u0022 alt=\u002220150129_ksp0270_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe airlock cycled and opened up to a long corridor heading down at a peculiar angle. There was indeed an atmosphere, but not enough so that they could remove their helmets. \u0022The air has probably bleed off over the years.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Bled off through what?\u0022 Jervan stumbled down the corridor and into a strange green light, followed closely by Geneble. He stopped at the bottom in front of yet another hatch. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141215_ksp9661_hawk2.jpg\u0022 alt=\u002220141215_ksp9661_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022I think this hatch leads into that crashed ship.\u0022 Jervan tried to open it. \u0022Won\u0027t budge. Hey, could you give me a hand with this thing.\u0022 Nothing they tried would open it. They both stepped back and looked at it for a moment. A strange feeling passed through them. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141215_ksp9662_hawk2.jpg\u0022 alt=\u002220141215_ksp9662_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141215_ksp9663_hawk2.jpg\u0022 alt=\u002220141215_ksp9663_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022I don\u0027t think we\u0027re supposed to be here Jervan.\u0022 Geneble started to back away slowly. \u0022It almost feels like we\u0027re being watched.\u0022 Both of their radios crackled simultaneously, causing them to jump. \u003C/p\u003E\u003Cp\u003EJervan let out a nervous chuckle. He waved his hands at the flags hanging from the walls. \u0022What do you think\u0027s up with these?\u0022\u003C/p\u003E\u003Cp\u003E\u0022I, I\u0027m not sure I really care. Can we go now?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ok, ok. Let\u0027s get topside and report this back to Anny and whoever\u0027s listening on Kerbin. Maybe they\u0027ll know what\u0027s going on.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141215_ksp9667_hawk2.jpg\u0022 alt=\u002220141215_ksp9667_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENeither of them noticed the camera at the top of the corridor. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0656_hawk2.gif\u0022 alt=\u002220150215_ksp0656_hawk2.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EJervan cycled the airlock and pushed open the exterior door once the light turned green. Je stumbled out into the near-darkness as a shadow had fallen over their landing site. \u0022Looks like the sun slipped behind a crater rim while we were in there.\u0022 He took a few more steps then stopped. \u0022Oh.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh what?\u0022 Geneble stepped out of the airlock, carefully closing the egress/ingress hatch behind him. No reason to let any more of the ancient atmosphere escape than absolutely necessary. He turned to find they were surrounded by a small army of camouflaged kerbals. \u0022Oh.\u0022 \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150131_ksp0339_hawk2.jpg\u0022 alt=\u002220150131_ksp0339_hawk2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150131_ksp0350_hawk2.gif\u0022 alt=\u002220150131_ksp0350_hawk2.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EThoughts.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESome of this update was planned out several months ago. The scenes inside of the tunnel to the UFO, for instance, were acted out on December 15th, and I just waited until I felt the time was right to drop that bit in. Much of the \u0022delay\u0022 of Hawk 2 was my own doing, as that mission has always been intended as the end of an Act. I had really planned to do that earlier, but I found flying the Shuttle missions to be more fun than I anticipated. Deorbiting the satellites was mostly planned, but I decided instead to have some fun with the Claw. (All three of my Geostationary communications satellites have already disappeared on their own. GSO is cursed, I tell ya. And I can\u0027t blame Remote Tech this time.)\u003C/p\u003E\u003Cp\u003EOther things just happened organically. The crash of the Wanderer, for instance, was not planned. Not even really desired. I don\u0027t script accidents like that, but I also don\u0027t revert them. I had every intention of building the Erne mission to Eve, and even have 5 crew members now sitting around KSC twiddling their thumbs. Logically, after an accident such as that, things would have to change. Investigations would be conducted. Design changes would be made. So it didn\u0027t make sense to rush the construction of the Erne with only 150 days or so until the next Eve transfer window.\u003C/p\u003E\u003Cp\u003ESo with the shuttle out of commission and the three large ships busy with their transfers to Jool and Duna, it made sense to me to bring this part of Ad Lunam to a close. So what\u0027s next? A few updates ago I mentioned we\u0027d get to \u0022play around with the shiny new 0.90 stuff,\u0022 and that\u0027s what\u0027s coming. We\u0027re going to go back to Year 1 Day 1 and go through a few quick history updates. And then we\u0027ll get back to the Duna missions. No matter when KSP 1.0 drops, I\u0027m not upgrading (this save) until after I\u0027ve finished with what I\u0027m doing on Duna. \u003C/p\u003E\u003Cp\u003EAfter Duna, well, we\u0027ll see. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBloopers and Outtakes.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAnybody that\u0027s tried something like that plane extraction knows exactly what \u0022really\u0022 happened. Explosions. Mostly the wheels exploding as they clipped the lowered ramp, but occasionally even the plane would catch on something and explode. Ultimately I had 3 successful extractions over several dozen attempts. Here are some of the shots that didn\u0027t make the cut:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp9001_extract.jpg\u0022 alt=\u002220150208_ksp9001_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp9003_extract.jpg\u0022 alt=\u002220150208_ksp9003_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp9012_extract.jpg\u0022 alt=\u002220150208_ksp9012_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp9013_extract.jpg\u0022 alt=\u002220150208_ksp9013_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp9015_extract.jpg\u0022 alt=\u002220150208_ksp9015_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150208_ksp9025_extract.jpg\u0022 alt=\u002220150208_ksp9025_extract.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd of course, kerbals trip themselves up every chance they get. Such as when walking out of a MÃƒÂ¼n base:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp06670_hawk2-bloop.gif\u0022 alt=\u002220150215_ksp06670_hawk2-bloop.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EHope you enjoyed it. Until next time....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:28:41Z\u0022 title=\u002206/21/2015 10:28  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2015-02-20T04:15:49Z","Content":"\n\u003Cp\u003EYesssss.. another Ad Lunam update. My day is complete.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-02-20T04:40:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003EYesssss.. another Ad Lunam update. My day is complete.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAye. Mine too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E (In a slightly more literal sense.) Time to go curl up with a book and try to forget I\u0027ve got a bit of a cold and another day of work left in the week. (Hopefully a day where all my tools aren\u0027t refusing to let people log in and do work. 8 hours of pantomiming is dreadful when you\u0027re supposed to be programming.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-20T05:57:12Z\u0022 title=\u002202/20/2015 05:57  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 20, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tapejara","CreatedById":111216,"CreatedDateTime":"2015-02-20T20:01:51Z","Content":"\n\u003Cp\u003EAliens? I didn\u0027t see that coming!\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2015-02-21T06:14:58Z","Content":"\n\u003Cp\u003EI don\u0027t think those are aliens, Tape.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-02-21T06:49:31Z","Content":"\n\u003Cp\u003EWell, I\u0027m not saying it\u0027s aliens, but...\u003C/p\u003E\u003Cp\u003EThey\u0027re all aliens. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2015-02-21T11:31:10Z","Content":"\n\u003Cp\u003EFunny, mysterious, and edge-of-your-seat exciting. I love your designs, your writing, and your presentation.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-03T06:04:21Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150302_ksp0129_kraken.jpg\u0022 alt=\u002220150302_ksp0129_kraken.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMilzer\u0027s dream was terrible. They were at Duna, beautiful and orange Duna, yet something large and black as the night had their ship. Its inky tendrils were wrapped around the Kraken\u0027s Harvest\u0027s habitation ring. Two eyes, bright white against the black of space, looking into the very soul of the ship. A ship that was groaning, creaking, popping under the stress. And finally it cracked. Milzer woke up just as he was sucked out into space.\u003C/p\u003E\u003Cp\u003EHe shook the nightmare off and made his way into the darkened galley. He fumbled about in the cabinets for a late night snack and nearly jumped out of his skin when he heard a loud crunching sound behind him. Two eyes, bright white against the black of space. He turned on the lights.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150302_ksp0149_kraken.jpg\u0022 alt=\u002220150302_ksp0149_kraken.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Oh. Jeb. Didn\u0027t expect to see you up already.\u0022 Jeb was staring at him, holding his spoon aggressively in one hand, munching away on some crunchy, milk-less cereal.\u003C/p\u003E\u003Cp\u003E\u0022Bad dream? Black tendrils? White eyes?\u0022 Milzer nodded. \u0022Hmm. It\u0027s already hard to sleep. So many stars out there, so many things we\u0027ve lost over the years. Dreams like that don\u0027t help.\u0022 \u003C/p\u003E\u003Cp\u003EA loud clatter caused Milzer to jump. (Jeb continued calmly clawing away at his breakfast.) He turned to see Bill bounding head-first out of his cabin and falling face-first onto the floor. \u0022Ow!\u0022 Bill brushed himself off, stood up, and made his way towards the table. \u0022I\u0027ll never get used to this ridiculous gravity! Jeb. Milzer.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Morning Bill.\u0022 Jeb lowered his spoon into the bowl of uncooperative cereal, corralled a few more puffs, then set back to his aggressive munching.\u003C/p\u003E\u003Cp\u003E\u0022Sun\u0027s up, but it\u0027s not mornin\u0027.\u0022 Bill rubbed at his chin. \u0022Well, I guess the Sun\u0027s down, depending on how you look at it. So what\u0027s the grub this morning?\u0022 He poked his finger around in Jeb\u0027s cereal, sending small artificially-colored random-sized puffs off into the cabin and eliciting a quick smack on the hand from Jeb\u0027s spoon. \u0022Hey!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Bill, you\u0027ve had the dream, right?\u0022 Jeb put his spoon down into the bowl, took a drink from his squeeze-pouch, eyes still never leaving Milzer. \u0022The bad one?\u0022\u003C/p\u003E\u003Cp\u003EBill wandered off to the snacks closet. \u0022Big eight-legged thing, had breath like Bob? Ate the ship? Yeah, something like that.\u0022\u003C/p\u003E\u003Cp\u003EJeb nodded. A strange silence fell over the room, interrupted again by Bill rummaging around in the snack drawer. It was too much for Milzer. \u0022So, uh, Jeb, Bill. What was it like back at the dawn of the space age?\u0022\u003C/p\u003E\u003Cp\u003EJeb gave him a harsh look, then let whatever mean idea that had crossed his mind pass. \u0022What\u0027s it been now? 77 years?\u0022\u003C/p\u003E\u003Cp\u003EBill nodded. \u0022Well, 77 years for most of us.\u0022 \u003C/p\u003E\u003Cp\u003E\u0022Poor Bob.\u0022\u003C/p\u003E\u003Cp\u003EMilzer looked expectantly at Bill and Jeb, but nothing further was offered. \u0022What about Bob?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah, Bob. What was that song he was obsessed with? Some old jazz piece? He kept playing it before the DEMO-7 launches. Drove the rest of us insane.\u0022\u003C/p\u003E\u003Cp\u003E\u0022How should I know? I was off doing something productive while the two of you were playing with your toy rockets.\u0022\u003C/p\u003E\u003Cp\u003E\u0022They were sounding rockets, not toys. And you were part of the same DEMO team as the rest of us.\u0022\u003C/p\u003E\u003Cp\u003EMilzer glanced between the two of them again. \u0022DEMO? What\u0027s that?\u0022\u003C/p\u003E\u003Cp\u003EBill hmmm\u0027d, finished what he was eating, then looked Milzer square in the eyes. \u0022That\u0027s classified.\u0022\u003C/p\u003E\u003Cp\u003EJeb growled. \u0022Bill, c\u0027mon now. That was forever ago.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ok, fine. DEMO was a collection of teams put together by the new Unified Government for developing various advanced... things. The \u0027Development, Engineering, and Meandering Organization.\u0027 Or maybe it was Manufacturing. I was attached to a team working on sounding rockets for atmospheric testing, DEMO-7, and part of the Kerbin Atmosphere Research Program, KARP. Bob was some fresh new scientist. Jeb, well, Jeb was apparently doing something \u0027productive.\u0027 Whatever that means.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Flying. Not sitting around wasting time with cardboard tubes and gunpowder like you two.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Anyway, this was just a few mÃƒÂ¼nths after The War. We were all exhausted, and excited about going home. We set up shop at this old airfield in the northern part of the continent. We launched our first tests the day of the Zed dot Eighteen. The asteroid strike. I\u0027ll never forget that day.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EAd Lunam - Origins - The Rocket Stuff\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 0. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0000-0057_mon.jpg\u0022 alt=\u002220150201_ksp0000-0057_mon.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBob thought the flight to Green Plains was smooth enough, despite the psychopath in the cockpit. He would\u0027ve been more relaxed had somebody patched the shrapnel holes in the side of the plane or if they weren\u0027t riding with loaded rockets. A bit of turbulence caused everything to jump, and the kerbal across from him looked nervously back at their cargo. Neither had said anything since climbing aboard. Bob bit his lip and waited for his anxiety to pass before finally speaking up. \u003C/p\u003E\u003Cp\u003E\u0022So what\u0027d you do wrong?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Wrong? How\u0027s that now?\u0022\u003C/p\u003E\u003Cp\u003E\u0022To land this crazy appointment. You\u0027re part of this DEMO-7 group, right? It\u0027s a punishment job.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Suppose I\u0027m just good at blowing things up. I\u0027m Bill.\u0022 He waved his mittened hand at Bob, still holding on with the other for dear life. \u0022Bill Kerman. You?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Bob. Kerman. Like everybody else. They tell me I\u0027m a scientist.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah. You\u0027re the atmosphere genius, right?\u0022\u003C/p\u003E\u003Cp\u003EBob shook his head. \u0022Not really. I woke up one morning in a trench. Some kerb came running out of the fog screaming about the war being over. I made a smart-aleck remark about the foggy weather and running at armed kerbals screaming about war, and suddenly this other kerb with a bunch of stripes was telling me that \u0027If I know so much about the weather, I must be a flippin scientist.\u0027 Next thing I know I\u0027m on this plane.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Heh.\u0022 Bill pointed at the cargo. \u0022These are my rockets. Plan is, we fire a few, you take a few measurements, fire a few more. Make some changes here and there just to see which fly best.\u0022 The plane banked hard to the left, pulling Bill forward into his straps. \u0022There\u0027s balloons back there too.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Balloons?\u0022 Another bump and the plane was level and descending. Bob could only hope it was because they\u0027d finally arrived. \u0022Why didn\u0027t we use those to fly here instead?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0000-0075_mon.jpg\u0022 alt=\u002220150201_ksp0000-0075_mon.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EAwk Flight Tests\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 1 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-7\u003C/p\u003E\u003Cp\u003EA few days later and they had their first batch of rockets lined up for testing. Bill wanted to wait until he had more rockets ready, but dark clouds had appeared overhead and the program heads wanted data on them.\u003C/p\u003E\u003Cp\u003EThe Awk was a small rocket, barely taller than a kerbal, but it was stuffed full of some of the foulest smelling gunk Bob had ever caught wind of. He made Bill stand in front of the rocket for the prelaunch photo. \u0022Just for scale.\u0022\u003C/p\u003E\u003Cp\u003EBill looked up cautiously at the darkening skies. \u0022Should we even be out here with the sky like that?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Probably just a volcano off to the west somewhere. Now are you gonna get in front of the rocket or not?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0001-0041_awk.jpg\u0022 alt=\u002220150201_ksp0001-0041_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce everything was settled the two scurried off to the small bunker and fired the Awk 1 into the dark skies. The decoupler-rigged launch sticks were thrown violently off to the side by the rocket\u0027s exhaust as it crackled noisily upwards. Bob watched its ascent through a pair of old binoculars and pressed the button on his stopwatch when the flame disappeared. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0001-0352_awk.jpg\u0022 alt=\u002220150201_ksp0001-0352_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBob and Bill were both busy taking notes when the parachute opened and the Awk 1 descended softly off to the South. A small explosion marked the cardboard rocket\u0027s landing. Cardboard \u003Cem\u003E_is_\u003C/em\u003E one of the most volatile materials known to Kerbals, after all.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0001-0359_awk.jpg\u0022 alt=\u002220150201_ksp0001-0359_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey fired off 8 Awks that day. Awks 1-4 were simple rockets with straight fins, and proved to be less accurate than Bill had expected. All 4 of them fell in roughly the same area though, making recovery that much easier. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0001-0391_awk.jpg\u0022 alt=\u002220150201_ksp0001-0391_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAwk 5-8 used a minor modification to the fins, twisted to provide a nominal amount of spin. Bill suspected this would make the ascent of the rocket more precise and controlled, and wanted to repeat the same 4 tests.\u003C/p\u003E\u003Cp\u003EBob motioned Bill out towards the Awk 5, camera in hand. \u0022Are you going to make me stand in front of everything we launch?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Nah, just the interesting ones.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0001-0042_awk.jpg\u0022 alt=\u002220150201_ksp0001-0042_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey ran back to the bunker and fired off the Awk 5. \u0022Wow Bill! Look at \u0027er spin!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0001-0395_awk.jpg\u0022 alt=\u002220150201_ksp0001-0395_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFour flights and four landings. These did prove to be a great deal more accurate, with all four landing on the runway. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0001-0443_awk.jpg\u0022 alt=\u002220150201_ksp0001-0443_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill decided to use spin stabilization on all their tests going forward. He was busy planning the next batch of Awks when the news reached them: the ash cloud was from an asteroid impact in the CCHR. Dust and burning embers were falling across the entire continent, and all planes were grounded until they could prove the air was safe. News was slow in those days, and most of the telegraph wires between the CCHR and the new Unified Government had been cut during the war. \u003C/p\u003E\u003Cp\u003EResults of the first 8 Awk tests:\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 1[/td][td]2m40s[/td][td]0.5[/td][td]4832[/td][td]9.2[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 2[/td][td]2m39s[/td][td]0.5[/td][td]4832[/td][td]2.6[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 3[/td][td]2m41s[/td][td]0.5[/td][td]4833[/td][td]0.1[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 4[/td][td]2m41s[/td][td]0.5[/td][td]4835[/td][td]1.8[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 5[/td][td]2m49s[/td][td]0.5[/td][td]4866[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 6[/td][td]2m49s[/td][td]0.5[/td][td]4869[/td][td]1.8[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 7[/td][td]2m45s[/td][td]0.5[/td][td]4865[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 8[/td][td]2m48s[/td][td]0.5[/td][td]4866[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003EThe next morning Bill and Bob had six more Awks ready to fly, this time with testing equipment aboard. Two each of the materials, meteorological and aeronomy experiments. The Awk couldn\u0027t reach up into the higher ash clouds, but it could still give them good data for the lower atmosphere. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0001-0450_awk.jpg\u0022 alt=\u002220150201_ksp0001-0450_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll six landed in a spread to the West of Green Plains. Good science returns.\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 9[/td][td]2m39s[/td][td]0.5[/td][td]4840[/td][td]4.2[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 10[/td][td]2m39s[/td][td]0.5[/td][td]4842[/td][td]1.8[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 11[/td][td]2m39s[/td][td]0.5[/td][td]4861[/td][td]4.2[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 12[/td][td]2m43s[/td][td]0.5[/td][td]4863[/td][td]1.8[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 13[/td][td]2m39s[/td][td]0.5[/td][td]4861[/td][td]4.2[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Awk 14[/td][td]2m39s[/td][td]0.5[/td][td]4860[/td][td]1.8[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003ESed 1-4 Flight Tests\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 4 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-7\u003C/p\u003E\u003Cp\u003EBill was trying to find a solution for reaching the ash layer that was quickly forming in the higher altitudes. His first set of tests were of a \u0022longer cardboard tube,\u0022 which he was calling the Sed. Naturally Bob forced him to stand in front of it and took a picture \u0022for scale.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0002-0043_sed.jpg\u0022 alt=\u002220150201_ksp0002-0043_sed.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Sed was a bit longer than the Awk, and had an extra set of fins to add more spin stabilization. Four test flights were performed, all of which landed just South of the launchpad. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0002-0471_sed.jpg\u0022 alt=\u002220150201_ksp0002-0471_sed.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately the Sed only reached an extra couple hundred meters further into the sky, so Bill went back to the drawing board. \u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Sed 1[/td][td]2m20s[/td][td]0.7[/td][td]5257[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Sed 2[/td][td]2m22s[/td][td]0.7[/td][td]5262[/td][td]1.8[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Sed 3[/td][td]2m22s[/td][td]0.7[/td][td]5262[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Sed 4[/td][td]2m20s[/td][td]0.7[/td][td]5262[/td][td]1.8[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003ESed-Awk Test Flights\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 23 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-7\u003C/p\u003E\u003Cp\u003EA few mÃƒÂ¼nths passed by, but Bill had finally found the solution he needed: explosives. Or, more precisely, a way to separate two parts of a rocket. It was an invention he was calling \u0022The Explosive Slicers.\u0022 Bob just called them separators. \u003C/p\u003E\u003Cp\u003EUsing these new Slicers Bill was able to stack an Awk atop a Sed. They were missing the chance to collect high-altitude samples with the ash layer thinning out daily, so there was a bit of pressure for this idea to work. Once again Bob insisted on a photo. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0003-0044_sedawk.jpg\u0022 alt=\u002220150201_ksp0003-0044_sedawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Sed-Awk was considerably taller than anything they\u0027d yet launched, and required some work to get it pointed skywards. It also launched a bit slower than either of its predecessors. The separation of the Awk from the Sed created a small dust cloud, which at first caught Bill by surprise. \u0022I expected The Explosive Slicer to cause a bigger explosion.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0003-0492_sedawk.jpg\u0022 alt=\u002220150201_ksp0003-0492_sedawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the end the Sed-Awk still didn\u0027t have enough to reach the upper ash layer. Four total tests were conducted. \u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Sed-Awk 1[/td][td]4m27s[/td][td]1.0[/td][td]9696[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Sed-Awk 2[/td][td]4m33s[/td][td]1.0[/td][td]9833[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Sed-Awk 3[/td][td]4m33s[/td][td]1.0[/td][td]9831[/td][td]0.0[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EGrep Test Flights\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 23 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-7\u003C/p\u003E\u003Cp\u003EBill had another trick up his sleeve though. A \u0022thicker, fatter\u0022 cardboard mailing tube was procured and packed full of solid explosives, with the intent of using it as the lower stage of a future multi-stage rocket. It needed to be tested alone first. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0004-0517_grep.jpg\u0022 alt=\u002220150201_ksp0004-0517_grep.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Grep was tested using a few different fin configurations, both large and small, spin stabilized and not. In the end four test flights were conducted and the results tabulated along with the rest. One major change was the addition of a decoupler between the payload and the rocket tube as Bill was worried the extra mass of the Grep would over-stress the parachutes. That of course allowed the rocket to fall freely to the ground and explode like unspent ordinance. Dangerous stuff, that cardboard.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0004-0523_grep.jpg\u0022 alt=\u002220150201_ksp0004-0523_grep.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep 1[/td][td]3m43s[/td][td]2.0[/td][td]6585[/td][td]1.8[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep 2[/td][td]3m43s[/td][td]2.0[/td][td]6613[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep 3[/td][td]3m40s[/td][td]2.0[/td][td]6615[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep 4[/td][td]3m50s[/td][td]2.0[/td][td]6775[/td][td]0.0[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EX-0 Flight 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 28 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-8\u003C/p\u003E\u003Cp\u003EThe airfield was silent and peaceful, shrouded in the thick morning fog. The rains the previous night had been clear a clean with only a hint of ash and the air had a certain coldness to it. Hanger crews were busy fueling the aged and battle-scarred \u0022Mother of Necessity\u0022 and the small child of a plane she was carrying in her belly. Sigsey took a moment to glance out into the calm, cool morning. The birds stopped chirping, there was a flash of orange, and a kerbal walked calmly out of mists. Jebediah Kerman. \u003C/p\u003E\u003Cp\u003E\u0022Hey Sigs! Got any gum?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh, I might have me a stick or two. Where\u0027s your horse?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Can\u0027t take a horse on a plane Sigs, you know that.\u0022 Jebediah sauntered into the hanger and ran his hand along the length of the X-0. He stopped to pat his hand on its side. \u0022Guess this bird\u0027ll just have to do. Who\u0027s flying today?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Some new kid named Genekin. Thinks he\u0027s a hotshot pilot like his daddy was. Here.\u0022 Sigsey handed Jeb his last stick of gum and put the empty pack back in his pocket. \u0022Don\u0027t guess he knows he\u0027s not the one that gets to ride the rocket.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You tell him not to scratch my plane. Me and Mother have seen a lot of miles now.\u0022 Jebediah tossed his helmet into the cockpit of the smaller plane and climbed aboard. He reached down to lift Sigsey up so he could help him strap in.\u003C/p\u003E\u003Cp\u003EOnce Jeb was situated Sigsey pulled the last straps tight and gave him a tap on the helmet. \u0022You be careful now, a-right?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Who? Me? Don\u0027t worry about me. I\u0027ll be as careful as ever.\u0022 At that Jebediah pulled the cockpit shut and gave Sigsey a thumbs up. \u003C/p\u003E\u003Cp\u003E\u0022That\u0027s what I\u0027m worried about.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0005-0556_x0.jpg\u0022 alt=\u002220150201_ksp0005-0556_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe last of the fog had burned off by the time the Mother and her child had taxied to the end of the runway. The takeoff was bumpy, but nothing the Mother of Necessity hadn\u0027t been through before, and in no time they were airborne. Genekin was running the engines hard as he pulled up to the first cruising altitude. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0005-0567_x0.jpg\u0022 alt=\u002220150201_ksp0005-0567_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb had a view of exactly nothing from inside the bomb bay. He could feel the plane climb steeply and bank hard to the left, and could watch the altimeter climb, but he wanted more. The plane leveled off briefly and the radio cracked. Sigsey checking to make sure Jeb was ready. \u0022Let\u0027s go!\u0022 The plane pitched up sharply, a light lit on Jeb\u0027s dash, and he smacked the drop button with his fist. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0005-0599_x0.jpg\u0022 alt=\u002220150201_ksp0005-0599_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe X-0 dropped from the bay, it\u0027s rocket engines lighting immediately. Jeb was pulled back into his seat by the force, barely able to keep his hand on the stick. He thought for a moment the little rocket plane was about to rattle itself apart. He started reading his speed into the radio. \u0022250. 280.\u0022 A bump caused him to nudge the throttle the wrong way and suddenly he was flying upside down. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0005-0621_x0.jpg\u0022 alt=\u002220150201_ksp0005-0621_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Whoooah! 320. 325. Really starting to rattle up here.\u0022 He teied to pull the plane upright again but lost the fight. \u0022330. Mmmmmm.\u0022 It was all he could do to keep the stub-winged little X-0 level and under control. The small vibrations became huge. Three-fourrrrtrty.\u0022 And then he passed through a cloud and the vibrations stopped. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0005-0624_x0.jpg\u0022 alt=\u002220150201_ksp0005-0624_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EControl returned and he brought the horizon level. \u0022380! I think we\u0027ve finally done it now boys! Yeeeeeeeeehaaaaaa! 400. 430. 455. 480. And flameout. 481 meters per second. Dropping like a stone now. 420. 360.\u0022 There was a short violent shake as the plane went subsonic. \u0022320. I can hear the wind again. 280. 260. Negative control on the stick. Popping the chutes.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0005-0631_x0.jpg\u0022 alt=\u002220150201_ksp0005-0631_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022We see your chutes Jeb. Hood deploy.\u0022 Sigsey\u0027s voice crackled across the radio. \u0022You put on quite a show. Big trail of fire. Disappeared into a cloud before we could blink. Think old Genekin might be a bit green.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I bet.\u0022 Jeb leaned forward in the cockpit to get the plane to level out as it touched down. \u0022The X-0 has landed. How \u0027bout you two swing by and pick me up? Tell the kid not to slice any of my wings off on a tree, ok?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0005-0640_x0.jpg\u0022 alt=\u002220150201_ksp0005-0640_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb waited for the recovery crew to show up so he could pose for the post-flight photo. The first post-supersonic-flight photo, that is. He slapped Sigsey on the back as they were loading up the X-0. \u0022Ok Sigs, now let\u0027s do it again!\u0022\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Speed[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]X0-Flight 1[/td][td]5m38s[/td][td]481[/td][td]6565[/td][td]3.9[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EGrep-Awk and Grep-Sed Test Flights\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 37 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-7\u003C/p\u003E\u003Cp\u003EWith the Grep lower stages tested and ready, Bill set about building 4 more multi-stage sounding rockets: 2 using an Awk upper stage and 2 using a Sed. First up were the two Grep-Awk flights. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0006-0642_grepawk.jpg\u0022 alt=\u002220150201_ksp0006-0642_grepawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe two Grep-Awk flights, while reaching 13kms in altitude, deviated too far from the launchpad for practical use. They were able to collect samples from the upper reaches of the Troposphere, which showed a still significant amoumt of airborne ash, but the tests were still short of the upper ash layer. Still, it was higher than any kerbal-built rocket had yet flown. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0006-0645_grepawk.jpg\u0022 alt=\u002220150201_ksp0006-0645_grepawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Awk 1[/td][td]5m6s[/td][td]2.3[/td][td]13776[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Awk 2[/td][td]5m8s[/td][td]2.3[/td][td]13917[/td][td]0.0[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003EThe Grep-Sed was essentially the same rocket, using a longer Sed as its upper stage. The fin arrangement had been altered for these flights, going with a lower-mass option that still provided spin stabilization. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0007-0670_grepsed.jpg\u0022 alt=\u002220150201_ksp0007-0670_grepsed.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Grep-Sed outperformed the Grep-Awk only in the increased precision of its landing. The altitude difference was negligible, reaching only into the lower stratosphere. \u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed 1[/td][td]4m59s[/td][td]2.5[/td][td]14055[/td][td]0.0[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed 2[/td][td]5m9s[/td][td]2.5[/td][td]14477[/td][td]0.0[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EX-0 Flight 2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 51 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-8\u003C/p\u003E\u003Cp\u003EAnother day, another supersonic test for Jeb and his crew. The X-0 had been proven on the previous flight (proven to be unstable without thrust at least), so this time they were looking for more altitude and a new speed record. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0008-0694_x0.jpg\u0022 alt=\u002220150201_ksp0008-0694_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe \u0022Mother of Necessity\u0022 climbed as high as her engines would allow, and Jeb punched the release. This time he was ready for the hard bump from the engine, and was able to pull the craft upwards. He pierced the sound barrier and went transsonic before the Mother lost sight of him. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0008-0710_x0.jpg\u0022 alt=\u002220150201_ksp0008-0710_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe read back his numbers over the radio. \u00226km 390m/s.\u0022 Climbing would get him into the thin air. The thin air would allow him to go faster. \u00228km 460m/s.\u0022 Faster was better. Jeb held the stick and the plane at a steep climb, well above the clouds. \u002210km 530m/s.\u0022 Higher than any propellers could go. \u002212km 620m/s.\u0022 \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0008-0715_x0.jpg\u0022 alt=\u002220150201_ksp0008-0715_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe engines cut out and he continued to climb, drifting upwards on the thin wings of the X-0. \u0022Whoo! Burnout, top speed 631m/s.\u0022\u003C/p\u003E\u003Cp\u003EThe now spent plane nosed down and fell back towards Kerbin lile a lawn dart. \u002214,296km altitude. Better break out all the record books. Think you boys back there can do better?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Give me a rocket plane like your\u0027s and maybe.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0008-0720_x0.jpg\u0022 alt=\u002220150201_ksp0008-0720_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb released the chutes and drifted back down to Kerbin. He made a few notes and checked a few gauges before tapping the radio again. \u0022Next time we need more fuel!\u0022 \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0008-0723_x0.jpg\u0022 alt=\u002220150201_ksp0008-0723_x0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Speed[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]X0-Flight 2[/td][td]5m0s[/td][td]631m/s[/td][td]14,296[/td][td]3.5[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EDouble Grep Test Flight\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 56 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-7\u003C/p\u003E\u003Cp\u003EBill had another idea: What if he stacked two of the Grep boosters atop each other? Could it work? Would it be enough to reach above the stratosphere? The Grep-D (Or Double Grep) was the result. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0009-0727_grepd.jpg\u0022 alt=\u002220150201_ksp0009-0727_grepd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately, even with spin stabilization the rate of ascent was too slow for the craft to be stable. The first test article went horizontal and was almost 10kms away from the test site. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0009-0732_grepd.jpg\u0022 alt=\u002220150201_ksp0009-0732_grepd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill thought it best to scrap the design and keep the extra Greps around for what would prove to be his most effective rocket yet. \u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-D 1[/td][td]3m55s[/td][td]3.6[/td][td]5894[/td][td]0.0[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EGrep-Sed Booster Test Flights\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 62 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-7\u003C/p\u003E\u003Cp\u003EYet before he could test that, Bill needed to work out the kinks from the Grep-Sed booster system. So early on the morning of the 62nd day since the asteroid strike, him and Bob set out to conduct two more Grep-Sed launches. Bill wanted to see if a single set of spin-stabilizer fins would be enough for the entire flight. He was also experimenting with a new formula for the fuel, one that reduced the thrust of the Grep. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0010-0751_grepsed.jpg\u0022 alt=\u002220150201_ksp0010-0751_grepsed.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe result was less than desired, with a deviation from the launchpad of 12km for an apoapsis of 13km. So he went back to the old fuel formula and repeated the test, this time with a marked improvement. Work could now proceed on what would be their most capable sounding rocket yet constructed. \u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed 3[/td][td]5m5s[/td][td]2.4[/td][td]13,028[/td][td]4.2[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed 4[/td][td]4m52s[/td][td]2.4[/td][td]14,644[/td][td]0[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EX-1 Flight 3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 67 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-8\u003C/p\u003E\u003Cp\u003E\u0022More fuel\u0022 was the next logical step for the X-craft. A bit of tinkering and some tweaks to the Mother of Necessity, and the X-1 was ready to fly. She had 50% more fuel than the X-0, was a good meter or so longer, and was all Jeb could hope to fit in the cargo bay of his bomber. They set out on a clear morning, Genekin climbing aggressively to build upwards momentum. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0011-0783_x1.jpg\u0022 alt=\u002220150201_ksp0011-0783_x1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey were at the drop altitude in no time. \u0022Time to soar!\u0022 Jeb screamed as he dropped from the Mother of Necessity and lit the rocket engine behind him. It took a bit longer to breach Mach 1, and the heavier plane took more oomph to ascend. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0011-0784_x1.jpg\u0022 alt=\u002220150201_ksp0011-0784_x1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb was still accelerating when he broke his previous altitude record. \u002215km and climbing, 580m/s.\u0022 The sounds from outside the plane changed, going quieter than he had ever thought possible. \u002220kms. 640m/s. 24km. Flameout. Top speed, 662m/s. Drifting now.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0011-0788_x1.jpg\u0022 alt=\u002220150201_ksp0011-0788_x1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe X-1 drifted up to 27km before it started to drop back down. The craft stayed supersonic through its apoapsis, only going subsonic once back in the thick soup of the lower troposphere. Jeb deployed the chutes and started looking around for the Mother. \u0022Hey. Where are you two?\u0022\u003C/p\u003E\u003Cp\u003ESigsey\u0027s voice crackled weakly on the radio. \u0022Jeb, you crazy old dog. You\u0027ve jumped clear off the farm this time. We\u0027ll have to send a truck out for you. Be careful landing, that\u0027s some rough terrain.\u0022\u003C/p\u003E\u003Cp\u003EThe landing went well enough, coming down cleanly on the rocket nozzle. At least until Jeb decided to jump out, throwing the entire plane off balance. He was still laughing about it when the recovery truck reached him an hour later. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0011-0794_x1.jpg\u0022 alt=\u002220150201_ksp0011-0794_x1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Speed[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]X1-Flight 3[/td][td]5m20s[/td][td]662[/td][td]27224[/td][td]8.4[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EGrep-Sed-Awk Test Flights\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 81 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-7\u003C/p\u003E\u003Cp\u003EOne last iteration of sounding rockets for Bill and Bob to test: the Grep-Sed-Awk, or GSA for short. So far every rocket they\u0027d tried to launch had fallen well short of their intended target: the upper stratosphere. Bill had finally settled on this three-stage monstrosity, and was insisting it could reach any point in the atmosphere stratosphere. \u003C/p\u003E\u003Cp\u003E\u0022Again? Really?\u0022\u003C/p\u003E\u003Cp\u003E\u0022C\u0027mon Bill, just one last time. If this really is the last version of the sounding rocket, then you\u0027ll want a photo to remember it by.\u0022\u003C/p\u003E\u003Cp\u003ESo Bill grumbled abd waddled out to the launchpad, one last time. \u0022Don\u0027t expect me to smile.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0012-0046_grepsedawk.jpg\u0022 alt=\u002220150201_ksp0012-0046_grepsedawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Ok folks,\u0022 Bill said to the crowd in the launch bunker once he\u0027d waddled back inside. \u0022We\u0027ve got five tests lined up. Two engineering flights to make sure this isn\u0027t just some stupid idea, then three science-specific flights for aeronomy, materials, and meteorological sciences. Any other questions?\u0022\u003C/p\u003E\u003Cp\u003EThe reporters and dignitaries who were crammed in the bunker all shook their heads. Word had leaked out that today might finally be the day a rocket reached into the upper atmosphere and nobody would dare miss it. Truth be told they were the only kerbals still at Green Plains after Jeb\u0027s third supersonic flight. Most of them just wanted to go home but had been ordered to cover the launch by their editors. \u0022Maybe you\u0027ll get to see something blow up\u0022 was a common reason. \u003C/p\u003E\u003Cp\u003EBill was about to press the big red button when somebody asked about a countdown. \u0022A what? Oh, fine. Ok. 10, 9.\u0022 Bob reached over and slapped the launch button early, and the first Grep-Sed-Awk crackled loudly into the firmament. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0012-0797_grepsedawk.jpg\u0022 alt=\u002220150201_ksp0012-0797_grepsedawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u002287654321 Blastoff!\u0022 Reporters and random kerbals were tripping over each other to get out of the bunker and watch the rocket fly. It streaked upwards, receding into a tiny dot of light before the first stage dropped away. Bob was dancing beneath his binoculars while watching it. \u003C/p\u003E\u003Cp\u003E\u0022I think this one might make it Bill!\u0022 The third stage lit, just a tiny flash against the blue. The payload fairings and science package ejected at the top of its flight, exposing the engineering instrumentation to the \u0022rarified\u0022 air. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0012-0804_grepsedawk.jpg\u0022 alt=\u002220150201_ksp0012-0804_grepsedawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA few minutes later and they parachute was spotted far to the southwest. Bob tracked it until it disappeared behind a hill and guesstimated the flight time. \u00225 minutes, 42 seconds, give or take. About 18km away.\u0022 A quick scribble on his notepad to do some math and Bob announced the verdict. \u002222km, well inside the stratosphere.\u0022\u003C/p\u003E\u003Cp\u003EThe crowd went silent. One of the younger reporters blinked a few times, then pointed at Bob. \u0022That\u0027s it?\u0022 Bob nodded. \u002222km?! We stuck around here for a whole MÃƒÂ¼nth for a measly 22km?! Jeb went higher than that in his plane!\u0022 The disgruntled newskid grabbed his bags and marched angrilly towards the parking lot. \u002222kms!\u0022 The rest of them smiled, shrugged, and quickly followed their colleague. \u003C/p\u003E\u003Cp\u003EBill walked over to Bob and slung his arm across his shoulders. \u0022Cheer up kiddo. A few years from now they\u0027ll change their tune.\u0022 He pointed towards the setting MÃƒÂ¼n with his other hand. \u0022And we\u0027ll be up there grinning back at the unlucky millions who don\u0027t get to play in MÃƒÂ¼nDust. Now help me set up the rest of these rockets.\u0022\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed-Awk 1[/td][td]5m42s[/td][td]2.7[/td][td]22,227[/td][td]5.4[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed-Awk 2[/td][td]5m26s[/td][td]2.7[/td][td]20,348[/td][td]5.4[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed-Awk 3[/td][td]5m37s[/td][td]2.7[/td][td]19,797[/td][td]5.4[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed-Awk 4[/td][td]5m35s[/td][td]2.7[/td][td]19,190[/td][td]5.4[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Grep-Sed-Awk 5[/td][td]5m38s[/td][td]2.7[/td][td]19,742[/td][td]5.4[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:32:02Z\u0022 title=\u002206/21/2015 10:32  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-03-03T10:29:47Z","Content":"\n\u003Cp\u003ENiice story, Monk!\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-05T03:22:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yukon0009\u0022 data-cite=\u0022Yukon0009\u0022\u003E\u003Cdiv\u003ENiice story, Monk!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! I\u0027ve been trying to balance out mission reports with the story bits, and \u003Cem\u003E_may_\u003C/em\u003E have gone a bit over the top with that last update. I\u0027m going to go a bit easier on the next few because I\u0027d like to get through these \u0022flash-back\u0022 style missions and finish off the Duna and Jool exploration missions before KSP 1.0 hits or the flood of Null-Reference Exceptions sinks the Kraken\u0027s Harvest and the rest of this save file. Speaking of those NREs:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0257_NRE.jpg\u0022 alt=\u002220150215_ksp0257_NRE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey were bad enough a couple weeks ago when the Kraken\u0027s Harvest arrived in the Duna system (in that funny timeline called \u0022Real Life\u0022) that they were corrupting both the save file and the config files for a couple of plugins (Trajectories was the most susceptible to them it seems).... But that\u0027s getting way ahead of myself. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:32:27Z\u0022 title=\u002206/21/2015 10:32  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-09T04:53:51Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EAd Lunam - Origins - Moving On Up\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI wasn\u0027t originally going to \u0022restart\u0022 and play a fresh game in 0.90, but those nifty sounding rockets showed up and I decided I wanted to see if I could bootstrap my way up from nothing. I also tossed in the \u0022Old\u0022 retired Squad parts for good measure, including a few that have been upgraded since I started playing in 0.19.3. I\u0027d already used them when making that \u0022Bumper 8 - First Launch from KSC\u0022 photo some time back, and figured they fit. So once I\u0027d built a sounding rocket that both agreed with my aesthetics and could reach the upper atmosphere, it was time to move on to stage 2: Combining the old with the new. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EBumper Combined Tests\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 112-119 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-13\u003C/p\u003E\u003Cp\u003EThe administrators of DEMO were impressed with Bill\u0027s work, but felt the project would be better served if led by a veteran rocket builder: Wernher von Kerman. There were some doubts about his loyalty, having served one of the other sides in The War, but none could question his mastery of rocketry. So Bill\u0027s DEMO-7 team was moved into Wernher\u0027s DEMO-3 team and the program renamed DEMO-13.\u003C/p\u003E\u003Cp\u003EThe K-4 design that had harassed the enemies of the Westlands would now prove quite useful as boosters for sounding rockets. Here\u0027s a shot of a captured K-4 being launched during early tests at Green Plains:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0013_0857_k4.jpg\u0022 alt=\u002220150201_ksp0013_0857_k4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]K-4-006[/td][td]4m5s[/td][td]8.3[/td][td]22,227[/td][td]5.4[/td][/tr][tr]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003EUnfortunately each K-4 cost around 7,500 roots, making them too expensive to use as a sounding rocket. The payload compartment, called a \u0022kapsuul\u0022 by Wernher\u0027s team, was repurposed as a giant battery. The parachute that had been used to return the K-4 test articles back to Kerbin was replaced with a fitting for a sounding rocket. A short time later and the \u0022Bumper\u0022 sounding rocket was ready for flight.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0014_0867_bumper.jpg\u0022 alt=\u002220150201_ksp0014_0867_bumper.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA total of 7 Bumpers were launched from Green Plains, featuring a variety of upper stages designed by Bill and the lower stage from Wernher\u0027s K-4. Combined they were more than enough to launch the testing payload far into the upper atmosphere. High enough to reach the ash layer even. Due to a small bug with KSP thinking the height of the small sounding rocket nosecone was ten meters, a different parachute system was used for returning the science to Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0014_0886_bumper.jpg\u0022 alt=\u002220150201_ksp0014_0886_bumper.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn all, the Bumpers proved to be an interesting solution to gathering the various high altitude science the sounding rockets payloads had to offer. And it gave me an excuse for playing around with the old, retired Squad parts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0014_0900_bumper1-7.jpg\u0022 alt=\u002220150201_ksp0014_0900_bumper1-7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Cost[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Bumper 1[/td][td]5m15s[/td][td]8.7[/td][td]8,215[/td][td]13,623[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Bumper 2[/td][td]6m50s[/td][td]8.7[/td][td]8,260[/td][td]31,234[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Bumper 3[/td][td]6m34s[/td][td]8.7[/td][td]8,260[/td][td]24,235[/td][td]5.4[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Bumper 4[/td][td]6m49s[/td][td]8.7[/td][td]8,260[/td][td]31,545[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Bumper 5[/td][td]6m34s[/td][td]8.7[/td][td]8,260[/td][td]28,505[/td][td]5.4[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Bumper 6[/td][td]6m8s[/td][td]8.7[/td][td]8,260[/td][td]22,107[/td][td]5.4[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Bumper 7[/td][td]6m10s[/td][td]8.4[/td][td]7,360[/td][td]25,171[/td][td]5.4[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003EBumper 7 - The final launch from Green Plains Airfield.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0014_0918_bumper7.jpg\u0022 alt=\u002220150201_ksp0014_0918_bumper7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EX-Project Test Flight 4 - X-2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 139 - Green Plains Airfield\u003C/p\u003E\u003Cp\u003EDEMO-8\u003C/p\u003E\u003Cp\u003EGreen Plains was all abuzz with the latest rumor: DEMO operations would be moving to an equatorial facility along the coast to the south. Jeb and the supersonic teams with DEMO-8 were to fold their research work into the main rocketry team under Wernher von Kerman, and the project would be rebranded DEMO-13. This had yet to be made official though, so Jeb and Sigsey pushed ahead with their fourth flight. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0015_0007_x2-f4.jpg\u0022 alt=\u002220150201_ksp0015_0007_x2-f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe previous X-flights had mostly relied on black magic and reaction wheels for flight control, a less than ideal situation. The X-2 remedied that by adding some simple control surfaces. It increased the mass slightly, but the added maneuverability was expected to make the plane more efficient thanks to fewer losses due to pilot error. Having positive control made the deployment safer, as Jeb could allow the plane to descend a bit from the mothership before igniting the rocket.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0015_0010_x2-f4.jpg\u0022 alt=\u002220150201_ksp0015_0010_x2-f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb had something to prove with this test. His previous flight had set the altitude record for any kerbal-built object, a record that was then broken by one of that weird Wernher kerbal\u0027s rockets. This might be the last time a piloted aircraft would ever hold such a record, and he meant to be the one holding it. He pulled back on the stick and hit the ignition. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0015_0012_x2-f4.jpg\u0022 alt=\u002220150201_ksp0015_0012_x2-f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe climb was a familiar thing. The rattle when he punched through the sound barrier routine. He pulled up a bit more as the rocket roared behind him. 10km. 12km. 14km. 18km. 20kms. Flameout. Top speed of 820m/s. Still drifting upwards. 25km. 30km. The air thinned to the point that the new wings had nothing to bite. The ash layer became obvious when he passed through it, but only because most of the atmosphere was under him.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0015_0021_x2-f4.jpg\u0022 alt=\u002220150201_ksp0015_0021_x2-f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Wow. You guys should see the ash clouds up here. Thick.\u0022 And then the stars twinkled to life. \u0022Oh. Wow.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0015_0024_x2-f4.jpg\u0022 alt=\u002220150201_ksp0015_0024_x2-f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb hardly noticed when he crossed 40km. The stars were bright, brighter here during the day then they ever were at night on the ground. So. Many. Stars. The plane peaked at 43,012m and started to descend again, falling against the air. The craft pitched over, bit the wrong bit of wind, and started to spin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0015_0028_x2-f4.jpg\u0022 alt=\u002220150201_ksp0015_0028_x2-f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELoss of control. It was a sensation Jeb had never before known. \u0022Ok. Ok. Ok.\u0022 He kept repeating, trying to remember what he was supposed to do here. Spin. Spinning\u0027s a good trick. No, that didn\u0027t work for 12 year old Jedis and wouldn\u0027t work for him either. And spinning was the problem, not the solution. Point down? Which way was down again? He could blow the parachutes, but at this rate of spin they\u0027d probably just pull the ship apart. \u0022Ok. Ok. It\u0027s ok. It\u0027s ok.\u0022 Could he eject? Should he eject? Did he have a parachute? No. Why would Jebediah Kerman ever wear a parachute? Then it hit him.\u003C/p\u003E\u003Cp\u003EBlack magic.\u003C/p\u003E\u003Cp\u003EHe flipped the reaction wheels back on.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0015_0030_x2-f4.jpg\u0022 alt=\u002220150201_ksp0015_0030_x2-f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rest of the descent was ordinary. The chutes popped at 500 meters above the ground, pulling the little rocket plane upright. Jeb brought it down gingerly on its tail, but it still managed to fall over. At least this time it was all in one piece when he climbed out of the cockpit. He was all smiles when Sigsey found him.\u003C/p\u003E\u003Cp\u003E\u0022What\u0027s next hoss?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Next?\u0022 Jeb grinned even bigger than before. \u0022Next I\u0027m going to the stars.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0015_0038_x2-f4.jpg\u0022 alt=\u002220150201_ksp0015_0038_x2-f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Speed[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]X2-Flight 4[/td][td]unknown[/td][td]820[/td][td]43,012[/td][td]5.6[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EMoving Day\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 148\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0016_0102_moving.jpg\u0022 alt=\u002220150201_ksp0016_0102_moving.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis was when I decided Jeb should fly Bill and Bob all the way from Green Plains to Cape Kerbal, because flying this Firespitter bomber is just so much fun. Bob was not in agreement with me over the amount of fun to be had on the flight. I won\u0027t bore you with the boring details of an uneventful flight (especially since there\u0027s another flying mission coming up later), but they stopped off at the KSC Monolith once they arrived. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0016_0119_moving.jpg\u0022 alt=\u002220150201_ksp0016_0119_moving.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhich led to this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/20150202_ksp0125_taxidermy.jpg\u0022 alt=\u002220150202_ksp0125_taxidermy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhich led to some questioning of the weird shadows. And the lack of a photographer in the reflections. And a questioning and long observation of the three kerbals, as these artifacts had inspired strangely aggressive behaviors in others. It was the discovery of the monoliths that had led to The War, and it wouldn\u0027t do to have the three stars of the DEMO Program become mindless, violent brutes like those other kerbals. Ultimately, after no unwanted changes were observed, it was decided that Bill was too oblivious and Bob too clueless to be bothered, and that nothing could shake Jebediah. Not even being \u0022taxidermied\u0022 by a monolith.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EGene Kerman\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EPresent Day\u003C/p\u003E\u003Cp\u003EDarkness. Complete and total. A vague sensation of floating, but unable to move. Awake. Barely. Looking around served no purpose when vast nothingness is all you can see. Two lights blinked slowly to life. Two white dots against the endless darkness. Two blinding beams of light, burning directly into his soul. A crack appeared in the void, slowly growing larger and larger, tearing the nothingness asunder. The lights flared and blinded him with everything. Too much light. And then... nothing. \u003C/p\u003E\u003Cp\u003EA small rattle awoke Gene Kerman from his restless sleep. His arms and legs were sore and the throbbing in the back of his skull wasn\u0027t helping much either. He blinked away the night tears and terrors and looked groggily about the room. A strange room, clean, orderly, almost hospital-like. There were no windows in the room, only a single door opposite his bed. Atop a small dresser sat a shirt, some trousers, and a pair of shoes. The room brightened automatically as Gene sat up, tossing his legs over the side of his bed. A strange bed. Gene fought back his soreness, got out of bed and paced briefly around the room.\u003C/p\u003E\u003Cp\u003EThere wasn\u0027t a knob on the door, only a small metallic pad where one would usually go. He dressed himself and walked over to it, instinctively running his fingers over the silvered pad. The door slid open.\u003C/p\u003E\u003Cp\u003EBeyond was another room, much like the one he was in. White, or grey, or beige, it was hard to tell exactly. There was a door opposite his, and two more to each side down a few steps. A row of windows ran along the ceiling. Skylights, looking out into the night. To the right sat a kerbal who was tapping away softly at a strangely-lit plate of glass. He smiled at Gene and waved the glass away. \u003C/p\u003E\u003Cp\u003E\u0022Ah, you\u0027ve awaken. Good.\u0022 The kerbal had an accent Gene couldn\u0027t place. \u0022We were starting to wonder if you were going to return to us. Please,\u0022 he motioned towards a seat that had just risen from the floor opposite his desk, \u0022won\u0027t you be seated?\u0022\u003C/p\u003E\u003Cp\u003EGene walked over to the seat and examined it. It was a solid form, made from the same not-white material as the rest of the room. \u0022Where are we?\u0022 \u003C/p\u003E\u003Cp\u003E\u0022You don\u0027t know? Hmm. We were afraid that might be an issue.\u0022 A hand wave and the glass returned to the desk, more soft tapping, then waved away once more. Another smile, more cheerful than before. \u0022Please, sit.\u0022 \u003C/p\u003E\u003Cp\u003EGene thought to protest, then realized conflict would solve nothing here. He sat, looked around the empty room, then turned back to smiley. \u0022So, what now?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Now we talk.\u0022 Another smile. \u0022Tell me, what is the last thing you remember?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well,\u0022 Gene struggled with the memory. Was it real? \u0022There was a dark room, and two bright lights.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes yes. Before that, please.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ok. A plane. Carl. Some rebels. A fight. Senator Kerman.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Who?\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EBumper 8 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EKerbal Space Center - Year 1 day 182\u003C/p\u003E\u003Cp\u003EDEMO-13\u003C/p\u003E\u003Cp\u003E\u0022Senator Robert Kerman, I\u0027m pleased to introduce the newest member of our team. Gene Kerman.\u0022 The senator smiled a fake smile and shook Gene\u0027s hand as Chris continued on. \u0022Gene here comes highly recommended from a small engineering school up in the riverlands. Stern, calm, understanding. Exactly the type needed to reign in this motley band we\u0027ve assembled.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Glad to have you aboard son.\u0022 More fake smiles.\u003C/p\u003E\u003Cp\u003EGene started into a reply, but Chris had already led the senator off to meet the others. No doubt they would hide-out in the hastily built block house for the actual launch. Losing Chris Kerman, Administrator of the DEMO Program and de-facto ruler of space, and Senator Robert Kerman, the one who pays their bills, in a launch failure would not go well for the fledgling rocketry program.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0017_9010_bumper8.jpg\u0022 alt=\u002220150201_ksp0017_9010_bumper8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGene tugged at his uncomfortable fire suit and checked the cameras one last time. First launch from a new launchpad and it was his duty to make sure all the pictures came out clear. Strange duties for a flight director, he thought, but somebody has to give the engineers something to review. They would also make for nice postcards for the program\u0027s growing fanbase. He spent some time chatting with the photographers to make sure the plan was clear, only to discover he was the rookie and the others had been photographing the Bumper launches from the onset. \u003C/p\u003E\u003Cp\u003EAnd then the countdown reached zero. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0017_9028_bumper8.jpg\u0022 alt=\u002220150201_ksp0017_9028_bumper8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt had been a short countdown as nobody could really be bothered to count all the way from 3 hours. (Who can count that high anyway?) In his memories Gene was a great deal closer to the launch than he had actually been. Perhaps that had to do with the extreme telephoto range used for that famous shot hanging in his office. Or perhaps it was due to the spotting platform being built in the wrong place at the new field. He wasn\u0027t quite sure.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20140929_ksp0428_bumper.jpg\u0022 alt=\u002220140929_ksp0428_bumper.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor some reason this Bumper flight had proceeded without an upper-stage sounding rocket. That discrepancy had been pointed out to Wernher. \u0022The real Bumper 8 had a second stage, so why doesn\u0027t this one?\u0022 Wernher had just shrugged and mumbled something in the Westlander tongue about not wanting to RetCon the old photo to include sounding rockets that hadn\u0027t existed last September. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0017_0044_bumper8.jpg\u0022 alt=\u002220150201_ksp0017_0044_bumper8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rocket reached a peak altitude of 13,405, surprisingly 100 meters higher than what had been achieved by the K-4 launches at Green Springs. Bill was licking his lips, hoping that his solid-fueled sounding rockets would also show such a marked improvement. The flight of Bumper 8 ended when it violently exploded after coming into contact with the ocean just a few kilometers off the Cape.\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Cost[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr][tr]\u003C/p\u003E\u003Cp\u003E[td]Bumper 8[/td][td]4m30s[/td][td]8.0[/td][td]6,847[/td][td]13,405[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EAwk 15-25 Test Flights\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 182-192 - Cape Kerbal\u003C/p\u003E\u003Cp\u003EDEMO-13\u003C/p\u003E\u003Cp\u003EAs it happened the extra 100 meters achieved by the Bumper 8 had been an unexplained anomaly. Bill\u0027s tests of the Awk following that flight had been considerably less performant than he expected. Nothing had changed with the little rocket, but launching from such a low altitude (68m vs whatever the base altitude was at Green Plains) exposed the rocket to more of the thick parts of the lower atmosphere. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0018_0167_awk.jpg\u0022 alt=\u002220150201_ksp0018_0167_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill experimented with adding tilt to the craft at launch so Bob could gather science data from the biomes over the ocean. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0018_0171_awk.jpg\u0022 alt=\u002220150201_ksp0018_0171_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat didn\u0027t always go according to plan.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0018_0175_awk.jpg\u0022 alt=\u002220150201_ksp0018_0175_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENope. Definitely not the plan.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0018_0184_awk.jpg\u0022 alt=\u002220150201_ksp0018_0184_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the end they managed to collect the lower-atmosphere science from the water biomes using the Awk, but only after finding the absolutely perfect launch angle. The VAB crews breathed a huge sigh of relief when the Awk 21 finally pitched over and shot off in a direction \u003Cem\u003Enot\u003C/em\u003E towards where they were standing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150201_ksp0018_0201_awk.jpg\u0022 alt=\u002220150201_ksp0018_0201_awk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Cost[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 15[/td][td]2m43s[/td][td]0.5[/td][td]947[/td][td]4130[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 16[/td][td]2m42s[/td][td]0.5[/td][td]947[/td][td]4129[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 17[/td][td]2m46s[/td][td]0.5[/td][td]947[/td][td]4041[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 18[/td][td]2m46s[/td][td]0.5[/td][td]947[/td][td]4124[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 19[/td][td]1m5s[/td][td]0.5[/td][td]946[/td][td]200[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 20[/td][td]0m9s[/td][td]0.5[/td][td]946[/td][td]75[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 21[/td][td]2m17s[/td][td]0.5[/td][td]946[/td][td]2242[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 22[/td][td]2m12s[/td][td]0.5[/td][td]946[/td][td]2244[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 23[/td][td]2m8s[/td][td]0.5[/td][td]946[/td][td]1205[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 24[/td][td]2m9s[/td][td]0.5[/td][td]946[/td][td]1198[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Awk 25[/td][td]2m10s[/td][td]0.5[/td][td]946[/td][td]1196[/td][td]4.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EGSA 6 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 205 - Cape Kerbal\u003C/p\u003E\u003Cp\u003EDEMO-13\u003C/p\u003E\u003Cp\u003EWith the lackluster performance of the Awk, Bill was concerned his Grep-Sed-Awk high-altitude sounding rocket would no longer reach the upper atmosphere. His fears were confirmed a few days later with the launch of the GSA-6.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0019_0384_gsa6.jpg\u0022 alt=\u002220150215_ksp0019_0384_gsa6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith an upper envelope of only 15km, the GSA would need to be redesigned if it was to find a practical use again. Bill had some ideas though, and was wondering if perhaps there wasn\u0027t a way to use the increasingly popular liquid fuels to power his sounding rockets. \u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Cost[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]GSA 6[/td][td]5m31s[/td][td]2.7[/td][td]1,540[/td][td]15,055[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EJoker 0\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 225 - Cape Kerbal\u003C/p\u003E\u003Cp\u003EDEMO-13\u003C/p\u003E\u003Cp\u003ENobody was really sure how Jeb managed to steal an advanced-prototype K-5 rocket, attach a makeshift capsule atop it, and have it moved out to the launchpad, but nobody was willing to admit to helping him either. Nobody could touch Jebediah Kerman, chosen one of the space lords. But Joe Kerman? They\u0027d hang him in a heartbeat.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0394_joker0.jpg\u0022 alt=\u002220150215_ksp0020_0394_joker0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt had all started a few days earlier, when Jeb, Bill and Bob had started a heated argument with Wernher and his team of rocket goons over the \u0022kapsuul\u0022 he was planning to use for the upcoming Kestrel launches. Wernher was insistent that 3 Kerbals could fit in it. Jeb\u0027s argument was that you could only fit three kerbals in the \u0022kapsuul\u0022 if they had first been turned into green goo. Voices were raised, foreign languages were used, objects were thrown. And then Jeb shoved Wernher and two of his assistants in the \u0022kapsuul\u0022 and closed the door. \u003C/p\u003E\u003Cp\u003E\u0022Hunh. Guess you\u0027re right. I\u0027m still not flying in it with two other kerbals. Make it larger or take out two of the seats.\u0022 Jeb turned and stormed from the room, leaving them stacked uncomfortably on top of each other in the far-too-small capsule. One of Wernher\u0027s other assistants extricated them a few minutes later, but only after he throughly documented his observations.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_9427_joker0.jpg\u0022 alt=\u002220150215_ksp0020_9427_joker0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb never explained where he found his capsule, but it didn\u0027t much matter once the rocket was off the launchpad. The K-5 was a simple rocket, more capable than the K-4 used by the Bumper project, but not enough to lift a kerbal beyond the atmosphere. Jeb didn\u0027t care - he just wanted to see the stars again. He rode the rocket straight up from KSC, firing an explosive decoupler once the rocket had spent its fuel. Just that extra little push.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0405_joker0.jpg\u0022 alt=\u002220150215_ksp0020_0405_joker0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd then they appeared again, twinkling away as the dust layer was cleared, but only for a few seconds. Soon he was falling back towards Kerbin at a high rate of speed. Much faster than he had ever fallen in the X-project planes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0409_joker0.jpg\u0022 alt=\u002220150215_ksp0020_0409_joker0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe chutes popped open just as the K-5 rocket hit the surface. Hard. Jeb was glad nobody had been out for a casual stroll as nothing ruins an afternoon like having a spent rocket stage land on your head. The capsule was coming down right on top of the wreckage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0414_joker0.jpg\u0022 alt=\u002220150215_ksp0020_0414_joker0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb was busy inspecting the rocket carnage when Gene and the recovery teams arrived. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0421_joker0.jpg\u0022 alt=\u002220150215_ksp0020_0421_joker0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGene Kerman, the flight director. Gene Kerman, who was completely unaware of any launches having been scheduled for that particular day. Gene Kerman, the usually level-headed and calm anchor of the new facility. He took one look at Jeb, the crushed K-5 rocket, the burned capsule. The entire scene. Gene was momentarily speechless, waving his arms between the set pieces and actors, finally pointing at Jeb. \u0022You! Have you lost your mind?!\u0022\u003C/p\u003E\u003Cp\u003EJeb glared at him, blinked, then walked silently back to the space center. He\u0027d had enough yelling for one day. His head had a date with a pillow on his bed in the astronaut trailer, and he meant to keep it. To sleep, perchance to dream. Dream a little dream. A dream of the stars.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0422_joker0.jpg\u0022 alt=\u002220150215_ksp0020_0422_joker0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Crew[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Cost[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Joker 0[/td][td]Jebediah[/td][td]6m45s[/td][td]10.3[/td][td]8,585[/td][td]35,470[/td][td]15.4[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T23:03:31Z\u0022 title=\u002206/21/2015 11:03  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003Cbr\u003EOff-by-one error with Joker 0. My inner programmer is crying.\n\u003C/span\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2015-03-09T07:29:44Z","Content":"\n\u003Cp\u003Emy god... it\u0027s full of stars!\u003C/p\u003E\n"},{"CreatedByName":"Railgunner2160","CreatedById":67181,"CreatedDateTime":"2015-03-17T20:55:15Z","Content":"\n\u003Cp\u003EVery much enjoying this!!\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-17T21:41:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Railgunner2160\u0022 data-cite=\u0022Railgunner2160\u0022\u003E\u003Cdiv\u003EVery much enjoying this!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHappy to hear it!\u003C/p\u003E\u003Cp\u003EI was trying to have the next update ready for this past Sunday, but I had a guest in town and spent more time running about than expected. I did at least get to see some cool space stuff during my short vacation:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-20T02:59:50Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EAnny Kerman\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 78 day 187 - Low MÃƒÂ¼nar Orbit\u003C/p\u003E\u003Cp\u003E\u0022Hawk 2 Orbiter, calling Hawk 2 Ground. Come in.\u0022 Anny let his hand up from the transmitter and listened. \u0022Jervan?\u0022 Only silence responded. \u0022Geneble?\u0022 Dead air. He had been in orbit around the MÃƒÂ¼n for two days now. Two days since the lander crew of the Hawk 2 departed for the surface. Two days since all contact was lost. If he stayed any longer he would run out of life support. The ship was already beyond the point where three kerbals could return to Kerbin. The lander would have run out of supplies the day before, but Anny wouldn\u0027t allow that thought to cross his mind.\u003C/p\u003E\u003Cp\u003E\u0022C\u0027mon guys! I\u0027m _NOT_ going to be the \u0027One that came home.\u0027 Please?\u0022 Nothingness and static. He had lost count of the number of times he had orbited over their landing site, but the window for burning back to Kerbin wouldn\u0027t open again for another few days. He looked forlornly out of the window at surface where his friends had landed, wondering what could have happened to them.\u003C/p\u003E\u003Cp\u003EAnd then the radio crackled. A faint voice could be heard against the static. \u0022Anny.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Jervan?!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Anny. We\u0027re safe down here. There\u0027s a base. You can\u0027t go back to Kerbin. They\u0027re looking for you. On your next orbit land at the target site. You remember how to land, right?\u0022\u003C/p\u003E\u003Cp\u003E\u0022C\u0027mon now, you know I landed on The MÃƒÂ¼n already! Next orbit.\u0022 And that was it. The faint voice Anny couldn\u0027t confirm as Jervan was gone. By the time he was approaching the trans-Kerbin injection node he wasn\u0027t even sure it was a real voice. What if it was a MÃƒÂ¼n Siren? Trying to lure him to his death on the MÃƒÂ¼n rocks? No, he was convinced, it was a real voice. He missed the escape node.\u003C/p\u003E\u003Cp\u003EThe landing burn was easy. He set up a course that would bring him down overhead of the landing site so he could conduct a bit of surveillance before setting the orbiter down on the regolith. There would be no return from this landing, and if the Hawk 2 lander was nothing more than debris scattered across the surface of the MÃƒÂ¼n there would be no point.\u003C/p\u003E\u003Cp\u003EHe spotted the giant rover the instant he came to a hover. And the giant flying saucer. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150214_ksp0128_anny.jpg\u0022 alt=\u002220150214_ksp0128_anny.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnny brought the orbiter down near the giant rover. It was a more difficult landing than his previous trip to the MÃƒÂ¼n, both on account of his no longer being a pilot and the lack of landing legs on the orbiter. The engine bell crumpled under the weight of the spaceship above it, and the Hawk 2 orbiter rolled over on its side. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150214_ksp0145_anny.jpg\u0022 alt=\u002220150214_ksp0145_anny.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnny jumped out and looked around the site. To the left was the large flying saucer, the Hawk 2\u0027s lander, and what appeared to be another small lander. In front of him stood the largest rover he\u0027d ever seen. A silhouette waved to him from inside the rover. Jervan? He tried contacting them on his suit radio to no avail, so he walked over. When he got closer a large bay opened at the rear of the behemoth and a ladder descended to the MÃƒÂ¼nar surface, so he climbed aboard.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150214_ksp0137_anny.jpg\u0022 alt=\u002220150214_ksp0137_anny.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe inside was as spacious as it looked from the outside. Two kerbals he didn\u0027t recognize helped him out of his EVA suit and led him into the main cabin. Anny looked around, not seeing Jervan, Geneble, or any kerbal he knew. \u0022What\u0027s going on here? Where\u0027s the rest of my crew.\u0022 His two hosts said nothing and motioned for him to sit down, which he did. \u003C/p\u003E\u003Cp\u003EA third kerbal emerged from a forward cabin carrying headphones. He walked in front of Anny, smiled, then handed him the headphones. \u0022This will explain all your questions.\u0022 Anny put them on. Soft music was playing, a familiar tune he hadn\u0027t heard in decades. Soon afterwards he drifted off into a deep, relaxing sleep. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EAd Lunam - Origins - Around the World in 33 Minutes\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKerbonaut Recruitment Drive\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 232 - Cape Kerbal\u003C/p\u003E\u003Cp\u003E\u0022I\u0027m telling you I\u0027m a pilot. I flew 63 full missions and 22 milk runs, on top of all the barnstorming I did before The War. Look it up!\u0022\u003C/p\u003E\u003Cp\u003E\u0022I have.\u0022 The recruiter tossed a folder across the desk, causing it to flip open and reveal a single page within. He pointed at it. \u0022We ran your name through the computer, and it says you\u0027re a Scientist.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well, the machine made a mistake. I don\u0027t know the first thing about science. Check it again.\u0022\u003C/p\u003E\u003Cp\u003EThe other kerbal grumbled, then spun around to face a terminal behind him. He clacked away at the keyboard for a few moments then paused. \u0022You sure your name is spelled correctly? A. N. N. Y.?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Not A. N. N. I. E.?\u0022\u003C/p\u003E\u003Cp\u003E\u0022I look like a girl to you?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ha! Well you don\u0027t look much like a pilot.\u0022 He slapped at the large \u0022Return\u0022 key on the keyboard. Anny could hear the clicking and clacking of relays and an unidentified whirring noise in the machine. A few minutes later it spat out another sheet of paper, which the recruiter glanced over quickly. \u0022Anny Kerman. Scientst.\u0022 He placed the new page in Anny\u0027s folder, closed it, and placed it atop the stack on his desk. \u003C/p\u003E\u003Cp\u003E\u0022Look, I\u0027m sorry son, there\u0027s nothing I can do for you. The agency specified \u0027pilots only\u0027 so that\u0027s all I can take right now. Maybe come back in a few MÃƒÂ¼nths when they expand the crew roster.\u0022 The recruiter smiled.\u003C/p\u003E\u003Cp\u003EAnny thanked him, pushed away from the desk and was about to leave when a plan hatched inside his cavernous unscientific head. He sat down, leaned back in the chair, propeed his feet up on the desk and grinned at the recruiter. \u0022Y\u0027know, maybe mom spelled my name wrong afterall.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EJoker 1 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 239 - Cape Kerbal\u003C/p\u003E\u003Cp\u003EDEMO-13\u003C/p\u003E\u003Cp\u003EJeb\u0027s \u0022unauthorized\u0022 launch in the Joker-0 had proven that kerbals were ready to fly atop rockets. Wenher, though mildly upset over not being consulted (and that whole business with being stuffed in the \u0022kapsuul\u0022), had gone over Jeb\u0027s design and made some improvements. Improvements that would make the second flight a bit more impressive.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0438_joker1.jpg\u0022 alt=\u002220150215_ksp0020_0438_joker1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe biggest change was the addition of the Songbird upper stage. This extra stage would kick in once the K-5 was spent, hopefully boosting the small capsule above the atmosphere. Also unlike the previous Joker, this launch was managed by the Flight Controllers under Gene\u0027s command.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0443_joker1.jpg\u0022 alt=\u002220150215_ksp0020_0443_joker1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launch was perfect and the Songbird stage carried Jeb and his capsule to 80km, smashing all records and earning Jebediah the title \u0022First Kerbal in Space.\u0022 The capsule was freed from the second stage once reaching apoapsis, kicking itself well away from the now spent Songbird using a pyrotechnic separator. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0450_joker1.jpg\u0022 alt=\u002220150215_ksp0020_0450_joker1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe descent was mostly unremarkable. No flames to speak of, even with coming in at a steep angle. Jeb reported minor heating, but not even as much as he had experienced on the supersonic flights. The single parachute deployed just below 4km, and fully unreefed a few hundred meters above the ground. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0020_0453_joker1.jpg\u0022 alt=\u002220150215_ksp0020_0453_joker1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESomething must have caught the attention of the reporters and staff photographers, as nobody bothered snapping a post-flight picture of Jebediah. First kerbal in space? Why would anyone ever want a photo of that? He even had to walk back to KSC by himself. Strange. \u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Crew[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Cost[/td]\u003C/p\u003E\u003Cp\u003E[td]Apo[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Joker 1[/td][td]Jebediah[/td][td]9m14s[/td][td]12.4[/td][td]10,296[/td][td]80,813[/td][td]28.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EThe Seeker Project\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 days 246-271 - Cape Kerbal\u003C/p\u003E\u003Cp\u003EDEMO-13\u003C/p\u003E\u003Cp\u003EThe success of Jebediah\u0027s Joker launches spurred an interest in \u0022going around again\u0022 or, as the scientists were calling it, \u0022Orbit.\u0022 While Wernher had some of his team working on more efficient engines and fuel tanks with a lower dry mass, he felt it might be possible to place an object into orbit using existing equipment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0021_0482_seeker1-3.jpg\u0022 alt=\u002220150215_ksp0021_0482_seeker1-3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe idea behind the Seeker Project was to combine the K-5 liquid booster and Songbird second stage with one of Bill\u0027s sounding rockets for use as an upper stage. Wernher\u0027s \u0022kapsuul\u0022 was repurposed as the control hub for the two lower stages. A new compressed-gas reaction control system was developed to allow for the spacecraft to orient itself prior to firing the orbital stage, as seen below.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0021_0493_seeker1-2.jpg\u0022 alt=\u002220150215_ksp0021_0493_seeker1-2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETwo thruster blocks were all that was required for the RCS, as that provided both roll and pitch. Yaw control could be achieved by rolling 90 degrees and using the pitch thrusters. This design was used for the first three Seekers, with Seeker 2 being the most successful. (And the only one that reached a deployment altitude greater than 70km.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0021_0500_seeker1-3.jpg\u0022 alt=\u002220150215_ksp0021_0500_seeker1-3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA variety of problems plagued this design. Foremost, the \u0022kapsuul\u0022 was being treated by KSP as the root part, despite being neither the first part added nor the only probe core. So when the sounding rocket stage was fired, focus would remain on the Songbird. This configuration also made it difficult to reach a good deployment altitude. The Seeker 3, a design that had worked previously (in an alternate universe), failed miserably and spun out of control. As a result none of the first three were successful in placing an object in orbit.\u003C/p\u003E\u003Cp\u003EUltimately I decided to scrap the K-5/Sounding Rocket combo and just moved on to placing something in orbit. Anything. Funds were running low, and I really needed to finish off that orbital contract so I could start taking other contracts. Contracts that paid good money. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0021_0525_seeker4.jpg\u0022 alt=\u002220150215_ksp0021_0525_seeker4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI knew the K-5 and Songbird were close to being capable of doing the deed, so, after some minor modifications, that combination was used for the fourth and final Seeker mission. Gone was the heavy RCS system, replaced by engines with gimbal (the modern LV-909) and a weak \u0022black magic\u0022 force called torque from the \u0022kapsuul\u0022. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0021_0533_seeker4.jpg\u0022 alt=\u002220150215_ksp0021_0533_seeker4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESome experiment modules were optimistically placed atop the rocket in the hopes they would be returned to Kerbin. It was a negligible added mass for a huge potential return in science data. Thanks to these changes and the upgraded Songbird, the Seeker 4 became the first artificial satellite of Kerbin crafted by the hands of kerbals. Yet it couldn\u0027t stay in orbit for long.\u003C/p\u003E\u003Cp\u003EBatteries. Batteries. Batteries. Power. Always a problem in the early game. Not only do probe cores suck down energy at an incredible rate, but there is no way to get it back in the early game without using a LV-T30 or LV-T45 engine. So, as much as I would\u0027ve like to have left the Seeker 4 in orbit for mÃƒÂ¼nths or even years, it had to return after a single orbit. The science it had gathered was useless if it was always 74kms up.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0021_0546_seeker4.jpg\u0022 alt=\u002220150215_ksp0021_0546_seeker4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter one orbit the Seeker 4 used its black magic to reorient itself retrograde and burn. I knew my only hope of recovering the science was to land the \u0022kapsuul\u0022 on solid Kerbin, as the force of impact with the Songbird still attached would be fatal with a water landing. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150215_ksp0021_0553_seeker4.jpg\u0022 alt=\u002220150215_ksp0021_0553_seeker4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd I failed. The spacecraft exploded upon coming into contact with Kerbin\u0027s Ocean, the debris sinking to the deep blue bottom of Jeb\u0027y Kerman\u0027s Locker. All that science data lost forever.\u003C/p\u003E\u003Cp\u003EThe Seeker 4 was the end of an era on Kerbin. Rocketry was now an accepted pursuit, with engineers and scientists flocking to Cape Kerbal from all over the planet. With crew\u0027d spaceflight having been proven safe by Jebediah, and orbital spaceflight having been proven possible by Wernher, the DEMO program was ready to move to its next stage: Placing a kerbal into orbit. With that new purpose came a new name - DEMO 18.\u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Expense[/td]\u003C/p\u003E\u003Cp\u003E[td]Income[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Seeker 1[/td][td]14.4[/td][td]12,001[/td][td]4,587[/td][td]7.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Seeker 2[/td][td]13.7[/td][td]11,359[/td][td]0[/td][td]1.7[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Seeker 3[/td][td]13.9[/td][td]11,684[/td][td]0[/td][td]0.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Seeker 4[/td][td]14.3[/td][td]11,020[/td][td]60,244[/td][td]40.0[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKestrel 1 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYear 1 day 324 - Cape Kerbal\u003C/p\u003E\u003Cp\u003EDEMO-18\u003C/p\u003E\u003Cp\u003EThere was considerable debate amongst the kerbonaut corps as to who would be first to orbit the planet. Jebediah was the logical choice, being the only kerbal to prove he could live in space. The two new pilots, Annie and Jenzer, were also considered front-runners for the flight. Nobody expected Bill or Bob to be first. (Few understood why they were part of the kerbonaut corps in the first place.)\u003C/p\u003E\u003Cp\u003EThere was no rush for the administration to choose however, as upgrades for the launchpad and other facilities were required before the Kestrel Program could begin. The larger mass and taller rockets required for placing a kerbal into orbit necessitated improvements, as a strange mystical prompt kept alerting the VAB crew to the excessive height and mass of everything they tried to launch. Even something as small as the Kestrel.\u003C/p\u003E\u003Cp\u003EAnd so 50 days later the first craft rolled out to the new launchpad. A small bird of prey with a smaller passenger, none other than Jebediah Kerman. Rumours were circulating that Jeb had threatened to \u0022take his capsule and go home\u0022 and no one was interested in using Wernher\u0027s 3-body \u0022kapsuul,\u0022 so all objections were dropped.\u003C/p\u003E\u003Cp\u003EGene had his small flight operations crew assembled in Mission Control, each controller prepared for the thousand different ways everything could go wrong. Behind him were more reporters than he could remember ever seeing, all crammed into the small press box they jokingly called the fishbowl. Wernher was pacing nervously at the back of the room, and would occasionally give the camera-wielding occupants of the fishbowl an artificial smile. Gene got his attention and waved him into the Flight Director\u0027s trench.\u003C/p\u003E\u003Cp\u003E\u0022Doctor von Kerman.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Herr Kerman.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Call me Gene.\u0022 He flipped a switch on his console to start the countdown and turned back to Wernher. \u0022So, anything peculiar we should expect from this new bird of yours? Or are you normally this nervous?\u0022\u003C/p\u003E\u003Cp\u003EThe famous Westlander rocket scientist shook his head. \u0022No, just always nervous. The Kestrel is only the K-5 wrapped in the smaller shell, built using more modern components and more efficient engines. Fewer tanks, lower mass, new name.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Kestrel, yes. One of the smaller birds of prey. I can only guess you have plans for the future. Right?\u0022\u003C/p\u003E\u003Cp\u003EWernher smiled. \u0022Ve shall see, yes?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150222_ksp0022_0001_kestrel1.jpg\u0022 alt=\u002220150222_ksp0022_0001_kestrel1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGene turned a knob to free his headset from the foot pedal and stood up from his station. \u0022Controllers, we need a go / no-go for flight.\u0022 He glanced around the small Mission Control room and started calling out each station\u0027s ID, getting an affirmative \u0022Go\u0022 from each. \u0022Launch control, we\u0027re Go across the board, all lights green. Let\u0027s light this bird.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Copy flight\u0022 came the response from the kerbal at the very front of the room. The launch controller\u0027s job was the easiest in the room: Count down from 10 and press the large red button that dominated his console. Upon reaching zero he enthusiastically smacked the button with both hands. An electrical circuit closed, generating a pulse. The signal raced along the wires between the mission control and the launchpad at the speed of light, triggering a relay that toggled a solenoid that opened the fuel and oxidizer valves at the base of the Kestrel. Sparks were followed by flames followed by a river of fire, and Jebediah Kerman was away. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150222_ksp0022_0003_kestrel1.jpg\u0022 alt=\u002220150222_ksp0022_0003_kestrel1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe roar from rocket was drowned out by the roar from the press room. Gene thought for a moment the back wall of the building might have fallen off again then realized it was just the sound of applause, cheers, camera shutters and the raucous roar of the reporters. He elbowed at Wernher motioned back towards them with his thumb. \u003C/p\u003E\u003Cp\u003E\u0022Where\u0027d they get these guys? The sports desk?\u0022 \u003C/p\u003E\u003Cp\u003EWernher shrugged. \u0022Perhaps a few of them?\u0022 Completely missing the joke.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150222_ksp0022_0013_kestrel1.jpg\u0022 alt=\u002220150222_ksp0022_0013_kestrel1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Kestrel let out its final screech just as the Songbird stage started to sing. Telemetry showed a good ascent profile and perfect performance from Wernher\u0027s new engines. Gene buzzed the Flight Surgeon to get a report on Jeb and got a big smile and a thumbs up as a response. \u003C/p\u003E\u003Cp\u003E\u0022Flight, Booster. We show Songbird cutout.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Copy Booster. Fido?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah flight. We show good injection. Kestrel is in orbit with an apoapsis above 111km and a periapsis somewhere near 72km.\u0022\u003C/p\u003E\u003Cp\u003EGene smiled and shook his fist in victory. \u0022Copy Fido. CapCom? Let Jebediah know the good news. Good job kerbals, but we\u0027ll hold our celebrations until Jeb\u0027s Kerbin-side again.\u0022 \u003C/p\u003E\u003Cp\u003E\u0022Flight, CapCom.\u0022 Bill took his foot off of his headset footpedal and cleared his throat before continuing. Gene heard it regardless, given that his station was a mere 4 feet behind the CapCom. \u0022Showing LOS on Kestrel 1. Reacquisition in 30 minutes, give or take.\u0022\u003C/p\u003E\u003Cp\u003ELoss of Signal was an expected condition, as they had only built a handful of ground relay stations and so far there were no relay satellites in orbit. Twenty nine minutes later Jebediah\u0027s voice came booming over the feed. He was ranting about the emptiness of space, a large glowing disc on the far side of the planet, and a huge, endless desert stretching across the other continent. \u003C/p\u003E\u003Cp\u003EOn the next orbit Jebediah made his intentions clear: He was going to land in this new desert, somewhere just west of Puerto Kabat. \u0022Look, there\u0027s friendlies in Kabat, so worst-case scenario I have to hike through some sand. I\u0027ll be fine.\u0022\u003C/p\u003E\u003Cp\u003EGene motioned to Bill to patch him through directly. \u0022Kestrel, Flight. That\u0027s a negative on the desert landing. We can\u0027t have kerbonauts dropping down in enemy territory without prior authorization. Wouldn\u0027t want to start another war, now would we?\u0022 Gene waited a few moments for a response. Nothing. \u0022Kestrel?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah, I heard you flight. Unless something has changed in the last few mÃƒÂ¼nths, Kabat is not one of the constituent states of the CCHR. Investigating the scale of the impact event would be helpful, correct?\u0022 Bill motioned at Gene, indicating LOS was just a few seconds away. \u0022Besides, I\u0027m Jebediah Kerman. What could possible go....\u0022 \u003C/p\u003E\u003Cp\u003E\u0022Flight, CapCom. Showing LOS on Kestrel 1.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Copy CapCom.\u0022 Gene ripped off his headset and tossed it at his station. He picked up his coffee cup to take a drink, only to find it empty. \u0022Ok kerbals, we\u0027ve got 30 minutes until Jebediah comes around again. More than likely we\u0027ll get a call from the defense minister long before then asking about some unknown spacecraft landing in enemy territory. So if you need a break, now\u0027s the time.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EThe Jebediah Kerman was not one to be dissuaded by a grumpy Flight Director. He knew perfectly well he had nothing to fear from landing at Puerto Kabat, mainly because he\u0027d spent more than a year there during the early part of The War. He had friends there. His old restaurant as there. He could probably even buy a new plane there if he wanted. What could he possibly have to worry about?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150222_ksp0022_0019_kestrel1.jpg\u0022 alt=\u002220150222_ksp0022_0019_kestrel1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EExploding on reentry would be a good place to start. He hadn\u0027t really expected the Songbird stage to melt during reentry, and perhaps it hadn\u0027t, but the flames shooting past the small window in his capsule were telling a different tale. They eventually were bad enough that he gave in and jettisoned the nearly empty tank and its engine. \u0022Could\u0027a sold that for scrap.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150222_ksp0022_0021_kestrel1.jpg\u0022 alt=\u002220150222_ksp0022_0021_kestrel1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMoments later the flames stopped. The capsule quickly sank into the thick air, and soon the noise form the wind was obvious. The chutes popped, unreefed, and fully deployed. And then he was down. The sand sprayed up in a geyser following the impact, and the capsule sinking down into the soft upper layer of dust. He wasted no time jumping out.\u003C/p\u003E\u003Cp\u003E\u0022Last time I was here\u0022 he said to no one in particular, \u0022there was a road along the coast. He looked behind him to the open waters, nothing but sand. He looked up the hill to the top of the ridge. Nothing but sand. \u0022This doesn\u0027t make any sense.\u0022 He grabbed the survival pack from the capsule, ditched his helmet, and started hiking for the top of the ridge. He\u0027d get a better view from up there, right?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150222_ksp0022_0029_kestrel1.jpg\u0022 alt=\u002220150222_ksp0022_0029_kestrel1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe climb through the loose sand and ash was difficult, the view at the top even moreso. \u0022Impossible.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150222_ksp0022_0030_kestrel1.jpg\u0022 alt=\u002220150222_ksp0022_0030_kestrel1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhere once the bustling country of Kabat had stood there was now only an ocean of sand. An empty feeling enveloped Jeb, a sensation that something was simply not right here. He took in the endless desert for a few moments more then started back down the hill to his capsule and the coastline beyond. Surely he could make it to Puerto Kabat if he just followed the coast, right? \u003C/p\u003E\u003Cp\u003EHe was trudging eastward along the coast when the CCHR patrol found him. \u003C/p\u003E\u003Cp\u003E[table=class: grid, align: left]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E[td]Mission[/td]\u003C/p\u003E\u003Cp\u003E[td]Crew[/td]\u003C/p\u003E\u003Cp\u003E[td]Duration[/td]\u003C/p\u003E\u003Cp\u003E[td]Mass[/td]\u003C/p\u003E\u003Cp\u003E[td]Expense[/td]\u003C/p\u003E\u003Cp\u003E[td]Income[/td]\u003C/p\u003E\u003Cp\u003E[td]Science[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[tr][td]Kestrel 1[/td][td]Jebediah[/td][td]1h14m0s[/td][td]13.4[/td][td]11,022[/td][td]33,897[/td][td]14.2[/td][/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:35:21Z\u0022 title=\u002206/21/2015 10:35  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Railgunner2160","CreatedById":67181,"CreatedDateTime":"2015-03-20T20:50:13Z","Content":"\n\u003Cp\u003EAwesome!!! Can\u0027t wait to see where the story goes from here!!!\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2015-03-23T05:20:18Z","Content":"\n\u003Cp\u003EShoot. Is the final reset imminent?\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-23T14:07:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meve12\u0022 data-cite=\u0022meve12\u0022\u003E\u003Cdiv\u003EShoot. Is the final reset imminent?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn a street corner in Kerbin City stands an old kerbal. Some call him Krazy Pete, most just ignore him. His two large sandwich boards are ragged with age, yet still legible. One side reads \u0022The Reset is Nigh!\u0022 the other \u0022The Cycles Are Upon Us!\u0022 His clothes seem a bit on the rough side, but who would expect any different? His hair is thin and disheveled, his eyes wild with bewilderment. He shows up every morning, buys a cup of coffee from Lengee or Billzer Kerman at the local diner, then spends the rest of his day preaching on the street corner. Flailing his arms in front of the non-believers. Screaming the truth into ears that have been plugged by complacency and contentment. Trying to get kerbals to listen to the good word. The true word. The only word.\u003C/p\u003E\u003Cp\u003EThe Release is Imminent.\u003C/p\u003E\n"}]}