{"TopicId":80949,"ForumId":51,"TopicTitle":"Ramshackle Space Industries","CreatedByName":"Steppanwolf","CreatedById":118087,"CreatedDateTime":"2014-08-06T18:05:30Z","PageNum":1,"Articles":[{"CreatedByName":"Steppanwolf","CreatedById":118087,"CreatedDateTime":"2014-08-06T18:05:30Z","Content":"\n\u003Cp\u003ERamshackle Space Industries is a game session I have designed using KSP 0.23.5, modeled in a similar notion to Scott Manley\u0027s two YouTube series\u0027 \u0022Reusable Space Program\u0022 and \u0022Interstellar Quest\u0022. I am not going for a 100% reusable space program , nor am I going for interstellar travel, but I loved the premise that travel to the moons and planets is an every day occurrence for Kerbals to work/play, and I love the more realistic difficulties factored in from the modlist of IQ.\u003C/p\u003E\u003Cp\u003EHence, in my game session, I am playing with the following core mods:\u003C/p\u003E\u003Cp\u003EFerram Aerospace\u003C/p\u003E\u003Cp\u003ERemote Tech 2\u003C/p\u003E\u003Cp\u003ETAC Life Support\u003C/p\u003E\u003Cp\u003EVanguard Parachutes\u003C/p\u003E\u003Cp\u003E* I was also going to use Deadly Re-Entry, but could not find a 0.23.5-compatible build as I attempted to add it after 0.24 was released. I plan on adding this once all other mods have been updated to the current KSP version \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo add flavor to the builds, I am using:\u003C/p\u003E\u003Cp\u003EKW Rocketry\u003C/p\u003E\u003Cp\u003EB9 Aerospace\u003C/p\u003E\u003Cp\u003EKethane\u003C/p\u003E\u003Cp\u003EKerbal Attachment\u003C/p\u003E\u003Cp\u003EInfernal Robotics\u003C/p\u003E\u003Cp\u003EFor planning and performing various mission plans in-game, I am using:\u003C/p\u003E\u003Cp\u003EKerbal Engineer\u003C/p\u003E\u003Cp\u003EMechJeb\u003C/p\u003E\u003Cp\u003EEnhanced Navball\u003C/p\u003E\u003Cp\u003EDocking Port Alignment\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock\u003C/p\u003E\u003Cp\u003EScanSat\u003C/p\u003E\u003Cp\u003ELast but not least, to add to the beauty and immersement (is that a word?) factor, I am also using:\u003C/p\u003E\u003Cp\u003EEnvironmental Enhancement and Better Atmospheres\u003C/p\u003E\u003Cp\u003EChatterer\u003C/p\u003E\u003Cp\u003ETo keep everything running smooth, I am using Active Texture Manager.\u003C/p\u003E\u003Cp\u003ENow that the preliminaries are out of the way, here\u0027s what I have accomplished thus far...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E***Oh, and a quick edit:\u003C/strong\u003E Forgot to mention that I will be playing from a perspective of \u0022no simulations\u0022. If the craft launches, it launches. No reverts. Also no quicksaves and quick loads. From a game perspective...yeah, it stinks. But from a story-telling perspective, it adds the chaotic element of surprise. Especially if a craft suddenly explodes in true Kerbal fashion (i.e. no reason whatsoever)\u003C/p\u003E\u003Cp\u003E---------------------------------\u003C/p\u003E\u003Cp\u003ERamshackle Space Industries has answered the call of the Kerbals who have long gazed up at the heavens and wondered what it would be like to visit these places; to live, work and play in the red fields of the Dunan sand fields; to perfectly float in the thick, hazy oceans of Eve; to attempt the planetary confectionary conversion of Minmus. It has developed the rudimentary elements of space flight and travel thanks to the heroic efforts of founding Kerbonauts Bill, Bob and Jebediah. Now it\u0027s time for other recruits to step forward and write their own chapters of history in the book of Kerb.\u003C/p\u003E\u003Cp\u003ETo keep a healthy public image, an emphasis has been placed on developing robotic elements for initial exploration. An array of communication satellites have been launched into low Kerbin orbit, as well as a handful into Synchronous Equatorial Orbit. Now it was time to expand that mission to the Mun...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-06T19:01:40Z\u0022 title=\u002208/06/2014 07:01  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 6, 2014\u003C/time\u003E by Steppanwolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-08-07T01:35:20Z","Content":"\n\u003Cp\u003ECan\u0027t wait to hear what happens\u003C/p\u003E\n"}]}