{"TopicId":82876,"ForumId":51,"TopicTitle":"The ill fate of the Kopernikus Program","CreatedByName":"Blind Dead McJones","CreatedById":109600,"CreatedDateTime":"2014-08-26T02:32:38Z","PageNum":1,"Articles":[{"CreatedByName":"Blind Dead McJones","CreatedById":109600,"CreatedDateTime":"2014-08-26T02:32:38Z","Content":"\n\u003Cp\u003EThe Kopernikus program was the much anticipated Minmus exploration program designed as a follow-up of the successful Magellan series of Mun Landings. The Magellan program was a Kerbal landmark in that it was the first manned exploration of the surface of another world. It was decided after nine landings that it was a good time to think of making the next step to Minmus, not the least of which being that Magellan landings had become almost routine at this point and even Kerbals at KSC were beginning to grow bored with it.\u003C/p\u003E\u003Cp\u003EIn addition to creating a new distance record from Kerbin, the Kopernikus program was also designed to reach another milestone in space exploration: the establishment of the first long-term habitat for Kerbals in outer space, a concept quickly named the \u0022space base\u0022. The finished design had living space for four Kerbalnauts and also had a science lab that would allow for greater experimentation on site.\u003C/p\u003E\u003Cp\u003EThe Kerbalnauts Kirk Kerman, Shelsby Kerman, and Adbree Kerman were selected for the first crew of the project and became the first Kerbals to walk on Minmus. The base, along with a rover containing the experiments to be done in the field, were launched and successfully landed in the Greater Flats region of Minmus.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y1wg0xr.png\u0022 alt=\u0022y1wg0xr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NIEqG18.png\u0022 alt=\u0022NIEqG18.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was here that we encountered the first problem. The rover and the lab were designed to form a connection which allows the lab workers to extract the scientific information and reset the experiments contained within. The design worked in ground tests, but someone forgot to include the winch on the base which allows the rover to connect through the front mounted port. Jebediah Kerman was assigned to fly a tiny, hastily built lander carrying a pipe system to the base, and the lead engineer in charge of the base build team was sacked.\u003C/p\u003E\u003Cp\u003EIt should be noted that the initial investment of the base was over 150,000 funds, with the rover costing another 20k. The emergency servicing of the base cost an additional 20k funds, delayed the start of the exploration for a week, and even delayed Magellan 10 to which Jebediah was assigned. The hopes that the Kopernikus Program would be less expensive than the Magellan Program were beginning to look like a fool\u0027s hope. The lead accountant was sacked.\u003C/p\u003E\u003Cp\u003EHoping that all our troubles were behind us, the team on Minmus began work. The experiments in Greater Flats, which were conducted nearby, went smoothly. However, soon it was necessary to drive farther. Adbree drove over to the nearby slopes, but the low gravity and the apparent lack of traction made driving even on flat ground surprisingly difficult even on flat ground (Adbree himself compared it to driving \u0022some sort of hovercraft\u0022). Worse still, when he reached the slopes his rover showed a tendency to flip end over end at the slightest provocation. On top of all this, some bright spark in the engineering team thought that a single RTG was adequate to power a four-wheel drive vehicle across the whole of the surface of Minmus. Adbree was forced to stop frequently to let the batteries recharge, and the engineer who designed the rover was thrown in a sack.\u003C/p\u003E\u003Cp\u003EDespite this hardship, Adbree succeeded in returning to base having completed a round of experiments to be processed by Kirk and Shelsby. This took almost and entire day despite the total distance driven being no more than 5 km. Mission control decided to continue with the program despite the slow pace. One engineer suggested that the problem might be with the rover, and that a better design with more power and maybe better traction provided with something like tank treads would make the mission more efficient and be able to cover ground faster. This was immediately rejected as being too much hassle and the engineer was sacked by the Kerbin Kowboys.\u003C/p\u003E\u003Cp\u003EThe decision was made to press on. The next destination was the midlands, which took the rover even farther, and then to the lowlands which were farther still. This process took several days and led to some dangerous situations with the rover tumbling around on the slopes. Adbree began to complain that he felt this was too dangerous to continue, and crew morale plummeted. Since they were still in space and could not be sacked, their concerns were heard.\u003C/p\u003E\u003Cp\u003EAfter much deliberation, it was decided to write the whole program off as a loss. A high capacity lander was designed and built to bring the crew back to Kerbin, and any equipment that could be salvaged was returned as well. In the wake of the program\u0027s premature termination, a new program called the Kepler Program was hastily drawn up as a new Minmus exploration program. The Kepler lander\u0027s suspicious resemblance to the Magellan lander was entirely coincidental.\u003C/p\u003E\u003Cp\u003EThe visionary of the Kopernikus program could not be sacked because he had tenure. Instead, he was promoted to management.\u003C/p\u003E\n"}]}