{"TopicId":85878,"ForumId":51,"TopicTitle":"MISTAC Mission Logs [Community Project]","CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2014-10-02T00:02:54Z","PageNum":1,"Articles":[{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2014-10-02T00:02:54Z","Content":"\n\u003Cp\u003E\u003Cem\u003ETo join, please visit the \u003C/em\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/87255-Community-mission-log-project-Registration-Open\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003Eregistration thread\u003C/em\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt had been a long time since The Great War. A long time. The Kerbal race had reconsructed itself from the war and ensung anarchy that left their civilization in ruins. There was peace. There was prosperity. There was... boredom.\u003C/p\u003E\u003Cp\u003EKerbin had been fully conquered. From the first explorers who crossed the seas, to the brave Kerbals who trekked across the arctic to the poles, and the brilliant minds who invented the airplane. There was nothing new about Kerbin. Nothing was happening. So the leaders of Kerbin got together to start a program that would bring excitement to the Kerbal race. They founded MISTAC (pronounced mistake:P), whick stands for the Ministry of International Space Travel And Colonization. It had one goal: To explore space. The last great frontier. This is their story. This is when Kerbals became one with the stars.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-02T00:43:15Z\u0022 title=\u002210/02/2014 12:43  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 2, 2014\u003C/time\u003E by FishInferno\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2014-10-02T00:26:40Z","Content":"\n\u003Cp\u003EMISTAC has one clear goal: Put a Kerbal in space. We are pleased to announce the plans for accomplishing that goal. \u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EPROJECT SHEPARD:\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWe are pleased to announce Project Shepard, the series of missions to kickstart the space program. \u003C/p\u003E\u003Cp\u003EKerbonauts:\u003C/p\u003E\u003Cp\u003EThe first round of Kerbonauts are highly skilled test pilots who were handpicked fro a group of a hundreds or so candidates:\u003C/p\u003E\u003Cp\u003ELuke Kerman \u003C/p\u003E\u003Cp\u003EEnder Kerman \u003C/p\u003E\u003Cp\u003EShifty Kerman \u003C/p\u003E\u003Cp\u003EJand Kerman \u003C/p\u003E\u003Cp\u003EKurt Kerman \u003C/p\u003E\u003Cp\u003ES.C. Kerman Jr. \u003C/p\u003E\u003Cp\u003EMorf Kerman \u003C/p\u003E\u003Cp\u003EJet Kerman\u003C/p\u003E\u003Cp\u003EWe are confident that they all have the skills required to complete their assigned missions.\u003C/p\u003E\u003Cp\u003EHardware:\u003C/p\u003E\u003Cp\u003EWe are very excited to show you the first spacecraft to be used by the Kerbals. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69020-KnoefCo-Space-Administary-HIRING-STOCK-REQUESTS\u0022 rel=\u0022external nofollow\u0022\u003EKnoefCo Space Administrary\u003C/a\u003E, a new company dedicated to building space hardware, has built us the Caelum orbiter.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/2nsb1uh.png\u0022 alt=\u00222nsb1uh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut in order to get something to space, you need a rocket. Rune\u0027s Slightly Used Vehicles, a popular aeronautics company thta is entering the space industry, has built us Dawn, a powerful rocket that uses solid-fuel engines to reduce costs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/2pqswap.png\u0022 alt=\u00222pqswap.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUsing these vehicles, we will conduct several missions into low Kerbin orbit:\u003C/p\u003E\u003Cp\u003EUnmanned test mission: An unmanned Dawn/Caelum will be launched into LKO to test systes and put the first satellite into LKO. Then it will preform a planned reentry and land in the ocean East of KSC, as will all missions below.\u003C/p\u003E\u003Cp\u003EOrbital flight: S.C. Kerman Jr. will fly the Dawn/Caelum into orbit, becoming the first Kerbal in space.\u003C/p\u003E\u003Cp\u003EPolar orbit/first spacewalk: Jand Kerman will preform the first EVA to prove that Kerbals can work outside their spacecraft. This will also be a polar orbit.\u003C/p\u003E\u003Cp\u003ERendezvous: Shifty Kerman will fly int orbit and wait for Kurt Kerman to also launch and meet up with him in space. This is testing a complex maneuver that will later be used on ore complex missions.\u003C/p\u003E\u003Cp\u003EThe unmanned test is coming u soon, so stay tuned!\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2014-10-02T01:10:50Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/2llc6d1.png\u0022 alt=\u00222llc6d1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe night before the launch, Dawn is illuminated as it sits on the pad.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/25t89aa.png\u0022 alt=\u002225t89aa.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe next morning, the tower is decoupled as the rocket begins the final countdown.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/2qdmvx3.png\u0022 alt=\u00222qdmvx3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E10, 9, 8, 7, 6, 5, 4, 3, 2, 1, and IGNITION and we have a liftoff of the Dawn rocket carrying the Caelum into orbit!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/o8cdhk.png\u0022 alt=\u0022o8cdhk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWe have cleared the tower.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/awuq15.png\u0022 alt=\u0022awuq15.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe rocket ascends over KSC on a growing pillar of fire and smoke.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/2zqflzb.png\u0022 alt=\u00222zqflzb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ELess than a minute later, Dawn is already piercing the clouds\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/e99lrq.png\u0022 alt=\u0022e99lrq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJust above could level, the first stage burns out and the second stage ignites, continuing to boost the Caelum higher and higher\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/2h332hs.png\u0022 alt=\u00222h332hs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EAt 10 kilometers in altitude, Dawn begins to pitch over in order to gain horizontal velocity.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/69jpc1.png\u0022 alt=\u002269jpc1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe second stage dies out, and the third sage liquid rocket engine kicks in\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/6eqkuq.png\u0022 alt=\u00226eqkuq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EDawn pitches over until it is nearly horizontal, roughly 80km east of KSC\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/2qsnwbb.png\u0022 alt=\u00222qsnwbb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe third stage engine cuts out, but the Caelum is not separating from Dawn due to an issue with the fairing.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/b3qx6x.png\u0022 alt=\u0022b3qx6x.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENow losing altitude, the capsule is separated from the jammed service module and prepared for reentry. At lease we can still test the heatsheild.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/264gxax.png\u0022 alt=\u0022264gxax.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ESmall traces of flames dance around the capsule, but it is predicted that this is not as much as a normal reentry.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/14t2azo.png\u0022 alt=\u002214t2azo.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe capsule deploys its parachute just above the clouds.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/2qxqgxh.png\u0022 alt=\u00222qxqgxh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe parachute fully deploys 500m above the water\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/sw4tw7.png\u0022 alt=\u0022sw4tw7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe capsule makes a safe splashdown far east of KSC\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe mission is considered a failure, but several fundamental elements of the craft were able to be tested. RSUV is hard a work resolving the problem and the next flight should proceed as planned, with a few delays to the schedule.\u003C/p\u003E\n"}]}