{"TopicId":97920,"ForumId":51,"TopicTitle":"Subzero\u0026#039;s Cosmic Adventures","CreatedByName":"SubzeroSpartan7","CreatedById":100972,"CreatedDateTime":"2015-01-26T21:58:42Z","PageNum":1,"Articles":[{"CreatedByName":"SubzeroSpartan7","CreatedById":100972,"CreatedDateTime":"2015-01-26T21:58:42Z","Content":"\n\u003Cp\u003EUnlike previous threads, I intend on updating this one frequently. This will be a collection of all of my adventures in KSP (with mods). I decided to do this after the ridiculousness that was my manned Eve mission, which resulted in three out of seven of my ascent engines breaking off before toppling over for no apparent reason 5 minutes later, and my rover landing over 100 km away and during the drive to the lander splitting in half. The first mission will probably be to Laythe with a rover a spaceplane and possibly some other equipment.\u003C/p\u003E\u003Cp\u003EOk so the first installment (or whatever you want to call it) will probably be delayed for 2 reasons.\u003C/p\u003E\u003Cp\u003E1. I am encountering a metric ton of bugs even though the only plugins I have installed are Karbonite (which worked perfectly for me in a test game) and distant object enhancement. I am not sure what is causing the large issues. It is to the point where I might go stock with this for a little. The game is crashing literally, as in the original definition, every other time I load up a craft.\u003C/p\u003E\u003Cp\u003E2. I suck at building compact SSTO\u0027s. I am decent at building space plane, and I am decent at building large SSTO\u0027s, but for some reason I have this mental disconnect when building small compact SSTO\u0027s. This wouldn\u0027t be as much a problem if, you know, I could actually test fly the plane without having to wait 5 minutes for the game to load up again because the game crashed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-29T01:56:09Z\u0022 title=\u002201/29/2015 01:56  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 29, 2015\u003C/time\u003E by SubzeroSpartan7\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SubzeroSpartan7","CreatedById":100972,"CreatedDateTime":"2015-02-19T01:37:01Z","Content":"\n\u003Cp\u003EWow, that took way too long to release. Like way, way too long. Well anyways the first installment is here and it is way shorter than the rest will be because the only thing we are doing today is launching the core for Delphi station. With my new naming convention system all of my stations will be named after ancient Greek cities, my manned spacecraft (besides landers) will be named after stars, my landers and aircraft will be named after birds, and other craft will be whatever the heck I want them to be, however they won\u0027t be random names that I make up. May I say how long it took to get this working. Apparently I had a .90 version that for some reason was magic and works with mods while any other .90 save didn\u0027t. I also decided to use CKAN to make my life a lot easier. Anyways here we go finally. Also, I will be making these into YouTube videos as well if you prefer that content or want to see it done differently (includes dialog between characters as an intro).\u003C/p\u003E\u003Cp\u003ESo with the government here being based around the idea of space exploration, we have basically an infinite budget as long as we complete our missions to an acceptable level of success. So the new budget was for the Excalibur Project, a large exploration program that was going to go places where no kerbal had gone before. So every kerbonaut was kept in the dark about the project except Bill in order not to get everyone hyped up. However it is pretty hard to hide a massive rocket on the pad. Actually we are pretty sure it is impossible unless it was underground. So Bill explained the project to Jeb on launch day. The first plan was to set up a Kerbin and Mun station and then explore every planet in the system. Jeb was extremely excited to get the ball rolling on space exploration again, the last place he landed on was Ike. But he had to wait for the launch of the space station aboard the new class of rockets the KSC engineers had come up with. The launch of the station core for Delphi station went without a hitch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yjhlw4r.png\u0022 alt=\u0022yjhlw4r.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(I have no idea why this is so blurry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E)\u003C/p\u003E\u003Cp\u003EThis is the launch vehicle and the station core on the pad.\u003C/p\u003E\u003Cp\u003EThe launch as I said went perfectly however the engineers are looking into the amount of performance we lost after the separation of the SRBs due to a miscalculation of our TWR. We lost velocity for a bit and the velocity vector went way below the actual orientation of the rocket. It has been estimated as negligible as the mission was completed successfully but considering the previous error that caused this situation in the first place has some higher-ups doubting. If this continues to be a problem the rocket will most likely have to be redesigned.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/ssX5VRK.png\u0022 alt=\u0022ssX5VRK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the station core with the second stage just after fairing separation.\u003C/p\u003E\u003Cp\u003EAfter reaching its orbit the station maneuvered away from the upper stage and went into a normal facing orientation and deployed its dual solar panels which will be removed on a later flight by an EVA crew. The second stage was then de-orbited by Jeb (who remotely controls all launches when he is there) but in his excitement to get this project started, he almost dropped the stage on top of a city. Jeb was reprimanded for this, however he will still be making the first flight to the station after the next to modules come up. Anyways, the ground control now has to focus there efforts on getting the station ready for its service life and some small station keeping tasks so that\u0027s it for now. Next time we will cover the launch and docking of the first two modules and the first launch of the Vega manned spacecraft.\u003C/p\u003E\u003Cp\u003ESo here is the YouTube video:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/CEVXAyw6I20?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-19T20:02:26Z\u0022 title=\u002202/19/2015 08:02  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 19, 2015\u003C/time\u003E by SubzeroSpartan7\u003C/strong\u003E\n\u003Cbr\u003EThe imgur links were broken.\n\u003C/span\u003E\n"}]}