{"TopicId":212284,"ForumId":119,"TopicTitle":"What did you do in KSP2 today?","CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2023-02-24T05:24:05Z","PageNum":10,"Articles":[{"CreatedByName":"FuelX","CreatedById":163054,"CreatedDateTime":"2023-02-26T04:38:08Z","Content":"\n\u003Cp\u003E\nA space truck with a trailer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yXDoNEs.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yXDoNEs.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-26T05:02:20Z\u0022 title=\u002202/26/2023 05:02  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 26, 2023\u003C/time\u003E by FuelX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sp1f","CreatedById":213244,"CreatedDateTime":"2023-02-26T05:01:58Z","Content":"\n\u003Cp\u003E\nMy second session today!\n\u003C/p\u003E\n\u003Cp\u003E\nLast night I only had about an hour to play. I designed a simple orbiter and launched it with Jeb in the command module, just trying to get to orbit and return. I successfully got to orbit and found that I still had about 2000 \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E. That was all the time that I had.\n\u003C/p\u003E\n\u003Cp\u003E\nToday, I decided that I should use some of that extra \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E to go and orbit the Mun. I was a little confused by the changes to the navigation process. For example, after my injection burn, I had a Mun periapsis of about 50km. This number immediately began to shrink, as if I was still under a very slight acceleration. When I time warped for a short period, my trajectory stabilized, but when I came out of time warp, the effect resumed. However. after I time warped for a long period, everything stabilized. This is probably a bug, but I dunno maybe its supposed to work like that. Anyway, it was odd but manageble.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, in map mode there was so projected trajectory in map mode after the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E change, just markers on the entry and exit points of Mun \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E that helped to estimate trajectory. Again, not clear if this is intended or not. If so, it will definitely make precision navigation more challenging. Whether I like that or not I haven\u0027t decided.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway. I successfully orbited the Mun. It was amazing. The music was incredible, and I noticed the stars actually twinkle. Space is beautiful to look at even when there isn\u0027t an orbital body in clear view.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, after achieving orbit, my trajectory disappeared completely from map mode, making it impossible to visualize for the rest of the mission or to create any maneuver nodes. I was flying on instruments. Reloading did not fix the issue, so I decided to wing it, and successfully executed a beautifully efficient transfer back to Kerbin and a textbook landing. The beauty of Kerbin, coming down in some sort of grassy area with trees and flowers, with puffy clouds, was absolutely moving. An unforgettable experience. And honestly, the bugs made it more fun. This stuff is so easy for me in KSP1. The added challenge of not being able to see my trajectory was a blast.\n\u003C/p\u003E\n"},{"CreatedByName":"silent_prtoagonist","CreatedById":1927,"CreatedDateTime":"2023-02-26T05:44:28Z","Content":"\n\u003Cp\u003E\nBuilt and tested a small vacuum lander today, then used it to go visit an old friend.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002258r4irtwzgka1.png?width=2560\u0026amp;format=png\u0026amp;\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022506\u0022 width=\u00221200\u0022 src=\u0022https://preview.redd.it/58r4irtwzgka1.png?width=2560\u0026amp;format=png\u0026amp;auto=webp\u0026amp;v=enabled\u0026amp;s=dd89c87a3518b68c976254a8bb2465241d367b24\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227rqgsi5zzgka1.png?width=2560\u0026amp;format=png\u0026amp;\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022506\u0022 width=\u00221200\u0022 src=\u0022https://preview.redd.it/7rqgsi5zzgka1.png?width=2560\u0026amp;format=png\u0026amp;auto=webp\u0026amp;v=enabled\u0026amp;s=f41f1c847dcd34b8f4dd0a40d3d51c638cb27c00\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wi57cth20hka1.png?width=2560\u0026amp;format=png\u0026amp;\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022506\u0022 width=\u00221200\u0022 src=\u0022https://preview.redd.it/wi57cth20hka1.png?width=2560\u0026amp;format=png\u0026amp;auto=webp\u0026amp;v=enabled\u0026amp;s=780fb9321660b8b5f43deaed0effe8dc7366e6bc\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"justmeman117","CreatedById":84618,"CreatedDateTime":"2023-02-26T08:04:10Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022ERw4y3t.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ERw4y3t.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully this works, I can\u0027t remember how to post images on here.\n\u003C/p\u003E\n\u003Cp\u003E\nHavent been able to play much due to college, but last two days, I\u0027ve been building a WIP jump jet to go explore \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E. I\u0027m mostly just fine tuning it as something I might share a craft file for other people, but it already flies nicely. Because it requires so many intakes to feed the vertical jet with static airflow, it\u0027s quite draggy, and with only one panther pushing it around, it only has a top speed of 170 m/s in afterburner. I could maybe make the wings thinner, but (assuming wings are modeled correctly), I\u0027d rather have more drag for more lift at low speeds. It still needs some work, but it VTOLs better than most of my KSP1 VTOLs, it was pretty easy to land on the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E (my first time walking a kerbal around too)\n\u003C/p\u003E\n\u003Cp\u003E\nThis is my second vehicle. My first was an attempt at a 5 meter cargo aircraft. For some reason, I\u0027m always drawn to trying to build one, but it NEVER works well, not even in KSP 1. If it doesn\u0027t disintegrate on loading, it does so the second you try to maneuver in the air. In KSP 1, I had always attributed this to there not being a stock cargo door for the 5 meter fuselages. I\u0027d try to build one out of wing parts, panels, and robotics, but all it ever led to was jank.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, KSP 2 does have a 5 meter nosecone cargo door, which I used. It was a much more promising vehicle, but it too sadly would disintegrate. First, I tried using the procedural wings to make a cargo bay floor. That version would disintegrate on load. When I removed those floor wings, I could successfully take off, but it would disintegrate almost immediately upon maneuvering. I\u0027m actually not annoyed at this, it solves a long standing mystery to me that has so far foiled my attempts at a 5 meter cargo plane. It seems the real issue is that neither KSP 1 nor KSP 2 particularly like having parts phased through the walls of 5 meter fuselages/cargo bays, ESPECIALLY wings. The result is Kraken attacks.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now that I think about it... This actually makes total sense to me. The cargo bays are meant to shield internal parts from aerodynamic effects. When I\u0027ve put wings half in and half out of a cargo bay, it probably confuses the hell out of both games when it comes to aerodynamic calculations. I might be able to fix this issue by simply avoiding translating parts through cargo bays entirely.\n\u003C/p\u003E\n\u003Cp\u003E\nPS, for those interested in game performance, this first plane was a big one (though probably still 100 parts or less), and I still managed 20-30 FPS, or more. This is at 1080p on minimum graphics settings. i7-6700k, GTX 1070, 64 Gb of ram, Win 10 is on an SSD, and the game itself is on a slower HDD. I was really worried about performance, but so far, I\u0027ve actually been impressed out how smooth it can be, even in the clutter of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E. I\u0027m sure performance will tank if I try to push past 300 parts (just like in KSP 1), but fortunately, the procedural wings and large parts make that less necessary... They really do need to add autostrut though, I can already tell struts are going to massively increase part counts of vehicles.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-26T08:05:14Z\u0022 title=\u002202/26/2023 08:05  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 26, 2023\u003C/time\u003E by justmeman117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-02-26T10:11:03Z","Content":"\n\u003Cp\u003E\nI flew into Kerbol. There\u0027s a second sun inside, but I wasn\u0027t able to reach that one.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I flew into interstellar space. The sun got smaller and smaller, giving less and less light, until it disappeared completely from my eyes (or maybe it blended with background), and my probe was in complete darkness, with minimal reflected light from surrounding nebulas. Quite eerie. Highly recommended.\n\u003C/p\u003E\n"},{"CreatedByName":"justmeman117","CreatedById":84618,"CreatedDateTime":"2023-02-26T10:50:26Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022yDQJNCQ.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yDQJNCQ.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is my version two jump jet, much improved. The original had a vertical \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of just 1.056, which isn\u0027t impossible to fly, but could kill you if you ever allowed descent rate to get too high. Just, no margin whatsoever. So in this version, I added 4 of the small jet engines on the wingtip tanks to augment vertical thrust. Now it can comfortably hover at 75-80% throttle, and can more easily arrest descents. I also think maybe the smaller engines have better throttle response. And, these 4 engines are spread to 4 corners of the jet essentially, which means you can have weight and balance slightly off, and just use throttle limit on these engines to trim it out. I\u0027ve trimmed it out for a full fuel load (weight shouldnt shift too much from there, but the option for trim is there at least).\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also added two of the small jets to the ends of the wingtip tanks, for more horizontal thrust... Which it needs, because it\u0027s actually lost sea level top speed, despite adding these (now between 150-165 m/s), probably because of even more added weight and drag from the new components. It flies like an absolute brick in horizontal flight, but horizontal flight is really just for A to B, I wanted the best \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E flight characteristics I could get. It still lands pretty accurately, and the extra throttle margin can make for quicker descents and landings without crashing. It does have oversized gear and a tailwheel though, which has saved me a few times.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, since VTOLs are inherently dangerous, flight saves are buggy (I\u0027ve already almost permanently lost crew members over it), and there are no Kerbal parachutes yet... I thought it\u0027d be fun to add a capsule ejection system. It worked shockingly well on the first use, and I\u0027ve been putting it through its paces in different scenarios for fun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m9CSafM.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/m9CSafM.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sVtgQL9.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/sVtgQL9.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UTcuErx.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/UTcuErx.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MftiqOU.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MftiqOU.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZBl5Avz.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ZBl5Avz.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n4 Separatrons yank the capsule off the front of the plane, and are angled just so to gently go from horizontal flight (needed to get it off the front) to vertical (to get it away from the jet). It\u0027s a 00 system, meaning you can eject on the runway with zero speed, and gain enough altitude to deploy chutes.\n\u003C/p\u003E\n\u003Cp\u003E\nIt works well in a variety of scenarios. I\u0027ve tried seeing if I could overcome the separatrons and peg the capsule to the front of the jet. It won\u0027t do it. The fastest I\u0027ve gotten it up to in a dive from 8,000 meters is 250 m/s (the plane is just too draggy to go any faster), and the ejection still pulls the capsule away off the front.\n\u003C/p\u003E\n\u003Cp\u003E\nGenerally, so long as the plane is roughly right side up, it will get you to safety without any thought put in, even rapidly hurtling towards the ground. However, in bad attitudes (like inverted, or rolling over), it really can\u0027t be a fire and forget thing, the capsule will plow into the ground. It can be hard to control, but if you\u0027re quick, you can use reaction wheels to roll the capsule right side up, and halt it in the right spot to gain the most altitude. So even upside down, it\u0027s quite capable, it just requires manual flying, and some practice.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also fixed most of the minor issues of the old version of the plane, from flaps not working, adding struts to strengthen up the cargo bay (which contains the center engine), to sorting out all the action groups.\n\u003C/p\u003E\n\u003Cp\u003E\nNormally my VTOLs are mediocre at best, but this has been a blast to fly. I\u0027m thinking of posting it to a craft share site if anybody else just wants to hop into an easy \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E to bum around \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E in. I might also make a version that deletes the ejection system and extra engines, for anybody who wants a lower part count (though slightly harder to fly) version.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"pwhk","CreatedById":168160,"CreatedDateTime":"2023-02-26T11:25:17Z","Content":"\n\u003Cp\u003E\nBuilt a plane.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately when I tried to land, the plane kept bouncing and bouncing and until the plane head into the ground headfirst \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe plane broke into a few pieces, but at least Jeb can walk away from it \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Y7l69ut.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Y7l69ut.jpeg\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"tstein","CreatedById":223854,"CreatedDateTime":"2023-02-26T11:54:34Z","Content":"\n\u003Cp\u003E\nI tried again and regreted... after the first launch  half the  rocket teleported some 50 meters to the left while the rest continued attached and moving ...\n\u003C/p\u003E\n"},{"CreatedByName":"Izny","CreatedById":137814,"CreatedDateTime":"2023-02-26T13:11:55Z","Content":"\n\u003Cp\u003E\ni hate how all your designs look better than mine XD\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2023-02-26T13:46:43Z","Content":"\n\u003Cp\u003E\nI ran a few EVA tests on the launchpad this morning to validate why I was having problems doing EVA in space.  I keep getting the error that the hatch is obstructed, even though I was quite positive that it wasn\u0027t.  Turns out...it\u0027s me, not the game.  The hatch on the Mk1 Tin Can is indeed off-center, and the front window is not part of the hatch.  This is a small thing, but it was enough to mess me up with my Mun lander, so I\u0027ll have to just send another crew up there so I can go EVA and plant a flag and all of that.\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I noticed is that the ladder I used (medium), sits flush with whatever part you have it attached to, as opposed to being in line with the hand/foot holds on the capsule itself.  So when you are climbing down, you have to hit F to grab the ladder.  The reverse is true; when climbing up, you\u0027ll get to where the ladder ends and stop, but you hit F and you grab the capsule.  Just...odd behavior.  Not a bug, and I\u0027ll have to test this with moving the ladder out and away from where I have it mounted to see if this happens when flush with the handholds or if this is designed behavior.  My guess is this is designed, and while it\u0027s a bit of a pain, it isn\u0027t game-breaking.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now I\u0027ve got a Mun lander to get back to Kerbin, and multiple videos to upload.  And a bug to report.\n\u003C/p\u003E\n"},{"CreatedByName":"tstein","CreatedById":223854,"CreatedDateTime":"2023-02-26T13:52:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224244055\u0022 data-ipsquote-contentid=\u0022212284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677419203\u0022 data-ipsquote-userid=\u0022210112\u0022 data-ipsquote-username=\u0022Scarecrow71\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Scarecrow71 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI ran a few EVA tests on the launchpad this morning to validate why I was having problems doing EVA in space.  I keep getting the error that the hatch is obstructed, even though I was quite positive that it wasn\u0027t.  Turns out...it\u0027s me, not the game.  The hatch on the Mk1 Tin Can is indeed off-center, and the front window is not part of the hatch.  This is a small thing, but it was enough to mess me up with my Mun lander, so I\u0027ll have to just send another crew up there so I can go EVA and plant a flag and all of that.\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I noticed is that the ladder I used (medium), sits flush with whatever part you have it attached to, as opposed to being in line with the hand/foot holds on the capsule itself.  So when you are climbing down, you have to hit F to grab the ladder.  The reverse is true; when climbing up, you\u0027ll get to where the ladder ends and stop, but you hit F and you grab the capsule.  Just...odd behavior.  Not a bug, and I\u0027ll have to test this with moving the ladder out and away from where I have it mounted to see if this happens when flush with the handholds or if this is designed behavior.  My guess is this is designed, and while it\u0027s a bit of a pain, it isn\u0027t game-breaking.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now I\u0027ve got a Mun lander to get back to Kerbin, and multiple videos to upload.  And a bug to report.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAt least you finnaly  managed to defeat  your issues with getting a proper interception with mun.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224242537\u0022 data-ipsquote-contentid=\u0022212284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677351700\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is weird, GUI should not be an performance killer, graphic and effects is. \u003Cbr\u003E\nSure for web applications GUI can tank performance but not games. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCheck Ultimate admirals Dreadnoughts..  90 fps without GUI,  4 fps with GUI.\n\u003C/p\u003E\n"},{"CreatedByName":"LezRowl","CreatedById":213344,"CreatedDateTime":"2023-02-26T15:13:00Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EWent South\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nStarting from the runway at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, I flew all the way for ~30 in-game minutes to the southern glaciers of Kerbin and landed there!\n\u003C/p\u003E\n\u003Cp\u003E\nTook me a few tries to land, but I ended up planting a flag to mark the milestone.  \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022beNAYam.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/beNAYam.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Peter Frongldorf","CreatedById":226308,"CreatedDateTime":"2023-02-26T15:35:33Z","Content":"\n\u003Cp\u003E\nLanded at Mun Arch. Can\u0027t get images to post from imgur. Help?\n\u003C/p\u003E\n"},{"CreatedByName":"MissMolly","CreatedById":60455,"CreatedDateTime":"2023-02-26T15:47:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224242380\u0022 data-ipsquote-contentid=\u0022212284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677346247\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nC/Users/yourusername/Appdata/Locallow/InterceptGames/\n\u003C/p\u003E\n\u003Cp\u003E\nAt least that\u0027s where you can find your saved craft\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nthank you.  not sure why I/we cant see part folders and all the associated files  all in one main folder, like KSP 1. I dislike having to go through my computer just to fine files for a program.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-26T16:00:36Z\u0022 title=\u002202/26/2023 04:00  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 26, 2023\u003C/time\u003E by MissMolly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dare_to_be_stupid","CreatedById":226489,"CreatedDateTime":"2023-02-26T16:11:09Z","Content":"\n\u003Cp\u003E\nlearned that A kerbals don\u0027t have parachutes yet and B terminal velocity wont kill them in a water landing\n\u003C/p\u003E\n"},{"CreatedByName":"Zondersmaak","CreatedById":226318,"CreatedDateTime":"2023-02-26T16:28:22Z","Content":"\n\u003Cp\u003E\nI had some issues after I saved and quit the game short after launch. The tracker view didn\u0027t show any trajectory lines anymre and the \u0022revert launch\u0022 button didn\u0027t work.\n\u003C/p\u003E\n\u003Cp\u003E\nI also have an issue when loading the predefined Stock04_jet and trying to launch it on runway 1 or 2. Nothing happens when I hit \u0022Launch\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"KSACheese","CreatedById":150877,"CreatedDateTime":"2023-02-26T16:34:04Z","Content":"\n\u003Cp\u003E\nPushing further into kerballed flight with the agency\u0027s first suborbital spaceplane (heavily inspired by the X-15, yes). Here are some photos from the development of it. Due to how it launches, and how it exhausts its fuel before reaching space, it does require a \u003Cstrong\u003E\u003Cem\u003Eslow\u003C/em\u003E\u003C/strong\u003E water landing. Seems the water landing tolerance is not as forgiving as in KSP1.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u0022120.00\u0022 width=\u00221200\u0022 alt=\u002220230226103246_1.jpg\u0022 src=\u0022https://cdn.discordapp.com/attachments/695074523300757585/1079425875470205089/20230226103246_1.jpg\u0022\u003E\u003Cimg data-ratio=\u0022120.00\u0022 width=\u00221200\u0022 alt=\u002220230226105707_1.jpg\u0022 src=\u0022https://cdn.discordapp.com/attachments/458447891913113623/1079440575511666750/20230226105707_1.jpg\u0022\u003E\u003Cimg data-ratio=\u0022120.00\u0022 width=\u00221200\u0022 alt=\u002220230226110123_1.jpg\u0022 src=\u0022https://cdn.discordapp.com/attachments/695074523300757585/1079433091094945904/20230226110123_1.jpg\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Lyneira","CreatedById":149515,"CreatedDateTime":"2023-02-26T16:55:21Z","Content":"\n\u003Cp\u003E\nSpent some time today tweaking and miniaturizing a \u0022Micro Return Pod\u0022... It\u0027s very Kerbal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Capture.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002293.74\u0022 height=\u0022629\u0022 width=\u0022671\u0022 src=\u0022https://cdn.discordapp.com/attachments/1074737019944706048/1079435850766614638/Capture.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nMass: 0.37 t (kerbal included)\n\u003C/li\u003E\n\u003Cli\u003E\n6 parts\n\u003C/li\u003E\n\u003Cli\u003E\nParachute\n\u003C/li\u003E\n\u003Cli\u003E\nElectric Charge: 100 U\n\u003C/li\u003E\n\u003Cli\u003E\nTorque: 3 kN\n\u003C/li\u003E\n\u003Cli\u003E\nDelta-v: 397 m/s (can go up to 750 m/s  if tweaking more fuel to the tank)\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nThe only caveat is that it is somehow denser than water even with the empty fuel tank, so it will sink all the way to the bottom of the ocean after a water landing.\n\u003C/p\u003E\n"},{"CreatedByName":"Zozaf Kerman","CreatedById":219910,"CreatedDateTime":"2023-02-26T18:40:20Z","Content":"\n\u003Cp\u003E\nQuick mun landing and return. (I don’t know how to insert pictures from mobile, could someone help with this?)\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2023-02-26T18:56:30Z","Content":"\n\u003Cp\u003E\nAs promised, videos of my Munar landing and return.  One major bug presents itself in these videos, and that is course after burn does not match course plotted.  Bug was submitted.  But enjoy the videos!  I shall have more in the coming days!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/10bifehdeQQ?feature=oembed\u0022 title=\u0022KSP2 EA Mun Landing Demo - Part I\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/8SCY9tA3uKQ?feature=oembed\u0022 title=\u0022KSP2 EA Mun Landing Demo - Part II\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-02-26T19:09:17Z","Content":"\n\u003Cp\u003E\nI also landed on the Mun. For the third time, but returned \u003Cs\u003Ealive\u003C/s\u003E for the first time.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso landed a plane near the north pole, only losing a wheel in the process, tried to walk towards it but fell through the ground into freezing ocean. Didn\u0027t know the ice was so thin.\n\u003C/p\u003E\n"},{"CreatedByName":"Vitnir","CreatedById":226344,"CreatedDateTime":"2023-02-26T19:13:49Z","Content":"\n\u003Cp\u003E\nSuccesful landing on the Mun and flag planting \u0022I can\u0027t belive I\u0027m still alive\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nThen someone didnt pack enough fuel for the return trip and it took fuel \u002B most monoprop to even get into orbit around the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nThen design and send a Deep Space Rescue vessel for the stranded green men.\n\u003C/p\u003E\n\u003Cp\u003E\nLuckily I packed extra parachutes, the 5-seater pod needs one XL and two side-parachutes.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalistic1","CreatedById":222243,"CreatedDateTime":"2023-02-26T19:19:40Z","Content":"\n\u003Cp\u003E\nIs KSP 2 on Mac? \n\u003C/p\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2023-02-26T19:25:39Z","Content":"\n\u003Cp\u003E\nIn KSP1 the furthest I ever got was Duna. So today I spent a lot of time trying to arrange a Moho mission.\n\u003C/p\u003E\n\u003Cp\u003E\nIt didn\u0027t work. The rocket required for a single launch mission was enormous and exploded on the pad. I either need to do some earth orbit rendezvous or try a much cut-back mission profile.\n\u003C/p\u003E\n"},{"CreatedByName":"Klapaucius","CreatedById":181256,"CreatedDateTime":"2023-02-26T19:28:26Z","Content":"\n\u003Cp\u003E\nI learned that the new rover wheels are much tougher than the old ones.  I got over 300 mps before the whole thing came apart in fire and glory.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WyKrHlw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/WyKrHlw.png\u0022\u003E\n\u003C/p\u003E\n"}]}