{"TopicId":212812,"ForumId":119,"TopicTitle":"NO CAREER MODE or Money planned for game","CreatedByName":"RaBDawG","CreatedById":206005,"CreatedDateTime":"2023-02-25T23:54:06Z","PageNum":5,"Articles":[{"CreatedByName":"Picard2","CreatedById":227404,"CreatedDateTime":"2023-03-09T16:22:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224255554\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678375173\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think all we know is that you\u0027ll have to do the resource run first yourself (the flying bit being what makes it KSP), that it\u0027ll work in principle for any vehicle, rovers, planes, even interstellar vessels. We don\u0027t know though whether the repeat vessels will be physically modeled and flying around or more abstract. Though I think the latter could be really cool it poses some problems and I kind of suspect the resource transfers will be more virtual. I do hope though that scheduling repeat supply runs considers transfer windows and \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E costs, and that the deliveries come in lump-sums based on those timings. That shouldn\u0027t be wildly difficult. Everything would be known about the route on the back-end and the game itself could suggest repeat rates based on flight duration. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks! Yeah I agree seeing the automated ships actually flying around and stuff sounds amazing but probably not realistic (and maybe not a ton of value relative to expense after the excitement of the first few times of recognising your design inbound from Duna). Scheduling and stuff seems like it would need to be a must have - seeing your carefully designed exploration vehicles be unable to launch for nine months because you forgot to order in a new convoy probably wouldn\u0027t be a great time.\n\u003C/p\u003E\n"},{"CreatedByName":"RocketRockington","CreatedById":223189,"CreatedDateTime":"2023-03-09T19:54:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224255570\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678376659\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI try to be upbeat, but my imagination on what it \u003Cem\u003Ewill\u003C/em\u003E be has taken a bit of a dark turn since February 24. I hope it will be great but there seems to be a wide chasm between the picture that Nate and his merry men paint, and what we are getting. I really hope that\u0027s not the case with progression/explorer/belter mode.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah I\u0027m also extremely skeptical of anything the devs have said at this point.\n\u003C/p\u003E\n\u003Cp\u003E\nI also think there are some serious design issues with a resource system - namely, what to do with \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E rockets.  If you have to collect resources to launch a rocket at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E - that sounds just exceedingly dumb.  Am I meant to set up iron smelters and copper mines next to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E?   Even if, for \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, that\u0027s abstracted away, it seems weird for the space center to be waiting till I get enough aluminium to build my rocket.\n\u003C/p\u003E\n\u003Cp\u003E\nConversely though, if rockets I build at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E are \u0027free\u0027, with no resource cost - there\u0027s nothing to stop me from building a titanic rocket (besides KSP2s borked up performance :P) using the biggest parts, for any job.  The tyranny of the rocket equation gets turned on it\u0027s head as now you should always do all work on the ground at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E because stuff is free.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2023-03-09T20:29:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224255706\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678391663\u0022 data-ipsquote-userid=\u0022223189\u0022 data-ipsquote-username=\u0022RocketRockington\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n26 minutes ago, RocketRockington said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah I\u0027m also extremely skeptical of anything the devs have said at this point.\n\u003C/p\u003E\n\u003Cp\u003E\nI also think there are some serious design issues with a resource system - namely, what to do with \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E rockets.  If you have to collect resources to launch a rocket at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E - that sounds just exceedingly dumb.  Am I meant to set up iron smelters and copper mines next to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E?   Even if, for \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E, that\u0027s abstracted away, it seems weird for the space center to be waiting till I get enough aluminium to build my rocket.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAt this point everything is mere conjecture. It seems logical that Kerbin has an ample supply of basic materials used for standard rocket parts, and you don\u0027t have to actively mine them, they\u0027re just there (likely brought in by boat, train and/or truck). However some of the higher performance engines require unobtanium that has to be mined on the moon.\n\u003C/p\u003E\n\u003Cp\u003E\nIn itself it\u0027s not so weird that you have to wait for enough material to be collected to build rockets; Werner von Braun had to deal with that issue all the time with his early rockets. I just hope that it doesn\u0027t turn into a resource allocation game.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-03-09T23:30:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224255706\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678391663\u0022 data-ipsquote-userid=\u0022223189\u0022 data-ipsquote-username=\u0022RocketRockington\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, RocketRockington said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEven if, for \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E, that\u0027s abstracted away, it seems weird for the space center to be waiting till I get enough aluminium to build my rocket.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe\u0027ll have to wait to see what they have in mind of course but having a fuel/resource building at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E that fills over time isn\u0027t \u003Cem\u003Ethat\u003C/em\u003E weird. Real space ports like Boca Chica have fuel farms. They have warehouses where materials and components arrive and are stored. It\u0027s just that dealing with specific vendor contracts is boring gameplay so its abstracted away. It solves the balance problem you point out in your last sentence while avoiding game-bricking failure states. It introduces new players to the concept of resource costs early without bogging down the first few hours with setting up resource collection on Kerbin. If the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E resource stockpile has a cap then early on the sky isn\u0027t the limit, and if it can be upgraded with science later on it provides some interesting strategic decisions for the player vis-a-vis launching bigger and bigger things from Kerbin or investing more heavily in a live-off-the-land strategy.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-09T23:33:49Z\u0022 title=\u002203/09/2023 11:33  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 9, 2023\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketRockington","CreatedById":223189,"CreatedDateTime":"2023-03-09T23:55:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224255828\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678404635\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe\u0027ll have to wait to see what they have in mind of course but having a fuel/resource building at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E that fills over time isn\u0027t \u003Cem\u003Ethat\u003C/em\u003E weird. Real space ports like Boca Chica have fuel farms. They have warehouses where materials and components arrive and are stored. It\u0027s just that dealing with specific vendor contracts is boring gameplay so its abstracted away. It solves the balance problem you point out in your last sentence while avoiding game-bricking failure states. It introduces new players to the concept of resource costs early without bogging down the first few hours with setting up resource collection on Kerbin. If the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E resource stockpile has a cap then early on the sky isn\u0027t the limit, and if it can be upgraded with science later on it provides some interesting strategic decisions for the player vis-a-vis launching bigger and bigger things from Kerbin or investing more heavily in a live-off-the-land strategy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a very reasonable design, except... time warp.  It makes sense if time is a real commodity in the game, but in KSP it typically isn\u0027t since missions can be of such widely divergent game clock times.  One of the reasons that \u0027playing against the clock\u0027 in KSP1 career was really boring is because you\u0027d end up grinding really boring contracts in Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E over and over vs more difficult/interesting ones on other planets.\u003Cbr\u003E\n\u003Cbr\u003E\nSo yeah - if you add some sort of time constraint, that design would track.  But if you can 100,000x time warp and fill all your resource buffers, it falls down as a gameplay loop.   Maybe something interesting to do with resource caps?  That still has the issue that you\u0027d never build anything but the biggest sizes your caps allowed for.  \u003Cbr\u003E\n\u003Cbr\u003E\nIts all speculation of course, but this is at least more interesting speculation than my typical one with KSP2 \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-09T23:55:52Z\u0022 title=\u002203/09/2023 11:55  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 9, 2023\u003C/time\u003E by RocketRockington\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2023-03-10T01:32:53Z","Content":"\n\u003Cp\u003E\nI\u0027m not big on the game having a failure state, so punishing the player for time warping for 8 years just \u0027cuz is distasteful to me. Also, most \u0022do something every x days\u0022 mechanisms are easily worked around by putting a capsule on the pad and recovering it, turning your simple time warp into a penalty-free grind fest. Which is also pretty distasteful to me.\n\u003C/p\u003E\n\u003Cp\u003E\nI do think time should be a resource in the game, but I don\u0027t know how it should be done. Hopefully the professional game designers thought of something.\n\u003C/p\u003E\n"},{"CreatedByName":"Cailean_556","CreatedById":12297,"CreatedDateTime":"2023-03-11T05:04:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224254817\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678282645\u0022 data-ipsquote-userid=\u0022119538\u0022 data-ipsquote-username=\u0022caipi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/9/2023 at 12:37 AM, caipi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo, I\u0027m gonna play a space rocket game that starts with having to explore and mine the home world before I can start exploring the Müns and other planets?! That might be fun for the first playthrough, maybe the second as well. But I think it\u0027ll get in the way of restarting the game pretty quick! I don\u0027t know how many career modes I\u0027ve started in KSP 1, but I know that the digits on my hands and fingers weren\u0027t enough to count them anymore. Mods made this game so enjoyable and so diverse. I already hated the first few slow steps in KSP1, having done them so many times.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t get me wrong, I enjoyed the first unmanned flights and even researching and testing planes the first few times - once or maybe twice. But this isn\u0027t what kept pulling me back to this game over and over and over (etc.) again.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for your last statement: It depends on how it\u0027ll be implemented. We\u0027ll see. Unfortunately, right now I\u0027m not very optimistic because many of the things I\u0027m seeing so far feel like the devs haven\u0027t played too much KSP1 as there are too many disimprovements and missing crucial basic feature - even for an EA. It feels like they have a vision of what the game should be - with only a single story mission and single playthrough in mind. It doesn\u0027t feel like they are experienced die-hard fans who really enjoyed all aspects and the rich diversity of the game and what it can be. But now I start to digress. I guess we\u0027ll just have to wait and see. Though for now, I\u0027m still on the verge of refunding my EA. Let\u0027s see what the next or next two updates bring and where things are heading.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, if you\u0027re following a logical progression path then yes you will explore and mine the \u0022homeworld\u0022 before you can explore the other planets/stars. If I was to hazard a guess, I would probably have a strong argument that Kerbin is the most unexplored planet in the Kerbolar system in KSP1. So if KSP2 bucks that trend and we spend a little more time putting up satellites to map Kerbin and understand that planet before we go to the Mun and beyond, and repeat the approach, I think we\u0027d all be better for it. And, like you, I have also started and restarted quite a number of Career modes - except I do so without mods. If you don\u0027t want to follow the full \u0022career mode\u0022 path - that\u0027s literally what the Sandbox mode is for. Or if you want the campaign minus the \u0022hard stuff\u0022 at the start, you\u0027ll (hopefully) be able to slider-and-checkbox your way around those starting \u0022first few slow steps\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nI would also assume that, like KSP1, when starting a new \u0022career mode\u0022 (Exploration mode?) campaign in KSP2 you would be able to select what you do and don\u0027t have access to via sliders and check boxes - as that \u0022softened the blow\u0022 of starting a new campaign in KSP1 and having to build the same 3 mystery goo canister carrying Mk1 pod with a Flea \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u003C/abbr\u003E and maybe some winglets and a parachute EVERY, DAMN, TIME you started a new campaign... Unless you\u0027re a glutton for punishment. Like I am with KSP. I very rarely tweaked my starting resources to give myself a leg up - the rate at which I gained resources, on the other hand - those I tweaked. Especially Funds.\n\u003C/p\u003E\n\u003Cp\u003E\nEven if it is a single story, how does that affect replayability? How do games like KOTOR and Mass Effect  - which all have a common ending - get replayed time and time again? It\u0027s the *players\u0027* mindset and approach that sets each playthrough apart. Plus, when you restart, I guarantee you, you build your \u0022first few\u0022 rockets differently than from your very first playthrough - because you\u0027ve learned new skills, which changes the outcome - by becoming arguably more efficient and/or streamlined.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for a single playthrough approach, considering they\u0027re going to be adding more than a few star systems I believe we\u0027ll have hundreds of hours (even with time compression) if we play a career mode from start to finish. If there\u0027s even a quantifiable \u0022finish/end\u0022 to KSP2.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile I will admit my impressions of KSP2 are...less than I had hoped...I\u0027m not considering a refund, nor would I as I no longer meet the requirements for one having played KSP2 for more than 2 hours and having owned it for more than 2 weeks. I\u0027m not as concerned about FPS, this isn\u0027t a shooter or twitch-based game after all, but I am concerned about putting heavy payloads (thus requiring heavy, large rockets with complex fuel usage, multiple engines and stages) in space and being able to reliably circularise an orbit and/or dock, and reliably navigate between celestial objects. I am, however, also quite interested to see what the first patch brings/fixes. While I\u0027m not expecting it to address all of the issues straight off the bat, I would like to see it address the majority of issues that we have in KSP2 that aren\u0027t in KSP1.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-11T05:07:34Z\u0022 title=\u002203/11/2023 05:07  AM\u0022 data-short=\u00221 yr\u0022\u003EMarch 11, 2023\u003C/time\u003E by Cailean_556\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"goehler","CreatedById":228671,"CreatedDateTime":"2023-04-16T11:38:58Z","Content":"\n\u003Cp\u003E\nI too really hope that the Adventure mode will be a new take on Career mode, and not just Science mode. I\u0027ve only ever enjoyed Career mode.\n\u003C/p\u003E\n\u003Cp\u003E\nScience mode and Sandbox just feels like cheating. No real challenge, which gets boring really quickly.\n\u003C/p\u003E\n"},{"CreatedByName":"Wheehaw Kerman","CreatedById":223516,"CreatedDateTime":"2023-04-17T20:30:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224242924\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677369246\u0022 data-ipsquote-userid=\u0022206005\u0022 data-ipsquote-username=\u0022RaBDawG\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/25/2023 at 6:54 PM, RaBDawG said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSoooooo WTH lol?  There will be no monetary constraints on what you can build, just science progression.   I literally only play Career mode in KSP\n\u003C/p\u003E\n\u003Cp\u003E\nHow tf do they leave that out?!?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://steamcommunity.com/app/954850/discussions/0/3772364949848937904/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://steamcommunity.com/app/954850/discussions/0/3772364949848937904/\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYup.  We knew.  And likewise, but I am very optimistic that Adventure Mode will be a major improvement over Career Mode - as much of an improvement over it as KSP2 EA is over the early versions of KSP.  \n\u003C/p\u003E\n\u003Cp\u003E\nThey ditched Career Mode because frankly, it wasn’t that great.  Annoying procedural contracts, the tourist contracts were easily and massively exploitable, and it just kinda peters out without endgame.\n\u003C/p\u003E\n"},{"CreatedByName":"Hanuman","CreatedById":116709,"CreatedDateTime":"2023-04-18T00:10:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224273987\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681763429\u0022 data-ipsquote-userid=\u0022223516\u0022 data-ipsquote-username=\u0022Wheehaw Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Wheehaw Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYup.  We knew.  And likewise, but I am very optimistic that Adventure Mode will be a major improvement over Career Mode - as much of an improvement over it as KSP2 EA is over the early versions of KSP.  \n\u003C/p\u003E\n\u003Cp\u003E\nThey ditched Career Mode because frankly, it wasn’t that great.  Annoying procedural contracts, the tourist contracts were easily and massively exploitable, and it just kinda peters out without endgame.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI disagree vehemently.   I prefer the procedural contracts, myself.  Yes, tourist contracts are massively exploitable.  But not because of error.  But because this isn\u0027t exactly a hard game in that fashion.  In the way that you\u0027re looking for, it\u0027s only as hard as you make it on yourself which is kind of the entire point.  The procedural contracts would come up with situations that no handwritten contracts ever will,  with lots of them being kinda dumb and we can get annoyed at wading through the bad ones.  That doesn\u0027t make the idea bad.  I\u0027d prefer the random than having my replay variability stripped out by using 100% handcrafted missions.  Imagine how boring THAT would be the 80th time through the exact same thing in the exact same order.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope that they do a version of the classic career mode, with funds and science, and I don\u0027t feel like that\u0027s too much to ask for.   These were to me, the boring parts distilled down into two numbers of relative ease to conceptualize.  I never used resource mods,  I never wanted to micromanage and deal with any of that stuff.   If KSP1 required resources and life support, I probably would\u0027ve had 20 hours in it, instead of a thousand.  So distilling that stuff all down into two numbers leaving me free to spend hours and hours on the stuff I liked, was a large part of the appeal for me.    I\u0027m not saying they shouldn\u0027t do whatever they\u0027re doing, only that I can hope that there\u0027s a way to play that I personally enjoy, rather than \u0022just play in sandbox\u0022 as an answer.   I suppose time will tell.\n\u003C/p\u003E\n"},{"CreatedByName":"K33N","CreatedById":200461,"CreatedDateTime":"2023-04-18T19:43:14Z","Content":"\n\u003Cp\u003E\nThere is a very vocal, fanatically anti-career mode minority that I fear the devs ended up catering to without considering that almost all the power users are playing career mode.\n\u003C/p\u003E\n\u003Cp\u003E\nIts gonna be a big struggle for most of us without career mode spitting out objectives and constraints. The procedural nature of the missions is what makes it good.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-04-18T19:44:30Z\u0022 title=\u002204/18/2023 07:44  PM\u0022 data-short=\u00221 yr\u0022\u003EApril 18, 2023\u003C/time\u003E by K33N\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-04-18T22:13:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274065\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681776655\u0022 data-ipsquote-userid=\u0022116709\u0022 data-ipsquote-username=\u0022Hanuman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, Hanuman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n I\u0027d prefer the random than having my replay variability stripped out by using 100% handcrafted missions.  Imagine how boring THAT would be the 80th time through the exact same thing in the exact same order.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA couple of things about this. Everyone has their own way of enjoying games and I don\u0027t begrudge anyone having fun. I personally found most of the generative contracts pretty repetitive and unrewarding, but yeah if you sift through enough of them you can tack on some pretty workable side-quests. I don\u0027t think they need remove all of the generative contracts, but what the do need to do is fix the exploration/ world first contracts for visiting new places and doing new things. I never quite understood why those remained this weird invisible mess in KSP1. I completely agree they shouldn\u0027t be linear--there\u0027s no reason why you should have to visit Duna before Eve or the Mun before Minmus. Players should mostly be able to go where they like and always find ways to discover new things. \u003Cbr\u003E\n\u003Cbr\u003E\nAs far as resources and LS goes KSP1 did have \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E but it was kind of one dimensional and the way things were mapped and prospected was pretty clunky. Im psyched to see that system developed in a way that makes building colonies and living off the land on other planets feel more active and rewarding. The most important thing is having the supply route system really tightly designed to alleviate the manual maintenance of it. Its not like a city builder or factorio where you need constant maintenance. Everything Nate has said has indicated that colonies are really set-and-forget and non-punitive, so to me a really simple \u0027snacks\u0027 based LS is the most obvious and important mechanic for keeping kerbals happy and productive. I have no interest in worrying that running out of water or oxygen will mean you come back to a colony full of dead kerbals. But I also don\u0027t think greenhouses should just be there for looks. \n\u003C/p\u003E\n"},{"CreatedByName":"TickleMyMary","CreatedById":227552,"CreatedDateTime":"2023-04-18T22:26:41Z","Content":"\n\u003Cp\u003E\nI\u0027ve only ever played career mode and anything less than that would be madness to leave out of the game imo... I\u0027ll hold out for whatever \u0027Adventure mode\u0027 is but I don\u0027t like what I\u0027ve heard so far.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-04-19T00:10:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274321\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681856801\u0022 data-ipsquote-userid=\u0022227552\u0022 data-ipsquote-username=\u0022TickleMyMary\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, TickleMyMary said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve only ever played career mode and anything less than that would be madness to leave out of the game imo... I\u0027ll hold out for whatever \u0027Adventure mode\u0027 is but I don\u0027t like what I\u0027ve heard so far.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat about it makes you nervous?\n\u003C/p\u003E\n"},{"CreatedByName":"TickleMyMary","CreatedById":227552,"CreatedDateTime":"2023-04-19T00:34:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274362\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681863003\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat about it makes you nervous?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat part of my comment struck you as me being \u0027nervous\u0027 about something? \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s just my opinion based on how I play the game... Don\u0027t get nervous over it.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2023-04-19T01:08:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274379\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681864447\u0022 data-ipsquote-userid=\u0022227552\u0022 data-ipsquote-username=\u0022TickleMyMary\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n33 minutes ago, TickleMyMary said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat part of my comment struck you as me being \u0027nervous\u0027 about something? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI do not believe Pthigrivi meant any offense and just worded \u0022What about it (what you\u0027ve heard about Adventure Mode) don\u0027t you like?\u0022 slightly differently.\n\u003C/p\u003E\n\u003Cp\u003E\nI too am curious though. What about it (what you\u0027ve heard about Adventure Mode) don\u0027t you like?\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-04-19T02:13:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274379\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681864447\u0022 data-ipsquote-userid=\u0022227552\u0022 data-ipsquote-username=\u0022TickleMyMary\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, TickleMyMary said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat part of my comment struck you as me being \u0027nervous\u0027 about something? \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s just my opinion based on how I play the game... Don\u0027t get nervous over it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, sorry, I know conversations like this are often combative but I didn’t mean it that way. Im genuinely curious. \n\u003C/p\u003E\n"},{"CreatedByName":"TickleMyMary","CreatedById":227552,"CreatedDateTime":"2023-04-19T09:10:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274395\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681866507\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI too am curious though. What about it (what you\u0027ve heard about Adventure Mode) don\u0027t you like?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274401\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681870431\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m genuinely curious. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBecause I prefer (as much as is possible) for the game to be as realistic as possible in ways such as this and funds, science, research and the original KSP career mode style triggers my little monkey brain in exactly the right way... So much so, that one particular game mode (with many mods installed) has held my attention for 10 years now and will continue to do so for the foreseeable. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274321\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681856801\u0022 data-ipsquote-userid=\u0022227552\u0022 data-ipsquote-username=\u0022TickleMyMary\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, TickleMyMary said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EI\u0027ll hold out for whatever \u0027Adventure mode\u0027 is\u003C/strong\u003E but I don\u0027t like what I\u0027ve heard so far.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs stated, I am willing to wait to see what we get... The fact I haven\u0027t been enticed by the few details we \u003Cstrong\u003Edo\u003C/strong\u003E have does not equate to me writing the mode off before it lands.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224274401\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221681870431\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI know conversations like this are often combative\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot necessarily... Yet, frequently.\n\u003C/p\u003E\n"},{"CreatedByName":"GGG-GoodGuyGreg","CreatedById":226561,"CreatedDateTime":"2023-04-22T09:55:48Z","Content":"\n\u003Cp\u003E\nTime has passed and I still don’t get how you can name a game Kerbal Space Program and not include fund management. Isn’t that a crucial part of competing space agencies? Or is the competition going to be only about resource gathering?\n\u003C/p\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-04-22T17:10:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224275775\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221682157348\u0022 data-ipsquote-userid=\u0022226561\u0022 data-ipsquote-username=\u0022GGG-GoodGuyGreg\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, GGG-GoodGuyGreg said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTime has passed and I still don’t get how you can name a game Kerbal Space Program and not include fund management. Isn’t that a crucial part of competing space agencies? Or is the competition going to be only about resource gathering?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI like to imagine that kerbals live in a post-scarcity society where they can fully devote themselves to whatever makes them happy, like giant rockets going whoosh and occasionally kaboom! \u003Cimg alt=\u0022:joy:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/joy.png\u0022 title=\u0022:joy:\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"GGG-GoodGuyGreg","CreatedById":226561,"CreatedDateTime":"2023-04-22T20:21:52Z","Content":"\n\u003Cp\u003E\nJudging from the latest announcement of Nate, the update before the Science update is going to include some new engines and probably other new content.\n\u003C/p\u003E\n\u003Cp\u003E\nIt’s unclear how many updates it will be before Science so we just get to be teased about it until it’s more clear. \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022205123\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed7510645083\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/216765-imagining-dragons/\u0026amp;do=embed\u0022 style=\u0022height:375px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Bake","CreatedById":228801,"CreatedDateTime":"2023-04-23T23:03:49Z","Content":"\n\u003Cp\u003E\nI didn\u0027t buy the game on release because I heard career mode wasnt in yet.  I saw it on steam yesterday and decided to buy.  I assumed career mode had been added or was close to being added.  Came here today and found out no career mode planned.\n\u003C/p\u003E\n\u003Cp\u003E\nI have 390.9 hours in the original KSP.  390.85 are in career mode. I loaded up science mode once long enough to figure out I wasn\u0027t interested in it.   I don\u0027t think I\u0027m interested in a KSP without money. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd as for contracts, I love them.  The money aspect and contracts are the whole reason I tried to build as small and cheap as possible to complete the current objective.  Otherwise, I would have just built with my most advanced/largest equipment every mission.  I also enjoyed the early game crunch of trying to upgrade my base to max. I usually got bored with the game after I had everything at max and plenty of money.  \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m on the fence about returning KSP2.  The goodwill alone from the original KSP means I should buy it even if I don\u0027t intend to play it.  However, I want to vote with my wallet.   No career mode will at least mean no extra money on future expansion from me.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-04-24T02:11:05Z","Content":"\n\u003Cp\u003E\nSomething something people can sooner imagine the end of the world before they can imagine the end of capitalism.\u003Cbr\u003E\n\u003Cbr\u003E\nI mean. If there\u0027s no money, what is there even to live for?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-04-24T02:11:42Z\u0022 title=\u002204/24/2023 02:11  AM\u0022 data-short=\u00221 yr\u0022\u003EApril 24, 2023\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-04-24T02:26:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224276352\u0022 data-ipsquote-contentid=\u0022212812\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221682302265\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSomething something people can sooner imagine the end of the world before they can imagine the end of capitalism.\u003Cbr\u003E\n\u003Cbr\u003E\nI mean. If there\u0027s no money, what is there even to live for?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMoney is just an easily transferred representation of value.  One could as easily ask: if there is no food, clothing,  or shelter what is there to live for?  Most things transacted are not luxuries, but necessities.  And the luxuries are what keep it from being mere survival\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-04-24T03:13:59Z","Content":"\n\u003Cp\u003E\nYeah skipping the moral vacancy of these sentiments. Nearly all of the best games Ive played had no money. This all seems like some weak, unimaginative thinking. Ksp has always been about discovery and the power of clever engineering. Y’all need to broaden your horizons. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-04-24T03:20:12Z\u0022 title=\u002204/24/2023 03:20  AM\u0022 data-short=\u00221 yr\u0022\u003EApril 24, 2023\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}