{"TopicId":214955,"ForumId":119,"TopicTitle":"A Playful Critique of Realism in the Kerbol System by a Hobby Planetologist.","CreatedByName":"wafflemoder","CreatedById":51745,"CreatedDateTime":"2023-03-12T20:57:23Z","PageNum":1,"Articles":[{"CreatedByName":"wafflemoder","CreatedById":51745,"CreatedDateTime":"2023-03-12T20:57:23Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EDISCLAIMER: This IS NOT a suggestion, request, or complaint. I DO NOT believe that hyper realism is somehow \u0022superior\u0022 to the more loose approach KSP and its sequel have taken, and am in fact quite fond of the planetary systems of both KSP1 and KSP2. I am merely using the familiar Kerbol system to talk about planetary science, both for my own amusement and hopefully yours too.\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kerbol system in KSP1 is a setting filled with novel fantastical worlds, but others are hard to tell apart at a glance (particularly Mun, Ike, Dres, and even Tylo to an extent). KSP2 sought to not only bring unique character to these worlds, but also improve the realism of what was previously established, all while making as few modifications to the system\u0027s recognizability as possible. This endeavor is not something to be overlooked, and the results are very admirable.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever at the same time, I\u0027m a worldbuilder, one who particularly focuses on realistic planetology and has far too much free time. And having had time to stew over KSP2 over the last week and a bit, I want to share my unique perspective on the Kerbol system and what changes I feel could have been done better, as well as what choices I would have made were scientific feasibly my only concern.\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nKerbol: Carrying over from KSP1, its much larger than what you\u0027d expect for a solar analog. The reason for this is so that it matches the apparent size of Mun in Kerbin\u0027s skies for eclipses. However, imo I don\u0027t think Kerbol being smaller would take away from this in any way. Additionally, Kerbol is also much redder than a solar analog, looking about 2000-2500 K (for comparison the sun is 5775 K). The lensflare is significantly whiter, looking to be around 4500-5000 K.\n\u003C/li\u003E\n\u003Cli\u003E\nMoho: Moho obviously draws inspiration from Mercury. The brownish color appears to be rust, however this would likely require an atmosphere to maintain the high oxidation state over geologic timescales. It is also a notable departure from Mercury\u0027s ironically iron poor crust and mantle (fun fact), but more than doable.\n\u003C/li\u003E\n\u003Cli\u003E\nEve: In the original KSP, Eve\u0027s oceans were comprised of \u0022explodium\u0022, which presumably is some form of volatile hydrocarbon based fuel. KSP2 reimagines these liquid bodies as molten sulfur instead, and I am very pleased with this. Molten sulfur is an often overlooked fluid on Earth, occasionally occurring as \u0022blue lava\u0022 in terrestrial environments and in volcanic pools at the seafloor. However, while sulfur is a very common element in terrestrial worlds, getting enough of it to form deep oceans is practically impossible even with extremely extensive volcanism. Even then, you\u0027d likely require greater sulfur abundances, which would likely reduce density due to iron sulfide in the core. This is in stark contrast to the high density we see with Eve, with an inferred core mass fraction similar to Mercury. Additionally, this does not provide a particularly satisfying explanation for the relatively thin atmosphere of Eve as sulfur cannot sequester CO2 back into the mantle like water. So unfortunately as much as I love the idea of molten sulfur, I think long chain hydrocarbon like parrafin or asphalts would have been better options. A hydrocarbon ocean also lines up very neatly with other observations, as the more reducing conditions would discourage CO2 formation, instead favoring CO, C2H2, CH4, and H2 like in titan\u0027s atmosphere. Additionally Mercury\u0027s crust is actually quite carbon rich (with graphite making up a few percent of it by weight) so assuming similar processes on Eve would give a large body of reducing carbon to work with. Now as for why Eve is purple, maybe its some retinal based phytoplankton in the atmosphere? Not the best, but still far better than the iodine or fullerene explanations. \n\u003C/li\u003E\n\u003Cli\u003E\nGilly: Not much to be said. It\u0027s a lovable little potato.\n\u003C/li\u003E\n\u003Cli\u003E\nKerbin: I could probably go down a rabbit hole about climate models and tectonics and all sorts of things. But honestly even with realism in mind it serves its purpose as an Earth analog well enough.\n\u003C/li\u003E\n\u003Cli\u003E\nMun: I could not have asked for a better interpretation geographically, though offsetting the mare from the near side may conflict with some models for the lunar surface dichotomy. A part of me wishes it wasn\u0027t such a perfect moon analog, as it lost what little unique character it had left, but I suppose its larger size and closer proximity will have to do.\n\u003C/li\u003E\n\u003Cli\u003E\nMinmus: Oh boy, I can certainly see why the dev team struggled to figure this thing out, and tbh I\u0027m stumpted myself. Glass is a good step up from ice, but just creates new problems. Naturally occurring glasses do not make glistenning flat fields, they make jagged boulders which only when sheared reveal their reflective shine. Those of you familiar with Minecraft may recognize obsidian as one of the most popular volcanic glasses, but there are others. Unfortunately most require shock cooling in the presence of water to form, which needless to say is difficult to explain on Minmus. That being said, I gotta give the dev team massive credits for finding something that at least could resemble Minmus. Still, what could Minmus be instead? My best guess would be to once again turn to hydrocarbons, a forming comet long since devoid of water, with only dark organic material and rock. over geologic timescales the tar would be fluid enough to relax into flat almost \u0022lakes\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nDuna: Obviously Duna is Mars. We all know this, but it actually misses the mark in a major way. This version of Duna is plastered in craters, which while interesting, doesn\u0027t line up with the geologic processes we expect to be occurring there. Like Mars, Duna should be tectonically active, especially with Ike for tidal heating. Volcanism and other tectonic processes can do great work in erasing craters from the surface. Also unlike Mars, Duna has a rather respectable atmosphere, and the aeolian erosion should further help to smooth over craters. But speaking of the atmosphere, another unexpected facit of Duna may emerge: precipitation. The atmosphere of Mars is rather thin, and so temperature variation across latitudes is high. As a result, the poles act as very effective cold traps for water ice, keeping the rest of the planet dry. Duna\u0027s much thicker atmosphere reduces the strength of these cold traps, as evidenced by the atmosphere itself (Mars\u0027 atmosphere is actually limited by the vapor pressure of CO2 at the poles. So because Duna has a thicker CO2 atmosphere, we can infer much higher polar temperatures of \u0026gt;170 K compared to Mars\u0027 140 K). While not much, this does allow for more moisture in the air and cloud formation, which will inevitably come down. This means we can expect snow covered regions extending past the polar ice caps, particularly in lowlying regions and craters. Mars actually does have a few snow-filled craters like Korolev, which are astoundingly beautiful. However in addition to snow there is likely also rain, as Duna\u0027s higher pressure can keep water a liquid, and thicker CO2 atmosphere should enable reasonably warm summers. While I don\u0027t like the idea of actual lakes or seas for Duna, I do think riverine terrain could be featured much more strongly to imply seasonal melts and drainage paths.\n\u003C/li\u003E\n\u003Cli\u003E\nIke: I appreciate the effort that went into diversifying Ike from the other grey worlds, with extinct volcanism being a distinct feature. However, with that being said I really don\u0027t feel this was executed very well. The current volcanoes are mentioned as being extinct, which means active resurfacing is no longer taking place. As such, we should still expect significant cratering (at least more than Duna) on Ike. Additionally while stratovolcanoes are a neat touch, more expansive flat volcanoes and basaltic lava fields would be more accurate, as our own moon also has a history of volcanism. If activity does continue to the modern day, one might also expect some discoloration around the volcanic regions, like a very desaturated and far less extreme version of Io. It’s also possible that there could be some discoloration through surface oxidation, either from material delivered from Duna or native oxidation via a trace volcanic atmosphere (ie less than what KSP defines as vacuum) which is also similar to what is present on Io, though the low temperatures there freeze most of it out.\n\u003C/li\u003E\n\u003Cli\u003E\nDres: First off, love the rings. And the equatorial bulge does suggest a complex history with past rings long since lost, as obviously the present rings cannot have fallen to the surface and still be present. However, I think the Iapetus inspiration went a bit too far with the two-tone design. The reason for this is quite simple, it doesn\u0027t work for Dres. For this we must take a brisk detour to see why Iapetus looks the way it does. TL;DR, dark dust from Phoebe coats the leading hemispheres of all the major Saturnian moons, and because Iapetus has the longest days its the only one that got hot enough for a feedback loop of bright ice sublimating leaving darker organics causing more sublimation etc. Now, Dres doesn\u0027t have any way to preferentially deposit dark material on it, and even if it did, being much further in its already hot enough for this feedback loop to occur over the entire surface (which is why Ceres is actually very dark). So unfortunately this just cant work here. However, cryovolcanism can create bright spots on the surface (like Ceres), and brighter ring material can at least lighten the equatorial region, so not all is lost.\n\u003C/li\u003E\n\u003Cli\u003E\nJool: Jool is still just a big green gas giant. Why is it so green? honestly aliens putting paint in isn\u0027t the worst option. Plants can be green, but to completely cover a gas giant in such a brilliant shade requires an exceptionally large biomass. Chlorine enrichment is also a non-starter, since you really can\u0027t enrich gas giants without some absurd tomfoolery or enriching other stuff as well to make it a moot point, chlorine isn\u0027t even that green, and it would form chlorides and sink below the visible cloud deck. As for Jool\u0027s moons, one might be familiar with the fact that Jool\u0027s moons are extremely unstable if actually simulated. This is for two reasons, one: they are in a laplace resonance, which is pretty trick to actually keep stabilizing, and two: they\u0027re just SO DARN MASSIVE. For comparison, Jool is 80 times more massive than Kerbin, comparable to what Saturn is to Earth. Tylo is 80% the mass the Kerbin, compared to Titan being just 2% the mass of Earth. And Jool has two other moons nearly as large. If I were splitting hairs, I\u0027d probably do some combination of making the moons less massive, making Jool more massive, and opting for a less troublesome resonance chain and greater separations. But that is quite a departure form the architecture of KSP1, so its understandable why they didn\u0027t.\n\u003C/li\u003E\n\u003Cli\u003E\nLaythe: Keeping Laythe\u0027s oceans liquid is a challenge. It\u0027d be trivial to just add enough hydrogen or methane, but oxygen puts a cap on how abundant those can be. CO2 freezes out of the upper atmosphere; nitrogen oxides break down too quickly; natural antifreeze mixtures can’t get cold enough; tectonic heating, while great for interiors, does nothing for surface temp. The only real option is to turn to CFCs, potent and long-lived GHGs which can also handle low temps and oxygen, but you\u0027d have to rely on biology. The oceans would probably end up with some hydrochloric acid in it and both them and the atmosphere may turn slightly green from chlorine. Regarding its terrain, Laythe’s only terrain seems to be crater rims, which really doesn’t line up with the thick atmosphere, and active geology. As presently depicted, Laythe should have terrain far more similar to Kerbin, albeit heavily inundated, with a higher focus on volcanic island chains. Laythe\u0027s terrain is  also pretty monotone, and some color variation would be nice with dark basaltic volcanoes and lighter shores. Also because greenhouse heating is responsible for Laythe\u0027s clement temperatures, you shouldn\u0027t expect any latitudinal temperature variations, and so the poles would be no colder than the equator and thus iceless.\n\u003C/li\u003E\n\u003Cli\u003E\nVall: While I love the dichotomy between its hemispheres, the explanation for it is troublesome. Unless Jool was far hotter (either through a young age or very high mass), its radiation cannot be the cause for this disparity. Jool’s gravitation influence will however produce increased tectonic activity at the poles as well as the leading and trailing points (as seen with Enceladus, Dione, Miranda, and potentially even Titan)vbut there really aren’t any signs of activity on Vall at all beyond the single crack revealing the subsurface ocean (or more likely a liquid inclusion in the icy crust above it), so more signs that this world is indeed active would be good. It’s also lso worth noting that Vall is far less dense than either Laythe or Tylo, suggesting a higher water mass fraction. We also see this in Jupiter’s outer moons, but unlike them, Vall is sandwiched between two more rocky worlds. Were Vall swapped with Tylo, it would fit better compositionally, but this would create its own problems.\n\u003C/li\u003E\n\u003Cli\u003E\nTylo: I love the new Ganymede-inspired direction of Tylo, and think its perfect fit. My only real issue with Tylo is its higher density compared to Vall. As previously mentioned this could be resolved by swapping the two, but that would also mean Tylo would be more active than Vall. Alternatively reducing the density of Tylo and/or increasing the density of Vall would be the simpler option.\n\u003C/li\u003E\n\u003Cli\u003E\nBop: Bop is an interesting case. I like its irregular appearance and love the massive crater. But at the same time, being more massive than both Minmus and Pol, small rounded worlds, one would expect Bop to be similarly shaped. I think the easiest solution would just be to swap the sizes and masses of Bop and Pol.\n\u003C/li\u003E\n\u003Cli\u003E\nPol: It clearly draws inspiration from Io, with a volcanic and sulfur covered surface. Unfortunately this conflicts with its distant orbit, where tidal heating is pretty negligible. Pol is mentioned to have a high radiation environment, which if the result of very extreme radioisotope enrichment might be able to resolve this contention, however that would necessitate an interstellar origin of Pol, which is disfavored by its low inclination orbit of Jool and synchronous rotation. This explanation would fit better if instead Pol were not tidally locked to Jool and orbited at a greater distance and much higher inclination (30-70° / 110-160°) Alternatively, Pol could be moved to a more circular orbit interior to Laythe where tidal heating would be sufficient to drive volcanism. Its high radiation environment would then be the result of its volcanism producing a plasma torus around Jool.\n\u003C/li\u003E\n\u003Cli\u003E\nEeloo: I have my doubts that Eeloo would be active enough to produce its observed features (bright surface and large ravines) with its relatively small size and in the absence of any companions. Its lack of a nitrogen atmosphere is also a bit troubling, as it suggests processing within a circumplanetary disk to reset its volatile composition. One possible interpretation from this is that Eeloo is an ejected moon of Jool, though I am unsure of the feasibility of it entering a 2:3 orbital resonance after this. This would also suggest a much more chaotic history of the Joolean system, making orbital resonances between its moons unlikely. Additionally, Eeloo would become inactive after its ejection so a darker and non-reflective surface would be expected.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nSo what’s my overall take on things? I like it. There is a clear attention to detail that has been put into making the objects more realistic while preserving the existing content and diversifying the system. I feel greater realism could have been achieved if greater departures were taken, which I feel I’ve adequately illustrated. But realism was not the sole goal of the development team, and it’s extremely important to keep that in mind. \n\u003C/p\u003E\n\u003Cp\u003E\nAgain, I am not claiming that realism is somehow better. A lot of people couldn’t care less if the world they land on is realistic or not, and that is certainly a respectable opinion that I too have on occasion. Fantastical environments can give rise to unique gameplay challenges that pure realism often cannot. Does it really matter if Tylo’s probably too big and dense? Of course not. It’s a fun challenge to go to and without its size and gravity that would be diminished. Heck, this entire time I’ve been glossing over the scale of the Kerbol system. Obviously its smaller than irl, which results in all sorts of weird densities, but it makes launching easier and more approachable. However at the same time, when realism can add to a world to make it more unique, I can’t help but feel it’s a missed opportunity.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-12T21:01:05Z\u0022 title=\u002203/12/2023 09:01  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 12, 2023\u003C/time\u003E by wafflemoder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cocoscacao","CreatedById":225696,"CreatedDateTime":"2023-03-12T21:53:16Z","Content":"\n\u003Cp\u003E\nThis was an interesting read. Kerbolar system had to be the hardest, since they\u0027re stuck with legacy lore (canon). I\u0027d enjoy a second, and third post from you, once new worlds become unmasked for the players.\n\u003C/p\u003E\n"},{"CreatedByName":"Chilkoot","CreatedById":175911,"CreatedDateTime":"2023-03-12T22:17:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257917\u0022 data-ipsquote-contentid=\u0022214955\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678657996\u0022 data-ipsquote-userid=\u0022225696\u0022 data-ipsquote-username=\u0022cocoscacao\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, cocoscacao said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKerbolar system had to be the hardest, since they\u0027re stuck with legacy lore (canon).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPossibly unpopular opinion, but I feel that Nate \u0026amp; Co. missed a real opportunity to start fresh with new lore and a new planetary system.  For the life of me, I can\u0027t figure out why they recycled the original right down the last orbital inclination.  I tend to think it was perhaps a pander.\n\u003C/p\u003E\n\u003Cp\u003E\nThe original system could have been a location you discover later in the game with interstellar travel or something.  Canon really becomes whatever the IP owner decides (ahem, Disney *cough*), so there was nothing really \u003Cem\u003Ecompelling\u003C/em\u003E Star Theory at the time to rebuild the original system for this release.  As great as new Duna looks, it\u0027s still... Duna.  Again.\n\u003C/p\u003E\n"},{"CreatedByName":"Stoup","CreatedById":2804,"CreatedDateTime":"2023-03-12T22:23:03Z","Content":"\n\u003Cp\u003E\nInteresting read! Thanks for sharing. It\u0027s cool to see comparisons between realism, rule-of-coolism, and praticalism \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"cocoscacao","CreatedById":225696,"CreatedDateTime":"2023-03-12T22:39:03Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/175911-chilkoot/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022175911\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/175911-chilkoot/\u0022 rel=\u0022\u0022\u003E@Chilkoot\u003C/a\u003E I don\u0027t think it matters that much, considering there will be at least 2 new planetary systems. Plus, I\u0027m hoping that science and colony stuff will give us more things to do on both new and familiar grounds. KSP 1 is pretty barren in that regard. Driving rovers around aimlessly in search of a rock to scan, isn\u0027t exactly fun.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-12T22:46:10Z\u0022 title=\u002203/12/2023 10:46  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 12, 2023\u003C/time\u003E by cocoscacao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2023-03-13T07:16:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257929\u0022 data-ipsquote-contentid=\u0022214955\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678659422\u0022 data-ipsquote-userid=\u0022175911\u0022 data-ipsquote-username=\u0022Chilkoot\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Chilkoot said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPossibly unpopular opinion, but I feel that Nate \u0026amp; Co. missed a real opportunity to start fresh with new lore and a new planetary system.  For the life of me, I can\u0027t figure out why they recycled the original right down the last orbital inclination.  I tend to think it was perhaps a pander.\n\u003C/p\u003E\n\u003Cp\u003E\nThe original system could have been a location you discover later in the game with interstellar travel or something.  Canon really becomes whatever the IP owner decides (ahem, Disney *cough*), so there was nothing really \u003Cem\u003Ecompelling\u003C/em\u003E Star Theory at the time to rebuild the original system for this release.  As great as new Duna looks, it\u0027s still... Duna.  Again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree that it was a lost opportunity and, like yourself, I\u0027m not sure why they did it. Newcomers to the game wouldn\u0027t have known any better and judging by the number of Gas Giant II threads I\u0027ve seen over the years, I think there was an appetite for an expanded Kerbol system from the current player base.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I would have preferred Intercept to ditch interstellar travel and massively expand  the Kerbol system to provide new places to visit. You only have to look at the real life solar system to see the diversity of celestial bodies that a single star system can contain.  \n\u003C/p\u003E\n\u003Cp\u003E\nBut that ship has sailed.\n\u003C/p\u003E\n"},{"CreatedByName":"joratto","CreatedById":218497,"CreatedDateTime":"2023-03-13T12:36:22Z","Content":"\n\u003Cp\u003E\nGreat post. I would LOVE to see a Korolev-style snowy crater on Duna and frankly I’m surprised the devs haven’t added something like it.\n\u003C/p\u003E\n"},{"CreatedByName":"VlonaldKerman","CreatedById":225683,"CreatedDateTime":"2023-03-13T13:50:22Z","Content":"\n\u003Cp\u003E\nI really like most of their changes to the Kerbolar system with a few notable exceptions:\n\u003C/p\u003E\n\u003Cp\u003E\n1) Kerbol itself looks way too red- I have nowhere near \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u0027s level of knowledge of planetary/solar systems but, especially from the map view, Kerbol\u0027s red color was actually very off-putting.\n\u003C/p\u003E\n\u003Cp\u003E\n2) I\u0027m actually not a fan of the Duna changes. For me, I always liked that it didn\u0027t feel like I was landing on Mars. Duna\u0027s extreme surface features like canyons (relative to its size), large ice caps, and lack of substantial craters gave it personality. Maybe I haven\u0027t explored enough of the new Duna yet- but it looks much more like Mars than the OG Duna, and I kind of wish it didn\u0027t. Duna is actually very different from Mars, which is very evident when you notice its significantly thicker atmosphere, for instance (~.15 atm vs. ~.01 atm).\n\u003C/p\u003E\n\u003Cp\u003E\n3) I echo \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u0027s opinions about Laythe. I was a little confused to see the massive crater formations, given its thick atmosphere and the lack of variation in surface composition. I think they missed an opportunity to add more obviously volcanic island chains, for instance. \n\u003C/p\u003E\n"},{"CreatedByName":"wafflemoder","CreatedById":51745,"CreatedDateTime":"2023-03-13T17:53:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257929\u0022 data-ipsquote-contentid=\u0022214955\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678659422\u0022 data-ipsquote-userid=\u0022175911\u0022 data-ipsquote-username=\u0022Chilkoot\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, Chilkoot said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPossibly unpopular opinion, but I feel that Nate \u0026amp; Co. missed a real opportunity to start fresh with new lore and a new planetary system.  For the life of me, I can\u0027t figure out why they recycled the original right down the last orbital inclination.  I tend to think it was perhaps a pander.\n\u003C/p\u003E\n\u003Cp\u003E\nThe original system could have been a location you discover later in the game with interstellar travel or something.  Canon really becomes whatever the IP owner decides (ahem, Disney *cough*), so there was nothing really \u003Cem\u003Ecompelling\u003C/em\u003E Star Theory at the time to rebuild the original system for this release.  As great as new Duna looks, it\u0027s still... Duna.  Again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot sure I would\u0027ve gone that far, but I do think much greater liberties could have been taken. I would not be surprised if in the future we do see new objects added to the Kerbol system, but likely any new objects are being saved along with the other systems. \n\u003C/p\u003E\n"},{"CreatedByName":"whatsEJstandfor","CreatedById":220814,"CreatedDateTime":"2023-03-13T19:21:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257929\u0022 data-ipsquote-contentid=\u0022214955\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678659422\u0022 data-ipsquote-userid=\u0022175911\u0022 data-ipsquote-username=\u0022Chilkoot\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, Chilkoot said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs great as new Duna looks, it\u0027s still... Duna.  Again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRemember, though, that many (most?) KSP1 players didn\u0027t even leave the Kerbin system. Assuming the new onboarding lets them get gooder at KSP2, Duna will be all new even to a big chunk of KSP1 players.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2023-03-13T21:01:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224258411\u0022 data-ipsquote-contentid=\u0022214955\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678735314\u0022 data-ipsquote-userid=\u0022220814\u0022 data-ipsquote-username=\u0022whatsEJstandfor\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, whatsEJstandfor said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRemember, though, that many (most?) KSP1 players didn\u0027t even leave the Kerbin system. Assuming the new onboarding lets them get gooder at KSP2, Duna will be all new even to a big chunk of KSP1 players.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLike me!\n\u003C/p\u003E\n"},{"CreatedByName":"ILikeIke","CreatedById":145488,"CreatedDateTime":"2023-03-14T06:31:24Z","Content":"\n\u003Cp\u003E\nThis was a very Kerbal explanation, which I mean in the best way I can use that term. I\u0027m excited to see your take on the other solar systems as they\u0027re released!\n\u003C/p\u003E\n"},{"CreatedByName":"rjbvre","CreatedById":227660,"CreatedDateTime":"2023-03-14T14:13:23Z","Content":"\n\u003Cp\u003E\nThanks for a fascinating read! It\u0027s always interesting to hear an expert analyze these things. I agree that it\u0027s probably best to look the other way with these issues. No doubt the devs are trying to balance maintaining the og Kerbal system with enhancing scientific accuracy. The real test will be the new star systems. \n\u003C/p\u003E\n\u003Cp\u003E\nYour post did raise a question though. You mention how many of these bodies have more craters than they should given their atmospheres and/or presumed geological activity. Wouldn\u0027t this assume the same amount of meteor activity in the Kerbal system as our own? If there were more meteors flying around the Kerbal system could that make these features more realistic? \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if the number of meteors, comets, and other impactors were to be similar to our own system, could the fact that the Kerbal system is much smaller than ours while still having planets/moons with similarly large gravitational pulls make impacts occur more frequently? Just brainstorming some possible in-universe explanations.\n\u003C/p\u003E\n"},{"CreatedByName":"wafflemoder","CreatedById":51745,"CreatedDateTime":"2023-03-18T17:25:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224258868\u0022 data-ipsquote-contentid=\u0022214955\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678803203\u0022 data-ipsquote-userid=\u0022227660\u0022 data-ipsquote-username=\u0022rjbvre\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/14/2023 at 10:13 AM, rjbvre said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks for a fascinating read! It\u0027s always interesting to hear an expert analyze these things. I agree that it\u0027s probably best to look the other way with these issues. No doubt the devs are trying to balance maintaining the og Kerbal system with enhancing scientific accuracy. The real test will be the new star systems. \n\u003C/p\u003E\n\u003Cp\u003E\nYour post did raise a question though. You mention how many of these bodies have more craters than they should given their atmospheres and/or presumed geological activity. Wouldn\u0027t this assume the same amount of meteor activity in the Kerbal system as our own? If there were more meteors flying around the Kerbal system could that make these features more realistic? \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if the number of meteors, comets, and other impactors were to be similar to our own system, could the fact that the Kerbal system is much smaller than ours while still having planets/moons with similarly large gravitational pulls make impacts occur more frequently? Just brainstorming some possible in-universe explanations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s complicated. Duna and Laythe are the only obvious cases of increased cratering, however the craters on are clearly from different sources. Duna has many relatively small craters, which would indeed be suggestive of sustained impacts late into the systems history.\u003Cbr\u003E\n\u003Cbr\u003E\nHowever in contrast to this, Laythe has far larger impact features more reminiscent of lunar maria. In order for these to be geologically recent, it requires objects large enough to cause these impacts to still be abundant and frequently encountering not only Laythe but at least the entire Joolian system if not Kerbol as a whole. The lack of these massive craters on other young surfaces like Vall would seem to contradict this.\n\u003C/p\u003E\n"},{"CreatedByName":"rjbvre","CreatedById":227660,"CreatedDateTime":"2023-03-18T18:48:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224261764\u0022 data-ipsquote-contentid=\u0022214955\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221679160352\u0022 data-ipsquote-userid=\u002251745\u0022 data-ipsquote-username=\u0022wafflemoder\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, wafflemoder said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s complicated. Duna and Laythe are the only obvious cases of increased cratering, however the craters on are clearly from different sources. Duna has many relatively small craters, which would indeed be suggestive of sustained impacts late into the systems history.\u003Cbr\u003E\n\u003Cbr\u003E\nHowever in contrast to this, Laythe has far larger impact features more reminiscent of lunar maria. In order for these to be geologically recent, it requires objects large enough to cause these impacts to still be abundant and frequently encountering not only Laythe but at least the entire Joolian system if not Kerbol as a whole. The lack of these massive craters on other young surfaces like Vall would seem to contradict this.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh interesting, that makes sense. Thanks for the reply\n\u003C/p\u003E\n"},{"CreatedByName":"wafflemoder","CreatedById":51745,"CreatedDateTime":"2023-03-20T17:49:55Z","Content":"\n\u003Cp\u003E\nSomething I realize I didn\u0027t actually talk about was the origin and orbital situation of Minmus.\u003Cbr\u003E\n\u003Cbr\u003E\nWhether its ceramic, ice, or as I envisioned it tar, it\u0027s clear that Minmus has a different composition to Kerbin and Mun. As such capture seems to be required. Its orbit then would likely have a higher inclination, though its placement is probably fine. It\u0027s possible that Minmus may have caused some instability in the early Kerbin system, but I\u0027m honestly not sure to what extent with how massive Mun is.\n\u003C/p\u003E\n"},{"CreatedByName":"RevanX_LSR","CreatedById":216972,"CreatedDateTime":"2023-08-01T11:15:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224257885\u0022 data-ipsquote-contentid=\u0022214955\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221678654643\u0022 data-ipsquote-userid=\u002251745\u0022 data-ipsquote-username=\u0022wafflemoder\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/13/2023 at 4:57 AM, wafflemoder said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nLaythe: Keeping Laythe\u0027s oceans liquid is a challenge. It\u0027d be trivial to just add enough hydrogen or methane, but oxygen puts a cap on how abundant those can be. CO2 freezes out of the upper atmosphere; nitrogen oxides break down too quickly; natural antifreeze mixtures can’t get cold enough; tectonic heating, while great for interiors, does nothing for surface temp. The only real option is to turn to CFCs, potent and long-lived GHGs which can also handle low temps and oxygen, but you\u0027d have to rely on biology. The oceans would probably end up with some hydrochloric acid in it and both them and the atmosphere may turn slightly green from chlorine. Regarding its terrain, Laythe’s only terrain seems to be crater rims, which really doesn’t line up with the thick atmosphere, and active geology. As presently depicted, Laythe should have terrain far more similar to Kerbin, albeit heavily inundated, with a higher focus on volcanic island chains. Laythe\u0027s terrain is  also pretty monotone, and some color variation would be nice with dark basaltic volcanoes and lighter shores. Also because greenhouse heating is responsible for Laythe\u0027s clement temperatures, you shouldn\u0027t expect any latitudinal temperature variations, and so the poles would be no colder than the equator and thus iceless.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think most of this problems can be solved by using nitrogen. Liquid nitrogen is quite unreactive, but it does need a low temperature like the stuff you would experience out at Urlum/nero (think hadrian). an aerosol layer that reflects some heat would help…\n\u003C/p\u003E\n\u003Cp\u003E\nAlso sorry for reviving this thread after five months \n\u003C/p\u003E\n"}]}