{"TopicId":219135,"ForumId":119,"TopicTitle":"KSP 2 is a perfectly playable early access game (v0.1.4)","CreatedByName":"Vl3d","CreatedById":219348,"CreatedDateTime":"2023-08-31T16:43:38Z","PageNum":1,"Articles":[{"CreatedByName":"Vl3d","CreatedById":219348,"CreatedDateTime":"2023-08-31T16:43:38Z","Content":"\n\u003Cp\u003E\nI\u0027ve played KSP 2 when it came out for about 65 hours and then I skipped all the patches until now. I tried out 0.1.4 now after ~5 months and I have to say that \u003Cstrong\u003Emy impression is very, very good\u003C/strong\u003E. \u003Cstrong\u003EThe game is in a very good state right now. \u003C/strong\u003EI really don\u0027t agree with the people complaining and hating - the number of bugs is small and I have not encountered any major problems \u003Cs\u003E(except for the parts symmetry issue, which I think is a regression)\u003C/s\u003E. Here\u0027s my feedback (for now):\n\u003C/p\u003E\n\u003Cp\u003E\nPositive feedback:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThe UI is in a much better state. I love the Parts Manager speed.\n\u003C/li\u003E\n\u003Cli\u003E\nPerformance is great compared to how it was at launch.\n\u003C/li\u003E\n\u003Cli\u003E\nRevert to launch and to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E buttons are working now!\n\u003C/li\u003E\n\u003Cli\u003E\nThe left side menu (the one when you press ESC) works as expected (it was ultra buggy).\n\u003C/li\u003E\n\u003Cli\u003E\nWorking with the maneuver nodes feels good.\n\u003C/li\u003E\n\u003Cli\u003E\nI did not experience orbital drift around the Mun or Kerbin.\n\u003C/li\u003E\n\u003Cli\u003E\nThe NavBall dark colors are nice on the eyes.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nBugs and mini-suggestions:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\n\u003Cs\u003EIn \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E the translate tool for mirror symmetry orientation is not respected (if I move a battery, solar panel or wheel up the other one goes down) because one part is flipped when placed (it\u0027s upside down).\u003C/s\u003E (not a bug, sorry, I was in 2 x symmetry mode)\n\u003C/li\u003E\n\u003Cli\u003E\nNotification keep popping up (lack of solar) and it\u0027s annoying.\n\u003C/li\u003E\n\u003Cli\u003E\nMap view UI is still very pixelated.\n\u003C/li\u003E\n\u003Cli\u003E\nLimit celestial body zoom-in in Map View / Tracking Station so the camera does not enter the planet.\n\u003C/li\u003E\n\u003Cli\u003E\nAllow the usage of Space-bar key to pause / resume tutorial video.\n\u003C/li\u003E\n\u003Cli\u003E\nRight click hit-box is not accurate in Tracking Station for some celestial bodies.\n\u003C/li\u003E\n\u003Cli\u003E\nSometimes I have to click multiple times on the Parts Manager \u0022x\u0022 to close the window.\n\u003C/li\u003E\n\u003Cli\u003E\nA loud sound sometimes plays in my right speaker when clicking in the Part-picker in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nIn \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E when right clicking somewhere to exit the 2D vehicle viewer there is no fade out effect.\n\u003C/li\u003E\n\u003Cli\u003E\nIn the Parts Manager please group parts that have been placed by symmetry (like identical solar panels or batteries) so the list is more compact.\n\u003C/li\u003E\n\u003Cli\u003E\nIf I want to import a vehicle in my current workspace then save it here, I can\u0027t see where to select the name of my current workspace file (the other one shows up by default).\n\u003C/li\u003E\n\u003Cli\u003E\nWheel collision mesh is still very basic (center of the wheel).\n\u003C/li\u003E\n\u003Cli\u003E\nI can\u0027t create a maneuver node when in atmosphere and game is paused.\n\u003C/li\u003E\n\u003Cli\u003E\nPlease allow me to move the AP / PE node info mini windows by dragging them.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen focused on another celestial body I can\u0027t time warp to a point inside its influence sphere(from outside).\n\u003C/li\u003E\n\u003Cli\u003E\nPlease increase the right-mouse-button pan speed when looking around the vehicle.\n\u003C/li\u003E\n\u003Cli\u003E\nIf I deactivate an engine I get a \u0022out of fuel\u0022 error when trying to create a maneuver plan.\n\u003C/li\u003E\n\u003Cli\u003E\nI need to be able to press \u0026gt;\u0026gt;\u0026gt; (warp to maneuver) again to go down to 5 seconds from 30 (so I don\u0027t have to wait so long). Right now I get the \u0022proximity to celestial body\u0022 alarm (which needs its text changed).\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nI will continue to play the game and experiment with the parts. I feel it\u0027s really fun to play now. I can\u0027t wait for the water / heat / terrain updates. With those in place we\u0027re off to the races for Science mode.\n\u003C/p\u003E\n\u003Cp\u003E\nGreat job development team - I\u0027m really proud of you guys and girls!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-09-01T15:28:02Z\u0022 title=\u002209/01/2023 03:28  PM\u0022 data-short=\u0022Sep 1\u0022\u003ESeptember 1, 2023\u003C/time\u003E by Vl3d\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alexoff","CreatedById":145774,"CreatedDateTime":"2023-08-31T16:50:05Z","Content":"\n\u003Cp\u003E\nNo another option for a hater? Where is the answer - to the perfect game so far is like to Jool? Personally, I got tired of the KSP1 sandbox for a month in the winter of 2015.\n\u003C/p\u003E\n"},{"CreatedByName":"jacksawild","CreatedById":178232,"CreatedDateTime":"2023-08-31T16:55:51Z","Content":"\n\u003Cp\u003E\nThe sand box doesn\u0027t work yet. Docking is janky, orbits are unpredictable and going EVA gives an impulse to your craft.\u003Cbr\u003E\n\u003Cbr\u003E\nIn my opinion, once the sandbox works as it should and there is some kind of official modding API then the communithy will pick up the slack and the game could be a replacement for KSP1\n\u003C/p\u003E\n"},{"CreatedByName":"Meecrob","CreatedById":104543,"CreatedDateTime":"2023-08-31T17:17:01Z","Content":"\n\u003Cp\u003E\nSo where are we? Still not on the roadmap it seems...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Call me a hater if you want. I just want what was advertised. If that is being a \u0022hater\u0022 then I guess I\u0027m a hater.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224317930\u0022 data-ipsquote-contentid=\u0022219135\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221693500951\u0022 data-ipsquote-userid=\u0022178232\u0022 data-ipsquote-username=\u0022jacksawild\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, jacksawild said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn my opinion, once the sandbox works as it should and there is some kind of official modding API then the communithy will pick up the slack and the game could be a replacement for KSP1\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf this is true, there should be rewards for modders doing the work (for free) of the paid developers. Fair is fair.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-31T17:18:24Z\u0022 title=\u002208/31/2023 05:18  PM\u0022 data-short=\u0022Aug 31\u0022\u003EAugust 31, 2023\u003C/time\u003E by Meecrob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2023-08-31T17:22:01Z","Content":"\n\u003Cp\u003E\nTalk about loaded questions. My biggest gripe with the talk about performance is that 90% of all the \u0022gains\u0022 comes from removing elements from screen. Take a look at how low graphics looked in 0.1.0 vs 0.1.4 and it\u0027s pretty damning that there\u0027s been minimal performance gains, only fidelity losses.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-31T17:23:33Z\u0022 title=\u002208/31/2023 05:23  PM\u0022 data-short=\u0022Aug 31\u0022\u003EAugust 31, 2023\u003C/time\u003E by PDCWolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superpluto126","CreatedById":206953,"CreatedDateTime":"2023-08-31T17:36:40Z","Content":"\n\u003Cp\u003E\nI\u0027m having fun driving around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E in small rovers and i\u0027m even getting good FPS! Around 20 at min and 40 at most!\n\u003C/p\u003E\n"},{"CreatedByName":"Vl3d","CreatedById":219348,"CreatedDateTime":"2023-08-31T17:51:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224317953\u0022 data-ipsquote-contentid=\u0022219135\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221693503400\u0022 data-ipsquote-userid=\u0022206953\u0022 data-ipsquote-username=\u0022Superpluto126\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, Superpluto126 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m having fun driving around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E in small rovers and i\u0027m even getting good FPS! Around 20 at min and 40 at most!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, performance has really improved.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2023-08-31T17:58:00Z","Content":"\n\u003Cp\u003E\nNot in a rush to find out.\n\u003C/p\u003E\n"},{"CreatedByName":"Mutex","CreatedById":106937,"CreatedDateTime":"2023-08-31T18:00:25Z","Content":"\n\u003Cp\u003E\nThe biggest bugs still affecting me badly (although I think I\u0027ve found workarounds) are when separating and then docking two parts of a craft together again. The \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E calculator often doesn\u0027t recognise active engines or fuel tanks, meaning your \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E is calculated as zero (even though your engine still works). You have to \u0022re-stage\u0022 the engine to get it recognised again, moving it to a stage and then staging. Until you do this, because your \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E is officially zero, you can\u0027t make manoeuvre nodes!\n\u003C/p\u003E\n\u003Cp\u003E\nPlus the unstable orbits bug, until that\u0027s fixed I can\u0027t really call the game \u0022playable\u0022. You really need to be able to do a fairly straight-forward Apollo-style mission to the Mun without having to work-around any bad bugs at least before it can be called \u0022playable\u0022 IMO.\n\u003C/p\u003E\n\u003Cp\u003E\nIn terms of fun... Currently the feature set is an early version of KSP1 that only had Sandbox mode (and no re-entry heating). I enjoyed KSP1 when it was in that state, so I\u0027d say this game is fun too.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-31T18:01:11Z\u0022 title=\u002208/31/2023 06:01  PM\u0022 data-short=\u0022Aug 31\u0022\u003EAugust 31, 2023\u003C/time\u003E by Mutex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2023-08-31T18:11:48Z","Content":"\n\u003Cp\u003E\nAs long the Spiffing Brit doesn\u0060t show up here... i don\u0060t care \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEdit 5:I voted 2xyes because it is fun and playable. I greatly enjoy to smart out the known bugs and loitering around Kerbin and mun, i haven\u0060t get farther until now. It is damn good in my opinion.\n\u003C/p\u003E\n\u003Cp\u003E\n(I am not a fanboy, i just have issues typing stuff in a foreign language)\n\u003C/p\u003E\n\u003Cp\u003E\nEdit 6: playable, sorry\u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-31T18:54:35Z\u0022 title=\u002208/31/2023 06:54  PM\u0022 data-short=\u0022Aug 31\u0022\u003EAugust 31, 2023\u003C/time\u003E by Mikki\u003C/strong\u003E\n\u003Cbr\u003Eyou guess it typo, an another one ha, damn typo in the edit, i really have issues with the keyboard sometimes\n\u003C/span\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2023-08-31T18:24:54Z","Content":"\n\u003Cp\u003E\nYes, KSP2 is playable. No, it isn\u0027t fun to play. Once KSP2 surpasses KSP1 in features or someone makes an autopilot mod, I won\u0027t find KSP2 fun. \n\u003C/p\u003E\n"},{"CreatedByName":"mcdjfp","CreatedById":142713,"CreatedDateTime":"2023-08-31T18:59:53Z","Content":"\n\u003Cp\u003E\nKSP 2 would be a perfectly acceptable early access game, but that is not what it was advertised to be. In particular I am referring to the Beta Capture images. KSP 2 is nowhere near that state, and that misrepresentation is the problem. Plus, the bugs (and other issues such as the \u0022vessel destroyed\u0022 pop-up) get in the way of the fun\n\u003C/p\u003E\n"},{"CreatedByName":"Meecrob","CreatedById":104543,"CreatedDateTime":"2023-08-31T19:00:04Z","Content":"\n\u003Cp\u003E\nIs there anything to say about this game that is positive? Lets be 100% real here. This piece of software, for $50 USD, with what it offers, deserves praise?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: The soundtrack is pretty good. Thats about it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-31T19:03:06Z\u0022 title=\u002208/31/2023 07:03  PM\u0022 data-short=\u0022Aug 31\u0022\u003EAugust 31, 2023\u003C/time\u003E by Meecrob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-08-31T19:05:53Z","Content":"\n\u003Cp\u003E\nThis is some choice bait good sir \u003Cimg alt=\u0022:joy:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/joy.png\u0022 title=\u0022:joy:\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI’m happy the game has improved! I’ll be hopping back on the train when Science drops, in the meantime, good launching and hot jets!\n\u003C/p\u003E\n"},{"CreatedByName":"Meecrob","CreatedById":104543,"CreatedDateTime":"2023-08-31T19:24:28Z","Content":"\n\u003Cp\u003E\nOk, fair enough, fair enough...I\u0027m just raining on your parade...Sorry, I should have realized.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m glad that you are all happy about this patch.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAgain..sorry, I didn\u0027t realize how cringe I was being.\n\u003C/p\u003E\n"},{"CreatedByName":"WatchClarkBand","CreatedById":227522,"CreatedDateTime":"2023-08-31T19:29:32Z","Content":"\n\u003Cp\u003E\nAgree, it\u0027s in a solid state now. Nice work team!\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2023-08-31T21:23:44Z","Content":"\n\u003Cp\u003E\nPeople are entitled to their opinion.    You do not get to tell them they are wrong for having that opinion of the game.    Please do not harass other members for having an opinion you do not agree with.  \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nA number of posts have been removed. \n\u003C/p\u003E\n"},{"CreatedByName":"aLTOR","CreatedById":230446,"CreatedDateTime":"2023-08-31T22:40:53Z","Content":"\n\u003Cp\u003E\nI think as far as early access games goes it\u0027s not very good. DayZ was worse but this is a close 2nd. I also don\u0027t think it\u0027s good to demonise people who have a different opinion than you. I think this is a bad thing which brings us all down\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-31T22:43:18Z\u0022 title=\u002208/31/2023 10:43  PM\u0022 data-short=\u0022Aug 31\u0022\u003EAugust 31, 2023\u003C/time\u003E by aLTOR\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Meecrob","CreatedById":104543,"CreatedDateTime":"2023-08-31T22:54:42Z","Content":"\n\u003Cp\u003E\nNot all of us hold KSP2 as the second coming of jesus...where are the sunglasses and joint descending...deal with it...KSP2 sucks in its current state as of posting.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2023-08-31T23:07:42Z","Content":"\n\u003Cp\u003E\nMore comments removed. If you disagree with moderation please either send us a PM or contact the community manager. Disputing within threads only serves to derail them. \n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2023-09-01T00:04:22Z","Content":"\n\u003Cp\u003E\nFor the last time, do not reply to posts you believe are a problem. It only clutters threads and leads to arguments. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if you DO report a post,\u003Cu\u003E tell us what you believe to be the problem\u003C/u\u003E. We\u0027re not mind readers.  \n\u003C/p\u003E\n\u003Cp\u003E\nMore comments removed. \n\u003C/p\u003E\n"},{"CreatedByName":"chefsbrian","CreatedById":41508,"CreatedDateTime":"2023-09-01T00:13:55Z","Content":"\n\u003Cp\u003E\nI was torn on what to say about playable. On one hand, the game doesn\u0027t crash every time I launch a rocket, and most of the rocket generally goes where I want it to, for a while at least. On the other hand, many of the basic mechanics like orbits, docking, etc don\u0027t work and are intended to work, especially for the current gameplay mechanics. I ultimately leaned no, as the buggy behavior bricks most of my missions, preventing me from playing the content. If those bugs were not present, I\u0027d easily say yes.\n\u003C/p\u003E\n\u003Cp\u003E\nOn fun, I also said no - Again, due to the bugs, there\u0027s nothing fun about having a mission be bricked. IF those bugs were not present, I would be on \u0022no, but its on the right track\u0022 - If the sandbox was working right, I\u0027d have simply run out of fun things to do by now, but during the moments it does work, it works right and enjoyably so - I\u0027d just have grown bored of doing the same mission profiles with the same parts.\n\u003C/p\u003E\n\u003Cp\u003E\nThey\u0027re only a few bugs away reaching the point where the idea of good is over the horizon though, as opposed to mired away. Not easy bugs, it seems, but no less close to that. The fact I can enumerate the problems clearly rather than a vague sense of distaste and displeasure over some lack of \u0022Game Feel\u0022 is good in its own regards.\n\u003C/p\u003E\n"},{"CreatedByName":"didkodidko","CreatedById":226055,"CreatedDateTime":"2023-09-01T00:24:47Z","Content":"\n\u003Cp\u003E\nDid quick Apollo style mission just to check 0.1.4, mun orbit, separation - orbit decay - alt \u002B f4\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2023-09-01T01:01:15Z","Content":"\n\u003Cp\u003E\nIn todays reviews and livestreams of Starfield you see a kind of tale-of-two-games--one of which was dramatically controversially delayed and the other which was forced into a pre-mature EA. No one thinks Starfield is perfect, but even with the headwinds BGS is facing from FA76 the general impression Im getting from Starfield is its remarkably stable and solidly playable despite some pacing and structural deficiencies. I know the folks from Intercept have played the happy warrior through this but whoever made the decision to force the 3.2023 launch rather than delaying a year and giving players a solid gameplay experience plus science and heat is a goddamned fool. I deeply hope that all of the people who poured their souls into all of the genuinely brilliant ideas in KSP2 are being given an extra long runway to correct for the obvious disservice management handed to them. There are a number of core bugs that are still substantially preventing even the kind of multi-mission, long-span gameplay KSP1 offers that in no way required the broader community to notice and address. We\u0027ve always loved this game and have always been happy to address edge cases and balance issues and structural questions about the games future. Thats what we\u0027re here for and thats what we\u0027ve always done. Its been cruel to to make even hardcore, devoted players and content creators slog through this though and Take Two for its own shortsightedness really does need to devote real resources to fixing the game and making sure that by the time Science and colonies are introduced the core devs have been given time to make the game truly stable. \u003Cbr\u003E\n\u003Cbr\u003E\nMy heart goes out to Nate, Shana, Tom, Chris, former Squad members and countless artists and programmers and incredibly passionate people who have put everything they have into this game. Even with the bugs its an amazing achievement. I dearly hope you\u0027ve all been given all of the time and space you need to make KSP2 what you\u0027ve been dreaming it could be. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-09-01T01:12:25Z\u0022 title=\u002209/01/2023 01:12  AM\u0022 data-short=\u0022Sep 1\u0022\u003ESeptember 1, 2023\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2023-09-01T01:30:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224318127\u0022 data-ipsquote-contentid=\u0022219135\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221693530075\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhoever made the decision to force the 3.2023 launch rather than \u003Cstrong\u003Edelaying a year\u003C/strong\u003E and giving players a solid gameplay experience plus science and heat is a goddamned fool.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n(Emphasis mine) I\u0027ll do the usual: this should say \u0022delaying a fourth year\u0022.\n\u003C/p\u003E\n"}]}