{"TopicId":222169,"ForumId":119,"TopicTitle":"Am I doing saving wrong?","CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2023-12-27T14:17:02Z","PageNum":1,"Articles":[{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2023-12-27T14:17:02Z","Content":"\n\u003Cp\u003E\nHello, checking in to make sure I\u0027m not missing something obvious.\n\u003C/p\u003E\n\u003Cp\u003E\nWorkspaces can be useful for assembling multiple ships in a series or multiple ships intended to be used together (although the vessel naming system needs a serious overhaul to allow it to work at its full potential), but for standalone ships, which is, at least for early game, most of the ships you will be using, you will want one workspace per ship.\n\u003C/p\u003E\n\u003Cp\u003E\nIn KSP 1, I build my ship, title it, and save it. If I change something after it, I\u0027ll press save at least once, maybe a few times because I\u0027m paranoid like that.\n\u003C/p\u003E\n\u003Cp\u003E\nIn KSP 2 I open up a new workspace. I build my ship, give it a name in the top right hand corner. Then I press save. I get a menu. I have to then give the workspace a name, and press save a second time.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I make a change to the craft, I have to press the save icon, then press the save button, and then press \u0022Yes I want to overwrite the design I\u0027m currently editing\u0022 button.\n\u003C/p\u003E\n\u003Cp\u003E\nAll these extra clicks are adding small amounts of frustration each time I have to click several times to do what took one click in KSP 1, am I missing something about how to use workspaces or is this a case of poor design?\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2023-12-27T15:00:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224352634\u0022 data-ipsquote-contentid=\u0022222169\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703686622\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nam I missing something about how to use workspaces or is this a case of poor design?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe latter.\n\u003C/p\u003E\n"},{"CreatedByName":"VlonaldKerman","CreatedById":225683,"CreatedDateTime":"2023-12-27T19:08:39Z","Content":"\n\u003Cp\u003E\nIs rickrolling against tos?\n\u003C/p\u003E\n"}]}