{"TopicId":222273,"ForumId":119,"TopicTitle":"The way that maneuver nodes seemingly work is quite silly","CreatedByName":"OPERATOR571","CreatedById":212340,"CreatedDateTime":"2023-12-29T05:07:25Z","PageNum":1,"Articles":[{"CreatedByName":"OPERATOR571","CreatedById":212340,"CreatedDateTime":"2023-12-29T05:07:25Z","Content":"\n\u003Cp\u003E\nSo I\u0027ve just started playing KSP2 since For Science! came out, and one of my biggest annoyances so far has been the maneuver nodes.  Many times so far I have had to reload a quicksave because I, despite following the timer on the node as best as possible, have way overshot it, sometimes to the order of hundreds of meters per second.  Initially it confused me as to why this was happening, for in KSP1 I am a very accurate burn-starter and stopper, but after some examination I think I know why: when you plan a maneuver, the game calculates the burn time based on the current max acceleration of your craft; using the max acceleration and the deltaV, it does some simple dimensional analysis to find out what that time should be (ex. 10.0 m/s\u003Csup\u003E2\u003C/sup\u003E max, 800.0 m/s deltaV, burn for 80 seconds).  Now, this system is quite simple and effective if your mass doesn\u0027t change, say for small burns where it for all intents and purposes the mass is a constant, but once you start burning a significant percentage of the fuel of a craft, it can start to cause problems.  Acceleration is force divided by mass, so if your mass is cut in half then you will accelerate twice as quickly, but (from what I can tell) the game doesn\u0027t take this into account.  Therefore, because the burn time is seemingly only calculated when you make a maneuver node, you get situations where you end up burning far above the deltaV of your maneuver if you trust and follow the tools provided by the game.\u003Cbr\u003E\n\u003Cbr\u003E\nSo, how should the devs fix this?  Well, they could implement some complex dynamic calculation where it takes in to account how much mass you\u0027ll lose over the course of a burn and accounts for it in the burn time, but this would still be susceptible to errors if you, say, throttle down near the end of a burn to be more precise.  Or, they could have the game recalculate the burn time across the course of a burn, constantly recalculating it based on the changes in your acceleration (which I believe is done in KSP1, though that may be a mod that I use).  OR, and this is by far the most radical suggestion, they could just reimplement the deltaV based system used in KSP1.  That way, you could actually tell how close you are to the desired orbit, regardless of however fast you accelerate.  Like, if for some reason you want to use \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, or not use full throttle, or you want to do anything that is not exactly in the vanilla, proscribed method of doing things.  Isn\u0027t this game supposed to be about being creative? about not following the rules?  This is by far the biggest design issue (in my opinion) of the game so far: a single-minded, rigid approach which the devs think is the best is the only way of doing so many things, from the topic of this post, to not being able to even plan a maneuver past your max deltaV (also susceptible to calculation errors), to the timewarp limitations, is hard built into the mechanisms of the game.  Hopefully, though, these artificial restrictions that stifle the spirit of KSP are seen as what they are -- restrictions to creativity and fun -- and are removed so that this game can reach to and beyond the heights of KSP1.\u003Cbr\u003E\n\u003Cbr\u003E\n(I\u0027m sorry if this seemed negative, I really do like so much of the game and have been really impressed playing it so far.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-12-29T05:33:05Z\u0022 title=\u002212/29/2023 05:33  AM\u0022 data-short=\u0022Dec 29\u0022\u003EDecember 29, 2023\u003C/time\u003E by OPERATOR571\u003C/strong\u003E\n\u003Cbr\u003EI thought that ctrl\u002BEnter was how you made a new line, not shift\u002BEnter.\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2023-12-29T05:29:35Z","Content":"\n\u003Cp\u003E\nI haven\u0027t noticed that, even on long burns like one-shot interplanetary burns that use most of the stage\u0027s fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I do notice is that they don\u0027t recognize engine changes, like if you plan it with a nearly empty stage, and then stage it away the maneuver node assumes the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of the prior stage until you start to burn.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also noticed very occasionally when a burn is a small fraction of a second, the game tells me some large number like 45 seconds.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, sometimes the line is yellow, sometimes its red, and sometimes it\u0027s nonexistent and I have no idea what causes which to occur.\n\u003C/p\u003E\n"},{"CreatedByName":"OPERATOR571","CreatedById":212340,"CreatedDateTime":"2023-12-29T05:37:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224353413\u0022 data-ipsquote-contentid=\u0022222273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703827775\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI haven\u0027t noticed that, even on long burns like one-shot interplanetary burns that use most of the stage\u0027s fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I do notice is that they don\u0027t recognize engine changes, like if you plan it with a nearly empty stage, and then stage it away the maneuver node assumes the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E of the prior stage until you start to burn.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also noticed very occasionally when a burn is a small fraction of a second, the game tells me some large number like 45 seconds.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, sometimes the line is yellow, sometimes its red, and sometimes it\u0027s nonexistent and I have no idea what causes which to occur.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReally?  I\u0027ve had it overestimate the burn time by like half a minute before.\u003Cbr\u003E\nAlso, I completely concur with the line not making much sense.  I\u0027ve had it go down, go up, go down then up, literally just ping-pong across both while I have been accelerating and not accelerating, and I\u0027m pretty sure I\u0027ve seen it be more colors than this game turns my mouse.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-12-29T07:46:01Z","Content":"\n\u003Cp\u003E\nDon\u0027t watch the line or the timer, watch the trajectory in map view. If you point the rocket in maneuver direction node, and don\u0027t mess with thrust, you\u0027ll end up nearly exactly where the planned path was.\n\u003C/p\u003E\n"},{"CreatedByName":"Vl3d","CreatedById":219348,"CreatedDateTime":"2023-12-29T13:14:36Z","Content":"\n\u003Cp\u003E\nAlso please consider that the burn starts exactly where the maneuver node is placed. So if you want to burn half-half of PE for efficiency of if you want a circular orbit \u003Cstrong\u003Eyou have to move the maneuver node back\u003C/strong\u003E so the PE splits the red line in half. It\u0027s different from KSP1, in which this was done automatically.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2023-12-29T13:52:04Z","Content":"\n\u003Cp\u003E\nAziz\u0027s suggestion is what seems to work - although it does equate to \u0027don\u0027t trust the timer\u0027 \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a good planning tool, but like SuperfluousJ writes it\u0027s a bit confusing in action. \n\u003C/p\u003E\n\u003Cp\u003E\nOfc I did what Aziz suggested in KSP, too.  Start the burn looking at the ship and timer because that\u0027s cool, then switch to map view and eyeball when to stop via the orbit lines.  Allows you to fairly quickly adjust Intercepts and the like if you fudge timing \n\u003C/p\u003E\n"},{"CreatedByName":"hatterson","CreatedById":107383,"CreatedDateTime":"2023-12-29T14:42:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224353413\u0022 data-ipsquote-contentid=\u0022222273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703827775\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI haven\u0027t noticed that, even on long burns like one-shot interplanetary burns that use most of the stage\u0027s fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWhat I do notice is that they don\u0027t recognize engine changes, like if you plan it with a nearly empty stage, and then stage it away the maneuver node assumes the \u003C/strong\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cstrong\u003ETWR\u003C/strong\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003Cstrong\u003E of the prior stage until you start to burn.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also noticed very occasionally when a burn is a small fraction of a second, the game tells me some large number like 45 seconds.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, sometimes the line is yellow, sometimes its red, and sometimes it\u0027s nonexistent and I have no idea what causes which to occur.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis also applies to you changing the maximum thrust of an engine. For example if you\u0027re doing a gilly landing or something where you want your max thrust to be very low so you actually have some throttle control, then you plan a maneuver, it\u0027ll assume you\u0027re thrusting at whatever your current max it. If you then update the max thrust, it won\u0027t modify the burn calculation until you do something with the node or start burning.\n\u003C/p\u003E\n\u003Cp\u003E\nThe current maneuver planner is actually incredible and a huge improvement on KSP 1 when it works as intended. It takes into account staging events and everything. The only minor issue is that with staging events it assumes they happen exactly on time and the thrust from the next stage is immediately available. Usually the player is gonna be a second or two off on that and if you\u0027re using an engine like the tuba, that takes a second or two to extend which delays the thrust. That makes a very minor difference in projected outcome in a single planetary system, it\u0027s a bit higher at interplanetary, and at interstellar there likely needs to be some solve for it unless the solve is \u0022*shrug* do a mid course adjustment for a couple m/s \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI have noticed some minor bugs where it doesn\u0027t seem to start the progress bar going down when I start burning, but if I follow the timer it still works.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s as example showing the staging system working. I loaded up a sandbox with a stupid rocket. Command pod, fuel tank, mainsail engine, stack sep, small fuel tank, trumpet engine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223NPvxKa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002268.11\u0022 height=\u0022440\u0022 width=\u0022646\u0022 src=\u0022https://i.imgur.com/3NPvxKa.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI teleported it into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and created a node that was 100% normal burn and this is what it showed:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022P5dAizW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002240.24\u0022 height=\u0022202\u0022 width=\u0022502\u0022 src=\u0022https://i.imgur.com/P5dAizW.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLong shallow turn as the trumpet does it\u0027s low \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E thing, the staging event (first plus) then a sharper turn as the mainsail kicks on, then the end of the burn/fuel (second plus).\n\u003C/p\u003E\n\u003Cp\u003E\nI then reverted and flipped the stages (keeping the fuel tanks with the engines so they each has the same burn time as before) and created the same node. Here\u0027s the difference:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229CPu9kz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002263.29\u0022 height=\u0022331\u0022 width=\u0022523\u0022 src=\u0022https://i.imgur.com/9CPu9kz.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSharp quick turn as the mainsail pushes hard then a low slow continuation as the more efficient/less thrust trumpet kicks in after staging.\n\u003C/p\u003E\n\u003Cp\u003E\nI flew both maneuvers and my final trajectory was very close to the projected, the difference only due to, as mentioned above, inefficiency in stage transitions.\n\u003C/p\u003E\n"},{"CreatedByName":"Sea_Kerman","CreatedById":226149,"CreatedDateTime":"2023-12-29T19:18:07Z","Content":"\n\u003Cp\u003E\nYeah, the actual calculation of the path is really nice but they left out the one important thing. Time matters little, what actually matters is \u003Cem\u003Eremaining delta-v. \u003C/em\u003EThey should really count down the delta-v readout as required. If I use the maneuver node controller or micro engineer mod to display remaining delta-v and go off of that, my burns are quite precise.\n\u003C/p\u003E\n"},{"CreatedByName":"OPERATOR571","CreatedById":212340,"CreatedDateTime":"2023-12-29T21:53:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224353435\u0022 data-ipsquote-contentid=\u0022222273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703835961\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDon\u0027t watch the line or the timer, watch the trajectory in map view. If you point the rocket in maneuver direction node, and don\u0027t mess with thrust, you\u0027ll end up nearly exactly where the planned path was.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s what I have been doing, but I just find it frustrating that they gave up what was such an effective way of doing it in KSP1.\n\u003C/p\u003E\n"},{"CreatedByName":"OPERATOR571","CreatedById":212340,"CreatedDateTime":"2023-12-29T21:57:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224353482\u0022 data-ipsquote-contentid=\u0022222273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703855676\u0022 data-ipsquote-userid=\u0022219348\u0022 data-ipsquote-username=\u0022Vl3d\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Vl3d said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso please consider that the burn starts exactly where the maneuver node is placed. So if you want to burn half-half of PE for efficiency of if you want a circular orbit \u003Cstrong\u003Eyou have to move the maneuver node back\u003C/strong\u003E so the PE splits the red line in half. It\u0027s different from KSP1, in which this was done automatically.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve also been doing this (and also burning slightly radial-in), but the projected trajectory should be accurate regardless of whether I make it as efficient as possible or not (which it has not been for me).\n\u003C/p\u003E\n"},{"CreatedByName":"hatterson","CreatedById":107383,"CreatedDateTime":"2023-12-29T22:18:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224353697\u0022 data-ipsquote-contentid=\u0022222273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703887029\u0022 data-ipsquote-userid=\u0022212340\u0022 data-ipsquote-username=\u0022OPERATOR571\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, OPERATOR571 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve also been doing this (and also burning slightly radial-in), but the projected trajectory should be accurate regardless of whether I make it as efficient as possible or not (which it has not been for me).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAre you able to capture a video of this happening? Or a bunch of screenshots? I\u0027ve done a ton of different burns and they complete on time and on target basically all the time.\n\u003C/p\u003E\n"},{"CreatedByName":"Wheehaw Kerman","CreatedById":223516,"CreatedDateTime":"2023-12-30T10:21:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224353602\u0022 data-ipsquote-contentid=\u0022222273\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221703877487\u0022 data-ipsquote-userid=\u0022226149\u0022 data-ipsquote-username=\u0022Sea_Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Sea_Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah, the actual calculation of the path is really nice but they left out the one important thing. Time matters little, what actually matters is \u003Cem\u003Eremaining delta-v. \u003C/em\u003EThey should really count down the delta-v readout as required. If I use the maneuver node controller or micro engineer mod to display remaining delta-v and go off of that, my burns are quite precise.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can manage this in some cases by subtracting the planned delta v from the delta v remaining shown in the staging stack in lower right, and stopping the burn when the delta v remaining hits the resulting number.\n\u003C/p\u003E\n"}]}