{"TopicId":223560,"ForumId":119,"TopicTitle":"The Nature of Awesome \u0026amp; Unusable Builds","CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-02-07T16:28:28Z","PageNum":1,"Articles":[{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-02-07T16:28:28Z","Content":"\n\u003Cp\u003E\nEverytime I build a rocket or space station I have to stop myself at some point. As the basic needs of the craft begin approach that minimum level acceptance criteria I start to say things like\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh, I bet that would look super cool\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nor\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022A radial array of that Truss Fuel sun assembly would look amazing right here\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat begins to happen is truly transformative. \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E quickly approaches an unusable number on the first stage or two.\n\u003C/p\u003E\n\u003Cp\u003E\nI revamp the various thruster options available to me. Become disappointed with relative burn time. Slap MOAR FUEEEL. Repeat iterations of the last paragraph..\n\u003C/p\u003E\n\u003Cp\u003E\nFly.. Explode... Modify.. Fly.. Repeat until I have a really bad ass craft that will be used on multiple missions to come.\n\u003C/p\u003E\n\u003Cp\u003E\nI fly that bad boy to Duna or Somewhere that I have recently been. (Because I wanna showcase this bad boy on something I know I can do)\n\u003C/p\u003E\n\u003Cp\u003E\nSnap some screen shots and upload to KSPBuilds.com as Dunasaurus One.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHmmm. All those people searching for a paste \u0026amp; play craft will be sad. \n\u003C/p\u003E\n\u003Cp\u003E\nEven if no specific mission is associated with the craft, I feel the above mentioned idiosyncratic behavior is shared by many. The inner dialogue may vary slightly. However, most I speak to seem to suffer from some form of conflict with the \u0022nature of awesome\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nI see a great number of uploads with a Mission that has been available and completed for some time. I have all of tier 2 unlocked and am selectively working through 3 but cannot paste a craft title for a mission oh so long ago.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt just sucks. I don\u0027t know if others playing exploration feel disheartened by this? Seems most of the craft shared is from sandbox or a much later tech unlock.\n\u003C/p\u003E\n\u003Cp\u003E\nI am getting better at craft design, but wish there were more options for low tech design.\n\u003C/p\u003E\n\u003Cp\u003E\nI know eventually there will be a plethora of thousands and thousands of craft and it will be easier.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*Violin Fades to Silence*\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Icegrx","CreatedById":232176,"CreatedDateTime":"2024-02-07T17:19:44Z","Content":"\n\u003Cp\u003E\n99% of the fun in this game for me is designing my own craft and then perfecting them as you mentioned. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere’s no “right way” to play this game, true.. however copy pasting a build to use for a mission is like robbing yourself of 99% fun. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso as you mentioned, most copy paste builds are from sandbox, and make no attempts to use tiered parts. \n\u003C/p\u003E\n"},{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-02-09T02:14:29Z","Content":"\n\u003Cp\u003E\nI enjoyed making the ships in the beginning. It becomes tedious to me. Most people i ask seem to use the same ship for every mission... until circumstances (mission parameters) force them to build something else.\u003Cbr\u003E\n\u003Cbr\u003E\nI find 99% of the games fun to be found outside the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and wish there was a more prolific source of work. Given enough time It will eventually get there.. but you can see on the spacecraft exchange page. The frequnency of posts is tapering off.\u003Cbr\u003E\n\u003Cbr\u003E\nOne thing i loved about KerbalX was that you could see what parts were on the craft. I wonder if i can ask the person behind KSP builds to write plugin extension to read the Craft Paste and provide a tab that lists the parts on each\n\u003C/p\u003E\n"},{"CreatedByName":"Heretic391","CreatedById":66101,"CreatedDateTime":"2024-02-12T13:44:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224365282\u0022 data-ipsquote-contentid=\u0022223560\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221707444869\u0022 data-ipsquote-userid=\u0022227275\u0022 data-ipsquote-username=\u0022Fizzlebop Smith\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/9/2024 at 1:14 PM, Fizzlebop Smith said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne thing i loved about KerbalX was that you could see what parts were on the craft. I wonder if i can ask the person behind KSP builds to write plugin extension to read the Craft Paste and provide a tab that lists the parts on each\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGreat point, i guess for now we need to share screenshots of what we\u0027ve unlocked\n\u003C/p\u003E\n"},{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-02-12T17:04:43Z","Content":"\n\u003Cp\u003E\nThat\u0027s not a bad idea. I wish there were something on the site that added this function.\n\u003C/p\u003E\n\u003Cp\u003E\nA list of stock parts with a check would be awesome. Or maybe a sample tech tree you can click what you unlocked? \n\u003C/p\u003E\n\u003Cp\u003E\nSucks though because of multi tabs bot necessarily being fully unlocked. Later rockets would be 3 or 4 shots of just the tree. Lol.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll try and bring it up to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/169308-nyius/?do=hovercard\u0022 data-mentionid=\u0022169308\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/169308-nyius/\u0022 rel=\u0022\u0022\u003E@nyius\u003C/a\u003Eand see if there are any cool solutions the codeslingers might be able to cobjureconjure from the aether.\n\u003C/p\u003E\n"},{"CreatedByName":"Urus28","CreatedById":182121,"CreatedDateTime":"2024-02-14T20:49:03Z","Content":"\n\u003Cp\u003E\nI tend to design a new craft for each new mission, in general there is enough change to make it different. The launcher to put stuff in orbit is the part I tend to copy/paste.\n\u003C/p\u003E\n"},{"CreatedByName":"leos101","CreatedById":233444,"CreatedDateTime":"2024-04-29T08:22:03Z","Content":"\n\u003Cp\u003E\n\u003Cstrong style=\u0022background-color:#f9f9f9;color:#000000;font-size:18px;text-align:center;\u0022\u003E\u003Ca data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/227275-fizzlebop-smith/?do=hovercard\u0026amp;referrer=https%253A%252F%252Fforum.kerbalspaceprogram.com%252Ftopic%252F223560-the-nature-of-awesome-unusable-builds%252F\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/227275-fizzlebop-smith/\u0022 rel=\u0022\u0022 style=\u0022background-color:transparent;color:inherit;\u0022 title=\u0022Go to Fizzlebop Smith\u0027s profile\u0022\u003EFizzlebop Smith\u003C/a\u003E\u003C/strong\u003E\u003Cstrong style=\u0022background-color:#f9f9f9;color:#000000;font-size:18px;text-align:center;\u0022\u003E, \u003C/strong\u003EI can totally relate to the struggle you describe. As an avid KSP player, I often find myself getting carried away with the pursuit of awesomeness, only to end up with a behemoth of a craft that can barely lift off. It\u0027s a delicate balance between functionality and aesthetics, and it\u0027s easy to lose sight of that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI understand the disappointment of not being able to share your creations with the community because they\u0027re tied to missions you\u0027ve already completed. It\u0027s a shame that there aren\u0027t more options for low-tech designs, as those can be just as challenging and rewarding to build.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nHowever, I try to look at it as an opportunity to flex my creativity and problem-solving skills. Crafting something truly impressive within the constraints of early-game technology is a unique challenge that can lead to some ingenious designs.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nWhile we wait for the craft library to grow, why not embrace the spirit of exploration and push the boundaries of what\u0027s possible with the limited resources at hand? Who knows, you might just come up with the next iconic low-tech design that inspires others to think outside the box.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-04-29T08:30:54Z\u0022 title=\u002204/29/2024 08:30  AM\u0022 data-short=\u0022Apr 29\u0022\u003EApril 29\u003C/time\u003E by leos101\u003C/strong\u003E\n\u003C/span\u003E\n"}]}