{"TopicId":225585,"ForumId":119,"TopicTitle":"How do you think KSP2\u0027s story would have ended?","CreatedByName":"RileyHef","CreatedById":228846,"CreatedDateTime":"2024-07-28T15:42:19Z","PageNum":1,"Articles":[{"CreatedByName":"RileyHef","CreatedById":228846,"CreatedDateTime":"2024-07-28T15:42:19Z","Content":"\n\u003Cp\u003E\nBoth KSP and KSP2 had narratives that were never resolved or fully fleshed out. KSP2 seemed to be especially story driven based on its mission system and various anomalies. It seems like the story was inevitably leading to the discovery of another civilization located in one of the new systems. But, would anything have come from it gameplay wise? Would we discover another species of kraken/kerbal hybrids and would they be playable? Would we find established launch sites/colonies on these new systems that could be utilized? I even heard speculation that the Mun arch would become some sort of portal to another system. Or maybe KSP2 never intended for the story to be more than a narrative tool to make sense of the mission system and drive players to yield higher science rewards in certain areas. Either way, there was more story to unfold had the game been finished and I wonder how in depth it would have been.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, I\u0027m sure I missed or forgot additional clues about the KSP2 storyline. What speculation do you have regarding the story and it\u0027s gameplay impact had KSP2 ever reached its vision?\n\u003C/p\u003E\n"},{"CreatedByName":"para 9","CreatedById":234380,"CreatedDateTime":"2024-07-28T15:57:03Z","Content":"\n\u003Cp\u003E\nHow much gameplay impact would the story have had? My guess: practically none. I\u0027m sure they\u0027d have allocated a ton of resources to developing superfluous lore and story.  Based on the tutorials and promotional materials we saw, I\u0027m pretty confident there\u0027d be cutscenes. Gotta put the artists to use.  \n\u003C/p\u003E\n"},{"CreatedByName":"Vexillar","CreatedById":178802,"CreatedDateTime":"2024-07-29T11:17:15Z","Content":"\n\u003Cp\u003E\nAnyone\u0027s guess on this, really.\n\u003C/p\u003E\n\u003Cp\u003E\nI imagined that  some discovery (perhaps finding all of the alien artifacts) would trigger something in the tech tree that wold enable finding the new star system in the map, and along with the other interstellar tech (we\u0027d already have colonies by that point) would enable sending the first craft to the new star, which would in turn enable navigation within that system.\n\u003C/p\u003E\n\u003Cp\u003E\nThere we\u0027d find more artifacts and the search would continue. Given the Kraken-ness of the artifacts we have, it may be based on a story arc of how the kerbals\u0027 progenitors slew the Kraken and learned to fly between the stars - the final stage of the progression would be to find the \u0022Old Kerbin\u0022, perhaps  populated by Kerbal-like creatures who welcome us home...\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe, just maybe one day the ex-devs will be able to open up - but I expect this is top of the \u0022You don\u0027t talk abouts\u0022 on the NDAs.\n\u003C/p\u003E\n"},{"CreatedByName":"Skorj","CreatedById":201273,"CreatedDateTime":"2024-07-30T02:36:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224411134\u0022 data-ipsquote-contentid=\u0022225585\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221722251835\u0022 data-ipsquote-userid=\u0022178802\u0022 data-ipsquote-username=\u0022Vexillar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Vexillar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere we\u0027d find more artifacts and the search would continue. Given the Kraken-ness of the artifacts we have, it may be based on a story arc of how the kerbals\u0027 progenitors slew the Kraken and learned to fly between the stars - the final stage of the progression would be to find the \u0022Old Kerbin\u0022, perhaps  populated by Kerbal-like creatures who welcome us home...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI like that story.  It\u0027s now my head canon. \n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2024-07-30T03:50:46Z","Content":"\n\u003Cp\u003E\nI assumed it would be an ignorable carrot to drive exploration of some of the game\u0027s interesting locations, and nothing more.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would \u0022end\u0022 when you saw something neat in several places in each of the new systems. There\u0027d be no actual end, though, just no more contracts/Easter eggs.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-30T03:51:38Z\u0022 title=\u002207/30/2024 03:51  AM\u0022 data-short=\u0022Jul 30\u0022\u003EJuly 30\u003C/time\u003E by Superfluous J\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2024-07-30T10:24:49Z","Content":"\n\u003Cp\u003E\nThey would have found a statue of  monkey with helmet, and start guessing what\u0027s that and why?\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow71","CreatedById":210112,"CreatedDateTime":"2024-07-31T00:47:58Z","Content":"\n\u003Cp\u003E\nConsidering the game is dead, we know how it ends.  An enigma, wrapped up in a mystery, stuffed into a riddle, and jumbled up like a Rubik\u0027s cube.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-31T15:38:58Z\u0022 title=\u002207/31/2024 03:38  PM\u0022 data-short=\u0022Jul 31\u0022\u003EJuly 31\u003C/time\u003E by Scarecrow71\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"chefsbrian","CreatedById":41508,"CreatedDateTime":"2024-07-31T14:44:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224411134\u0022 data-ipsquote-contentid=\u0022225585\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221722251835\u0022 data-ipsquote-userid=\u0022178802\u0022 data-ipsquote-username=\u0022Vexillar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/29/2024 at 5:17 AM, Vexillar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaybe, just maybe one day the ex-devs will be able to open up - but I expect this is top of the \u0022You don\u0027t talk abouts\u0022 on the NDAs.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSurprisingly enough, this is likely the bottom of the list and one of the first things that\u0027d be spoken of - because in all likelyhood, none of this was really planned. The story that is, not the \u003Cabbr title=\u0022Non-Disclosure Agreement\u0022\u003ENDA\u003C/abbr\u003E\u0027s. A lot of these things are left to interpretation and future assessment based on new things that were added, and what the community responds well to. Maybe ideas went around the office, but KSP is extremely far from a narrative game, and the effort involved in that narrative would have been similar. Even games with major narrative bents both have narrative go public when they die, and verifiably have their narratives massively reworked merely months before release - Half Life Episode 3 with Epistle 3 is a great example of the former, and Half Life Alyx is a great known example of the latter. Odds are the extend of the story content was some art direction notes about how to design the easter eggs you can find, to avoid one being a gold statue and the next being something looking like a crystal computing array outta stargate.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Non-Disclosure Agreement\u0022\u003ENDA\u003C/abbr\u003E\u0027s in practice (Theoretically they can say anything) generally cover material, quantifiable things - Specs, internal reviews and documentation, so forth. Trying to apply them to off the cuff discussion of the sorts that likely encompassed the story is difficult to actually enforce in reality. The likely biggest thing that\u0027d keep it from leaking isn\u0027t going to be legal documents or expectations though, but just the fact that it was probably Nate who has the closest to ideas for it, and then a few bits of easter egg banter in the office. Everyone else probably just knows \u0022We didn\u0027t have anything yet\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"Wheehaw Kerman","CreatedById":223516,"CreatedDateTime":"2024-07-31T22:55:17Z","Content":"\n\u003Cp\u003E\nI fully intended to ignore the story.  The monuments were surprisingly… non-terrible, but the fact they went all in on the ancient aliens thing was a disappointment.  “Because it’s there” is more than enough.\n\u003C/p\u003E\n"},{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-07-31T23:58:06Z","Content":"\n\u003Cp\u003E\nI was also, hoping all monuments combined would unlock the first interstellar tech node. I like the monuments... but not how they were implemented.\n\u003C/p\u003E\n\u003Cp\u003E\nI think they should have suffered the ravages of time a bit and toned down the cheese in the dialogue. I did not feel like an explorer.. but rather a throttle jockey looking for the next marker.\n\u003C/p\u003E\n\u003Cp\u003E\nThe way approached missions and these particular discovers really irked me. I wanted a slower pace with crumbled discoveries leading to more signals via comnet sweeps leading to anomalous reading that pointed to big discoverables that all touched on an overall narrative.\n\u003C/p\u003E\n\u003Cp\u003E\nI wanted science near these to propel lore and story... ugh. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-31T23:59:31Z\u0022 title=\u002207/31/2024 11:59  PM\u0022 data-short=\u0022Jul 31\u0022\u003EJuly 31\u003C/time\u003E by Fizzlebop Smith\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RileyHef","CreatedById":228846,"CreatedDateTime":"2024-08-01T05:11:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224411638\u0022 data-ipsquote-contentid=\u0022225585\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221722470286\u0022 data-ipsquote-userid=\u0022227275\u0022 data-ipsquote-username=\u0022Fizzlebop Smith\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Fizzlebop Smith said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI was also, hoping all monuments combined would unlock the first interstellar tech node. I like the monuments... but not how they were implemented.\n\u003C/p\u003E\n\u003Cp\u003E\nI think they should have suffered the ravages of time a bit and toned down the cheese in the dialogue. I did not feel like an explorer.. but rather a throttle jockey looking for the next marker.\n\u003C/p\u003E\n\u003Cp\u003E\nThe way approached missions and these particular discovers really irked me. I wanted a slower pace with crumbled discoveries leading to more signals via comnet sweeps leading to anomalous reading that pointed to big discoverables that all touched on an overall narrative.\n\u003C/p\u003E\n\u003Cp\u003E\nI wanted science near these to propel lore and story... ugh. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would have liked the slower pace too. I think I get what you are saying as it sounds like my way of playing KSP.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI prefer to play with SCANsat to map out each planet and set up a relay. I really like the gameplay loop of sending a satellite to learn the terrain and locate anomaly/resource locations, then sending manned missions to get on the ground and collect science. Some players probably see it as tedious but this method made it really rewarding when planning missions at specific locations with a purpose in mind.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, it kind of bothered me that the KSP2 mission dialogue essentially said , \u0022Hey, we did the whole exploration part for you and mapped out the exact spot where you need to go.\u0022 It totally took out the fun and control that I feel in KSP. Sure, maybe if the game was at 1.0 and I had entire other systems to visit and colonize I may feel that the expedited mission system is a good choice, but we all know how that turned out... Too bad.\n\u003C/p\u003E\n\u003Cp\u003E\nI was really excited for resource scanning parts and telescopes (which were said to be planned, but in hindsight I\u0027m very skeptical). These parts would have brought further depth and meaning to the exploration element of the game other than the main story missions. I wanted to have access to tools (science parts) that gave me the information necessary to find the optimal colony location on any planet or moon. But these features will never be seen and may have not even been planned for 1.0 the way I had hoped.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the end, the game just was too shallow and incomplete to provide a more thorough mission system. Funny that you mention CommNet when they had no plans to even implement comm lines like in KSP1 to provide visual feedback to players. The infrastructure just wasn\u0027t there to provide a robust space program experience which limited the narrative to a fetch quest structure with little variance to offer.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2024-08-02T03:59:33Z","Content":"\n\u003Cp\u003E\nThe current mission system seemed to me to be exactly what it was: The first draft roughed out plot to a story they were going to eventually tell.\n\u003C/p\u003E\n\u003Cp\u003E\nWe\u0027ll never know if that\u0027s all they planned or it was the first of 100 steps of expanding each node of the story into little sub-missions, of course, but that\u0027s my opinion on it.\n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2024-08-02T07:12:42Z","Content":"\n\u003Cp\u003E\nConsidering KSP 2 was created under Take Two Interactive, it was almost certain it was going to end in disaster.\n\u003C/p\u003E\n"}]}