{"TopicId":102963,"ForumId":70,"TopicTitle":"Cannot load ships from VAB.","CreatedByName":"Loopman","CreatedById":83391,"CreatedDateTime":"2015-03-30T12:03:53Z","PageNum":1,"Articles":[{"CreatedByName":"Loopman","CreatedById":83391,"CreatedDateTime":"2015-03-30T12:03:53Z","Content":"Hey guys and rocket enthusiasts! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI\u0027ve been experiencing a really annoying problem lately. \n\nWhenever I enter the VAB and press the little yellow folder in the right upper corner to load my ships, \n\nthe screen freezes for like 3 seconds and then nothing happens.. \n\nAfter that I can\u0027t build anything in the VAB. When I choose a part, it just freezes in the floor..\n\nHowever I can load all ships from SPH. Both from SPH and VAB. \n\nI was thinking that it could have something to do with the save, because it\u0027s a save from before the beta update. \n\nCould this have a saying in the problem?\n\nAny idea what this could be caused by and how to solve it?\n\n**Mods I use:**\n\nAstronomers Visual Pack\n\nChatterer\n\nProtractor \n\nKerbal Engineer \n\nThanks \n\nLoopman"},{"CreatedByName":"GiantTank","CreatedById":113180,"CreatedDateTime":"2015-04-05T16:20:15Z","Content":"Happened to me too: [http://forum.kerbalspaceprogram.com/threads/111085-Cannot-Load-Ships-into-VAB-Craft-file-is-normal](https://forum.kerbalspaceprogram.com/threads/111085-Cannot-Load-Ships-into-VAB-Craft-file-is-normal)\n\nThe only thing I could do was reinstall this game. Squad needs to get off their gimbal and fix this glitch. Also, if you have 2\u002B installs of ksp, it spreads to those too. And people complain about crashing with 500 mods."},{"CreatedByName":"dewin","CreatedById":96372,"CreatedDateTime":"2015-04-06T05:24:53Z","Content":"TL;DR: You might have a corrupt .craft file.\n\nI just ran into a similar issue, presumably caused by somehow having a corrupt .craft file.\n\nIn my particular case, this was the sequence of events:\n\n1. I named a ship, put the first part on, and saved it. (Not entirely certain of order.)\n\n2. I realized I had an existing craft which would be a good basis to modify, so decided to load that .craft file instead\n\n3. Clicking Load did nothing -- even after exiting the VAB and some other trickery.\n\nI opened up the debug log and saw it complaining about a particular ship not having a root part:\n\n    [ERR 22:14:13.443] [ShipTemplate]: Could not locate root part in Comsat KP1 as 0 entries remain after eliminating all parts listed as children. This is probably wrong.[EXC 22:14:13.445] NullReferenceException: Object reference not set to an instance of an object\tShipTemplate.SetIfControllable ()\tShipTemplate.LoadShip (.ConfigNode root)\tCraftBrowser\u002B..ctor (System.IO.FileInfo )\tCraftBrowser.buildCraftList ()\tCraftBrowser..ctor (Rect rect, EditorFacility facility, System.String profile, System.String title, .SelectedCallback onFileSelected, .CancelledCallback onCancel, UnityEngine.GUISkin guiSkin, UnityEngine.Texture2D fileIcon, Boolean showFlagButton)\tEditorLogic.loadShip ()\n\n -- then realized that it was the ship I had saved in step 1. Sure enough, I managed to **somehow** save a ship with that name with zero parts, which results in a .craft file that looks like this:\n\n    ship = Comsat KP1version = 0.90.0description = type = VABsize = 0,0,0\n\nTo see if this what happened to you, look at the debug log in game (Alt-F12 on Windows), or just look over KSP\\Saves\\Company\\Ships\\VAB for an extremely small (1kb, actually \u003C100 bytes) .craft file and delete it if present.\n\nHopefully, Squad can fix this to skip loading of the affected craft and possibly indicate it as corrupted) rather than breaking the load facility in its entirety, as it prevents loading *any* craft if one craft is broken.\n\n**Edited \u003Ctime datetime=\u00222015-04-06T05:37:27Z\u0022 title=\u002204/06/2015 05:37  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 6, 2015\u003C/time\u003E by dewin**\n  \nMore details"}]}