{"TopicId":103659,"ForumId":70,"TopicTitle":"[0.90] Possible Windows Memory Wall Crash Workaround","CreatedByName":"bernh","CreatedById":140617,"CreatedDateTime":"2015-04-08T01:29:46Z","PageNum":1,"Articles":[{"CreatedByName":"bernh","CreatedById":140617,"CreatedDateTime":"2015-04-08T01:29:46Z","Content":"Hey Everyone,\n\nI may have a workaround for the dreaded 3.6GB-3.7GB memory wall in Windows when running KSP 32bit\n\nFirst a little background in case it makes a difference.\n\nMy system:\n\ni5-2320 running at 3GHz\n\n8GB RAM\n\nIntel DZ77GA-70K\n\nnVidia GT610 2GB Graphics Card driving 2 monitors at 1280x1024 each\n\nMotherboard/CPU Intel graphics running a third monitor at 1024x768\n\nWindows 7 Ultimate x64 SP1\n\nKSP 0.90.0.705\n\n49 mods installed, including some large ones like B9 Aerospace, KW Rocketry, Alchemy Labs, Karbonite, Regolith, KAS, KSO, KAX, MKS and OKS to name a few.\n\nI was at a point where the game would not load, crashing about 80%-90% through the loading progress bar.\n\nI now have the game running, with a RAM footprint of about 1.2GB sitting in the SPH or VAB.\n\nThis is what I did:\n\nIn the launcher settings\n\n-Terrain Detail default\n\n-SM3 Terrain Shaders Enabled\n\n-Terrain Scatters Disabled\n\n-Render Quality Good\n\n-Texture Quality Half Res\n\n-Fallback Part Shaders Disabled\n\n-Aerodynamic FX Quality Normal\n\n-Screen Resolution 1280x1024 (my monitor\u0027s native resolution)\n\n-Full Screen Disabled\n\n-Anti-Aliasing Off\n\n-VSync Every VBlank\n\n-Frame Limit 80FPS\n\nInstalled ddsloader - [http://forum.kerbalspaceprogram.com/threads/96729-0-90-DDSLoader-1-9-%28Mar-9%29-Loads-DDS-Texture-Boringly-fast-edition](https://forum.kerbalspaceprogram.com/threads/96729-0-90-DDSLoader-1-9-%28Mar-9%29-Loads-DDS-Texture-Boringly-fast-edition)\n\nInstalled KSP to DDS Texture Converter - [http://forum.kerbalspaceprogram.com/threads/98672-WIN-KSP-to-DDS-texture-converter](https://forum.kerbalspaceprogram.com/threads/98672-WIN-KSP-to-DDS-texture-converter)\n\nRan the texture converter on the GameData folder picking 1/2 resolution for the conversion\n\nCreated a shortcut to start KSP using the -force-opengl -popupwindow switches\n\nInstalled a RAM optimizer called Minimem - [http://main.kerkia.com/products/minimem/download.aspx](http://main.kerkia.com/products/minimem/download.aspx)\n\nWith the Minimem GUI open, I set it to optimize every 30 seconds, and disabled the two options for Do not optimize the foreground process and Do not optimise if overall RAM available is above... \n\nI ran KSP using the created shortcut, then found the KSP process in the right hand side of the Minimem GUI and added it to the optimize list on the left side.\n\nCorrect me if I\u0027m wrong, but from what I have read, using ddsloader allows KSP to use the dds textures made by KSP to DDS. The force-opengl switch allows those textures to be loaded onto the RAM on the graphics card. The Minimem application then releases the RAM that those textures used while they were making their way to the GPU, but since they are now on the GPU they are no longer needed in RAM.\n\nI have been running this setup for 5 or 6 days now with great success. I have not played around with my settings much beyond what I have outlined, so feel free to experiment if you want to try this approach.\n\nOne thing to note though, is that if you install any additional mods after the initial setup, you will need to re-run the KSP to DDS converter to convert the new textures.\n\nHappy Gaming! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"funk","CreatedById":118840,"CreatedDateTime":"2015-04-08T12:51:37Z","Content":"Wow, Minimem is great it keeps ram usage always at low level... time to add more mods!!!. Thx for the hint!"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-04-08T16:33:27Z","Content":"Hmmm...Think I\u0027ll wait on Minimem...\n\nI\u0027ve done everything you listed except Minimem, and have seen some nice improvements...\n\nBut that Kerkia website seems a little sketchy...And Minimem itself hasnt seen an update in over 3 years...??...Is it even still being developed or supported?...Not to mention it relies on .NET 2.0??....."},{"CreatedByName":"bernh","CreatedById":140617,"CreatedDateTime":"2015-04-08T22:26:53Z","Content":"I agree that Minimem is a bit old, but it works, and, as an Electronics Technician and Computer Technician for the last 20 plus years, I am a firm believer in the old saying, \u0022If it\u0027s not broke, don\u0027t fix it.\u0022 \n\nYou don\u0027t need to install .NET 2.0, as long as you have a newer version. I personally have .NET 4.5.\n\nIt has not raised and flags with AVG or Malwarebytes.\n\nI didn\u0027t jump to Minimem right away myself. After I did the other steps, and was still hitting the RAM wall, I looked for a RAM optimizer, actually trying several different ones, but Minimem is the one that worked, and unlike all the others I tried, it lets you target a specific process, instead of only working globally. Essentially, it was the last step I tried, after realizing that the other steps, while definitely helpful, were still letting the textures to keep a footprint in RAM, and while smaller than the non-DDS footprint, was still large enough to keep me from running the game.\n\nIf you are happy without having to resort to the RAM optimization step, there is no need to do it."},{"CreatedByName":"Honeybadga","CreatedById":64977,"CreatedDateTime":"2015-04-09T05:04:17Z","Content":"Does DDS loader make ActiveTextureManagement obsolete? Is there a point in running the two side by side?"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-04-09T05:54:07Z","Content":"\u003E \n\u003E Does DDS loader make ActiveTextureManagement obsolete?\n\nI dont believe so...\n\n\u003E \n\u003E Is there a point in running the two side by side?\n\nYes...If you dig around in one of the DDS threads, there are quite a few mods that wont handle being converted by DDS...\n\nThere is an exception list you can use, so DDS converter will skip them...I guess that is where ATM comes in, to pick up the slack...\n\nAlso, if I am reading some info in that thread correctly, at this time, DDS converter only handles certain file types, not ALL of them?....\n\nAs to not feeling totally comfortable downloading Minimem, I DO have a streamlined, separate install of Win7 that I use to ONLY run KSP...I guess I could install it on that partition, and if it IS malware or worse, no big loss for me to wipe that Windows install and start fresh...\n\n**Edited \u003Ctime datetime=\u00222015-04-09T23:06:14Z\u0022 title=\u002204/09/2015 11:06  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 9, 2015\u003C/time\u003E by Stone Blue**"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-04-09T09:28:56Z","Content":"Minimem looks a lot like snake oil. Nothing in their description actually explain how it works. If fixing leak was as easy as launching an app it would be in Windows..."},{"CreatedByName":"bernh","CreatedById":140617,"CreatedDateTime":"2015-04-09T12:19:35Z","Content":"I don\u0027t know what Minimem does under the hood. If the info about the authors is correct, it was developed by some independent programmers, that do custom software and websites for people. Any tools they develop outside of a contract they put on their website for free download. \n\nThere are a lot of testing, diagnostic, and fix it apps out there that have been developed because the functionality that is required is not in windows.\n\nSeriously guys, I am not employed by them, and gain nothing from mentioning them. If you don\u0027t want to try it, don\u0027t. I am 43 years old, a trained electronics and computer technician. I have had a computer since I was 9 years old. In all that time, I have only be been hit by 3 viruses. I always have virus scanners and malware scanners going. All I can say is that Minimem worked for me and allowed me to play my heavily modded game when included with the other steps I mentioned."},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-09T18:14:54Z","Content":"\u003E \n\u003E Does DDS loader make ActiveTextureManagement obsolete? Is there a point in running the two side by side?\n\nThere\u0027s no point using both provided you preconvert everything. ATM will just take memory up for no benefit.\n\nTry -force-opengl or -force-d3d11 ; both have their own issues ( opengl has no shadows, dx11 needs aero effects turned to min/has occasional shadow glitches/turns minmus into a black hole ) but they will offload textures to video RAM which saves about a GB.\n\nInstall Texture Replacer, it\u0027ll unload textures again after the game has loaded them at startup.\n\n**Edited \u003Ctime datetime=\u00222015-04-09T18:18:11Z\u0022 title=\u002204/09/2015 06:18  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 9, 2015\u003C/time\u003E by Van Disaster**"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-04-09T19:12:05Z","Content":"I had a look at what Minimem actually does. It calls EmptyWorkingSet at regular intervals on all the app that are selected. This force some of the process memory to go to swap. It give the illusion that you have more free mem but actually you just have more used swap and those page will get back to the memory since there was a good reason Windows Kernel did not put them there in the first place. As I said : Snake Oil.\n\n**Edited \u003Ctime datetime=\u00222015-04-09T19:14:32Z\u0022 title=\u002204/09/2015 07:14  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 9, 2015\u003C/time\u003E by sarbian**"},{"CreatedByName":"funk","CreatedById":118840,"CreatedDateTime":"2015-04-09T21:29:15Z","Content":"I also have shutdowns of KSP with Minimem after some time. It doesn\u0027t really effect playtime as sarbian already mentioned. So I will migrate to Linux for 1.0 if I get my raid 0 working..."},{"CreatedByName":"ColKlonk","CreatedById":137078,"CreatedDateTime":"2015-04-09T22:27:46Z","Content":"One could avoid all this garbage if KSP managed it\u0027s objects properly"},{"CreatedByName":"dewin","CreatedById":96372,"CreatedDateTime":"2015-04-10T00:43:02Z","Content":"heh, I guessed correctly at what Minimem does...\n\nAnd as a result, it *could* be beneficial for KSP\u0027s performance if your overall system is low on RAM in general -- but if you\u0027re running 8GB\u002B, it\u0027s not going to do much for you (nor will it reduce KSP\u0027s memory usage.), and it\u0027s not going to resolve out-of-memory crashes regardless.\n\nAs far as a process\u0027s address space goes, each 32-bit process has a virtual 4GB of memory. Paging to disk isn\u0027t going to reduce that at all, it just means that when it requests that chunk of memory it now has to be retrieved from disk."},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-04-10T03:03:17Z","Content":"\u003E \n\u003E I had a look at what Minimem actually does. It calls EmptyWorkingSet at regular intervals on all the app that are selected. This force some of the process memory to go to swap. It give the illusion that you have more free mem but actually you just have more used swap and those page will get back to the memory since there was a good reason Windows Kernel did not put them there in the first place. As I said : Snake Oil.\n\nEven if it didn\u0027t do that, it would be impossible for it to be anything but snake oil. RAM Optimizers cannot safely dynamically deallocate memory currently in use by a program. (Well, correction: An optimizer directly made for KSP could do it... but it wouldn\u0027t be pretty and would probably cause more crashes unless it froze the game [Re: Garbage Collected Memory]. You know, it wouldn\u0027t be pretty but... if (and only if) all of the loaded textures were on the GPU\u0027s memory... correcting the memory to properly reflect this might be possible [note: this is an issue with C# and Unity], still... getting a stable pointer in garbage collected memory.)\n\nIt is interesting to know that what they tend to do is push everything back into swap. In my youth I liked them, then I grew out of them (I never noticed a performance increase), and later I learned that the kernel would optimize memory for the currently running application anyways."},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-10T03:19:03Z","Content":"@Fel: \u0022[LOG 02:40:24.702] [TR.Loader] Texture unloading freed approximately 1119.8 MiB = 1174.2 MB of system RAM\u0022 after a big list of \u0022[LOG 02:40:24.699] [TR.Loader] Unloaded VenStockRevamp/Squad/Parts/Engine/Mk55LUM\u0022. I can watch it doing it using GCMonitor.\n\nThat\u0027s from Texture Replacer, runs after asset loading \u0026 before MM starts compiling. I run DX11, it might not do anything for DX9 I guess, never bothered checking. I\u0027ve no idea if it dynamically unloads textures if you swap scene later on either.\n\n**Edited \u003Ctime datetime=\u00222015-04-10T03:21:36Z\u0022 title=\u002204/10/2015 03:21  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 10, 2015\u003C/time\u003E by Van Disaster**"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-04-10T03:58:25Z","Content":"\u003E \n\u003E @Fel: \u0022[LOG 02:40:24.702] [TR.Loader] Texture unloading freed approximately 1119.8 MiB = 1174.2 MB of system RAM\u0022 after a big list of \u0022[LOG 02:40:24.699] [TR.Loader] Unloaded VenStockRevamp/Squad/Parts/Engine/Mk55LUM\u0022. I can watch it doing it using GCMonitor.\n\u003E That\u0027s from Texture Replacer, runs after asset loading \u0026 before MM starts compiling. I run DX11, it might not do anything for DX9 I guess, never bothered checking. I\u0027ve no idea if it dynamically unloads textures if you swap scene later on either.\n\nThat isn\u0027t exactly what I meant. A Ram Optimizer should be an external program, not a plugin; just a quick look and it seems the plugin works by converting mod\u0027s textures to DDS with enhancements (i.e. compression).\n\nUnity\u0027s problem\u0027s are much harder to address because you don\u0027t have any real control over the memory from C#. If something gets \u0022stuck\u0022 because C# isn\u0027t convinced that ALL namespaces that reference it no longer are referencing it, the only way you can free it would be to either restart the game, or have an external program hack and do some really stupid things and hope it all works out.\n\nThe case I was referencing was how OpenGL\u0027s implementation doesn\u0027t have a shadow cache of textures. In theory, you could manually \u0022free\u0022 that space by writing it as unassigned. In practice, it is a very bad idea."},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-10T04:27:07Z","Content":"Converting something to DDS is nothing like freeing 1GB or so of memory in one go. TR only occasionally converts anything, it\u0027s obvious in the log when it does - given the game converts everything to DDS which isn\u0027t already converted anyway that is not in itself going to save anything.\n\nTR unloads 72MB of assets from an otherwise stock game irrespective of version of DX - unfortunately I don\u0027t have a more modded game I can start in dx9 mode at the moment so I\u0027m not sure if it\u0027s dumping out pre-offloaded textures or just unloading regardless. I\u0027ve not really any desire to deconstruct TR myself either.\n\nI\u0027m well aware of reference count GC issues :S"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-04-10T09:39:33Z","Content":"\u003E \n\u003E Unity\u0027s problem\u0027s are much harder to address because you don\u0027t have any real control over the memory from C#. If something gets \u0022stuck\u0022 because C# isn\u0027t convinced that ALL namespaces that reference it no longer are referencing it, the only way you can free it would be to either restart the game, or have an external program hack and do some really stupid things and hope it all works out.\n\nI would like to point out that 95% of Unity is not C#. The only things that run on mono in the game scripting stuff. All the engine is pure native code. You can create native object from the C# and if you don\u0027t free them manually they never go. It s not a garbage collector problem."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-04-10T09:59:56Z","Content":"If you\u0027re using OpenGL mode that, and converting to DDS, is about all you need--since that means you won\u0027t leak loading textures, and textures will properly be removed from system RAM when uploaded, you needn\u0027t scale them down to save RAM."},{"CreatedByName":"Jovzin","CreatedById":105152,"CreatedDateTime":"2015-04-14T06:50:42Z","Content":"Well I must say my 2 cents too.\n\nI really hate this memory stacking and not flushing the textures. Bcs of this I was able to do only 6- 7 times of scene switching ( from KSP to ship and back from ship to KSP or to another ship) and after those 7 times of scene switching I got crash bcs our beloved KSP is not handling the textures well and instead of flushing them it stacks them. \n\nThis was with forced DX11 and aggresive memory management from rbay89 and converted textures to DDS and used DDSloader. \n\nBut after some time of googling on the internet I found this little program called cleanmem ( mainly used in Battlefield games ) [http://www.pcwintech.com/cleanmem](http://www.pcwintech.com/cleanmem) \n\nNow I am using DX11 with ATM and wiht DDSloader and every 30 minutes cleanmem will do its job and I must say no more crashes for me. I can do a lot of those scene switching and no crash. \n\nBut I really hope that Squad will fix this in 1.0 cause it is really a game breaking thing.\n\n**Edited \u003Ctime datetime=\u00222015-04-14T06:52:47Z\u0022 title=\u002204/14/2015 06:52  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 14, 2015\u003C/time\u003E by Jovzin**"}]}