{"TopicId":109215,"ForumId":70,"TopicTitle":"Pitch controls are behaving weird","CreatedByName":"BlackSoldierB","CreatedById":103414,"CreatedDateTime":"2015-05-14T14:46:10Z","PageNum":1,"Articles":[{"CreatedByName":"BlackSoldierB","CreatedById":103414,"CreatedDateTime":"2015-05-14T14:46:10Z","Content":"**KSP**: 1.02 Windows 32bit\n\n**Problem**: \n\nAfter i EVA\u0027ed with Jeb to get some science. My pitch control is doing weird.\n\nWhen i hold \u0027S\u0027, i see the pitch indicator go to the bottom. After turning some bit, i see the pitch indicator go the the top (while still pressing \u0027S\u0027).\n\nAnyone else noticed this behavior? \n\nRestarting KSP didn\u0027t help.\n\nEDIT: It doesn\u0027t seem related to EVA or Remote Tech. \n\nWhen i launch a new aircraft this also happens.\n\n**Mods installed**:\n\nModuleFlightIntegrator\n\nNuFar\n\n[**List from CKAN.**](http://1drv.ms/1G9xh26)\n\n[**Get the savegame here.**](http://1drv.ms/1IDjHV4)\n\n**Reproduction steps:**\n\nLauch rocket. Hack gravity. Hold \u0027S\u0027. \n\nThe rocket stops turning ~45 degrees.\n\nLog:\n\nDidn\u0027t find any exceptions that could have caused this. Will add one, if I have better reproduce steps.\n\n**Edited \u003Ctime datetime=\u00222015-05-15T09:34:54Z\u0022 title=\u002205/15/2015 09:34  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 15, 2015\u003C/time\u003E by BlackSoldierB**"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-05-14T15:01:11Z","Content":"Are all those mods compatible with KSP 1.0.2? It came out not too long ago."},{"CreatedByName":"BlackSoldierB","CreatedById":103414,"CreatedDateTime":"2015-05-14T15:36:44Z","Content":"KAS is the only one that is not compatible with 1.02\n\nOthers are atleast 1.0.\n\nEDIT: When i removed NuFar and ModuleFlightIntegrator, the issue went away.\n\nApparently my CKAN didn\u0027t update to FAR to 15.1. In this update the following issue is fixed.\n\n\u003E \n\u003E Fixed improper determination of vehicle main axis\n\nEDIT2: Apparently is had enabled the AoA and Pitch button in the FAR dialog. (Which also work in space for some weird reason)\n\n**Edited \u003Ctime datetime=\u00222015-05-18T18:20:06Z\u0022 title=\u002205/18/2015 06:20  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 18, 2015\u003C/time\u003E by BlackSoldierB**"},{"CreatedByName":"nuclearping","CreatedById":92457,"CreatedDateTime":"2015-11-23T04:29:42Z","Content":"[quote name=\u0027BlackSoldierB\u0027]EDIT2: Apparently is had enabled the AoA and Pitch button in the FAR dialog. (Which also work in space for some weird reason)[/QUOTE]  \n\nOMG thank you so much for posting your solution! I found this thread because I\u0027m having the exact same issue since days and was going nuts because I couldn\u0027t find the cause ... D:  \n\nI had indeed the assist buttons in FAR enabled. And disabling them solved it!  \n\nThis should really be fixed in FAR so it doesn\u0027t work in 0G / 0atm."},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-11-23T05:41:03Z","Content":"It is intended to work in space. It would be much worse control system design to have the system automatically shut itself off without user input; the controls are supposed to follow the user\u0027s instructions, and in the cases you\u0027re describing, the last instructions were to activate the control systems. They\u0027re exactly the same as SAS in that regard."},{"CreatedByName":"nuclearping","CreatedById":92457,"CreatedDateTime":"2015-11-23T23:02:31Z","Content":"I dug a bit into this. Figured it is actually the Pitch and / or AoA which causes the problems. If you only have Pitch enabled, you can control the ship, it is a bit hard because it doesn\u0027t really want to head the direction you want. But with AoA enabled it behaves really weird, as it doesn\u0027t allow you to pitch your nose below or the artificial horizon or something.  \n\nI made a short video of what I mean (sorry, Kazam didn\u0027t record sound and mouse):  \n\n[video]https://youtu.be/OFQuMge129U[/video]  \n\n[LIST]  \n\n[\\*]After launch everything is fine as long as you are inside the atmosphere.  \n\n[\\*]But if you are in space and have the flight assists on, the ship starts to randomly spin and turn as soon as you disable SAS or set SAS to maneuver node for instance.  \n\n[\\*]Especially with Pitch and AoA enabled. But just AoA enabled will also cause the same effect.  \n\n[\\*]At one point in the video I was just holding W, but the ship bounced up and down. It did turn fine in all other directions (A, S, E, Q), but not W / S.  \n\n[/LIST]  \n\nBut the biggest \u0022fool trap\u0022 here is that the settings are globally persistent across the sessions. So if you had them enabled because you were flying / testing an airplane some days ago and forget to turn them off afterwards, you are really wondering what is suddenly wrong with your KSP and you start doing weird things like deleting recently installed mods, creating new save game, etc. Until you find this thread ... :D\n\n**Edited \u003Ctime datetime=\u00222015-11-23T23:07:48Z\u0022 title=\u002211/23/2015 11:07  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 23, 2015\u003C/time\u003E by nuclearping**"}]}