{"TopicId":111688,"ForumId":70,"TopicTitle":"Mechjeb threottle control not working","CreatedByName":"CrasHReBooT","CreatedById":143916,"CreatedDateTime":"2015-06-02T00:09:31Z","PageNum":1,"Articles":[{"CreatedByName":"CrasHReBooT","CreatedById":143916,"CreatedDateTime":"2015-06-02T00:09:31Z","Content":"Forgive me if this is a repeat help request, but I have searched the forum and have not found this issue with MechJeb.\n\nWhen I set mechjeb to circularize around the Mun when I have a parabolic orbit, the autopilot will not auto-warp, it will aim in the correct maneuver direction, but when I manually warp to before the maneuver, Mechjeb will not fire the throttle on time, before time or anytime after the 0 countdown. The manual throttle control is also locked; I cannot control the throttle. If I abort the maneuver, I have manual control of the throttle. I do have enough battery charge and all of the limit buttons are off, just in case there is a conflict. Circularize worked around Kerbal before I went to the moon. Landing Guidance also does not work on the Mun but it does work on Dune. The circularize was working on another Mun trip. I have tried relaunching the mission, and the same thing happened. Any ideas how to fix this most excellent mod? It Is like the Mun does a whammy on the Mechjeb.![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)"},{"CreatedByName":"Mait3rz","CreatedById":143719,"CreatedDateTime":"2015-06-03T06:06:18Z","Content":"Hey I was having the same issue too, it\u0027s a bug with the most recent release of mechjeb. If you download the latest stable dev build version from [http://jenkins.mumech.com/job/MechJeb2/](http://jenkins.mumech.com/job/MechJeb2/) it resolved the issue I was having."},{"CreatedByName":"jackal40","CreatedById":77824,"CreatedDateTime":"2015-07-16T19:52:14Z","Content":"\u003E \n\u003E Hey I was having the same issue too, it\u0027s a bug with the most recent release of mechjeb. If you download the latest stable dev build version from [http://jenkins.mumech.com/job/MechJeb2/](http://jenkins.mumech.com/job/MechJeb2/) it resolved the issue I was having.\n\nThanks for the suggestion, the stable build fixed my NaN and Infinity m/s readings too!"}]}