{"TopicId":116858,"ForumId":70,"TopicTitle":"Engine and FASA help","CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2015-07-26T09:17:22Z","PageNum":1,"Articles":[{"CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2015-07-26T09:17:22Z","Content":"Hi all ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) So I have a couple of questions here if I may.\n\nI havnt updated my mods via CKAN for a while so last night I decided to do it. All went well with the update so I carried on with my sandbox mission, docking another part to my spacestation. I left Kerbin with a rocket of mine which had a KR-2L\u002B \u0022Rhino\u0022 engine strapped to the bottom. The launch went well and my idea was to use this same engine to achieve orbit as I had plenty of deltaV.\n\nI shut my engine down when I hit my required apaoapsis, set a manouver node and went to fire up the engine again......nothing happened!! I was informed that I had no more ignitions left?? Ive never seen this before so I reverted back to the VAB, right clicked the engine and it said I had 2 available ingnitions?\n\nAm I doing something wrong here?\n\nAnother thing I have noticed is that in the VAB, when I goto the fuel tank builder I seem to have my FASA engines in there too? Ive used FASA for a while now and never noticed this before?\n\nBefore I posted these questions I did a full, clean install. Any help would be much appreciated as its doing my head in!! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-07-26T19:17:19Z","Content":"Sounds like you have RealFuels and an engine config pack installed..."},{"CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2015-07-26T20:36:23Z","Content":"\u003E \n\u003E Sounds like you have RealFuels and an engine config pack installed...\n\nIll check 2morrow. Funny thing is I havnt installed any new mods for weeks so something has definitely changed....ive half a space station in orbit and now I get this...."}]}