{"TopicId":117699,"ForumId":70,"TopicTitle":"bug with rover controls","CreatedByName":"psychopoak","CreatedById":58162,"CreatedDateTime":"2015-08-05T14:20:21Z","PageNum":1,"Articles":[{"CreatedByName":"psychopoak","CreatedById":58162,"CreatedDateTime":"2015-08-05T14:20:21Z","Content":"hi guys \n\nI have a bug with rover controls at the moment and can not find a workaround or the origin of the bug.\n\nwhen I try to control a rover it partially goes as expected. driving forward works fine, turning left or right, braking, everything is fine. but when I hit \u0022drive backward\u0022 nothing happens. Sometime I see some jittering movement backward, but it merely moves the rover. and once I release the buttons the rover goes full forward, just like if I was pushign the buttons full forward. when I brake, it decelerates but once I release the brakes it goes back to \u0022full forward\u0022.\n\nthe only way for me to regain controls is to hit \u0022full forward\u0022. at this point I regain control as if nothing happened...until I try to go backward again.\n\nSo I tried a vanilla install, I moved the controls for the rover on the numpad, even tried with a USB numpad, removed all my controllers.\n\nI tried to build a rover with a rovermate, a command seat, other probes. I put a docking port in the front of the rover, built it in VAB or SPH, nothing seems to worlk.\n\nI installed \u0022stock bug fix modules\u0022 with no better result and now I lack imagination on where to look.\n\nanybody as any sort of idea?\n\nthanks in advance\n\n**Edited \u003Ctime datetime=\u00222015-08-06T06:30:56Z\u0022 title=\u002208/06/2015 06:30  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 6, 2015\u003C/time\u003E by psychopoak**"},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-08-05T16:07:21Z","Content":"That sounds like the bug that advanced fly by wire causes. Are you using that mod?\n\nIf not including your full list of mods and the output file may help ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"psychopoak","CreatedById":58162,"CreatedDateTime":"2015-08-05T21:25:12Z","Content":"hm...indeed I am. so you say I will then have to choose between AFBW and playing with rover? or could I just disable it when I want to drive a rover?\n\nBTW thanks a lot, you are the first to bring that up and I think it might be an interesting clue. I should have a look at that and either find a workaround or make a hard decision. Or, third option, I would then have a good reason to get my hands dirty in the completion of the control panel I planned to make and for with I already have half of the piece...\n\nany other thought though?"},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-08-05T21:57:39Z","Content":"A few people mentioned that you can just disable the stick in the AFBW gui, however that didn\u0027t work for me. I have to remove the mod when I want to use rovers then reinstall it afterwards."},{"CreatedByName":"psychopoak","CreatedById":58162,"CreatedDateTime":"2015-08-06T06:30:14Z","Content":"Torih, my man, if you ever come in Belgium feel free to remind me that I owe you one big delicious beer.\n\nI quickly tested your solution in the middle of the night as I could fall asleep, and everything went better for my night as what you pointed out seems to solve the problem. Once I disable input from AFBW, it took a couple of seconds and then I can control my rover without any trouble. Oh boy am I happy!\n\nthanks a lot man, you put hope for rover back into my heart. I definitely owe you one"},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-08-06T13:13:09Z","Content":"Do like Belgium beer ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Glad its sorted."}]}