{"TopicId":117685,"ForumId":70,"TopicTitle":"Air intakes become \u0027Occluded\u0027 when closing cargo bay.","CreatedByName":"Krisism","CreatedById":71149,"CreatedDateTime":"2015-08-05T08:51:49Z","PageNum":1,"Articles":[{"CreatedByName":"Krisism","CreatedById":71149,"CreatedDateTime":"2015-08-05T08:51:49Z","Content":"On my mk2 spaceplane, when flying in the atmosphere and opening then closing the mk2 cargo bay doors, the ram air intakes outside of the cargo bay suddenly become \u0027occluded\u0027 resulting in flame-outs. \n\nI tried moving the air intakes further away from the cargo bay, so they were not touching at all, and this did not solve the issue. A few notes, the cargo bay has several small items inside including 6 sensors, 4 batteries, 6 solar panels, and 2 small radiator panels. There is a 1.25m liquid fuel tank along the side of the craft, adjacent to the cargo bay, with ram air intakes on the front of the 2 fuel tanks.\n\nI\u0027m currently only using these mods: Engineer Redux, KAS, KIS, Transfer Window Planner, and Critical Temperature Gauge.\n\nThanks for any advice or ideas, it\u0027s greatly appreciated!\n\n(Edit: I couldn\u0027t find any information on this issue. If there is a better place to put this post, please let me know and I will gladly move it. Thanks!)\n\n**Edited \u003Ctime datetime=\u00222015-08-05T11:17:12Z\u0022 title=\u002208/05/2015 11:17  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 5, 2015\u003C/time\u003E by Krisism**"},{"CreatedByName":"funk","CreatedById":118840,"CreatedDateTime":"2015-08-05T10:33:15Z","Content":"[look here](https://forum.kerbalspaceprogram.com/threads/130312-Part-overheating-in-cargo-bays-Approach-to-solving-randomly-overheating-parts-in-time-warp)"},{"CreatedByName":"Krisism","CreatedById":71149,"CreatedDateTime":"2015-08-05T11:16:23Z","Content":"Thank you funk, that explains it very well. I understand the issue now. I\u0027ll mark this thread as solved.\n\nCheers!\n\n(Edit: In case others wind up here trying to solve a similar issue - the link above explains that cargo bays use a radius to detect parts for occlusion. This radius comes from center mass of the cargo bay, therefore it extends slightly out of the cargo bay near the middle. My air intakes were likely in that radius. Another tip, is you can toggle off air intakes before opening/closing cargo bays to keep them from being occluded. After the bay is closed, just toggle back on.)\n\n**Edited \u003Ctime datetime=\u00222015-08-05T11:20:01Z\u0022 title=\u002208/05/2015 11:20  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 5, 2015\u003C/time\u003E by Krisism**"}]}