{"TopicId":121165,"ForumId":70,"TopicTitle":"KSP crash on change from vessel to space center!","CreatedByName":"Sagitarius","CreatedById":151291,"CreatedDateTime":"2015-09-18T14:34:32Z","PageNum":1,"Articles":[{"CreatedByName":"Sagitarius","CreatedById":151291,"CreatedDateTime":"2015-09-18T14:34:32Z","Content":"\n\u003Cp\u003EYes..., so if I recover or just change to the space center and if i try to fly it (After game restart), the game chrashes always to the desktop. I\u0027ve tried it five times now and its really anoying and NO ITS VERY SURELY NO RAM ISSUE! I\u0027m running active texture management and I\u0027ve a strong computer with win10 64x. I\u0027ve also read both error reports and the error.txt says:\u003C/p\u003E\u003Cp\u003E Error occurred at 2015-09-18_160810. J:\\SteamLibrary\\steamapps\\common\\Kerbal Space Program\\KSP.exe, run by Sagitarius.\u003C/p\u003E\u003Cp\u003E=\u0026gt; 42% memory in use.\u003C/p\u003E\u003Cp\u003E 0 MB physical memory [0 MB free].\u003C/p\u003E\u003Cp\u003E 0 MB paging file [0 MB free].\u003C/p\u003E\u003Cp\u003E 0 MB user address space [88 MB free].\u003C/p\u003E\u003Cp\u003E Write to location 01000000 caused an access violation. \u003C/p\u003E\u003Cp\u003EI\u0027m new to the forum and don\u0027t know how to upload the whole error logs, so...\u003C/p\u003E\u003Cp\u003EPlease just help me because KSP is currently my favourite game and I really want to continue playing it WITHOUT crashes.\u003C/p\u003E\u003Cp\u003EThx for any response.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-18T16:49:12Z\u0022 title=\u002209/18/2015 04:49  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 18, 2015\u003C/time\u003E by Sagitarius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2015-09-21T19:46:41Z","Content":"\n\u003Cp\u003EHow full is your hard drive? If there is no room to store the quicksave, KSP will crash.\u003C/p\u003E\n"},{"CreatedByName":"dboi88","CreatedById":150676,"CreatedDateTime":"2015-09-21T20:26:25Z","Content":"\n\u003Cp\u003EI get this bug all the time, sometimes with a certain ship, sometimes with them all. I don\u0027t know what causes it but i as a work around I always have a flag planted somewhere. I can then switch to this in map view and then back to space centre. It never crashes this way.\u003C/p\u003E\n"},{"CreatedByName":"Sagitarius","CreatedById":151291,"CreatedDateTime":"2015-09-25T15:47:08Z","Content":"\n\u003Cp\u003EHard Drive? Thx for the tip, but there are 1250 GB of free space on my disc so...\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-09-25T15:52:21Z","Content":"\n\u003Cp\u003E42% memory use on an 8GB system is almost exactly the 32-bit memory limit of Windows KSP, are you 100% sure it\u0027s not a memory issue?\u003C/p\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-09-25T16:47:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E42% memory use on an 8GB system is almost exactly the 32-bit memory limit of Windows KSP, are you 100% sure it\u0027s not a memory issue?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis was an issue that I had for when 1.0 was released. I do not know if it will work for the original poster, but here\u0027s what I do and I no longer have issues:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EBefore I even load KSP, I open Program Manager and \u0022end task\u0022 for programs/processes/applications I don\u0027t need while I play KSP. This includes Dropbox, OneDrive, Outlook, Office 360 Cache, Microsoft Store, and any fonts manager that Windows 10 installed. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Keep parts count low; I am running Windows 10 with 8 GB of DRAM, so, I try to keep my vehicles under 70 parts. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Save your craft files often. Before leaving either the SPH or VAB, take a few seconds to save the craft again. For some reason, this reduced the number of crashes between screen changes. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E As much as I hate to say it, I have had to make some tough decisions about mods. the EVE mods, a few various vehicle mods, and some utilities had to go FOR NOW because I only have the ability to play KSP on an older lap top. So... keep that in mind. The more mods you have plus an older machine equals crashes. Maybe once the transition is made to Unity 5 and we have a 64 bit version of KSP that\u0027s stable, we will have better results.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-09-25T18:24:43Z","Content":"\n\u003Cp\u003EWhatever you think, it\u0027s very probably a memory issue: ATM is not a magic solution to memory crashes (speaking from experience) and having a strong computer running a 64bit OS has nothing to do with memory issues: the limit for KSP 32bit is ~3.5GB should you run a supercalculator or a potato.\u003C/p\u003E\u003Cp\u003EA list of your mods would be helpful: some are known to greatly increase RAM usage (alternate systems, HD textures, part mods, and let\u0027s not even talk about visual mods...).\u003C/p\u003E\n"}]}