{"TopicId":121117,"ForumId":70,"TopicTitle":"Claw Time Warp Bug","CreatedByName":"Whitecold","CreatedById":82835,"CreatedDateTime":"2015-09-17T21:52:36Z","PageNum":1,"Articles":[{"CreatedByName":"Whitecold","CreatedById":82835,"CreatedDateTime":"2015-09-17T21:52:36Z","Content":"\n\u003Cp\u003EA spacestation of mine developed a specific bug. It disintegrates on the launchpad on arrival, and I get a message on screen: \u003C/p\u003E\u003Cp\u003EERROR Time Warp Claw Bug \u003C/p\u003E\u003Cp\u003Eand a recommendation to quicksave and reload. That does not help, and I have no idea what this message means, there is now Claw involved in the design or has been used before.\u003C/p\u003E\u003Cp\u003EEdit: Reshuffling the parts of the craft, it now no longer disintegrates on the launchpad, but as soon as I hit 10000m altitude. According to the log some girders break, which makes no sense as they are on the very top and all that is attached ar two solar panels\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-18T07:57:41Z\u0022 title=\u002209/18/2015 07:57  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 18, 2015\u003C/time\u003E by Whitecold\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whitecold","CreatedById":82835,"CreatedDateTime":"2015-11-11T07:57:10Z","Content":"\n\u003Cp\u003EI\u0027m getting this bug again with a totally different craft on the runway. What does this error message even mean?\u003C/p\u003E\n"},{"CreatedByName":"kp0llux","CreatedById":151909,"CreatedDateTime":"2015-12-18T23:11:33Z","Content":"\n\u003Cp\u003E\nWhere does it come from, is my question.  Googling the term specifically only provides two results, this thread being one of them.  If it\u0027s a stock thing we should have some documentation and if it\u0027s from a mod it\u0027d be nice to know which one.  I\u0027ve gotten it twice now; first time reloading worked but this time it\u0027s done nothing.  Both times were planes on a tier 2 runway; makes me wonder if it\u0027s similar to the tier 2 pad bug where without clamps or separators the engines\u0027ll get stuck in the grating.\n\u003C/p\u003E\n"}]}