{"TopicId":124986,"ForumId":70,"TopicTitle":"[1.0.5] Science Lab problem","CreatedByName":"TMR","CreatedById":153389,"CreatedDateTime":"2015-11-10T23:32:44Z","PageNum":1,"Articles":[{"CreatedByName":"TMR","CreatedById":153389,"CreatedDateTime":"2015-11-10T23:32:44Z","Content":"\n\u003Cp\u003EAny one else having problem transmitting researched science from a lab? Nothing happens for me when trying, after 1.0.5 update.\u003C/p\u003E\n"},{"CreatedByName":"Douces","CreatedById":153449,"CreatedDateTime":"2015-11-12T01:19:47Z","Content":"\n\u003Cp\u003ECan confirm that this is caused by an outdated Science Alert plugin. No science transmissions seem to work, probably due to the modifications put in to the \u0022require complete/allow partial\u0022 code that was added in 1.05. As of yet I haven\u0027t been able to find and update to Science Alert.\u003C/p\u003E\u003Cp\u003EFirst post, yours as well!\u003C/p\u003E\n"},{"CreatedByName":"kreutzkevic","CreatedById":146514,"CreatedDateTime":"2015-11-12T07:07:34Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI\u0027ve got a similar problem on at least two vessels. The \u0027Transmit Science\u0027 button in the experiment interface does nothing. It resets the experiment after I press it, but won\u0027t send it.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI can only send science by right-clicking the antenna and clicking the \u0027Transmit\u0027 button in that interface. It\u0027s definetely not the amount of EC available, because I have ample EC and solar panels. I can transmit two experiments, when fully charged, without running out of EC. And I have the antenna set to allow partial transmittions.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EMy intall\u0027s a slightly modded one, but the stock experiments and DMagics\u0027 experiments are having the same problem.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI\u0027ll try removing the outdated ScienceAlert when I get home. I was thinking something along those lines but haven\u0027t had the chance to test it yet.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-12T07:14:34Z\u0022 title=\u002211/12/2015 07:14  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 12, 2015\u003C/time\u003E by kreutzkevic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TMR","CreatedById":153389,"CreatedDateTime":"2015-11-12T19:09:08Z","Content":"\n\u003Cp\u003EI removed ScienceAlert, and transmissions started working again. Many thanks for the help.\u003C/p\u003E\n"},{"CreatedByName":"Stupid_Potato","CreatedById":153517,"CreatedDateTime":"2015-11-13T15:11:25Z","Content":"\n\u003Cp\u003EHi everybody! \u003C/p\u003E\u003Cp\u003EI have the exact problem as stated in post #1\u003C/p\u003E\u003Cp\u003EI removed ScienceAlert with no change.\u003C/p\u003E\u003Cp\u003EI have even removed KSP entirely from my computer an re-installed it without any result.\u003C/p\u003E\u003Cp\u003EWhat happens is that I chose to \u0027transmit science\u0027 on my lab in orbit, the transmission of data in the top left corner starts counting towards 100% but when it gets to 100% nothing happens.\u003C/p\u003E\u003Cp\u003EKSP Version: 1.0.5.1028\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMinimal use of mods:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ERemoteTech, ...................1.6.9 \u003Cspan style=\u0022color:#008000;\u0022\u003E\u003Cstrong\u003E(up to date)\u003C/strong\u003E\u003C/span\u003E (part of space station)\u003C/p\u003E\u003Cp\u003ESCANsat, ........................14.3 \u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003E(up to date)\u003C/span\u003E\u003C/strong\u003E (part of satellites)\u003C/p\u003E\u003Cp\u003EToolbar, .........................1.7.10 \u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003E(up to date)\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EContractConfigurator, .......1.8.0 \u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003E(up to date)\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EModuleManager, ..............2.6.13 \u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003E(up to date)\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETacLifeSupport, ...............0.11.1.20 (part of space station)\u003C/p\u003E\u003Cp\u003EMunSeeker Greenhouse, ...tested for Tac-version as above (part of space station)\u003C/p\u003E\u003Cp\u003EIf I remove....\u003C/p\u003E\u003Cp\u003EScansat = no change\u003C/p\u003E\u003Cp\u003ERemoteTech = it works, but more or less all my craft are gone\u003C/p\u003E\u003Cp\u003EModuleManager = it works, but my antennas doesn\u0027t work with RemoteTech any longer (probably more issues I haven\u0027t discovered)\u003C/p\u003E\u003Cp\u003E(when RemoteTech and ModuleManager are removed the uploded data-counter have two decimals for the amount of percent uploaded, but not with them installed)\u003C/p\u003E\u003Cp\u003EAll ideas, tips and tweaks are welcome since I have completely run out of possible cause of this issue. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E------\u003C/p\u003E\u003Cp\u003EOk, I think I found the issue: the save files.\u003C/p\u003E\u003Cp\u003EI started a new career with the same mods installed and everything worked!\u003C/p\u003E\u003Cp\u003ESo I tried to tweak the most recent save file without any luck.\u003C/p\u003E\u003Cp\u003EIs there a way to fix the saves? (without losing all the progress)\u003C/p\u003E\u003Cp\u003E------\u003C/p\u003E\u003Cp\u003EAfter some testing where I launched a new lab/experiments into space and checked my other probes I came to the conclusion that for some reason the game doesn\u0027t like my space station.\u003C/p\u003E\u003Cp\u003EI undocked as many parts as possible from my space station in order to rule out any possible faulty part, with no luck however.\u003C/p\u003E\u003Cp\u003ESo what I\u0027m going to do now is to ditch my station, or at least the part with the lab attached. If I only knew whats defect about it...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-14T02:30:28Z\u0022 title=\u002211/14/2015 02:30  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 14, 2015\u003C/time\u003E by Stupid_Potato\u003C/strong\u003E\n\u003Cbr\u003Emerged consecutive posts\n\u003C/span\u003E\n"}]}