{"TopicId":125193,"ForumId":70,"TopicTitle":"Current biome calculated incorrectly based on eccentricity","CreatedByName":"evilwombat","CreatedById":142488,"CreatedDateTime":"2015-11-12T12:31:24Z","PageNum":1,"Articles":[{"CreatedByName":"evilwombat","CreatedById":142488,"CreatedDateTime":"2015-11-12T12:31:24Z","Content":"\n\u003Cp\u003EHello. Passing through Duna\u0027s atmosphere (say, at 25k alt) while on an orbital / suborbital trajectory causes the current biome to be reported as \u0022flying low\u0022 (as it should be). However, passing through Duna\u0027s atmosphere (again at 25k) on an aerocapture / escape trajectory (eccentricity \u0026gt; 1.0) causes the current biome to be treated as \u0022in space near\u0022, even though my craft is only at 25km altitude, and flame effects are in full swing. This seems like a bug - in both situations, the craft is in essentially the same location.\u003C/p\u003E\u003Cp\u003EI am running v1.0.5, with MechJeb2 (2.5.4-522) and TimeControl (v1.0.4-hotfix2) installed, though I can\u0027t imagine either of these having an impact on this problem.\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-11-12T13:11:12Z","Content":"\n\u003Cp\u003EThat\u0027s the way KSP calculate orbits...\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-12T14:04:46Z","Content":"\n\u003Cp\u003EIt\u0027s a fairly well known issue that\u0027s been around for several versions IIRC. Whether it\u0027s deliberate or not I don\u0027t know.\u003C/p\u003E\n"},{"CreatedByName":"evilwombat","CreatedById":142488,"CreatedDateTime":"2015-11-12T23:38:49Z","Content":"\n\u003Cp\u003EFair enough. I would have imagined this to be a bug rather than a feature. I expect the intention of the biome mechanic would be to allow for different science data to be gathered depending on where your craft is LOCATED, rather than how it is moving. For example, if I want to collect an atmosphere reading while passing through some body\u0027s atmosphere, the craft should be able to do it as long as it\u0027s deep enough in the atmosphere, regardless of the trajectory. I expect this is how it would work \u0022IRL\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-12T23:42:34Z","Content":"\n\u003Cp\u003ETo clarify, \u0022Flying Low\u0022 and \u0022In Space Near\u0022 are not biomes but situations. The biomes are the horizontal regions of the planet or moon, for example \u0022Poles\u0022 or \u0022Lowlands\u0022, while the situations are broadly speaking where you are vertically, but with some wrinkles like the one you found.\u003C/p\u003E\n"},{"CreatedByName":"evilwombat","CreatedById":142488,"CreatedDateTime":"2015-11-13T11:01:20Z","Content":"\n\u003Cp\u003EAh, that makes sense. Thanks!\u003C/p\u003E\n"}]}