{"TopicId":129111,"ForumId":70,"TopicTitle":"Dead Kerbals without a launch","CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2016-01-02T15:38:38Z","PageNum":1,"Articles":[{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2016-01-02T15:38:38Z","Content":"\n\u003Cp\u003E\nHi everyone,\n\u003C/p\u003E\n\u003Cp\u003E\nnot 100% sure if this is the right sub forum (if not would a mod be so kind to push me where i have to go?)\n\u003C/p\u003E\n\u003Cp\u003E\nI have a strange Problem with my little Kerbonauts. A couple of Days ago Bill, Jeb and Bob all were suddenly K.I.A.(or atleast M.I.A) and I had absolutly no idea what happened. None of my Rockets exploded or anything.\n\u003C/p\u003E\n\u003Cp\u003E\nTo get them back i had to move back to an old save file wich was already a couple of days  (day 30 something instead of 40 something) behind. Now it took me a few Real Life days to get my Rocket Programm back to the point before this happened.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I had suddenly another Kerbal missing... (thanks God it was only a 1 star freshly rescued Engineer) but again it did not happen while he was on a mission.\n\u003C/p\u003E\n\u003Cp\u003E\nNow today I finally had the problem located when suddenly Valentina Kerbin was Missing aswell. Sadly I didnt had any old enough safe file anymorewhere she wasnt missing already aswell... So i downloaded a mod to revive her (Crew Manifest) cause I can live with a dead Kerbal \u003Cstrong\u003EIF I KILL HIM/HER Personaly in a mistake\u003C/strong\u003E. not if they become Missing in Action WITHOUT any action.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I located the reason why they go missing i think.... Cause Valentina was in a Test Base a couple of meters next to the runway where i made some tests and forgot to recover the vessel. Then jumping to different ships moving some satelites... doing some quiting the game and restarting later... the Base Test next to the Runway was empty of Kerbals and Valentina was called Missing/Killed in Action.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo... Kerbals in a Ship on the Launchpad or Runway suddenly count as dead if you switch the vessel for some amount of time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIs this a bug thats known? Is this somethign that might be caused by some mods?  \n\u003C/p\u003E\n\u003Cp\u003E\nGreetings Doodle\n\u003C/p\u003E\n"},{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2016-01-05T12:29:06Z","Content":"\n\u003Cp\u003E\nGuess noone else has the problem with Crew \u0022dying\u0022 while on the launchpad/runway without any liftoff procedure....\n\u003C/p\u003E\n"},{"CreatedByName":"Spilled Vial","CreatedById":153712,"CreatedDateTime":"2016-01-05T14:19:59Z","Content":"\n\u003Cp\u003E\nNot an answer(yet), but are you using TAC or any other life support? If the answer is yes, they\u0027re running out of life support sitting on the runway as you described.\n\u003C/p\u003E\n"},{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2016-01-08T21:29:06Z","Content":"\n\u003Cp\u003E\nNope from those \u0022game changing\u0022 mods i have only Scansat and Remote Tech the rest of my addons is more of \u0022supportive\u0022 nature like KER, KAC, Docking Port Allignement, RCS Helper and the like.\n\u003C/p\u003E\n\u003Cp\u003E\nDont have any kind of lifesupport.... thats the reason it confuses me so much that this happens (and that I can reproduce it)\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-01-09T03:04:32Z","Content":"\n\u003Cp\u003E\nI\u0027ve had flags disappear from around the pad and runways, but not Kerbals yet. Then again I don\u0027t usually leave them sitting around, I tend to herd them back into the Astronaut Complex as soon as I switch back to KSC.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s too late tonight, but I\u0027ll se if I can run some tests with a new save. I\u0027ll report.\n\u003C/p\u003E\n"}]}