{"TopicId":130432,"ForumId":70,"TopicTitle":"Removed MechJeb for troubleshoot, now most of vessels gone","CreatedByName":"AnummaBrooke","CreatedById":156784,"CreatedDateTime":"2016-01-21T17:19:34Z","PageNum":1,"Articles":[{"CreatedByName":"AnummaBrooke","CreatedById":156784,"CreatedDateTime":"2016-01-21T17:19:34Z","Content":"\n\u003Cp\u003E\nThis was the series of actions:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nHad trouble in VAB with items not \u0022snapping.\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nThought, \u0022Well, try it without mods.\u0022 MechJeb is my only mod.\n\u003C/li\u003E\n\u003Cli\u003E\nQuit KSP and removed MechJeb from the GameData folder.\n\u003C/li\u003E\n\u003Cli\u003E\nRelaunched KSP, and received series of notices saying more or less \u0022[vessel x] not loaded because component missing.\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nQuit KSP, put MechJeb back into GameData folder.\n\u003C/li\u003E\n\u003Cli\u003E\nRelaunched KSP. All vessels that had used MechJeb have vanished, apparently permanently.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nAny hope for me? KSP 1.x, Mac, through Steam. Thanks!\n\u003C/p\u003E\n\u003Cp\u003E\n[Addition: Looking in my user folder, it looks like my only existing Quicksaves date from before January 4th. I\u0027m not sure, but that could certainly be when I first installed MechJeb.]\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-21T19:12:09Z\u0022 title=\u002201/21/2016 07:12  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 21, 2016\u003C/time\u003E by AnummaBrooke\u003C/strong\u003E\n\u003Cbr\u003Eadditional relevant information for help request\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2016-01-21T20:19:24Z","Content":"\n\u003Cp\u003E\nUnfortunately if you have not got another save and you did not quit immediately (using ALT-F4 or the task manager not the normal menu) when you got the warning message then yes, all your craft are gone permanently.\n\u003C/p\u003E\n\u003Cp\u003E\nIt will not help your current situation but I use the mod \u0060mechjeb and engineer for all\u0060 which gives you the function of mechjeb and engineer in all your pods and probe cores so you do not need to add the MJ part to your craft.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the future also you may wish to try Jebretary, a Git based version tool which backs up every save, quicksave and craft you make and you can go back through all the versions and restore whichever one you choose. There are other mods which have this function but this one works well and can be controlled through a web browser.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT : Next time you get that message, quit straight away using ALT-F4 or go to windows and close KSP. Don\u0060t go through the menu as that will save your game making all changes permanent.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-21T20:21:14Z\u0022 title=\u002201/21/2016 08:21  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 21, 2016\u003C/time\u003E by John FX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-01-21T21:34:28Z","Content":"\n\u003Cp\u003E\nYeah, unless you made backups, stuff is gone. In addition to managing backups, either yourself or with a mod, you might consider using that module manager patch that adds mechjeb to all pods. That way there is no part needed, and therefore you can add or remove mj at will.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n@PART[*]:HAS[@MODULE[ModuleCommand]]\u003Cbr\u003E\n{\u003Cbr\u003E\n    MODULE\u003Cbr\u003E\n    \u003Cbr\u003E\n    {\u003Cbr\u003E\n        \u003Cbr\u003E\n        name = MechJebCore\u003Cbr\u003E\n        \u003Cbr\u003E\n    \u003Cbr\u003E\n    }\u003Cbr\u003E\n}\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-21T21:38:42Z\u0022 title=\u002201/21/2016 09:38  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 21, 2016\u003C/time\u003E by Otis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AnummaBrooke","CreatedById":156784,"CreatedDateTime":"2016-01-22T02:55:38Z","Content":"\n\u003Cp\u003E\nThanks, John FX and Otis. I\u0027ll dig through my CrashPlan and see if I can recover more recent Quicksaves. If not, I\u0027ll have the fun of tweaking my vessels and re-launching them better than ever. I\u0027m a new user, so I only lost about 12 flights.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks to you both for easing my learning curve with tips on additional/alternative mods and quitting out with ALT-F4!\n\u003C/p\u003E\n\u003Cp\u003E\nBrooke\n\u003C/p\u003E\n"},{"CreatedByName":"AnummaBrooke","CreatedById":156784,"CreatedDateTime":"2016-01-22T19:47:39Z","Content":"\n\u003Cp\u003E\nIn case it helps any later readers of this thread:\n\u003C/p\u003E\n\u003Cp\u003E\nI did get my flights back, by restoring from backup. I replaced this folder (remember this is on the Mac, using Steam):\n\u003C/p\u003E\n\u003Cp\u003E\n[Computer User] \u0026gt; Library \u0026gt; Application Support \u0026gt; Steam \u0026gt; SteamApps \u0026gt; common \u0026gt; Kerbal Space Program \u0026gt; saves \u0026gt; [user/account name].\n\u003C/p\u003E\n\u003Cp\u003E\nNote that this reverts not only flights in progress, but also ships and subassemblies in the VAB.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks again!\n\u003C/p\u003E\n"}]}