{"TopicId":132630,"ForumId":70,"TopicTitle":"S. So yeahave starts up and puts camera on the side of the VAB, cannot do anything.","CreatedByName":"HaakonxDJM","CreatedById":159003,"CreatedDateTime":"2016-02-21T12:40:54Z","PageNum":1,"Articles":[{"CreatedByName":"HaakonxDJM","CreatedById":159003,"CreatedDateTime":"2016-02-21T12:40:54Z","Content":"\n\u003Cp\u003E\nI have a save that starts up and places the camera on the side of the VAB and I cannot do anything except the Warp to Morning button. I do not think my mods are to blame because I have another save with the exact same mods that is launching fine. I really do not want to start another save beacuse the first one I started got bugged and then I started a new one and THAT got bugged and now I started ANOTHER one and THAT got bugged. So... Help? Also, I put hyperjump beacons around Laythe, the Mun, and Minmus and landed on the Mun and Minmus so I do not want to start over. Help?\n\u003C/p\u003E\n"},{"CreatedByName":"Benoit Hage","CreatedById":104585,"CreatedDateTime":"2016-02-21T16:13:11Z","Content":"\n\u003Cp\u003E\nWe need your mod list and a screenshot would help too. Are you sure all the mods you use are up to date?\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2016-02-21T17:10:06Z","Content":"\n\u003Cp\u003E\nThat can sometimes happen. Hit Alt-F12 to open the debug menu and click on \u0022clear input lock stack,\u0022 that always clears it up for me.\n\u003C/p\u003E\n"},{"CreatedByName":"HaakonxDJM","CreatedById":159003,"CreatedDateTime":"2016-02-22T00:23:15Z","Content":"\n\u003Cp\u003E\nThanks, Clear Input Lock Stack fixed it.\n\u003C/p\u003E\n"},{"CreatedByName":"Cornholio","CreatedById":94349,"CreatedDateTime":"2016-02-23T20:05:41Z","Content":"\n\u003Cp\u003E\nI have experienced this issue before.  I noticed that the game would do this every time that I tabbed out of KSP while loading a career save from the main menu.  Staying tabbed in prevented this problem for me.\n\u003C/p\u003E\n"}]}