{"TopicId":133689,"ForumId":70,"TopicTitle":"Nothing working on launch pad","CreatedByName":"blackrabbit","CreatedById":125769,"CreatedDateTime":"2016-03-07T16:51:23Z","PageNum":1,"Articles":[{"CreatedByName":"blackrabbit","CreatedById":125769,"CreatedDateTime":"2016-03-07T16:51:23Z","Content":"\n\u003Cp\u003E\nI\u0027m using KSP v1.0.5 and my mods are up to date.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a bunch of mods installed and everything was been working fine for the last week until last night.  Last week I was playing with the Infernal Robotics mod and a satellite.  To test I either attach the probe to launch clamp and test the robotics on the launch pad or sometimes I use hyper edit to place the probe in orbit and test the robotics.  Then I revert back to the VAB to make changes, etc..\n\u003C/p\u003E\n\u003Cp\u003E\nEverything was working fine until last night.  I was messing around with Infernal Robotics and UKS.  In the past I\u0027ve used radial decouplers, Infernal Robotics, and some Kerbal Foundry treads to make some really colonies.  I land the UKS module, use the robotics to deploy the treads, drive the module like a rover, and once module is in place and properly docked/deployed with the other modules I use the decouplers to remove the treads from the module,  It works really nice.  Well last night things were acting strange.  I created the same module I usually create and hit launch so I could lest it on the launch pad.  Well the entire module was floating a tad above the launch pad, the robotics weren\u0027t working (even though I could hear the sound they make when they move when I tried to deploy the wheels), then when I decided to detach the decouplers they didn\u0027t do anything either, the boom sound from the decoupler happened by they didn\u0027t do anything.  I couldn\u0027t drive the module on the ground either like I have in the past.  I thought maybe something was glitched so I went back into the VAB and decided to try something.  I raised the module a bit higher off the ground and hung it from a launch clamp.  I hit launch again and decided to decouple the launch clamp and let the module fall on it\u0027s wheels.  Well I released the launch clamp and the module just hung in the air and nothing else worked.\n\u003C/p\u003E\n\u003Cp\u003E\nVery strange behavior as I had been launching rockets all day with no issue.  I only messed with it for about 15 minutes because it was late and I was tired.  I\u0027m going to try again when I get home from work today.  I was wondering if anyone else has had this issue?  I like to test rovers and things on the launch pad and I hope this was maybe just a bug because my game had been running for 8\u002B hours that day.  I was too tired last night to exit the game and re-run it and see if that fixed it but will try again tonight.\n\u003C/p\u003E\n"},{"CreatedByName":"blackrabbit","CreatedById":125769,"CreatedDateTime":"2016-03-08T16:01:10Z","Content":"\n\u003Cp\u003E\nNever mind.  I tried loading the craft into the SPH and launching it to the runway and everything was working fine there so I can now test my modules from there.\n\u003C/p\u003E\n"}]}