{"TopicId":144869,"ForumId":70,"TopicTitle":"Frame Drop in Modded KSP","CreatedByName":"scootz","CreatedById":167219,"CreatedDateTime":"2016-07-30T05:43:59Z","PageNum":1,"Articles":[{"CreatedByName":"scootz","CreatedById":167219,"CreatedDateTime":"2016-07-30T05:43:59Z","Content":"\n\u003Cp\u003E\nHi all! New to the forums here, but been playing KSP since almost the beginning off and on (~200 hrs now, so mostly off than on) but mostly stock. Recently, I\u0027ve gotten back into it with a heavily modded game, and everything has been going really smooth so far. I have been able to launch multiple craft (around 6-7 so far) without any issue. I recently received a contract to rescue a Kerbal that is in orbit around Kerbin, and so of course I launched a craft to rescue her. The problem, when I got close to the wreckage (~2.4 km, the physics loading distance) the framerate drops dramatically. I have no idea what could be causing this, because I haven\u0027t had any issues so far with frames (getting 60fps\u002B). Any ideas as to what is causing it? In the log file for KSP, I was getting errors saying that it was trying to load stuff from disk but it isn\u0027t there, could that be causing it and any tips on how to fix it? I tried to do some testing in sandbox, but the game crashed shortly after, so I\u0027ll try again, but thought I\u0027d see if any of you forum geniuses could help me out in the meantime! Also, I was taking a look at the memory/CPU usage and it was staying the same. Frame drop didn\u0027t follow from the craft either, when I go to the space center it returns to normal, so I have no idea what is going on and it is annoying :(. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere is the \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/102967651/KSP.log\u0022 rel=\u0022external nofollow\u0022\u003EOutput File\u003C/a\u003E, not exactly sure what is causing the FPS drop. Errors are at the bottom of the extremely long text wall. Let me know if I left anything out that could help you help me. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks,\n\u003C/p\u003E\n\u003Cp\u003E\n-scootz\n\u003C/p\u003E\n"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2016-07-30T10:22:03Z","Content":"\n\u003Cp\u003E\nThe more mods you have, the slower the frame rate will be, some mods are better behaved than others, a combination of mods will actually crash your computer... the same thing with frame rates.\n\u003C/p\u003E\n\u003Cp\u003E\nDump all the useless mods, add them back one at a time and eliminate the trouble makers. Its what I did... it does help.\n\u003C/p\u003E\n\u003Cp\u003E\nNot all mods are equal... some seriously slow down your computer.\n\u003C/p\u003E\n"},{"CreatedByName":"scootz","CreatedById":167219,"CreatedDateTime":"2016-07-30T19:29:39Z","Content":"\n\u003Cp\u003E\nWell, the problem is that the FPS is fine (60\u002B FPS) before I get close to this contract, but as soon as I get within 2.4ish km, it drops to around 1 FPS or less... All the mods are the same and nothing changed between launching everything else and even the mission that got close, but as soon as I got close it dropped.\n\u003C/p\u003E\n"},{"CreatedByName":"TheUnamusedFox","CreatedById":5606,"CreatedDateTime":"2016-08-01T21:24:32Z","Content":"\n\u003Cp\u003E\nI\u0027ve had the same issue with debris - even a single part, a stock part, unloading then loading, can cause the game to come to a screeching halt. I can\u0027t even reliably reproduce it, the lag comes and goes and on some instances of ksp doesn\u0027t happen at all.\n\u003C/p\u003E\n"}]}