{"TopicId":152059,"ForumId":70,"TopicTitle":"Why won\u0026#039;t my planes take off?","CreatedByName":"hollyfeld","CreatedById":121771,"CreatedDateTime":"2016-11-15T03:53:29Z","PageNum":1,"Articles":[{"CreatedByName":"hollyfeld","CreatedById":121771,"CreatedDateTime":"2016-11-15T03:53:29Z","Content":"\n\u003Cp\u003E\nI have a very frustrating, recurring problem with planes. I cannot get a simple plane down the runway without it losing yaw control and crashing! This has been a problem for me across many versions of KSP. I try tweaking everything I can think of: types/number of wheels, steering on wheels enabled/disabled, wing shape/size/placement, control surfaces size/placement/authority control/deployment, reaction wheels setting/quantity, engine quantity/size/placement, ...and probably more. I\u0027ve even tried with all three levels of runway; at level 3, the plane seems to take a little longer to start wobbling, but still does long before I reach a speed that will allow take-off. I\u0027m using only stock plane parts (see list of mods below).\n\u003C/p\u003E\n\u003Cp\u003E\nAAAARRRRGH! I have a Career Mode game with several contracts that require flying around Kerbin, and I can\u0027t even get off the %\u0026amp;*@! ground. Specifically, once my plane exceeds ~35 m/s, a yaw wobble begins that only gets worse as my speed increases. Eventually, my \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E cannot halt the swerving, and almost immediately my own keyboard control cannot override the swerving. I swing off the runway and crash. Every. Single. Time.\n\u003C/p\u003E\n\u003Cp\u003E\nMy KSP version is 1.2.1 (updated by Steam), and these are the mods I have: DMagic Orbital Science, Extraplanetary Launchpads, Firespitter (came bundled with \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E mods), SCANSat, Tarsier Space Technology, TweakScale, and six \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E mods (Asteroid Recycling Tech, Freight Transport Tech, Konstruction, Exploration Pack, Submarine Pack, and Modular Kolonization System). Also, below is a Dropbox link for my most recent plane design if anyone wishes to see it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/pfob9s7m77vrfsa/Exploration%20Plane.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/pfob9s7m77vrfsa/Exploration Plane.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-11-15T04:32:26Z","Content":"\n\u003Cp\u003E\nThe rear landing gear is too far back. It should be just behind the center of mass, so it\u0027s easier to tilt the plane up on it like a seesaw.\n\u003C/p\u003E\n\u003Cp\u003E\nThe craft has almost no pitch control. Try putting a horizontally-oriented control surface near the front or the back of the plane, or tilt those tailplanes more towards 45°.\n\u003C/p\u003E\n\u003Cp\u003E\nTry using just one forward landing gear instead of two. With a 2x2 setup like this, KSP planes tend to lose stability as one of the wheels slightly lifts off the ground and the other then imparts a yaw force.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022649659210A2AA92D132E98E25190F551E341C240\u0022 class=\u0022ipsImage\u0022 height=\u0022551\u0022 src=\u0022http://images.akamai.steamusercontent.com/ugc/154640637434358466/649659210A2AA92D132E98E25190F551E341C240/\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2016-11-15T08:57:47Z","Content":"\n\u003Cp\u003E\nRecurring questions like this is why I stared the FAQ.\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/127403-frequently-asked-questions/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nAt the same time I wonder why I even bothered to do it. Clearly people do not read it.\n\u003C/p\u003E\n"}]}