{"TopicId":155592,"ForumId":70,"TopicTitle":"Flipped upside-down Kerbin texture.","CreatedByName":"Baleurion","CreatedById":174262,"CreatedDateTime":"2017-01-26T04:57:29Z","PageNum":1,"Articles":[{"CreatedByName":"Baleurion","CreatedById":174262,"CreatedDateTime":"2017-01-26T04:57:29Z","Content":"\n\u003Cp\u003E\nFor some reason i\u0027ve started noticing that the orbit ground texture of Kerbin seems to be flipped upside down when i zoom out far enough from a flight in progress.\u003Cbr\u003E\nI see the normal terrain fade out into the upside-down orbit texture =/\n\u003C/p\u003E\n\u003Cp\u003E\nI do have quite a few mods but never had this issue until yesterday, and i havent really changed anything in terms of the mods or settings, tried without a few of them and the problem still persists. I\u0027m stumped.\u003Cbr\u003E\u003Cbr\u003E\nRunning with, among others, Scatterer, TextureReplacer, SVE, \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E, Kopernicus, OPM. But as i said, i ran all these without this issue a few days ago.\u003Cbr\u003E\nOnly today this problem occured, the only change i can remember doing was updating Scatterer to the latest 0.0300 version, but even removing Scatterer from GameData doesnt resolve it so i doubt it had anything to do with that. Tried removing TextureReplacer, no change. As for SVE, \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E, Kopernicus and OPM, no changes to those mods, no updates. Anyone got any ideas? Cheers.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Solved. Sigma-Binary was the mod that caused the issues.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-27T03:38:28Z\u0022 title=\u002201/27/2017 03:38  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 27, 2017\u003C/time\u003E by Baleurion\u003C/strong\u003E\n\u003C/span\u003E\n"}]}