{"TopicId":156905,"ForumId":70,"TopicTitle":"HUNGRY ASTEROID ATE MY SHIP... My ship attached to an Asteroid is now half inside the asteroid","CreatedByName":"Engineered Films","CreatedById":175202,"CreatedDateTime":"2017-02-24T09:10:49Z","PageNum":1,"Articles":[{"CreatedByName":"Engineered Films","CreatedById":175202,"CreatedDateTime":"2017-02-24T09:10:49Z","Content":"\n\u003Cp\u003E\nHey guys,\n\u003C/p\u003E\n\u003Cp\u003E\nSo... I captured my first asteroid using the grabber and I pushed it into a Kerbin orbit... I left it on it\u0027s journey to Kerbin with an alarm set and went off to other missions... I went to check on it days later and now the front half of the ship is inside the asteroid!\n\u003C/p\u003E\n\u003Cp\u003E\nIf I release the grabbers then the whole ship blows up, If I EVA a Kerbal I can fly them around inside the asteroid but they can\u0027t get out of it, nor can they get back into cockpit. I reloaded save file so the are back in cockpit now... I\u0027ve never lost a Kerbal and I\u0027ll be damned if I\u0027m gonna lose one now! lol... Is there a way to edit the save file so the vessel is back attached to the outside surface of the asteroid, or floating near it?... pics below showing attachment and heading back to Kerbin, and pics showing what I found days later when I checked up on it...(The last pic is simply moving the camera inside the asteroid allowing me to see the front of ship and I could EVA a kerbal and fly him around within his prison of space rock and metal \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot22.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://www.engineeredfilms.com.au/KSP/screenshot22.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot23.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://www.engineeredfilms.com.au/KSP/screenshot23.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot37.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://www.engineeredfilms.com.au/KSP/screenshot37.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot38.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://www.engineeredfilms.com.au/KSP/screenshot38.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbital","CreatedById":170602,"CreatedDateTime":"2017-02-24T15:15:49Z","Content":"\n\u003Cp\u003E\nMust be another bug. I flew an orbiter right through my space station once when trying to dock. Random explosions are a fact of life on Kerbin. Physics in their part of universe is really screwy.\n\u003C/p\u003E\n"},{"CreatedByName":"Dragonoid","CreatedById":164283,"CreatedDateTime":"2017-08-01T08:41:28Z","Content":"\n\u003Cp\u003E\nI\u0027m stuck also... \u003Cimg alt=\u0022-_-\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 title=\u0022-_-\u0022\u003E I\u0027ve tried cheats (Alt\u002BF12) to make parts \u0022unbreaking\u0022 but it still explodes when I release the claw! \u003Cimg alt=\u0022A5pVONi.png\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/A5pVONi.png\u0022 width=\u00221024\u0022\u003EThe only way I see fixing our ships is to edit the save files... Moving the Eatting-Asteroid in the save should be all we need to do? I\u0027ve never edited a mid flight ship via save before~\n\u003C/p\u003E\n\u003Cp\u003E\nCould an old save of the ship (if it was in the right position) be used to replace just the bad ship\u0027s save?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-08-01T08:42:44Z\u0022 title=\u002208/01/2017 08:42  AM\u0022 data-short=\u00226 yr\u0022\u003EAugust 1, 2017\u003C/time\u003E by Dragonoid\u003C/strong\u003E\n\u003Cbr\u003Eextra media\n\u003C/span\u003E\n"},{"CreatedByName":"Dragonoid","CreatedById":164283,"CreatedDateTime":"2017-08-01T09:36:00Z","Content":"\n\u003Cp\u003E\nAlright, if anyone wants to edit there save file to move the Asteroid the correct amount of away they need I have found out how:\n\u003C/p\u003E\n\u003Cp\u003E\nScott Manley\u0027s video helps explain the basics of how to edit saves: \u003Ca href=\u0022https://www.youtube.com/watch?v=0wXVm3M2I2w\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=0wXVm3M2I2w\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n1. Record the amount of mass the Asteroid you want to move has, mine has 97.97623t (you only need the first 5 numbers aka: 97.976) this is so you can find the right part to edit later.\n\u003C/p\u003E\n\u003Cp\u003E\n2. find your save file and open it in notepad. the file can be found at: C:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program\\saves\\(career_name)\\quicksave.sfs \n\u003C/p\u003E\n\u003Cp\u003E\n3. press Ctrl\u002Bf and search the mass you recorded earlier, you should see a part listed as \u0022name = PotatoRoid, position = -0.033608634024858475,12.991914749145508,0.046582106500864029\u0022 etc. This is the part you want to fix.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Edit the position, rotation etc. to move the Asteroid away from the ship (it will still be a \u0022part\u0022 of the ship, but it will no longer be clipping if moved far enough away) I just added 20 to the numbers: position = 20.033608634024858475,12.99...\n\u003C/p\u003E\n\u003Cp\u003E\n5. you should be able to disconnect the claw, or play with the position numbers to fine tune it\u0027s position.\n\u003C/p\u003E\n\u003Cp\u003E\nGood to the small amount of people who might chance ujpon this glitch. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}