{"TopicId":158033,"ForumId":70,"TopicTitle":"KSP ship physics are not working proporly","CreatedByName":"DrBojangles117","CreatedById":176119,"CreatedDateTime":"2017-03-21T22:31:27Z","PageNum":1,"Articles":[{"CreatedByName":"DrBojangles117","CreatedById":176119,"CreatedDateTime":"2017-03-21T22:31:27Z","Content":"\n\u003Cp\u003E\nI am playing KSP with a bunch of mods. the game was running fine and then i had a game crash. i had to re validate, update my drivers and restart my computer to be able to get KSP to load again. when it did finally load and i tried to launch a plane from my hangar but i was unable to lift off as my speed couldn\u0027t go above 13m/s. i know it was working before because i had no problem gaining speed and flying with the exact same plane i was using. i thought it could just be the liquid engines but when i loaded up my rocket fueled plane it had the same effect. i could not gain speed its as if the physics had been changed by a mod or something was affecting the atmosphere. i tried deleting my physics file and re validating but that didn\u0027t fix it either. i opened the console config with shift F12 or w/e it is and looked up the default values online and the numbers were the same? any ideas on what could be causing these physic issues? or mods that might tamper with physics? i dont have the real physics mod installed\u003Cbr\u003E\u003Cbr\u003E\nthanks\n\u003C/p\u003E\n"},{"CreatedByName":"DrBojangles117","CreatedById":176119,"CreatedDateTime":"2017-03-22T18:27:07Z","Content":"\n\u003Cp\u003E\ni thought it was kerbaloons but i re installed and loaded up again and it crashed again. now when the game is loading up it gets stuck on ubralspaceindastries/karbonite   please help\n\u003C/p\u003E\n"},{"CreatedByName":"DrBojangles117","CreatedById":176119,"CreatedDateTime":"2017-03-22T18:31:19Z","Content":"\n\u003Cp\u003E\nfor now i just removed \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E and karbonite but i would really like to play with these mods\n\u003C/p\u003E\n"},{"CreatedByName":"DoctorDavinci","CreatedById":150019,"CreatedDateTime":"2017-03-22T19:35:18Z","Content":"\n\u003Cp\u003E\nMight I suggest giving this a read as it will help you by explaining how to help us help you: \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83212-how-to-get-support-read-first/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}