{"TopicId":160904,"ForumId":70,"TopicTitle":"Anyone playing KSP on Ryzen 5? Any suggestions for performance improving?","CreatedByName":"skoy21","CreatedById":165850,"CreatedDateTime":"2017-05-21T18:41:44Z","PageNum":1,"Articles":[{"CreatedByName":"skoy21","CreatedById":165850,"CreatedDateTime":"2017-05-21T18:41:44Z","Content":"\n\u003Cp\u003E\nIt was time to upgrade my PC, so I went for a Ryzen 5 1600 \u002B Sapphire rx580 Nitro\u002B Limited Edidtion, and kept my Samsung 850 EVO\n\u003C/p\u003E\n\u003Cp\u003E\nI was and am playing 1.1.2, Modded with \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E\u002B\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E \u002B essential mods \u002B a few more.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP on the new PC is just a folder copy from the old PC (same install).\n\u003C/p\u003E\n\u003Cp\u003E\nGame loading improved greatly, with about 9 minutes on the old PC vs 2:30 to 3 minutes on the new, but everything else feels almost the same...\n\u003C/p\u003E\n\u003Cp\u003E\nSame launchpad loading times, same frame drop on flying bigish rockets, etc. \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E is a bit more responsive, but everything else feels kind of same.\n\u003C/p\u003E\n\u003Cp\u003E\nI didn\u0027t try a stock install, only modded.\n\u003C/p\u003E\n\u003Cp\u003E\nMy RX580 doesn\u0027t start the fans until it is pushed and start heating, and it never ever started the fans while playing KSP, and CPU was at 48C max temp. As if both CPU and GPU were not utilized at all...\n\u003C/p\u003E\n\u003Cp\u003E\nI also play ME Andromeda, which runs perfect with most settings on ultra high (as opposed to before, were it was straggling and glitching with the lowest settings)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETo the question\u003C/strong\u003E. Is there something that I can do to have some improvement on performance on KSP? Some setting etc to utilize my new system better? Maybe newer KSP versions like 1.2 will run better?\n\u003C/p\u003E\n\u003Cp\u003E\nI keep 1.1.2 for MOD compatibility, as I will have to rebuild most of my rockets if I change KSP version, and I try to avoid it. I spent hours and hours on building and fine-tunning my rockets and editing cfgs, have loads of orbiting satellites, and i am terrified to the idea of starting over, due to some not updated mods that I currently use)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E****IMPORTANT NOTICE:  \u003C/u\u003E \u003Cstrong\u003EDO NOT COMPARE INTEL \u0026amp; AMD HERE PLEASE\u003C/strong\u003E. If you want to, then start a new thread for that on \u003Cem\u003EThe Lounge\u003C/em\u003E section.****\n\u003C/p\u003E\n"},{"CreatedByName":"Pena","CreatedById":140790,"CreatedDateTime":"2017-05-21T19:08:38Z","Content":"\n\u003Cp\u003E\nUpdate to the latest version. 1.2 runs way, way faster on any hardware.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2017-05-21T20:00:35Z","Content":"\n\u003Cp\u003E\nYou can try using MemGraph to reduce GC stutters, but other than that and keeping part counts low, there\u0027s not really all that much that can be done. KSP is what it is, a CPU-hungry beast that has to do far more rigid-body physics on the CPU than almost any other game.\n\u003C/p\u003E\n\u003Cp\u003E\nWith low-part-count vehicles, it should play very smoothly. With larger part counts, a higher-end CPU should let you squeeze out a little extra performance, but you still have the issue that CPU load grows faster than number of parts on a vessel: I\u0027m not sure exactly what algorithms Unity\u0027s physics engine uses, but I am pretty sure it\u0027s worse than O(n).\n\u003C/p\u003E\n\u003Cp\u003E\nThe Intel chips might have had a slight edge for KSP, on account of having better single-thread performance, but it would hardly be a deal-breaker. KSP can do a little bit of offloading, but the primary limiting factor has always been the main thread.\n\u003C/p\u003E\n"},{"CreatedByName":"skoy21","CreatedById":165850,"CreatedDateTime":"2017-05-21T20:24:16Z","Content":"\n\u003Cp\u003E\nThanks for the suggestion... Deep down, I know that this will definitely have an improvement impact. I hoped to avoid it, but I don\u0027t think I can avoid it forever...\n\u003C/p\u003E\n\u003Cp\u003E\nI will give it a try though, and check my mod lists\n\u003C/p\u003E\n"},{"CreatedByName":"skoy21","CreatedById":165850,"CreatedDateTime":"2017-05-21T20:34:30Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Ca data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0026amp;do=hovercard\u0026amp;referrer=http%253A%252F%252Fforum.kerbalspaceprogram.com%252Findex.php%253F%252Ftopic%252F160904-anyone-playing-ksp-on-ryzen-5-any-suggestions-for-performance-improving%252F\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0022 style=\u0022color:inherit;\u0022 title=\u0022Go to Starman4308\u0027s profile\u0022 rel=\u0022\u0022\u003EStarman4308\u003C/a\u003E \u003C/strong\u003EThanks for the suggestions and info as well.\u003Cstrong\u003E \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI will try MemGraph and keep it in mind for next installs, i hadn\u0027t heard of it before. As for the part count, I have spent hours deleting unused parts from my mods, and stripped them down to my necessaries.\n\u003C/p\u003E\n\u003Cp\u003E\nAs you said, with lower part rockets, things are ok, but with the bigger ones, i drop to 2 -10 fps\n\u003C/p\u003E\n"},{"CreatedByName":"LoSBoL","CreatedById":174038,"CreatedDateTime":"2017-05-22T07:39:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223063533\u0022 data-ipsquote-contentid=\u0022160904\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495398256\u0022 data-ipsquote-userid=\u0022165850\u0022 data-ipsquote-username=\u0022skoy21\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, skoy21 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks for the suggestion... Deep down, I know that this will definitely have an improvement impact. I hoped to avoid it, but I don\u0027t think I can avoid it forever...\n\u003C/p\u003E\n\u003Cp\u003E\nI will give it a try though, and check my mod lists\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPena is right, KSP transfered to Unity 5.4 which greatly improves multicore usage, I can see great utilization on 4 cores/8 threads, 6 cores probably do even better. So you\u0027re cheating yourself out of performance staying on 1.1.2\n\u003C/p\u003E\n\u003Cp\u003E\nBottleneck will always be the partcount though, no matter how fast a CPU you\u0027ll run. It\u0027s something we all need to accept.\u003Cbr\u003E\u003Cbr\u003E\nI guess I don\u0027t have to tell you that you can run multiple installs on the same PC, so no need to delete your 1.1.2 install, so you could be compare with 1.2.2 easily.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-22T07:43:20Z\u0022 title=\u002205/22/2017 07:43  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 22, 2017\u003C/time\u003E by LoSBoL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PT","CreatedById":154223,"CreatedDateTime":"2017-05-22T11:25:56Z","Content":"\n\u003Cp\u003E\nThere are two mods that can help. (Well, helped me)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/50911-12-kerbal-joint-reinforcement-v331-102916/\u0022 rel=\u0022\u0022\u003EKerbal Joint Reinforcement\u003C/a\u003E reduces physics problems on large crafts, less wobbling seems to have positive result on my rig (performance-wise should be similar). I have not made any fps graphs so it could be just smoother maneuvering rather than performance itself, but since installing it docking motherships to space stations became much better experience. And of course less structural parts equals... less parts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/96670-122-250-2016-12-28-ubiozur-welding-ltd-continued/\u0022 rel=\u0022\u0022\u003EPart welding mod\u003C/a\u003E, although bothersome in usage, can help if you are using stuff like space carriers with \u0022spinal columns\u0022 made out of structural parts.\n\u003C/p\u003E\n\u003Cp\u003E\nAs Starman mentioned, performance penalty for each part is closer to exponential than linear, so when approaching limits of what your rig can run at smooth 60 shaving dozen parts out of few hundreds can have noticeable effect. \u003Ca href=\u0022http://www.cpuid.com/softwares/hwmonitor.html\u0022 rel=\u0022external nofollow\u0022\u003EHWInfo\u003C/a\u003E can help you monitor CPU/GPU usage/temperature.\n\u003C/p\u003E\n\u003Cp\u003E\n(You have not mentioned RAM, I hope you have enough to avoid paging to disk? Are you running 64bit or 32bit KSP?)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-22T11:36:00Z\u0022 title=\u002205/22/2017 11:36  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 22, 2017\u003C/time\u003E by PT\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"skoy21","CreatedById":165850,"CreatedDateTime":"2017-05-22T18:01:41Z","Content":"\n\u003Cp\u003E\nHi PT, thanks for the input!\n\u003C/p\u003E\n\u003Cp\u003E\nI would\u0027t dare play without Kerbal Joint reinforcement. Once, it broke, and all my rockets/ships broke with it...\n\u003C/p\u003E\n\u003Cp\u003E\nPart welding is a tool that is probably going to help me a lot, since I do use a lot of parts. I will definitely try this one.\n\u003C/p\u003E\n\u003Cp\u003E\nHWinfo always runs behind my games to ckeck things, that\u0027s why I said that it is like not utilizing the GPU at all, and the CPU is not to busy either. As for my memory, it\u0027s 2x8G Vengence DDR4, it shouldn\u0027t be the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nLoSBol, probably i am going to update my install, i don\u0027t see how I can avoid it anymore.\n\u003C/p\u003E\n\u003Cp\u003E\nI have already many installs with different mods for different ships, but I finally got to the point that I have all my satellites in place, my stations etc, in this particular install. And 1.2.2 is still a pain to install all Realism overhaul related mods, but probably the only way...\n\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2017-05-22T20:31:15Z","Content":"\n\u003Cp\u003E\nWhat frequency are you running your memory at (and what\u0027s it designed to run at)?\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t own a Ryzen, but I\u0027m looking into it, and it seems they\u0027re very sensitive to memory speeds. Unfortunately, they\u0027ve also had real issues running memory at any decent speed (e.g. above 2400mhz, while Intel systems will handle up to 4000). There are some beta bios updates starting to appear for a few enthusiast boards and people are reporting being able to take it up as high as 3700, which may provide a significant increase in performance. Hopefully these updates will start to appear for more boards as time passes \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThat aside, KSP 1.2 was a significant performance boost for just about everyone. On smaller vessels it is almost eerily smooth, although upwards of 200 parts does still exact a penalty. It would be worth making the effort to find up-to-date versions of mods and seeing whether you can live without the vessels that get deleted after an upgrade, as this is certainly cheaper than super-fast memory \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lancefoxcia","CreatedById":10699,"CreatedDateTime":"2017-05-22T20:57:57Z","Content":"\n\u003Cp\u003E\nI own a Ryzen 7 1700 cpu, Upgrading to 1.2.2 improved framerates a lot.\u003Cbr\u003E\nKerbal Join reinforcement works in 1.2.2\u003Cbr\u003E\u003Cbr\u003E\nand I\u0027m using a lot of mods as well.\u003Cbr\u003E\u003Cbr\u003E\nBDarmory and assortment of mods with it.\u003Cbr\u003E\u003Cbr\u003E\nI had 1.1.2 and then upgraded to 1.2.2 and by doing that frame times improved because of the better multithreading\n\u003C/p\u003E\n"},{"CreatedByName":"skoy21","CreatedById":165850,"CreatedDateTime":"2017-05-22T21:20:44Z","Content":"\n\u003Cp\u003E\nMy memory is Corsair 3200 Vengeance, currently running stable at 2400.\n\u003C/p\u003E\n\u003Cp\u003E\nI am updating to 1.2.2, and up to this point I have installed all the dependencies of Realism Overhaul and \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E and a few that are absolutely minimum for me, and already have 1.75 Gb of Game Data.\n\u003C/p\u003E\n\u003Cp\u003E\nI will try it tomorrow and see how it goes.\n\u003C/p\u003E\n"},{"CreatedByName":"lancefoxcia","CreatedById":10699,"CreatedDateTime":"2017-05-22T21:39:50Z","Content":"\n\u003Cp\u003E\nI have G.skill Aegis Ram, Stable at 2933\u003Cbr\u003E\nThough I have 32gb only because of the insane work I do.\u003Cbr\u003E\u003Cbr\u003E\nBut yeah It works very well.\n\u003C/p\u003E\n"},{"CreatedByName":"PT","CreatedById":154223,"CreatedDateTime":"2017-05-22T21:45:07Z","Content":"\n\u003Cp\u003E\nI read in few places that Windows still have issues with thread/core scheduling on Ryzen platform, Linux kernel 4.10 is supposed to have Ryzen support. It might be part of issues as KSP is mostly limited by CPU power.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat fps do you, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/10699-lancefoxcia/\u0026amp;do=hovercard\u0022 data-mentionid=\u002210699\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/10699-lancefoxcia/\u0022 rel=\u0022\u0022\u003E@lancefoxcia\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/165850-skoy21/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022165850\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/165850-skoy21/\u0022 rel=\u0022\u0022\u003E@skoy21\u003C/a\u003E, get at, for example, 255, 300 and 600 parts on launch pad? Respectively I got 40, 25 and fluctuating 16 on my rig. Your R5 and R7 should reach similar results from what I see of their stats. Can you check it on some Linux?\n\u003C/p\u003E\n\u003Cp\u003E\n(I\u0027ll check with MemGraph tomorrow)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EFor reference: stock \u003Ca href=\u0022/cdn-cgi/l/email-protection\u0022 class=\u0022__cf_email__\u0022 data-cfemail=\u00220148362c373631314a41352f313146497b\u0022\u003E[email\u0026#160;protected]\u003C/a\u003E (please don\u0027t lynch me :D), 16GB DDR4@2400MHz, modest GTX1060, obligatory SSD and a lot of mods, so it should be similar - updating KSP to 1.2 was huge performance gain here as well.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"lancefoxcia","CreatedById":10699,"CreatedDateTime":"2017-05-22T22:14:51Z","Content":"\n\u003Cp\u003E\nI don\u0027t run Linux. However I do pair my Ryzen 7 with a GTX 1080, and as anything. On the Launch pad I get around 120fps with just 1 vehicle. However if I have 12 war tanks it\u0027ll drop to about 20-30fps\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00221J3lVT2.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022575\u0022 src=\u0022http://i.imgur.com/1J3lVT2.jpg\u0022 width=\u00221024\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nEdit: Saw your little text stating intel. Lel I don\u0027t mind either AMD or intel. I just need a lot of cores. Amd had a good price to core ratio so I got it. Now I\u0027m going to get me threadripper or epyc when it comes out. Lol\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-22T22:16:54Z\u0022 title=\u002205/22/2017 10:16  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 22, 2017\u003C/time\u003E by lancefoxcia\u003C/strong\u003E\n\u003Cbr\u003EDidn\u0026#039;t see small Text so went ahead and responded to small text.\n\u003C/span\u003E\n"},{"CreatedByName":"LoSBoL","CreatedById":174038,"CreatedDateTime":"2017-05-23T11:01:26Z","Content":"\n\u003Cp\u003E\nPT\u0027s reply made me remember reading several reviews that the windows power state settings do having a big influence on performance because of \u0027core parking\u0027. I too have the experience that it makes a big difference in that \u0027Performance mode\u0027 drastically improves performance over \u0027Standard mode\u0027 even on Intel.  I read that AMD (or was it Microsoft?) released a specific powersettings profile for Ryzen CPU\u0027s.\u003Cbr\u003E\u003Cbr\u003E\nCould be that you\u0027ve already \u0027been there, done that\u0027 though.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PT","CreatedById":154223,"CreatedDateTime":"2017-05-23T13:19:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223065019\u0022 data-ipsquote-contentid=\u0022160904\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495537286\u0022 data-ipsquote-userid=\u0022174038\u0022 data-ipsquote-username=\u0022LoSBoL\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, LoSBoL said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPT\u0027s reply made me remember reading several reviews that the windows power state settings do having a big influence on performance because of \u0027core parking\u0027. ...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI was thinking about Ryzen issues on Windows being caused by new architecture, which makes Windows cpu core manager go nuts. I can\u0027t find good, yet simple, technical description so here is \u003Ca href=\u0022https://www.reddit.com/r/Amd/comments/5ybrxn/ryzen_7_is_actually_behaving_like_a_dual_4c8t/\u0022 rel=\u0022external nofollow\u0022\u003Ereddit thread with some info\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIn great simplification, (some?) Ryzens are pretty much two CPU\u0027s in one slot, while Windows have multi-cpu support for quite some years it seems to fail to understand how to schedule threads to cores on Ryzen (I guess it presents itself as single CPU, can \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/10699-lancefoxcia/\u0026amp;do=hovercard\u0022 data-mentionid=\u002210699\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/10699-lancefoxcia/\u0022 rel=\u0022\u0022\u003E@lancefoxcia\u003C/a\u003E check on your Ryzen 7?).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#292f34;\u0022\u003ECommunication between cores on the same CCX is done through the local cache and is at worst 175GB/sec (L3 cache speed). However if a thread on CCX0 depends on a thread on CCX1, you need go communicate through the \u0022slow\u0022 22GB/sec Infinity fabric. So you don\u0027t want a thread on CCX0 to depend on a thread on CCX1.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThreads can switch between cores on new CPU/OS to maximize CPU utilization (\u003Ca href=\u0022http://imgur.com/a/c4ZlL\u0022 rel=\u0022external nofollow\u0022\u003Esingle thread running on four logical cores\u003C/a\u003E), but when core switching decisions are made poorly it may result in horrible performance (for example due to \u003Ca href=\u0022https://en.wikipedia.org/wiki/CPU_cache#Cache_miss\u0022 rel=\u0022external nofollow\u0022\u003Ecatch misses\u003C/a\u003E).  If you can identify which core lies on which CCX on Ryzen (if you have more than one CCX, that is), you might try to use Core Affinity to limit game to single CCX.\n\u003C/p\u003E\n\u003Cp\u003E\nBack to KSP itself, each of us should prepare stock (for easy sharing) craft with part count just on border of stable 60fps in clean save, then we should be able to compare game performance and effect of mods on fps/gc jitter. (gimme few hours to get back to my rig :\u0026gt;).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-23T13:21:19Z\u0022 title=\u002205/23/2017 01:21  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 23, 2017\u003C/time\u003E by PT\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"skoy21","CreatedById":165850,"CreatedDateTime":"2017-05-24T18:33:35Z","Content":"\n\u003Cp\u003E\nI made a test with a 410 part /98 engines rocket, in 1.1.2 \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E \u002B Ro and had 5 FPS on launchpad and 1 to 4 after launch.\n\u003C/p\u003E\n\u003Cp\u003E\nI also built the same simple two stage, 28 parts rocket in both 1.1.2 and 1.2.2 stock. The results were constant 30 FPS on 1.1.2 and constant 60 FPS on 1.2.2. 30 FPS for just changing KSP version.\n\u003C/p\u003E\n\u003Cp\u003E\nAs \u003Cstrong\u003EPena\u003C/strong\u003E, \u003Cspan\u003E\u003Cstrong\u003ELoSBoL\u003C/strong\u003E\u003C/span\u003E and \u003Cstrong\u003E\u003Cspan\u003Elancefoxcia\u003C/span\u003E \u003C/strong\u003Esaid, there is huge difference between the two versions in terms of performance. I never thought it would be double the FPS. I did expect some improvement, but not that much.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPT\u003C/strong\u003E, I will build a 255 stock parts rocket in 1.2.2, post FPS on Launchpad and after launch, and share it if anybody wants to check their FPS with that one..\n\u003C/p\u003E\n"},{"CreatedByName":"LoSBoL","CreatedById":174038,"CreatedDateTime":"2017-05-25T19:16:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223066381\u0022 data-ipsquote-contentid=\u0022160904\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495650815\u0022 data-ipsquote-userid=\u0022165850\u0022 data-ipsquote-username=\u0022skoy21\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎24‎-‎5‎-‎2017 at 8:33 PM, skoy21 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI made a test with a 410 part /98 engines rocket, in 1.1.2 \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E \u002B Ro and had 5 FPS on launchpad and 1 to 4 after launch.\n\u003C/p\u003E\n\u003Cp\u003E\nI also built the same simple two stage, 28 parts rocket in both 1.1.2 and 1.2.2 stock. The results were constant 30 FPS on 1.1.2 and constant 60 FPS on 1.2.2. 30 FPS for just changing KSP version.\n\u003C/p\u003E\n\u003Cp\u003E\nAs \u003Cstrong\u003EPena\u003C/strong\u003E, \u003Cspan\u003E\u003Cstrong\u003ELoSBoL\u003C/strong\u003E\u003C/span\u003E and \u003Cstrong\u003E\u003Cspan\u003Elancefoxcia\u003C/span\u003E \u003C/strong\u003Esaid, there is huge difference between the two versions in terms of performance. I never thought it would be double the FPS. I did expect some improvement, but not that much.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPT\u003C/strong\u003E, I will build a 255 stock parts rocket in 1.2.2, post FPS on Launchpad and after launch, and share it if anybody wants to check their FPS with that one..\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDouble the performance, wow! That\u0027s perfect!\u003Cbr\u003E\u003Cbr\u003E\nWhat I would be truly interested in, is if there is a gain in performance when playing on one core complex?\n\u003C/p\u003E\n"},{"CreatedByName":"skoy21","CreatedById":165850,"CreatedDateTime":"2017-06-01T19:50:58Z","Content":"\n\u003Cp\u003E\nI ran v 1.2.2 with two cores enabled (I can only disable pairs of cores with RyzenMaster, didn\u0027t try through BIOS) and didn\u0027t see much of a drop in FPS with low part vessels, I was always above 56 FPS, but didn\u0027t test higher part vessels to stress the CPU a bit more.\n\u003C/p\u003E\n\u003Cp\u003E\nI tried changing number of cores assigned to KSP through affinity. It was better with 2 processing units working on KSP rather than with any other combination. But the best results were with all six cores enabled by default (12 processing units enabled)\n\u003C/p\u003E\n\u003Cp\u003E\nBut it was a great improvement just by switching versions, even with a lot of plugins installed (2.08 Gigs of GameData and about 4 minutes of loading the game). I also managed to run my memory @ 2993MHz, so I will make some more tests.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately for me though, I cannot switch to 1.2.2 yet, since \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E is still a WIP for 1.2 and things are not quite playable... So I have to stick with 1.1.2 for now and bare with the lag...\n\u003C/p\u003E\n"}]}