{"TopicId":165644,"ForumId":70,"TopicTitle":"Fuel cell in RO","CreatedByName":"Perry Apsis","CreatedById":97519,"CreatedDateTime":"2017-09-19T03:31:39Z","PageNum":1,"Articles":[{"CreatedByName":"Perry Apsis","CreatedById":97519,"CreatedDateTime":"2017-09-19T03:31:39Z","Content":"\n\u003Cp\u003E\nI think maybe a tweak got un-twuck. I have \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E installed, and the fuel cells show that they require Liquid Hydrogen, Liquid Oxygen, LiquidFuel, and Oxidizer. I attach one to the side of a tank that contains LH2 and LOX, and it says \u0022Fuel Cell: Missing LiquidFuel.\u0022 The same is true for both the fuel cell and the fuel cell array.\n\u003C/p\u003E\n\u003Cp\u003E\nI was considering editing the parts manually, but then I thought I\u0027d consult the collective wisdom of the Internet to see if there was a better approach.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks in advance for any light you can shed.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT:\n\u003C/p\u003E\n\u003Cp\u003E\nI did eventually find the source parts and removed the LiquidFuel and Oxidizer inputs. Some \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E patch adds in LH2 and LOX, so now it\u0027s working fine, but I imagine some upgrade or patch will break it one day.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-19T06:03:47Z\u0022 title=\u002209/19/2017 06:03  AM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 19, 2017\u003C/time\u003E by Perry Apsis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"itsaps","CreatedById":172256,"CreatedDateTime":"2018-01-02T21:45:37Z","Content":"\n\u003Cp\u003E\nHello, maybe a little late but here is what I found out in my \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E version:\n\u003C/p\u003E\n\u003Cp\u003E\nThe cells work fine with hydrogen and oxygen (both not liquid!) but the problem is the storage density of them which requires huge tanks for storing a decent amount... But there is a slow rate of conversion (and I\u0027m currently searching for it\u0027s origin, might be realheat) between LH2 to H2 and LOX to OX if you have both tanks and the not-liquid one was drained. Actually this transfer happens at a very low rate and I think this is now only practicle for emergency power source rather than long duration electric supply from fuel cells....\n\u003C/p\u003E\n"}]}