{"TopicId":168918,"ForumId":70,"TopicTitle":"Vanilla interface limitation?","CreatedByName":"MisterFister","CreatedById":85686,"CreatedDateTime":"2017-12-26T05:34:56Z","PageNum":1,"Articles":[{"CreatedByName":"MisterFister","CreatedById":85686,"CreatedDateTime":"2017-12-26T05:34:56Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022 xml:lang=\u0022en\u0022\u003E\nFolks, I happen to be a self-admonished mod-addict.  However, there is a limitation in the stock GUI when you\u0027re beginning a new career save, where the \u0022cancel\u0022 and \u0022[accept]\u0022 buttons automatically position off-window in the lower-right.  However, there is a maximum north-travel of screen real estate to reposition the dialog box, such that with a long list of mods with difficulty-settings, it\u0027s off-screen and thereby inaccessible.\u003Cbr\u003E\u003Cbr\u003E\nThe only way for me to manage past this (since I had no interest in using stock-values in my career, and no interest in starting with stock values to therefore need to manually edit whatever config files would\u0027ve been at issue after starting) was for me to literally uninstall a handful of mods that involved settings I didn\u0027t want to change so as to free up scroll-space to allow me to access the [accept] button.  From there, I ran KSP, set my difficulty sliders the way I liked them, created the save, immediately exited out, and re-installed the other mods, playing from there.\n\u003C/blockquote\u003E\n\u003Cblockquote lang=\u0022en\u0022 xml:lang=\u0022en\u0022\u003E\n \n\u003C/blockquote\u003E\n\u003Cblockquote lang=\u0022en\u0022 xml:lang=\u0022en\u0022\u003E\n\u003Ca href=\u0022https://www.dropbox.com/sh/9jzn4gyh7qrrfhw/AABvjBSlUUE9VAzxBujIBUxaa?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/sh/9jzn4gyh7qrrfhw/AABvjBSlUUE9VAzxBujIBUxaa?dl=0\u003C/a\u003E\u003Cbr\u003E\nPlease note my logfile, my .\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003Eckan\u003C/abbr\u003E modlist (I also run a manually-installed dev-version of KCT) and two images.  Here, the pertinent image is \u002220171225 modlist.jpg\u0022.\u003Cbr\u003E\u003Cbr\u003E\nNote that in this image, the dialog box was repositioned to the maximum upper-left that the mouse travel would allow.  There is a rather ample amount of screen margin seemingly unused, and please note that I don\u0027t actually know how long my button-list \u0022would have been,\u0022 so I can\u0027t even be sure that maximum edge-access would even have been sufficient.\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nWould it be possible for the next patch of base-KSP to address this?  Either reposition the buttons in the upper-right quadrant entirely, or to instead allow for the entire screen to be scrolled?  I attempted multiple screen resolutions, and all (including my 1920x1200, including side-monitor repositioned within Windows to allow for vertical spillover) were unable to help me actually begin my save with all mods installed simultaneously.\u003Cbr\u003E\u003Cbr\u003E\nOther technical info available by request.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-26T06:40:08Z\u0022 title=\u002212/26/2017 06:40  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 26, 2017\u003C/time\u003E by MisterFister\u003C/strong\u003E\n\u003Cbr\u003EDropbox link to pertinent info.\n\u003C/span\u003E\n"}]}