{"TopicId":171512,"ForumId":70,"TopicTitle":"Procedural Parts Freeze","CreatedByName":"Stefflor","CreatedById":185902,"CreatedDateTime":"2018-03-01T00:39:07Z","PageNum":1,"Articles":[{"CreatedByName":"Stefflor","CreatedById":185902,"CreatedDateTime":"2018-03-01T00:39:07Z","Content":"\n\u003Cp\u003E\nHi guys. This is my first post, as I made my account specifically to ask about a big issue I\u0027m having with this mod. (Note that this is technically my 2nd post, since I already posted this without the Log on \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/169250-131-procedural-parts-tidal-stream-branch/\u0022 rel=\u0022\u0022\u003Ethis\u003C/a\u003E page)\n\u003C/p\u003E\n\u003Cp\u003E\nFirst of all, I\u0027m playing KSP 64bit on OSX and recently managed to install \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E using Mono. Procedural Parts is really what got me hyped up for KSP again. Its my dream mod. I\u0027ve successfully installed many mods using \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E and also tried to install this mod on KSP Version 1.3. However, my game freezes in the loading screen every time I try to use procedural parts (It happens when I want to launch a rocket after assembling it using procedural parts). The game doesn\u0027t crash, it freezes and becomes unresponsive, which forces me to force quit the app. I\u0027ve tried to find people having the same issue online, but can\u0027t seem to find anything. I\u0027ve tried to launch the game with only this mod installed and it STILL happens.. on version 1.3, as well as 1.3.1 (I used this version of the mod for 1.3.1). All tries were done with a clean install of the game. I just don\u0027t know what the issue could be. It would be greatly appreciated if someone could help me out here!! You would really make my week\n\u003C/p\u003E\n\u003Cp\u003E\nThanks in advance!\n\u003C/p\u003E\n\u003Cp\u003E\nUnity Log: \u003Ca href=\u0022https://www.dropbox.com/s/pe2l5fkdp3i7oeb/Player.log?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/pe2l5fkdp3i7oeb/Player.log?dl=0\u003C/a\u003E\n\u003C/p\u003E\n"}]}