{"TopicId":174385,"ForumId":70,"TopicTitle":"How to Play","CreatedByName":"IDontKnowJack","CreatedById":188419,"CreatedDateTime":"2018-04-29T02:45:10Z","PageNum":1,"Articles":[{"CreatedByName":"IDontKnowJack","CreatedById":188419,"CreatedDateTime":"2018-04-29T02:45:10Z","Content":"\n\u003Cp\u003E\nhey guys, so i downloaded bda mod.\n\u003C/p\u003E\n\u003Cp\u003E\nThis game is not user friendly.  is there anyone with skype or discord that can help me live? I dont need the basic function how to get things going. i want to setup up auto pilot but when i watched a video my setting doesnt appear the exactly same way. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\ni want to setup auto pilot and patriot missile on different team but when i tried to use the map view it said i cant switch my craft is in atmosphere. when i tired to use space center or tracking center its in orange and it said it will revert my craft back to beginning. \n\u003C/p\u003E\n\u003Cp\u003E\nall the video i watch on youtube where those guys skipped the detail how to get two craft running at the same time lol. i understand how to use the radar etc but basic function is no where to be found\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-04-29T03:48:43Z","Content":"\n\u003Cp\u003E\nThread moved to Support, since it\u0027s seeking help rather than offering it. \n\u003C/p\u003E\n\u003Cp\u003E\nSorry, I don\u0027t use that mod, myself. \n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-04-29T08:24:23Z","Content":"\n\u003Cp\u003E\nBest answer: Read the mod thread, most of the answers can be found there.    There are also tutorials in the tutorial forum that will answer your questions.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223366700\u0022 data-ipsquote-contentid=\u0022174385\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524969910\u0022 data-ipsquote-userid=\u0022188419\u0022 data-ipsquote-username=\u0022IDontKnowJack\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, IDontKnowJack said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni want to setup up auto pilot but when i watched a video my setting doesnt appear the exactly same way. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIIRC, most of the videos for BDA are for older versions, but the basics still apply.   That mod gets enough frequent updates that doing making a new video each time would be very cumbersome. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223366700\u0022 data-ipsquote-contentid=\u0022174385\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524969910\u0022 data-ipsquote-userid=\u0022188419\u0022 data-ipsquote-username=\u0022IDontKnowJack\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, IDontKnowJack said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni want to setup auto pilot and patriot missile on different team but when i tried to use the map view it said i cant switch my craft is in atmosphere. when i tired to use space center or tracking center its in orange and it said it will revert my craft back to beginning. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nStock won\u0027t allow you to switch between craft while you are in flight.  You should setup your AP\u0027s before you take off, and then switch teams on the craft you are flying later to activate the defenses.  Someone will correct me on this, because I can usually switch in flight, but I\u0027m not sure how I do this :D.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223366700\u0022 data-ipsquote-contentid=\u0022174385\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221524969910\u0022 data-ipsquote-userid=\u0022188419\u0022 data-ipsquote-username=\u0022IDontKnowJack\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, IDontKnowJack said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nall the video i watch on youtube where those guys skipped the detail how to get two craft running at the same time lol.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs I mentioned setup all your AP\u0027s before you take off.  \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are setting up a ground defense station, just enable all the team and firing settings when you deploy it.  It will automatically come alive when it detects an enemy craft.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are setting up an enemy fighter, make sure it has both the BDA weapons manager and AP modules onboard.   Launch the craft to the runway from the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, and then gently steer it off to the side onto the flat grass, aiming away from anything it can run into.  Set the brake, throttle down.  Open the AP module and set all your flight limits if you want to change them.  The \u0027stock\u0027 settings usually work fine, until you want them different.  Set the WM settings to whatever you need, I usually leave it on team A.\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch your second plane, set the AP as you need if you want to have the computer fly it, or not if you are going to fly it.  Start your take off, and immediately switch to Team B.  This will trigger the drone plane to start it\u0027s take off roll, within a few seconds.  \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are trying to fly against a ground station, wait till you are on your attack run to switch teams, as switching teams during your take off roll will get you blasted before you even take off. \n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t played in a year or so, but that is how I used to do it.   Just mess with the settings until you\u0027re happy.  If you can\u0027t get the fighter\u0027s to fly with you, there\u0027s usually some stupid reason for it.  Engine\u0027s not enable, autopilot not enabled, etc.   It\u0027s what usually get\u0027s me. \n\u003C/p\u003E\n"},{"CreatedByName":"IDontKnowJack","CreatedById":188419,"CreatedDateTime":"2018-04-29T10:52:41Z","Content":"\n\u003Cp\u003E\nthanks, ill give it a try when i get home. i do notice each version doesnt support  older craft. i downloaded all those cool craft like the aegies destroyer etc and it wont work on the new ksp bda version bummer.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nthis is type of game that i would love to donate to those cool guys who mod the game to perfection. i can see it happening. \n\u003C/p\u003E\n"}]}