{"TopicId":174673,"ForumId":70,"TopicTitle":"Can\u0026#039;t click buildings in 1.4.3, can click them in 1.4.1","CreatedByName":"IncKursion","CreatedById":5706,"CreatedDateTime":"2018-05-06T11:15:58Z","PageNum":1,"Articles":[{"CreatedByName":"IncKursion","CreatedById":5706,"CreatedDateTime":"2018-05-06T11:15:59Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EEDIT: I solved this myself, the issue turned out to be my own fault! I\u0027ve answered it below.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf I load my save game (sandbox) in 1.4.3 and click on either the Spaceplane Hangar,  Tracking Station or \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, nothing happens. If I click on the Runway or Launchpad I get the windows to select a craft, but nothing happens when I click Launch. Additionally, the Quit To Main Menu button on the pause menu has become completely unresponsive. I also tried loading multiple quicksaves within 1.4.3, but the same issue is present.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter clicking the above buildings/button, the following error is output to the debug window: \u0022Exception: ArgumentOutOfRangeException: Argument is out of range. Parameter name: index\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI can fix the issue if I revert my install to 1.4.1 using the Steam beta options; the save game functions normally in 1.4.1.\n\u003C/p\u003E\n\u003Cp\u003E\nI have linked two log files below, the first is from 1.4.3 after clicking a few of the buildings, and the second is 1.4.1 after successfully loading into the Tracking Station.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m only using the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E and \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E addons. Obviously I\u0027d like to remain current with KSP updates but this issue prevents that, any help you can offer would be great, thanks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/aflylle6jj4lffx/output_log1.4.3.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/aflylle6jj4lffx/output_log1.4.3.txt?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/0o8whmvyhb0xm16/output_log1.4.1.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/0o8whmvyhb0xm16/output_log1.4.1.txt?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-05-06T19:23:36Z\u0022 title=\u002205/06/2018 07:23  PM\u0022 data-short=\u00226 yr\u0022\u003EMay 6, 2018\u003C/time\u003E by IncKursion\u003C/strong\u003E\n\u003Cbr\u003ESolved the problem\n\u003C/span\u003E\n"},{"CreatedByName":"IncKursion","CreatedById":5706,"CreatedDateTime":"2018-05-06T19:26:06Z","Content":"\n\u003Cp\u003E\nWell, it turns out that I created the problem. I use the Steam version of KSP but I have the direct download version of Making History (from the early-adopter promotion).\n\u003C/p\u003E\n\u003Cp\u003E\nWhen KSP updated to 1.4.3 in Steam, it obviously didn\u0027t update Making History at the same time, so all I had to do was install the 1.4.3 version of MH. Problem solved!\n\u003C/p\u003E\n"}]}