{"TopicId":178676,"ForumId":70,"TopicTitle":"What is wrong with the hatches on the Mk2 inline cockpit?","CreatedByName":"weregamer","CreatedById":168738,"CreatedDateTime":"2018-10-02T01:34:10Z","PageNum":1,"Articles":[{"CreatedByName":"weregamer","CreatedById":168738,"CreatedDateTime":"2018-10-02T01:34:11Z","Content":"\n\u003Cp\u003E\nThe only mod I have installed that ought to be fiddling with this part is MechJeb Universal, which should only be adding the MechJeb Core function.\n\u003C/p\u003E\n\u003Cp\u003E\nI remember hitting this problem several years ago when I last played KSP, but thought it would have been fixed long ago.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a cargo bay immediately behind the cockpit (I had hoped to use the visually-present hatch on the back to go EVA in the cargo bay, but it\u0027s not \u0022real\u0022 the way the one on a Mk3 part is.) I can almost believe the opened cargo bay hatch could collide in some weird way with the location of a Kerbal coming out of the cockpit, but when it\u0027s closed it\u0027s exactly like any other Mk2 part...\n\u003C/p\u003E\n\u003Cp\u003E\nI will try building a plane with a fuel tank behind the cockpit to see if that works, and report back...\n\u003C/p\u003E\n\u003Cp\u003E\nFor reference, my latest log is at \u003Ca href=\u0022https://drive.google.com/file/d/1rSsHA-YBVwSMZaMLhDekbi_odBWnFd_4/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/file/d/1rSsHA-YBVwSMZaMLhDekbi_odBWnFd_4/view?usp=sharing\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOH! Some experimentation found me an answer. I think it\u0027s crazy, but it\u0027s an answer.\n\u003C/p\u003E\n\u003Cp\u003E\nI had a tiny antenna (the surface-mount L1 one, rotated to run fore-and-aft) mounted on the top of the canopy - nowhere near the hatches, nowhere near where the Kerbal actually shows up on EVA. That was apparently the obstruction.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}