{"TopicId":179190,"ForumId":70,"TopicTitle":"No longer able to launch from shortcut including \u0026quot;-force-opengl\u0026quot;","CreatedByName":"SpacedInvader","CreatedById":106018,"CreatedDateTime":"2018-10-22T21:35:33Z","PageNum":1,"Articles":[{"CreatedByName":"SpacedInvader","CreatedById":106018,"CreatedDateTime":"2018-10-22T21:35:33Z","Content":"\n\u003Cp\u003E\nI\u0027m returning to the game after nearly a year away with the intention to keep at it this time and actually finish my goal of a colony (\u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E) on every orbital body. Anyway, I have always run a ridiculously over-modded install because there are just so many mods I can\u0027t say no to and, as such, I\u0027ve long run the game with the \u0022-force-opengl\u0022 instruction in the shortcut so that my memory usage is cut down considerably. This is needed for my system as I\u0027ve only got 16GB of ram and my KSP install usually occupies a large majority of that (more than 10GB) when in D3D mode. The problem is, now when I attempt to launch 1.5.1 with the \u0022-force-opengl\u0022 instruction, the game immediately crashes with an error log stating that either \u0022nvoglv64.DLL caused an Access Violation\u0022 or \u0022KSP_x64.exe caused an Access Violation\u0022. I\u0027ve also tried using the instruction \u0022-force-glcore\u0022 with the same results. So, the question is, is KSP no longer able to be run in OpenGL mode, or is there another trick I can use to make this work?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n\u003Cp\u003E\nPS: I have tried running the game through the command prompt with both instructions and gotten the same results.\n\u003C/p\u003E\n\u003Cp\u003E\nPPS: I know the obvious answers are to cut down significantly on my mod list or to get more RAM. The latter isn\u0027t an option for me at this time for various reasons and the former would be very difficult for me as there are a great many mods which I use at least some part of on a regular basis so cutting them out is something I want to avoid at all costs.\n\u003C/p\u003E\n"},{"CreatedByName":"Electrocutor","CreatedById":109593,"CreatedDateTime":"2018-10-25T13:19:05Z","Content":"\n\u003Cp\u003E\nIf you\u0027ve tried running a completely stock/fresh install with -force-glcore and it crashes, you should probably find a tool to clean out your video driver install and all its registry garbage, and then re-install it fresh with the option to reset settings checked.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, make sure that any time you update your video drivers in the future, you first fully uninstall the existing one, as per NVidia\u0027s instructions: \u003Ca href=\u0022https://www.nvidia.com/object/IO_13955.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.nvidia.com/object/IO_13955.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNote that -force-glcore is quite a bit more stable than -force-opengl as well as significantly better performance. Some mods do not like either OpenGL or GLCore though, such as \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E and Scatterer: which are generally more stable with -force-d3d11.\n\u003C/p\u003E\n"},{"CreatedByName":"SpacedInvader","CreatedById":106018,"CreatedDateTime":"2018-11-05T21:32:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223475128\u0022 data-ipsquote-contentid=\u0022179190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221540473545\u0022 data-ipsquote-userid=\u0022109593\u0022 data-ipsquote-username=\u0022Electrocutor\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/25/2018 at 7:19 AM, Electrocutor said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you\u0027ve tried running a completely stock/fresh install with -force-glcore and it crashes, you should probably find a tool to clean out your video driver install and all its registry garbage, and then re-install it fresh with the option to reset settings checked.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, make sure that any time you update your video drivers in the future, you first fully uninstall the existing one, as per NVidia\u0027s instructions: \u003Ca href=\u0022https://www.nvidia.com/object/IO_13955.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.nvidia.com/object/IO_13955.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNote that -force-glcore is quite a bit more stable than -force-opengl as well as significantly better performance. Some mods do not like either OpenGL or GLCore though, such as \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E and Scatterer: which are generally more stable with -force-d3d11.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis happens with a completely clean install. I will try the driver wipe though. As for Scatterer and \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E, do they still work at least with -force-glcore? I\u0027ve used them in the past with -force-opengl with what seemed like few / no problems, but things tend to change with time.\n\u003C/p\u003E\n"},{"CreatedByName":"Electrocutor","CreatedById":109593,"CreatedDateTime":"2018-11-05T21:49:03Z","Content":"\n\u003Cp\u003E\nYeah, they still work with -force-glcore (much more stable than opengl in fact).\n\u003C/p\u003E\n"}]}