{"TopicId":179580,"ForumId":70,"TopicTitle":"Discoverable Objects","CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2018-11-06T08:59:48Z","PageNum":1,"Articles":[{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2018-11-06T08:59:49Z","Content":"\n\u003Cp\u003E\nOk, I want to start off here by saying, I just got back into the game after a LONG absence and updated my mods to the best of my ability. I cant see any real way to duplicate this as frankly I dont know what if anything I am directly doing aside from starting the game and loading my save... \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I just reloaded the game and saw a RED error message go blitzing past. Took multiple reloads to grab a screen cap via print screen. In RED: MissingMethodException: Method not found: \u0022Unityengine.Texture2d.LoadImage\u0022. and in an Orangeish color right below it: [KSPSteamController]: Failed to initialize Steam API!\n\u003C/p\u003E\n\u003Cp\u003E\nI am playing a Steam copy of the game with a shortcut on my desktop and I run as Admin. End Edit 1.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT2: It seems the Error above is only on launch, and the ones below are when I go from being in one scene to the next, like for example, I checked on my munar base and got the error, returned to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and got the below errors again. \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E back into the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E generates it yet again. Perhaps something is missing from my game or I need a fresh install? Any thoughts would be appreciated. End EDIT2\n\u003C/p\u003E\n\u003Cp\u003E\nError I am getting: Error: Cannot find a module of typename \u0022Discoverableobjects\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n                                 Error: Scenariomodule is null.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI have absolutely zero clue what is going on here. I dont think this is a game breaking error as I can jump from craft to craft with no real issues being seen, just that those two errors are randomly popping up. And before anyone asks my most recent output log is from about 2 years ago from what I can tell, well that is to say, the output log I see is dated October of 2016.... Any how, here is a list of mods that I am running, all as up to date as they can be:\n\u003C/p\u003E\n\u003Cp\u003E\nMechJeb, SpaceY, SpaceY Expanded, \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E, Chatterer, Cacteye, Proc Fairing, Planetary Base, Reentry Particle Effects. I will of course be updating this with edits as I learn more information on what I am seeing. If it is as simple as I borked something up with putting in the DLC or my mods and re-installing the game to fix it as well as my mods and DLC please tell me \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E With that said, I will go back to punting Kerbals around to see what if anything else I can shake out of the tree on this. \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E )2:59:30\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EEDIT3: The Following actions generate the dual errors listed below EDIT2: \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E into \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E into \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E into Tracking Station, Tracking Station onto any vessel \u0026lt;best as I can tell\u0026gt; that is NOT landed, and returning to the Tracking Station from ANY vessel regardless if its in flight or landed. End EDIT3\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EEDIT4: Here is a filedropper link to my output log generated at around 350am: \u003Ca href=\u0022http://www.filedropper.com/outputlog_19\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/outputlog_19\u003C/a\u003E here is hoping someone can use this to make sense of what I am seeing.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-07T03:55:08Z\u0022 title=\u002211/07/2018 03:55  AM\u0022 data-short=\u00225 yr\u0022\u003ENovember 7, 2018\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2018-11-06T11:05:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223482172\u0022 data-ipsquote-contentid=\u0022179580\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221541494789\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd before anyone asks my most recent output log is from about 2 years ago from what I can tell, well that is to say, the output log I see is dated October of 2016....\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSince 1.4 the output log is generated somewhere else: \u003Ca href=\u0022https://docs.unity3d.com/Manual/LogFiles.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.unity3d.com/Manual/LogFiles.html\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2018-11-06T11:27:39Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119953-harry-rhodan/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022119953\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119953-harry-rhodan/\u0022 rel=\u0022\u0022\u003E@Harry Rhodan\u003C/a\u003E did not know that. I will dig up the log later today and file dropper it here for you and any persons that can make use of it. I will add for now at least I am not seeing any adverse results from the aforementioned issues other than the game itself saying these issues.. op 05:27:30\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2018-11-07T06:19:01Z","Content":"\n\u003Cp\u003E\nI loaded a different save and saw the errors below EDIT2 in my op less than in my main save but they still pop up. Output log in EDIT4 above\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT worth noting the 2nd save has fewer active vessels. Im starting to suspect it may be a conflict between 1.5.1 and a mod or mods not fully up with 1.5.1... I will test this theory later wednesday\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-07T07:06:08Z\u0022 title=\u002211/07/2018 07:06  AM\u0022 data-short=\u00225 yr\u0022\u003ENovember 7, 2018\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2018-11-08T04:25:48Z","Content":"\n\u003Cp\u003E\nOk, I have an update of sorts, but really would appreciate a second set of eyes going over the output log in EDIT4 above. My theory on the errors I am seeing that it may be a conflict on mods updated only as far as KSP 1.4.X and KSP being 1.5.1 with DLC \u0026lt;not sure if the DLC affects this or not\u0026gt; seems to be holding up. I just pulled every mod from KSP including my 2 saves that have those parts active in them and only spotted 1 error during the initial loading screen. that error was the game crabbing about the steam api \u0026lt;running from the short cut icon on my desktop\u0026gt; and when launched from steam directly even that error went away. I hit alt-f12 and its still crabbing about a missing: MissionScore.cfg or something along that line. I think its just a compatibility issue at this point but thus far does not seem to be game breaking as it seems to play just fine. Any thoughts/confirmations would be greatly appreciated.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2018-11-12T07:06:15Z","Content":"\n\u003Cp\u003E\nWould seem I have located at least one of the causes of the initial errors I had questions about in the initial post. Space Y and Space Y Expanded being for 1.4.X seem to have some odd little conflict with 1.5.1 and when Necrobones updates \u0026lt;hopefully soon\u0026gt; the issue should be corrected. I will go ahead and assume that since I did not see these errors with the mods removed and only see them when the mods are there \u0026lt;the ones NOT updated for 1.5.1 that is\u0026gt; that this is mod related. Seeing as stated before this does not seem game breaking, I will consider it a non-issue. op 01:30:30 \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Rather than make a new post, I will just edit this one. It would seem SpaceY and its expansion are the source of my woes. I had to remove them until Necrobones has a chance to update his mod for the current version of KSP. Welp thats that then.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-13T07:34:11Z\u0022 title=\u002211/13/2018 07:34  AM\u0022 data-short=\u00225 yr\u0022\u003ENovember 13, 2018\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-11-13T07:36:07Z","Content":"\n\u003Cp\u003E\nThread closed by \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u0027s request. \n\u003C/p\u003E\n"}]}