{"TopicId":188087,"ForumId":70,"TopicTitle":"Loss of communication","CreatedByName":"eightiesboi","CreatedById":133828,"CreatedDateTime":"2019-09-08T07:38:37Z","PageNum":1,"Articles":[{"CreatedByName":"eightiesboi","CreatedById":133828,"CreatedDateTime":"2019-09-08T07:38:37Z","Content":"\n\u003Cp\u003E\nHey all, \n\u003C/p\u003E\n\u003Cp\u003E\nModerately modded KSP install (1.7.3) with both the DLC. I started 1.7.3 fresh with a clean Steam install, using \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E for mod management with a few tweaks. I had successfully launched a satellite to orbit (call it Sputnik). I screwed around a bit and then my editor keybinds were no longer working (couldn\u0027t angle snap). I bounced out to the main menu and checked my keybinds and noted that several of the ones in the editor were spontaneously missing. I thought the option to reset to default was for just the keybinds and was surprised when I found that all of my game settings had reverted to default. I went through and set them the way I wanted and the restarted and began playing. After doing some building, I launched another satellite (Sputnik 2), which was an exact copy of the original; however, I was surprised when I loss communication when reached space but before orbit. \n\u003C/p\u003E\n\u003Cp\u003E\nI have my DSN set to 0.10 and antenna range at 0.65, although putting them both back to 1.0 makes no difference. I have extra ground stations enabled. Switching off the option to require communications to control probes immediately restores control, so it is definitely a CommNet issue. I haven\u0027t played since 1.6, (and with the same CommNet ranges) but I don\u0027t recall losing signal at 70k-80k altitude; I recall having full coverage for Kerbin at that altitude. Since I didn\u0027t have this problem, I suspect that there is a setting that got nerfed, even though it appears that my extra ground stations are still enabled. In support of this supposition is that my config file tweak to allow the \u0022Configure Vessel Name\u0022 dialog to exist in the flight scene was reverted and I had to reset it in the config file. However, I don\u0027t know where the flag for extra ground stations is or how to check it.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternatively, can anyone else tell me whether they have problems with a 16 or 16s antenna losing connection between 70k and 80k altitude with extra groundstations enabled? Am I simply mis-remembering the coverage?\n\u003C/p\u003E\n\u003Cp\u003E\nNote that I don\u0027t think the range settings are a factor: I have 100% signal strength prior to losing connection with \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and then 100% again from Harvester Massif when the connection is resumed.\n\u003C/p\u003E\n\u003Cp\u003E\nLogs here: \u003Ca href=\u0022https://1drv.ms/u/s!AoyHZiRU1jT-zbdPmwwoaYTI2u38dg?e=RXTksZ\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://1drv.ms/u/s!AoyHZiRU1jT-zbdPmwwoaYTI2u38dg?e=RXTksZ\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUpdate: Okay, I figured out a bit more. In a 75k orbit around Kerbin, with atmospheric occlusion at 1.00, there is a gap in coverage between the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and Harvester Massif. If someone wouldn\u0027t mind confirming my results, I\u0027d appreciate it. In my previous career, I had atmospheric occlusion set at .90 and vacuum at 1.02, so I may not have noticed this gap in the past. Or is there something awry with my install? Anyone? \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-09-08T22:54:56Z\u0022 title=\u002209/08/2019 10:54  PM\u0022 data-short=\u00224 yr\u0022\u003ESeptember 8, 2019\u003C/time\u003E by eightiesboi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}