{"TopicId":191875,"ForumId":70,"TopicTitle":"Low GPU usage on 1.9","CreatedByName":"popos1","CreatedById":37258,"CreatedDateTime":"2020-02-23T10:32:05Z","PageNum":1,"Articles":[{"CreatedByName":"popos1","CreatedById":37258,"CreatedDateTime":"2020-02-23T10:32:06Z","Content":"\n\u003Cp\u003E\nHi, \n\u003C/p\u003E\n\u003Cp\u003E\nwe have 2020 year and ksp version 1.9 and still exist problem of not full GPU usage:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222288804100_1582453768.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002265.67\u0022 height=\u0022672\u0022 width=\u00221024\u0022 src=\u0022https://obrazki.elektroda.pl/2288804100_1582453768.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere is any fix to get at least 25 fps?\n\u003C/p\u003E\n"},{"CreatedByName":"Incarnation of Chaos","CreatedById":197414,"CreatedDateTime":"2020-02-23T11:38:11Z","Content":"\n\u003Cp\u003E\nThe year is 2020, but alas the way KSP works hasn\u0027t changed fundementally in this regard.\n\u003C/p\u003E\n\u003Cp\u003E\nYour GPU is doing very little work when playing KSP; only rendering the limited graphics of the Skybox, lighting and whatever ships are in the scene. The CPU is what is pulling the majority of the load, and for individual vessels with high part counts all of this is battering a single core. Other cores are used to offload ships out of focus, so this reduces the overhead slightly for this one poor core. But that one ship is using one core to perform all the calculations of how each of those 500 parts is interacting with each other.\n\u003C/p\u003E\n\u003Cp\u003E\nIn shorthand; the bottleneck isn\u0027t the GPU here. It\u0027s the CPU, and only raw clockspeeds would raise your FPS at this point or a CPU with higher IPC (This may not be possible even if you\u0027re running recent HW). The \u0022Fix\u0022 is on the user end; you now have your upper limit for partcount and can attempt to avoid using that many in the future.\n\u003C/p\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2020-02-23T11:38:45Z","Content":"\n\u003Cp\u003E\nKSP is CPU (and RAM) centric, not GPU.\u003Cbr\u003E\u003Cbr\u003E\nWhich is why it works (decently) even if you have a very modest GPU.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}