{"TopicId":193202,"ForumId":70,"TopicTitle":"Basic Graphics issues preventing better graphics mods","CreatedByName":"Deadwake","CreatedById":204053,"CreatedDateTime":"2020-04-17T19:07:47Z","PageNum":1,"Articles":[{"CreatedByName":"Deadwake","CreatedById":204053,"CreatedDateTime":"2020-04-17T19:07:47Z","Content":"\n\u003Cp\u003E\nHey everyone,\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027m relatively new to the KSP world on PC. I played hundreds of hours on my xbox one x. I\u0027m now on my Acer Nitro 5 gaming laptop with a 1050 NVidia setup and I\u0027m having some issues with the game that I can\u0027t find concise answers too. First off without any planetary graphics mods, I have an ocean that does not render. Its there when I land, but all I see is the textured blue ocean floor. I ended up removing \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E and Realistic Atmosphere as well as my AVP mod and Sunflares becuase on top of my ocean issue, regardless of a beautiful rendering of planet kerbin on the pregame menu, once I started playing the atmosphere went black and the planet from map mode turned into this grayed out dark orange and black rendering that got so annoying. I haven\u0027t noticed the gameplay affected much but I cannot seem to figure out how to make this planet have its reliable and consistent graphics that everyone else seems to have. Anyone experience this? I\u0027m running out of ideas without individually inspecting the game with every mod one by one... \n\u003C/p\u003E\n"},{"CreatedByName":"archiebald","CreatedById":195579,"CreatedDateTime":"2020-04-20T01:04:12Z","Content":"\n\u003Cp\u003E\nIt sounds like you\u0027re running 1.9x., hence the issues with Scatterer\n\u003C/p\u003E\n\u003Cp\u003E\nMy best advice would be to install 1.8.1 and enjoy Scatterer and \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E.  Even without these mods, in IMHO, the rendering in 1.9.1 is worse.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-04-20T01:04:44Z\u0022 title=\u002204/20/2020 01:04  AM\u0022 data-short=\u00224 yr\u0022\u003EApril 20, 2020\u003C/time\u003E by archiebald\u003C/strong\u003E\n\u003C/span\u003E\n"}]}