{"TopicId":193386,"ForumId":70,"TopicTitle":"Start Menu Unclickable","CreatedByName":"Cornholio","CreatedById":94349,"CreatedDateTime":"2020-04-25T14:50:57Z","PageNum":1,"Articles":[{"CreatedByName":"Cornholio","CreatedById":94349,"CreatedDateTime":"2020-04-25T14:50:57Z","Content":"\n\u003Cp\u003E\nHello.  It\u0027s been a long time since I\u0027ve posted here, haven\u0027t played since 1.4 at least.  I used to be HUGE into KSP, put in hundreds and hundreds of hours into heavily modded career saves, going to most places in the KSP system.  I recently got the itch to play after being suggested some KSP videos on YouTube...  I only play this game modded and did a review of when the last patch was with respect to where my \u0022bare minimum\u0022 mods are currently.  I decided that 1.9 was not ready as a few mods were not yet updated and decided to backdate to 1.8.1.  I meticulously downloaded 1.8 mods very specifically from spacedock and GitHub.  There are one or two mods that had not been updated past 1.4 or something but they are tiny parts mods that do not require dlls. \n\u003C/p\u003E\n\u003Cp\u003E\nAfter careful extraction and setup in GameData, when I load KSP, I successfully get to the loading screen without any null reference errors.  Everything seems good to go except for one thing:  When I click on \u0022Start Game\u0022 or any of the other options, nothing happens.  The text on those options does change color as it recognizes that the mouse is hovered over but will not take me to another menu or screen.  None of the options work.  They do not cause the application to crash, though, either.  As I had done in the past, to pinpoint particular troublesome mods, I will remove subsets of mods until the game will run.  I thought I had it pinned down to CTTP.  After eliminating CTTP, the game loaded and I was able to select the menu options successfully.  To confirm, I closed the application and rebooted as-is and this time was unable to select the menu.  This didn\u0027t make much sense.  I continued troubleshooting with various mods installed and removed and could not pin down an exact pattern for why I\u0027m able to click Start Game or unable to do so.  The only thing I can conclude is that I 100% CAN click it with zero mods installed. \n\u003C/p\u003E\n\u003Cp\u003E\nI sort of remember in the past having an issue like this and the solution had to do with ending some sort of background process that was related to NVIDIA streaming services.  I tried doing that but it did not change my results.  Maybe I missed one?\n\u003C/p\u003E\n\u003Cp\u003E\nI have uploaded my Player.log file \u003Ca href=\u0022https://www.dropbox.com/home?preview=Player-prev.log\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.  Thank you to anyone that takes the time to look or comment.\n\u003C/p\u003E\n"}]}