{"TopicId":194669,"ForumId":70,"TopicTitle":"[1.9.1] Part menu no longer showing (in space, not VAB)","CreatedByName":"Kinniken","CreatedById":205366,"CreatedDateTime":"2020-06-12T10:08:04Z","PageNum":1,"Articles":[{"CreatedByName":"Kinniken","CreatedById":205366,"CreatedDateTime":"2020-06-12T10:08:04Z","Content":"\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m playing KSP with some mods, mostly \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E and EasyVesselShip. I\u0027ve had to switch PC following a hardware failure, and on my new PC, with the same install (I copied my GameData folder) I\u0027m having an issue with right-clicking parts while in space or landed:\n\u003C/p\u003E\n\u003Cp\u003E\n- I can no longer get the right-click menu for any part belonging to a nearby ship and not the currently-activeship. Before I could not perform operations on another ship\u0027s part but the menu would show up\n\u003C/p\u003E\n\u003Cp\u003E\n- When in EVA, I can only bring up the menu of parts that are within reach of my kerbal. Before, I could load up any menu, it\u0027s just that only nearby parts would have actions (like folding solar panels for example) available\n\u003C/p\u003E\n\u003Cp\u003E\n- Most annoyingly, the menu for \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E\u0027s joint port is no longer available, even when it\u0027s on the active ship or I\u0027m doing an EVA and my Kerbal is next to it. This means that while I can grab the hose from the resource centre on my \u0022tanker\u0022 ship, I cannot attach it to the \u0022receiving\u0022 ship\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not a save issue - on my old PC the very same save with the same two ships right next to each other works fine.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve tried reinstalling KSP and all its mods from scratch rather than using the old GameData folder but that did not help.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAny ideas? My Eve mission is kind of stuck if I can\u0027t refuel it with my \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E rover \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kinniken","CreatedById":205366,"CreatedDateTime":"2020-06-12T20:21:08Z","Content":"\n\u003Cp\u003E\nI figured it out, and I\u0027m feeling very stupid... it was only due to not having advanced tweakables enabled \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E Because of it, out-of-range parts had no options to display, and hence, no menu. And the JAS joints work fine, it\u0027s just that without advanced tweakables they only have a menu item if you have a Kerbal in EVA with a connector next to it.\n\u003C/p\u003E\n\u003Cp\u003E\nSorry for the bother!\n\u003C/p\u003E\n"}]}