{"TopicId":195742,"ForumId":70,"TopicTitle":"ksp crashes whenever it loads","CreatedByName":"Probro","CreatedById":205328,"CreatedDateTime":"2020-07-20T10:07:18Z","PageNum":1,"Articles":[{"CreatedByName":"Probro","CreatedById":205328,"CreatedDateTime":"2020-07-20T10:07:18Z","Content":"\n\u003Cp\u003E\nno error message, no crash log, no nothing it just stops working when it says \u0027\u0027expansion loading complete\u0027\u0027 i have alot of mods installed but it wasn\u0027t a problem ever since i installed rssve, but that crashed my pc so i uninstalled it but the problem wont go away, is there any way you guys can help?\n\u003C/p\u003E\n\u003Cp\u003E\nhere is my mods list: \u003Ca href=\u0022https://imgur.com/a/LJsNWSF\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/LJsNWSF\u003C/a\u003E \u003Ca href=\u0022https://imgur.com/a/rl6B0NH\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/rl6B0NH\u003C/a\u003E \u003Ca href=\u0022https://imgur.com/a/cT0YLOh\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/cT0YLOh\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\ni have been up all night trying to solve but nothing is working, i think i might go to bed and try in maybe a few hours, i hope you guys can help me out with this save.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-07-20T10:41:56Z","Content":"\n\u003Cp\u003E\nHave you looked in Player.log? If it stops at ‘expansion loading complete’ there’s almost always an exception crashing the game. Look in C:/users/your user/AppData/LocalLow/Squad/Kerbal Space Program for a file called Player.log or Plyer.txt, open that up and look at the end of the file for Exception, EXC, ERR or Crash; alternatively upload them to a file sharing site and link to it here so someone else can check it out.\n\u003C/p\u003E\n\u003Cp\u003E\nI see that you’ve been modding KSP inside the Steam folder- big mistake! It’s a much better idea to copy KSP out of Steam’s folder tree and \u003Ci\u003Ethen \u003C/i\u003Eadd mods, so that game updates can’t break anything. Check your game version and if it’s 1.10, you might need to roll back to an earlier version e.g. 1.9.1- right click KSP \u0026gt; properties \u0026gt; betas tab \u0026gt; select 1.9.1 in the list. Once that’s downloaded, copy the entire KSP directory out of steamapps/common and put it somewhere else e.g. your desktop, then run the game from there and see if that works.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you didn’t already know, you can have as many copies of KSP on your PC as you like even on different versions and with different mods in each (I have 12 at the moment plus the one under Steam’s control to get updates). If you don’t use \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E, I suggest you give it a try as it makes version control and copying game instances vastly easier than doing it by hand; it’s not perfect and it takes a bit of getting used to, but it’s well worth the effort to get it set up.\n\u003C/p\u003E\n"}]}