{"TopicId":199828,"ForumId":70,"TopicTitle":"The new poseable, coloured lights seem to impact framerate","CreatedByName":"TimKerbin","CreatedById":83805,"CreatedDateTime":"2021-01-25T17:00:39Z","PageNum":1,"Articles":[{"CreatedByName":"TimKerbin","CreatedById":83805,"CreatedDateTime":"2021-01-25T17:00:39Z","Content":"\n\u003Cp\u003E\nMy PC is ancient but I still get a good 30-60fps in most situations. It depends on the complexity of the base or station, and the situation. When I landed my base on the Mun I noticed that when I turned on the lights, the framerate dropped from 30 to 15 fps. (Terrain Shader is set to High, so is the Terrain Detail). When I turned them off the fps returned to 30.  It doesn\u0027t seem to happen on orbiting stations, only landed bases. It doesn\u0027t make any sense considering these new lights don\u0027t cast shadows, I don\u0027t know why there\u0027d be a performance drop, even with the current terrain settings.\n\u003C/p\u003E\n\u003Cp\u003E\nAudio Muffler Redux\u003Cbr\u003E\nChatterer\u003Cbr\u003E\nDistantObject\u003Cbr\u003E\nKerboKatz\u003Cbr\u003E\nNavBallDockingAlignmentIndicatorCE\u003Cbr\u003E\nPlanetShine\u003Cbr\u003E\nRealPlume\u003Cbr\u003E\nRealPlume-Stock\u003Cbr\u003E\nscatterer\u003Cbr\u003E\nSmokeScreen\u003Cbr\u003E\nSquad\u003Cbr\u003E\nTextureReplacer\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-25T17:01:32Z\u0022 title=\u002201/25/2021 05:01  PM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 25, 2021\u003C/time\u003E by TimKerbin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kielm","CreatedById":82247,"CreatedDateTime":"2021-01-25T22:05:24Z","Content":"\n\u003Cp\u003E\nI think the issue here is the visual mods and reflective lights. \n\u003C/p\u003E\n\u003Cp\u003E\nScatterer has an impact on lighting. Planetshine has an impact on lighting. TextureReplacer adds reflections and and improves the mipmap quality. Also this, from the parallax thread (I know you haven\u0027t listed it but it\u0027s relevant anyway):\n\u003C/p\u003E\n\u003Cul style=\u0022color:#24292e;font-size:16px;text-align:left;\u0022\u003E\u003Cli style=\u0022background-color:#ffffff;color:#24292e;font-size:16px;\u0022\u003E\nFor some reason, KSP uses Unity\u0027s \u0022Forward Rendering\u0022 path instead of the \u0022Deferred Rendering\u0022 path. This means that for every pixel light in the scene, the tessellation is re-calculated. With lots of lights, this can add up very quickly. Until KSP moves to the Deferred rendering path, there is nothing I can do about this.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp style=\u0022background-color:#ffffff;color:#24292e;font-size:16px;\u0022\u003E\nYou will still get some performance drop from lights - that\u0027s just KSP\u0027s Unity. But the number of visual mods you\u0027re using won\u0027t help. Try it without (back up your gamedata \u0026amp; save first) and see. \n\u003C/p\u003E\n"}]}