{"TopicId":207492,"ForumId":70,"TopicTitle":"Right-click part dialog box doesn\u0026#039;t appear on screen for some vessels","CreatedByName":"Amity","CreatedById":200804,"CreatedDateTime":"2022-03-31T23:23:38Z","PageNum":1,"Articles":[{"CreatedByName":"Amity","CreatedById":200804,"CreatedDateTime":"2022-03-31T23:23:39Z","Content":"\n\u003Cp\u003E\nETA:  more detail about the problem\n\u003C/p\u003E\n\u003Cp\u003E\nHello!  I don\u0027t know if this is a known issue, I couldn\u0027t find it anywhere else, so I am asking about it here.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is that when I am at certain vessels, but not all, right-clicking on a part does not cause the part\u0027s pop-up dialog box to appear on screen.\n\u003C/p\u003E\n\u003Cp\u003E\nPart dialogs still appear on other vessels, and they appears in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E.  So I am pretty sure it is not a right-click mouse input issue.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a weak, partial workaround:  I can get some part dialogs to appear by going through the resource tool and selecting a resource, which causes the relevant part dialogs to all pop up for that resource, as expected.  I can then pin the dialogs I want and turn off the resource, now free to transfer resources or whatever else I want.  But there are some limitations:  a) not all the part dialogs appear, sometimes the one I want does not appear; and b) it only works for parts with resources, not (for example) engines, solar panels, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fact that some dialogs never appear leads me to suspect that the dialog is \u0022mapping\u0022 to a screen location that is not visible, i.e. off screen.  But that is a very tentative hypothesis, I could be wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother piece of supporting evidence is that when I use my system\u0027s accessibility features to drive the screen pointer using the keyboard only, I can generate right-click events just fine everywhere else, it\u0027s just that on these certain \u0022bad\u0022 vessels, the right-click does not display any dialog that I can see.\n\u003C/p\u003E\n\u003Cp\u003E\nThe issue started to appear seemingly spontaneously a few days ago, the only mod I have installed that has been updated in the last few weeks has been Kopernicus, so it doesn\u0027t seem like a mod update issue. \n\u003C/p\u003E\n\u003Cp\u003E\nHas anyone else had this happen recently?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:  I have narrowed the problem down quite a bit though not yet figured it out, it happens any time there are more than about 220 parts loaded in the same local physics bubble at the same time.  Even a new vessel does this on the launch pad -- if I go revert and add one part too many, suddenly the right-click menus all stop appearing!\n\u003C/p\u003E\n\u003Cp\u003E\nI feel like someone, somewhere must also have had this experience.  Anyone??\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-04-01T20:06:32Z\u0022 title=\u002204/01/2022 08:06  PM\u0022 data-short=\u00222 yr\u0022\u003EApril 1, 2022\u003C/time\u003E by Amity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hoozemans","CreatedById":198643,"CreatedDateTime":"2022-04-12T17:04:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224109686\u0022 data-ipsquote-contentid=\u0022207492\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221648769019\u0022 data-ipsquote-userid=\u0022200804\u0022 data-ipsquote-username=\u0022Amity\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/1/2022 at 1:23 AM, Amity said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnyone??\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSame here.  v1.12.3. No exceptions in KSP.log either. Still working the problem. Perhaps SM or CLS?\n\u003C/p\u003E\n"},{"CreatedByName":"Amity","CreatedById":200804,"CreatedDateTime":"2022-05-19T15:29:22Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022198643\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0022 rel=\u0022\u0022\u003E@Hoozemans\u003C/a\u003E pardon my ignorance but what are SM and CLS? \n\u003C/p\u003E\n"},{"CreatedByName":"Amity","CreatedById":200804,"CreatedDateTime":"2022-05-25T00:31:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224115678\u0022 data-ipsquote-contentid=\u0022207492\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221649783073\u0022 data-ipsquote-userid=\u0022198643\u0022 data-ipsquote-username=\u0022Hoozemans\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/12/2022 at 10:04 AM, Hoozemans said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSame here.  v1.12.3. No exceptions in KSP.log either. Still working the problem. Perhaps SM or CLS?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo I have managed to narrow it down some.  I installed a completely new KSP and started adding the mods necessary to make my career save loadable.  This was a revelation.  There was so much crap in my old KSP install folder!  And in some cases, the module dependencies are totally different now.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway I got to the point where I could load my big fat career game and open one of my big vessels that gives me right click problems.  Instead of totally failing to give me right-click menus, now the menus appear, but only intermittently!  Like, every 2nd or 3rd right-click.  I experimented a lot with tweaks and here is what I found:\n\u003C/p\u003E\n\u003Cp\u003E\n- it is more likely to work (close to 100% success) if I have angled the part I want to click on so that there are no other parts in front or behind it (solar panels and radiators make this easy for example)\n\u003C/p\u003E\n\u003Cp\u003E\n- on a planet, it is more likely to work if the camera is angled so that the part is set against the sky rather than the ground (why??!?)\n\u003C/p\u003E\n\u003Cp\u003E\n- overall the success rate is greatly improved when I take measures to cool my cpu -- apparently this is performance related?  So that could be the root cause of it all?\n\u003C/p\u003E\n\u003Cp\u003E\nDoes any of that match what you have seen?  I am running my KSP on a little old Mac laptop so that might be why?\n\u003C/p\u003E\n"}]}