{"TopicId":211104,"ForumId":70,"TopicTitle":"EVA construction not working on non-debris standalone root parts (with workaround)","CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2022-12-19T06:51:30Z","PageNum":1,"Articles":[{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2022-12-19T06:51:30Z","Content":"\n\u003Cp\u003E\nSo, I\u0027m working on a low mass mission. A great deal of that mission was planned on me being able to disassemble and reassemble craft at will with the stock EVA construction tool. I launched the mission, and then detached several parts. Using these parts, I assembled an ion lander based off of a small reaction wheel. This small reaction wheel is the root part of the ion lander, but all of the parts were originally parts of the main craft, and none of them were the root part.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u002290.00\u0022 width=\u00221200\u0022 alt=\u00226sLsCW0.png\u0022 src=\u0022https://i.imgur.com/6sLsCW0.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI went off, landed on the Mun and Minmus, returned to the main ship, and attempted to reattach all of the parts. Everything went ok until I attempted to reattach the small reaction wheel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u002290.00\u0022 width=\u00221200\u0022 alt=\u0022wpv62q9.png\u0022 src=\u0022https://i.imgur.com/wpv62q9.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(The seat was detached before I did anything else)\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, when I try to pick up the small reaction wheel, which now has nothing attached to it, despite being highlighted green, it will not let me pick it up and move it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u002290.00\u0022 width=\u00221200\u0022 alt=\u00220CSC5e5.png\u0022 src=\u0022https://i.imgur.com/0CSC5e5.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nReaction wheel is highlighted green. When I press the center of mass button it shows the centers of mass of the main ship and the small reaction wheel and none of the other standalone parts which are floating around. I can freely pick up and move all of the other parts, just not the small reaction wheel.\n\u003C/p\u003E\n\u003Cp\u003E\nThis issue persists through quickloading, leaving to the tracking station, and reloading the game.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI have found a workaround: Go to the tracking station and rename the part to the class of debris instead of the class of whatever it is. I think this occurs because the EVA tool thinks that because the vessel type is not debris, it won\u0027t let you move it for some reason. It is possible that this is intended behavior but that would be strange intent in my opinion.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI believe this is a stock issue, as none of the mods I have installed seem like they would affect the EVA construction tool.\n\u003C/p\u003E\n\u003Cp\u003E\nMods:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nClickThroughBlocker\n\u003C/li\u003E\n\u003Cli\u003E\nToolbar controller\n\u003C/li\u003E\n\u003Cli\u003E\nB9 Part Switch\n\u003C/li\u003E\n\u003Cli\u003E\nBetter Time Warp\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nBoulderCo City Lights\n\u003C/li\u003E\n\u003Cli\u003E\nKerbal Engineer Redux\n\u003C/li\u003E\n\u003Cli\u003E\nKSP TOT Connect\n\u003C/li\u003E\n\u003Cli\u003E\nScatterer\n\u003C/li\u003E\n\u003Cli\u003E\nWaterfall\n\u003C/li\u003E\n\u003Cli\u003E\nStock Waterfall Effects\n\u003C/li\u003E\n\u003Cli\u003E\nZeroMiniAVC\n\u003C/li\u003E\n\u003Cli\u003E\nModule Manager\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nIf you know of an alternate workaround please let me know, but I can manage with the current workaround. While I technically don\u0027t need an answer I think its a good idea to post about it in case someone has the same issue later and goes googling.\n\u003C/p\u003E\n"}]}