{"TopicId":211651,"ForumId":70,"TopicTitle":"Shockingly poor performance compared to previous installs","CreatedByName":"LORDPrometheus","CreatedById":61414,"CreatedDateTime":"2023-01-22T22:02:21Z","PageNum":1,"Articles":[{"CreatedByName":"LORDPrometheus","CreatedById":61414,"CreatedDateTime":"2023-01-22T22:02:21Z","Content":"\n\u003Cp\u003E\nSo I decided to come back to KSP after a 2 year Hiatus in the leadup to KSP 2 but am experiencing shockingly poor performance compared to previous years.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESummary of Issue:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and world map performance is at 45frames consistent which feels really rather low but with the a clean install prior to mods it was at ~140 so i suspect it is almost entirely due to my modlist (Embedded is not working so direct link to Imgur post) \u003Ca href=\u0022https://imgur.com/gallery/1c9178N\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/gallery/1c9178N\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMy last KSP game was with a very similar modlist in 1.11 on the same computer and I was getting easily three times the performance.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the first few launches of the game I was ok with this performance but every launch since has seen that number dip down further and further and now I\u0027m at 25fps when launching a 70 part rocket. FPS does not increase when I get to orbit or switch crafts it just stays stuck at 25 now.\n\u003C/p\u003E\n\u003Cp\u003E\nSystem Resource utilization is very low and not just in the normal way of single threaded games not using a whole CPU it isnt even using a whole core: It is running CPU cores 5 and 6 (5 primary) and max utilization of either never goes above 45% with ram usage similarly fine (20GB free) and GPU rarely topping 40%.\n\u003C/p\u003E\n\u003Cp\u003E\nGame settings are mostly max visual quality with lighting and reflections turned down (no real difference I just find them distracting).\n\u003C/p\u003E\n\u003Cp\u003E\nA cursory glance through the log shows quite a few oddities but I don\u0027t have the Unity Knowledgebase to decode most of what is being said.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECritical Information:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPC Specs:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECPU:\u003C/strong\u003E Ryzen 7 3700X (Runs at 4.18Ghz during KSP)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ERAM:\u003C/strong\u003E 32GB DDR4 3600Mhz Cas 16 (G.Skill TridentZ)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EGPU:\u003C/strong\u003E MSI RTX 3060Ti (8Gb)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EInstalled storage:\u003C/strong\u003E Samsung 980 1TB\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ELOG File: \u003Ca href=\u0022https://www.dropbox.com/s/6rwiv49hj5hdryw/Playerlog.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/6rwiv49hj5hdryw/Playerlog.txt?dl=0\u003C/a\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EI\u0027d love to hear what you guys can figure out since I really just want to get back to launching rockets for fun.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLooking through the log i see exceptions from:\n\u003C/p\u003E\n\u003Cp\u003E\nMechjeb\n\u003C/p\u003E\n\u003Cp\u003E\nAmpYear\n\u003C/p\u003E\n\u003Cp\u003E\nTweakable Everything (What else is new with this one?)\n\u003C/p\u003E\n\u003Cp\u003E\nRecovery Controller\n\u003C/p\u003E\n\u003Cp\u003E\nKopernicus\n\u003C/p\u003E\n\u003Cp\u003E\nand Remote Tech\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNot sure if any of these are actually causing the performance issue but maybe?\n\u003C/p\u003E\n"}]}