{"TopicId":84014,"ForumId":70,"TopicTitle":"Contract Impossible!","CreatedByName":"PoeticWizard","CreatedById":120515,"CreatedDateTime":"2014-09-07T05:43:38Z","PageNum":1,"Articles":[{"CreatedByName":"PoeticWizard","CreatedById":120515,"CreatedDateTime":"2014-09-07T05:43:38Z","Content":"\n\u003Cp\u003ENo issues with mods or game performance. Wanted to notify you of a contract that isn\u0027t feasible. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://imageshack.com/i/eyBA5BCpp\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imageshack.com/i/eyBA5BCpp\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EScreenshot of issue.\u003C/p\u003E\u003Cp\u003EBasically in order to complete the mission to jool I have to decouple at an altitude that the game does not recognize as an orbit. If you need anymore info please contact me.\u003C/p\u003E\n"},{"CreatedByName":"Hurry- Starfish!","CreatedById":90298,"CreatedDateTime":"2014-09-07T16:59:35Z","Content":"\n\u003Cp\u003EConfirmed, happened to me too. For some reason the game requires you to be much higher above Jool than its atmosphere to consider you in orbit.\u003C/p\u003E\n"},{"CreatedByName":"PoeticWizard","CreatedById":120515,"CreatedDateTime":"2014-09-08T10:33:12Z","Content":"\n\u003Cp\u003ESo much money and lost all of my reputation and then some!\u003C/p\u003E\n"},{"CreatedByName":"Thanny","CreatedById":110623,"CreatedDateTime":"2014-09-12T10:39:38Z","Content":"\n\u003Cp\u003EYou can edit the contract in your save game to push the altitude requirement above the game\u0027s confused notion of Jool\u0027s atmosphere (supposed to around 138K, but parts of the game still think it\u0027s 200K).\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-09-12T11:08:38Z","Content":"\n\u003Cp\u003EWell, there always have been impossible contracts since 0.24 ...\u003C/p\u003E\u003Cp\u003Ethe most infamous of them, having to test Launch Stability Enhancers on Mun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo your case is no big surprise (although yours, of course, is much more subtle than the one with the LSEs).\u003C/p\u003E\u003Cp\u003EAFAIK squad for the next update are planning to introduce measures to check the viability of contracts before they are offered. \u003C/p\u003E\u003Cp\u003EAs for your case, I guess, you could either count it as loss or do save-altering, like Thanny suggests\u003C/p\u003E\n"}]}