{"TopicId":85742,"ForumId":70,"TopicTitle":"Is there any obvious conflicts in my mod list?","CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-09-30T03:09:28Z","PageNum":1,"Articles":[{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-09-30T03:09:28Z","Content":"\n\u003Cp\u003EI will say that I am playing on x64 (because obviously), and I do realize that it isn\u0027t completely stable. However, I have a strong feeling that some of the crashes I\u0027m experiencing may actually have more to do with the mods I\u0027m currently using rather than x64 itself (mostly because until a lot of different mods updated, my x64 install was actually pretty stable despite packing in an amount of mods that isn\u0027t much less than what I\u0027m going with now).\u003C/p\u003E\u003Cp\u003EBut anyway, if there aren\u0027t any obvious issues between my mods, then so be it. But if there is, I\u0027d like to try and resolve them to see if it solves my problems before I resign this whole issue to x64 just being unstable.\u003C/p\u003E\u003Cp\u003EHere\u0027s a screen of my GameData\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fTBwNn9.jpg\u0022 alt=\u0022fTBwNn9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have already went through several of the mods (namely FASA and B9) to cut out a lot of the redundant parts (or things that I just plain never use), so the list isn\u0027t as overloaded as it looks.\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-09-30T07:45:51Z","Content":"\n\u003Cp\u003E*sigh*\u003C/p\u003E\u003Cp\u003EFirst off, there are almost no cases of conflicts between KSP mods, and for the few there are, nobody knows them off hand well enough to glance at a list and say so.\u003C/p\u003E\u003Cp\u003ESecond off, as has been repeated endlessly here, x64 is broken. Horribly broken. Having it randomly decide to work or not is perfectly within it\u0027s capability, and it seems it\u0027s decided it doesn\u0027t like you today.\u003C/p\u003E\u003Cp\u003ESome potential solutions:\u003C/p\u003E\u003Cp\u003E-cut out even more parts (x64 may work if you can get the memory usage low enough)\u003C/p\u003E\u003Cp\u003E-try to get x32 working with Active Texture Management\u003C/p\u003E\u003Cp\u003E-\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94086\u0022 rel=\u0022external nofollow\u0022\u003ERead this thread which seems to have had some success\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E-sacrifice kerbals to the kraken and hope he is merciful and allows x64 to work\u003C/p\u003E\n"}]}