{"TopicId":89769,"ForumId":70,"TopicTitle":"Help with KAS and Kethane on Mac","CreatedByName":"Killa Lawnchair","CreatedById":128623,"CreatedDateTime":"2014-11-08T18:05:38Z","PageNum":1,"Articles":[{"CreatedByName":"Killa Lawnchair","CreatedById":128623,"CreatedDateTime":"2014-11-08T18:05:38Z","Content":"\n\u003Cp\u003EI downloaded KSP about a week ago and was hooked. I was running it on Windows using Parallel and started having lagging issues when I got into bigger stations. I then realized that there actually was a Mac version and I could probably get better performance out of it so I switched over. Everything seems to be fine, minus the normally crashing I had on windows and two things.\u003C/p\u003E\u003Cp\u003EFirst, KAS.\u003C/p\u003E\u003Cp\u003EEverything works fine with the exception of sound. Devices play no sounds whatsoever and when I go to launch a new rocket I get these annoying warning messages. I looked the sounds files were there but configured in .ogg instead of .wav like most of the game\u0027s files so i figured I try a conversion. No luck. Anyone know of a fix for the sound or if not a way to shut off the warning messages?\u003C/p\u003E\u003Cp\u003ENext is Kethane my more annoying problem.\u003C/p\u003E\u003Cp\u003EKethane is probably my favorite mod because of the possibilities it added. When I boot up KSP I get a message saying the \u0022the following mod is not supported with Unity blah blah blah\u0022. I said screw it and tried anyways. Everything works except for probably the most important part for me which is converting Kethane to fuel. I can mine it just fine, store it but I can\u0027t get it to convert at all. \u003C/p\u003E\u003Cp\u003EFor both of these problems I have looked all over the place and nothing has led me to believe that these mods shouldn\u0027t work for Mac. If anyone can help that would be greatly appreciated. Thanks\u003C/p\u003E\n"},{"CreatedByName":"Tuna7","CreatedById":71947,"CreatedDateTime":"2014-11-10T11:56:50Z","Content":"\n\u003Cp\u003EBump- I\u0027m having the same issue with Kethane.\u003C/p\u003E\n"}]}