{"TopicId":93257,"ForumId":70,"TopicTitle":"Numerous glitches popping up","CreatedByName":"Dragonseye","CreatedById":132191,"CreatedDateTime":"2014-12-17T01:43:32Z","PageNum":1,"Articles":[{"CreatedByName":"Dragonseye","CreatedById":132191,"CreatedDateTime":"2014-12-17T01:43:32Z","Content":"\n\u003Cp\u003EGreetings all, I\u0027ve been banging my head against KSP for some time now and I\u0027ve been really enjoying it until this latest update. I have recently found a growing number of consistent glitches in all three game modes and it\u0027s beginning to worry me. Beware: WALL OF TEXT incoming:\u003C/p\u003E\u003Cp\u003EFirst, I have found that using the Launch Stability part ( the little hold-down arms to stabilize you rocket prior to launch) seems to cause the game to believe that the rocket has not left the ground when in fact it has. The game seems to think that the stabilizers are still a part of the spacecraft even after they have been disconnected and still registers them as being on the ground, and so registers the entire spacecraft as being on the ground. As a result, the camera never shifts to orbital view, and I have no altitude or flight path data in the orbital map. Very distressing. I have found a workaround by simply not using the affected part, but the problem is still there.\u003C/p\u003E\u003Cp\u003ESecond, Having managed to actually get a vehicle into a stable orbit, I attempted to dock a second vehicle, and while the docking was successful on the surface, I later found that the game did not register that the two vessels were docked and that docking two spacecraft caused the camera to go into free mode and zoom out from the vehicle at very high speed. Furthermore, after returning to the space center to clean up the debris, and then resuming the flight, i found that my second spacecraft had completely vanished and Kerbin was now a very large blank blue icon.\u003C/p\u003E\u003Cp\u003EAny help would be appreciated.\u003C/p\u003E\u003Cp\u003EAnd for clarity\u0027s sake, I am running the following mods:\u003C/p\u003E\u003Cp\u003EMechjeb2\u003C/p\u003E\u003Cp\u003EKAS (Kerbal Attachment System)\u003C/p\u003E\u003Cp\u003EDocking Port alignment Indicator (version 4.0)\u003C/p\u003E\u003Cp\u003EI am running Windows 7 64-bit, and I have tried running the game in both 32-bit and 64-bit modes with precisely the same problems on both. My graphics drivers are fully up to date with no problems on any other programs.\u003C/p\u003E\u003Cp\u003EWhile I recognize that the game is still very much in development, what truly upsets me is that everything (and I do mean EVERYTHING) was working flawlessly before version .90, and now it seems that the whole thing is just falling apart.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Akira_R","CreatedById":117470,"CreatedDateTime":"2014-12-17T15:47:57Z","Content":"\n\u003Cp\u003EWell KAS currently isn\u0027t updated for .90 so I would try removing that first and see if you still have the issue. Also if you can upload your output_log.txt that would be helpful as well. See \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E for where to find the appropriate log file.\u003C/p\u003E\n"}]}