{"TopicId":95650,"ForumId":70,"TopicTitle":"Having problems launching","CreatedByName":"diakirai","CreatedById":134395,"CreatedDateTime":"2015-01-04T18:26:49Z","PageNum":1,"Articles":[{"CreatedByName":"diakirai","CreatedById":134395,"CreatedDateTime":"2015-01-04T18:26:49Z","Content":"\n\u003Cp\u003EGot the game about a week ago because it looked like a lot of fun. But since getting it I\u0027ve had problems. As you can see in the photo I linked below my staging isn\u0027t showing up so I can\u0027t launch my rocket. This is a sporadic problem since it comes and goes. Last night for example the game worked (for the most part) totally fine and I could launch rockets no problem. Now after loading up the game I can\u0027t launch anything. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://gyazo.com/903b5954f71463c9edfcce4dbc3d4989\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gyazo.com/903b5954f71463c9edfcce4dbc3d4989\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI have the following mods:\u003C/p\u003E\u003Cp\u003EIXS_Class_for_InterstellarLite\u003C/p\u003E\u003Cp\u003EKAS_0.4.10\u003C/p\u003E\u003Cp\u003EB9_Aerospace_Pack_R5-2-8\u003C/p\u003E\u003Cp\u003EBioDomes\u003C/p\u003E\u003Cp\u003EKW Release Package v2.6d\u003C/p\u003E\u003Cp\u003EHyperEdit 1.3 - for KSP 0.90\u002B\u003C/p\u003E\u003Cp\u003EChatterer_v0.8.0\u003C/p\u003E\u003Cp\u003EThey all play nicely together since I added them one at a time and went in the game as well as them working fine last night. Is there a fix to this? Chatterer also doesn\u0027t work but thats not a big deal to me. \u003C/p\u003E\u003Cp\u003EI will attempt to add some crash reports I have maybe they can help solve the problem.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/folderview?id=0BwnJMhGCji-yTVJ1M3hVT0Z5Zzg\u0026amp;usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/folderview?id=0BwnJMhGCji-yTVJ1M3hVT0Z5Zzg\u0026amp;usp=sharing\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"diakirai","CreatedById":134395,"CreatedDateTime":"2015-01-05T20:28:19Z","Content":"\n\u003Cp\u003Ebump please still having the issues\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-01-05T20:43:42Z","Content":"\n\u003Cp\u003EPlease try removing KAS and check if the issue persists.\u003C/p\u003E\u003Cp\u003EIf yes, remove Hyperedit and try again.\u003C/p\u003E\u003Cp\u003EI believe it\u0027s either one of them.\u003C/p\u003E\u003Cp\u003EIf it still persists, try removing every mod until you find which one caused it, then try to run the game only with that one.\u003C/p\u003E\u003Cp\u003EAlso try to update/reinstall all the mods, or at least KAS and Hyperedit.\u003C/p\u003E\u003Cp\u003EThis issue happened before, there was a fix but I have no idea what it was.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-01-05T20:52:25Z","Content":"\n\u003Cp\u003EI saw this recently but can\u0027t remember what happened, might have been caused by an addon or a bad craft.\u003C/p\u003E\n"},{"CreatedByName":"diakirai","CreatedById":134395,"CreatedDateTime":"2015-01-05T22:13:35Z","Content":"\n\u003Cp\u003EI launch the game off of steam but read that 64 bit version causes issues. Does launching it off steam default to 64 bit? In the Kerbal folder theres a KSP and KSP x64. Is KSP the 32 bit one and I should be launching off that? Also I\u0027ve been reading problems with these mods since apparently KSP was recently updated these mods might have issues. Did I just come in at a bad time where mods are acting up because of it.\u003C/p\u003E\n"},{"CreatedByName":"diakirai","CreatedById":134395,"CreatedDateTime":"2015-01-13T07:35:29Z","Content":"\n\u003Cp\u003ECrashing seems to have gone away...mostly. But now Im having problems with the mod IXS_Class_for_InterstellarLite. Basically when I mouse over the item it grows in size. Linked a gif down below. I\u0027ve had problems with mods in general as you can see but this is definitely a first for this mod. And whats weird is I am using the same \u0022version\u0022 as I was before. I haven\u0027t done a fresh download from curse. So this is a totally new problem from out of nowhere. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://gyazo.com/e2fe134676457155837a552dbe984aa9\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gyazo.com/e2fe134676457155837a552dbe984aa9\u003C/a\u003E\u003C/p\u003E\n"}]}