{"TopicId":186949,"ForumId":106,"TopicTitle":"[Breaking Ground] How does the new helicopter blades work?","CreatedByName":"CrazyGreenPilot_RUS","CreatedById":197915,"CreatedDateTime":"2019-08-04T15:45:27Z","PageNum":1,"Articles":[{"CreatedByName":"CrazyGreenPilot_RUS","CreatedById":197915,"CreatedDateTime":"2019-08-04T15:45:27Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to build \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E crafts using new helicopter blades from Breaking ground DLC. But always when I\u0027m building it, these crafts start crazy rotation or even don\u0027t take off. I know that real helis requires propellers on a tail to kill rotation, but how the physics works in KSP?\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2019-08-04T19:14:55Z","Content":"\n\u003Cp\u003E\nKSP rotors behave largely like real rotors, and also require something to counter-act the torque they impose on the rest of the craft. Do what real helicopters do and either add a perpendicular rotor, or a second but counter-rotating rotor in the same plane as the first. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, thread moved to Breaking Ground sub, because it\u0027s about Breaking Ground. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"jimmywa","CreatedById":172998,"CreatedDateTime":"2019-08-25T18:19:03Z","Content":"\n\u003Cp\u003E\nSome Helicopter Physics for you to engineer kerbal solutions to!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n1)gyroscopic precession \u003Ca href=\u0022https://blog.aopa.org/aopa/2012/01/29/gyroscopic-precession/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://blog.aopa.org/aopa/2012/01/29/gyroscopic-precession/\u003C/a\u003E on my stock heli\u0027s I just turn my joystick 90 degrees to realign the bump from the reaction wheels with the resultant tilt of the rotor disk\n\u003C/p\u003E\n\u003Cp\u003E\n2)advancing blade drag: as you move forward faster the speed increases the effective airspeed on the advancing blade side of the rotor disk. the drag from this makes it harder for the motor to turn the rotor the faster you go. Around 40-50 m/s the motor usually becomes overcome by drag and the rotor RPM drops. This is bad! You really really want to maintain a constant rotor RPM. \n\u003C/p\u003E\n\u003Cp\u003E\n3)retreating blade stall: as you move forward faster the speed decreases the effective airspeed on the retreating blade side of the rotor disk. You will need to trim the roll of the helicopter to remain level. Critical retreating  blade stall is usually about 40-50m/s in KSP. \n\u003C/p\u003E\n\u003Cp\u003E\nSo about 40-50m/s the motor is working super hard to keep up RPM. Then the retreating blade is losing lift. When the RPM begins to drop from advancing blade drag, the retreating blade really stalls and stability is lost. \n\u003C/p\u003E\n\u003Cp\u003E\nhope that is some help\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022E05624C01596CA147FF7B57D56AC6739DBFB1DC5\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/780733079157983599/E05624C01596CA147FF7B57D56AC6739DBFB1DC5/\u0022\u003E\u003C/p\u003E\n"}]}