{"TopicId":191511,"ForumId":106,"TopicTitle":"Are there mods that add more deployable science instruments?","CreatedByName":"iteranthypatic","CreatedById":199102,"CreatedDateTime":"2020-02-09T12:55:26Z","PageNum":1,"Articles":[{"CreatedByName":"iteranthypatic","CreatedById":199102,"CreatedDateTime":"2020-02-09T12:55:26Z","Content":"\n\u003Cp\u003E\nHey everyone,\n\u003C/p\u003E\n\u003Cp\u003E\nI know that a long time ago there was the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/77858-113-surface-experiment-pack-eva-science-for-kiskas-v142-6302016-now-with-less-explosions/\u0022 rel=\u0022\u0022\u003ESurface Experiments Pack\u003C/a\u003E that had Breaking Ground\u0027s surface deployed science features. And as far as I can tell, it was a very well thought out mod. Now that Breaking Ground exists and there\u0027s chance to do more science - are there any mods that build on Breaking Ground\u0027s science packs and/or extend it? I\u0027d love to have more experiments to deploy and more complicated monitoring stations etc. I think it\u0027s a great part of the game and gives the Kerbals something to do on jaunts down to Duna or Eve.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d love to add to the mechanic with whatever the community has been building.\n\u003C/p\u003E\n\u003Cp\u003E\nBest.\n\u003C/p\u003E\n"},{"CreatedByName":"iteranthypatic","CreatedById":199102,"CreatedDateTime":"2020-03-09T12:35:21Z","Content":"\n\u003Cp\u003E\nI\u0027ve found Angel-125\u0027s mini-mods, but haven\u0027t found any mods that extend the breaking ground science pack. \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022106975\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5438962424\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/186546-breaking-ground-mini-mods/\u0026amp;do=embed\u0022 style=\u0022height:208px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThis makes me want to get into mod building to satisfy this itch.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-03-10T18:57:50Z","Content":"\n\u003Cp\u003E\nAside from deployable batteries, which adds batteries to power your deployed science when the sun goes down, I don\u0027t know of any other mods that add deployed science experiments. It\u0027s a bit of a shame really, there are a lot of possibilities- a deployed sky-scanning telescope that could work like a Sentinel, some kind of biological experiments e.g. growing seeds (they do it on the ISS!), or an InSight-style drill that would slowly dig into the surface and collect data from the various layers it encountered.\n\u003C/p\u003E\n"}]}