{"TopicId":174661,"ForumId":62,"TopicTitle":"Valor SMA no KSP para Orbita geossíncrona","CreatedByName":"Gustavo6496","CreatedById":124755,"CreatedDateTime":"2018-05-06T02:20:04Z","PageNum":1,"Articles":[{"CreatedByName":"Gustavo6496","CreatedById":124755,"CreatedDateTime":"2018-05-06T02:20:05Z","Content":"\n\u003Cp\u003E\nO titulo fala por si,\n\u003C/p\u003E\n\u003Cp\u003E\nTava jogando Ksp e  pensei em estabelecer uma orbita de satélites, minha tecnologia não é avançada o suficiente então os satélites não possuem \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E. Passei longos 45 min estabelecendo uma orbita com 3 satélites, após estabelecer as orbitas, passei outros longos 10 seg apreciando meu trabalho, mas eu não tinha conseguido os valores corretos nas orbitas o AP e PE estava entre 2,863,32 a 2,863,89, como não estava confiante dei Fast Foward 7 e sai do pc uns minutos para ver se as orbitas se mantinham, como eu suspeitava 17 anos após o estabelecimento das orbitas elas tinham dessincronizado. Como eu não to afim de lançar outros satélites e to com preguiça de concertar as orbitas ( ate pq eu nem tenho \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E )  eu qra o valor em SMA da orbita geossíncrona para eu colocar na caixa de cheats e magicamente colocar meus satélites na orbita perfeita.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDesde já obrigado. Não me julguem.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2018-05-17T20:26:12Z","Content":"\n\u003Cp\u003E\nok...devíamos ter respondido isto a mais tempo. (Foi mal ae...)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNa verdade você não precisa se preocupar com o valor \u003Cem\u003Eexato\u003C/em\u003E do SMA, desde que ele seja \u003Cem\u003Eexatamente igual \u003C/em\u003Epara os três satélites. Isso já garante que a posição relativa vai se manter, e com os espaçamento correto vai ter sempre algum (embora nem sempre o mesmo) satélite sobre o \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nDe qualquer forma não se preocupe muito em tentar uma sincronia perfeita, primeiro porque você pode até conseguir mas por causa de erros de arredondamento na hora que o jogo salvar a orbita pode variar e estragar a sincronia, segundo porque é muito mais fácil resolver os problemas de sincronia colocando mais satélites em orbita.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPS: Podemos até te julgar um trapaceiro sem vergonha por usar cheats pra colocar satélites em orbita. Mas somos incompetentes na aplicação de qualquer penalidade.\n\u003C/p\u003E\n"}]}