{"TopicId":177358,"ForumId":62,"TopicTitle":"Melhor lugar em Duna !","CreatedByName":"Fabiano P.","CreatedById":189723,"CreatedDateTime":"2018-08-06T16:33:51Z","PageNum":1,"Articles":[{"CreatedByName":"Fabiano P.","CreatedById":189723,"CreatedDateTime":"2018-08-06T16:33:51Z","Content":"\n\u003Cp\u003E\nCriei um objetivo pessoal, para colonizar Duna...\n\u003C/p\u003E\n\u003Cp\u003E\nPra isso o local deve possuir as necessidades básicas para sustentar ao menos 4 Kerbins, durante pelo menos uns 20 a 30 anos... até a independência sustentável\n\u003C/p\u003E\n\u003Cp\u003E\nQualquer dica nesse sentido é bem vinda... desde a equipamento MOD ou Local..\n\u003C/p\u003E\n\u003Cp\u003E\nTenho instalado o \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E, e o Kolonization.\n\u003C/p\u003E\n\u003Cp\u003E\nNão preciso de combustível para foguete, pois não tenho intenção de voltar..... (Kerbin vai entrar em um cataclisma nuclear por gerações), então o objetivo principal seria ser sustentável eternamente, mas se não possível pelo menos alongar a vida em pelo menos 20 anos, levando em consideração que já se perde 1 a 2 para se chegar em Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nEstacionei um satélite de leitura de superfície, e detectei nas calotas polares, 11% de água, cheguei a pousar alguns Kerbits com 1 Kerbin a bordo, adaptados com Drill Matics, porém descobri que não consigo minerar ali pois as brocas não atingem o solo...., não sei se os locais mais viáveis são iguais para todos, assim poderíamos compartilhar localizações....\n\u003C/p\u003E\n\u003Cp\u003E\nEstá lançado a ideia, qualquer dica é bem vinda.\n\u003C/p\u003E\n\u003Cp\u003E\nDede como extrair água, como transforma-la em suplys, e também de como aumentar a autonomia de habitação do \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nQuem poderia ajudar e compartilhar do mesmo desafio?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMarcando replies...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-08-06T16:36:04Z\u0022 title=\u002208/06/2018 04:36  PM\u0022 data-short=\u00226 yr\u0022\u003EAugust 6, 2018\u003C/time\u003E by Fabiano P.\u003C/strong\u003E\n\u003C/span\u003E\n"}]}