{"TopicId":187358,"ForumId":109,"TopicTitle":"KSP 2 Multiplayer Discussion Thread","CreatedByName":"Johnster_Space_Program","CreatedById":187334,"CreatedDateTime":"2019-08-20T00:10:22Z","PageNum":66,"Articles":[{"CreatedByName":"Zeek05","CreatedById":225961,"CreatedDateTime":"2023-02-23T22:09:12Z","Content":"\n\u003Cp\u003E\nI have only two wishes, one is for easy multiplayer modding so mods like warfare will be compatible with MP.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other is for MP to support time warp globally, perhaps called on a vote.\n\u003C/p\u003E\n"},{"CreatedByName":"Monger","CreatedById":4143,"CreatedDateTime":"2023-02-24T00:02:03Z","Content":"\n\u003Cp\u003E\nI just realized that multiplayer probably means completely different things for different players.\n\u003C/p\u003E\n\u003Cp\u003E\nI believe one thing that many players would enjoy is a lively universe, one that is filled with the creations of other players. Considering the difficulties a full-fledged MMO would bring, how about massively-multiplayer offline? Like e.g. Spore handled it? Allow players to upload their creations, including their time stamp. While time progresses in-game, spawn crafts randomly at their corresponding time stamps. This way you will encounter more and more complex structures, each of them custom made.\n\u003C/p\u003E\n"},{"CreatedByName":"t_v","CreatedById":213541,"CreatedDateTime":"2023-02-24T00:38:39Z","Content":"\n\u003Cp\u003E\nOne of the most important details that I personally noticed is that between the interview and article, there was a mention of one player being away (presumably not time warping), another player doing something and the player coming back to see that thing done. There was no mention of whether that player would have to time warp to see the up-to-date world, but at least I can still hold out hope that things are interactive without an extra time warp step. \n\u003C/p\u003E\n"},{"CreatedByName":"Drakenred65","CreatedById":154503,"CreatedDateTime":"2023-02-24T01:44:08Z","Content":"\n\u003Cp\u003E\nSorry decided this belongs in its own thread \n\u003C/p\u003E\n"},{"CreatedByName":"Wheehaw Kerman","CreatedById":223516,"CreatedDateTime":"2023-02-24T02:23:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224237826\u0022 data-ipsquote-contentid=\u0022187358\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677102504\u0022 data-ipsquote-userid=\u0022141823\u0022 data-ipsquote-username=\u0022Truebadour\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/22/2023 at 4:48 PM, Truebadour said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn my opinion, 16 players is more than enough. Imagine the strain on the game if 16 players collaborating meet at the same place and burn together towards DebDeb with interstellar class Daedalus ships.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhy am I hearing Ride of the Valkyries\u003Cem\u003E?\u003C/em\u003E\n\u003C/p\u003E\n"}]}