{"TopicId":187855,"ForumId":109,"TopicTitle":"About KSP 2","CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-08-30T13:16:28Z","PageNum":1,"Articles":[{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-08-30T13:16:28Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/PGj9NMx9pm8?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ShawnPhillips","CreatedById":111721,"CreatedDateTime":"2019-08-30T13:59:18Z","Content":"\n\u003Cp\u003E\nScott Manly and a bunch of other KSP YouTubers that where invited to watch a special demo at Pax West say they came out of it very optimistic. Devs where taking notes on the things the Scott and the others where asking about.\n\u003C/p\u003E\n"},{"CreatedByName":"Teek","CreatedById":74521,"CreatedDateTime":"2019-08-30T14:55:46Z","Content":"\n\u003Cp\u003E\nVery productive post, you must\u0027ve worked hard on it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe thing with disappointment is that it all depends on what you expect.  I\u0027m excited for the game, but what I\u0027m largely trying to avoid setting my expectations too high.  For me, I\u0027m trying not to get my heart set on too many new mechanics and features.  From what we\u0027ve already seen, we can likely count on improved visuals and performance, as well as the mechanics that they\u0027ve already described (Interstellar Travel, new parts, colonies, etc.)  Put all that together, and I\u0027d be pretty satisfied with those results.  Anything in addition to that is a nice bonus.  I know there\u0027s a lot of speculation, and it\u0027s fun to come up with ideas and over-analyze footage, but take nothing for granted that hasn\u0027t been stated by the devs.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the same time though, from what I\u0027ve seen of PAX coverage, most of the things that people were specifically hoping would not happen (DRM, Microtransactions, etc) have already been pretty conclusively ruled out, so I overall I think there\u0027s more to be happy about than not, at least so far.\n\u003C/p\u003E\n"}]}