{"TopicId":194406,"ForumId":109,"TopicTitle":"Bloomberg insight article into studio transition from Star Theory to Intercept Games","CreatedByName":"Poodmund","CreatedById":128643,"CreatedDateTime":"2020-06-03T12:11:32Z","PageNum":11,"Articles":[{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2020-06-06T23:38:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798523\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591482470\u0022 data-ipsquote-userid=\u0022130621\u0022 data-ipsquote-username=\u0022pandaman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, pandaman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDid you actually read the bloomberg artical?  (I copied this from the quote in the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E of this thread)...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:13px;\u0022\u003E“We are offering a compensation package that includes a cash sign-on bonus, an excellen\u003C/span\u003E\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:13px;\u0022\u003Et\u003C/span\u003E\u003Cspan style=\u0022background-color:#fbfbfb;color:#353c41;font-size:13px;\u0022\u003E\u003Cspan\u003E \u003C/span\u003Esalary, bonus eligibility and other benefits,”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOk, before you point it out, the words \u0027increased salary\u0027 are not specifically mentioned here, but I think \u0027excellent\u0027 could be assumed to imply at least equal to their current salaries.  Oh, look.... it mentions  \u0027cash sign-on bonus\u0027, \u0027bonus eligibility\u0027 and \u0027other benefits\u0027 too.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ll grant you the bouns bit. However, just because Take-Two calls the salary \u0022excellent\u0022, that means it\u0027s excellent? Dude, you know damned well that\u0027s an entirely subjective description. That\u0027s corporate lingo for \u0022see how well we\u0027re taking care of them? nothing to see here\u0022\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798536\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591485041\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n29 minutes ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am not going to bat for anybody.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m explaining why freaking out and tossing wild accusations around is not and never will be productive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think anyone\u0027s legit \u0022freaking out\u0022, and which \u0022wild accusations\u0022 are you talking about?\n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2020-06-07T00:33:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798438\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591469289\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI’m not privy to the contract but projects like these usually have milestones with dates on them. It’s not inconceivable that medio December multiple milestones were missed and some tough discussions had taken place on where the project actually was, where it was going to end up and when.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat I\u0027m wondering is this:\n\u003C/p\u003E\n\u003Cp\u003E\nIf Star Theory did miss a contractual deadline then it seems like the development team were more likely responsible for the shortfall than the management (who I presume would be pushing them to meet the deadline.) So why did TTI decide to extend a hiring offer to the entire development team that failed to meet this hypothetical deadline?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-07T00:35:15Z\u0022 title=\u002206/07/2020 12:35  AM\u0022 data-short=\u00224 yr\u0022\u003EJune 7, 2020\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2020-06-07T00:40:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798576\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591489990\u0022 data-ipsquote-userid=\u0022146104\u0022 data-ipsquote-username=\u0022HvP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, HvP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I\u0027m wondering is this:\n\u003C/p\u003E\n\u003Cp\u003E\nIf Star Theory did miss a contractual deadline then it seems like the development team were more likely responsible for the shortfall than the management (who I presume would be pushing them to meet the deadline.) So why did TTI decide to extend a hiring offer to the entire development team that failed to meet this hypothetical deadline?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA thousand cooks in the kitchen can’t cook a steak any faster than 1. \n\u003C/p\u003E\n"},{"CreatedByName":"bitzoid","CreatedById":194151,"CreatedDateTime":"2020-06-07T00:46:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798576\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591489990\u0022 data-ipsquote-userid=\u0022146104\u0022 data-ipsquote-username=\u0022HvP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, HvP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I\u0027m wondering is this:\n\u003C/p\u003E\n\u003Cp\u003E\nIf Star Theory did miss a contractual deadline then it seems like the development team were more likely responsible for the shortfall than the management (who are more likely to be pushing them to meet the deadline.) So why did TTI decide to extend a hiring offer to the entire development team that failed to meet this hypothetical deadline?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt almost sounds like the motive wasn\u0027t that the studio wasn\u0027t delivering, doesn\u0027t it? *I asked facetiously.*\n\u003C/p\u003E\n"},{"CreatedByName":"Lisias","CreatedById":187168,"CreatedDateTime":"2020-06-07T01:40:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798576\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591489990\u0022 data-ipsquote-userid=\u0022146104\u0022 data-ipsquote-username=\u0022HvP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, HvP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf Star Theory did miss a contractual deadline then it seems like the development team were more likely responsible for the shortfall than the management (who I presume would be pushing them to meet the deadline.) \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s always a Management problem.\n\u003C/p\u003E\n\u003Cp\u003E\nThey agreed on a impossible deadline, or hired people unable to accomplish the task.\n\u003C/p\u003E\n\u003Cp\u003E\nIn a way or another, it\u0027s \u003Cstrong\u003EALWAYS\u003C/strong\u003E a Management problem.\n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2020-06-07T06:15:17Z","Content":"\n\u003Cp\u003E\nShort version: insufficient data.\n\u003C/p\u003E\n\u003Cp\u003E\nLong version: I\u0027ve found most of the flak leveled at Take Two laughable, with this being the first real concern. What reassures me somewhat is that job offers were extended to nearly the entire team. This likely was not a cost cutting measure: you don\u0027t offer incompetents a job or needlessly disrupt an effective team.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s entirely possible that one too many insults was passed at the negotiation table and Private Division went for the nuclear option. Never discount ego: businesses are made of people, and people occasionally do irrational things.\n\u003C/p\u003E\n\u003Cp\u003E\nA bit of time will help clarify things: if this was a one off event, or if Private Division will make a habit of hostile takeovers. \n\u003C/p\u003E\n"},{"CreatedByName":"Incarnation of Chaos","CreatedById":197414,"CreatedDateTime":"2020-06-07T07:32:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223797650\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591360460\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/5/2020 at 7:34 AM, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWho needs a KSP2?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere was this game Operation Flashpoint that was an unexpected hit from a small devloper, which was partnered with the Publisher codemasters. Things between the two went south, Codemasters had the rights to the name \u0022Operation Flashpoint\u0022 they made a sequel, but the franchise is dead... I don\u0027t care.\n\u003C/p\u003E\n\u003Cp\u003E\nThe small developer made a \u0022spiritual successor\u0022, named Armed Assault (Aka, Arma), and the Arma franchise continues to this day.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIf TTI is unethical, and if there is a boycott that works, all that happens is the name KSP dies out. The market for such a game does not die out. The Simple Rockets devs could fill the void. Former Squad and Star theory (the non-poached ones) employees, prominent modders, could collaborate on a new spiritual successor, taking... I don\u0027t know a mod name as the new franchise name: \u0022Beyond Home\u0022 or something.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThe message it would send is that there is a market for space similation games, but that particular customer base cares more about ethics than sports franchise fans... or whatever.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EA boycott only fails to achieve results if the customers collectively make it fail.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThat said, I\u0027m still open to hearing TTI\u0027s side of this, and I\u0027d rather not wait for a \u0022spiritual successor\u0022.\u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNobody \u0022Needs\u0022 video games at all, so I\u0027m going to assume you mean \u0022Why would i want KSP2\u0022. KSP has many longstanding issues with it that would likely be fixed with a new game, and KSP2 has seen at least some development before this excrementsstorm. That makes it preferable to starting completely from scratch if the option is available.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd i\u0027m gonna be pretty frank here; i consider it a miracle that KSP ever made it to market in the first place. You\u0027re correct that there\u0027s absolutely nothing preventing anyone from making another soft-sim rocket game, but because of how niche it is and the types of developers and staff needed to make it happen the largest issue is finding anyone willing to fund it that isn\u0027t a massive publisher. Crowdfunding and the like could be used, but also just as easily could be turned into a meme.\n\u003C/p\u003E\n\u003Cp\u003E\nBut my overall point wasn\u0027t that \u0022Don\u0027t Boycott KSP2 because i want my new shiny toy\u0022, it was that \u0022Every boycott iv\u0027e seen in the past related to gaming hasn\u0027t changed the final outcome, so good luck with it folks\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBut your last point? Completely agreed with, and that\u0027s even though i don\u0027t really put any stock in either party at this point.\n\u003C/p\u003E\n"},{"CreatedByName":"nikokespprfan","CreatedById":136115,"CreatedDateTime":"2020-06-07T08:15:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798508\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591480584\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCompanies typically keep 3-6mo worth of expenses cash on hand for events like this. More than that (should you be so lucky) is a waste and should be reinvested in retaining staff and growth. Assuming the spigot turned off abruptly in Dec its not surprising star theory didn’t last long. They may have made it if they were able to quickly land new projects, but COVID closed off most hope of that. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat said, we really have no idea what really happened so this is all conjecture. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBarring any knowledge-breaking insights, this can help us understand a little more about what the spectrum of possibilities is. \n\u003C/p\u003E\n\u003Cp\u003E\nOn one extreme, T2 had a clause in the contract allowing them to terminate it whenever they want, or at least immediately. So the contractual protection of S.T ends in December. Then, given about 3 mnts of pay as per your comment, stretched out over not the full staff as some left for Intercept, Star Theory ran dry their funds and closed on March 4th (which is roughly consistent with these three months of pay), sending their employees home \u0022with a months pay and 2 months health insurance\u0022, as per the Bloomberg Article. In this case, the answer to the question \u0022why would you fire a studio months before a deadline\u0022 would need no explanation, they could per the contract, and negotiations/relations broke down, so they did. \u003Cem\u003EIn this scenario, you could reasonably have the moral qualm as to why TT is able to so quickly fire a studio in the contract in the first place, given what the result would be in general for the studio and its people if T2 were to do that.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn a less extreme case, TT had to wait until some milestone deadline somewhere in between December and march. This means that S.T could have survived a little longer, and was more protected from willynilly mood changes at TT. \u003Cem\u003EThen a question for TT becomes: why do you have milestones that could end the contract built into said contract, which are months before a deadline to deliver the final product? Why would TT want the ability to go like: \u0022well ehh, everything has been going good so far, but you missed the last milestone, and so you are fired for a game people expect next month\u0022.\u003C/em\u003E It doesn\u0027t make sense to me to put this in a contract. But hey, I\u0027ve got no business experience, but as for moral qualms, you could take issue with this.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other extreme, S.T was protected against TTs attempts to break the contract until it expired, which is probably somewhere in March but at least in the spring before March 21, when T2 fiscal year ended. Given the savings we \u003Cem\u003Eexpect \u003C/em\u003Estar theory to have at that point, there must have been a lot of foresight into the hopelessness of the future for S.T to shutter on March 4. This could be the case as well, since the coronavirus pandemic cancelled the conference central to their survival strategy (conventions don\u0027t happen every month), and made publishers more privy in general (making backdoor pitches harder). The employees also go extra pay and health when ST closed, so there needed to be funds for that left. Think about the history of the coronavirus, and think about how far in advance you would cancel a GameDev Conference scheduled in Mid March, whatever the cancellation date, you\u0027d expect it to be close to March 4. This means the cancellation could have been the actual trigger that made ST close down, giving us an insight into how ST saw their chances.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, barring knowledge-breaking insights, what happened is somewhere in between these extremes.\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2020-06-07T09:10:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798596\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591494001\u0022 data-ipsquote-userid=\u0022187168\u0022 data-ipsquote-username=\u0022Lisias\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Lisias said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s always a Management problem.\n\u003C/p\u003E\n\u003Cp\u003E\nThey agreed on a impossible deadline, or hired people unable to accomplish the task.\n\u003C/p\u003E\n\u003Cp\u003E\nIn a way or another, it\u0027s \u003Cstrong\u003EALWAYS\u003C/strong\u003E a Management problem.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is absolutely true. If you ever hear your management say that the deadlines were missed because employees didn\u0027t work hard enough, look for another job. Even if you aren\u0027t implicated, start looking.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, there\u0027s a bit of a difference between \u0022Didn\u0027t deliver what\u0027s promised on time,\u0022 and \u0022Expectations expanded\u0022. It sounds like negotiations weren\u0027t just for extra time, but for larger scope of the game delivered at a later date, to which T2 were amicable, all based on reception of the teaser and consequent information in 2019. If the game was to be released in spring 2020, by early fall, the team should have been polishing and fixing bugs. If instead, they were working on new features based on T2 verbal assurances that they\u0027ll get more time, then by the time formal negotiations started in late fall, early winter, there was no way to ship the game in spring 2020, and that wouldn\u0027t be ST fault. They were working towards later release date in good faith. Nonetheless, it would be sufficient to give T2 grounds for contract termination at this point, because the existing contract did technically specify an infeasible date.\n\u003C/p\u003E\n\u003Cp\u003E\nWe don\u0027t know if that\u0027s what actually happened. In general, deadline extensions are a tricky business. Both sides have to work in good faith, or at least one will get screwed. If ST continued to work towards spring 2020 release despite talks with T2 about extending deadline, a lot of that final polish work would have to be re-done. The game would take even longer to release, and it would cost more money to make, which would have to be reflected in new contract. If ST starts working towards new release date immediately, then they are technically in breach of contract until new contract is signed, giving T2 a lot of leverage.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, it\u0027s also possible that spring 2020 was never a realistic date, and that the game was heading for a delay even under original scope. That would give T2 a lot more reason to be upset. But it still doesn\u0027t explain why Take Two was happy to just hire back majority of these people, including creative director, to continue working on the project. If you have a studio that slips deadlines and negotiates in bad faith, it\u0027s never just one or two people at the head of the studio. It\u0027s always a team effort of at least several senior people in the studio. Primarily, because good managers simply won\u0027t work for awful ones. So the fact that T2 hired a huge chunk of leadership suggests things couldn\u0027t have been all that bad with the delay.\n\u003C/p\u003E\n\u003Cp\u003E\nNaturally, all of this is still speculation. It\u0027s hard to say exactly what sort of promises were made behind closed doors, and what sort of mistakes people made based on partial information rather than due to malice or negligence.\n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2020-06-07T16:35:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798660\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591510517\u0022 data-ipsquote-userid=\u0022122674\u0022 data-ipsquote-username=\u0022Starman4308\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Starman4308 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nShort version: insufficient data.\n\u003C/p\u003E\n\u003Cp\u003E\nLong version: I\u0027ve found most of the flak leveled at Take Two laughable, with this being the first real concern. What reassures me somewhat is that job offers were extended to nearly the entire team. This likely was not a cost cutting measure: you don\u0027t offer incompetents a job or needlessly disrupt an effective team.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s entirely possible that one too many insults was passed at the negotiation table and Private Division went for the nuclear option. Never discount ego: businesses are made of people, and people occasionally do irrational things.\n\u003C/p\u003E\n\u003Cp\u003E\nA bit of time will help clarify things: if this was a one off event, or if Private Division will make a habit of hostile takeovers. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat, exactly do you find laughable?\n\u003C/p\u003E\n\u003Cp\u003E\nA lot of things are entirely possible. What i find peculiar, is that some of you seem so willing to give Take-Two the benefit of the doubt, but won\u0027t extend that same courtesy to Star Theory.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, this was NOT a hostile takeover, it was something far worse.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-07T16:36:24Z\u0022 title=\u002206/07/2020 04:36  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 7, 2020\u003C/time\u003E by Numberyellow\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2020-06-07T17:01:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798835\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591547742\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso, this was NOT a hostile takeover, it was something far worse.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPeople are probably giving Take Two the benefit of the doubt because people [snip] keep saying blatant falsehoods like this against them.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-07T18:34:17Z\u0022 title=\u002206/07/2020 06:34  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 7, 2020\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-06-07T17:26:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798835\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591547742\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat i find peculiar, is that some of you seem so willing to give Take-Two the benefit of the doubt, but won\u0027t extend that same courtesy to Star Theory.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re making an assumption here. I\u0027m willing to give BOTH the benefit of the doubt. Why? Because there is just SO MUCH doubt it\u0027s easy to spread around.\n\u003C/p\u003E\n\u003Cp\u003E\nNo one is claiming that Star Theory is trying to ruin everything, so there\u0027s no reason to argue against them.\n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2020-06-07T17:28:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798841\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591549268\u0022 data-ipsquote-userid=\u0022184845\u0022 data-ipsquote-username=\u0022MechBFP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, MechBFP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPeople are probably giving Take Two the benefit of the doubt because people [snip] keep saying blatant falsehoods like this against them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n[snip]\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the definition of a hostile takeover: \u0022 \u003Cspan\u003E\u003Cspan\u003EA \u003Cb\u003Ehostile takeover\u003C/b\u003E is the acquisition of one company (called the target company) by another (called the acquirer) that is accomplished by going directly to the company\u0027s shareholders or fighting to replace management to get the acquisition approved.\u003C/span\u003E\u003C/span\u003E \u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThis was, by definition, NOT a hostile takeover.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798853\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591550761\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou\u0027re making an assumption here. I\u0027m willing to give BOTH the benefit of the doubt. Why? Because there is just SO MUCH doubt it\u0027s easy to spread around.\n\u003C/p\u003E\n\u003Cp\u003E\nNo one is claiming that Star Theory is trying to ruin everything, so there\u0027s no reason to argue against them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt doesn\u0027t seem like you\u0027re willing to give Star Theory the benefit of the doubt..you\u0027ve stated that you don\u0027t believe the information presented in the article, which was acquired from people who worked in the company. You\u0027ve characterized people\u0027s reaction to what is clearly lousy, as \u0022freaking out\u0022, and flinging \u0022wild accusations\u0022. The way in which you word your posts leads me to believe you don\u0027t really think Star Theory was wronged, and that Take-Two didn\u0027t really do anything wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nno one is claiming that Star Theory is trying to ruin everything, and no one is really claiming that Take-Two is trying to ruin everything.... we\u0027re reacting to Take-Two having done something really disgusting, entirely out of the ordinary for the industry, yet, completely in line with their corporate personality, as supported by their track record of bad behavior.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-07T18:35:42Z\u0022 title=\u002206/07/2020 06:35  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 7, 2020\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MechBFP","CreatedById":184845,"CreatedDateTime":"2020-06-07T18:09:50Z","Content":"\n\u003Cp\u003E\nYou are correct it doesn’t meet the classical definition/style of a hostile takeover but the end result appears to have been the same thing. The only real difference is they didn’t acquire the actual company name in this case. They obviously got a significant portion of the employees and apparently all the work the project team did in the last 2 years as well. It just looks like the name of the company wasn’t important enough to acquire. \u003Cbr\u003E\u003Cbr\u003E\nIt is possible they expected more people to jump ship, but it is also possible they assumed a number of people would quit anyway in a classical hostile takeover strategy.\n\u003C/p\u003E\n\u003Cp\u003E\nHad ST been the owner of whatever work they had completed, T2 definitely wouldn’t have been able to go this route though.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-07T18:10:23Z\u0022 title=\u002206/07/2020 06:10  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 7, 2020\u003C/time\u003E by MechBFP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2020-06-07T18:36:23Z","Content":"\n\u003Cp\u003E\nSome personal remarks have been removed. Please discuss the subject rather than each other. \n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2020-06-07T18:48:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798835\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591547742\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat, exactly do you find laughable?\n\u003C/p\u003E\n\u003Cp\u003E\nA lot of things are entirely possible. What i find peculiar, is that some of you seem so willing to give Take-Two the benefit of the doubt, but won\u0027t extend that same courtesy to Star Theory.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, this was NOT a hostile takeover, it was something far worse.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat I\u0027ve heard about Take Two:\n\u003C/p\u003E\n\u003Cp\u003E\nAn boilerplate EULA whose more plausibly threatening terms were never enforced.\n\u003C/p\u003E\n\u003Cp\u003E\nThey briefly shut down a mod for GTA that \u003Cem\u003Edid\u003C/em\u003E break EULA and permit breaking DRM.\n\u003C/p\u003E\n\u003Cp\u003E\nNone of us know for certain what went down, but given the kneejerk reactions many have to anything Take Two does and the sensationalism that surrounds it, I\u0027m inclined to give them the benefit of the doubt.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d give Star Theory the benefit of the doubt as well, but Star Theory is no longer in existence. I can\u0027t not-boycott a company that folded.\n\u003C/p\u003E\n\u003Cp\u003E\nOverall, I\u0027m glad for this thread, because I did have a very negative reaction based on that Bloomberg article, and some of the comments here made me remember \u0022oh yeah, media coverage is frequently sensationalist and there may be much more to the story\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2020-06-07T19:29:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798908\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591555729\u0022 data-ipsquote-userid=\u0022122674\u0022 data-ipsquote-username=\u0022Starman4308\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, Starman4308 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I\u0027ve heard about Take Two:\n\u003C/p\u003E\n\u003Cp\u003E\nAn boilerplate EULA whose more plausibly threatening terms were never enforced.\n\u003C/p\u003E\n\u003Cp\u003E\nThey briefly shut down a mod for GTA that \u003Cem\u003Edid\u003C/em\u003E break EULA and permit breaking DRM.\n\u003C/p\u003E\n\u003Cp\u003E\nNone of us know for certain what went down, but given the kneejerk reactions many have to anything Take Two does and the sensationalism that surrounds it, I\u0027m inclined to give them the benefit of the doubt.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d give Star Theory the benefit of the doubt as well, but Star Theory is no longer in existence. I can\u0027t not-boycott a company that folded.\n\u003C/p\u003E\n\u003Cp\u003E\nOverall, I\u0027m glad for this thread, because I did have a very negative reaction based on that Bloomberg article, and some of the comments here made me remember \u0022oh yeah, media coverage is frequently sensationalist and there may be much more to the story\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nmedia is often sensationalist, because that\u0027s what sells papers, gets subscriptions, and clicks....it glues butts to seats, and eyes to screens. The Don Henley song \u0022Dirty Laundry\u0022 nailed it decades ago.\n\u003C/p\u003E\n\u003Cp\u003E\nSchreier is a great example of why we should never take anything the media tells us at face value, unless it\u0027s a relay of information from first-party sources.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, you\u0027re forgetting what Take-Two did to Supmatto. All he did was report on information that was accidentally leaked by a careless Gearbox employee, and for that, they Harassed him with \u0022private investigators\u0022 (actually thugs) whom the company sent to this guy\u0027s house, to intimidate him. They had all of his social media accounts nuked, after falsely claiming that he was using them to distribute stolen proprietary information...i think they even sued him. They utterly destroyed this guy\u0027s life, in order to cover for a mistake made by a gearbox employee. What they did to this guy, is why i\u0027ll never buy another of their products. What they did to Star Theory just reinforces that decision.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-06-07T19:29:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798855\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591550937\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt doesn\u0027t seem like you\u0027re willing to give Star Theory the benefit of the doubt..you\u0027ve stated that you don\u0027t believe the information presented in the article, which was acquired from people who worked in the company.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI do not believe I ever said that. What I feel is that the article does not contain the truth, but snippets of truth designed to tell a story that will garner ad views and clicks. I also believe that there are other truths that were not in the story - either because they were and still are not known or because the author decided they were not in line with the story they were telling.\n\u003C/p\u003E\n\u003Cp\u003E\nI would be shocked to learn that I said I thought anybody who was interviewed lied. If I even implied that, I retract it without reservation.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou\u0027ve characterized people\u0027s reaction to what is clearly lousy, as \u0022freaking out\u0022, and flinging \u0022wild accusations\u0022. The way in which you word your posts leads me to believe you don\u0027t really think Star Theory was wronged, and that Take-Two didn\u0027t really do anything wrong.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat I don\u0027t believe is that we know enough to know.\n\u003C/p\u003E\n\u003Cp\u003E\nI also believe very strongly that nobody has any obligation to deliver us any of this information, nor do we have any right to expect it.\n\u003C/p\u003E\n\u003Cp\u003E\nI further believe that anybody other than those directly involved who is proposing to deliver this information has an agenda, and that agenda is almost assuredly not \u0022oh these poor programmers.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not going to trawl this thread for instances of people wildly accusing or freaking out, as I don\u0027t have the time or willingness to and any specific instances will just cause a \u0022no it\u0027s not,\u0022 \u0022yes it is,\u0022 back and forth. I\u0027ll take it back as a wild accusation itself.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s what I know, from the article with all the cruft cut out:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nStar Theory failed to meet at least 2 deadlines. This could be the fault of either party or no party. But it\u0027s a fact. Twice the release date has been pushed so at least twice, a deadline was not met.\n\u003C/li\u003E\n\u003Cli\u003E\nThe three main creative leads of the project left immediately when offered a new job. Maybe they were scared of losing their job. Maybe they only cared if they could work on KSP2 and not who for. Maybe they hated their old bosses. Maybe maybe maybe. I don\u0027t care why because I don\u0027t know why and I can\u0027t know why. They left immediately. I got this from the article and see no reason to not believe it as a fact.\n\u003C/li\u003E\n\u003Cli\u003E\n1/3 of the programmers followed them immediately. Over 1/2 did eventually. This I also got from the article.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nIn my opinion the rest of the fallout is immaterial. COVID19 hit. Star Theory couldn\u0027t remain solvent. Same thing happened to the taco place down the street and I\u0027ve spent a lot more money there in the past than I have on Take Two games. I\u0027m also a lot more upset about it but that\u0027s not really the point of this post. The point is it happens. Companies fail especially when hit with multiple instances of bad news.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s an example of something that may have happened. Maybe the two business leads of Star Theory were bad at their job. They were overworking the programmers and making unmeetable deadlines and propping up the company with metaphorical sticks and canvas, hoping to sell to Take Two, make a bunch of unearned money, then cut and run. But Take Two didn\u0027t like the terms, so negotiated long enough for the ruse to become obvious when the second deadline (which the programmers were furiously trying to meet in spite of it being impossible) passed unmet. At this point, the contract became void and Take Two could release themselves from it. So they had two choices: Drop Star Theory like a hot potato and star over, or head hunt Star Theory\u0027s best resource - the actual people who did the actual work - and continue making the game.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d be interested in facts that don\u0027t back this scenario up. Note I\u0027m not calling this scenario a theory, or a hypothesis, or even a possibility. I\u0027m using it as an example of one of hundreds of scenarios someone could come up with that reasonably fit the real, actual data we have. Data that is so scant that no one can really come up with anything that fits it that they can say with any assurance is the truth.\n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2020-06-07T19:41:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798923\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591558191\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThings and stuff\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOk, this is all entirely reasonable. I do wish we had more information..\n\u003C/p\u003E\n\u003Cp\u003E\none thing i will push back on is that we don\u0027t have any right to expect information. Take-Two did something that a lot of us are saying is really lousy. A lot of us are unwilling to buy the game now, BECAUSE of this. In order to save reputation, and maximize sales, it would be in their best interest to tell the people they are hoping will buy their game, what exactly happened. I don\u0027t think that\u0027s unreasonable. But that\u0027s just me. We don\u0027t hafta agree.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-06-07T20:07:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798930\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591558886\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nit would be in their best interest to tell the people they are hoping will buy their game, what exactly happened\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would like to agree with you on this one. I agree that it SHOULD be this way. But I really don\u0027t think it is. The sad truth is people have short attention spans and the first gameplay video or sneak peak will pull a lot of die-hard petition signers into the Hype Train ticket line.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd at the very least, Take Two would need a full office of lawyers to pen up the statement so as to not get sued by someone for something, and that statement would reek of lawyer speak so much that no one would take it seriously.\n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2020-06-07T20:12:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798941\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591560427\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI would like to agree with you on this one. I agree that it SHOULD be this way. But I really don\u0027t think it is. The sad truth is people have short attention spans and the first gameplay video or sneak peak will pull a lot of die-hard petition signers into the Hype Train ticket line.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, it SHOULD be that way... And sadly, you\u0027re kinda right....People these days lack resolve, and conviction. I don\u0027t have that problem. I already had plenty of reasons to not buy anything Take-Two publishes. Yeah, it sucks that i hafta miss out on things, but whatever....there are plenty of OTHER things to keep me occupied.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd at the very least, Take Two would need a full office of lawyers to pen up the statement so as to not get sued by someone for something, and that statement would reek of lawyer speak so much that no one would take it seriously.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAin\u0027t that the truth..\n\u003C/p\u003E\n"},{"CreatedByName":"Lisias","CreatedById":187168,"CreatedDateTime":"2020-06-07T23:25:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798930\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591558886\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTake-Two did something that a lot of us are saying is really lousy. A lot of us are unwilling to buy the game now, BECAUSE of this.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou got a pretty good point here.\n\u003C/p\u003E\n\u003Cp\u003E\nPlaying the Devil\u0027s advocate, I want to remember that Companies are essentially sociopaths: any one that would try by itself any if the dirty tricks a Company usually does, and this poor stand-up guy will face a hell of a backslash from friends to family. Do you would invite a relative to dinner with your kids if the guy is a drug dealer?\n\u003C/p\u003E\n\u003Cp\u003E\nBeing all companies essential sociopaths entities, I\u0027m starting to think this leakage to the press is part of a hidden agenda....\n\u003C/p\u003E\n"},{"CreatedByName":"Lewie","CreatedById":203745,"CreatedDateTime":"2020-06-07T23:27:26Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/172745-numberyellow/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022172745\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/172745-numberyellow/\u0022 rel=\u0022\u0022\u003E@Numberyellow\u003C/a\u003E you summed it up perfectly. Ksp is so well along that it is  a great game and I’d be fine playing with the more recent updated version of ksp then ksp2. I probably will still buy ksp2, but I’m going to wait and see what it’s like first.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2020-06-07T23:50:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798930\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591558886\u0022 data-ipsquote-userid=\u0022172745\u0022 data-ipsquote-username=\u0022Numberyellow\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Numberyellow said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn order to save reputation, and maximize sales, it would be in their best interest to tell the people they are hoping will buy their game, what exactly happened.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis assumes that telling exactly what happened would paint them in a more favorable light, that is far from obvious. \n\u003C/p\u003E\n\u003Cp\u003E\nThat said, I agree wholeheartedly with Superfluous Horseman. We don\u0027t have all the facts, we likely will never have all the facts. Stuff happens. \n\u003C/p\u003E\n\u003Cp\u003E\nI try not to play politics with gaming. If the game is appealing to me I\u0027ll buy it, I don\u0027t care what people say about the company. If the game is not appealing I will not buy it, no matter how awesome the company. I think the gaming market in general reacts this way, so if they are concerned about sales by far the best thing they can do is produce the best possible game by whatever means they have. \n\u003C/p\u003E\n"},{"CreatedByName":"Numberyellow","CreatedById":172745,"CreatedDateTime":"2020-06-08T13:20:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223799021\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591572349\u0022 data-ipsquote-userid=\u0022187168\u0022 data-ipsquote-username=\u0022Lisias\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Lisias said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou got a pretty good point here.\n\u003C/p\u003E\n\u003Cp\u003E\nPlaying the Devil\u0027s advocate, I want to remember that Companies are essentially sociopaths: any one that would try by itself any if the dirty tricks a Company usually does, and this poor stand-up guy will face a hell of a backslash from friends to family. Do you would invite a relative to dinner with your kids if the guy is a drug dealer?\n\u003C/p\u003E\n\u003Cp\u003E\nBeing all companies essential sociopaths entities, I\u0027m starting to think this leakage to the press is part of a hidden agenda....\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s an interesting way of looking at things.... but i don\u0027t agree. See, i don\u0027t buy the whole \u0022corporate personhood\u0022 thing..\n\u003C/p\u003E\n\u003Cp\u003E\nIndividuals can be sociopaths, companies cannot, because companies aren\u0027t alive. I believe corporate boards are made up almost exclusively of sociopaths. It\u0027s almost like it\u0027s a prerequisite for being on a corporate board.\n\u003C/p\u003E\n"}]}