{"TopicId":194406,"ForumId":109,"TopicTitle":"Bloomberg insight article into studio transition from Star Theory to Intercept Games","CreatedByName":"Poodmund","CreatedById":128643,"CreatedDateTime":"2020-06-03T12:11:32Z","PageNum":1,"Articles":[{"CreatedByName":"Poodmund","CreatedById":128643,"CreatedDateTime":"2020-06-03T12:11:32Z","Content":"\n\u003Cp\u003E\nBloomberg\u0027s new reporter, Jason Schreier, has just released an article delving into what happened with KSP\u0027s production last year transitioning from Star Theory to Take Two\u0027s in-house studio, Intercept Games. Its an interesting read. I advise you to read it on the Bloomberg site so they can track metrics but will post a transcipt below in case it gets pay walled at a later date:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.bloomberg.com/news/articles/2020-06-03/kerbal-space-program-2-release-disrupted-by-corporate-strife\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.bloomberg.com/news/articles/2020-06-03/kerbal-space-program-2-release-disrupted-by-corporate-strife\u003C/a\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther\u0022\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedid=\u0022embed4593147024\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=https://twitter.com/jasonschreier/status/1268136203158765568\u0022 style=\u0022height:708px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne Friday evening last December, employees of game designer Star Theory Games each received the same unusual recruitment message over LinkedIn. It struck them as bizarre for two reasons. One, it came from an executive producer at the publishing company funding their next video game. Two, it said the game—in the works for the previous two years—was being pulled from their studio.\n\u003C/p\u003E\n\u003Cp\u003E\n“This was an incredibly difficult decision for us to make, but it became necessary when we felt business circumstances might compromise the development, execution and integrity of the game,” Michael Cook, the executive at Take-Two Interactive Software Inc., wrote in the message, which was reviewed by Bloomberg. “To that end, we encourage you to apply for a position with us.”\n\u003C/p\u003E\n\u003Cp\u003E\nIt was strange and disconcerting news to Star Theory’s employees. Normally, an announcement like this would be delivered in a companywide meeting or an email from Star Theory’s leadership team. The contract with Take-Two was the studio’s only source of revenue at the time. Without it, the independent studio was in serious trouble. \n\u003C/p\u003E\n\u003Cp\u003E\nThe LinkedIn message went on to say Take-Two was setting up a new studio to keep working on the same game Star Theory had been developing, a sequel to the cult classic Kerbal Space Program. Take-Two was looking to hire all of Star Theory’s development staff to make that happen. “We are offering a compensation package that includes a cash sign-on bonus, an excellent salary, bonus eligibility and other benefits,” Cook wrote.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen employees returned to the office on Monday, Star Theory founders Bob Berry and Jonathan Mavor convened an all-hands meeting. The two men had been in discussions about selling their company to Take-Two but were dissatisfied with the terms, they explained. The game’s cancellation was a shock, but the founders assured staff that Star Theory still had money in the bank and could try to sign other deals, according to five people who attended the meeting and asked not to be identified, citing the risk of litigation. Berry and Mavor encouraged employees to stick together and stay at the company.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next few weeks were chaos, employees said. Take-Two hired more than a third of Star Theory’s staff, including the studio head and creative director. By March, as the coronavirus pandemic choked the global economy, any hope of saving the business appeared to be lost, and Star Theory closed its doors.\n\u003C/p\u003E\n\u003Cp\u003E\nEven by the cutthroat standards of the video game business, Take-Two’s tactics were extreme. The company behind the Grand Theft Auto franchise is one of America’s largest publishers, with a market value of $15 billion. The stock is up 10% this year and trading near an all-time high, thanks to increased demand from people stuck at home. Take-Two cultivated a leading position in publishing through a mix of big-budget games developed in-house and by a tightknit group of studio partners. Publishers like Take-Two control a project’s financing, marketing and distribution, giving them a great deal of leverage over most developers they sign.\n\u003C/p\u003E\n\u003Cp\u003E\nThe swift demise of Star Theory and the events of its three final months, which have not been previously reported, highlight the frailty of those business relationships and the power dynamics within the industry.\n\u003C/p\u003E\n\u003Cp\u003E\nBrian Roundy, a spokesman for Take-Two’s Private Division publishing label, said the company contacted “every member of the development team” at Star Theory with an invitation to join the new studio, called Intercept Games. “More than half of the team is now at Intercept Games,” Roundy wrote. “In doing so, we are empowering our deeply passionate and talented team to focus on quality, and we are thrilled with the progress that they are making on the game.” Star Theory’s Berry and Mavor didn’t respond to requests for comment.\n\u003C/p\u003E\n\u003Cp\u003E\nPatrick Meade, a senior engineer at Star Theory, said he turned down the job offer from Take-Two. He declined to discuss the events in detail but said he didn’t want to work for a big company where he wouldn’t have the same degree of influence or financial benefits if the game were a hit. “I was at a small studio, where the work I did had a massive impact on our success,” Meade said. “When I see myself at any large corporation, that is fundamentally not true.”\n\u003C/p\u003E\n\u003Cp\u003E\nBerry and Mavor started their game studio in 2008 in Bellevue, Washington. They called it Uber Entertainment, later changing the name to Star Theory following the rise of a certain ride-hailing company. Early hits included Monday Night Combat, a cartoonish shooter that sold more than 300,000 copies, and Planetary Annihilation, a strategy game that raised more than $2 million on Kickstarter.\n\u003C/p\u003E\n\u003Cp\u003E\nIn 2017, Star Theory began working with Take-Two on its most high-profile project. Take-Two had \u003Ca href=\u0022https://ir.take2games.com/news-releases/news-release-details/take-two-interactive-software-inc-acquires-kerbal-space-program?ID=2277633\u0026amp;c=86428\u0026amp;p=irol-newsArticle\u0022 rel=\u0022external nofollow\u0022\u003Epurchased the rights\u003C/a\u003E to a popular flight simulation game developed by another independent studio and contracted Star Theory to make a sequel. The original game, Kerbal Space Program, allowed players to construct and launch rockets using realistic physics. It sold more than 2 million copies, was critically acclaimed and even led to partnerships with NASA and the European Space Agency. Gamers, like moviegoers, tend to flock to brands they know, so working on a well-liked franchise is a chance for a studio to increase sales and gain exposure.\n\u003C/p\u003E\n\u003Cp\u003E\nThe view inside Star Theory was that development on Kerbal Space Program 2 was proceeding smoothly, according to the people who worked on the project. A preview of the game on display at the Penny Arcade Expo in September left fans impressed, and Take-Two’s public enthusiasm for the title was rising, said Doug Creutz, an analyst at Cowen \u0026amp; Co.\n\u003C/p\u003E\n\u003Cp\u003E\nLate last year, Take-Two agreed to extend Star Theory’s development deadline by six months to add new content to the game. That kicked off a new round of contract negotiations. All seemed well, said the people who worked on the game, until Dec. 6, when the project was pulled and the LinkedIn messages went out. At the hastily called staff meeting a few days later, the founders said in addition to sale talks, they had been trying to clarify royalty terms, which were unclear in their contract, they told employees.\n\u003C/p\u003E\n\u003Cp\u003E\nThree of Star Theory’s leaders—Jeremy Ables, the studio chief; Nate Simpson, the creative director; and Nate Robinson, the lead producer—departed for Take-Two’s new studio immediately. Other staff mulled whether to go, torn between leaving and abandoning their colleagues or staying and risking their livelihoods, they said. One employee, who asked not to be identified, said they felt a mix of confusion and fury, adding that they’d never been put in this type of position.\n\u003C/p\u003E\n\u003Cp\u003E\nThe attempt at hiring away the development team came with business risks, both for the project and for Take-Two if word got out, said Creutz. “They\u0027ve got a game they\u0027ve got high hopes for, and they have now potentially injected an enormous amount of disruption into the development process,” he said. “You could be taking a reputational risk as well, if you want other studios to work with you and it appears that you play this kind of move when things don\u0027t go the way you want.”\n\u003C/p\u003E\n\u003Cp\u003E\nAbout a dozen of Star Theory’s 30 employees wound up leaving for Take-Two’s new studio, while the rest stuck around in an attempt to save the business, they said. By January, the remaining team had a plan in place: Each employee would spend the next two months brainstorming new ideas and building prototypes. Then they would pitch the best ones to publishers at the Game Developers Conference in mid-March in the hope of securing a new deal, the five workers said. The annual conference is always full of publishers looking to make investments in indie studios with proven track records.\n\u003C/p\u003E\n\u003Cp\u003E\nThen came the pandemic. The conference was canceled, leaving Star Theory with nowhere to take its pitches. Publishers, sensing an economic downturn, tightened their spending. On March 4, Star Theory shut down. Each worker received a month’s pay and two months of health insurance, said three former employees. A few joined their former colleagues at Take-Two’s Intercept Games.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Space Program 2 remains in development at \u003Ca href=\u0022https://www.kerbalspaceprogram.com/dev-diaries/introducing-intercept-games/\u0022 rel=\u0022external nofollow\u0022\u003EIntercept\u003C/a\u003E. The game had been set to come out this year, but the company said last month it was delaying the release \u003Ca href=\u0022https://twitter.com/KerbalSpaceP/status/1263190715141627904\u0022 rel=\u0022external nofollow\u0022\u003Euntil the fall of 2021\u003C/a\u003E. “With everything going on in the world today due to the Covid-19 outbreak,” the company said, “we’re facing many unique challenges.”\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n- By Jason Schreier, Bloomberg, 3 June 2020, 11:00 BST\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T12:12:42Z\u0022 title=\u002206/03/2020 12:12  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by Poodmund\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RockyTV","CreatedById":57161,"CreatedDateTime":"2020-06-03T13:00:43Z","Content":"\n\u003Cp\u003E\nThis is just sad. And a terrible move by Take2. If T2 wasn\u0027t already being criticized for its past behavior (for example, banning singleplayer mods on GTA V, taking legal action against modders from OpenIV and FiveM), they will certainly be criticized now. They pulled funding for an indie studio because they didn\u0027t agree with the buyout terms, then poached the majority of its team.\u003Cbr\u003E\u003Cbr\u003E\nMy hopes for KSP2 were high, seeing the developers contacting scientists and asking about science was great and looked like KSP2 was going to be amazing. But now it\u0027s just sort of gone. I wouldn\u0027t be surprised if the game becomes an Epic Games exclusive, with little to no modding support and no Linux and macOS support, all that behind an anti-cheat that doesn\u0027t work on anything but Windows.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nThanks for killing a dream, Take 2.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-06-03T13:15:07Z","Content":"\n\u003Cp\u003E\nThat\u0027s what happens when you deal with Take 2. That sort of thing should probably be outlawed as anticompetitive, but it isn\u0027t. I\u0027ve been waiting for something like that to happen since T2 bought KSP. \n\u003C/p\u003E\n\u003Cp\u003E\nThat said, science they did showcase was spotty, anyway, even if they were enthusiastic about it, and the UI they made so far looks weird, so I was already lukewarm about KSP2. If it ends up being a flop because of T2 meddling, at least it won\u0027t have a chance to teach people about already debunked concepts, so I suppose that\u0027s a win, in a way...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T13:16:26Z\u0022 title=\u002206/03/2020 01:16  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2020-06-03T13:31:11Z","Content":"\n\u003Cp\u003E\nAfter reading that, I honestly don\u0027t think I\u0027d be comfortable buying KSP2 at all anymore. I\u0027d somewhat hoped (clearly naively) that it\u0027d be spared from T2\u0027s unethical practices by being contracted out to an independant studio, but apparently I was wrong.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T13:49:07Z\u0022 title=\u002206/03/2020 01:49  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by GluttonyReaper\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2020-06-03T13:43:03Z","Content":"\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\ni also posted about this as i became aware of it.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022196576\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed6802381783\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/191802-private-divisions-new-development-studio/page/2/\u0026amp;tab=comments\u0026amp;do=embed\u0026amp;comment=3796182\u0026amp;embedComment=3796182\u0026amp;embedDo=findComment#comment-3796182\u0022 style=\u0022height:299px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThis community consists of the highest concentration of highly-intelligent people i know.\u003Cbr\u003E\nI\u0027m hoping for actions from take2 in reaction of this article that consider this fact.\u003Cbr\u003E\nGive us reasons to believe in you and to follow you.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T13:44:17Z\u0022 title=\u002206/03/2020 01:44  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by VITAS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerrMü","CreatedById":78387,"CreatedDateTime":"2020-06-03T13:45:52Z","Content":"\n\u003Cp\u003E\nI´m very sorry to say this, but that´s just what happens again and again when an indie project get´s bought by a big developer. What I particularly liked about KSP was that it was developed by a very open and friendly independant development team. I´ve been sceptical but had high hopes for KSP2. I´m afraid that ship has sailed.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is still a chance that this is going to be an awesome game, it just becomes increasingly less likely. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223796193\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591191071\u0022 data-ipsquote-userid=\u002259429\u0022 data-ipsquote-username=\u0022GluttonyReaper\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, GluttonyReaper said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAfter reading that, I honestly don\u0027t think I\u0027d be comfortable at all buying KSP2 at all anymore. I\u0027d somewhat hoped (clearly naively) that it\u0027d be spared from T2\u0027s unethical practices by being contracted out to an independant studio, but apparently I was wrong.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n^ pretty much what I thougt.\n\u003C/p\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2020-06-03T13:54:51Z","Content":"\n\u003Cp\u003E\nHuh. This is a bit disheartening.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the development is directly controlled by T2 now? That can\u0027t be good - remember how scared everyone got when we got their new EULA in early 2018, and that wasn\u0027t ever really enforced. Now that it\u0027s in-house rather than being contracted out to an indie developer, a lot of the values that made me fall in love with KSP could go out the window, as others have said. We could be peppered with cosmetic DLC, we could have barely any modding support, it could even become an Epic Games exclusive or whatever. \n\u003C/p\u003E\n\u003Cp\u003E\nThis game could still be amazing. I hope you can do the sequel to my favourite game of all time justice, Take 2. But from now until release, I will be watching with scepticism.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T13:55:15Z\u0022 title=\u002206/03/2020 01:55  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by RealKerbal3x\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-06-03T14:22:31Z","Content":"\n\u003Cp\u003E\nIt would be interesting to hear T2\u0027s side of the story. This is extreme and carries the potential for a major reputation hit inside the industry, which is a problem if their strategic goal is to cultivate a stable of indie studios that develop games for them to publish. And of course it risked the development of the game and must have been a major morale hit to the team even in the best of cases.\n\u003C/p\u003E\n\u003Cp\u003E\nI suspect there might be more to it than that, there usually is. I really wonder what did go wrong? People don\u0027t usually pull this kind of stunt over negotiable differences with royalties.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2020-06-03T14:36:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223796223\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591194151\u0022 data-ipsquote-userid=\u0022167629\u0022 data-ipsquote-username=\u0022Brikoleur\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Brikoleur said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt would be interesting to hear T2\u0027s side of the story. This is extreme and carries the potential for a major reputation hit inside the industry, which is a problem if their strategic goal is to cultivate a stable of indie studios that develop games for them to publish. And of course it risked the development of the game and must have been a major morale hit to the team even in the best of cases.\n\u003C/p\u003E\n\u003Cp\u003E\nI suspect there might be more to it than that, there usually is. I really wonder what did go wrong? People don\u0027t usually pull this kind of stunt over negotiable differences with royalties.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree; there\u0027s usually two sides to a story. By no means makes that less of a **** move and motivations were probably less than pure, but at the same time decisions are hardly ever made just for the sake of being evil.\n\u003C/p\u003E\n\u003Cp\u003E\nMy suspicion is that deadlines were missed and a conversation along these lines was held:\u003Cbr\u003E\n\u0022\u003Cem\u003EWhy don\u0027t you put more people on it?\u0022\u003C/em\u003E (nvm the fact that throwing in more bodies rarely speeds up a software development project)\u003Cbr\u003E\n\u0022\u003Cem\u003EWe don\u0027t have that many people\u003C/em\u003E\u0022\u003Cbr\u003E\n\u0022\u003Cem\u003EWell you have x on the project but y in your company\u0022\u003C/em\u003E\u003Cbr\u003E\n\u0022\u003Cem\u003EYes, but we need to develop other problems as well; we can\u0027t have KSP as our \u003Cstrong\u003Eonly\u003C/strong\u003E project\u003C/em\u003E\u0022\u003Cbr\u003E\n\u0022\u003Cem\u003ENo! We tell you... put more people on it\u003C/em\u003E\u0022 *stamps feet*\u003Cbr\u003E\n\u0022\u003Cem\u003EDon\u0027t tell us how to run OUR business - we\u0027re working on delivering what we promised\u003C/em\u003E\u0022\u003Cbr\u003E\n\u0022\u003Cem\u003EORLY?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nManagement is always about control and you\u0027d not be manager for long if things go bad, you\u0027re not in control and you\u0027re fine with that. If things were going just fine nothing would have changed. Remember; T2 invested a ton of money in KSP and has no reason to jeopardize that investment by a major disruption and that\u0027s just what happened. What we don\u0027t know is the reason. Timelines? Artistic vision (unlikely given they hired Nate Simpson)? Micropayments? Even if things truly went south and in reality T2 bailed out KSP by doing this, hanging out the dirty laundry would reflect bad on them so they won\u0027t do that. Truth is, we don\u0027t really know what happened. It makes T2 look bad but without knowing the underlying issue it\u0027s really hard to judge.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-06-03T14:45:00Z","Content":"\n\u003Cp\u003E\nOh I would be surprised of T2 did something like this out of the pureness of their hearts.\n\u003C/p\u003E\n\u003Cp\u003E\nEven so, this is not something you expect to do when you sign a contract with a studio. Something must have gone badly sour. It\u0027s unlikely we\u0027ll ever get the full story, and a half a story is better than nothing but... well, that\u0027s all it is at this point.\n\u003C/p\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2020-06-03T15:09:37Z","Content":"\n\u003Cp\u003E\nIts for them to explain themselves not for us to explain them.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-06-03T15:18:04Z","Content":"\n\u003Cp\u003E\nSounds sad, but in its time it was not considered unethical to intercept the Squad\u0027s project.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, the \u0022Intercept\u0022 is a perfectly accurate name for the new company, lol.\n\u003C/p\u003E\n\u003Cp\u003E\nP.S.\u003Cbr\u003E\nAlso presuming that HarvesteR exited willingly.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T15:20:45Z\u0022 title=\u002206/03/2020 03:20  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2020-06-03T15:41:58Z","Content":"\n\u003Cp\u003E\nInteresting.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat could pd/t2 do now to salvage this?\u003Cbr\u003E\nmake ksp1 open source?\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2020-06-03T15:53:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223796205\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591192491\u0022 data-ipsquote-userid=\u0022183830\u0022 data-ipsquote-username=\u0022RealKerbal3x\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, RealKerbal3x said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis game could still be amazing. I hope you can do the sequel to my favourite game of all time justice, Take 2. But from now until release, I will be watching with scepticism.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor me, this isn\u0027t the issue - large game companies like this don\u0027t have issues making great games when they actually want to. It\u0027s more about whether the developers who\u0027ve put all that effort into making said great games are actually getting what they deserve for it.\n\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2020-06-03T16:00:45Z","Content":"\n\u003Cp\u003E\nSome content has been removed for containing an embedded video with large amount of vulgar language, which is against our forum rules.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-06-03T16:08:08Z","Content":"\n\u003Cp\u003E\nHmm.\n\u003C/p\u003E\n\u003Cp\u003E\nWhere did we put that \u0022Blocker Features\u0022 thread?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll let this whole thing sit for a while, see how it pans it. But it doesn\u0027t bode well. At all.\n\u003C/p\u003E\n"},{"CreatedByName":"RyanRising","CreatedById":79932,"CreatedDateTime":"2020-06-03T16:13:06Z","Content":"\n\u003Cp\u003E\nWell that\u0027s concerning to say the least. I could speculate all day long, but I\u0027m absolutely having trouble seeing myself buying KSP2 now. \n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2020-06-03T16:24:27Z","Content":"\n\u003Cp\u003E\nI like how everyone compains yet does nada about this. When will we see protests at T2 for this unethical behaviour instead of just complaining on forums?\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223796269\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591201481\u0022 data-ipsquote-userid=\u002289014\u0022 data-ipsquote-username=\u0022adsii1970\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, adsii1970 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223796262\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591200786\u0022 data-ipsquote-userid=\u002279932\u0022 data-ipsquote-username=\u0022RyanRising\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, RyanRising said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell that\u0027s concerning to say the least. I could speculate all day long, but I\u0027m absolutely having trouble seeing myself buying KSP2 now. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThen don\u0027t. No one is forcing you to buy anything. T2 had an interest in making sure their desired project is complete. They gave it to a third party, under contract, who promised to deliver but could not. \n\u003C/p\u003E\n\u003Cp\u003E\nSo, T2, realizing that Star Theory was in trouble, took steps to make sure KSP2 could still be produced and with folks who are familiar with the vision of the game and who are aware of the code being used. \n\u003C/p\u003E\n\u003Cp\u003E\nCalm down, folks. It will be okay.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut you\u0027re forgetting that this is T2 and that they could be lying as most corporations like to do.\n\u003C/p\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2020-06-03T16:24:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223796262\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591200786\u0022 data-ipsquote-userid=\u002279932\u0022 data-ipsquote-username=\u0022RyanRising\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, RyanRising said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell that\u0027s concerning to say the least. I could speculate all day long, but I\u0027m absolutely having trouble seeing myself buying KSP2 now. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThen don\u0027t. No one is forcing you to buy anything. T2 had an interest in making sure their desired project is complete. They gave it to a third party, under contract, who promised to deliver but could not. \n\u003C/p\u003E\n\u003Cp\u003E\nSo, T2, realizing that Star Theory was in trouble, took steps to make sure KSP2 could still be produced and with folks who are familiar with the vision of the game and who are aware of the code being used. \n\u003C/p\u003E\n\u003Cp\u003E\nCalm down, folks. It will be okay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#c0392b;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EMy response on this thread is not in my capacity as a moderator or as an official spokesman for Take-Two or Squad...\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2020-06-03T16:36:04Z","Content":"\n\u003Cp\u003E\nYeah thats shady af sounding. Interesting that most of the creative team took the offer so quickly?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T16:39:31Z\u0022 title=\u002206/03/2020 04:39  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ShadowZone","CreatedById":112420,"CreatedDateTime":"2020-06-03T16:36:05Z","Content":"\n\u003Cp\u003E\nIt\u0027s certainly a delicate matter, not being helped by the article using words like \u0022cut throat\u0022 etc, mixing reporting with opinion.\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s look at the facts:\u003Cbr\u003E\nT2 hires Star Theory to work on KSP2 in 2017.\u003Cbr\u003E\nIn August 2019, the game is announced.\u003Cbr\u003E\nIn November 2019, Star Theory gets a 6 month extension of their deadline (according to the article and based on the fact T2 announced the delay in a press release in November).\u003Cbr\u003E\nSomewhere around that time, the Star Theory founders try to sell their studio to T2.\n\u003C/p\u003E\n\u003Cp\u003E\nOk, let\u0027s pause for a second.\u003Cbr\u003E\nI was in Seattle and met the developers in September. I also saw bits and pieces of the unfinished game. Until then, the release date was always communicated as \u0022Spring 2020\u0022. Nobody of the group that was there actually believed this to be met, especially with how unfinished the game still looked at that point in time.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, here\u0027s what\u0027s been bothering me:\u003Cbr\u003E\nWhy would you try to sell your studio to your customer while working on the customer\u0027s intellectual property?\u003Cbr\u003E\nI usually am more in line with the \u0022big corporate bad\u0022 sentiment, but to me it sounds a bit like the Star Theory founders wanted to make a quick buck with a management buyout. We also don\u0027t know what the terms they wouldn\u0027t accept were.\u003Cbr\u003E\nJumping to conclusions like that unreflected load of drivel of a video somebody posted earlier doesn\u0027t help but stir up the pot.\n\u003C/p\u003E\n\u003Cp\u003E\nContinuing the timeline:\u003Cbr\u003E\nAt some point in December T2 pulls the plug, cancels the contract with Star Theory. This is where everybody is screaming bloody murder now.\u003Cbr\u003E\nWhat we do not: Was T2 trying to facilitate an amicable transition before contacting the developers directly? Were Star Theory\u0027s founders\u0027 terms so outlandish that negotiations simply broke down? Or the other way around?\u003Cbr\u003E\nUnfortunately the author was not able to talk to the founders, so this remains a mystery.\u003Cbr\u003E\nFebruary 2020: the \u0022new studio\u0022 video is published and the takeover of the KSP2 devs appears to be complete.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat makes me tend to believe this was less scummy than it appears is this:\u003Cbr\u003E\nThe three top people of KSP2, Nate Simpson, Nate Robinson and Jeremy Ables immediately took T2 up on their offer. Immediately (article quote). I have met Nate Simpson in person and KSP2 is HIS baby, he is living and breathing nothing but love for Kerbal Space Program. So I think he had no choice in the matter if we wanted to keep his sanity. Not sure about the other two, though.\n\u003C/p\u003E\n\u003Cp\u003E\nWe can also infer two things:\u003Cbr\u003E\nFirst, T2 still believes in KSP2. The project was not cancelled, the deadline was even extended further.\u003Cbr\u003E\nSecond, T2 believed in the work the developers at Star Theory were doing, otherwise they wouldn\u0027t have offered all of them (!) contracts within Private Division\u0027s \u0022Intercept Games\u0022 studio.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat makes me nervous:\u003Cbr\u003E\nThey are looking for a \u0022multiplayer designer\u0022 via their jobs website. This could either mean that multiplayer is nowhere near completion yet. Or that they now are actually trying to include microtransactions via some multiplayer angle. We don\u0027t know. And we can only speculate until we have more information - which I am trying to get currently.\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s see what the reaction from Private Divison / Intercept Games will be.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2020-06-03T16:42:07Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/128643-poodmund/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022128643\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/128643-poodmund/\u0022 rel=\u0022\u0022\u003E@Poodmund\u003C/a\u003E thanks for posting this. Very interesting article.\n\u003C/p\u003E\n\u003Cp\u003E\nEverything in the article isn\u0027t unprecedented. It happens in all industries. Contracts get pulled or expire. Companies headhunt or poach people who are familiar with the project preramitors.\n\u003C/p\u003E\n\u003Cp\u003E\nIts just business. No need to get upset about it.\n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2020-06-03T16:43:05Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/112420-shadowzone/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022112420\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/112420-shadowzone/\u0022 rel=\u0022\u0022\u003E@ShadowZone\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the input, it\u0027s good to hear from someone who has been in close contact with the project.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI just don\u0027t get how micro transactions could even work in this game if they were attempted... would they make us pay for fuel O_o? Any kind of micro transaction would be horribly out of place, there\u0027s no loot box potential and custom painting leaves pay2skin gone.... and if any of it did exist mods would undermine it anyway... and if T2 cut off modding the game wouldn\u0027t sell in the 1st place.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T16:47:33Z\u0022 title=\u002206/03/2020 04:47  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by mcwaffles2003\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"snkiz","CreatedById":176192,"CreatedDateTime":"2020-06-03T16:50:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223796232\u0022 data-ipsquote-contentid=\u0022194406\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591195000\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI agree; there\u0027s usually two sides to a story. By no means makes that less of a **** move and motivations were probably less than pure, but at the same time decisions are hardly ever made just for the sake of being evil.\n\u003C/p\u003E\n\u003Cp\u003E\nMy suspicion is that deadlines were missed and a conversation along these lines was held:\u003Cbr\u003E\n\u0022\u003Cem\u003EWhy don\u0027t you put more people on it?\u0022\u003C/em\u003E (nvm the fact that throwing in more bodies rarely speeds up a software development project)\u003Cbr\u003E\n\u0022\u003Cem\u003EWe don\u0027t have that many people\u003C/em\u003E\u0022\u003Cbr\u003E\n\u0022\u003Cem\u003EWell you have x on the project but y in your company\u0022\u003C/em\u003E\u003Cbr\u003E\n\u0022\u003Cem\u003EYes, but we need to develop other problems as well; we can\u0027t have KSP as our \u003Cstrong\u003Eonly\u003C/strong\u003E project\u003C/em\u003E\u0022\u003Cbr\u003E\n\u0022\u003Cem\u003ENo! We tell you... put more people on it\u003C/em\u003E\u0022 *stamps feet*\u003Cbr\u003E\n\u0022\u003Cem\u003EDon\u0027t tell us how to run OUR business - we\u0027re working on delivering what we promised\u003C/em\u003E\u0022\u003Cbr\u003E\n\u0022\u003Cem\u003EORLY?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nManagement is always about control and you\u0027d not be manager for long if things go bad, you\u0027re not in control and you\u0027re fine with that. If things were going just fine nothing would have changed. Remember; T2 invested a ton of money in KSP and has no reason to jeopardize that investment by a major disruption and that\u0027s just what happened. What we don\u0027t know is the reason. Timelines? Artistic vision (unlikely given they hired Nate Simpson)? Micropayments? Even if things truly went south and in reality T2 bailed out KSP by doing this, hanging out the dirty laundry would reflect bad on them so they won\u0027t do that. Truth is, we don\u0027t really know what happened. It makes T2 look bad but without knowing the underlying issue it\u0027s really hard to judge.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRegardless of why it happened, it was dirty. This move has destroyed any trust or good will Private division had with This community and I\u0027d imagine future developers as a whole. I don\u0027t blame the devs who jumped ship. They were witnessing their passion project slipping away. And bills still need to be paid. Cozy up to the monster, get paid and get out. Mark my words that is what\u0027s going to happen. They already killed Linux support, next it will be epic exclusive, and micro-transactions and everything Nate promised it wouldn\u0027t be. I paid squad 4x full price for ksp 1 so I could give to friends and family. Private Division (T2) will be lucky if I pick it up in a humble bundle, assuming they don\u0027t ruin it.\n\u003C/p\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2020-06-03T16:51:12Z","Content":"\n\u003Cp\u003E\nJust because things are common isn\u0027t reason to ask the other side to explain their view.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/112420-shadowzone/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022112420\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/112420-shadowzone/\u0022 rel=\u0022\u0022\u003E@ShadowZone\u003C/a\u003E KSP2 meeting our all expectations (especialy after sort of being under new management) worries me too but i think its about something different here: Trust and ethics.It\u0027s not the first time people are stunned by surprising messages.\u003Cbr\u003E\u003Cbr\u003E\nI just wait and hope they do something to win some of that back.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-03T16:51:27Z\u0022 title=\u002206/03/2020 04:51  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 3, 2020\u003C/time\u003E by VITAS\u003C/strong\u003E\n\u003C/span\u003E\n"}]}