{"TopicId":194450,"ForumId":109,"TopicTitle":"Hi Everybody","CreatedByName":"Nate Simpson","CreatedById":205123,"CreatedDateTime":"2020-06-04T20:21:54Z","PageNum":6,"Articles":[{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2020-07-30T01:51:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828186\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596073209\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut then you too would be making assumptions?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGosh, golly gee, you really think so? \n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps you should go back and read the first line again, where I say we don\u0027t have enough information to make any definitive statements, and then realize my statement that is based on pure speculation may be not a serious theory into the goings on behind the scene, but rather a farcical attempt to make a point.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828186\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596073209\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso you should read the whole statement before you quote me.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI saw that.  But I\u0027m the one saying we should not base decisions off of information we don\u0027t have, unlike people who say we should consider not having that information as information itself.\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2020-07-30T02:33:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828196\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596073898\u0022 data-ipsquote-userid=\u002232993\u0022 data-ipsquote-username=\u0022razark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, razark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGosh, golly gee, you really think so? \n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps you should go back and read the first line again, where I say we don\u0027t have enough information to make any definitive statements, and then realize my statement that is based on pure speculation may be not a serious theory into the goings on behind the scene, but rather a farcical attempt to make a point.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI saw that.  But I\u0027m the one saying we should not base decisions off of information we don\u0027t have, unlike people who say we should consider not having that information as information itself.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile I don\u0027t disgree I also hate the fact that being honest is also a path to condemning oneself. Unfortunately that\u0027s just the reality we live in. I\u0027d have taken T2 seriously had they said something, but because they didn\u0027t I guess I should just be indifferent. Better that than a fool.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2020-07-30T04:31:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223827606\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221595977318\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/28/2020 at 6:01 PM, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf they didn\u0027t do anything wrong, then they shouldn\u0027t have any reason not to tell the community what happened. To give out a formal announcement about the situation outlining why they pulled the contract. They don\u0027t have to of course. But they should have if they didn\u0027t want to look bad. Yet they didn\u0027t. Now they look bad. Not our fault for thinking they have something to hide when they act like it. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni have a feeling I am going to be retreading others here, but, you are absolutely wrong in that they \u0022shouldnt have any reason not to tell the community what happened.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n1. They may be legally obligated to remain silent. Non Disclosure Agreement comes to mind.\n\u003C/p\u003E\n\u003Cp\u003E\n2. They do not owe us a reason at all.\n\u003C/p\u003E\n\u003Cp\u003E\n3. They may be simply respecting the wishes of all involved to remain quiet.\n\u003C/p\u003E\n\u003Cp\u003E\nthis list is by no means exhaustive nor is it a complete one. The bottom line is, and I have said this before, others have said it, I will say it again:\n\u003C/p\u003E\n\u003Cp\u003E\nWe do not have the full and clear picture. We NEVER EVER WILL have the full and clear picture. Anything said by anyone NOT DIRECTLY INVOLVED is 100% speculation and should be trusted no further than a mere mortal human can physically hand throw a launch ready Saturn V with the Apollo 11 on it ready for launch, which is to say, trusting internet speculation is the path to folly. It is imperative that any choice you or I or anyone makes is made with as much information as is humanly possible, and right now, we have not enough to make even educated guesses.\n\u003C/p\u003E\n\u003Cp\u003E\n233107292020\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2020-07-30T05:02:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828236\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596083515\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n50 minutes ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni have a feeling I am going to be retreading others here, but, you are absolutely wrong in that they \u0022shouldnt have any reason not to tell the community what happened.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n1. They may be legally obligated to remain silent. Non Disclosure Agreement comes to mind.\n\u003C/p\u003E\n\u003Cp\u003E\n2. They do not owe us a reason at all.\n\u003C/p\u003E\n\u003Cp\u003E\n3. They may be simply respecting the wishes of all involved to remain quiet.\n\u003C/p\u003E\n\u003Cp\u003E\nthis list is by no means exhaustive nor is it a complete one. The bottom line is, and I have said this before, others have said it, I will say it again:\n\u003C/p\u003E\n\u003Cp\u003E\nWe do not have the full and clear picture. We NEVER EVER WILL have the full and clear picture. Anything said by anyone NOT DIRECTLY INVOLVED is 100% speculation and should be trusted no further than a mere mortal human can physically hand throw a launch ready Saturn V with the Apollo 11 on it ready for launch, which is to say, trusting internet speculation is the path to folly. It is imperative that any choice you or I or anyone makes is made with as much information as is humanly possible, and right now, we have not enough to make even educated guesses.\n\u003C/p\u003E\n\u003Cp\u003E\n233107292020\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes I believe what you\u0027ve said there has been repeated about 10 times back at me. Thank you. \n\u003C/p\u003E\n\u003Cp\u003E\nOnce again to reiterate, I do not disagree with you. They are not and never were OBLIGATED to say anything. I only said that if they didn\u0027t want to look so bad, they should\u0027ve said SOMETHING. From a PR perspective, I believe their silence to be a mistake. (Unless they were legally bound not to speak. Then it\u0027d be understandable. Of course we don\u0027t have any information regarding that either.) That\u0027s just me. You\u0027re free to disagree. Regardless, that doesn\u0027t make me inherently wrong. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-30T05:22:15Z\u0022 title=\u002207/30/2020 05:22  AM\u0022 data-short=\u00223 yr\u0022\u003EJuly 30, 2020\u003C/time\u003E by James M\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RobertaME","CreatedById":164553,"CreatedDateTime":"2020-07-30T09:27:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828121\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596064294\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo you see why this is weird? Why bother going through the trouble of firing the guys you\u0027re planning to hire? If they\u0027re so incapable of completing the project, why hire them again? This is the part of what happened I don\u0027t really think makes sense unless you think of it like this... Clearly the problem happened with the negotiations in the contract and the only reason T2 would have to fire them from that is if Star Theory demanded \u0022too much\u0022 in the eyes of T2. So we can say all day that Star Theory may have been the bad guys for demanding more from T2 for this project, but who\u0027s to say T2 weren\u0027t undercutting them from the beginning? Both parties KNEW this game would be of high demand. The only difference here is that T2 also knew that this game was Star Theory\u0027s dream project. That\u0027d be a perfect reason to cut them loose and then turn around and offer them jobs again under their own demands full well knowing they couldn\u0027t really refuse. Regardless of who was doing what or why, we don\u0027t actually know the details of the contract and we probably never will. At the end of the day, as a customer, my only job is to look at the details and determine if the product is worth buying based on the little information that leaks through the cracks. God forbid I be skeptical about the situation. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso don\u0027t bother calling me a bully again. You don\u0027t know me. So quit assuming you do. I take offense to that. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt all boils down to this: You see the turn of events with little actual information and choose to interpret them in the worst possible light for Take Two. I disagree and have demonstrated how the same information can be seen from a different viewpoint. The difference is that I\u0027m not trying to convince anyone that I\u0027m right. In point of fact, I\u0027ve gone out of my way, \u003Cstrong\u003Erepeatedly\u003C/strong\u003E, to state that. You have every right to your own opinion and to express it how you like, but when you try to shut others down for disagreeing, (such as veiled threats about being offended) it doesn\u0027t bolster your argument... it says you can\u0027t counter the argument and choose to instead attack the speaker.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Fidonet Rule should apply here: \u003Cstrong\u003EThou shall not offend; Thou shall not be easily offended.\u003C/strong\u003E (I know, I\u0027m showing my age in that I even know what Fidonet is!) As such, if I offended you, note that it wasn\u0027t intentional. At no point in time did I call any individual, including you, a bully. I only noted that creating speculative narratives based on a lack of information is something bullies do to excuse their abusiveness, and that engaging in a similar behavior might make you want to re-think your approach. If you chose to take that label upon yourself based on that, then that was \u003Cem\u003Eyou\u003C/em\u003E that did that, not I. If you\u0027re \u003Cem\u003Estill\u003C/em\u003E offended, then you need to abide by the second clause.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the end, each of us has to decide how to interpret these events. If you and others choose to interpret them as \u0022vile corporate agency destroys weak independent developer\u0022 then that is your choice. If you want to try and persuade others to agree with you based on your presentation of the events, you are free to do so, but know that others who disagree are \u003Cstrong\u003Egoing\u003C/strong\u003E to express opposing points of view. Getting offended at people poking holes in your theories convinces nobody of anything.\n\u003C/p\u003E\n\u003Cp\u003E\nBack to the meat of the matter:\n\u003C/p\u003E\n\u003Cp\u003E\nTake Two \u003Cstrong\u003Eowns\u003C/strong\u003E KSP. PERIOD. They can do what they like with it. They \u003Cstrong\u003Eearned\u003C/strong\u003E that right when they shelled out the money to buy the rights to it. When they hired Star Theory to write KSP 2, it was with certain expectations. When Star Theory failed to meet those expectations, \u003Cstrong\u003Eas set forth in their contract\u003C/strong\u003E, Take Two was not only fully within their rights to cancel the contract, but they would have been \u003Cstrong\u003Eidiots \u003C/strong\u003Eto let it continue. Doing so could have left themselves open to being \u003Cstrong\u003E\u003Ca href=\u0022https://www.sec.gov/litigation/litreleases/2020/lr24845.htm\u0022 rel=\u0022external nofollow\u0022\u003Eprosecuted by the SEC\u003C/a\u003E\u003C/strong\u003E for investing shareholder assets in a risky investment scheme without first performing due diligence or disclosing the risks and prospects of the investments.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, they liked what the dev team had come up with so far, and they\u0027re not heartless bas#@\u0026amp;#$, so they offered to let the team continue the work in-house. They could have just as easily fired Star Theory, left the dev team hung out to dry, and then turned the code (which belongs to them... after all, they \u003Cstrong\u003Epaid\u003C/strong\u003E for it) over to a new development team who didn\u0027t care about the product at all and just wanted to load it up with micro-transactions and ads, milking the property for every dime they could get out of it.\n\u003C/p\u003E\n\u003Cp\u003E\nThey didn\u0027t. Instead, they hired the dev team to continue their work and gave them a free hand to be geeks and make a great product. So says Nate Simpson... former Star Theory developer.\n\u003C/p\u003E\n\u003Cp\u003E\nThat says a lot more about their motives than any Press Release ever could.\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2020-07-30T09:50:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828310\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596101229\u0022 data-ipsquote-userid=\u0022164553\u0022 data-ipsquote-username=\u0022RobertaME\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, RobertaME said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt all boils down to this: You see the turn of events with little actual information and choose to interpret them in the worst possible light for Take Two.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI read the whole thing but this is not what I did. I said in the past that based on the habits of corporations LIKE Take Two, I wouldn\u0027t be surprised if they were the ones in the wrong. Once again no one knows, but my point was that I don\u0027t trust the middle-man (AKA every video game publishing company) to do the right thing in the end because they\u0027re money-hungry. Every. Single. One. Now I get it. Every company is out to make it big, but some.. like a lot of (If not most) Indie game developers are only trying to make a good product that their customer will enjoy to the fullest extent. I\u0027m not saying they\u0027re all 100% innocent. But for the most part I don\u0027t have any evidence to believe otherwise. However there is an ABSOLUTE ****ton of news every other week about what shady things this-or-that video game publishing company did or has done. So to wrap it all up. I don\u0027t have all the information. Never have. Probably never will. But based on what I KNOW about companies like Take-Two Vs. companies like Star Theory, I\u0027m \u0022inclined\u0022 to believe Star Theory was innocent. Once again! NOT SAYING THEY ARE FOR SURE. But it\u0027s what would make the most sense based on what information is out there. \n\u003C/p\u003E\n\u003Cp\u003E\nYes, I\u0027m fully aware that I\u0027m making an assumption. But at the end of the day, who knows? Maybe Take-Two\u0027s Intercept development team will surprise everyone with an absolutely out-of-this-world creation and we\u0027ll all sing their praises? But until that happens, I will always remain skeptical no matter what \u0022principles\u0022 you intend to beat into me because time and time again...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022r/PrequelMemes - When you know everyone is going to meme the shit out of Solo\u0022 data-ratio=\u002262.50\u0022 width=\u0022960\u0022 src=\u0022https://preview.redd.it/ab8yih78jz011.png?width=960\u0026amp;crop=smart\u0026amp;auto=webp\u0026amp;s=3f124a8493ce058c730c654986540c15cae36370\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2020-07-30T13:20:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223827951\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596041117\u0022 data-ipsquote-userid=\u0022164553\u0022 data-ipsquote-username=\u0022RobertaME\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, RobertaME said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAdmitting it\u0027s not proof doesn\u0027t excuse using their silence as being incriminatory.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you think I used it that way, provide a quote, because I don\u0027t think I did.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you have other pertinent facts, please state them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe pertinent facts, as I see them, with possible interpretations and caveats:\n\u003C/p\u003E\n\u003Cp\u003E\n#1) We were shown gamplay from ST, with new graphics, new parts, a new \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, new planets, new ground scatter, and colonies\n\u003C/p\u003E\n\u003Cp\u003E\nInterpretation: ST had a product that seems to have the essentials of what was promised, but we don\u0027t know how buggy it was, how much content remained, and how well/poorly optimized it was\n\u003C/p\u003E\n\u003Cp\u003E\n#2) The deadline was extended to improve the game. According to the bloomberg article, the extension was to \u0022\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(0,0,0);\u0022\u003Eadd new content to the game\u003C/span\u003E\u003C/span\u003E\u0022, according to the article you linked, it was \u0022\u003Cspan style=\u0022background-color:#ffffff;color:#2d2d2d;font-size:17.6px;text-align:left;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003Ein order to allow more time to make the experience as terrific as possible\u003C/span\u003E\u003C/span\u003E\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nInterpretation: They may have been able to meet the deadline with *something*, but feature creep or a desire for more polish led to a longer timeline. It doesn\u0027t mean that ST couldn\u0027t deliver something that would meet the terms of the original contract\n\u003C/p\u003E\n\u003Cp\u003E\n#3) The entire ST team was contacted by linked in with a job offer\n\u003C/p\u003E\n\u003Cp\u003E\n#4) T2 was engaged in negotiations to buy ST.\n\u003C/p\u003E\n\u003Cp\u003E\nInterpretation: T2 was either happy with the work of ST\u0027s employees and management, hence the interest in buying the company/ hiring them, or T2 was unhappy with the work and/or management, but felt they needed to hire some of them to ensure some continuity and minimize further develpment delays. In the latter case, I doubt they\u0027d be interested in acquiring hte company, or hiring *everyone* from it\n\u003C/p\u003E\n\u003Cp\u003E\n#5) The linkedIn message went out Friday evening informing ST of the cancellation, prior to ST management informing the employees of the cancellation and doing an \u0022all hands on deck\u0022 meeting. ST management claimed ot be shocked and that htey had been negotiatin a sale. The linkedIn message indicated preparations to set up a new studio were already underway.\n\u003C/p\u003E\n\u003Cp\u003E\nInterpretation: During negotiations, T2 was already planning to gut ST, hence they had the mesages ready to go, and the new studio underway the moment the negotiations failed. This seems to indicate that when T2 has the power, negotiations consist of capitulating or being destroyed.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSeveral sources, including the Bloomberg article, cite that Star Theory began trying to re-negotiate for a deadline extension as early as December of last year,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think that is a misleading phrasing. The bloomberg article says in november the extension was agreed to. So it wasn\u0027t so much about extending the deadline, as the terms of a 6 month contract extension. The article mentions that the discussion was mainly about royalties and selling ST. So they weren\u0027t re-negotiating \u003Cem\u003E\u003Cstrong\u003Efor\u003C/strong\u003E\u003C/em\u003E a deadline extension, but \u003Cem\u003E\u003Cstrong\u003Ebecause\u003C/strong\u003E\u003C/em\u003E of one. Also, the release date was already delayed in November, and it was early December when the negotiations had definitively ended.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwell in advance of the Wutan virus outbreak. Trying to conflate Star Theory\u0027s inability to meet the deadline with the outbreak doesn\u0027t fit the timeline\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI concede this point, the SARS-2 virus merely hurt ST\u0027s chance of staying afloat after losing the contract. Although I will note that the end of the contract did happen the same month as news of the outbreak in China was coming out, but yea, its not the cause.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStar Theory was already running behind schedule and Take Two had agreed to a six month extension\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is your inference. We don\u0027t know if they were behind schedule, or if feature creep had set in, and T2 wanted to expand the scope. We know the deadline was pushed back. We don\u0027t know if they expanded the original scope, or ifhtey needed more time to reach the scope agreed upon from the beginning.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAdd to that the fact that once the dev team switched to Intercept Games that they were granted another year extension, I think that firmly establishes that it is a fact that Star Theory was not going to meet their deadline... either the original one in spring or the revised one in fall.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think it indicates that reorganizing the team, while loosing half of it, causes delays. When you\u0027re dealing with code and assets made by ST, and about halfthe guys aren\u0027t there to explain what they did, then it causes delays for the people that try to pick up where the others left off. It could also be a business decision related to other factors (decisions to release before a certain holiday, a desire not to release during a certain economic situation etc).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAgain, multiple sources cite that Star Theory asked for, and was granted an extension in \u003Cstrong\u003ENovember\u003C/strong\u003E, before any of this fell out. That would have had to be done through re-negotiation of the existing contract as the original contract was still in force at that time. Take Two canceled the contract in February, well in advance of the due date of the product. (pushed out to no sooner than April 1st or as late as March of 2021) and way in advance of the re-negotiated fall release. These are established facts. (ref: \u003Ca href=\u0022https://www.videogameschronicle.com/news/take-two-forms-new-studio-for-ksp2-with-original-developers-role-unclear/\u0022 rel=\u0022external nofollow\u0022\u003Evideogameschronicle.com Feb 20, 2020\u003C/a\u003E)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo it was intially supposed to release before April 2020, and then was pushed back. We never had an exact release date, and we don\u0027t know when ST was supposed to be finished vs when the product was supposed to be released (though that delay should be short). The contract was cancelled in Feb, which left only march of the original FY. The extended release date FY 2021 (April 2020-Mar 2021) presumably would have been under the terms of the new contract, which did not materialize.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I doubt the contract specified that the product had to be released. ST was hired to make the game, not publish it. So they could have made a game that met the terms of the original contract, and T2 doesn\u0027t publish this, but tells them to keep working to add this or that, and then T2 will publish on date X.\n\u003C/p\u003E\n\u003Cp\u003E\nIts not clear to me that anything other than an expiration of the contract, without renewal, happened.\n\u003C/p\u003E\n\u003Cp\u003E\nThen one can imagine all sorts of scenarios where T2 cancels the contract. One could imagine that after the dev team started to jump ship to T2 after the messages in Dec, by Feb T2 could declare that ST no longer had the capacity to deliver on the contract, and voided it because half ST\u0027s team got poached (by T2 itself).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThey had enough money to pay all their employees two months severance and several more months of company-paid health insurance. If Take Two violated their contract, which I have established above was still in effect through the fall, for the cost of two months severance for ONE employee they could have retained a litigation attorney, who might very well have offered to sue for nothing but a percentage of the judgement and no up-front fee. Lawyers do this all the time and any lawyers offered to take this kind of case would jump at the chance; it\u0027s a cake-walk. If Star Theory had proof of contract violation, he\u0027d be a fool not to take it... it\u0027s easy money and a guaranteed win! (juries LOVE \u0027sticking it\u0027 to corporations that break their contracts)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat could still be cheap compared to a lawsuit. I don\u0027t know what the salary was... lets say 5k/month for 30 employees, 2 months. That\u0027s only 300k, a lawsuit could be several million. Its also possible that there was just a clause where T2 would just pay a fixed fee (and an \u003Cabbr title=\u0022Non-Disclosure Agreement\u0022\u003ENDA\u003C/abbr\u003E preventing discussing that), maybe that\u0027s where the 2 extra months pay was coming from.\n\u003C/p\u003E\n\u003Cp\u003E\nWe don\u0027t know.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs for Take Two getting out of the contract by some other means within the terms of the contract, exercising those terms typically requires a notice period and more often than not, have triggering full payment clauses that would have kept Star Theory in business for YEARS, not months.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, according to you, they cancelled in Feb, but the notice was Dec. Also, if the original contract (and only, as renegotiation apparently fell apart) ended in Feb or March (since the \u003Cem\u003Eextension\u003C/em\u003E pushed it into the FY that begain in April), I don\u0027t see how this would keep ST in business for years.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBefore becoming a stay-at-home mom, I was a professional statistical data analyst, so I saw a LOT of data on a huge variety of topics, from nuclear physics, to legal proceedings, to contract litigation. I learned enough about each study to speak on it intelligently because that was my job; to summarize enormous data sets into easily understandable analyses, so I know the topic well.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCool story, back to the topic:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe contract was canceled and the team were offered new jobs at the same time, per the article I cited above. The new company didn\u0027t even have a name at that point in time and existed only as an offer. (companies that don\u0027t even have names yet can\u0027t \u0022poach\u0022 anyone as they can\u0027t hire employees until they have a name to put on their paychecks; failing to file for the formation of a company before starting to pay employees will get you five years for tax fraud)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nT2 existed, and the job offer was credible. The article you link mentions that hte company had been founded before being (publicly?) named. I don\u0027t see this as a valid argument.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNegotiations were no longer ongoing (terminated sometime in late January or early February)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSeems clear that they were terminated Dec 6th, when the linkedIn message went out\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStar Theory rejected the counter-proposal of acquiring them to resolve the contract dispute out of hand.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI see no source for the idea that ST rejected the proposal of acquiring them. It seems that they were open to the idea, and the discussion was over the terms of the acquisition\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, Take Two was very happy with the work the dev team had done... so much so they happily extended the contract last November. That isn\u0027t in question. Nate Simpson was/is director of the development team... not the director of the \u003Cstrong\u003Ecompany\u003Cem\u003E. \u003C/em\u003E\u003C/strong\u003EThat would be Bob Berry and Jonathan Mavor, founders and studio president (Berry) and chief technology officer. (Mavor)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, Nate wasn\u0027t the director of the company, but he was very much involved directing the project, if the job title and content of the interviews is anything to go on. I already mentioned that they may have been unhappy with the company management, but not the product.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you again conflate delaying the release with extending the contract, and I see no evidence that the contract was extended, only that the release date/deadline was delayed. Please provide a source with quotes for the assertion that the \u003Cstrong\u003Econtract\u003C/strong\u003E between T2 and ST was extended in november.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe funny thing is, when Take Two announced last year that Star Theory was going to be the ones to develop KSP 2, I remember a lot of people moaning about Star Theory and all the claims that Star Theory was \u0022stealing\u0022 the game from Squad, who \u0022should\u0022 have been the ones contracted to make it, according to them at the time. Time changes everything, I guess...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThose moans, if any were dumb. ST didn\u0027t steal anything. Squad sold its IP, and that is that.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStar Theory claimed they couldn\u0027t complete the contract without more time (and money, of course) and refused to accept the counter-offer that would have resolved the dispute.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgain, please provide a source with quotes, I\u0027ve seen no proof of this assertion. This seems like an inference.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n(i.e. Take Two acquiring Star Theory) They knew their actions would impact the employees and offered an olive branch to the dev team to move in-house ...\n\u003C/p\u003E\n\u003Cp\u003E\nTheir reasons are irrelevant. It was a gracious and magnanimous offer on Take Two\u0027s part.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhether an offer is gracious and magnanimous is entirely dependent upon the reasons for such an offer, as those words speak to the state of mind of the one making the offer.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen Star Theory shuttered its doors on March 4th, (a mere thirteen days after the others left) several more (number undisclosed, but no less than four) additional members of Star Theory accepted the offer and moved to Intercept Games. Their reasons for staying those two weeks are unknown. You attributing their actions as \u0022animosity towards T2\u0022 is not only pure conjecture, it\u0027s taking on yourself the right to state their reasons for waiting to move.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI merely stated it as a possibility, don\u0027t go \u0022putting words into my mouth\u0022. Notice the use of my qualifying words: \u0022apparently\u0022, \u0022suggests\u0022, and \u0022implies\u0022; and my very explicit qualifying statement: \u0022\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003EWe have no way of knowing what proportion of those that went to T2 did so enthusiastically, or grudgingly\u003C/span\u003E\u0022\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat is the narrative; that Take Two did all this so they could move development in-house and load it up with micro-transactions. Every thread discussing it tries to make this claim, including posters in this one.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI do not have comprehensive knowledge of all discussions, so I can\u0027t say that this narrative was never presented, but I never heard it, can you provide a link to such a thread? My suspicion of a strawman argument is due to never having heard the argument, and having seen the Bloomberg article thread, where the complaint was over corporate ethics.\n\u003C/p\u003E\n\u003Cp\u003E\nYou mention this thread, but considering that the very first mention of microtransactions comes from T2 in the very first post, this thread cannot serve as evidence against it being a strawman argument.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs said above, there are a number of reasons they are not speaking on the subject. PR may be \u003Cem\u003Escreaming\u003C/em\u003E for a statement to be made, ... Drawing conclusions from that silence is \u003Cstrong\u003Econjecture\u003C/strong\u003E and not helpful, productive, or even wise.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPlease show me where I drew a conclusion from that silence? \n\u003C/p\u003E\n\u003Cp\u003E\nI noted: \u0022\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003EIt could be they are just cynical of the way public debate goes in the era of \u0022cancel culture\u0022 and such...\u003C/span\u003E\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\nI believe that you are mischaracterizing my arguments.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-30T13:26:57Z\u0022 title=\u002207/30/2020 01:26  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 30, 2020\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-02T09:50:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223828319\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596102605\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/30/2020 at 11:50 AM, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOnce again no one knows, but my point was that I don\u0027t trust the middle-man (AKA every video game publishing company) to do the right thing in the end because they\u0027re money-hungry. Every. Single. One. Now I get it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, I agree, but it makes no sense for a \u0022greedy move\u0022 to buy KSP in the first place. The fanbase like it because it\u0027s basically the only game out there with realistic orbital mechanics and that will always be too difficult for the casual mob, also the game has a long tradition of mod support and it\u0027s mostly a single player game with players used to have any additional content as free mods, that makes it difficult to monetize through DLCs (you have to put some actual content in them) and impossible to do so with MTXs.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only reason you buy an IP like Kerbal is if you want to diversify your offer and build some good will and/or clean your image, yes, publishers tend to do some really dumb errors (don\u0027t you guys have phones?), but those dumb errors are made with IPs that are way bigger and more important than KSP, you can\u0027t make a cash grab out of a niche IP you just bought from an indie dev.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-05T11:56:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223830161\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596361846\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/2/2020 at 11:50 AM, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, I agree, but it makes no sense for a \u0022greedy move\u0022 to buy KSP in the first place. The fanbase like it because it\u0027s basically the only game out there with realistic orbital mechanics and that will always be too difficult for the casual mob, also the game has a long tradition of mod support and it\u0027s mostly a single player game with players used to have any additional content as free mods, that makes it difficult to monetize through DLCs (you have to put some actual content in them) and impossible to do so with MTXs.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe thing is, corporate executives are typically not aware of what the fanbase wants or likes. They don\u0027t play games and don\u0027t visit the forums. They only see numbers and only care about them.\n\u003C/p\u003E\n\u003Cp\u003E\nBuying an indie IP makes sense because that IP seems to be making money, and more money than usual, at that. They think that by making a prettied-up sequel they can make even more money. That\u0027s enough to buy an IP. \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-05T12:27:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832003\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596628573\u0022 data-ipsquote-userid=\u002217022\u0022 data-ipsquote-username=\u0022Dragon01\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, Dragon01 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe thing is, corporate executives are typically not aware of what the fanbase wants or likes. They don\u0027t play games and don\u0027t visit the forums. They only see numbers and only care about them.\n\u003C/p\u003E\n\u003Cp\u003E\nBuying an indie IP makes sense because that IP seems to be making money, and more money than usual, at that. They think that by making a prettied-up sequel they can make even more money. That\u0027s enough to buy an IP. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt doesn\u0027t take some exotic inside knowledge to understand that Kerbal is a terrible IP for a quick profit, even some random execs know that simulators aren\u0027t big casual money makers.\n\u003C/p\u003E\n\u003Cp\u003E\nNo, nobody buys random IPs from indie devs without knowing what they\u0027re buying.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-05T13:12:50Z","Content":"\n\u003Cp\u003E\nKSP is not random. It\u0027s been successful enough to be put on the radar. It\u0027s a sim when you look into it, but on the surface, it looks far more casual than it actually is (blame Squad\u0027s \u0022lolsokerbal\u0022 marketing for that one). Put those two together, and it sure \u003Cem\u003Elooks \u003C/em\u003Elike a good candidate for a casual money maker at first look, and most corporate types leave the second one to their underlings. \u0022Here\u0027s an IP, the first game made money, and the second had better too, or else\u0022 (if you don\u0027t believe they think like that, read Dilbert, and don\u0027t forget the comments section). To a corporate exec, \u0022simulator\u0022 means something like Train Simulator, ArmA, DCS or Il-2, which are all seriousness from get-go and, besides ArmA, rather niche and priced up the wazoo to compensate. Trailers for these all show you gritty details of the hardware, dynamic shots and photorealistic scenery. What does KSP show? A bunch of cutesy green creatures fooling around with things that explode. In the description you find it also teaches you about orbits.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-05T15:20:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832028\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596633170\u0022 data-ipsquote-userid=\u002217022\u0022 data-ipsquote-username=\u0022Dragon01\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Dragon01 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKSP is not random. It\u0027s been successful enough to be put on the radar. It\u0027s a sim when you look into it, but on the surface, it looks far more casual than it actually is (blame Squad\u0027s \u0022lolsokerbal\u0022 marketing for that one). Put those two together, and it sure \u003Cem\u003Elooks \u003C/em\u003Elike a good candidate for a casual money maker at first look, and most corporate types leave the second one to their underlings. \u0022Here\u0027s an IP, the first game made money, and the second had better too, or else\u0022 (if you don\u0027t believe they think like that, read Dilbert, and don\u0027t forget the comments section). To a corporate exec, \u0022simulator\u0022 means something like Train Simulator, ArmA, DCS or Il-2, which are all seriousness from get-go and, besides ArmA, rather niche and priced up the wazoo to compensate. Trailers for these all show you gritty details of the hardware, dynamic shots and photorealistic scenery. What does KSP show? A bunch of cutesy green creatures fooling around with things that explode. In the description you find it also teaches you about orbits.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, they totally make multimillion dollar contracts based on first look, it totally makes sense.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously if the \u0022it\u0027s all an evil plan\u0022 view doesn\u0027t make sense it\u0027s not because there\u0027s no evil plan, it\u0027s because the evil execs are terrible at thinking evil plans.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-05T15:43:33Z","Content":"\n\u003Cp\u003E\nNo, they are terrible at making plans at all. As in, they\u0027re usually incompetent. No, it does not make sense. That never stopped a corporate CEO. Yes, they still get paid ridiculous salaries for that. The way it usually goes is that a CEO launches a hare-brained scheme, and employees are left to either make it work, or suffer the consequences of failing. It\u0027s not an \u0022evil\u0022 plan (corporations \u003Cem\u003Eare \u003C/em\u003Esupposed to be about making money), it\u0027s another stupid plan out of a top-level exec (for the exact reasons you describe, which they don\u0027t get), whose salary does not depend on how well the company is doing, but on how well stockholders are doing.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re making an assumption that just because somebody makes multimillion dollar decision he/she is smart. More often, people who get to make such calls are dolts who happen to be good with people. This is why trusting a corporation is a mistake more often than not, and why most corporate product lines steadily go downhill. Here, we can only hope that employees can turn the cash grab into an enjoyable game. \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-05T16:12:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832100\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596642213\u0022 data-ipsquote-userid=\u002217022\u0022 data-ipsquote-username=\u0022Dragon01\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, Dragon01 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, they are terrible at making plans at all. As in, they\u0027re usually incompetent. No, it does not make sense. That never stopped a corporate CEO. Yes, they still get paid ridiculous salaries for that. The way it usually goes is that a CEO launches a hare-brained scheme, and employees are left to either make it work, or suffer the consequences of failing. It\u0027s not an \u0022evil\u0022 plan (corporations \u003Cem\u003Eare \u003C/em\u003Esupposed to be about making money), it\u0027s another stupid plan out of a top-level exec (for the exact reasons you describe, which they don\u0027t get), whose salary does not depend on how well the company is doing, but on how well stockholders are doing.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re making an assumption that just because somebody makes multimillion dollar decision he/she is smart. More often, people who get to make such calls are dolts who happen to be good with people. This is why trusting a corporation is a mistake more often than not, and why most corporate product lines steadily go downhill. Here, we can only hope that employees can turn the cash grab into an enjoyable game. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m not making any assumption, just stating the obvious: it doesn\u0027t make any sense to buy the Kerbal IP as a quick cashgrab.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIt\u0027s a first game that barely makes enough money to cover the continued development\n\u003C/li\u003E\n\u003Cli\u003E\nThere\u0027s a terrible \u0022all DLC free forever\u0022 policy in place with a considerable portion of the user-base\n\u003C/li\u003E\n\u003Cli\u003E\nThe modding community makes it difficult to bring a new feature for a sequel or a DLC that feels entirely new and original since everything it\u0027s already been made.\n\u003C/li\u003E\n\u003Cli\u003E\nThe game is popular for its userbase for the specific feature-set that makes it difficult to market it to casuals.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nYou\u0027re the one making assumptions and going through some serious mental gymnastics to assert it was a cash-grab anyway, I don\u0027t care why they bought the IP, I\u0027m just saying that trying to make a quick cash-grab with an IP like Kerbal makes zero sense.\n\u003C/p\u003E\n\u003Cp\u003E\nInvesting in diversifying the offer and opening new markets it\u0027s also something big companies do, especially when there is a whole new genre with only one game as a viable and mature option and you are in the position to buy the whole thing, just like Valve has done with DOTA or with the team behind Narbacular Drop (not a quick cash-grab but a medium-long term investment).\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-05T16:45:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832113\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596643936\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m just saying that trying to make a quick cash-grab with an IP like Kerbal makes zero sense.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt doesn\u0027t matter. Companies make decisions that make zero sense \u003Cem\u003Eall the time\u003C/em\u003E. Ford Pinto, anyone? Just the first well-known example of corporate stupidity off the top of my head. No mental gymnastics needed, just some knowledge of how corporations operate. It\u0027s you who doesn\u0027t realize how broken this system is. They can afford to make such blunders, and they do, with CEOs who made the call not being punished unless they get caught doing something that\u0027s actually criminal. \n\u003C/p\u003E\n\u003Cp\u003E\nValve has a president with a brain. Gabe, at the very least, is a programmer who cares for what the company puts out. Strauss Zelnick, T2\u0027s CEO, is an MBA (read: a typical corporate executive).\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2020-08-05T22:51:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832146\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596645903\u0022 data-ipsquote-userid=\u002217022\u0022 data-ipsquote-username=\u0022Dragon01\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/5/2020 at 9:45 AM, Dragon01 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStrauss Zelnick,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLiterally googled the guy. Business school, law school, business degree, CEO of an investment firm and the largest shareholder of T2. This guy sounds like he totally gives a [snip] about video game \u003Cu\u003Equality\u003C/u\u003E. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-06T20:24:12Z\u0022 title=\u002208/06/2020 08:24  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 6, 2020\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003EMind the language, please.\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-06T01:04:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832146\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596645903\u0022 data-ipsquote-userid=\u002217022\u0022 data-ipsquote-username=\u0022Dragon01\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Dragon01 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nValve has a president with a brain. Gabe, at the very least, is a programmer who cares for what the company puts out. Strauss Zelnick, T2\u0027s CEO, is an MBA (read: a typical corporate executive).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nValve is a smaller company that directly operates on the market, there are 2 whole companies between the CEO of T2, owner of Private Division owner of Intercept Games and the game itself.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, T2 CEO probably knows nothing about videogames, but no, the people targeting Squad and negotiating the terms of the buyout knew that they weren\u0027t dealing with the next Fortnite or FIFA.\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t buy a while new unknown IP for a cashgrab, it\u0027s a risky move, especially when you\u0027re a giant publisher that can make 10 times the money a half-assed Kerbal could ever make with some dumb GTA pay2win mobile card game.\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2020-08-06T03:48:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832425\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596675868\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nValve is a smaller company that directly operates on the market, there are 2 whole companies between the CEO of T2, owner of Private Division owner of Intercept Games and the game itself.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, T2 CEO probably knows nothing about videogames, but no, the people targeting Squad and negotiating the terms of the buyout knew that they weren\u0027t dealing with the next Fortnite or FIFA.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u0022\u003C/strong\u003E\u003Ci style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003EKerbal Space Program\u003C/i\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003E\u003Cspan\u003E \u003C/span\u003Ewill be one of the first titles published under Take-Two Interactives\u0027s 2017-launched\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Private_Division\u0022 rel=\u0022external nofollow\u0022 style=\u0022color:#0b0080;font-size:14px;\u0022 title=\u0022Private Division\u0022\u003EPrivate Division\u003C/a\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003E, a publishing label aimed to support mid-sized development studios.\u003Cstrong\u003E\u0022\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003EEven back in 2017, T2 (And Private Division by extension) never considered KSP as some \u0022Unknown\u0022 IP. To corporations like T2, KSP is actually a \u0022Triple-I\u0022 game. Not quite \u0022Indie\u0022, not quite \u0022Triple-A\u0022. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003EFurthermore KSP is supported as of now by NASA itself, ESA, and even Space X to a certain degree. (Flyback booster reference in the scenarios \u002B Elon publicly stating he loves the game.) The game may be small when compared to some of the largest games ever released on any platforms ever. Of course it is. To compare the two is like comparing a Watermelon and a Grape. But even then KSP is no \u0022risky cashgrab\u0022. The game has huge upside potential and T2 knows it. The knew back then. Then know it now. The question is HOW they intend to make more revenue from the game than KSP1 made. Make the game better? Be underhanded and cut corners? Microtransactions, Loot boxes, DLC\u0027s? The list goes on. But only one of them respects the consumer AND the developer. (Unless of course you also factor in crunch)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003EAlso consider this, KSP has sold over 2 million copies, the same amount as Outer Worlds. People have praised that game as being a \u0022Stellar Success\u0022. Mind the pun. And I\u0027m not arguing with them, it\u0027s great! But in that same mindset, so was KSP1. (Ah I do love my space games.) KSP2 is not only supposed to be it\u0027s successor but also it\u0027s future. If we\u0027re being honest there\u0027s a good chance there won\u0027t be a KSP3. Not at least in the next decade. So all of it\u0027s fans want to see the game done right. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832425\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596675868\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ndumb GTA pay2win mobile card game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nQuit giving them ideas xD They might take you seriously. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-06T04:07:55Z\u0022 title=\u002208/06/2020 04:07  AM\u0022 data-short=\u00223 yr\u0022\u003EAugust 6, 2020\u003C/time\u003E by James M\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-08-06T04:12:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832483\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596685722\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFurthermore KSP is supported as of now by NASA itself, ESA, and even Space X to a certain degree.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou mean KSP supports NASA, ESA, and SpaceX to a certain degree.\n\u003C/p\u003E\n\u003Cp\u003E\nI have yet to see KSP being used in actual space programs to fly actual space ships \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2020-08-06T04:22:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832491\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596687141\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou mean KSP supports NASA, ESA, and SpaceX to a certain degree.\n\u003C/p\u003E\n\u003Cp\u003E\nI have yet to see KSP being used in actual space programs to fly actual space ships \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is fair. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E Derp.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-06T04:22:56Z\u0022 title=\u002208/06/2020 04:22  AM\u0022 data-short=\u00223 yr\u0022\u003EAugust 6, 2020\u003C/time\u003E by James M\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ryan@123","CreatedById":206537,"CreatedDateTime":"2020-08-07T03:32:42Z","Content":"\n\u003Cp\u003E\nWe all are waiting for KSP 2 and have faith in all the devs and are damn sure that this GAME WILL CHANGE EVERYTHING IT WILL OVERTAKE EVERY SINGLE SANDBOX GAME.We all watched the alpha gameplay and they are mind-blowing.Just one request plz add multi planetary systems.It will be mad fun in exploring new solar systems with revolutionary technology\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-07T14:17:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832483\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596685722\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/6/2020 at 5:48 AM, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u0022\u003C/strong\u003E\u003Ci style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003EKerbal Space Program\u003C/i\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003E\u003Cspan\u003E \u003C/span\u003Ewill be one of the first titles published under Take-Two Interactives\u0027s 2017-launched\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Private_Division\u0022 rel=\u0022external nofollow\u0022 style=\u0022color:#0b0080;font-size:14px;\u0022 title=\u0022Private Division\u0022\u003EPrivate Division\u003C/a\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003E, a publishing label aimed to support mid-sized development studios.\u003Cstrong\u003E\u0022\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#202122;font-size:14px;\u0022\u003EEven back in 2017, T2 (And Private Division by extension) never considered KSP as some \u0022Unknown\u0022 IP. To corporations like T2, KSP is actually a \u0022Triple-I\u0022 game. Not quite \u0022Indie\u0022, not quite \u0022Triple-A\u0022. \u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey opened a new company just to deal with smaller games, proof that they knew they were dealing with a smaller IP.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832483\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596685722\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/6/2020 at 5:48 AM, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut even then KSP is no \u0022risky cashgrab\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s risky if you try to make a dumb casual game out of the IP, and for \u0022risky\u0022 I mean \u0022a complete failure\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832483\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596685722\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/6/2020 at 5:48 AM, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe knew back then. Then know it now.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s exactly my point.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832483\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596685722\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/6/2020 at 5:48 AM, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe question is HOW they intend to make more revenue from the game than KSP1 made. Make the game better? Be underhanded and cut corners? Microtransactions, Loot boxes, DLC\u0027s? The list goes on. But only one of them respects the consumer AND the developer. (Unless of course you also factor in crunch)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCutting corners it\u0027s a lost train to them, they just opened a whole new studio to deal exclusively with KSP, adding a whole year and a half of development time on top of that.\n\u003C/p\u003E\n\u003Cp\u003E\nMTX and Lootboxes, how in KSP?\n\u003C/p\u003E\n\u003Cp\u003E\nDLCs? Why not? The game will be moddable anyway and a \u0022Paradox model\u0022, pretty much the worse case scenario when talking about DLCs, while obnoxious it\u0027s not the end of the world.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223832483\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221596685722\u0022 data-ipsquote-userid=\u0022167171\u0022 data-ipsquote-username=\u0022James M\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/6/2020 at 5:48 AM, James M said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKSP2 is not only supposed to be it\u0027s successor but also it\u0027s future. If we\u0027re being honest there\u0027s a good chance there won\u0027t be a KSP3. Not at least in the next decade. So all of it\u0027s fans want to see the game done right. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, but we have reasons to be cautiosly optimistic at least, KSP is not going to be a huge mainstream casual success, so they can\u0027t get away with the same excrements they put in their huge IPs and they know that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-07T15:28:43Z\u0022 title=\u002208/07/2020 03:28  PM\u0022 data-short=\u00223 yr\u0022\u003EAugust 7, 2020\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RobertaME","CreatedById":164553,"CreatedDateTime":"2020-08-12T17:21:30Z","Content":"\n\u003Cp\u003E\nI wonder if anyone has considered the possibility that Take Two bought KSP just for the good PR it would bring them for making a \u003Cem\u003Ereally\u003C/em\u003E good sequel?\n\u003C/p\u003E\n\u003Cp\u003E\nThink about it. Not \u003Cem\u003Eevery\u003C/em\u003E decision a company makes is based on immediate profits. Some business decisions are made, knowing it will be a loss to the company, just so they can improve their image... which helps make profits in \u003Cem\u003Eother\u003C/em\u003E areas. (companies with a good rep can sell more product than one with a bad rep)\n\u003C/p\u003E\n\u003Cp\u003E\nIf Take Two delivers KSP 2 as promised... with no micro-transactions, no instant DLCs for certain parts of the game like multiplayer or interstellar travel, etc., think of how that would change everyone\u0027s tune about them as a company. I mean, they \u003Cem\u003Ehave\u003C/em\u003E to know their rep in the gaming world is less than stellar, right? You\u0027d have to be an \u003Cem\u003Eidiot\u003C/em\u003E to not see it and CEOs \u003Cem\u003Earen\u0027t\u003C/em\u003E idiots. (despite what some people think) So back in 2017 they buy KSP, \u003Cem\u003Eknowing\u003C/em\u003E it\u0027s a niche market with little in the way of broad appeal or high returns on investment. So why buy it then? What\u0027s their motivation?\n\u003C/p\u003E\n\u003Cp\u003E\nI think it\u0027s entirely possible that they bought KSP with the sole intent of turning out a top-rated game, knowing it would be a loss, \u003Cstrong\u003Especifically for the purpose of improving their image\u003C/strong\u003E. When Star Theory asked for more time and then, after getting an extension from spring 2020 to fall 2020, asked for \u003Cem\u003Eanother\u003C/em\u003E extension to 2021, Take Two felt their good-will project was being jeopardized and pulled it in-house to protect the project from an endless development cycle. After all, if KSP 2 comes out over a year late and \u003Cem\u003Estill\u003C/em\u003E has bugs or not everything that was promised, all their good will goes up in smoke... and the tens-of-millions they poured into it were wasted money.\n\u003C/p\u003E\n\u003Cp\u003E\nI base all this on a thumbnail estimate of 3 years development (2019-2021) x 30 employees x $105k average salary \u002B benefits* = $10 million in raw development costs, plus additional costs of creating the new Intercept Games, (despite what some people think, creating a company isn\u0027t as simple as declaring it so... it actually costs \u003Cem\u003Emoney\u003C/em\u003E to start a new business, even before you write the first paycheck) extra costs from Star Theory, etc. (you can bet Star Theory was turning a profit and paying their owner\u0027s salaries... not just operating at break-even for the dev team for the last two years)\n\u003C/p\u003E\n\u003Cp\u003E\nGiven a $60 sale price... of which a good chunk of which will pay for the service providing it for DL like Steam, (they want \u003Cem\u003Etheir\u003C/em\u003E cut) advertising, etc... with an estimated profit of $30 a copy, (100% markup is being \u003Cem\u003Every\u003C/em\u003E generous) they have to sell a third-of-a-million copies just to break even... \u003Cem\u003Ein theory\u003C/em\u003E... but we\u0027re not done. Given that stockholders expect a ROI of 3-8% annual, (growth of 17% over three years compounded quarterly) and then subtracting Uncle Sam\u0027s cut, (capital gains taxes) that equates to well over half million sales of KSP 2 before they even \u003Cem\u003Estart\u003C/em\u003E to see a \u003Cem\u003Epenny\u003C/em\u003E of actual profit... but not \u003Cem\u003Equite \u003C/em\u003Eyet. Sales profits of that first year will \u003Cem\u003Ealso\u003C/em\u003E have to go to the dev team at Intercept to continue work releasing patches, (no game \u003Cstrong\u003E\u003Cem\u003Ein the history of ever\u003C/em\u003E\u003C/strong\u003E came out bug-free) so there goes another $3.3 million... meaning they need over a million units sold to \u003Cem\u003Eactually\u003C/em\u003E make any money off of it... in the first year alone.\n\u003C/p\u003E\n\u003Cp\u003E\nEven if KSP 2 is everything they promised, getting a million $60 units sold in the first year will be a challenge... especially since KSP 1 would then effectively be \u003Cem\u003Ecompeting\u003C/em\u003E with it. (\u0022Why should I buy KSP 2 when I already bought KSP 1 and get free DLCs forever?\u0022 is hard to argue with) KSP 1 has millions of downloads, sure... but that\u0027s spread out over \u003Cem\u003Enine years\u003C/em\u003E and includes a lot of people that bought it because it was cheap, (which isn\u0027t a draw with KSP2) tried it, didn\u0027t like it, then never played it again and won\u0027t buy into KSP 2. The $60 price tag will scare off most of the casual interest, so only hard-core KSP fans will buy... and last I checked there\u0027s only a few tens-of-thousand of us... \u003Cem\u003Eworldwide\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyone that thinks Take Two is going to get millions of sales the first year and make money off this deal is kidding themselves. They\u0027ll be lucky to break even.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s what led me to think they\u0027re not in this for the money. If \u003Cem\u003EI\u003C/em\u003E can do the math... so can \u003Cem\u003Ethey\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nJust another thought. YMMV.\n\u003C/p\u003E\n\u003Cp\u003E\n* $105k average based on true cost of hiring, which best practices is 1.5x the employee\u0027s salary to include insurance, payroll taxes, HR, etc., assuming an average Intercept Games employee salary of $70k. (rough estimate from Ziprecruiter, glassdoor, indeed, payscale, and salarylist)\n\u003C/p\u003E\n"},{"CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2020-08-12T21:53:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223836720\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221597252890\u0022 data-ipsquote-userid=\u0022164553\u0022 data-ipsquote-username=\u0022RobertaME\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, RobertaME said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI wonder if anyone has considered the possibility that Take Two bought KSP just for the good PR it would bring them for making a \u003Cem\u003Ereally\u003C/em\u003E good sequel?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI read what you said and you could be right. If I was a betting man, I wouldn\u0027t bet on it but still. There is a possibility.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223836720\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221597252890\u0022 data-ipsquote-userid=\u0022164553\u0022 data-ipsquote-username=\u0022RobertaME\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, RobertaME said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen Star Theory asked for more time and then, after getting an extension from spring 2020 to fall 2020, asked for \u003Cem\u003Eanother\u003C/em\u003E extension to 2021, Take Two felt their good-will project was being jeopardized and pulled it in-house to protect the project from an endless development cycle.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n If this is their \u0022goodwill\u0022 project as you called it, I could see that. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223836720\u0022 data-ipsquote-contentid=\u0022194450\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221597252890\u0022 data-ipsquote-userid=\u0022164553\u0022 data-ipsquote-username=\u0022RobertaME\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, RobertaME said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKSP 1 has millions of downloads, sure... but that\u0027s spread out over \u003Cem\u003Enine years\u003C/em\u003E and includes a lot of people that bought it because it was cheap, (which isn\u0027t a draw with KSP2) tried it, didn\u0027t like it, then never played it again and won\u0027t buy into KSP 2.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA sad but undeniable truth.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2020-08-15T09:14:41Z","Content":"\n\u003Cp\u003E\nSince the bias it\u0027s more important than the facts, let\u0027s remind you that is Private Division that\u0027s publishing KSP2, not their parent company T2.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s the difference? PD has published 3 games since its creation, none of them has microtransactions, lootboxes or other similar mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s my bias, thinking that the company created by T2 to deal with smaller games that require a different model is actually doing what it was created for.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-15T09:20:52Z\u0022 title=\u002208/15/2020 09:20  AM\u0022 data-short=\u00223 yr\u0022\u003EAugust 15, 2020\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"}]}