{"TopicId":201663,"ForumId":109,"TopicTitle":"Kerbals as resources","CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-04-13T01:12:09Z","PageNum":1,"Articles":[{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-04-13T01:12:09Z","Content":"\n\u003Cp\u003E\nSo I know there\u0027s a little information out there about how colonies will work and I\u0027ve probably missed some, so feel free to correct if Im out in left field. From what I\u0027ve gleaned different events like new discoveries and research will cause \u0022booms\u0022 in Kerbal populations, which is fun, but it seems like thats only a goal to strive for if Kerbals themselves are a resource and having more of them means you can do more things. I thought it might be fun to speculate on how that might work, and how it might tie into filling crews, gathering science, running colonies, etc. I\u0027ve heard very little about whether Kerbal careers will be relevant or how (or if) science will be collected or generated, but since these systems felt the most unfinished in KSP1 I\u0027m curious how they\u0027ll be handled in KSP2. I can think of 3 ways one could go about this, from more manage-y to less manage-y:\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EKeeping Pilots, Scientists, and Engineers:\u003C/strong\u003E\u003Cbr\u003E\nIt could be that much like in KSP 1 Kerbals could have different specializations limiting the number of things they could do--Pilots can fly ships and control probes, Engineers can repair things, Scientists can run labs, etc. In KSP 2 there will be more things that they could do at colonies like running reactors, greenhouses, nurseries, etc. Does it make sense that these kinds of facilities would require minimum crews to operate? If so it might be nice to have a training facility where civilian recruits could be certified into those fields and give the player a little control over how many of each they have at each colony to keep things running smoothly. Maybe running additional milk-runs would require allocating more pilots or filling a colony-command module to run them remotely. Maybe upgrades require filling research facilities with scientists and engineers. It could also be that different modules auto-fill with available crew to reduce micro-management and you could just draw from this pool to populate newly built vessels and send them to make new colonies. I\u0027d personally be okay with dropping  the experience system  entirely as managing the individual careers of a few dozen staff is fiddly enough in KSP1.\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EGeneric Crews:\u003C/strong\u003E\u003Cbr\u003E\nOr you could just drop kerbal careers entirely and have generic kerbals that are assumed to be well trained enough to handle any job. You\u0027d still need enough total kerbals to staff up your various labs, reactors, mining rigs, maybe even some engines require dedicated staff to maintain, but you wouldn\u0027t be limited by who could do what. It would though allow you to overbuild a bit, run short-staffed, allocating more kerbals to mining and fuel production for instance if you needed more resources or to nurseries and life support if you were focusing on increased population. \u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EPopulation thresholds:\u003C/strong\u003E\u003Cbr\u003E\nThis seems like the simplest and least management heavy way of doing things, that in order to add or run certain modules like a big reactor or fancy new fuel factory a colony would need at least X population. It could be nice because you wouldn\u0027t have to worry about crews at all and could focus on other aspects of the game, but it might be harder to balance and offer less flexibility. So for instance if having 100 kerbals means you can build a big fancy fusion reactor, do you need 120 to build 2? Does this limit the number of other facilities you can add? And if so is this just as if not more confusing and manage-y than using generic crews? This idea could though potentially be mixed with having careers but they would only be operative in running exploration vessels. \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nThere are a lot of other questions about how involved colony management will be, balancing resources and optimizing growth, etc. I think there needs to be SOME management involved here otherwise whats the point, but whats the right balance? How important will life support be for instance? I agree there should be no frustrating fail-state where your kerbals run out of air and die, but maybe accumulating a certain quantity of single-resource LS allows you to build more habitation modules or raises the cap on how many total kerbals a colony can support? I was also thinking it might be nice instead of having booms produce new recruits they could produce more like kerblings--baby kerbals that require some negligible amount of LS. That way you wouldn\u0027t need to raise population caps BEFORE a boom occurs, you could add it on after and move kerbals into careers as you added more habitation .\u003Cbr\u003E\u003Cbr\u003E\nJust some thoughts. What have you all been thinking about this?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-13T01:18:54Z\u0022 title=\u002204/13/2021 01:18  AM\u0022 data-short=\u00223 yr\u0022\u003EApril 13, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2021-04-13T01:21:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223953513\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618276329\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPopulation thresholds:\u003C/strong\u003E\u003Cbr\u003E\nThis seems like the simplest and least management heavy way of doing things, that in order to add or run certain modules like a big reactor or fancy new fuel factory that colony would need at least X population. It could be nice because you wouldn\u0027t have to worry about crews at all and could focus on other aspects of the game, but it might be harder to balance and offer less flexibility. So for instance if having 100 kerbals means you can build a big fancy fusion reactor, do you need 120 to build 2? Does this limit the number of other facilities you can add? And if so is this just as if not more confusing and manage-y than using generic crews? This idea could though potentially be mixed with having careers but they would only be operative in running exploration vessels\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve been under the impression it will be something along these lines for the colonies, with separate kerbonauts for your assorted craft (like they do now).  I don\u0027t recall seeing any details from the actual developers though, just my assumption.\n\u003C/p\u003E\n"},{"CreatedByName":"PlutoISaPlanet","CreatedById":206057,"CreatedDateTime":"2021-04-13T01:28:19Z","Content":"\n\u003Cp\u003E\nEverything you said is what I think we know. Orbital colonies though realy interest me.\n\u003C/p\u003E\n"},{"CreatedByName":"Dientus","CreatedById":209823,"CreatedDateTime":"2021-04-13T02:03:03Z","Content":"\n\u003Cp\u003E\nI think you are as close to what it will be as possible right now with the little that I know.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne thing that was discussed loosely in another thread, was the (what to call it, hope? Possibility? Wish?) Of there being more professions. Something I hope for. Such as Medic, Laborer,  Programmer, Analyst, as well as the normal Pilot, Engineer, Scientist. Like all things, this could become convoluted, but in moderation, could fit very nicely as Kerbals as a resource.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-13T02:03:57Z\u0022 title=\u002204/13/2021 02:03  AM\u0022 data-short=\u00223 yr\u0022\u003EApril 13, 2021\u003C/time\u003E by Dientus\u003C/strong\u003E\n\u003Cbr\u003Espelin\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2021-04-13T03:45:09Z","Content":"\n\u003Cp\u003E\nI might be repeating myself, so here\u0027s a quote from Biofuel topic.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223949626\u0022 data-ipsquote-contentid=\u0022201479\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221617653281\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/5/2021 at 1:08 PM, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI know they\u0027ve added some plants to Kerbin lately in KSP, and in KSP2 we\u0027ve seen entire forests and can only guess what the biodiversity on other worlds will be like, but my brain is still stuck in the olden days, when the only living thing in KSP was Kerbals. I just wanted you to have context.\n\u003C/p\u003E\n\u003Cdiv\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://thumbs.gfycat.com/IllustriousColorfulBunny-small.gif\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022IllustriousColorfulBunny-small.gif\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002241.40\u0022 height=\u0022207\u0022 width=\u0022500\u0022 src=\u0022https://thumbs.gfycat.com/IllustriousColorfulBunny-small.gif\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cspan style=\u0022background:rgba(220,220,220,.5);background-image:url(\u0026quot;//forum.kerbalspaceprogram.com/applications/core/interface/ckeditor/ckeditor/plugins/widget/images/handle.png\u0026quot;);\u0022\u003E\u003C/span\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOn a more serious note, I don\u0027t mind a bit of minimal pop management for colonies, like needing to build some number of habitats, etc, but anything more serious seems overkill. Seems like it\u0027d detract from the main game.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-04-13T04:09:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223953591\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618285509\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI might be repeating myself, so here\u0027s a quote from Biofuel topic.\n\u003C/p\u003E\n\u003Cp\u003E\nOn a more serious note, I don\u0027t mind a bit of minimal pop management for colonies, like needing to build some number of habitats, etc, but anything more serious seems overkill. Seems like it\u0027d detract from the main game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI tend to agree, the question for me is what is the cleanest, least finicky implementation that still keeps kerbals important? If we take boom events and increased population as a central part of the mechanics, what does the game loop look like?\u003Cbr\u003E\u003Cbr\u003E\nHarvest resources \u0026gt;\u003Cbr\u003E\nBuild ships \u0026gt;\u003Cbr\u003E\nExplore \u0026gt;\u003Cbr\u003E\nGet more Kerbals \u0026gt;\u003Cbr\u003E\nUpgrade tech/ Build bigger colonies \u0026gt;\u003Cbr\u003E\n\u0026gt; Repeat\u003Cbr\u003E\u003Cbr\u003E\nWhich means the population of your colonies should really be a limiting factor on what kind of tech you can support, how fast you can harvest resources, etc. Otherwise whats the point of raising your population? What Im curious about is how does that present itself to the player and how much should it be possible or necessary to strategize around crew compliments? Do careers exist at all? Is there a reason to bring more than 1 kerbal on an exploration mission? Is there a reason to bring more than 3? \u003Cbr\u003E\u003Cbr\u003E\nOr say you had a pool of generic kerbals. Is it easier if A) each tech module requires x number of dedicated workers to operate, or B) that each module has a minimum population rating before it can be added? And if you can add 1, can you add as many as you like with the same population? If in regime A modules autofill with staff as you build them is that easier or harder to plan around and manage than regime B?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-13T04:10:19Z\u0022 title=\u002204/13/2021 04:10  AM\u0022 data-short=\u00223 yr\u0022\u003EApril 13, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-04-13T04:54:34Z","Content":"\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002275-72gobliiins.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022480\u0022 width=\u0022640\u0022 src=\u0022https://lparchive.org/Heroes-of-Might-and-Magic/Update%2006/75-72gobliiins.png\u0022\u003E\u003Cimg alt=\u00229-9peasants.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.00\u0022 height=\u0022480\u0022 width=\u0022640\u0022 src=\u0022https://lparchive.org/Heroes-of-Might-and-Magic/Update%2006/9-9peasants.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal professional and personal skills should be growing.\u003Cbr\u003E\nBut they should not be individualities until they deserve to get a name. \n\u003C/p\u003E\n\u003Cp\u003E\nYou bring a pack of nameless Kerbals to the rocket and to the colony. All of them are just \u0022Hey, you! Come here!\u0022\u003Cbr\u003E\nWhen a Kerbal becomes enough skilled to be individually noticed, you press \u0022Who am I ?\u0022 and the program generates his name and bio.\n\u003C/p\u003E\n\u003Cp\u003E\nNo need in evolving all 10 unskilled Engineers in your base individually.\u003Cbr\u003E\nJust with some probability upgrade someone of them from Eng.1 lvl to Eng. 2 lvl and so on.\u003Cbr\u003E\nSo, you had brought 4 Eng 1 lvl and 2 Eng 2 lvl and now you have 3 and 3 of them.\u003Cbr\u003E\nNameless, until you generate their personality, and unlikely you would until they are very skilled or you have a personal heroic mission for a noob. (The very first heroes - same way).\n\u003C/p\u003E\n\u003Cp\u003E\nThere should be a dialog like in HoMM recruiting but \u0022Mass load/unload the passengers\u0022.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Hero%20of%20Light.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002268.04\u0022 height=\u0022364\u0022 width=\u0022535\u0022 src=\u0022http://www.celestialheavens.com/homm3/WoG%20Files/Images/Hero%20of%20Light.jpg\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nYou have \u002224 Engineers 1 lvl\u0022 in \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E, move the spinner to move 11 of them to the ship passenger cabin without personal clicking.\u003Cbr\u003E\nSame with  \u002215 Engineers 2 lvl\u0022, \u00225 Scientists 2 lvl\u0022, \u0022Colonists\u0022, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nOn arrival to the base you use similar dialog to move 6 Eng 1 lvl into one base module, 5 of them into another module.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nThere should be Colonists which aren\u0027t skilled and aren\u0027t specialized.\u003Cbr\u003E\nYou bring them with same dialogs (load 200 Colonists in \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E and unload 150 of them in your colonial habitat, then 50 in orbital base),\n\u003C/p\u003E\n\u003Cp\u003E\nThey should produce a special non-material resource like \u0022\u003Ca href=\u0022https://en.wikipedia.org/wiki/Trudoden\u0022 rel=\u0022external nofollow\u0022\u003ELabour Day\u003C/a\u003E\u0022, meaning a labour day of unskilled Kerbal.\u003Cbr\u003E\nIts amount should affect the base productivity either in form of requirement, or in form \u0022the more labour days you got - the faster the production runs\u0022.\u003Cbr\u003E\nThe more Colonists you have - the more LabourDays you get, the faster is the resources production.\n\u003C/p\u003E\n\u003Cp\u003E\nAn individually taken and trained Colonist becomes a specialist (Eng, Sci, Pil, etc).\u003Cbr\u003E\nWhen it gets enough skilled, you may be interested to ask it \u0022Who are you?\u0022, then it receives an auto-generated individuality.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-13T04:56:02Z\u0022 title=\u002204/13/2021 04:56  AM\u0022 data-short=\u00223 yr\u0022\u003EApril 13, 2021\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-04-15T22:54:58Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129408-kerbiloid/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022129408\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129408-kerbiloid/\u0022 rel=\u0022\u0022\u003E@kerbiloid\u003C/a\u003E Im afraid though that might all get too micro-managey. In my longer saves I\u0027d often have 50-80 kerbals on the roster, 1/3 or so doing missions around kerbin training and mining fuel and the rest on long-term interplanetary missions. Even trying to level up that many kerbals by ferrying them around strategically becomes pretty tedious. I just cant see taking the time to level up hundreds of potential colonists, and even having more than 3 careers is likely to add to annoying personnel shortages and imbalances. The most management I could see is a banished/frostpunk type model where large numbers of Kerbals can be assigned to different modules at a colony to keep things humming along, ideally only after making a bunch of build changes, and letting things coast from there if you\u0027ve got your outputs well balanced. It might be nice too if giving kerbals jobs in this way resulted in visible activity as they went on shifts, gathered resources and science around the colony, etc. The whole thing would look more alive because it IS more alive. Or maybe it\u0027s even simpler than that. It could be there\u0027s no personnel management at colonies at all and if a module is active and has the input resources it needs and you have enough total colonists it just hums silently along. With this latter model I only worry that kerbals themselves become ancillary, and it might be difficult to produce tight game balance and intuitive strategy for the player by using only population caps and tech unlocks. Its almost easier if they can say \u0022Okay I want 3 more fuel factories that need 6 kerbals each to run efficiently but I\u0027ve only got 20 idle colonists.... what should I do?\u0022 than to be thinking \u0022Okay so at 80 kerbals I can build 1 metallic hydrogen plant, and every 10 kerbals after that I can build one more.\u0022\u003Cbr\u003E\u003Cbr\u003E\nEither way you probably don\u0027t want to spend endless time fiddling with colonies when the real game is about building and flying your expeditions. At most it seems like after a big boom event you cycle through your colonies, make some upgrades, allocate new kerbal crew members, and get right back into designing your next mission.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-15T23:35:55Z\u0022 title=\u002204/15/2021 11:35  PM\u0022 data-short=\u00223 yr\u0022\u003EApril 15, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dr. Kerbal","CreatedById":207217,"CreatedDateTime":"2021-04-16T00:08:47Z","Content":"\n\u003Cp\u003E\nI personally think kerbals aren\u0027t resources. I think of them in this case like you know. The lab in Kerbal Space Program. You use them to make extra science. I think they will have that kind of use.  But Im a casual.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-04-16T00:35:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/207217-dr-kerbal/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022207217\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/207217-dr-kerbal/\u0022 rel=\u0022\u0022\u003E@Dr. Kerbal\u003C/a\u003E Thats part of my point though: if kerbals aren\u0027t a resource, if they aren\u0027t integrated into the central mechanics of the game and you don\u0027t need them for anything, then they don\u0027t really matter and they\u0027re just window-dressing. There\u0027s no reason to have more than a few and no incentive to grow colonies. \u003Cbr\u003E\u003Cbr\u003E\nUnrelated continued thoughts on this: Im liking more and more the idea of a single abstracted life support resource thats used to craft habitable modules. For simplicity and forgiving gameplay it could be considered closed cycle, but you\u0027d still need to feed greenhouses to produce more of it so your colony can expand. \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-04-16T12:49:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223955195\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618533321\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUnrelated continued thoughts on this: Im liking more and more the idea of a single abstracted life support resource thats used to craft habitable modules. For simplicity and forgiving gameplay it could be considered closed cycle, but you\u0027d still need to feed greenhouses to produce more of it so your colony can expand. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile I was replying to you in the other thread I thought about a system that coincidentally is perfect for this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nImmagine if Kerbals have a \u0022stress level\u0022, working makes them more stressed, good living conditions act as a multiplier of the maximum stress, not having \u0022generic supplies\u0022 greatly reduces the bearable stress from months to days.\n\u003C/p\u003E\n\u003Cp\u003E\nA lot similar to the homesickness of some life support mods but more generic.\n\u003C/p\u003E\n\u003Cp\u003E\nOn top of that you can add that traveling without a pilot or an engineer makes kerbal stressed or any other incentive like this to have an eterogeneous crew.\n\u003C/p\u003E\n\u003Cp\u003E\nCouple that with a science system less based on instantaneous experiments and more on medium to long term scientific programs on other planets or in orbit (performed by scientists) and you get a use for pre-colonization bases and stations, making Kerbal a resource and having a crew rotation and life support mechanic that doesn\u0027t kill every crew you forgot while time-warping another mission thus keeping the \u0022rescue mission\u0022 aspect of the game.\n\u003C/p\u003E\n\u003Cp\u003E\nThen you can obviously also have some pre-colonization closed system for smaller bases and som mechanic to reset the stress timer without a crew rotation to allow for more permanent bases (or maybe the supply route system can work for crew and supplies too).\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-04-16T13:56:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223955427\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618577351\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhile I was replying to you in the other thread I thought about a system that coincidentally is perfect for this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nImmagine if Kerbals have a \u0022stress level\u0022, working makes them more stressed, good living conditions act as a multiplier of the maximum stress, not having \u0022generic supplies\u0022 greatly reduces the bearable stress from months to days.\n\u003C/p\u003E\n\u003Cp\u003E\nA lot similar to the homesickness of some life support mods but more generic.\n\u003C/p\u003E\n\u003Cp\u003E\nOn top of that you can add that traveling without a pilot or an engineer makes kerbal stressed or any other incentive like this to have an eterogeneous crew.\n\u003C/p\u003E\n\u003Cp\u003E\nCouple that with a science system less based on instantaneous experiments and more on medium to long term scientific programs on other planets or in orbit (performed by scientists) and you get a use for pre-colonization bases and stations, making Kerbal a resource and having a crew rotation and life support mechanic that doesn\u0027t kill every crew you forgot while time-warping another mission thus keeping the \u0022rescue mission\u0022 aspect of the game.\n\u003C/p\u003E\n\u003Cp\u003E\nThen you can obviously also have some pre-colonization closed system for smaller bases and som mechanic to reset the stress timer without a crew rotation to allow for more permanent bases (or maybe the supply route system can work for crew and supplies too).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah I like this better. I think it\u0027s worth considering how much tinkering a given system adds to the overall play of the game, but having a simple stress/happiness rating across a colony or vessel might hit a few birds with one stone: incentivizing adequate habitation space, bigger crews, and sufficient life support. One of the things that works really well in \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003E\u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E\u003C/abbr\u003E-LS is the dynamic between recyclers and converters. \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003E\u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E\u003C/abbr\u003E is probably too finicky with everything else going on in KSP2 but if it were simplified it might work. If for instance LS depleted slowly over time recyclers could make it deplete more slowly, and greenhouses/hydroponics could replenish it. And like you said if it runs out the crew just becomes grumpy and and wont perform as well, reducing the efficiency of mining, science gathering, etc. It\u0027s enough to get players thinking but not so much that it\u0027ll kill you. It also gets players involved in Kerbals\u0027 wellbeing, which I think is an important part of staying emotionally invested. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-16T15:40:38Z\u0022 title=\u002204/16/2021 03:40  PM\u0022 data-short=\u00223 yr\u0022\u003EApril 16, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-04-16T17:25:38Z","Content":"\n\u003Cp\u003E\nWell, in the grand scheme Kerbals are resources that will have to be managed. (Much like employees are resources for businesses.) But when you start getting to 40-50 Kerbals, personally managing them becomes a horrible chore. (Even in game where employee/citizen management is the goal, you still do global edicts for mass changes and can go to the personal level when needed.)\n\u003C/p\u003E\n\u003Cp\u003E\nI could see a system where (when you reach a certain size) you have a few named Kerbals that act like managers and the rest are just an unnamed pool of workers to help keep the colony running and use for recruitment. Obviously if you want to keep your colony running smoothly, you would want to keep your Kerbals happy. Just an happiness score per colony should be enough. If you click on the named manager, they will tell you what the colony needs to increase the happiness. It wouldn\u0027t be detrimental if you have an unhappy colony, it would just under perform. Once you reach a certain level of happiness, the manager would offer up a \u0022we\u0027re good, thanks for checking in\u0022 message. And the colony would be running close to as efficiently as possible.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-04-18T04:18:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223955628\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618593938\u0022 data-ipsquote-userid=\u0022113880\u0022 data-ipsquote-username=\u0022shdwlrd\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/16/2021 at 7:25 PM, shdwlrd said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, in the grand scheme Kerbals are resources that will have to be managed. (Much like employees are resources for businesses.) But when you start getting to 40-50 Kerbals, personally managing them becomes a horrible chore. (Even in game where employee/citizen management is the goal, you still do global edicts for mass changes and can go to the personal level when needed.)\n\u003C/p\u003E\n\u003Cp\u003E\nI could see a system where (when you reach a certain size) you have a few named Kerbals that act like managers and the rest are just an unnamed pool of workers to help keep the colony running and use for recruitment. Obviously if you want to keep your colony running smoothly, you would want to keep your Kerbals happy. Just an happiness score per colony should be enough. If you click on the named manager, they will tell you what the colony needs to increase the happiness. It wouldn\u0027t be detrimental if you have an unhappy colony, it would just under perform. Once you reach a certain level of happiness, the manager would offer up a \u0022we\u0027re good, thanks for checking in\u0022 message. And the colony would be running close to as efficiently as possible.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe simplest way of doing that is separating astronauts from civilians, making a clear difference between them.\n\u003C/p\u003E\n\u003Cp\u003E\nThat way you keep the single-member crew management for the exploration gameplay while not having to micromanage the \u0022huge and thriving Witerun Colony space city\u0022 populated by a whopping 36 citizens and 2 astronauts.\n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2021-04-18T08:37:00Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105624-pthigrivi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022105624\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105624-pthigrivi/\u0022 rel=\u0022\u0022\u003E@Pthigrivi\u003C/a\u003EAny chance you would mind adding a poll to this thread to see which of the options people would prefer if they were given the choice?\n\u003C/p\u003E\n\u003Cp\u003E\nIt may help publicly quantify what direction the community may want this to head in.\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2021-04-18T10:30:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223956515\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618719516\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe \u0022huge and thriving Witerun Colony space city\u0022 populated by a whopping 36 citizens and 2 astronauts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u0022I used to be an astronaut like you, but then I took an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E in the knee.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n(sorry.... couldn\u0027t be helped.)\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-04-18T15:16:46Z","Content":"\n\u003Cp\u003E\n“My cousin’s out fighting space Krakens, and what do I get? Greenhouse duty.”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/180102-mcwaffles2003/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022180102\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/180102-mcwaffles2003/\u0022 rel=\u0022\u0022\u003E@mcwaffles2003\u003C/a\u003E I thought about it when I first made the post but decided we probably don’t know enough about the rest of the way colonies and exploration work. I see this a lot in my job (architecture) where clients will be presented with a choice about something specific too early and in a way that doesn’t take in the full context. Without knowing how science or resource gathering will work I think its hard to make an informed opinion, and I wouldn’t want to sway the devs if they’ve got something more clever in mind. Maybe I’ll add one later if we get a big run down on colony mechanics at some point. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/68648-master39/\u0026amp;do=hovercard\u0022 data-mentionid=\u002268648\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/68648-master39/\u0022 rel=\u0022\u0022\u003E@Master39\u003C/a\u003E Yeah thats the other distinction that could be made, ether 2 classes, astronauts and civilians, or 4 classes with pilots, engineers, scientists, and generic colonists. It depends a lot on what kerbals can or need to do. Right now in KSP1 you really only ever need a couple of kerbals on any mission, and usually not even a pilot because probe cores do their jobs just as well. Id love it in KSP2 if there were a real reason to bring 6-10 kerbals on big exploration missions. Maybe its just that they stay happier in larger groups, but that might be difficult to balance and predict as a player. Or maybe its that some engines require bigger command modules, and those command modules require more kerbals to operate? Maybe there are gameplay reasons why bringing larger labs that need more scientists makes sense on big exploration missions? Or other systems work more efficiently? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-18T15:43:29Z\u0022 title=\u002204/18/2021 03:43  PM\u0022 data-short=\u00223 yr\u0022\u003EApril 18, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PlutoISaPlanet","CreatedById":206057,"CreatedDateTime":"2021-04-18T16:21:58Z","Content":"\n\u003Cp\u003E\nI imagine that kerbal classs/specialist return, just that they have more uses in colonies. Maybe they ofshoot int specialized jobs such as farming, power management, etc.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-04-18T21:02:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223956515\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618719516\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe simplest way of doing that is separating astronauts from civilians, making a clear difference between them.\n\u003C/p\u003E\n\u003Cp\u003E\nThat way you keep the single-member crew management for the exploration gameplay while not having to micromanage the \u0022huge and thriving Witerun Colony space city\u0022 populated by a whopping 36 citizens and 2 astronauts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, not really. Anyone can be trained to do a job to various degrees. Look at the humble farmer. They are also mechanics, market annalists, engineers, geologists, carpenters, biologists. Now look at the backgrounds off the modern and past astronauts. Basically, KSP needs to move away from only certain classes being able to certain jobs. \n\u003C/p\u003E\n\u003Cp\u003E\nI would say those Kerbals that are on a mission are individually controlled, like how KSP is now. Any Kerbal that is added to a colony becomes nameless until you need them for another mission. But separating the Kerbals into classes before the recruitment process is unnecessary. It wouldn\u0027t matter at the colony level, unless you want to micromanage you colonies. I\u0027m sure most people don\u0027t though. (I\u0027m not saying that the Kerbals names and stats aren\u0027t set in the background, you wouldn\u0027t see their stats until you need to recruit them. Nor will they show on any rosters until they are assigned to a mission.)\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-04-18T22:10:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223956830\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618779743\u0022 data-ipsquote-userid=\u0022113880\u0022 data-ipsquote-username=\u0022shdwlrd\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, shdwlrd said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, not really. Anyone can be trained to do a job to various degrees. Look at the humble farmer. They are also mechanics, market annalists, engineers, geologists, carpenters, biologists. Now look at the backgrounds off the modern and past astronauts. Basically, KSP needs to move away from only certain classes being able to certain jobs. \n\u003C/p\u003E\n\u003Cp\u003E\nI would say those Kerbals that are on a mission are individually controlled, like how KSP is now. Any Kerbal that is added to a colony becomes nameless until you need them for another mission. But separating the Kerbals into classes before the recruitment process is unnecessary. It wouldn\u0027t matter at the colony level, unless you want to micromanage you colonies. I\u0027m sure most people don\u0027t though. (I\u0027m not saying that the Kerbals names and stats aren\u0027t set in the background, you wouldn\u0027t see their stats until you need to recruit them. Nor will they show on any rosters until they are assigned to a mission.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe idea is that \u0022named kerbals\u0022, the astronauts, can count toward the population, maybe even with all sort of bonuses and in some cases are even required, on the other hand the \u0022civilians\u0022 is the pool of workers or population of a colony, you can then recruit new astronauts from the population by building the dedicated facilities.\n\u003C/p\u003E\n\u003Cp\u003E\nOn top of that you can then add all sorts of gameplay loops, like key position being automatically filled with civilians but you\u0027re able to use a named astronaut instead and get some bonus or civilian having stricter requirement in terms of life support or reputation hit on loss compared to astronauts.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-04-19T00:26:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223956863\u0022 data-ipsquote-contentid=\u0022201663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618783826\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOn top of that you can then add all sorts of gameplay loops, like key position being automatically filled with civilians but you\u0027re able to use a named astronaut instead and get some bonus or civilian having stricter requirement in terms of life support or reputation hit on loss compared to astronauts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe trick with this is producing astronauts should really come with a cost, otherwise why wouldn\u0027t you promote everyone?  This implies a training module of some kind that requires energy, time, or both to churn out upgraded Kerbals. Its kind of the reason I like the idea of booms producing kerblings rather than full-on colonists, because it would give players a buffer period after the boom to build new habitation and LS capacity rather than needing to guess at the size of the boom and overbuild capacity ahead of time. It could also be cute if the nursury was like a pond that they all lived in like little mudskippers and as you added capacity they would grow up and into the main population. Maybe the next step is slowly training up new astronauts over time that can do more than tend greenhouses and watch after fuel factories? \u003Cbr\u003E\u003Cbr\u003E\nWhich leads me to the deeper question: what is the leanest and cleanest way to manage your population? Since the core experience is building rockets and exploring how does colonization feed into that without demanding huge amounts of player micromanagement? How do kerbals remain relevant without being cumbersome? Lets talk about vessels first since thats something we\u0027re more familiar with in KSP1. Like I said before there\u0027s no real reason to bring more than one engineer and a couple of scientists on any mission. So maybe instead of needing 1 kerbal to operate certain command modules you need 2 or 4 or 6? Like the way you need to fill science labs to operate them? Likewise maybe some parts like ore drills or fancy engines would require staffing an engineering control module. That way early on missions would only require one pilot, but as missions become more complex they would need bigger crews to be operated and create more interesting design challenges in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E. To cut down on micro-management you could lose the 3 classes and just have those seats fill automatically if astronauts were available. You could still have passenger seats to move colonists from place to place, but only labs and command modules would fill automatically. \u003Cbr\u003E\u003Cbr\u003E\nWhich leads me to think if filling mission critical seats works for vessels, could it work for colonies too? Is it just as easy if greenhouses and fuel factories and milk-run control modules require a certain number of kerbals to function efficiently? They could fill automatically, but you could manually shuffle them around if you were short on staff or wanted to prioritize different outputs. It amounts to the same thing as having population thresholds, but somehow to me it seems more intuitive and flexible. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-19T01:38:30Z\u0022 title=\u002204/19/2021 01:38  AM\u0022 data-short=\u00223 yr\u0022\u003EApril 19, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}