{"TopicId":202817,"ForumId":109,"TopicTitle":"Questions / thoughts about late-game resources in KSP 2","CreatedByName":"StopIteration","CreatedById":208942,"CreatedDateTime":"2021-06-01T04:37:18Z","PageNum":1,"Articles":[{"CreatedByName":"StopIteration","CreatedById":208942,"CreatedDateTime":"2021-06-01T04:37:18Z","Content":"\n\u003Cp\u003E\nI am very curious about the details of how late-game progression will work in KSP 2, specifically in relation to resources.  I know that metastable metallic hydrogen is a resource that is planned for some late-game engines, but how will it be obtained?  I think it would be a missed opportunity if scifi resources can be obtained basically anywhere.  Since KSP is a game about space exploration, I think that (realistic or not), scifi resources should be scattered throughout the kerbin system and you have to go out and make mining outposts all over the place in order to be able to make the high tech engines and parts you need to progress in career mode.\n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t been following KSP 2 development too closely and I can\u0027t easily find too much about this, so I\u0027m curious if anything has been said about this.\n\u003C/p\u003E\n\u003Cp\u003E\n---\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I think there should be many kinds of resources with different challenges in obtaining them.  Some example ideas (IDK how fun they would actually be):\n\u003C/p\u003E\n\u003Cp\u003E\nA super-metal that (at least in the kerbin system) is only found in some rare asteroids.  It is required in order to build some high-tech engines (eg the orion drive would benefit from a super-strong, but light material to withstand the nuclear bombs and protect against radiation, and in game this resource could be required for that).  You would need to set up a network of asteroid scanning satellites and wait until anomalous asteroids pop up and then send missions to mine them.  These asteroids only have a limited amount of the metal, though there could be exoplanets with huge (probably inexhaustible) deposits.\n\u003C/p\u003E\n\u003Cp\u003E\nSome kind of exotic material that can only be found on planets very close to the sun, like on the poles of Moho.  Think dilithium crystals or something, it could be some kind of compound that can trap antimatter or other exotic particles in a stable way, like positronium but much more stable.  This could be required for high-tech engines and power sources.\n\u003C/p\u003E\n\u003Cp\u003E\nA super volatile primordial ice that can only be found in planets very far away from the sun (otherwise it all just gets sublimated away).  Perhaps this could be the metastable metallic hydrogen, or a precursor to it -- the conceit being that it was somehow formed in abundance in the early universe but now this is all that\u0027s left.\n\u003C/p\u003E\n\u003Cp\u003E\nA trace gas that can only be found deep within the atmospheres of some gas giants, IDK what it would be used for, I just want refineries floating in the clouds of gas giants.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously all of these ideas are on very shaky scientific ground, but the point is to gate late-game progression in the game based on exploring and colonizing many worlds.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-06-01T06:06:01Z","Content":"\n\u003Cp\u003E\nMore of what you\u0027re talking about would be the middle progression of the game. You would need to discover all that you\u0027re mentioning before even leaving the Kerbol system. Base/colony building will be necessary and is going to be a stock feature. You will have to mine and process a multitude of different resources in different locations in the solar system. You will have to create logistics networks to transport resources around the solar system. (There will be automation for that part.) The end game is sending a colony ship to start a new colony in a new solar system to start the cycle of exploration and expansion again.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, the devs have thought of everything you mentioned and will be incorporating it into the game. If you watch the show and tell videos and read the dev diaries for KSP2. They have already created and described a lot of what you suggested along with other information about the game.\n\u003C/p\u003E\n"},{"CreatedByName":"StopIteration","CreatedById":208942,"CreatedDateTime":"2021-06-01T06:42:47Z","Content":"\n\u003Cp\u003E\nI\u0027ve seen some stuff about the logistics, mining and base building, but it\u0027s not clear to me if those would actually gate the progression.  Certainly it\u0027s useful to have mining bases even without having there be exclusive resources where you need to go certain places to get, but that\u0027s not really the same thing.\n\u003C/p\u003E\n\u003Cp\u003E\nMy concern with the metallic hydrogen specifically is that if you can just make it from hydrogen gas with a big compressor thing there would be no reason why you can\u0027t just make it on kerbin.  That would seem to make the progression more like in KSP 1 where all you really need to do is gather enough science points to unlock more parts.  And I haven\u0027t heard of any other scifi resources other than metallic hydrogen.  So I want to know what the progression to get access to the future techs would look like.\n\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2021-06-01T06:46:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223982360\u0022 data-ipsquote-contentid=\u0022202817\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221622522238\u0022 data-ipsquote-userid=\u0022208942\u0022 data-ipsquote-username=\u0022StopIteration\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, StopIteration said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA trace gas that can only be found deep within the atmospheres of some gas giants\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m not allowed to use the words necessary to properly describe the feeling of diving into a gas giant with a sleek behemoth of a ship and an air scoop. Karbonite \u002B OPM is an \u003Cem\u003Eexperience\u003C/em\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2021-06-01T07:13:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223982384\u0022 data-ipsquote-contentid=\u0022202817\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221622529767\u0022 data-ipsquote-userid=\u0022208942\u0022 data-ipsquote-username=\u0022StopIteration\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, StopIteration said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy concern with the metallic hydrogen specifically is that if you can just make it from hydrogen gas with a big compressor thing there would be no reason why you can\u0027t just make it on kerbin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf MH exists its is made at a pressure that can fracture diamonds, so I dont think its very viable to scaling via \u0022a big compressor thing\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been thinking about this topic for a while but have been hesitant in bringing it up since there are just too many \u0022I don\u0027t knows\u0022 along the way as in we still have little info about the game and its career mechanics. But to speculate on speculations... I think the first valuable resource should be money and as colonization starts and space program funds inflate money should slowly be less and less valuable (new tech parts costs increase exponentially) and its place be filled with direct  rare resource gathering. Rare resources being those that cannot be purchased with money but must be gathered off world or have ludicrous prices that make bulk purchases of the material economically very painful (real world costs of He-3 are about $1.3billion/1,000 Kg \u003Ca href=\u0022https://www.lpi.usra.edu/decadal/leag/DecadalHelium3.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.lpi.usra.edu/decadal/leag/DecadalHelium3.pdf\u003C/a\u003E) . With this, instead of ships costing money there could be an alternative of completely funding a ship with the raw resources at hand at the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E/BAE you are building your craft at. This would mean each part should have an alternative resource cost and perhaps money won\u0027t be accepted anywhere but the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u0027s buildings. Hopefully if balanced properly this transition will just barely begin when the first couple mining colonies have been established and be mostly switched over as players stop building things at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Until then we will be faced with a problem... \u0022what happens if the player just digs up a bunch of resources and sells them at kerbin or something like ore mining in KSP 1?\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nTo that I\u0027d say there are options:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nHave a simple economy system for resource exchange where as the player sells resources the value of that resource plummets as they \u0022saturate the market\u0022. Similar to selling/buying resources in Age of Empires but perhaps with an actual inventory so you can\u0027t buy more rare resources than you have sold.\n\u003C/li\u003E\n\u003Cli\u003E\nMake it so materials can\u0027t be sold. Instead of recovering costs for recovered vessels just leave those vessels in a hangar.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nHaving systems like this in place should properly gatekeep players from higher techs without developing the infrastructure to mine the resources to use them even if they have been researched and make it so older techs don\u0027t become worthless too soon.\n\u003C/p\u003E\n"},{"CreatedByName":"StopIteration","CreatedById":208942,"CreatedDateTime":"2021-06-01T07:44:05Z","Content":"\n\u003Cp\u003E\nGood points.  Yeah I think that second option would work well for the economy, although it wouldn\u0027t be necessarily need to store full ships, they could just be scrapped for resources, both for their fuel and for the materials used to build the parts.  Building stuff on kerbin would give you the option of automatically buying any (non-scifi) resources that you need with money when you try to build a craft but don\u0027t have enough resources in store, but otherwise you can use what you already have to save cash.  And off-planet you obviously can\u0027t just buy stuff.\n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2021-06-01T07:54:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223982403\u0022 data-ipsquote-contentid=\u0022202817\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221622533445\u0022 data-ipsquote-userid=\u0022208942\u0022 data-ipsquote-username=\u0022StopIteration\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, StopIteration said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nit wouldn\u0027t be necessarily need to store full ships, they could just be scrapped for resources\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s what opens the door to selling mined materials on kerbin since you would be scrapping those materials. This is what happens in KSP 1 with \u0022ore\u0022. Hence my avoiding the scrapping option.\n\u003C/p\u003E\n"},{"CreatedByName":"StopIteration","CreatedById":208942,"CreatedDateTime":"2021-06-01T08:52:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223982408\u0022 data-ipsquote-contentid=\u0022202817\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221622534092\u0022 data-ipsquote-userid=\u0022180102\u0022 data-ipsquote-username=\u0022mcwaffles2003\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, mcwaffles2003 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s what opens the door to selling mined materials on kerbin since you would be scrapping those materials. This is what happens in KSP 1 with \u0022ore\u0022. Hence my avoiding the scrapping option.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, the problem with KSP 1 is you can just mine ore on the launch pad, sell it for money, and use that money to buy whatever you want.  But as long as all you get back is the resources you mined rather than money, that\u0027s fine.  You\u0027d be no better off than if you set up an independent colony on kerbin to mine / refine ore to build ships from (which will presumably be possible regardless since you can build such colonies on other planets).  Also the area around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E can be made very poor in most resources so that you really would need to set up a separate colony away from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E in order to do any mining on kerbin (but again there would be little advantage to doing so).\n\u003C/p\u003E\n\u003Cp\u003E\nIn this case, you wouldn\u0027t be able to sell the resources you have, so there would be limited fungibility, but there\u0027d still be some so that you can build an empty fuel tank out of the metal from a recovered command module (minus scrapping losses), but not vice versa (because presumably a command module would require some other resources, depending on how complicated the resource system in the game is).  And you certainly wouldn\u0027t be able to turn that metal into fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother option with less fungability (but still more than recovering whole crafts) would just be to have scrapping store all component parts \u002B stored resources, and then tack on a refurbishing cost when you want to use the parts.  But this has several complications, such as for procedural parts, so I think scrapping to get component resources would be simpler because the system of needing to build stuff with resources would presumably already exist for off-planet bases, so the only change would be to make it so that building stuff on kerbin auto-buys resources you\u0027re missing.  And I think some fungability is good.\n\u003C/p\u003E\n\u003Cp\u003E\nNo matter what, the ability to build craft off-world with in-situ resources will change the economics of the game quite a bit and de-emphasize the importance of money for ship construction in the mid to late-game.  However, there could be some manufactured resources that can only be bought on kerbin (or with advanced colony equipment that would be completely impractical to setup on kerbin just to bypass purchasing those resources).  Also kerbals could have salaries.  No way to pay that with a pile of ore.\n\u003C/p\u003E\n\u003Cp\u003E\nIn any case, this is a bit off topic to the progression system, though it is somewhat related and an interesting discussion.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-06-01T10:43:10Z\u0022 title=\u002206/01/2021 10:43  AM\u0022 data-short=\u00223 yr\u0022\u003EJune 1, 2021\u003C/time\u003E by StopIteration\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-06-01T17:49:04Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208942-stopiteration/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022208942\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208942-stopiteration/\u0022 rel=\u0022\u0022\u003E@StopIteration\u003C/a\u003E It\u0027s already been said that the game/tech progression will differ from KSP1. We don\u0027t know how it will work at the moment.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s been proven by the videos and screen shots from them that its the cost in materials, not funds, are required to build a craft. The need for funds will diminish as soon as you can build crafts at colonies. It would make sense to remove that need from the game all together. The only limiting factor is the amount of resources you can gather, process, transport and the time to do all of that.\n\u003C/p\u003E\n"}]}