{"TopicId":203977,"ForumId":109,"TopicTitle":"How will we land the colony vab?","CreatedByName":"Hyperspace Industries","CreatedById":212417,"CreatedDateTime":"2021-07-24T12:27:45Z","PageNum":1,"Articles":[{"CreatedByName":"Hyperspace Industries","CreatedById":212417,"CreatedDateTime":"2021-07-24T12:27:45Z","Content":"\n\u003Cp\u003E\nIt is huge! I estimated it is 60 by 35 meters, so, will it compress down, split up, be assembled by kerbals, or something else? I’d love to hear from anyone. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2021-07-24T13:32:27Z","Content":"\n\u003Cp\u003E\nWe don\u0027t land it. We build it on site. Once we land and build the tools required to do so.\n\u003C/p\u003E\n"},{"CreatedByName":"PlutoISaPlanet","CreatedById":206057,"CreatedDateTime":"2021-07-24T13:41:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224008893\u0022 data-ipsquote-contentid=\u0022203977\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221627133547\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe don\u0027t land it. We build it on site. Once we land and build the tools required to do so.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIm pretty sure you are right. I thought Nate said we landed it. If that is the case, maybe we land a foundation of sorts and then we build it? \n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2021-07-24T14:21:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224008896\u0022 data-ipsquote-contentid=\u0022203977\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221627134112\u0022 data-ipsquote-userid=\u0022206057\u0022 data-ipsquote-username=\u0022PlutoISaPlanet\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n39 minutes ago, PlutoISaPlanet said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIm pretty sure you are right. I thought Nate said we landed it. If that is the case, maybe we land a foundation of sorts and then we build it? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou build the foundation then the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2021-07-24T15:51:23Z","Content":"\n\u003Cp\u003E\nVery carefully.\n\u003C/p\u003E\n"},{"CreatedByName":"PlutoISaPlanet","CreatedById":206057,"CreatedDateTime":"2021-07-24T19:49:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224008905\u0022 data-ipsquote-contentid=\u0022203977\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221627136511\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou build the foundation then the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly!\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2021-07-26T15:19:24Z","Content":"\n\u003Cp\u003E\nI assumed it was build on site, many of round modules seen on top of ships are not fuel tanks but parts kits.\u003Cbr\u003E\nBut the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E itself is build by the colony. \u003Cbr\u003E\nAs an colony with an \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E need to be able to produce spaceships as its the point of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and spaceships are more complex than the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. \u003Cbr\u003E\u003Cbr\u003E\nDo not know how the colony building will work but I guess you start by landing parts to build an small foundation then some hab modules and power. \u003Cbr\u003E\nNext step is to extract resources, this can be to fuel rockets or to export.  Then perhaps greenhouses for life support?\u003Cbr\u003E\u003Cbr\u003E\nBut the big step is part production: it might require various resources and might have layers like an simplified tech tree. \u003Cbr\u003E\nFirst structural elements like foundations and tanks, then more advances stuff like habitation modules, then all but advanced stuff, this reduced the amount of parts you need to land. Last you can build everything and if they uses a system like this its probably also the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E as limiting the types of ships you can build will be to complext. \u003Cbr\u003E\u003Cbr\u003E\nThe orbital shipyard will need to import everything but its has no size limits \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2021-09-08T22:11:08Z","Content":"\n\u003Cp\u003E\nI guess the next question that follows along after this one is \u0022how big is the \u0022thing\u0022 that you need to land to get a colony \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E built?\u0022 whatever that \u0022thing\u0022 may be (is it something that can take in raw metallic ores and spit out girders and the like? Or is it \u0022you send X many tons worth of shipments of girders and such to build a \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nI really have no idea what it is we have to land to get a colony even started. Is it individual habitats that are able to be carried by rocket? Is it mining and processing equipment? Is it some of both?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d really like to be able to have some sort of \u0022seed factory\u0022 part with a simple part module (not 20 parts, and not 20 part modules on one part), that takes input of things you\u0027d be able to find on a planetary surface (ores and the like) and then it spits out \u0022parts\u0022 (not actual parts, implement it as just progress on a progress bar) when fed with those resources, and when fed with enough resources it will spawn a colony \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E (or whatever other colony parts you tell it to spawn, capabilities for early or small units might be limited, or it could just take longer with smaller units, or more advanced parts might take less abundant resources, or any combination of those things).\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, it goes like this: Land a not-so-small \u0022colony fabrication factory\u0022 part on planet (it might be 3.75 m in diameter and weigh 20 tons), include some power source (potentially several hundred EC/second, so a reactor or a lot of fuel cells would be a good choice) and mining drills to extract metallic ores (and maybe fuel ores too, if you want to start launching more rockets right away). This will let you (over time) construct a few basic colony habitat and resource processor parts, a beginning launch/landing pad where ships could land and get refueled with basic fuels, a colony mining drill type thing, and the \u0022real\u0022 colony fabrication factory thing.\u003Cbr\u003E\nThis would be a part that is so big that most people would consider it impractical to move around by rocket (but please DO NOT make it strictly impossible, for instance don\u0027t make it not able to be selected in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E).\u003Cbr\u003E\nYes, it would be very heavy but I want the option of skipping the \u0027seed colony\u0027 step if I\u0027m willing to build a rocket big enough to move the thing around in space. Say it\u0027s 100t of dry mass and is at least 5m diameter, and who knows maybe it\u0027s some awkward shape too, I don\u0027t care I want the ability to move it around myself.\n\u003C/p\u003E\n\u003Cp\u003E\nAll I\u0027d need to be able to launch would be the big colony fabricator, at least the smallest size of colony mining drill (if there are multiple sizes), and at least the smallest/most basic size/capability of colony power sources (if there are multiple sizes).\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t want to launch the Colony \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E. I understand that launching a whole building is quite a crazy proposition, but only because rockets firing and a rocket landing are NOT gentle things when considering the structural integrity of a building. But the colony building fabricator, the big heavy one that you can work your way up to from the small one? Yeah I want to be able to launch that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I guess the point I\u0027m trying to make with all this talk is that you shouldn\u0027t be able to work your way up from a single-capsule lander to a full-on planetary \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. You should need an appropriately \u0022industrial-sized\u0022 lander to land the parts you need to do that. That\u0027s where my \u002220 tons dry mass and 3.75m diameter\u0022 specification comes from. Machinery in general is HEAVY. Machinery that can work metal is REALLY HEAVY, even if it can be quite compact. So heavy that for something like a 50t forging hammer you\u0027d want to build a dedicated lander for JUST ONE of them at a time.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-08T22:15:54Z\u0022 title=\u002209/08/2021 10:15  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 8, 2021\u003C/time\u003E by SciMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Klapaucius","CreatedById":181256,"CreatedDateTime":"2021-09-08T22:22:24Z","Content":"\n\u003Cp\u003E\nI would hope that most of this stuff is built on site using resources and blueprints.  I could see something inspired by Subnautica, but done in a more realistic manner in which modular parts are combined to make large structures. What is required to do so are resources.\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2021-09-08T22:25:31Z","Content":"\n\u003Cp\u003E\nRight but you\u0027d have to have \u0022something\u0022 to process those resources into something that looks like a colony, you\u0027re not here on Earth where you can build a shelter of dried mud and straw.,\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-09-08T23:02:45Z","Content":"\n\u003Cp\u003E\nThe thought is the initial buildings of your colony would be akin to setting up a base using Pathfinder. You will start small inflatable or flat packed buildings that require small amounts of resources to setup. From the starting buildings you can start processing resources to construct the larger permanent structures.\n\u003C/p\u003E\n"},{"CreatedByName":"ave369","CreatedById":174958,"CreatedDateTime":"2021-09-09T05:01:05Z","Content":"\n\u003Cp\u003E\nI assume the process looks like that:\n\u003C/p\u003E\n\u003Cp\u003E\n* You assemble a KSP1-style base which is just a stationary craft. This gives you the ability to open the base editor, but so far it can do little more than the KSP1 engineering screen;\n\u003C/p\u003E\n\u003Cp\u003E\n* You start some \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E on your KSP1-style base. This allows you to build bigger parts in the base editor, and unlocks the first \u0022building\u0022 parts that are built in situ;\n\u003C/p\u003E\n\u003Cp\u003E\n* As you expand your base, build buildings and resettle Kerbals to your new extrakerbestrial settlement, you get more \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E options and unlock more building parts;\n\u003C/p\u003E\n\u003Cp\u003E\n* Eventually you gain the ability to build the runway, the launchpad, the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E and the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E;\n\u003C/p\u003E\n\u003Cp\u003E\n* Congratulations, you can now assemble and launch spacecraft from your brand new Muna City!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBuilding an orbital colony, I assume, would be the same but with no \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E options, you\u0027ll have to bring resources by big transport ships. The benefit, on the other hand, is that you can build spaceships directly in space, no launch required. I guess the best option for a space base would be a size E asteroid which will provide some \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-09T05:11:45Z\u0022 title=\u002209/09/2021 05:11  AM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 9, 2021\u003C/time\u003E by ave369\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-09-09T06:49:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224029602\u0022 data-ipsquote-contentid=\u0022203977\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221631139068\u0022 data-ipsquote-userid=\u002212748\u0022 data-ipsquote-username=\u0022SciMan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, SciMan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis would be a part that is so big that most people would consider it impractical to move around by rocket (but please DO NOT make it strictly impossible, for instance don\u0027t make it not able to be selected in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E).\u003Cbr\u003E\nYes, it would be very heavy but I want the option of skipping the \u0027seed colony\u0027 step if I\u0027m willing to build a rocket big enough to move the thing around in space. Say it\u0027s 100t of dry mass and is at least 5m diameter, and who knows maybe it\u0027s some awkward shape too, I don\u0027t care I want the ability to move it around myself.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m ok as long as the game doesn\u0027t cheat even a single gram of that weight.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat you don\u0027t bring with you you have to mine, if you want to land a \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E the kit(s) should weight as much as the completed building, not a gramm less, maybe more to account for packing.\n\u003C/p\u003E\n"},{"CreatedByName":"Hyperspace Industries","CreatedById":212417,"CreatedDateTime":"2021-09-09T09:11:40Z","Content":"\n\u003Cp\u003E\nThanks for all the attention this has gotten \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E, But, if I may ask, how shall we build orbital construction docks, or more accurately, how shall we get them to orbit? \u003C/span\u003E\u003Cbr\u003E\u003Cspan\u003EPS: should I make a new thread for this?\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2021-09-09T10:13:33Z","Content":"\n\u003Cp\u003E\nThat\u0027s most likely much easier. Surface \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003Evab\u003C/abbr\u003E is a huge building with a launchpad on the top. Orbital docks require, well, space, a starting point and maaybe a truss to hold the whole thing in one place.\n\u003C/p\u003E\n\u003Cp\u003E\nProblem lies with resources for building because while you probably could install a refinery in space, you still need to bring the raw materials from the surface.\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2021-09-19T21:45:00Z","Content":"\n\u003Cp\u003E\nI\u0027m totally on-board with not having the parts kits of those buildings weigh even a gram less than the finished building would weigh, furthermore I think we should have at least a 5% (likely more like 15%) additional mass penalty due to packaging. However that might be able to be reduced by research into packaging efficiency, there\u0027s tricks to be done like \u0022make the box out of stuff you\u0027ll need in the final product\u0022 that are relatively low-hanging fruit but eventually you might be able to get to the point of the \u0022package\u0022 being just a bunch of blocks of the requisite material strapped to a structural spine, along with maybe an additional 1% mass to account for some highly advanced technology (nanotech probably) that would take in power and those resource blocks (and the spine too!) and spit out beams girders rivets bolts and the like that would be useful to make an actual building.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m already pretty sure how I\u0027m going to set up my orbital shipyards.\n\u003C/p\u003E\n\u003Cp\u003E\nMy idea is to basically build it so that it doesn\u0027t have any actual containers of materials permanently part of the station (unless that\u0027s unavoidable), instead it would (hopefully) build ships directly from resources carried up from the surface.\u003Cbr\u003E\nAdditionally, I would take measures to minimize the actual processing of ore into refined goods done in orbit. Instead, basic refining and processing would be done on the surface of the planet or moon that the orbital shipyard is orbiting, with processed materials being launched to the orbital shipyard by the most efficient means (meaning the cheapest expendable rockets or highest performance reusable rockets, assuming there\u0027s no \u0022non-rocket orbital launch\u0022 methods available).\n\u003C/p\u003E\n"},{"CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-09-20T02:45:51Z","Content":"\n\u003Cp\u003E\nMoar boosters. How else?\n\u003C/p\u003E\n"},{"CreatedByName":"AtomicTech","CreatedById":210823,"CreatedDateTime":"2021-09-20T17:29:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224034154\u0022 data-ipsquote-contentid=\u0022203977\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221632105951\u0022 data-ipsquote-userid=\u0022210816\u0022 data-ipsquote-username=\u0022Admiral Fluffy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Admiral Fluffy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMoar boosters. How else?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224029726\u0022 data-ipsquote-contentid=\u0022203977\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221631170166\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/9/2021 at 1:49 AM, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m ok as long as the game doesn\u0027t cheat even a single gram of that weight.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat you don\u0027t bring with you you have to mine, if you want to land a \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E the kit(s) should weight as much as the completed building, not a gramm less, maybe more to account for packing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:72px;\u0022\u003E\u003Cstrong\u003EMOAR BOOSTAZ\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Hyperspace Industries","CreatedById":212417,"CreatedDateTime":"2021-09-20T19:15:57Z","Content":"\n\u003Cp\u003E\nMOAR EFFICIENT BOOSTAZ!!!!!!!!!!!\n\u003C/p\u003E\n"},{"CreatedByName":"AtomicTech","CreatedById":210823,"CreatedDateTime":"2021-09-20T19:18:24Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003E\u003Cspan style=\u0022font-size:72px;\u0022\u003EZUPA EFFICIENTER BOOZTAZ!!!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224034375\u0022 data-ipsquote-contentid=\u0022203977\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221632165357\u0022 data-ipsquote-userid=\u0022212417\u0022 data-ipsquote-username=\u0022Hyperspace Industries\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Hyperspace Industries said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMOAR EFFICIENT BOOSTAZ!!!!!!!!!!!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-20T19:18:47Z\u0022 title=\u002209/20/2021 07:18  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 20, 2021\u003C/time\u003E by AtomicTech\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-09-20T22:56:33Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:72px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003EMOAR \u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:72px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003EZUPA EFFICIENTER BOOZTAZ!!!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003E(going a little crazy here)\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2021-09-22T16:13:15Z","Content":"\n\u003Cp\u003E\nAlright alright, we get it. This isn\u0027t some reddit thread where you can post the same thing the last 5 posters said and get 50 karma from it.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: But really, you should be using nuclear boosters anyways.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-22T16:13:58Z\u0022 title=\u002209/22/2021 04:13  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 22, 2021\u003C/time\u003E by SciMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hyperspace Industries","CreatedById":212417,"CreatedDateTime":"2021-09-22T18:50:37Z","Content":"\n\u003Cp\u003E\nAlrighty everyone, let\u0027s get this thread back on track. New question: how long should it take to establish a colony, and what could go wrong?\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-09-22T19:04:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224035048\u0022 data-ipsquote-contentid=\u0022203977\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221632336637\u0022 data-ipsquote-userid=\u0022212417\u0022 data-ipsquote-username=\u0022Hyperspace Industries\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Hyperspace Industries said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhow long should it take to establish a colony\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor me the question shouldn\u0027t be \u0022how long\u0022 but \u0022how much\u0022 you\u0027ll have to do.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d like to see a seamless system going from a mere landed outpost for research, then a bit of light mining for fuel ores, then some more advanced mining operation and so on, with the transition to full colony requiring the set-up of multiple resource supply routes and operations and maybe even crew rotations (with support for crew in the automated supply run system) being a concern for non-colony outposts. \n\u003C/p\u003E\n\u003Cp\u003E\nIt would be fun to have a main colony on Mun that acts as an hub to receive and ship resources and crews between Kerbin, an orbital Shipyard and some surface outposts like a scientific polar base and 3 or 4 different mining outposts.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s better to drive between bases on Mun? A long rover drive or a short sub-orbital hop? Maybe ship the cargo by rover trucks and the crew by rocket? \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s better to mine Iron (random) in the 4%(random again) concentration of the future colony site or to build a mining outpost and use the 20% one 50km south of the colony? \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat I hope not to see is having colonies and infrastructure being easy to set-up only to have the game resorts again to abstract and grindy random contracts as a filler.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerb24","CreatedById":214340,"CreatedDateTime":"2021-09-30T00:05:15Z","Content":"\n\u003Cp\u003E\nIf you had to land that large of a colony module, no one would try to build a colony.\n\u003C/p\u003E\n"}]}