{"TopicId":206739,"ForumId":109,"TopicTitle":"Ksp2 purpose built controller","CreatedByName":"Moon river","CreatedById":219072,"CreatedDateTime":"2022-02-03T20:58:42Z","PageNum":1,"Articles":[{"CreatedByName":"Moon river","CreatedById":219072,"CreatedDateTime":"2022-02-03T20:58:42Z","Content":"\n\u003Cp\u003E\nHey everyone for the past couple days I’ve been thinking about ksp and ksp2 and I have played ksp  for a while and I always  wanted a control module that was specific for the game a control that allows for more accurate manipulation over the standard mouse and keyboard. So I have started working through the problems. I want to have precise throttle control as well as control over all three axis without having to adjust my hands to much. Also have dedicated buttons and switches for stage sep, navigation selection, engine start/stop, nav ball heading selection, and a stepped knob for time warp. I was also thing about either a small high res screen with its own nav ball or with a few info screen selection like fuel, Nav info, burn timer etc. But this is something I’ve had knocking around in my head. What are your guys thoughts on a specific controller for ksp?\n\u003C/p\u003E\n"},{"CreatedByName":"Thundy","CreatedById":208895,"CreatedDateTime":"2022-02-04T10:43:21Z","Content":"\n\u003Cp\u003E\nI\u0027ve been thinking about the same. These custom built controllers are called \u0022Button Boxes\u0022. Its super easy to build one if you know what you\u0027re doing, the screen part is hard.\u003Cbr\u003E\u003Cbr\u003E\nMost parts needed (switches, buttons, joysticks, LEDs) are available in many hardware stores, what you need is a part that interprets the inputs to something the computer understands through a USB port, that part is an Arduino or any Arduino-compatible board. Preferably you need something with a lot of inputs/outputs, depending on how many joysticks you want, you need something with a lot of Analog-to-digital converters\u003Cbr\u003E\nI recommend you look up stuff about this, the boards I\u0027m talking about are Arduino, Teensy, ESP. Note, not all Arduinos can work as a USB device.\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://www.hackster.io/news/beautifully-lasered-kerbal-space-program-controller-a58ad48498ea\u0022 rel=\u0022external nofollow\u0022\u003ESome people made some custom controllers for KSP before\u003C/a\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2022-02-04T17:49:44Z","Content":"\n\u003Cp\u003E\nThere\u0027s been a number of threads on the forums here about custom controllers.   There is/was a mod for interfacing KSP with an Arduino if that\u0027s your thing.   Sadly my bookmarked link was to a version of the forums that no longer works, so I have lost the bookmark.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2022-02-05T00:40:24Z","Content":"\n\u003Cp\u003E\nI think you\u0027ll get better mileage out of using flight sim parts. While buttons and switches are relatively straight forward, I doubt you\u0027ll make throttle and flight stick better than (or even comparable to, really) the good quality flight sim controllers. There are options you can get that are quite modular, will come with a lot of things you need, and if you really want it, you could even set up a physical navball from an attitude indicator. Plus it\u0027d all come with software already written, making most of the integration more straight forward.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, if you\u0027re just looking for a hardware project, and this is just an excuse to get it going, then more power to you. If you are going full DIY route, I would recommend using a Raspberry Pi for the core, because there is a wide selection of compatible display modules, and even Pi Zero will have adequate power to run a fancy display without breaking a sweat. Plus, it gives you a lot more flexibility in how you want to program it and how you want to manage communication with your PC.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, even if going full DIY, I would probably cannibalize a cheap flight stick and a throttle combo, build a custom box to house these along with all the custom buttons, switches, and screens, and connect them to a Pi Zero via USB. Building your own sticks with good precision completely from scratch is a pain.\n\u003C/p\u003E\n"},{"CreatedByName":"Moon river","CreatedById":219072,"CreatedDateTime":"2022-02-05T04:19:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224086416\u0022 data-ipsquote-contentid=\u0022206739\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221643971401\u0022 data-ipsquote-userid=\u0022208895\u0022 data-ipsquote-username=\u0022Thundy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Thundy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve been thinking about the same. These custom built controllers are called \u0022Button Boxes\u0022. Its super easy to build one if you know what you\u0027re doing, the screen part is hard.\u003Cbr\u003E\u003Cbr\u003E\nMost parts needed (switches, buttons, joysticks, LEDs) are available in many hardware stores, what you need is a part that interprets the inputs to something the computer understands through a USB port, that part is an Arduino or any Arduino-compatible board. Preferably you need something with a lot of inputs/outputs, depending on how many joysticks you want, you need something with a lot of Analog-to-digital converters\u003Cbr\u003E\nI recommend you look up stuff about this, the boards I\u0027m talking about are Arduino, Teensy, ESP. Note, not all Arduinos can work as a USB device.\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://www.hackster.io/news/beautifully-lasered-kerbal-space-program-controller-a58ad48498ea\u0022 rel=\u0022external nofollow\u0022\u003ESome people made some custom controllers for KSP before\u003C/a\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224086787\u0022 data-ipsquote-contentid=\u0022206739\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644021624\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think you\u0027ll get better mileage out of using flight sim parts. While buttons and switches are relatively straight forward, I doubt you\u0027ll make throttle and flight stick better than (or even comparable to, really) the good quality flight sim controllers. There are options you can get that are quite modular, will come with a lot of things you need, and if you really want it, you could even set up a physical navball from an attitude indicator. Plus it\u0027d all come with software already written, making most of the integration more straight forward.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, if you\u0027re just looking for a hardware project, and this is just an excuse to get it going, then more power to you. If you are going full DIY route, I would recommend using a Raspberry Pi for the core, because there is a wide selection of compatible display modules, and even Pi Zero will have adequate power to run a fancy display without breaking a sweat. Plus, it gives you a lot more flexibility in how you want to program it and how you want to manage communication with your PC.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, even if going full DIY, I would probably cannibalize a cheap flight stick and a throttle combo, build a custom box to house these along with all the custom buttons, switches, and screens, and connect them to a Pi Zero via USB. Building your own sticks with good precision completely from scratch is a pain.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan\u003EIf you have seen blade runner 2049 I’m thinking the primary hand controls will be similar to the memory modifier that the women uses in her bubble. I’m currently working on a drawing of it but I also plan to make a cardboard moc up. But it would be a small box roughly the size of a loaf of bread with two limited rotation knobs (4.5in diameter) on either side with 5 buttons on the box its self just in front of the knobs to prevent accidentally pressing one during course corrections. Now to adjust from pitch roll and yaw command a button would be mapped to change input. For the throttle it’s going to be just above the left hand with a pull and push tab mounted at 0 and 100% that way you can have precise control of throttle position with one had with out having to brace with the other hand or forearm. The board I’m thinking raspberry pi but it depends on how they set up the control interface on ksp2 if there isn’t a command sensitivity adjustment then this is and Exercise in futility. Hit me back with any thoughts.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2022-02-05T04:49:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224086842\u0022 data-ipsquote-contentid=\u0022206739\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644034769\u0022 data-ipsquote-userid=\u0022219072\u0022 data-ipsquote-username=\u0022Moon river\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, Moon river said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHit me back with any thoughts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, it\u0027s a challenge, like I said, and a lot of effort for a fairly niche result, but nothing here is not doable.\n\u003C/p\u003E\n\u003Cp\u003E\nRaspberry Pi can read analogue stick/dial/tab positions either digitally in small steps via encoders or as direct analogue via potentiometers. You can account for most differences in software and it\u0027s really more about what you can get better parts for. Buttons and switches are trivial, of course, as each version of Pi comes with plenty of digital IO pins. Alternatively, if you want a LOT of buttons/switches, you can look up how NES/SNES controllers used a shift register to very easily generate a serial interface. All of the buttons on these controllers were read with just 4 wires. Likewise, if you want to have a bunch of RGB LEDs, I strongly recommend using something like WS2811 drivers. You can even purchase them with LEDs already in the package, and you can string any number of them and control them from Pi using just one IO pin.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, I\u0027m sure the game will support controllers. So your best bet would be to simply use one of existing libraries for Pi to make your PC recognize it as a standard game controller. Which means you\u0027ll be able to send in any of your axis inputs as numbers in [-1, 1] range, plus any buttons as [0, 1] presses. If you do that, you can remap your analog sticks/dials/tabs inputs to that range in any way you want, including adding sensitivity curves, defining dead zones, changing these mappings dynamically, etc. Basically, once you get it into software, I don\u0027t foresee any serious problems.\n\u003C/p\u003E\n\u003Cp\u003E\nTo get some of the additional functionality, like if you want to have lights that change with game state, you\u0027ll probably have to write  a mod. That might be easier or harder depending on what sort of modding tools we get with the game, but technically speaking, it\u0027s a Unity game, so there are known ways to inject a custom DLL and it\u0027d just take some tinkering to find the data you need. So things like gear up/down lights, staging information, and possibly even data for artificial horizon if you want to add a display, should be possible to acquire.\n\u003C/p\u003E\n\u003Cp\u003E\nBut like I said, it\u0027s a project. Be prepared to sink a TON of time into it.\n\u003C/p\u003E\n"},{"CreatedByName":"Thundy","CreatedById":208895,"CreatedDateTime":"2022-02-05T09:32:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224086787\u0022 data-ipsquote-contentid=\u0022206739\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221644021624\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think you\u0027ll get better mileage out of using flight sim parts. ... There are options you can get that are quite modular, will come with a lot of things you need\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree with this.\n\u003C/p\u003E\n\u003Cp\u003E\nVKBSim is a good brand for this and their products are quite affordable. Their NXT series is quite modular and I believe it got everything anyone needs. I haven\u0027t bought their products yet to give my opinion on them, i\u0027m waiting for them to release their long awaited throttle, but looking around the internet they seem quite praised and they seem to be more reliable than the more expensive ones.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://vkbcontrollers.com/?product=gladiator-nxt-space-combat-edition\u0022 rel=\u0022external nofollow\u0022\u003EVKBSim Joystick\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://vkbcontrollers.com/?product_cat=gladiator-nxt-throttle-combos\u0022 rel=\u0022external nofollow\u0022\u003EVKBSim Module bundles\u003C/a\u003E, they\u0027re also sold one-by-one\n\u003C/p\u003E\n"}]}