{"TopicId":208696,"ForumId":109,"TopicTitle":"Should celestial bodies in KSP 2 have axial tilts?","CreatedByName":"intelliCom","CreatedById":209738,"CreatedDateTime":"2022-06-23T15:46:01Z","PageNum":5,"Articles":[{"CreatedByName":"dave1904","CreatedById":153882,"CreatedDateTime":"2022-07-13T21:04:03Z","Content":"\n\u003Cp\u003E\nI\u0027m not to bothered by the stock system having no tilt but I really don\u0027t get the argument that it somehow makes things alot harder. I would argue that its easier to understand axial tilt than it is to get to minmus. Its very easy to visualise compared to transfers. \n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2022-07-13T21:07:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154534\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657746243\u0022 data-ipsquote-userid=\u0022153882\u0022 data-ipsquote-username=\u0022dave1904\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, dave1904 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m not to bothered by the stock system having no tilt but I really don\u0027t get the argument that it somehow makes things alot harder. I would argue that its easier to understand axial tilt than it is to get to minmus. Its very easy to visualise compared to transfers. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow new are you to the game? \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2022-07-13T21:42:46Z","Content":"\n\u003Cp\u003E\nI like the idea of having axial tilts.  The list \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73725-superfluous-j/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273725\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73725-superfluous-j/\u0022 rel=\u0022\u0022\u003E@Superfluous J\u003C/a\u003E suggested sounds good to me.  Except I like having oxygen at Laythe.\n\u003C/p\u003E\n\u003Cp\u003E\nI disagree with the idea that new players will be frustrated with axial tilts.  The idea that only veteran players are smart enough to understand axial tilts and inclined orbits seems preposterous and a little conceited.  To me.  Plus, I don’t really want to play a space simulation game that was developed for the lowest common denominator.  I’d be insulted if someone assumed that since I’m new to the game, I’m not intelligent enough to understand axial tilts and inclined orbits.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2022-07-13T22:57:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154550\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657748566\u0022 data-ipsquote-userid=\u0022198538\u0022 data-ipsquote-username=\u002218Watt\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, 18Watt said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI’d be insulted if someone assumed that since I’m new to the game, I’m not intelligent enough to understand axial tilts and inclined orbits\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo you\u0027re saying that the majority of KSP players are not intelligent enough to land on the Mun?\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not intelligence, it\u0027s knowledge, and the sequel aims for people of all ages, even with no prior knowledge of spaceflight and physics behind it, if they\u0027re willing to learn. Small steps and all that.\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2022-07-13T23:45:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154571\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657753057\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 minutes ago, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo you\u0027re saying that the majority of KSP players are not intelligent enough to land on the Mun?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot at all.  I’m honestly not sure how you came to that conclusion from my post.\n\u003C/p\u003E\n\u003Cp\u003E\nBut to expand on your point- landing on Mun is difficult.  To avoid discouraging new players with the difficulty of landing on Mun the game could be redesigned to make Mun landings easy.  But that decreases realism and takes away from the fun of learning how to do things.  In my opinion.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I said (apparently not clearly enough) is that I disagree with the idea that the game needs to be overly simple and easy, to avoid frustrating new players.  I think it would be a mistake to assume that the game will have greater appeal to new players if the physics or physical characteristics were simpler.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP allows you to work hands-on with physics problems and orbital maneuvers.  I would be disappointed if the game designers just assumed I needed overly simple solar systems to stay engaged, that the concept of axial tilts or inclined orbits would be so far beyond my ability to comprehend that it wasn’t worth making the attempt to teach those concepts.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2022-07-14T00:00:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154531\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657744654\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is supposed to be the way new players are introduced to KSP?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154351\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657683048\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNote, I am not suggesting these as changes I think should be in the game. I list them as changes I think I will make, barring the game not allowing the changes to work.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-07-14T00:17:53Z","Content":"\n\u003Cp\u003E\nWhat I like about this thread is that the prescribed solutions are so varied and ill defined that we can vehemently agree and disagree simultaneously without realizing it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-14T00:29:24Z\u0022 title=\u002207/14/2022 12:29  AM\u0022 data-short=\u00222 yr\u0022\u003EJuly 14, 2022\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"t_v","CreatedById":213541,"CreatedDateTime":"2022-07-14T06:40:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154579\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657755939\u0022 data-ipsquote-userid=\u0022198538\u0022 data-ipsquote-username=\u002218Watt\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, 18Watt said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut to expand on your point- landing on Mun is difficult.  To avoid discouraging new players with the difficulty of landing on Mun the game could be redesigned to make Mun landings easy.  But that decreases realism and takes away from the fun of learning how to do things.  In my opinion.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe thing is, the game \u003Cem\u003Ewas\u003C/em\u003E designed to make landing on the Mun easy. Lots of things that make landing on the moon hard in real life were removed or simplified to allow more people to get to it. Things like n-body physics,  the problems of radiation and life support, and yes, even axial tilts. It doesn’t matter that these were development holes or technical limitations, the devs still made those simplifications into intentional design choices. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo better explain how adding axial tilt while navigating to the very first new body in the game is not good for learning, I’ll share an anecdote about my experience. I wanted to try out modded KSP and decided to start with realism. Principia, Kerbalism, \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E, but I kept the stock parts because why not. The underpowered parts were ok, I just had to make better rockets, but when trying to get to the Moon, I had to first learn how to deal with engine failure, how to add redundancy to everything, how to get the right inclination for a transfer (that part I already knew but if I was a new player…) how to circularize in the new, larger scale, and then how to deal with oxygen and food problems, which took me a few tries, and then how to navigate with n-body physics…\n\u003C/p\u003E\n\u003Cp\u003E\nThe point there is that all of those features add realism and most don’t necessarily make the game harder, they just require you to learn more before doing things. I found myself discouraged by the amount of trial and error learning I had to go through to even get to the moon, and I ended up switching mod packs shortly after my first landing. The more things someone has to learn per step they take into the universe, the more likely they will not take that step, and we already know that most people already find the Mun too daunting a step to do a landing. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is not to say that we shouldn’t have axial tilt in the game or even the Kerbol system. I’d honestly be fine with Duna getting a 30 degree (or less) tilt, it’s not like I depend on getting a perfectly equatorial landing site anyways. And the rest of the planets, tilt away! But between Kerbin and the Mun, there need to be only essential pieces of learning, like how to transfer between two bodies, or how to circularize an orbit. Tilt can be introduced later on, perhaps at Minmus, where you don’t need to learn all the lessons from the Mun because you know them, and you only need to learn about tilt and inclination. It’s like baristochrone trajectories; I want them in the game, just like axial tilt, I just don’t think that they should be introduced when first going to the Mun. Just like tilt, it is not that people can’t understand it, it is that it is a complication that can distract from the more essential lessons being taught by that celestial body. \n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2022-07-14T07:32:10Z","Content":"\n\u003Cp\u003E\nMy guess is that when KSP2 is released Kerbin, Mun, and Minmus will look very similar to KSP1, with no axial tilt on Kerbin, and Mun’s orbit having little or no inclination.  Which is fine.\n\u003C/p\u003E\n\u003Cp\u003E\nI appreciated the addition of extra launch sites in KSP1 because using the one up around 45N added a challenge similar to what you would deal with if you had axial tilt- every launch is going to have an inclined orbit.  But you can always go back and use the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E facility if you don’t want to deal with that.\n\u003C/p\u003E\n\u003Cp\u003E\nI have been led to believe that KSP2 will include additional solar systems, and maybe the ability to build bases and launch facilities on other CBs?  If that is the case, I think adding some tilt to those extra CBs would add to the game.  I personally sometimes get bored having every launch be nearly identical.  Launch, angle to 90 degrees, repeat.  It sometimes feels repetitive, maybe even grindy.  Maybe I’ve played the game too much.\n\u003C/p\u003E\n\u003Cp\u003E\nOne advantage with Kerbin’s non-tilted orientation is that you don’t have to wait for launch windows to go to Mun or Minmus.  For Mun you can launch any time you want, and if you’re going to Minmus there are two launch windows per day.  Actually Minmus’s inclination is so small (I think about 7 degrees?) that you can also launch for Minmus pretty much any time, and don’t lose much efficiency.  That does make it easy to continually practice maneuvering to those CBs, without always having to wait for a decent launch window.  It does get repetitive though.\n\u003C/p\u003E\n"},{"CreatedByName":"intelliCom","CreatedById":209738,"CreatedDateTime":"2022-07-14T08:53:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154469\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657730575\u0022 data-ipsquote-userid=\u0022216853\u0022 data-ipsquote-username=\u0022sciencecompliance\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, sciencecompliance said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI get that you\u0027re talking about the game\u0027s coordinate system and the fact that all the planets\u0027 poles point in the same direction, but, if you weren\u0027t aware, axial tilt in real astronomy is based on the angle of a body\u0027s axis relative to its own orbit around whatever body it\u0027s orbiting.  I only say this because if the \u0022axial tilt matches the orbital inclination\u0022, then that body actually has zero axial tilt (also known as obliquity) in real astronomical terms.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGotcha. I meant to say \u0022If the body has no axial tilt\u0022. If you make your ship\u0027s inclination the same as a celestial body\u0027s, such a celestial body would be really easy to land on if there\u0027s no axial tilt. In KSP1, Minmus is in a case where if you get your inclination to match, your rotation ends up skewed relative to its axial tilt. What I propose is cutting off Minmus\u0027 axial tilt entirely so it\u0027s easier to land on in KSP 2.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-14T14:47:40Z","Content":"\n\u003Cp\u003E\nI think it\u0027s easy to forget how hard the game is for the average person.  I\u0027m a space enthusiast, so was highly motivated to learn the game, but I never had anything close to the maths experience throughout college or beyond to just \u0027get\u0027 a lot of the stuff people who are good at KSP seemingly take for granted. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154660\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657780832\u0022 data-ipsquote-userid=\u0022213541\u0022 data-ipsquote-username=\u0022t_v\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, t_v said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut between Kerbin and the Mun, there need to be only essential pieces of learning, like how to transfer between two bodies, or how to circularize an orbit. Tilt can be introduced later on, perhaps at Minmus, where you don’t need to learn all the lessons from the Mun because you know them, and you only need to learn about tilt and inclination\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI remember my first Mun landing attempts.  The stress is on the pluralization of \u0027attempts\u0027 because thanks to the save feature I tried and failed repeatedly with my first ship, then built a different one - which again I tried and failed to land repeatedly... Before going to the internet and finding a suggestion that new players should almost skip the Mun and go straight to Minmus to learn how to land b/c it is easier.  This turned out to be true.  Several landings at Minmus later and I finally figured out the Mun landing... \u003Cstrong\u003EAnd felt an enormous sense of accomplishment. \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#2980b9;\u0022\u003E\u003Cstrong\u003EI think this is the often overlooked power of KSP - and what I hope is most retained by KSP2\u003C/strong\u003E - that sense of Jesus Christ this is \u003Cem\u003Ehard\u003C/em\u003E, but Holy$ I DID IT! \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#2980b9;\u0022\u003EThat is something few games ever offer a person. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo I do appreciate everyone who says \u0027please don\u0027t dumb KSP2 down so much that it\u0027s not fun!\u0027. You guys are absolutely right - the game should be hard... And if it isn\u0027t, they\u0027ll have failed the core audience. \n\u003C/p\u003E\n\u003Cp\u003E\nBut on point - Kerbin and moons should be virtually identical in 2 as KSP.  Players like me and the new need a relatively simple playground to figure stuff out (and \u0027cannon\u0027 - big changes would be too noticeable).\n\u003C/p\u003E\n\u003Cp\u003E\nLater Kerbol system planets?  I think that statistically so few players ever got out there that cannon isn\u0027t really an issue.  Some subtle changes to give veterans a bit more challenge or that comport more with reality would be fine. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-14T17:14:37Z\u0022 title=\u002207/14/2022 05:14  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 14, 2022\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-07-14T16:53:51Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154477-joeschmuckatelli/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154477\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154477-joeschmuckatelli/\u0022 rel=\u0022\u0022\u003E@JoeSchmuckatelli\u003C/a\u003E Just a question to gauge newish players experience: how difficult do you find it to land precisely? Say within 1km of a target or vessel on the surface? \n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-14T17:12:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154795\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657817631\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154477-joeschmuckatelli/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154477\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154477-joeschmuckatelli/\u0022 rel=\u0022\u0022\u003E@JoeSchmuckatelli\u003C/a\u003E Just a question to gauge newish players experience: how difficult do you find it to land precisely? Say within 1km of a target or vessel on the surface? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcellent question - and \u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cu\u003E\u003Cem\u003E\u003Cstrong\u003EVERY\u003C/strong\u003E\u003C/em\u003E\u003C/u\u003E\u003C/span\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI have (after a LOT of failure) been able to land ships and probes within a very painful \u0027driving distance\u0027 of one another.  There was a time I remember, early on, when you could warp with a wheeled vehicle (which wasn\u0027t that bad), and then IIRC they took that away.  So I had to try \u003Cem\u003Ereally \u003C/em\u003E hard to get my crafts closer.  My biggest threat to this is fuel, because I rarely get \u0027good\u0027 inserts.  Sometimes I\u0027m smart / intuitive enough to figure out how to wait out a warp so that a highly inclined orbit will allow me to time a landing with a previous mission (thus conserving fuel), and others I change inclination so that I can suicide burn with a lot more margin.  But if its the first - I either hit it or it\u0027s a complete waste of effort.\n\u003C/p\u003E\n\u003Cp\u003E\nThe idea that I could build a \u003Cu\u003Eplatform \u003C/u\u003Eon Mun and land on it?  Woah, Nelly - that\u0027s gonna take some helaciously good video tutorials to accomplish!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-14T17:13:49Z\u0022 title=\u002207/14/2022 05:13  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 14, 2022\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-07-14T17:42:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154801\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657818777\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe idea that I could build a \u003Cu\u003Eplatform \u003C/u\u003Eon Mun and land on it?  Woah, Nelly - that\u0027s gonna take some helaciously good video tutorials to accomplish!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is kind of why I asked, because though minor axial tilts don\u0027t change much they are going to come with a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E cost that players will want to account for, especially if they\u0027re, say, trying to land very near a colony they\u0027re building far from the equator. \u003Cbr\u003E\u003Cbr\u003E\nI suspect there will be some kind of recoverable range for this near an established colony to make things more forgiving for new players, but as you point out even a 5km radius can be a challenge for a lot of folks. \n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-14T18:11:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154804\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657820559\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ncome with a \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E cost that players will want to account for\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne of the reasons I\u0027ve been agitating for a good, in-game Kerbilopedia (which - I acknowledge - is unlikely to be a feature), is that I make \u0027stupid\u0027 mistakes quite frequently.  This is mainly because I play until I get frustrated - take months (or years) off - pick it back up again... then repeat.\n\u003C/p\u003E\n\u003Cp\u003E\nCase in point: In my most recent playthrough, I completely forgot that orbital inclination changes are best done at high altitude.  I was attempting to set up a complicated Science and \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E site - with a rover that could transport fuel between the miner and landers, plus a bunch of other things like placeable science array, a science hab (can\u0027t remember name), etc.  This took several landings - and I repeatedly went this route:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n1. Design complicated thing to do/bring what I want at/to the surface\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n2. Overbuild massive ship to get up to orbit with enough fuel to get 1. to its destination.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n3. Burn hard and rough and accept whatever encounter I could tweak an orbit to\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n4. Get an orbit, dump PE down to the altitude I wanted to start trying to land from\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n5. SAVE\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n6. Drop AP down... and\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:80px;\u0022\u003E\n6a. aw heck maybe just go for landing (presumes I think I can hit my spot) - or -\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:80px;\u0022\u003E\n6b. circularize then try to move inclination to where I think I can line up a landing.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n7. Keep trying until I get a fairly close landing\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNotice: I totally failed to try to correct my 500km initial orbit inclination when I had the chance.  Literally never occurred to me - I had forgotten what I\u0027d learned waaaay back when.\n\u003C/p\u003E\n\u003Cp\u003E\nUltimately, however, what drove me to quit was that once I had all my things landed and in place... every time I\u0027d load in to the area - something would be floating or have no gravity so that just my Kerbal bumping it could send it skittering away.  The game had glitched and all that work was for naught.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-07-14T18:42:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154809\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657822300\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n44 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne of the reasons I\u0027ve been agitating for a good, in-game Kerbilopedia (which - I acknowledge - is unlikely to be a feature), is that I make \u0027stupid\u0027 mistakes quite frequently.  This is mainly because I play until I get frustrated - take months (or years) off - pick it back up again... then repeat.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou might be in luck. I think there\u0027s a good chance this is some kind of flight planner that will help players come up with \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E estimates rather than relying on \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E maps and guesswork. \u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022vwfuVPS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002263.33\u0022 height=\u0022259\u0022 width=\u0022409\u0022 src=\u0022https://i.imgur.com/vwfuVPS.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe rest is a sad story. I actually went all the way back to a save in KSP 1.3 recently because that build seems pretty stable. Without getting too OT the best thing is to basically always do a correction burn or two, one when you\u0027re half-way to the moon and another just after you enter its \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E. When you do the mid-way correction focus the camera on the moon and then make small adjustments to the maneuver so that your trajectory arcs over the moon\u0027s surface at roughly your target latitude with a PE of 50km or so. Tweak again when you hit \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E and then make a circularization burn at the PE. That should get you a really cheap approximation of the inclination you need. Remember the moon is rotating underneath you, so you can just wait until your target aligns with your orbit. When it gets close set it as your target and burn at the An or Dn and push your inclination until the dotted line is right over the target. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-14T18:59:07Z\u0022 title=\u002207/14/2022 06:59  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 14, 2022\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-14T18:49:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154817\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657824174\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWithout getting too OT the best thing to do is basically always do a correction burn or two, one when you\u0027re half-way to the moon and another just after you enter its \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E. When you do the mid-way correction focus the camera on the moon and then make small adjustments to the maneuver so that your trajectory arcs over the moon\u0027s surface at roughly your target latitude with a PE of 50km or so. Tweak again when you hit \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E and then make a circularization burn at the PE. That should get you a really cheap approximation of the inclination you need. Remember the moon is rotating underneath you, so you can just wait until your target aligns with your orbit. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s this kind of thing that us new/dense players often miss.  At Kerbin, I set up my encounter by tweaking maneuver nodes, then do the burn - and as long as I still have an encounter, warp to just before entering the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E\u003C/abbr\u003E of target moon.  Never dawned on me to do \u003Cem\u003Eanything \u003C/em\u003Emid-flight!\n\u003C/p\u003E\n\u003Cp\u003E\nWell - except see if I could get points for a spacewalk, crew report or science...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT - to STAY OT... I just remembered something from my first attempt (oh so long ago) at getting a probe around another planet (don\u0027t remember which one).  There was someone who recommended I try to correct my insertion from half-way there.  I recall doing that, and was kind of amazed at how \u0027tweaky\u0027 it was.  Little movements sent me all over the system (I\u0027m pretty sure it had multiple moons).  At the time, I did not know how to do anything without \u0027pulling\u0027 the nodes - so trying for fine corrections required a bunch of times of me deleting the planned node and starting over.  Eventually I got a good encounter.  This was back when I refused to look at the planets or any videos about them - because I wanted the surprise of discovery.  Totally worth it, btw.  I was super excited to see another planet up close.\n\u003C/p\u003E\n\u003Cp\u003E\nThe question is; when KSP2 comes out, if there are not only inclined planetary orbits - but the planets have an inclination themselves - meaning that their moonar systems have an inclination that differs from their orbital planes... do you get an equatorial orbit between planets - or only after you capture?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-14T19:01:32Z\u0022 title=\u002207/14/2022 07:01  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 14, 2022\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-14T19:01:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154817\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657824174\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWithout getting too OT\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nplease see edit above\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-07-14T19:42:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154821\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657824547\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe question is; when KSP2 comes out, if there are not only inclined planetary orbits - but the planets have an inclination themselves - meaning that their moonar systems have an inclination that differs from their orbital planes... do you get an equatorial orbit between planets - or only after you capture?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027ll depend on what your target landing point/flight plan is. Say everything is tilted--axial tilt on planet and moon and the moon has an inclined orbit. If you\u0027 want to land on the moon first you can ignore the planet\u0027s tilt and align as best you can with the \u003Cem\u003Eorbital\u003C/em\u003E inclination of the moon as you enter the system. Now, depending on which way the moon is tilted there are going to be two points along its orbit that will be easiest to deal with--its equinoxes--when the moon\u0027s tilt is parallel to its orbital path rather than perpendicular. Make a maneuver at \u003Cabbr title=\u0022Periapsis\u0022\u003E\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E\u003C/abbr\u003E lowish over the parent planet so that you encounter the moon near one of those equinoxes, and then during that mid-course correction make sure you\u0027re coming in over the moon\u0027s equator if thats where you\u0027re trying to land, or at the target latitude as above^.\u003Cbr\u003E\u003Cbr\u003E\nThen! Say you want to leave that moon and land on the planet. At this point the planet\u0027s inclination around its star doesn\u0027t really matter--all that matters is the difference between the moon\u0027s orbit and the planet\u0027s equator. Wait to leave until the moon lines up with the planet\u0027s equator and take off so that your moonar orbit is as parallel to the planet\u0027s equator as possible. It\u0027s okay if its not perfect. When you\u0027re dropping back down to planetary orbit you can get much closer to an equatorial orbit, or an orbit matching your target latitude if you\u0027re landing somewhere north or south. \u003Cbr\u003E\u003Cbr\u003E\nThats my intuition anyway....\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-14T20:00:06Z\u0022 title=\u002207/14/2022 08:00  PM\u0022 data-short=\u00221 yr\u0022\u003EJuly 14, 2022\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-14T19:45:59Z","Content":"\n\u003Cp\u003E\nTwo paragraphs and suddenly \u003Cem\u003Eso much more\u003C/em\u003E makes sense!\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-07-14T21:12:04Z","Content":"\n\u003Cp\u003E\nNP! And agreed this stuff is not immediately intuitive, it takes a long time before you get a kind if instinctual feel for what to do when things get weird (I still might be wrong above^). Something like the mid-course correction; its not physics that dictates that, in fact I think its almost always cheapest to burn as early as possible or get it perfect on your transfer burn, but mid-way is a nice balance between really cheap adjustments that aren\u0027t super twitchy to manipulate. Most of the time it\u0027s just tapping the \u003Cabbr title=\u0022Reaction Control System\u0022\u003Ercs\u003C/abbr\u003E. \n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2022-07-15T09:23:57Z","Content":"\n\u003Cp\u003E\nI highly recommend getting Universe Sandbox and playing with orbital parameters there. Set up a planet, moon, change inclination and tilt for both and look how they behave. Or better yet, although tricky, place a small object on a trajectory from the moon to parent body (or vice versa) and see where it goes.\n\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2022-07-17T06:00:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224154351\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657683048\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/13/2022 at 1:30 PM, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI found the list I had made years ago regarding KSP2 tilt changes I\u0027m going to make.\n\u003C/p\u003E\n\u003Cp\u003E\nNote, I am not suggesting these as changes I think should be in the game. I list them as changes I think I will make, barring the game not allowing the changes to work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMoho\u003C/strong\u003E: Axis tilt to match its orbit. Rotation so it rotates 3 times per 2 orbits, like Mercury.\u003Cbr\u003E\u003Cstrong\u003EEve\u003C/strong\u003E: Axis flipped so it rotates backwards, like Venus.\u003Cbr\u003E\u003Cstrong\u003E    Gilly\u003C/strong\u003E: Axis tilted to match its orbit around Eve. Rotation so it rotates in some fraction of its orbit, like Moho.\u003Cbr\u003E\u003Cstrong\u003EKerbin\u003C/strong\u003E: Axis tilted 23 degrees, like Earth.\u003Cbr\u003E\n    \u003Cstrong\u003EMun\u003C/strong\u003E: Axis and orbit tilted 6 degrees from Sun, like Minmus is now. No real reason, just wanted it not in Kerbin or Sun\u0027s line.\u003Cbr\u003E\n    \u003Cstrong\u003EMinmus\u003C/strong\u003E: Axis tilted 23 degrees from Kerbin, or 0 degrees from Sun. To make interplanetary from Minmus easier (Hey it doesn\u0027t have to be ALL harder)\u003Cbr\u003E\u003Cstrong\u003EDuna\u003C/strong\u003E: Axis tilted 25 degrees, like Mars. Rotation still locked to Ike.\u003Cbr\u003E\n    \u003Cstrong\u003EIke\u003C/strong\u003E: Orbit and tilt to match Duna\u0027s axial tilt. Rotation still locked to its orbit.\u003Cbr\u003E\n    \u003Cem\u003EDuna/Ike Alternate: Make Ike a bit bigger and make Duna/Ike a true dual world, depending on how (and if) KSP2 handles that.\u003C/em\u003E\u003Cbr\u003E\u003Cstrong\u003EDres\u003C/strong\u003E: Axis tilt to match its orbit. Maybe add a thin ring if it\u0027s easy.\u003Cbr\u003E\u003Cstrong\u003EJool\u003C/strong\u003E: No change.\u003Cbr\u003E\n    \u003Cstrong\u003ELaythe\u003C/strong\u003E: Remove oxygen from the atmosphere (sorry but it makes no sense even in this silly universe)\u003Cbr\u003E\n    \u003Cstrong\u003EVall\u003C/strong\u003E: See Eeloo.\u003Cbr\u003E\n    \u003Cstrong\u003ETylo\u003C/strong\u003E: No change.\u003Cbr\u003E\n    \u003Cstrong\u003EPol\u003C/strong\u003E: Orbits Tylo in some way. I\u0027ve always wanted a moon to have a moon.\u003Cbr\u003E\n    \u003Cstrong\u003EBop\u003C/strong\u003E: Axial tilt to match its orbit.\u003Cbr\u003E\u003Cstrong\u003EEeloo\u003C/strong\u003E: Axial tilt to match its orbit.\u003Cbr\u003E\n    \u003Cstrong\u003EVall\u003C/strong\u003E: Orbits Eeloo. Eeloo needs a Charon!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA long time ago in a forum far ....\n\u003C/p\u003E\n\u003Cp\u003E\nThere was a workshopped plan if axial tilt was a game improvement and this is pretty close to recall as to how it looked.\n\u003C/p\u003E\n\u003Cp\u003E\nOnly exception was Kerbin and the Mun were matched so in terms of player progression you still had a straight shot from equatorial orbit to an body. That makes minus the first body you need to learn plane changes for. Having Mimus on the solar plane make a great incentive to build a colony there, Fuelbase or shipyard. Then you can go further afield by diving back to Kerbin. \n\u003C/p\u003E\n\u003Cp\u003E\nAxial tilt could slow the game progression down a bit as it would be worth waiting for ideal launch times. No more first rocket at sunrise launch for Mun by sunset.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-07-17T14:17:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224155000\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657877037\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/15/2022 at 5:23 AM, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI highly recommend getting Universe Sandbox and playing with orbital parameters there. Set up a planet, moon, change inclination and tilt for both and look how they behave. Or better yet, although tricky, place a small object on a trajectory from the moon to parent body (or vice versa) and see where it goes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOkay - I\u0027ve been doing this for a day now.  Thanks for the suggestion! \n\u003C/p\u003E\n\u003Cp\u003E\nThing I\u0027m learning is how bloody difficult it is to get planets to merge!  Seriously, watching how stuff behaves in this game is fascinating.  Sometimes it does what you intuitively figured it would - and sometimes does something crazy (and then when you figure it out... Makes sense) \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2022-07-25T11:42:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224153600\u0022 data-ipsquote-contentid=\u0022208696\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221657483900\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/10/2022 at 10:11 PM, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI just don\u0027t think us vets should be speaking for new players when we\u0027ve forgotten what it\u0027s like to be new.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s like saying that we shouldn\u0027t say that making the atmosphere of Duna thinner won\u0027t affect new players getting to low kerbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nThe atmospheric thickness of Duna literally has no effect on getting to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E from the surface of Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nAtmospheric tilt literally has no effect on getting to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E from the surface of Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nPlayer experience does not change this\n\u003C/p\u003E\n"}]}