{"TopicId":210304,"ForumId":109,"TopicTitle":"How do we think Communications will be handled?","CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-10-27T04:37:20Z","PageNum":1,"Articles":[{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-10-27T04:37:20Z","Content":"\n\u003Cp\u003E\nMy guess is that communications will be handled one of two ways:\n\u003C/p\u003E\n\u003Cp\u003E\nA) Communications will be split into 2 categories: Probe control and transmissions. No one wants to play KSP with communication delay, but at the same time, it would be nice to introduce it since KSP 2 wants to teach kids, and even adults, about space travel. And communication is a key part of that. So, I think they will implement a two-pronged system.\u003Cbr\u003E\n-Probe control: Sending commands to a probe and waiting for it to react to them would be no fun, so probe control will remain instant.\u003Cbr\u003E\n-Transmissions: They will implement delay for this, mainly in the terms of science transmission. If you\u0027re far from Kerbin, you will beam the science report to Kerbin, but you won\u0027t receive science or data from it until it reaches Kerbin. So, like Kerbin to Duna, let\u0027s say the journey for a transmission is 5 to 20 minutes (Like IRL Earth and Mars). You will have to wait for the science report to reach Kerbin from Duna. Of course, this is barring any colony. With colonies, you will just beam the transmission to the colony or Kerbin, whichever happens to be faster/closer.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, there will be difficulty sliders to change this. Don\u0027t want to wait? Bam, instant transmission. Want more difficulty? Turn on line of sight transmission, like in KSP 1. \n\u003C/p\u003E\n\u003Cp\u003E\nB) Everything is instant, just like KSP 1. \n\u003C/p\u003E\n\u003Cp\u003E\nI imagine that they will do it the route of A, just to teach since they want KSP 2 to be a teaching game as well as a simulation game. Of course, I imagine if they don\u0027t, someone will come up with a mod to introduce communication delay. \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2022-10-27T04:43:33Z","Content":"\n\u003Cp\u003E\nI think educational games goes like the training montage of Kung Fu Panda, when Devs concentrate on making a good educational game, they always fail.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only good educational games are accidentally so.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m all in favour of transmission delay for data (not control!) but only if it\u0027s part of a gameplay system or gameplay loop.\n\u003C/p\u003E\n\u003Cp\u003E\nRealism for the sake of realism or educational content will onlyake the game worse at being a game.\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2022-10-28T19:57:11Z","Content":"\n\u003Cp\u003E\nAgreed, that\u0027s the same problem Life Support has. What purpose is there to the added realism? What perceived benefit?\n\u003C/p\u003E\n\u003Cp\u003E\nWe don\u0027t need an \u0022enforced iron-man\u0022 game mode, as the default game mode, that\u0027s what I\u0027m trying to say.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd as much as it\u0027s a minor step, putting communication delay of ANY sort into KSP 2 would in fact be a step towards that.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s an option that\u0027s default off, and if that\u0027s the case you can bet every cent you have that 90% of players won\u0027t touch that option, why even code it in the first place, especially when you have to hold it to such a high standard as the rest of the game?\n\u003C/p\u003E\n\u003Cp\u003E\nSame with life support, aside from being \u0022realistic\u0022 what benefit do you gain from preventing the player from sending someone on an interstellar voyage on an external command seat? Not really any benefit that I see, aside from a \u0022you must play my personal own way not your way\u0022 kind of message, that I don\u0027t think KSP 2 is trying to send.\u003Cbr\u003E\nKSP 2 is trying to tell you to work with the laws of physics, it\u0027s not trying to enforce a standardized interstellar vessel design guide, you know? Each player has to come up with their own standards, (or not!) it\u0027s totally up to them.\n\u003C/p\u003E\n\u003Cp\u003E\nPart of KSP 1\u0027s charm is in fact the fact that you CAN do these very \u0022unrealistic\u0022 things that a life support system (or communications delay) would prevent.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if it\u0027s only the science transmission that gets delayed, then why would the player not just time warp thru the delay, introducing a waste of time that doesn\u0027t actually gain the player anything that they wouldn\u0027t have if the transmission completed instantly?\n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps an analogy is in order:\u003Cbr\u003E\nNobody likes having to wait to play with their new toys, right?\u003Cbr\u003E\nSome of you reading this might know that feeling of being told you can\u0027t unwrap your winter holiday presents until after the winter holiday dinner.\u003Cbr\u003E\nI know that as a kid if I was told to do that, and I was physically prevented from unwrapping my presents, I\u0027d throw the mother of all temper tantrums.\u003Cbr\u003E\nEven today, if I was told to wait and I saw other people unwrapping presents, I\u0027d start unwrapping my presents, and I wouldn\u0027t have a care as to what words my parents said to me regarding \u0022don\u0027t do that yet\u0022.\u003Cbr\u003E\nThis isn\u0027t because I\u0027m an entitled brat.\u003Cbr\u003E\nThis is because to a kid, the word \u0022wait\u0022 means the same as the word \u0022no\u0022, and I know my little kid brain would have been thinking \u0022my parents always say no to my fun ideas, so I\u0027m just going to skip the step where I ask and do what I want anyways\u0022, despite me now with my adult brain having a good understanding of why they won\u0027t for instance \u0022let me play with matches\u0022 or \u0022eat the tide pods\u0022 or \u0022play with dad\u0027s gun\u0022 or something else that when I was a kid I thought might be fun, but my parents back then knew that those activities would actually either harm me or destroy things that are valuable to either myself or my parents, so they were forced to say \u0022no\u0022 to a lot of things because kids are not logical thinkers.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, let\u0027s say now you\u0027re playing KSP 2, and you\u0027ve just finished a big mission to a distant planet, and you want to send the results home to unlock more parts to use on the next mission to another planet.\u003Cbr\u003E\n\u0022.... What do you mean I have to wait for the message to get here?\u0022\u003Cbr\u003E\n(inner kid comes out)\u003Cbr\u003E\n\u0022I wanna play with my new toys!\u0022\u003Cbr\u003E\n\u0022This game sucks!\u0022\u003Cbr\u003E\n\u0022I want a refund!\u0022\u003Cbr\u003E\n\u0022Who cares that science says that signals travel at the speed of light, I read somewhere that the Kerbol solar system is 10x smaller than the IRL solar system, so the speed of light delay should be 10x lower, right?\u0022\u003Cbr\u003E\n.... \u0022Are you kidding me, they ALSO lowered the speed of light by 10x? That just breaks MORE laws of physics!\u0022\u003Cbr\u003E\n\u0022This whole game is full of arbitrary and unrealistic design decisions that just force me to waste the limited time I have available to play it!\u0022\u003Cbr\u003E\n\u0022I\u0027m never playing this again and I\u0027m telling all my friends that we\u0027ll just go play some other (less realistic) space game instead, or who knows, we might just play Minecraft or Fortnite anyways because it was already incredibly hard to convince my friends to even look at this game because they saw it and all they saw was a bunch of \u0027math homework\u0027\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nPoint is, raising kids is hard (which is why I\u0027m never having them), and video games make terrible parents\n\u003C/p\u003E\n\u003Cp\u003E\nSo don\u0027t make players wait to use the science data they just transmitted from the mission they spent so much effort piloting, which just wastes their precious (irl) play time.\n\u003C/p\u003E\n\u003Cp\u003E\nAs much as time warp helps, it still takes a few real-life seconds to warp 5-20 minutes in-game. And that only gets worse with increasing signal delay.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is one of the things KSP got right the first time, and it shouldn\u0027t mess with it. Because if they DO mess with it, you just know that there\u0027s VERY quickly going to be a mod released that removes that gameplay mechanic entirely, and it\u0027s gonna be VERY popular.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I guess that puts me firmly in the camp of \u0022option B: No delay for anything\u0022 being the option that will most likely be put into the game.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is very much something that should be left to the modders.\n\u003C/p\u003E\n\u003Cp\u003E\nOn a side note, there\u0027s only one way to include CONTROL signal delay. And that\u0027s if you have the rule that \u0022presence of a crew removes signal delay entirely, and probe cores can have sequences of commands uploaded to them to allow for them to complete things despite the signal delay\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s basically how Remotetech (of it\u0027s various versions) worked, it\u0027s how you have to play \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E-\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1, and to be honest it\u0027s not that bad.\u003Cbr\u003E\nBut it requires something else to be coded, and that kinda kills the whole idea. It requires the includsion of a full-featured autopilot, similar to (and likely superior to) MechJeb. Otherwise, you\u0027re pretty much left fumbling in the dark, fighting against game mechanics that bring far more tedium and pain than they bring joy and fulfillment.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-10-28T20:02:33Z\u0022 title=\u002210/28/2022 08:02  PM\u0022 data-short=\u00221 yr\u0022\u003EOctober 28, 2022\u003C/time\u003E by SciMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2022-10-28T20:03:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n-Transmissions: They will implement delay for this, mainly in the terms of science transmission. If you\u0027re far from Kerbin, you will beam the science report to Kerbin, but you won\u0027t receive science or data from it until it reaches Kerbin. So, like Kerbin to Duna, let\u0027s say the journey for a transmission is 5 to 20 minutes (Like IRL Earth and Mars). You will have to wait for the science report to reach Kerbin from Duna. Of course, this is barring any colony. With colonies, you will just beam the transmission to the colony or Kerbin, whichever happens to be faster/closer.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTime warp -\u0026gt; How does this actually affect my game?\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2022-10-28T20:05:58Z","Content":"\n\u003Cp\u003E\nIt makes the player click more buttons, and use a few more seconds or minutes, for no added benefit (IMO).\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2022-10-28T21:27:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192317\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666987031\u0022 data-ipsquote-userid=\u002212748\u0022 data-ipsquote-username=\u0022SciMan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n59 minutes ago, SciMan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAgreed, that\u0027s the same problem Life Support has. What purpose is there to the added realism? What perceived benefit?\n\u003C/p\u003E\n\u003Cp\u003E\nWe don\u0027t need an \u0022enforced iron-man\u0022 game mode, as the default game mode, that\u0027s what I\u0027m trying to say.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd as much as it\u0027s a minor step, putting communication delay of ANY sort into KSP 2 would in fact be a step towards that.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s an option that\u0027s default off, and if that\u0027s the case you can bet every cent you have that 90% of players won\u0027t touch that option, why even code it in the first place, especially when you have to hold it to such a high standard as the rest of the game?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe same reasoning can be applied to orbital mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192317\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666987031\u0022 data-ipsquote-userid=\u002212748\u0022 data-ipsquote-username=\u0022SciMan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SciMan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNot really any benefit that I see, aside from a \u0022you must play my personal own way not your way\u0022 kind of message, that I don\u0027t think KSP 2 is trying to send.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a message you automatically send the moment you write the very first line of your very first game.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s basically the definition of a game developer.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192317\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666987031\u0022 data-ipsquote-userid=\u002212748\u0022 data-ipsquote-username=\u0022SciMan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SciMan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd if it\u0027s only the science transmission that gets delayed, then why would the player not just time warp thru the delay, introducing a waste of time that doesn\u0027t actually gain the player anything that they wouldn\u0027t have if the transmission completed instantly?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor the same reason people usually don\u0027t timewarp through research in literally every strategy and city builder out there. There\u0027s gameplay happening between you and the end of the waiting time.\n\u003C/p\u003E\n\u003Cp\u003E\nGames have had timewarp and time-delayed gameplay ever since Transporter Tycoon was released in \u002794 (probably even earlier).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for the rest of it was for your line of reasoning KSP2 would just be a PNG with \u0022YOU WIN!\u0022 Written in a bold, reassuring font.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-10-29T04:03:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224191499\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666845440\u0022 data-ipsquote-userid=\u002277770\u0022 data-ipsquote-username=\u0022GoldForest\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/27/2022 at 12:37 AM, GoldForest said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n-Transmissions: They will implement delay for this, mainly in the terms of science transmission. If you\u0027re far from Kerbin, you will beam the science report to Kerbin, but you won\u0027t receive science or data from it until it reaches Kerbin. So, like Kerbin to Duna, let\u0027s say the journey for a transmission is 5 to 20 minutes (Like IRL Earth and Mars). You will have to wait for the science report to reach Kerbin from Duna. Of course, this is barring any colony. With colonies, you will just beam the transmission to the colony or Kerbin, whichever happens to be faster/closer.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis has been brought up before and I don’t personally see any reason for it to be. At some point when science arrives (somewhere?) you want exactly one screen in which you unlock new parts. You don’t want to unlock new parts at one colony and then wait for the speed of light to unlock that part again somewhere else. Its a recipe for confusion and wasted time with no real benefit. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere are definitely interesting questions about transmission: when you can transmit, how much energy it costs, whether you can transmit slowly and partially, but the speed of light questions are better left to mods. \n\u003C/p\u003E\n"},{"CreatedByName":"mcwaffles2003","CreatedById":180102,"CreatedDateTime":"2022-10-30T01:28:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224191502\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666845813\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/27/2022 at 12:43 AM, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe only good educational games are accidentally so.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJumpstart went pretty hard in the 90\u0027s for me, just sayin \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022150\u0022 src=\u0022https://www.youtube-nocookie.com/embed/Upx8ZCALzR4?feature=oembed\u0022 title=\u0022JumpStart 4th Grade - Intro\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2022-11-01T20:36:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192361\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666992430\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/28/2022 at 5:27 PM, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe same reasoning can be applied to orbital mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s a message you automatically send the moment you write the very first line of your very first game.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s basically the definition of a game developer.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFor the same reason people usually don\u0027t timewarp through research in literally every strategy and city builder out there. There\u0027s gameplay happening between you and the end of the waiting time.\n\u003C/p\u003E\n\u003Cp\u003E\nGames have had timewarp and time-delayed gameplay ever since Transporter Tycoon was released in \u002794 (probably even earlier).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for the rest of it was for your line of reasoning KSP2 would just be a PNG with \u0022YOU WIN!\u0022 Written in a bold, reassuring font.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m sorry, but you\u0027re going to have to elaborate on your points a little bit better than that. Because right now, all I see is you saying \u0022I don\u0027t agree\u0022 with every single point I mentioned, without making note of \u0022why\u0022 you think that way, or \u0022how is that wrong\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nFor instance, when you say that the same reasoning can be applied to orbital mechanics. Maybe you\u0027re misinterpreting my statement, I\u0027ll admit it was quite vague.\u003Cbr\u003E\nI disagree with you saying that you can apply the same reasoning. But the reason is this. Life support as a game mechanic is very hard to implement in a way that isn\u0027t \u0022purely punitive\u0022.\u003Cbr\u003E\nIn other words, what do you get for having a working life support system on your vessel when it needs one? Your crew doesn\u0027t die. That\u0027s it, that\u0027s all you get, you get no \u0022benefit\u0022, you just \u0022don\u0027t get punished\u0022. That\u0027s not fun to me, and I doubt it\u0027s fun to many other people either. Now I get how that could be applied to craft design, because for instance if you build a gigantic fairing on the front of your rocket and you don\u0027t put large fins on the bottom of the rocket, it\u0027s gonna flip out and probably crash.\u003Cbr\u003E\nBut I don\u0027t get how that can be applied to orbital mechanics. Well, I guess I see a few ways that invalidate it is what I\u0027m trying to say. What do you get for not putting enough fuel on your rocket, you don\u0027t get to space, yeah that\u0027s a point for you. But what do you get if you ignore orbital mechanics and you just build a gigantic high power rocket that can just burn towards the target for half the journey and burn to slow down for half the journey? You\u0027ve ignored orbital mechanics again, but this time you achieved your mission goals, so that\u0027s the way I see that you can\u0027t apply the \u0022it\u0027s only ever neutral or not fun\u0022 logic to orbital mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I said that I didn\u0027t like the \u0022you must play my way and not your way\u0022 kind of message that some of those choices I mentioned seem to imply, I didn\u0027t mean \u0022someone might want to play a different video game entirely\u0022 like you seem to have interpreted it.\u003Cbr\u003E\nInstead, I meant that KSP 2, like KSP 1 before it, is going to be a sandboxed game focused on enabling player creativity, and a \u0022only punish, never reward\u0022 type system is a system that restricts player creativity more than I think is warranted.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I said \u0022why wouldn\u0027t people just time warp thru the signal delay\u0022, well you may have said there\u0027s other things going on, but that\u0027s not a 100% true fact, it\u0027s an assumption.\u003Cbr\u003E\nThere are cases where you\u0027re stuck without anything else to do and all you can do is just time warp thru that signal delay, and that doesn\u0027t sound like fun to me.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for your final statement, well I\u0027ll be slightly blunt, since it looks to me like you were similarly blunt. I don\u0027t see what your line of reasoning is to be able to reduce the entirety of that multi-faceted statement to such a simple thing as an \u0022i win button\u0022 type game. To be honest, it strikes me as slightly offensive. I am aware of the \u0022reduce to an absurdity\u0022 format of some logical arguments, but at the same time in this case I\u0027ll simply reject it unless you can go into more detail on how you\u0027ve reduced my argument to that point, hopefully over the course of several steps. In other words, \u0022Show your work\u0022.\u003Cbr\u003E\nEDIT: If the \u0022show your work\u0022 line of argument fails, I\u0027m going to just have to agree to disagree, as I\u0027ve realized that we\u0027re just comparing opinions, not facts.\u003Cbr\u003E\nEDIT 2: Additionally, if we were able to reduce such a game to that PNG of \u0022you win\u0022 as you mention, well that\u0027s obviously not a game, and nobody with any kind of sense would pay $50 for it. The \u0022theoretical simplest game\u0022 isn\u0027t a game. IDK what it is, but it\u0027s not enough of a game to be a game, even if it meets the established requirements for \u0022a game\u0022. Because that\u0027s the problem with defining what a game is, for every time you change the definitions, I could make a \u0022different game\u0022 that doesn\u0027t \u0022feel like a game\u0022. That\u0027s what happens when you try to use numbers to describe things that are better described with words or feelings.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-01T20:43:54Z\u0022 title=\u002211/01/2022 08:43  PM\u0022 data-short=\u00221 yr\u0022\u003ENovember 1, 2022\u003C/time\u003E by SciMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2022-11-01T22:38:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224194055\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667334964\u0022 data-ipsquote-userid=\u002212748\u0022 data-ipsquote-username=\u0022SciMan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SciMan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m sorry, but you\u0027re going to have to elaborate on your points a little bit better than that. Because right now, all I see is you saying \u0022I don\u0027t agree\u0022 with every single point I mentioned, without making note of \u0022why\u0022 you think that way, or \u0022how is that wrong\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nFor instance, when you say that the same reasoning can be applied to orbital mechanics. Maybe you\u0027re misinterpreting my statement, I\u0027ll admit it was quite vague.\u003Cbr\u003E\nI disagree with you saying that you can apply the same reasoning. But the reason is this. Life support as a game mechanic is very hard to implement in a way that isn\u0027t \u0022purely punitive\u0022.\u003Cbr\u003E\nIn other words, what do you get for having a working life support system on your vessel when it needs one? Your crew doesn\u0027t die. That\u0027s it, that\u0027s all you get, you get no \u0022benefit\u0022, you just \u0022don\u0027t get punished\u0022. That\u0027s not fun to me, and I doubt it\u0027s fun to many other people either. Now I get how that could be applied to craft design, because for instance if you build a gigantic fairing on the front of your rocket and you don\u0027t put large fins on the bottom of the rocket, it\u0027s gonna flip out and probably crash.\u003Cbr\u003E\nBut I don\u0027t get how that can be applied to orbital mechanics. Well, I guess I see a few ways that invalidate it is what I\u0027m trying to say. What do you get for not putting enough fuel on your rocket, you don\u0027t get to space, yeah that\u0027s a point for you. But what do you get if you ignore orbital mechanics and you just build a gigantic high power rocket that can just burn towards the target for half the journey and burn to slow down for half the journey? You\u0027ve ignored orbital mechanics again, but this time you achieved your mission goals, so that\u0027s the way I see that you can\u0027t apply the \u0022it\u0027s only ever neutral or not fun\u0022 logic to orbital mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I said that I didn\u0027t like the \u0022you must play my way and not your way\u0022 kind of message that some of those choices I mentioned seem to imply, I didn\u0027t mean \u0022someone might want to play a different video game entirely\u0022 like you seem to have interpreted it.\u003Cbr\u003E\nInstead, I meant that KSP 2, like KSP 1 before it, is going to be a sandboxed game focused on enabling player creativity, and a \u0022only punish, never reward\u0022 type system is a system that restricts player creativity more than I think is warranted.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I said \u0022why wouldn\u0027t people just time warp thru the signal delay\u0022, well you may have said there\u0027s other things going on, but that\u0027s not a 100% true fact, it\u0027s an assumption.\u003Cbr\u003E\nThere are cases where you\u0027re stuck without anything else to do and all you can do is just time warp thru that signal delay, and that doesn\u0027t sound like fun to me.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for your final statement, well I\u0027ll be slightly blunt, since it looks to me like you were similarly blunt. I don\u0027t see what your line of reasoning is to be able to reduce the entirety of that multi-faceted statement to such a simple thing as an \u0022i win button\u0022 type game. To be honest, it strikes me as slightly offensive. I am aware of the \u0022reduce to an absurdity\u0022 format of some logical arguments, but at the same time in this case I\u0027ll simply reject it unless you can go into more detail on how you\u0027ve reduced my argument to that point, hopefully over the course of several steps. In other words, \u0022Show your work\u0022.\u003Cbr\u003E\nEDIT: If the \u0022show your work\u0022 line of argument fails, I\u0027m going to just have to agree to disagree, as I\u0027ve realized that we\u0027re just comparing opinions, not facts.\u003Cbr\u003E\nEDIT 2: Additionally, if we were able to reduce such a game to that PNG of \u0022you win\u0022 as you mention, well that\u0027s obviously not a game, and nobody with any kind of sense would pay $50 for it. The \u0022theoretical simplest game\u0022 isn\u0027t a game. IDK what it is, but it\u0027s not enough of a game to be a game, even if it meets the established requirements for \u0022a game\u0022. Because that\u0027s the problem with defining what a game is, for every time you change the definitions, I could make a \u0022different game\u0022 that doesn\u0027t \u0022feel like a game\u0022. That\u0027s what happens when you try to use numbers to describe things that are better described with words or feelings.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYour way of defining a \u0022punitive\u0022 gameplay element is entirely arbitrary and based on how you personally like to play the game. Once we remove your personal preference from your argument they can be applied to every other gameplay system, existent, proposed or planned.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re just labeling every possible new gameplay loop or challenge as \u0022punitive\u0022, if things like reentry heating, commnet, and things exploding on impact weren\u0027t already gameplay elements for KSP1 you would label those as \u0022too punitive and not fun\u0022 too.\n\u003C/p\u003E\n\u003Cp\u003E\nBy your standard every obstacle and piece of gameplay between you and that imaginary \u0022you win!\u0022 screen can be considered a useless and punitive delay. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYou asking to do interstellar missions on an external seat makes just as much sense as anyone asking to have a TARDIS and be able to directly materialize on the surface of a planet in another star system, everything in the middle is going to be timewarped away anyway isn\u0027t it?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFrankly speaking the challenge of interstellar manned travel is 99% in the \u0022keeping that crew alive\u0022 department, if that\u0027s not a problem you can just put a jumbo tank with an external seat and a single terrier engine in orbit and get to the other solar system with chemical rockets and by timewarping a couple of million years away.\n\u003C/p\u003E\n\u003Cp\u003E\nIf KSP2 doesn\u0027t have a way of representing the true challenge and distances involved in such a voyage then they may as well drop the facade and add curvature drives, wormhole, hyperspace and other sci-fi technologies.\n\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2022-11-02T08:42:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224191499\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666845440\u0022 data-ipsquote-userid=\u002277770\u0022 data-ipsquote-username=\u0022GoldForest\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/27/2022 at 12:37 AM, GoldForest said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n-Probe control: Sending commands to a probe and waiting for it to react to them would be no fun, so probe control will remain instant.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m sorry, but light lag brings complexity and raise the skill bar. 100% fun zone.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom a \u003Cem\u003Ebalance\u003C/em\u003E perspective, I hope light lag plays counter to life support. I\u0027m thinking LS will be part of vanilla KSP2 to some extent, considering its scope, but if light lag isn\u0027t a thing I\u0027m definitely waiting for a mod to bring it in.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-02T08:45:14Z\u0022 title=\u002211/02/2022 08:45  AM\u0022 data-short=\u00221 yr\u0022\u003ENovember 2, 2022\u003C/time\u003E by Axelord FTW\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-11-02T08:55:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224194261\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667378539\u0022 data-ipsquote-userid=\u00221896\u0022 data-ipsquote-username=\u0022Axelord FTW\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, Axelord FTW said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m sorry, but light lag brings complexity and raise the skill bar. 100% fun zone.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom a \u003Cem\u003Ebalance\u003C/em\u003E perspective, I hope light lag plays counter to life support.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot fun for new players or players who don\u0027t want to program their probe to do a course correction and hope it goes well. \n\u003C/p\u003E\n\u003Cp\u003E\nIf people want command and control lag, then leave it as a default off option in the difficulty settings.\n\u003C/p\u003E\n"},{"CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2022-11-02T12:16:49Z","Content":"\n\u003Cp\u003E\nProbe control with a delay could easily be a mess. If you don\u0027t allow programming the probe in advance then it becomes almost impossible to actually land them somewhere, but if you have to program them then in order to play the game as a newcomer you have to learn not only orbital mechanics but also basic programming skills on top of that. I have my doubts that this is a worthwhile addition, except when added for mods or higher difficulty levels for those who get bored with the core parts of the game.\n\u003C/p\u003E\n\u003Cp\u003E\nHonestly, I don\u0027t even think it really adds realism. Just consider that when you fly the probe that you are essential the piloting program reacting to sensory inputs - the same way as you don\u0027t have to relay orders to Jeb for him to execute. When flying you are playing Jeb. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for light lag for things like transmitting science, it seems to not really matter much when in the Kerbin system, but afterwards it would. But is waiting 4 years for your science to arrive really that interesting of a gameplay element?\n\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-11-02T12:59:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224194289\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667391409\u0022 data-ipsquote-userid=\u0022192494\u0022 data-ipsquote-username=\u0022MarcAbaddon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, MarcAbaddon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nProbe control with a delay could easily be a mess. If you don\u0027t allow programming the probe in advance then it becomes almost impossible to actually land them somewhere, but if you have to program them then in order to play the game as a newcomer you have to learn not only orbital mechanics but also basic programming skills on top of that. I have my doubts that this is a worthwhile addition, except when added for mods or higher difficulty levels for those who get bored with the core parts of the game.\n\u003C/p\u003E\n\u003Cp\u003E\nHonestly, I don\u0027t even think it really adds realism. Just consider that when you fly the probe that you are essential the piloting program reacting to sensory inputs - the same way as you don\u0027t have to relay orders to Jeb for him to execute. When flying you are playing Jeb. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for light lag for things like transmitting science, it seems to not really matter much when in the Kerbin system, but afterwards it would. But is waiting 4 years for your science to arrive really that interesting of a gameplay element?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI imagine that colonies can serve to recieve and process science, so if you setup a science colony on Eeloo, or put orbital colonies outside of Eeloo in an evenly spread-out fashion, then the science would go to them and take maybe a year instead of four. \n\u003C/p\u003E\n\u003Cp\u003E\nI think it would be kind of nice to have delayed science, making it to where you have to plan out your career path more carefully instead of going, \u0022Yay, science, unlock all the nodes now!\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2022-11-02T13:09:12Z","Content":"\n\u003Cp\u003E\nMaybe.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I even struggle a bit with having light speed lag from a theoretical perspective, since light behaving the way it goes it basically a relativistic phenomena and KSP doesn\u0027t simulate that.\u003Cbr\u003E\n\u003Cbr\u003E\nLikely most of the time your vessel will not move at speeds where it matters much, but given that KSP is Newtonian should the signal from a vessel moving towards you at a speed of 0.1c have a speed of 1.1c? Should you be able to overtake a signal if you somehow manage to travel at \u0026gt; 1.0 c? Neither of this is possible in the real universe, but KSP doesn\u0027t implement those physical laws. This undermines the education appeal for me -you might end up teaching some very inconsistent ideas. \n\u003C/p\u003E\n\u003Cp\u003E\nInstantaneous signals somehow seem more consistent with the rest of the game physics. \n\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-11-02T13:37:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224194300\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667394552\u0022 data-ipsquote-userid=\u0022192494\u0022 data-ipsquote-username=\u0022MarcAbaddon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n27 minutes ago, MarcAbaddon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaybe.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I even struggle a bit with having light speed lag from a theoretical perspective, since light behaving the way it goes it basically a relativistic phenomena and KSP doesn\u0027t simulate that.\u003Cbr\u003E\n\u003Cbr\u003E\nLikely most of the time your vessel will not move at speeds where it matters much, but given that KSP is Newtonian should the signal from a vessel moving towards you at a speed of 0.1c have a speed of 1.1c? Should you be able to overtake a signal if you somehow manage to travel at \u0026gt; 1.0 c? Neither of this is possible in the real universe, but KSP doesn\u0027t implement those physical laws. This undermines the education appeal for me -you might end up teaching some very inconsistent ideas. \n\u003C/p\u003E\n\u003Cp\u003E\nInstantaneous signals somehow seem more consistent with the rest of the game physics. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m not advocating for breaking the laws that govern light, just transmission delay. \n\u003C/p\u003E\n"},{"CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2022-11-02T13:41:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224194306\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667396231\u0022 data-ipsquote-userid=\u002277770\u0022 data-ipsquote-username=\u0022GoldForest\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, GoldForest said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m not advocating for breaking the laws that govern light, just transmission delay. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut how are you going to calculate the transmission delay? It\u0027ll be either inconsistent with the rest of KSP physics or with relativity. \n\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-11-02T13:44:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224194310\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667396494\u0022 data-ipsquote-userid=\u0022192494\u0022 data-ipsquote-username=\u0022MarcAbaddon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, MarcAbaddon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut how are you going to calculate the transmission delay? It\u0027ll be either inconsistent with the rest of KSP physics or with relativity. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s simple. \n\u003C/p\u003E\n\u003Cp\u003E\n(Distance to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E or nearest science processing colony/station in meters) / (speed of light in m/s) = (Time it takes for Science to arrive)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-02T13:45:02Z\u0022 title=\u002211/02/2022 01:45  PM\u0022 data-short=\u00221 yr\u0022\u003ENovember 2, 2022\u003C/time\u003E by GoldForest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vl3d","CreatedById":219348,"CreatedDateTime":"2022-11-02T13:50:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224192321\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666987558\u0022 data-ipsquote-userid=\u002212748\u0022 data-ipsquote-username=\u0022SciMan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/28/2022 at 11:05 PM, SciMan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt makes the player click more buttons, and use a few more seconds or minutes, for no added benefit (IMO).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow, a short SciMan comment! \u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon2.png\u0022 title=\u0022:o\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2022-11-02T20:44:18Z","Content":"\n\u003Cp\u003E\nIt appears my reputation precedes me. Oh well.\n\u003C/p\u003E\n\u003Cp\u003E\nI usually have a lot to say about something, but that one, well I had basically already said mostly the same thing above it so I didn\u0027t feel the need to expand on it even further.\n\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-11-04T18:47:26Z","Content":"\n\u003Cp\u003E\nOkay, so I just realized something, and instead of starting a new thread, I\u0027m just going to add it on to this one since it is pretty much on topic.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I just realized that we don\u0027t know anything about communications technology. Obvious we\u0027ll need new tech, but what are they going to give us? What\u0027s possible in the \u0027near future\u0027 and isn\u0027t \u0027magic\u0027?\n\u003C/p\u003E\n\u003Cp\u003E\nDaedalus was supposedly going to act as a laser transmission antenna when not in use for propulsion, or something to the effect, don\u0027t remember the exact details. MEV for KSP 1 mimics this by giving the Daedalus engine comms capability. I\u0027m hoping that KSP 2 will mimic this as well, allowing for lightspeed transmission. Other than that, what other possible methods will we see from Intercept Games? Or is optical communication the best that can be done outside of wormholes, \u0022subspace\u0022 and the like? If optical is the best, I\u0027m assuming we\u0027ll see different levels of optical communication dishes?\n\u003C/p\u003E\n"},{"CreatedByName":"MK2-DroneCore","CreatedById":219366,"CreatedDateTime":"2022-12-20T03:19:31Z","Content":"\n\u003Cp\u003E\nwhy we will need remoted control? Maybe a KOS like operate system is better.\n\u003C/p\u003E\n\u003Cp\u003E\nYou may not be able to remote your MarsRover instantly, You will need to update its software after 20 minute\u0027s transmit delay. That will be fun(Espacilly for a Programmer like me!)\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2022-12-20T08:20:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224211021\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221671506371\u0022 data-ipsquote-userid=\u0022219366\u0022 data-ipsquote-username=\u0022MK2-DroneCore\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, MK2-DroneCore said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhy we will need remoted control? Maybe a KOS like operate system is better.\n\u003C/p\u003E\n\u003Cp\u003E\nYou may not be able to remote your MarsRover instantly, You will need to update its software after 20 minute\u0027s transmit delay. That will be fun(Espacilly for a Programmer like me!)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can program and make completely autonomous missions even without signal delay.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2022-12-20T08:29:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224194289\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667391409\u0022 data-ipsquote-userid=\u0022192494\u0022 data-ipsquote-username=\u0022MarcAbaddon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/2/2022 at 12:16 PM, MarcAbaddon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs for light lag for things like transmitting science, it seems to not really matter much when in the Kerbin system, but afterwards it would. But is waiting 4 years for your science to arrive really that interesting of a gameplay element?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe devs said they want you to feel the size of a light year, and it\u0027s not like it matters if some backwater Betelgeuse colony doesn\u0027t immediately get a technology you unlocked at Alpha Centauri and will primarily use there anyway.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-20T08:30:07Z\u0022 title=\u002212/20/2022 08:30  AM\u0022 data-short=\u00221 yr\u0022\u003EDecember 20, 2022\u003C/time\u003E by Bej Kerman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wheehaw Kerman","CreatedById":223516,"CreatedDateTime":"2022-12-20T13:24:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224194113\u0022 data-ipsquote-contentid=\u0022210304\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667342317\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/1/2022 at 6:38 PM, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYour way of defining a \u0022punitive\u0022 gameplay element is entirely arbitrary and based on how you personally like to play the game. Once we remove your personal preference from your argument they can be applied to every other gameplay system, existent, proposed or planned.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re just labeling every possible new gameplay loop or challenge as \u0022punitive\u0022, if things like reentry heating, commnet, and things exploding on impact weren\u0027t already gameplay elements for KSP1 you would label those as \u0022too punitive and not fun\u0022 too.\n\u003C/p\u003E\n\u003Cp\u003E\nBy your standard every obstacle and piece of gameplay between you and that imaginary \u0022you win!\u0022 screen can be considered a useless and punitive delay. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell said.  I don’t identify as a gamer, or hang around in gaming circles, so I don’t know whether this notion of “punitiveness” is widespread or just a KSP forums thing, but I find it really, really strange.  Life is punitive as hell in this sense, risk taking has consequences, and failure can be catastrophic as hell.  \n\u003C/p\u003E\n\u003Cp\u003E\nEspecially in space exploration.  The history of space exploration is one epic saga of engineers and scientists and pilots deploying all their skills and ingenuity to overcome technical challenges and risks, and the consequences of failure were fatalities.  Astronauts die when the engineers and scientists and technicians make mistakes.  And that is a big part of what makes the whole endeavour of spaceflight thrilling and fascinating and worthwhile.  People do strap their tender pink anatomies onto huge tanks of toxic and explosive chemicals and launch themselves clean outside our biosphere.  It is sheer heroism in the literal, classical sense.  Homer would have been hugely inspired by the Apollo program.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the need for life support is fundamental to the whole enterprise.  Which is why I find it baffling that people are so opposed to it on the grounds of this notion of punitiveness, in a game that’s about iterative experimentation in spaceflight.  Build an unstable rocket?  Not enough fuel?  Didn’t pack enough snacks?  Forgot parachutes?  \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe crew dies.  Back to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, brothers!  \n\u003C/p\u003E\n\u003Cp\u003E\n(It sounds even better in Latin: “redeamus ad vehiculi fabricam, fratres!”)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-20T13:27:55Z\u0022 title=\u002212/20/2022 01:27  PM\u0022 data-short=\u00221 yr\u0022\u003EDecember 20, 2022\u003C/time\u003E by Wheehaw Kerman\u003C/strong\u003E\n\u003C/span\u003E\n"}]}