{"TopicId":210976,"ForumId":109,"TopicTitle":"Why I don\u0026#039;t want interstellar travel","CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2022-12-08T10:23:01Z","PageNum":2,"Articles":[{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2022-12-09T00:32:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206891\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670539327\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEven if I\u0027m wrong, and the game won\u0027t be dumbed down,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe \u0022dumbing down\u0022 you\u0027re talking about is compared to mods that never were part of the game.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206891\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670539327\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe approach is to \u003Cem\u003Eexpand \u003C/em\u003Ethe game, not \u003Cem\u003Edeepen \u003C/em\u003Eit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYour idea of \u0022deepening\u0022 the game is adding busywork and artificial difficulty like random failures (which is literally a \u0022you loose because of a dice\u0022 condition)\n\u003C/p\u003E\n"},{"CreatedByName":"SolarAdmiral","CreatedById":107350,"CreatedDateTime":"2022-12-09T00:38:02Z","Content":"\n\u003Cp\u003E\nI\u0027ve also been a player since almost the very start of KSP, started playing before there was a map view and have put in multiple thousands of hours. Though I\u0027m from the other end, where I\u0027ve been to every planet with almost every sort of mission profile. And I\u0027m looking forward to everything in KSP2. At almost every point they\u0027ve announced almost exactly what I\u0027ve wanted to hear. The new engines are something I\u0027m dying to get my hands on. What it sounds like the resource and trade system is, is my absolute dream. And I\u0027m greatly looking forward to setting up a multiplayer server with some friends. Pretty much all exactly what I could want from a sequel.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, I\u0027ve tried and disliked the more simulationy mods. Real scale and real fuels to me just makes things tedious and didn\u0027t add anything I found interesting. Now, I don\u0027t disparage anyone liking them. But they should be things added as options or mods.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd I would describe myself as a hardcore KSP  fan. KSP is my absolute favourite game of all time bar none.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAt the core of it, I think it makes way more sense for the vanilla KSP experience to be more simplified and focused on being a good and fun game. While saving the more complicated, detailed, and realistic simulation stuff to be added by mods. For the simple fact that the more casual end of the audience would be turned off by all that complexity and avoid the game or lose interest, while the hard core simulator end of the audience is the one with the experience and patience to mod the game.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf KSP2 was aimed at the simulator crowd, it simply would not be getting this scale of investment and development. This way, Take Two can invest way more in the project hoping for a wider audience. And with the improved base game and increased mod support, everyone can get what they want.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-12-09T03:15:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206926\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670546282\u0022 data-ipsquote-userid=\u0022107350\u0022 data-ipsquote-username=\u0022SolarAdmiral\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, SolarAdmiral said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n. For the simple fact that the more casual end of the audience would be turned off by all that complexity and avoid the game or lose interest, while the hard core simulator end of the audience is the one with the experience and patience to mod the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJust as a point of nuance I think there’s a difference between a game with complex rules and a game with complex \u003Ci\u003Eoutcomes\u003C/i\u003E. Chess for example has incredibly simple rules and a stupendously huge range of outcomes. In fact I would argue the best games produce the biggest potential for  gameplay diversity based on the simplest possible set of rules. If on the other hand you have a huge set of very complicated rules but players tend always to do the same thing then you probably have a very boring game. This is why I advocate for having a relatively simple and streamlined progression system, but one thats still carefully balanced to produce lots of strategic forks based on how you play and what resources you find. Thats the real trick of good game design—leveraging a set of dynamics that are simple to learn but incredibly difficult to master. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-09T03:16:45Z\u0022 title=\u002212/09/2022 03:16  AM\u0022 data-short=\u00221 yr\u0022\u003EDecember 9, 2022\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SolarAdmiral","CreatedById":107350,"CreatedDateTime":"2022-12-09T03:44:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206953\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670555710\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf on the other hand you have a huge set of very complicated rules but players tend always to do the same thing then you probably have a very boring game. This is why I advocate for having a relatively simple and streamlined progression system, but one thats still carefully balanced to produce lots of strategic forks based on how you play and what resources you find. Thats the real trick of good game design—leveraging a set of dynamics that are simple to learn but incredibly difficult to master. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDefinitely agreed. It\u0027s already looking like there\u0027s going to be lots of depth in KSP2 much more than the original especially centered on the new engine types. It looks like they\u0027re designing then to all have some unique challenges.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI simply meant that if the vanilla game was built with the exacting realistic detail of real scale solar system, real rocket fuels, a detailed life support with dozens of consumables, and whatever else to make it a 100% realistic simulator, it would be even more daunting and unwelcoming to new players and semi casual players. That sort of thing is better added as mods if for no other reason than the simple fact that the sort of folks who want that are also the sort of folks who would liberally mod their game. While the casual and first time players are much more likely to play fully vanilla, at least until they decide they want more.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2022-12-10T16:41:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206966\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670559349\u0022 data-ipsquote-userid=\u0022223493\u0022 data-ipsquote-username=\u0022Laikanaut\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/9/2022 at 4:15 AM, Laikanaut said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI also spent a lot of hours in KSP but never bothered to visit many of the planets (maybe half). The issue for me is that once players figure out how to encounter one planet, there\u0027s little reason or increased challenge to encounter any others - just the added tediousness of fiddling with maneuver nodes and having to look up the transfer windows using the calculator. The mechanic gets old very quickly and I wouldn\u0027t bother to play without Principia now, which adds more depth and interest to this part of the game. Even going beyond the Mun quickly becomes tedious due to the necessity of looking up transfer windows and the large amounts of travel time needed, which makes it difficult to do more than a single mission at one time and return the Kerbals as well.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is only going to get worse with interstellar travel and so I\u0027m also not really looking forward to it either.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re denouncing interstellar travel for problems that KSP 1 had which will probably not be present in KSP 2? The gameplay loop involving colonies, space construction and resource gathering on its own will probably nullify most of this first paragraph. Even then, KSP 1 had landmarks unique to planets. Duna has a face, Val has cryovolcanoes, Dres has the largest canyon, etc. and having planets like Rask and Rusk will probably further encourage players to make stops at different planets.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m just saying, the basis on which you\u0027re saying interstellar travel will make these minor problems worse is really shaky.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-10T16:41:56Z\u0022 title=\u002212/10/2022 04:41  PM\u0022 data-short=\u00221 yr\u0022\u003EDecember 10, 2022\u003C/time\u003E by Bej Kerman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zozaf Kerman","CreatedById":219910,"CreatedDateTime":"2022-12-10T17:05:43Z","Content":"\n\u003Cp\u003E\nIt’s a bit late to say this… your post won’t change anything because the devs are already developing interstellar.\n\u003C/p\u003E\n"},{"CreatedByName":"bcink","CreatedById":181027,"CreatedDateTime":"2022-12-10T18:45:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206817\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670524194\u0022 data-ipsquote-userid=\u0022184633\u0022 data-ipsquote-username=\u0022TLTay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/8/2022 at 11:29 AM, TLTay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDevs: tap this person to test your tutorials?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nbahahahaha. You win.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206700\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670494981\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/8/2022 at 3:23 AM, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve clocked over 4000 hours in KSP 1 and I\u0027m yet to land a kerbal on another planet (not to mention return).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy dude.............The game is now 11 years old. Real life space programs have been created and sent rockets to orbit in this time. You have the option of stopping messing around with mods for 45 minutes to watch a YouTube video to complete a successful Mun mission of some kind if you really wanted to.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-12-10T21:24:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207399\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670697928\u0022 data-ipsquote-userid=\u0022181027\u0022 data-ipsquote-username=\u0022bcink\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, bcink said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nbahahahaha. You win.\n\u003C/p\u003E\n\u003Cp\u003E\nMy dude.............The game is now 11 years old. Real life space programs have been created and sent rockets to orbit in this time. You have the option of stopping messing around with mods for 45 minutes to watch a YouTube video to complete a successful Mun mission of some kind if you really wanted to.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey said another planet. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd by Squad\u0027s own admission, over like 80% of players have not even gone past Minmus, iirc. \n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no need for you to criticise them like this. Your comment comes off as a little harsh imo. \n\u003C/p\u003E\n\u003Cp\u003E\nSo what if the game is 11 years old, some people prefer staying around Kerbin and I can understand why. Especially when you use a rescale mod, things get much harder DeltaV wise. \n\u003C/p\u003E\n\u003Cp\u003E\nKSP 2 wants to encourage those players to go beyond Minmus by making it easier for players by giving tutorials, as well as parts better suited for interplanetary travel. \u003Cspan\u003ELet\u0027s be honest, interplanetary missions in KSP are hard if they\u0027re meant to be 2 way. With the inclusion of better interplanetary mechanics and parts, I see more people willing to take to going to Duna or Laythe. \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2022-12-10T21:27:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206903\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670541141\u0022 data-ipsquote-userid=\u0022222131\u0022 data-ipsquote-username=\u0022Domonian\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/9/2022 at 12:12 AM, Domonian said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is the case with most space games, unfortunately. It\u0027s hard to deepen a bunch of rocks out in the middle of nowhere. Although this does depend on how you define \u0022deepen.\u0022 How would \u003Cem\u003Eyou\u003C/em\u003E deepen KSP2, or rather, what is your ideal sequel to KSP1?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere are so many mechanics missing or being incomplete in KSP 1, which don\u0027t seem to be addressed (or at least paid attention to) in KSP 2. I mentioned some of them: life support, parts reliability, radiation. These are all major elements of space exploration, but nearly absent from KSP. The science system and, more generally, career progression is rather bland at the moment and doesn\u0027t really incentivize exploration. All kerbals are largely the same, differing only in their professions and experience levels. Planning gravity assists and other complex maneuvers is extremely difficult with the way the map works. There is no signal delay or probe automation (even more nonsensical for interstellar distances). There is no such a thing as wind, and aerodynamics are quite basic. The electricity system is not realistic. I could go on, but I think you get my point.\n\u003C/p\u003E\n\u003Cp\u003E\nIt doesn\u0027t mean these things must be on for every player; they may be optional for those who have covered the basics and want a more interesting gameplay (the same way as interstellar travel is probably meant for the players who have already explored the kerbal system). Some of these features may be implemented as mods, but it\u0027s always less efficient, more buggy and sometimes not really possible with the existing engine. If anything, adding new parts and celestial bodies is less intrusive and could be more easily done by modders.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2022-12-10T21:28:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207461\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670707494\u0022 data-ipsquote-userid=\u002277770\u0022 data-ipsquote-username=\u0022GoldForest\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, GoldForest said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere\u0027s no need for you to criticise them like this. Your comment comes off as a little harsh imo.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGiven that they\u0027re condemning interstellar travel because \u003Cem\u003Ethey themselves\u003C/em\u003E make the game harder every time they get closer to being able to pull off an interplanetary mission and then go on to say that the devs would need to make the game easier for interstellar travel despite not having the experience to say that\u0027s not true in the slightest, I\u0027d say it is fair.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-10T21:29:56Z\u0022 title=\u002212/10/2022 09:29  PM\u0022 data-short=\u00221 yr\u0022\u003EDecember 10, 2022\u003C/time\u003E by Bej Kerman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2022-12-10T21:30:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207463\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670707724\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGiven that they\u0027re condemning interstellar travel because \u003Cem\u003Ethey themselves\u003C/em\u003E make the game harder every time they get closer to being able to pull off an interplanetary mission, I\u0027d say it is fair.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPerhaps, but the way it was worded could have been better imo. \n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2022-12-10T21:33:36Z","Content":"\n\u003Cp\u003E\nMy point\u0027s that they don\u0027t know how to do a Hohmann transfer from Kerbin to Duna and they haven\u0027t taken the initiative to learn how to do things like this, and yet they\u0027re commenting on how the game would need dumbing down for interstellar (hint: it doesn\u0027t) and making comments on these game mechanics you\u0027re best only commenting on if you understand it.\n\u003C/p\u003E\n"},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2022-12-10T21:37:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207399\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670697928\u0022 data-ipsquote-userid=\u0022181027\u0022 data-ipsquote-username=\u0022bcink\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, bcink said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy dude.............The game is now 11 years old. Real life space programs have been created and sent rockets to orbit in this time. You have the option of stopping messing around with mods for 45 minutes to watch a YouTube video to complete a successful Mun mission of some kind if you really wanted to.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReal life space programs were also usually done by more than one people, if I remember correctly. In KSP 1, there isn\u0027t much of an incentive to just visit many other celestial bodies. \u0022Moar boosters\u0022 stops being fun at some point. So instead I add challenge by having more realism through mods. Then even a simple landing on the Mun may require more effort, and brings more feeling of accomplishment, than going to Eeloo.\n\u003C/p\u003E\n\u003Cp\u003E\nI know not everyone plays like this, and it\u0027s ok. However, I\u0027m disappointed that my play style seems to be discouraged by KSP 2\u0027s design. This is what my rant is about.\n\u003C/p\u003E\n"},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2022-12-10T21:50:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207466\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670708016\u0022 data-ipsquote-userid=\u0022182413\u0022 data-ipsquote-username=\u0022Bej Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Bej Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy point\u0027s that they don\u0027t know how to do a Hohmann transfer from Kerbin to Duna and they haven\u0027t taken the initiative to learn how to do things like this, and yet they\u0027re commenting on how the game would need dumbing down for interstellar (hint: it doesn\u0027t) and making comments on these game mechanics you\u0027re best only commenting on if you understand it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nApparently, you haven\u0027t read the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E well. I do know how to make Hohmann transfers, and I suppose I can pull off more complex things in KSP than 95% of players, but it\u0027s not about my skills. Like I said elsewhere, it\u0027s about the devs\u0027 choice to take the (relatively) easy road of making a wider game rather than a deeper game with more interesting mechanics. Ok, now we\u0027ll have some more fancy engines with cooler GFX and will be able to visit a few planets looking more exotic. But the gameplay itself will remain mostly the same (apart from colonization/\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, which I welcome): launch a rocket, get new science, discover a new tech, add more boosters, send another rocket and so on.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207374\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670691943\u0022 data-ipsquote-userid=\u0022219910\u0022 data-ipsquote-username=\u0022Zozaf Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Zozaf Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt’s a bit late to say this… your post won’t change anything because the devs are already developing interstellar.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI know. I\u0027ve been thinking for quite some time whether to post it or not, \u0027cause obviously it\u0027s been a strategic choice they aren\u0027t going to reverse because of somebody\u0027s rant. But then maybe at least some kind of feedback is better than nothing. The game hasn\u0027t even entered Early Access yet, so apparently not everything about it is decided.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2022-12-10T22:25:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207472\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670709041\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n27 minutes ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ninteresting mechanics\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYour \u0022\u003Cem\u003EInteresting mechanics\u003C/em\u003E\u0022 is incredibly subjective.\n\u003C/p\u003E\n\u003Cp\u003E\nJust to pick two, neither \u003Cstrong\u003Erandom part failures \u003C/strong\u003Enor \u003Cstrong\u003Esignal delay \u003C/strong\u003Ewould make the game more challenging. The first one is just a dice roll randomly killing your missions for reasons out of your control and the second it\u0027s an extreme feature that either makes the game easier by forcing automation for everything or turns it into a Zachtronics programming game in which you have to program everything manually.\n\u003C/p\u003E\n\u003Cp\u003E\nIMOH, the easy choice for KSP2 would have been what you are proposing, chasing blind realism with no consideration for gameplay, don\u0027t hire any actual game designer, just a bunch of engineers with the goal of making a realistic simulation.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2022-12-10T22:49:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207480\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670711155\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust to pick two, neither \u003Cstrong\u003Erandom part failures \u003C/strong\u003Enor \u003Cstrong\u003Esignal delay \u003C/strong\u003Ewould make the game more challenging. The first one is just a dice roll randomly killing your missions for reasons out of your control and the second it\u0027s an extreme feature that either makes the game easier by forcing automation for everything or turns it into a Zachtronics programming game in which you have to program everything manually.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is why you \u003Cem\u003Eneed \u003C/em\u003Ea game designer: to find interesting and creative solutions instead of just making a few Blender models and adopting some latest DirectX effects. There are ways to make part failures challenging \u003Cem\u003Eand\u003C/em\u003E fun other than just adding an RNG \u0022mission over\u0022. This could encourage such essential practices in real-life space engineering as redundancy (not needed at all in stock KSP) or testing. Or it could be overcome with maintenance, repairs (manual or robotic) etc. This might make possible whole new types of missions and spacecraft. \n\u003C/p\u003E\n\u003Cp\u003E\nThe same applies to signal delay, which (as an optional feature) may incentivize actually having crewed missions and habitable colonies. The game designers could come up with interesting ways to implement automation of tasks, not necessarily an equivalent of kOS. This is their job, after all. Of course, it is harder to do when you deal with interstellar distances, where delays may be years-long, but hey, it wasn\u0027t my idea to add these!\n\u003C/p\u003E\n"},{"CreatedByName":"Gotmachine","CreatedById":163039,"CreatedDateTime":"2022-12-10T23:22:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207480\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670711155\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n39 minutes ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Erandom part failures \u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E said anything about random part failures, but about part reliability. Part operational lifetime limits is to unmanned missions what life support is to manned mission, a way to introduce mission time as a gameplay element, they go hand to hand to build a game mechanism introducing both more depth and more realism to a contemporary spaceflight, more real life grounded playstyle. KSP is a relatively casual, goofy rocket and orbital mechanics game. That doesn\u0027t mean there isn\u0027t any room for something else in the subgenre.\n\u003C/p\u003E\n"},{"CreatedByName":"Bej Kerman","CreatedById":182413,"CreatedDateTime":"2022-12-11T00:24:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207472\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670709041\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nit\u0027s not about my skills\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m saying that players, with KSP 2\u0027s on boarding, won\u0027t spend 100s of hours learning to land on the Mun. They won\u0027t even spend 50 hours learning to put a basic colony on Eeloo. In fact, most tutorials on KSP were good enough to get players to the other planets and KSP 2\u0027s tutorials will be even better. KSP 2 sure as rain will not need to simplify spaceflight to get players to go interstellar, and you don\u0027t need to make people scared it\u0027s somehow going to turn into \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E or something. Your post is built on a very faulty premise to put it lightly.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2022-12-11T00:55:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207488\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670712541\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is why you \u003Cem\u003Eneed \u003C/em\u003Ea game designer: to find interesting and creative solutions instead of just making a few Blender models and adopting some latest DirectX effects. There are ways to make part failures challenging \u003Cem\u003Eand\u003C/em\u003E fun other than just adding an RNG \u0022mission over\u0022. This could encourage such essential practices in real-life space engineering as redundancy (not needed at all in stock KSP) or testing. Or it could be overcome with maintenance, repairs (manual or robotic) etc. This might make possible whole new types of missions and spacecraft. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207500\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670714536\u0022 data-ipsquote-userid=\u0022163039\u0022 data-ipsquote-username=\u0022Gotmachine\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n55 minutes ago, Gotmachine said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003E\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\u003C/abbr\u003E said anything about random part failures, but about part reliability. Part operational lifetime limits is to unmanned missions what life support is to manned mission, a way to introduce mission time as a gameplay element, they go hand to hand to build a game mechanism introducing both more depth and more realism to a contemporary spaceflight, more real life grounded playstyle. KSP is a relatively casual, goofy rocket and orbital mechanics game. That doesn\u0027t mean there isn\u0027t any room for something else in the subgenre.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe two were two examples just to show how there\u0027s more subtlety in the example and not just a \u0022\u003Cem\u003EWhat I like it\u0027s deep and meaningful what they did is shallow and lazy\u003C/em\u003E\u0022 like the picture depicted by the original post.\n\u003C/p\u003E\n\u003Cp\u003E\nBut yes, I started from the assumption that \u0022Part failures\u0022 means what part failures usually means when modding it in, since \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E was talking about modding the game to be more difficult.\n\u003C/p\u003E\n\u003Cp\u003E\nI have no problem on paper with parts having an operational life, or with parts having wear and tear, as long as no random elements of any kind is added to it. Every failure \u003Cstrong\u003Emust \u003C/strong\u003Ecome from player error and not some dice roll in the background. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207488\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670712541\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe same applies to signal delay, which (as an optional feature) may incentivize actually having crewed missions and habitable colonies.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can incentivize that without removing the ability to manually fly your probes. Like by making bases useful and their uses linked to the presence of kerbals on site. Colonies shouldn\u0027t work without kerbals present, especially the fuel refining and craft building and launching portions of them.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207488\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670712541\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe game designers could come up with interesting ways to implement automation of tasks, not necessarily an equivalent of kOS.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s either kOS or removing all challenge because all the gameplay of probes is replaced with a single \u0022\u003Cem\u003Edo the cool thing\u003C/em\u003E\u0022 button.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd you\u0027re thinking it creates problems for interstellar missions when the problem comes much earlier: It\u0027s basically impossible to design and fly realistic flying probes with signal delay. Not some far future sci-fi interstellar probe, \u003Cem\u003EIngenuity\u003C/em\u003E the helicopter that\u0027s on Mars right now becomes something you can\u0027t replicate in KSP without having a crew in orbit around Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nBut all of this has been discussed again and again in the respective threads.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe point here is that you\u0027re presenting your personal preference as some sort of objectively better option, a deeper and more meaningful game, when it\u0027s really just that, a personal preference.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re proposing to make doing the same things people used to do in KSP1 more difficult, instead of adding any real new destinations or objectives. They choose to focus on expanding the game further, fully knowing that the kind of gameplay you seek is going to be covered by mods anyway. I\u0027ve launched from Kerbin for every kind of mission countless times, I don\u0027t care about making Kerbin bigger or adding more stuff I have to put on the rocket to keep my Kerbals alive or adding the possibility for my rocket to randomly explode. Building a colony on the Mun and running a whole space program from there? That\u0027s intresting. Want a more hardcore experience? Let\u0027s build a colony on \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E, and run every mission from there.\n\u003C/p\u003E\n\u003Cp\u003E\nMore busywork and obstacles doesn\u0027t make a game better, at least not for everyone.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a different direction from what you hoped, that\u0027s for sure, but that doesn\u0027t mean it\u0027s not as thought out as the one you would have liked.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TROPtastic","CreatedById":211826,"CreatedDateTime":"2022-12-11T01:51:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207462\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670707630\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe science system and, more generally, career progression is rather bland at the moment and doesn\u0027t really incentivize exploration. All kerbals are largely the same, differing only in their professions and experience levels. Planning gravity assists and other complex maneuvers is extremely difficult with the way the map works.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor some of these points, the devs are specifically working to address them. The science system is TBC, but the whole career progression is being rewritten from scratch since Intercept also sees the problems with KSP1\u0027s career system. Gravity assists and complex maneuvers may be easier with the new maneuver planner (which is confirmed to account for long duration burns), which would actually make the game more accessible without simplifying it.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbals being largely the same \u003Cem\u003Eoutside of professions and experience levels\u003C/em\u003E is true, but those two aspects make individual Kerbals quite different from each other. I appreciate what it\u0027s like to fly a brand new pilot in a new save without access to \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and maneuver pointing. I\u0027m not sure what else could be done to make Kerbals functionally unique without distracting from the core \u0022build aircraft/spacecraft gameplay\u0022.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207468\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670708237\u0022 data-ipsquote-userid=\u0022141813\u0022 data-ipsquote-username=\u0022garwel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, garwel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo instead I add challenge by having more realism through mods. Then even a simple landing on the Mun may require more effort, and brings more feeling of accomplishment, than going to Eeloo.\n\u003C/p\u003E\n\u003Cp\u003E\nI know not everyone plays like this, and it\u0027s ok. However, I\u0027m disappointed that my play style seems to be discouraged by KSP 2\u0027s design. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf I\u0027m understanding this part and your \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E correctly, you choose mods to add challenge to KSP1 beyond what is available in the base game. If this is true, how will this be discouraged by KSP2\u0027s design? Mods are confirmed for the game at some point, and you will still have the same freedom to change your experience once the mod ecosystem is built up. Yes, some mods may perform somewhat worse than if their functionality was built into the game, but I don\u0027t see how KSP2 discourages your playstyle any more than KSP1 does. \n\u003C/p\u003E\n"},{"CreatedByName":"Wheehaw Kerman","CreatedById":223516,"CreatedDateTime":"2022-12-11T03:34:23Z","Content":"\n\u003Cp\u003E\nThinking about the part failure thing, it is a thing that happens to real spacecraft, and is something that the  engineers who design them have to mitigate.  A parts failure system that drives intelligent redundant approaches to design wouldn’t be a terrible thing…\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-12-11T04:06:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207572\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670725374\u0022 data-ipsquote-userid=\u0022223493\u0022 data-ipsquote-username=\u0022Laikanaut\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Laikanaut said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI expect KSP 2 will be mostly the same as KSP, a sandbox experience with a half-finished campaign/progression mode that ends up with endless attempts to complete it by modders (since it\u0027s not even on the roadmap). The difference is that learning the patched conic style of orbital mechanics through gameplay is only fun once - once you know how that works there\u0027s nothing more to do with it, and so your key mechanic is simply fiddling around with maneuver nodes to visit planets with different textures and height maps. The appeal of new graphics is not something that justifies such a high price tag, KSP 2 does look great but it\u0027s still lacking the same depth that KSP was lacking.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s strange that this seems to be supported by most of the players on these forums, who only want a sandbox mode with more parts and more planets to visit and more easter eggs. Maybe the publishers have done their research and know this, and so everyone thinks that everyone is happy with this outcome.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI just don’t think this is the case. Most people here have been pretty open about the deficiencies with KSP1’s career system—grindy science, procedural contracts, the lack of mapping and flight planners and dynamic resource challenges, etc—and we are all holding in our minds a pretty high standard for what it would take to turn KSP from a promising but garbled play experience into a truly great game. Especially with colonies there could be \u003Ci\u003Eso\u003C/i\u003E much more than just understanding basic transfers. The real fun (at least for me) comes in designing really efficient mission profiles—motherships that break off several modules that reassemble in orbit to harvest critical resources and combine with other reusable infrastructure to do much more than a simple flags and footprints mission.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI understand the motive to cynicism, but most of the decisions we’ve seen Intercept make have been pretty thoughtful and many have been truly inspired. I think they are laying the groundwork for genuinely crazy puzzles involving navigation and landing, resource prospecting, heat management, radiation, basic life support, and interplanetary supply routes—all stock. Im also pretty hopeful about the way they’re dealing with progression and population with boom events. We’ll have to wait and see how experiments and the tech tree are being handled as well as kerbal classes and skills but those are open and contested debates here and Im sure will be hashed out in the EA process. The best we can do is to offer thoughtful and open feedback as things play out. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207583\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670729663\u0022 data-ipsquote-userid=\u0022223516\u0022 data-ipsquote-username=\u0022Wheehaw Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n33 minutes ago, Wheehaw Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThinking about the part failure thing, it is a thing that happens to real spacecraft, and is something that the  engineers who design them have to mitigate.  A parts failure system that drives intelligent redundant approaches to design wouldn’t be a terrible thing…\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is one of those things the devs have wisely left to mods. Yes of course in real life redundancy is important, but in an already incredibly complicated and unforgiving game you don’t want players to feel like they have to put 2 or 3 of every part on a vessel to know it will perform as expected. For the sake of good gameplay we can assume these parts are all well tested. \n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-12-11T05:52:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207596\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670735727\u0022 data-ipsquote-userid=\u0022223493\u0022 data-ipsquote-username=\u0022Laikanaut\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, Laikanaut said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI fully agree that they\u0027re jumping much too far ahead with the current approach, and gameplay in these regions will by necessity remain shallow and uninteresting as a result, because they don\u0027t see anything interesting to do there.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRight, aside from establishing and growing colonies and stations, harvesting and processing resources to build new vessels with thus far unexplored dynamics like radiation cones and brachistochrone trajectories, and linking everything together with supply routes to form an interplanetary civilization there won’t really be anything to new to do. \n\u003C/p\u003E\n"},{"CreatedByName":"DrCHIVES","CreatedById":220584,"CreatedDateTime":"2022-12-11T06:57:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206744\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670504970\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/8/2022 at 8:09 AM, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFunnily enough \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLol this geeked me \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224206744\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670504970\u0022 data-ipsquote-userid=\u0022150811\u0022 data-ipsquote-username=\u0022The Aziz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/8/2022 at 8:09 AM, The Aziz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMultiplayer KSP is pretty meh for me anyway, probably won\u0027t use it unless I somehow have an equally nerdy friend who would spend thousands of hours in KSP with me.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhere do I sign the contract \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2022-12-11T13:43:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224207621\u0022 data-ipsquote-contentid=\u0022210976\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221670742061\u0022 data-ipsquote-userid=\u0022223493\u0022 data-ipsquote-username=\u0022Laikanaut\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Laikanaut said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think you are being sarcastic, but this statement is somewhat correct in the context of Kerbin/Mun, which is what I was referring to in that comment. If I wanted more things to do in the game in these bodies, none of these features you mentioned offer that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOf course they do. Kerbin has a much deeper gravity well so the ability to live off the land and build and fuel vessels on Minmus or in Munar orbit offers huge advantages. I usually set up fueling tankers from Minmus to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E even in KSP1 because it allows me to deliver everything to orbit dry for that exact reason. It allows much smaller launch platforms that are easier to recover on Kerbin.  Now, if you never plan on leaving KSOI then yeah there’s no real point in building infrastructure that makes going to other planets easier. But getting that big majority of players who never left the nest to branch out and explore ever deeper is one of the big goals of KSP2. \u003Cbr\u003E\n\u003Cbr\u003E\nOh and as to radiation, heat management, and LS we don’t have 100% confirmation but there is a radiation symbol in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E next to \u003Cabbr title=\u0022Center of Mass\u0022\u003E\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E\u003C/abbr\u003E and \u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E\u003C/abbr\u003E implying that its a design consideration thats worth an overlay. We’ve also been told heat is important enough for large engines that procedural radiators were worth adding. And though we don’t know what it will look like they have mentioned that food or snacks will be important to colonies and we’ve seen greenhouses in early colony renders so its likely LS will have some simple and forgiving implementation. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd granted KSP2 isn’t exactly what I would have designed if it was tailored to me and me only. Id be happy if it was a full-on factorio-esque city builder, but I know its \u003Ci\u003Enot\u003C/i\u003E just being tailored for me and there’s a good happy medium most players will enjoy without getting overwhelmed by finicky management mechanics and lets them get straight to what makes KSP special—designing and flying lego rockets. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-12-11T14:23:00Z\u0022 title=\u002212/11/2022 02:23  PM\u0022 data-short=\u00221 yr\u0022\u003EDecember 11, 2022\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}