{"TopicId":172625,"ForumId":99,"TopicTitle":"Accuracy scoring for orbits is broken?","CreatedByName":"dvader","CreatedById":184446,"CreatedDateTime":"2018-03-18T21:13:08Z","PageNum":1,"Articles":[{"CreatedByName":"dvader","CreatedById":184446,"CreatedDateTime":"2018-03-18T21:13:08Z","Content":"\n\u003Cp\u003E\nI tried to improve my score in Blue Mun but couldn\u0027t even get max score for the Kerbin Orbit. My best attempt had an inclination of 0.02 and \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E/\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E within 100km\u002B-50m. Still, when I checked the save file, I did not complete \u0022Kerbin Orbit with Precision\u0022 for 1000 pts, only \u0022Kerbin Orbit\u0022 for 500 pts.\n\u003C/p\u003E\n\u003Cp\u003E\nIn an attempt to figure out what I was doing wrong I tried to Hyperedit my orbits to get a perfect score. Still, I could not get a \u0022precision\u0022 orbit. Neither around Kerbin nor around the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nHas anyone got \u0022Orbit with Precision\u0022 anywhere? Landing accuracy seem to work but I am not sure about orbits.\n\u003C/p\u003E\n"},{"CreatedByName":"Hurzelgnurk","CreatedById":101818,"CreatedDateTime":"2018-03-19T11:23:16Z","Content":"\n\u003Cp\u003E\nI\u0027d guess there is a logic problem, if I get it right the logic checks the 85% accuracy orbit before it checks the 95% orbit so even your hyperedit couldn\u0027t get beyond that. In general this is a problem because you can\u0027t reach an exact orbit without reaching it to a certain degree below 100% before, except with hyperedit. I can not think of a logic of the top of my hat that, is possible in mission builder and would solve this without a playerintervention that idicated that he is done with his orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"StrikeEagleCC","CreatedById":186941,"CreatedDateTime":"2018-03-19T13:47:35Z","Content":"\n\u003Cp\u003E\nThe indication that the player is done with their orbital maneuver is accomplished by setting the required stability time in the specified orbit. The timer is configured by default to reset any time the ship experiences acceleration, which gives players a chance to finish their maneuvers before accuracy is checked. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m having the same issue as dvader though, orbital accuracy checking nodes docked to the orbit node do not seem to be working for me. As far as I can tell, I have never been awarded for docked accuracy tests. \n\u003C/p\u003E\n\u003Cp\u003E\nI wonder though, if this could have to do with the node connection order... I\u0027ll play around with that tonight. \n\u003C/p\u003E\n"},{"CreatedByName":"Hurzelgnurk","CreatedById":101818,"CreatedDateTime":"2018-03-19T16:10:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223327511\u0022 data-ipsquote-contentid=\u0022172625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221521467255\u0022 data-ipsquote-userid=\u0022186941\u0022 data-ipsquote-username=\u0022StrikeEagleCC\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, StrikeEagleCC said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe indication that the player is done with their orbital maneuver is accomplished by setting the required stability time in the specified orbit. The timer is configured by default to reset any time the ship experiences acceleration, which gives players a chance to finish their maneuvers before accuracy is checked.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLast try I did right from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E to save time was still burning to accurate orbit while it gave me the 85% orbit even though the node states not that it allows acceleration, so there seems to be a minimal acceleration to stop that stability measurement. Imagine you have to maybe wait a half an orbit to correct your orbit which is above 85% you had to take a stability time of about 30 minutes to allow that.\n\u003C/p\u003E\n"},{"CreatedByName":"StrikeEagleCC","CreatedById":186941,"CreatedDateTime":"2018-03-19T16:47:15Z","Content":"\n\u003Cp\u003E\nI see your point. I like this part of the challenge though, since you have to execute the launch or plan intercepts very carefully in order to set yourself up for an accurate circularization burn. Doesn\u0027t fix broken accuracy tests though.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223327418\u0022 data-ipsquote-contentid=\u0022172625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221521458596\u0022 data-ipsquote-userid=\u0022101818\u0022 data-ipsquote-username=\u0022Hurzelgnurk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Hurzelgnurk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nif I get it right the logic checks the 85% accuracy orbit before it checks the 95% orbit\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI tried using an accuracy check node with a lower precision than the orbital node, and it still wouldn\u0027t activate.\n\u003C/p\u003E\n"}]}