{"TopicId":109246,"ForumId":29,"TopicTitle":"Find all KSPFields and KSPEvents in a partmodule","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-05-14T19:26:31Z","PageNum":1,"Articles":[{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-05-14T19:26:31Z","Content":"Hi\n\nI\u0027m a little rusty after a few months away from any code, so I\u0027m looking at Visual Studio and the KSP API like a 2 year old with a Rubiks cube. Trying to find a way to get a list of the items mentioned in the title to be able to disable their visibility in gui and flight. The disabling I\u0027m fine with doing, but somewhere in the back of my mind there\u0027s a thing about BaseFields that I can\u0027t quite remember. Any pointers please?\n\nMany thanks\n\nLo-Fi"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-14T19:36:09Z","Content":"Fields and Events are collections, you can just iterate through them, yeah."},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-05-14T21:16:18Z","Content":"Thanks. Man, I\u0027m rusty with this stuff...\n\nFFR:\n\n                    foreach (BaseField k in this.Fields) // foreach (KSPField k in this.Fields) will compile, but will give invalid cast error at runtime.                {                    k.guiActive = false;                    k.guiActiveEditor = false;                }                foreach (BaseAction a in this.Actions)                {                    a.active = false;                }                foreach (BaseEvent e in this.Events)                {                    e.active = false;                }\n\ndisables tweakables - both button and slider - along with any text displays in the RCM."},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-05-15T03:39:15Z","Content":"One caution on using BaseAction.active = false is that while that hides it from the GUI, it *also* disables it.\n\nWhile not a huge difference to the player, it can be a problem from a modding perspective. If you create another way of triggering the action and so you set the BaseAction.active = false to hide it from the GUI as you don\u0027t want the same action showing twice. The issue is that now your way of triggering the action will no longer do anything because since the BaseAction is not active, it will not execute when called.\n\nI assume the same is true for Events, but I have not tested them.\n\nFor actions in your own mod under your control this is not a big deal, but if you start disabling actions in other peoples mods, that could be opening a very large can of worms.\n\nD."},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-05-16T18:04:54Z","Content":"Thanks D, that plays into my hands for what I\u0027m doing, but great to have noted down for future reference."}]}