{"TopicId":118912,"ForumId":29,"TopicTitle":"Raynos Zoid Plugin Development (Alpha Available)","CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2015-08-20T14:37:32Z","PageNum":1,"Articles":[{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2015-08-20T14:37:32Z","Content":"\n\u003Cp\u003EI\u0027m making this thread as a place of discussion and for all questions that might arise for my Raynos Zoid. I have several different ideas for this craft, and I\u0027d love to have a plugin called by the custom cockpit. A UI for the cockpit would also be super bad ass.\u003C/p\u003E\u003Cp\u003EI believe KOS can handle some of these things, but not all. I am just starting to play with it, but it is way over my head. I also think people hesitate to install that mod, so a simple plugin might be the way to go. I understand the logic of programming, but I\u0027m not great at C#. seamus0riley has been awesome helping me out so far, but we\u0027ll probably still need some assistance. \u003C/p\u003E\u003Cp\u003EIf you want to contribute or discuss any of these ideas I would love to hear from you, any contributions will of course be made clear in the release. If several people chipped in I think it could be a cool team effort, and if this goes well we could try and do the same thing for the Gundam, which is way more advanced.\u003C/p\u003E\u003Cp\u003EFeel free to suggest ideas for features as well.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uAKAecz3eAI?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003Cstrong\u003EOpen mouth when cannon is selected.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis one should be pretty simple. 0riley has a pretty good handle on BDArmory. I just need;\u003C/p\u003E\u003Cp\u003EIf Cannon selected\u003C/p\u003E\u003Cp\u003Ethen toggle animation (default take)\u003C/p\u003E\u003Cp\u003EIt would have to close when it is selected. That might be a little harder.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThrottle control for tighter turns\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIt has engines both above and below the COM. Would it be possible to get code that decreased the thrust of the top engine as long as you were holding \u0022s\u0022 to pitch up. Maybe only let it decrease to 50 or 75%, then stop. And return to 100 when \u0022s\u0022 is released. Could be toggled off in the UI.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDeactivate control surfaces at higher speeds\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAs you can see in the video, I have to disable the main wings at higher speeds to keep the craft stable, it would be nice if this happened automatically at certain speeds. Could be toggled in the UI.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVTOL takeoff\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ENow the hard stuff. I\u0027d like a button in the UI that would run a VTOL takeoff routine. Once we figure out IR controls for the F-22 plugin this should be doable. I have it down manually, but a 1 button solution would be awesome. As you can see in the video it\u0027s;\u003C/p\u003E\u003Cp\u003EEngine down, Engine on\u003C/p\u003E\u003Cp\u003EExtend wings if they aren\u0027t already\u003C/p\u003E\u003Cp\u003ELiftoff, pitch down\u003C/p\u003E\u003Cp\u003ELegs up, still pitching down\u003C/p\u003E\u003Cp\u003EAs the craft pitches up activate top engine.\u003C/p\u003E\u003Cp\u003ERotate Engine up.\u003C/p\u003E\u003Cp\u003ELanding would be a whole other story.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIn flight wing control\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAs you can see in the video there is instability when attempting high G maneuvers. Mostly with yaw loss. As the craft is pitching hard it looses yaw control, so I have to rotate the inner wings up, outer wings down. This turns the inner wings into giant yaw stabilizers. If the craft could detect when it\u0027s slipping on the x axis and rotate the wings accordingly, it would be pretty dope. Could be toggled in the UI.\u003C/p\u003E\u003Cp\u003ESo these are just ideas I\u0027m throwing out there. If you have any ideas on where to start for any of these please let me know. If you want to give it a shot let me know and I\u0027ll send you a craft. Like I said anyone who helps will get tons of credit. \u003C/p\u003E\u003Cp\u003EIf you read this far, you\u0027re a pimp. Thanks,\u003C/p\u003E\u003Cp\u003Ecb\u003C/p\u003E\u003Cp\u003EDownload: \u003C/p\u003E\u003Cp\u003EIt still needs a lot of tuning, but all the robotics/key components are included if you want to try coding them.\u003C/p\u003E\u003Cp\u003EMODs\u003C/p\u003E\u003Cp\u003EInfernal robotics remake\u003C/p\u003E\u003Cp\u003ETweakscale\u003C/p\u003E\u003Cp\u003EBD armory\u003C/p\u003E\u003Cp\u003EIncluded Cb_co folder\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/g7tlibxgy2tgcsh/%5Bcb_co%5D_Raynos_MRK_VI_-_VTOL.zip\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EAlpha\u003C/strong\u003E MRK IV - VTOL Download\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-22T03:09:59Z\u0022 title=\u002209/22/2015 03:09  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 22, 2015\u003C/time\u003E by clown_baby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2015-08-25T00:26:28Z","Content":"\n\u003Cp\u003EAdded the alpha .craft to try and spark some interest\u003C/p\u003E\n"}]}