{"TopicId":12190,"ForumId":29,"TopicTitle":"Can you do that?","CreatedByName":"teimaninja","CreatedById":20814,"CreatedDateTime":"2012-06-06T11:31:21Z","PageNum":1,"Articles":[{"CreatedByName":"teimaninja","CreatedById":20814,"CreatedDateTime":"2012-06-06T11:31:21Z","Content":"\n\u003Cp\u003EHey guys \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was wondering if it\\\u0027s possible (so far) for \u0027non dev\u0027 to create new buildings, \u003C/p\u003E\u003Cp\u003Ea working currency system, an in game permissions system, mod game files \u003C/p\u003E\u003Cp\u003Eor just to create anything besides parts?\u003C/p\u003E\u003Cp\u003Ei\\\u0027m sorry for spelling or grammar mistakes (English isn\\\u0027t my first language)\u003C/p\u003E\u003Cp\u003Eone last thing I just love this game#!@#!@ (Amazing community and dev team \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\u003Cp\u003EP.S. I\\\u0027m only asking because I SUCK at modeling (blender and such...) but a decent c# programmer.\u003C/p\u003E\n"},{"CreatedByName":"Romfarer","CreatedById":20387,"CreatedDateTime":"2012-06-06T12:12:56Z","Content":"\n\u003Cp\u003EYes on all accounts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Foamy","CreatedById":608,"CreatedDateTime":"2012-06-06T12:17:43Z","Content":"\n\u003Cp\u003EWhat? No, you can\\\u0027t do any of that yet, at the moment all you can do is the parts and plugins. The plugins are tied closely to parts and their behaviour although some more advanced stuff is possible.\u003C/p\u003E\n"},{"CreatedByName":"Romfarer","CreatedById":20387,"CreatedDateTime":"2012-06-06T13:08:33Z","Content":"\n\u003Cp\u003EGenerally speaking you can do almost anything in KSP. You get access to the Unity package which allows you to do A LOT of fancy stuff. Even if something in KSP is directly blocking you from doing something, you CAN program it from scratch over again in your plugin. I completely fail to see what is not possible. Please list concrete examples.\u003C/p\u003E\n"},{"CreatedByName":"teimaninja","CreatedById":20814,"CreatedDateTime":"2012-06-06T13:59:46Z","Content":"\n\u003Cp\u003ELet me rephrase i meant if can you create, for example a system which forces the player to complete a set of missions in order to reach other planets, with the current development kit release.\u003C/p\u003E\n"},{"CreatedByName":"Romfarer","CreatedById":20387,"CreatedDateTime":"2012-06-06T14:24:02Z","Content":"\n\u003Cp\u003EIt should be possible. However, (maybe this is what Foamy meant) you have to require that your users use a certain part, maybe a custom pod, on their ships. Then it\\\u0027s \u0027just\u0027 a matter of implementing your own economy system in your part and limit what parts users can put on their vessels. It is possible to create buildings too if you use the Unity package. That said it will not be easy and you need to have quite a lot of programming experience to pull something like that off.\u003C/p\u003E\n"},{"CreatedByName":"teimaninja","CreatedById":20814,"CreatedDateTime":"2012-06-06T15:12:36Z","Content":"\n\u003Cp\u003EFirst of all thank you very much for the help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESecondly I don\\\u0027t think I have ALOT of programming experience in the Unity Engine, I\\\u0027m very new to the KSP modding section,\u003C/p\u003E\u003Cp\u003EI do have 6 years worth of C# knowledge (University \u002B Technical High Schools) so I was hopping that the transition won\\\u0027t be that hard (I was wrong there aren\\\u0027t as many guides out there as I hoped:( ).\u003C/p\u003E\u003Cp\u003EAny way I have about 3 months of free time so i\\\u0027ll do my best to study the engine (by trial and error)\u003C/p\u003E\n"},{"CreatedByName":"Romfarer","CreatedById":20387,"CreatedDateTime":"2012-06-06T15:32:05Z","Content":"\n\u003Cp\u003EPersonally i use the Unity libraries a lot more than i use the KSP libraries, this is because they are a lot better documented. I use \u003Ca href=\u0022http://unity3d.com/support/documentation/ScriptReference/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://unity3d.com/support/documentation/ScriptReference/\u003C/a\u003E a lot. \u003C/p\u003E\n"}]}