{"TopicId":167675,"ForumId":29,"TopicTitle":"How do i make a part that a kerbal on EVA can use to control a craft?","CreatedByName":"Jeb-head-mug kerman","CreatedById":159289,"CreatedDateTime":"2017-11-19T02:21:01Z","PageNum":1,"Articles":[{"CreatedByName":"Jeb-head-mug kerman","CreatedById":159289,"CreatedDateTime":"2017-11-19T02:21:01Z","Content":"\n\u003Cp\u003E\nI have not been on the forum for a loooooong time but now i am  making a new mod and i don\u0027t know how to make a certain part. \n\u003C/p\u003E\n\u003Cp\u003E\nI need to make a part for a kerbal on EVA and that with that part a kerbal could control a craft within a certain range. I would use the kerbal inventory system. I have already designed the part but now i am stuck on the coding bit.\n\u003C/p\u003E\n\u003Cp\u003E\nAny help would be much apreciated.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-19T09:53:39Z\u0022 title=\u002211/19/2017 09:53  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 19, 2017\u003C/time\u003E by Jeb-head-mug kerman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceMouse","CreatedById":126931,"CreatedDateTime":"2017-11-19T14:00:27Z","Content":"\n\u003Cp\u003E\nI don\u0027t know much about plugins but, that sounds like just putting a remote and antenna on said ship would accomplish the goal just as well.\n\u003C/p\u003E\n"},{"CreatedByName":"Urses","CreatedById":175990,"CreatedDateTime":"2017-11-19T14:12:49Z","Content":"\n\u003Cp\u003E\nIt looks like you need the prob Control point enabled on your remote. With 1 Pilot defined as single hop only.\n\u003C/p\u003E\n\u003Cp\u003E\nAs i am rusty on programming i would advise that you look in modes that have own CommandPods to see how it will be defined for a part?\n\u003C/p\u003E\n"},{"CreatedByName":"Jeb-head-mug kerman","CreatedById":159289,"CreatedDateTime":"2017-11-20T22:59:39Z","Content":"\n\u003Cp\u003E\nI dont really understand. I have already designed the part but it currently does nothing. I just need the code to make it control other ships. The procedure should be something like this: i lanch a plane next to the runway. I get a kerbal to go on EVA near the plane. The kerbal gets the remote control and using \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E. I press shift while still with the kerbal. I have control of the plane while on EVA. So thats how kt should go.\n\u003C/p\u003E\n"}]}