{"TopicId":172836,"ForumId":29,"TopicTitle":"let\u0027s talk about joints","CreatedByName":"Rudolf Meier","CreatedById":176740,"CreatedDateTime":"2018-03-22T18:49:30Z","PageNum":1,"Articles":[{"CreatedByName":"Rudolf Meier","CreatedById":176740,"CreatedDateTime":"2018-03-22T18:49:30Z","Content":"\n\u003Cp\u003E\nhi\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t understand those joints.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, I do have this situation: root -\u0026gt; ... something -\u0026gt; truss -\u0026gt; FL-R10 \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Fuel Tank (0.1 t) -\u0026gt; Extendatron Basic (0.2 t) -\u0026gt; Extendatron Stackable (0.15 t) -\u0026gt; something -\u0026gt; massive heavy tank\n\u003C/p\u003E\n\u003Cp\u003E\nThe Extendatrons are horizontaly attached. Now, the first joint is massively bended and unstable, while the second one is strong like hell (but both use the same force/spring/whatever values).\n\u003C/p\u003E\n\u003Cp\u003E\nFine... this can be explained with the \u0022lower mass == weaker\u0022. But: is it just the relation of those masses or is it the absolute mass as well that\u0027s influencing the strength?? ... and what I don\u0027t understand: why is the rigidBody.mass 1 for both parts? and... which mass is now the relevant one? how can I find it? (I need it, if I want to set the new \u0022massScale\u0022 correctly)\n\u003C/p\u003E\n\u003Cp\u003E\nAnd... massScale... does it help, to set massScale and connectedMassScale to let\u0027s say 10 ? or is just the relation between those masses interesting?\n\u003C/p\u003E\n\u003Cp\u003E\n... do further child/parent objects of the 2 connected object also have an influence on the joint?\n\u003C/p\u003E\n\u003Cp\u003E\nWould be nice if we could answer some questions about joints, now that we got a new Unity version.\n\u003C/p\u003E\n"},{"CreatedByName":"Rudolf Meier","CreatedById":176740,"CreatedDateTime":"2018-03-22T19:37:08Z","Content":"\n\u003Cp\u003E\noh... now I see why all masses are 1 ... they seem to initialize only after a while... I don\u0027t know until which event I need to wait, but after that they\u0027re much more like expected... *hmm* very interesting...\n\u003C/p\u003E\n"},{"CreatedByName":"Rudolf Meier","CreatedById":176740,"CreatedDateTime":"2018-03-22T20:18:13Z","Content":"\n\u003Cp\u003E\nI made some experiments now... when I make the connection between the tank and the extendatron 15 times stronger (as if the mass would be 1:10), then it is as strong as those between the Extendatron and Extendatron Stackable (without modification of this joint) ... I don\u0027t see the reason for it... or a pattern behind this logic... maybe someone has an idea for a good experiment to find out what\u0027s going on here? ... for the moment it\u0027s fine for me, I can continue my work... it\u0027s just... I\u0027ve no idea how to explain what I see and maybe this info would also help others in the future\n\u003C/p\u003E\n"},{"CreatedByName":"adriangm44","CreatedById":204917,"CreatedDateTime":"2022-11-28T12:40:49Z","Content":"\n\u003Cp\u003E\nSo, does it help to change the value of connectedMassScale up to 10?\n\u003C/p\u003E\n"}]}