{"TopicId":181376,"ForumId":29,"TopicTitle":"UIPartActionWindow questions/problems","CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2019-01-14T13:58:10Z","PageNum":1,"Articles":[{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2019-01-14T13:58:10Z","Content":"\n\u003Cp\u003E\nSo, I\u0027ve got a mod that touches content that involves the part action window.  Works great... except that I\u0027m in the process of trying to add a new feature, that apparently is tickling UIPartActionWindow in some way that it doesn\u0027t like, resulting in NRE spew.  I\u0027ve been going round in circles trying to figure out, 1. what it wants, or even 2. how to \u003Cem\u003E\u003Cu\u003Efigure out\u003C/u\u003E\u003C/em\u003E what it wants.  Was wondering if anyone here might have any advice.\n\u003C/p\u003E\n\u003Cp\u003E\nMy mod, SimpleFuelSwitch, is a pretty basic one that just swaps out resources in the editor (e.g. you can toggle a fuel tank between \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E and \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E-only, that sort of thing).  Mod thread is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/181274-16x-simplefuelswitch-v102-toggle-tanks-fuel-type-in-the-editor-simple-and-lightweight/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E, source code is \u003Ca href=\u0022https://github.com/KSPSnark/SimpleFuelSwitch\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.  The specific source file where I do the resource switching is \u003Ca href=\u0022https://github.com/KSPSnark/SimpleFuelSwitch/blob/master/src/ModuleSimpleFuelSwitch.cs\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cem\u003E\u003Cu\u003Ecurrently released\u003C/u\u003E\u003C/em\u003E functionality-- which works just fine-- involves the user clicking a button in the PAW, while the PAW is displayed.  No problems.  I\u0027m in the process of trying to add a new feature that would involve doing the same resource switching via another (simple) mechanism, the only difference being that it happens while the PAW is \u003Cem\u003E\u003Cu\u003Enot\u003C/u\u003E\u003C/em\u003E displayed.  But other than that-- it\u0027s calling the same code to do the switch, it\u0027s calling the same refresh-and-update-things-afterwards.  And yet, for reasons I have been unable to determine, it works fine in case A (published version) but not in case B (the feature I\u0027m working on).\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s what I do to swap out resources:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nCall \u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003Epart.Resources.Clear()\u003C/span\u003E, followed by calling \u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003Epart.Resources.Add(resource)\u003C/span\u003E for each of the resources I\u0027m setting up.  Ditto process with \u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003Epart.SimulationResources\u003C/span\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nGet the UIPartActionWindow for the part, and set \u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003EdisplayDirty = true\u003C/span\u003E.  (Needed so that it will redraw itself with the correct resources.)\n\u003C/li\u003E\n\u003Cli\u003E\nFire \u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003EGameEvents.onEditorShipModified.Fire(EditorLogic.fetch.ship)\u003C/span\u003E so that other KSP UI elements (such as engineer\u0027s report) will update themselves.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nWhen I do the above sequence of events \u003Cem\u003E\u003Cu\u003Ewhile the PAW is up\u003C/u\u003E\u003C/em\u003E (as a result of clicking a PAW button), everything works perfectly and no problems.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, when I do the \u003Cem\u003E\u003Cu\u003Eexact same operations\u003C/u\u003E\u003C/em\u003E, but happen to do it via another logic path while the PAW happens \u003Cem\u003E\u003Cu\u003Enot\u003C/u\u003E\u003C/em\u003E to be currently displayed... then it \u0022mostly\u0022 works, but fails in one very specific case:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWorks fine if I add a part with no symmetry.\n\u003C/li\u003E\n\u003Cli\u003E\nWorks fine if I add a part \u003Cem\u003E\u003Cu\u003Ewith\u003C/u\u003E\u003C/em\u003E symmetry.\n\u003C/li\u003E\n\u003Cli\u003E\nWorks fine if I add a part \u003Cem\u003E\u003Cu\u003Ewith\u003C/u\u003E\u003C/em\u003E symmetry, and I then add an alt-click copy of it (also with symmetry), as long as I haven\u0027t changed the resources from the default.\n\u003C/li\u003E\n\u003Cli\u003E\nBut if I switch the resources, \u003Cem\u003E\u003Cu\u003Eand\u003C/u\u003E\u003C/em\u003E have the part as part of a symmetry group, \u003Cem\u003E\u003Cu\u003Eand\u003C/u\u003E\u003C/em\u003E I make an alt-click symmetrical copy... then right-clicking the part doesn\u0027t bring up the PAW, but instead results in endless NRE spam.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThe NRE I\u0027m seeing looks like this:\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\n[EXC 17:32:11.181] NullReferenceException: Object reference not set to an instance of an object\n\tUIPartActionResourceItem.SetSymCounterpartsAmount (Double amount)\n\tUIPartActionResourceEditor.onSliderChangeProcess ()\n\tUIPartActionResourceEditor.Setup (.UIPartActionWindow window, .Part part, UI_Scene scene, .UI_Control control, .PartResource resource)\n\tUIPartActionWindow.AddResourceEditorControl (.PartResource r)\n\tUIPartActionWindow.SetupResourceControls (.PartResource r, Boolean clearFirst, UI_Scene scene, System.Int32\u0026amp; controlIndex)\n\tUIPartActionWindow.CreatePartList (Boolean clearFirst)\n\tUIPartActionWindow.UpdateWindow ()\n\tUIPartActionController.UpdateActiveWindows ()\n\tUIPartActionController.UpdateEditor ()\n\tUIPartActionController.Update ()\n\u003C/pre\u003E\n\u003Cp\u003E\nBefore posting here, I did a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/search/\u0026amp;q=UIPartActionWindow\u0026amp;search_and_or=or\u0022 rel=\u0022\u0022\u003Eforum search for UIPartActionWindow\u003C/a\u003E.  There were references in several places... and a lot of them featured NREs with a call stack looking exactly like the above, in posts going back as far as 2014.  So I gather that this \u003Cem\u003E\u003Cu\u003Eparticular\u003C/u\u003E\u003C/em\u003E error isn\u0027t super informative, it\u0027s kind of the PAW\u0027s default go-to \u0022barf symptom\u0022 whenever it\u0027s unhappy about something.  Unfortunately... none of those places were doing the same exact thing that I\u0027m doing, nor was I able to find what \u003Cem\u003E\u003Cu\u003Esolution\u003C/u\u003E\u003C/em\u003E people had for them (even if their solution were relevant to me, which it might not be).\n\u003C/p\u003E\n\u003Cp\u003E\nAnyone have any ideas about anything I could try?  I\u0027ve been trial-and-error poking at everything I can think of, and haven\u0027t gotten anywhere.\n\u003C/p\u003E\n\u003Cp\u003E\nOn a related note:  Gosh, it sure would be nice if there were some event hook for \u0022We\u0027re about to display the PAW\u0022.  Is there one?  The only GameEvents events I\u0027ve been able to find that appear to be PAW related are onPartActionUICreate and onPartActionUIDismiss.  I thought the former looked promising... except when I try to use it, I find that it\u0027s called on \u003Cem\u003E\u003Cu\u003Eevery single update frame\u003C/u\u003E\u003C/em\u003E as long as the PAW is visible.  I was hoping for something that would fire \u003Cem\u003E\u003Cu\u003Eonce\u003C/u\u003E\u003C/em\u003E, when the PAW is displayed, rather than every-frame-continuously while it\u0027s up.  Any ideas?\n\u003C/p\u003E\n\u003Cp\u003E\n(Incidentally, a bit of experimental logging inserted in GameEvents.onPartActionUICreate shows that when I trigger the NRE, I see that onPartActionUICreate gets called right before each NRE is emitted.  So, presumably if I could figure out \u003Cu\u003E\u003Cem\u003Ewhat\u003C/em\u003E\u003C/u\u003E the PAW is unhappy about, I could put code in my onPartActionUICreate handler to placate it, though I\u0027d need to kludge together some logic to make it do it just once and not on every single frame.)\n\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2019-01-14T16:46:48Z","Content":"\n\u003Cp\u003E\nI don\u0027t know what would be causing all those problems. But if you are looking for a way to be notified whenever a PAW is generated then you can let Unity\u0027s magic methods and serialization work for you, for once.\n\u003C/p\u003E\n\u003Cp\u003E\nFind the prefab of the PAW window, attach a simple MonoBehaviour to it with an Awake method, then trigger your own event when that Awake method is run. Then the next time KSP opens a PAW, it will find that prefab, make a clone of it along with the script you attached, then call the Awake methods for all scripts active on that clone.\n\u003C/p\u003E\n\u003Cp\u003E\nI do this in SEP to add some fields to the PAW when on EVA:\n\u003C/p\u003E\n\u003Cp\u003E\nFinding the prefab (you might want some logic to make sure everything is not null when this happens, and that you only do it once): \u003Ca href=\u0022https://github.com/CobaltWolf/Surface-Experiment-Pack/blob/master/Source/SEPScience/SEP_Utilities.cs#L131-L142\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/CobaltWolf/Surface-Experiment-Pack/blob/master/Source/SEPScience/SEP_Utilities.cs#L131-L142\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe script being added to the prefab: \u003Ca href=\u0022https://github.com/CobaltWolf/Surface-Experiment-Pack/blob/master/Source/SEPScience/SEP_UIWindow.cs\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/CobaltWolf/Surface-Experiment-Pack/blob/master/Source/SEPScience/SEP_UIWindow.cs\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe event being called in the Awake method: \u003Ca href=\u0022https://github.com/CobaltWolf/Surface-Experiment-Pack/blob/master/Source/SEPScience/SEP_Utilities.cs#L47-L48\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/CobaltWolf/Surface-Experiment-Pack/blob/master/Source/SEPScience/SEP_Utilities.cs#L47-L48\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-14T16:47:31Z\u0022 title=\u002201/14/2019 04:47  PM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 14, 2019\u003C/time\u003E by DMagic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2019-01-14T17:20:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223522045\u0022 data-ipsquote-contentid=\u0022181376\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221547484408\u0022 data-ipsquote-userid=\u002257416\u0022 data-ipsquote-username=\u0022DMagic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, DMagic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t know what would be causing all those problems. But if you are looking for a way to be notified whenever a PAW is generated then you can let Unity\u0027s magic methods and serialization work for you, for once.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you!\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately... it\u0027s not clear to me that that would actually help me, in this case.  \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E  Based on additional kludging, logging, trial-and-error in my code, coupled with looking at the NRE stack trace that\u0027s all I have to go on, here\u0027s what I believe is happening:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nA certain amount of setup happens in KSP when the PAW is popped up.\n\u003C/li\u003E\n\u003Cli\u003E\nDuring that setup, onUIPartActionCreate gets called.  (It gets called on every frame, but with a bit of jury-rigging I can insert my own code either for on-every-iteration or for just-the-first-time.  Some things that I can verify at this time:\n\u003Cul\u003E\u003Cli\u003E\nThe part has exactly the resources that I think it does (i.e. set up based on my code).\n\u003C/li\u003E\n\u003Cli\u003E\nThe part\u0027s symmetry counterparts also have exactly the same resources as the part itself.\n\u003C/li\u003E\n\u003Cli\u003E\nI can retrieve the UIPartActionWindow for the PAW at this point. If I query its status, it has isValid = false, and no resources.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nAfter calling onUIPartActionCreate, this setup code tries to set up any resource controls that the PAW has.\n\u003C/li\u003E\n\u003Cli\u003E\nAs part of setting that up, it tries to talk to symmetry counterparts.\n\u003C/li\u003E\n\u003Cli\u003E\nNRE, presumably because it thinks that the resources on the counterpart somehow don\u0027t line up with the resources on the part where the PAW is being popped up.\n\u003Cul\u003E\u003Cli\u003E\nNote that the symmetry counterparts\u0027 resources \u003Cem\u003E\u003Cu\u003Eare\u003C/u\u003E\u003C/em\u003E, in fact, identical with the part being processed, which I can verify in step 2 above.\n\u003C/li\u003E\n\u003Cli\u003E\nSo, I have no idea what the heck is going wrong.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nIn other words:  either there\u0027s some flaw in the logic of UIPartActionWindow \u003Cem\u003E\u003Cu\u003Eitself\u003C/u\u003E\u003C/em\u003E, or else there\u0027s something wrong in the way I\u0027m setting things up (though I can\u0027t imagine what that could be, since I\u0027m doing exactly the same steps for \u003Cem\u003E\u003Cu\u003Ethis\u003C/u\u003E\u003C/em\u003E control path as I do in another control path that\u0027s proven to work, the only difference being whether the PAW is on-display or not when I make the change).\n\u003C/p\u003E\n\u003Cp\u003E\nHooking onto the PAW at initial generation time wouldn\u0027t help me, I think, because whatever-it-is is going off the rails \u003Cem\u003E\u003Cu\u003Eafter\u003C/u\u003E\u003C/em\u003E the place I\u0027ve already hooked in (at onUIPartActionCreate) time.  Hooking \u003Cem\u003E\u003Cu\u003Eearlier\u003C/u\u003E\u003C/em\u003E wouldn\u0027t help me, I think, unless I\u0027m missing something.\n\u003C/p\u003E\n"},{"CreatedByName":"JPLRepo","CreatedById":114736,"CreatedDateTime":"2019-01-15T03:11:02Z","Content":"\n\u003Cp\u003E\nWhat\u0027s being missed is the Resources is a collection dictionary.. and your mod is changing the resource definition. which I think is exposing a bug (which can only occur if a mod changes the resources on a part). It looks like the collection dictionary key is incorrectly set to the old Resource hash instead of the new Resource hash. - Probably due to the fact that in stock - this never changes when instantiating a copy of a part.\u003Cbr\u003E\nI\u0027d recommend resetting the Resources list after any part copied events in the Editor scene would resolve the issue.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2019-01-15T21:50:46Z","Content":"\n\u003Cp\u003E\nExcellent, thank you!  This was the missing piece.  After a bit of tinkering, I was able to get things to work the way I need them to.\n\u003C/p\u003E\n"}]}