{"TopicId":58875,"ForumId":29,"TopicTitle":"I\u0026#039;m thinking about making a mod but don\u0026#039;t know how to code or anything with mods.","CreatedByName":"ThatKerbal","CreatedById":98809,"CreatedDateTime":"2014-01-04T20:49:45Z","PageNum":1,"Articles":[{"CreatedByName":"ThatKerbal","CreatedById":98809,"CreatedDateTime":"2014-01-04T20:49:45Z","Content":"\n\u003Cp\u003EI\u0027ve been thinking about making a mod, But i don\u0027t know how to code or ANYTHING about mods. Just when you download them put them in the gamedata folder:).\u003C/p\u003E\u003Cp\u003EMy idea was:\u003C/p\u003E\u003Cp\u003EThe mod would make it where you could Make a ship that can hold multiple parts and you can build ships inside space. It would be ideal for people who don\u0027t know how to make a refueling/docking/space station. It may be a bit of a hassle, But you could send up ships with the parts, A new storage part would be added and a interface, When you put the part on the ship the interface automatically pops up Making it where you select what parts you want to bring like you would put parts on a ship, Except your dragging the part into the interface. Then you could send up a ship with the parts and then EVA And then a key would be mapped that brings up the interface again where you select what parts you want. Or if you don\u0027t want to EVA, A special docking part would be added, That when you dock it with any other clamp o tron or the new one added, The interface would come up and you\u0027d select the parts and do like you would in the VAB. click and drag where you want it to go. And the storage interface would have no storage limit. so if you plan on completing the station in one try, Then you could put all the parts needed. If you forget the struts they would automatically be put in. It\u0027s just a little idea i thought of and i thought it would really help people when they have alot weight, this can make them not have to worry about as much weight and struts. So i hope this is a good idea i sure thought so, If it\u0027s a dumb idea don\u0027t be afraid to tell me (lol).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-04T21:55:33Z\u0022 title=\u002201/04/2014 09:55  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 4, 2014\u003C/time\u003E by ThatKerbal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-01-04T21:20:28Z","Content":"\n\u003Cp\u003EWhy don\u0027t you explain your idea more fully? Then maybe someone will be interested enough to start work on it with you. Many good mods start with a nice idea.\u003C/p\u003E\n"},{"CreatedByName":"ThatKerbal","CreatedById":98809,"CreatedDateTime":"2014-01-04T21:41:11Z","Content":"\n\u003Cp\u003EOkay, i\u0027ll edit.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-01-05T18:55:03Z","Content":"\n\u003Cp\u003EThis sounds somewhat like the Orbital Construction mod. Have you looked into that?\u003C/p\u003E\n"},{"CreatedByName":"ThatKerbal","CreatedById":98809,"CreatedDateTime":"2014-01-05T18:55:56Z","Content":"\n\u003Cp\u003EI never heard of that mod. But i guess so lol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DiEvAl","CreatedById":66247,"CreatedDateTime":"2014-01-07T08:36:02Z","Content":"\n\u003Cp\u003EThis sound like some combination of orbital construction, extraplanetary launchpads, and kerbal attachment system.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-01-07T08:43:39Z","Content":"\n\u003Cp\u003ENote: Extraplanetary Launchpads now has orbital construction so the Orbital Construction mod is not needed. Compare them and see which you prefer but as you\u0027re installing Extraplanetary Launchpads anyway, if you want to keep things simplest I\u0027d just use that.\u003C/p\u003E\n"}]}