{"TopicId":59968,"ForumId":29,"TopicTitle":"Help With DockPort Plugin","CreatedByName":"owensm0132","CreatedById":100958,"CreatedDateTime":"2014-01-14T17:53:43Z","PageNum":1,"Articles":[{"CreatedByName":"owensm0132","CreatedById":100958,"CreatedDateTime":"2014-01-14T17:53:43Z","Content":"\n\u003Cp\u003EOK, I am a noob to ksp plugin development but not to c# or programming in general. I have read and searched many locations and even looked at other plugin\u0027s code. But nothing is clear enough to get me going in the right direction.\u003C/p\u003E\u003Cp\u003EGoal: I want to create a new docking port. Why- because I love the game and I love programming. I have tried the plugin from NavyFish but I want something a little different. It is just for my personal enjoyment.\u003C/p\u003E\u003Cp\u003EProgress: From what I understand, you can create a new kind of part by inheriting from the Parts class and (I guess) associating the code with a cfg via the module name parameter. I have not done this because I believe I what I need to do is modify the behavior of an existing part by inheriting from the PartModule class and associating that with a docking port cfg (via copy and past into new plugin folder and changing the name). I have tried this and it seems to not complain but the new part does not dock. I am not overriding anything except onAwake but even then I am just logging a string debug console and calling base.onAwake.\u003C/p\u003E\u003Cp\u003EYes, I have followed the tutorial (\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Creating_your_first_module\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Creating_your_first_module\u003C/a\u003E) but these parts mods don\u0027t do anything like dock 2 ships together.\u003C/p\u003E\u003Cp\u003EAny help will be appreciated as I cannot find any reasonable collection of api documentation.\u003C/p\u003E\u003Cp\u003EMark Owens\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-01-14T18:47:31Z","Content":"\n\u003Cp\u003EYou\u0027ll want to inherit from PartModule, what you want to create is a new partmodule for your part. If you simply want to create a new part, that would be through modelling.\u003C/p\u003E\n"},{"CreatedByName":"owensm0132","CreatedById":100958,"CreatedDateTime":"2014-01-14T21:48:19Z","Content":"\n\u003Cp\u003Eok, I guess my question then is, how do I dock two ships so they become one in the code like the dockingport module already does. Or even better, how do add the the existing functionality of a dockingport? \u003C/p\u003E\u003Cp\u003EThat is, if I implement PartModule I have to provide all the code to handle docking to ships together - I do not know the API required for that. Or, maybe I can just implement DockingPort?? But I tried this by associating with a cfg like you would for a PartModule but to now avail. I clearly am stumbling around in the dark.\u003C/p\u003E\n"},{"CreatedByName":"owensm0132","CreatedById":100958,"CreatedDateTime":"2014-01-15T01:20:01Z","Content":"\n\u003Cp\u003EI think I got it. I found ModuleDockingNode class! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E public class mydockingpart : ModuleDockingNode\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E ...\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003EIt works!!! It has all the default features of a docking port plus whatever I add to it!\u003C/p\u003E\u003Cp\u003EThe following link was the clue for me;\u003C/p\u003E\u003Cp\u003E \u003Ca href=\u0022https://github.com/Anatid/XML-Documentation-for-the-KSP-API/blob/master/DockingPort.cs\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Anatid/XML-Documentation-for-the-KSP-API/blob/master/DockingPort.cs\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"bungee-","CreatedById":65148,"CreatedDateTime":"2014-03-21T21:40:21Z","Content":"\n\u003Cp\u003ECan anybody tell me if it is possible to add functionality to existing stock Docking ports. Like plugin that would extend the built-in parts? Or I have to create parts and add the functionality I wish?\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-03-21T22:00:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bungee-\u0022 data-cite=\u0022bungee-\u0022\u003E\u003Cdiv\u003ECan anybody tell me if it is possible to add functionality to existing stock Docking ports. Like plugin that would extend the built-in parts? Or I have to create parts and add the functionality I wish?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot that I know of. Simply add your own PartModule to the parts by using MM.\u003C/p\u003E\n"}]}