{"TopicId":66915,"ForumId":29,"TopicTitle":"Partmodule OnSave/Load timing vs. scene existence","CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2014-03-27T13:55:37Z","PageNum":1,"Articles":[{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2014-03-27T13:55:37Z","Content":"\n\u003Cp\u003EAlright, I have a somewhat nebulous problem I\u0027ve been struggling with for a few days.\u003C/p\u003E\u003Cp\u003EThis has to do with saving data to a part module from code that runs in a scene.\u003C/p\u003E\u003Cp\u003EThis is for the action groups mod I am trying to finalize but I\u0027m seeing two symptoms that I can\u0027t nail down the cause for.\u003C/p\u003E\u003Cp\u003E1) Action groups just vanish. Sometimes my test vessel will lose a configured action, but only one. It has 10 actions configured, I\u0027m come back to in later and there is now only 9 actions configured.\u003C/p\u003E\u003Cp\u003E2) Random null refs. I\u0027ll do something 4 times and it works fine, the 5th causes a null ref error. I reload without changing a thing and everything works fine again. \u003C/p\u003E\u003Cp\u003EHaving banged my head against this wall for too long, my best guess is that I\u0027m running into issues where the Partmodule OnSave/OnLoad runs on it\u0027s own time and not limited by the Scene in anyway.\u003C/p\u003E\u003Cp\u003EAll my code for actually doing stuff runs in my KSPAddon.Startup.Flight (or .EditorAny), I\u0027m just using the Partmodule (and its OnSave/OnLoad) for data storage.\u003C/p\u003E\u003Cp\u003ESo my best guess is that most of the time, my code in KSPAddon.Flight OnStart runs before the PartModule\u0027s OnLoad so the data transfers correctly, but every so often this happens the other way around and I \u0027lose\u0027 data because the OnLoad runs before my Flight Scene OnStart code.\u003C/p\u003E\u003Cp\u003EWhen I started this, I understand that code runs sequentially, so I wrote the version I am currently struggling with under the assumption that my Flight Scene OnStart code would \u003Cem\u003Ealways\u003C/em\u003E execute before any Partmodule\u0027s OnLoad would, but it is starting to look like that is not the case.\u003C/p\u003E\u003Cp\u003EDoes anyone have experience with something similar that they could offer me advice?\u003C/p\u003E\u003Cp\u003EI\u0027m starting to fear I\u0027m going to have to break my code up and have only the GUI running in KSPAddon.Flight and all my calculations running in the PartModule\u0027s code.\u003C/p\u003E\u003Cp\u003EThoughts?\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-03-27T15:04:16Z","Content":"\n\u003Cp\u003EDoes it always run OnSave/OnLoad, even when you are first launching from inside the VAB/SPH? I\u0027ve never really checked, but I\u0027m assuming it does.\u003C/p\u003E\u003Cp\u003EI had some issues with the both OnSave and OnLoad being called every time you load, it was screwing up some confignodes. Just using debug printout I saw that OnSave was always being called after OnLoad, usually separated by quite a bit of other entries. I didn\u0027t pay attention to OnStart, but I\u0027m fairly sure it was always being called before OnSave. \u003C/p\u003E\u003Cp\u003ESo maybe, if you only need to run something once, you could do it in OnUpdate, and put a bool check on the code. Set the bool to true in OnSave (which should be happening long after everything else), then set it to false after everything in OnUpdate runs. Would that work, or would that cause issues later on with OnSave when you\u0027re actually saving? Or maybe set the bool to true in the KSPAddon OnStart.\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2014-03-27T15:26:05Z","Content":"\n\u003Cp\u003EWhat I think I\u0027m going to have to do is make an OkayToSave bool that is set true once everything is loaded, then error trap the Partmodule\u0027s OnSave so that if OkayToSave is false, the OnSave code does not run.\u003C/p\u003E\u003Cp\u003EI\u0027m actually trying to do this with my current setup of the code running in the Flight OnStart and it does work most of the time.\u003C/p\u003E\u003Cp\u003EI\u0027m starting to think that my data storage strategy is simply flawed. I originally started with no code at all in the PartModule, it was simply 2 strings for data storage and everything, including save/load, would happen in the Flight (or Editor) module.\u003C/p\u003E\u003Cp\u003EThen once I got into it and realized I needed the automatic save that the PartModule\u0027s OnSave grants, I move some of my save/load code to the PartModule, but some stayed in the Flight Module. This is the disconnect I think is causing my problems, the save/load code being split into two different places.\u003C/p\u003E\u003Cp\u003EI think I need to go all the way and move all the save/load code to the PartModule and have the Flight Module code be only the GUI, calling data from the PartModules as needed.\u003C/p\u003E\u003Cp\u003EI don\u0027t want to do this as I am yet again tearing apart pretty much then entire backend of my mod, but I simply can\u0027t get my current setup stable enough to release.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-03-27T22:36:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003EWhen I started this, I understand that code runs sequentially, so I wrote the version I am currently struggling with under the assumption that my Flight Scene OnStart code would always execute before any Partmodule\u0027s OnLoad would, but it is starting to look like that is not the case.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe PartModule Save/load code will run sequentially but you can\u0027t count on the vessel being loaded on the first frame. Putting all your save/load code in one place is the way to go regardless, in my opinion.\u003C/p\u003E\u003Cp\u003EThere\u0027s also FlightGlobals.ready that you can check before messing with the vessel\u003C/p\u003E\n"}]}