{"TopicId":72695,"ForumId":29,"TopicTitle":"How do I find out which fonts KSP already has available?","CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-05-18T07:05:09Z","PageNum":1,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-05-18T07:05:09Z","Content":"\n\u003Cp\u003EWhen I first started making some code for a plugin I had no idea what fonts KSP had already available without me installing my own with the plugin, and I picked \u0022Arial\u0022 purely as an utter guess, figuring if it has anything it probably has at least that. It worked.\u003C/p\u003E\u003Cp\u003EBut now I\u0027d like to see what other fonts it may have before I start thinking about going out and installing one of my own. And I have no idea how to find out.\u003C/p\u003E\u003Cp\u003EI\u0027m thinking of making a Unity GUI.TextArea widget for the purpose of editing code for kOS. Since it\u0027s for displaying program code a fixed-width font would be ideal. If I had to I could try coercing a proportional font to behave like a fixed width font by setting the GUIStyle\u0027s fixedWidth and fixedHeight fields and seeing if that will work. But I suspect the result will look quite bad, as it usually does when trying to do that with a proportional font.\u003C/p\u003E\u003Cp\u003EThe kOS plugin uses a c-64 like font but it does it as raw bitmap textures it\u0027s pasting directly onto the screen. I doubt that would let me use it with GUI.TextArea widgets.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-18T07:12:50Z","Content":"\n\u003Cp\u003EI\u0027m pretty sure Unity does not ship with any fonts of its own as I know that it relies on the system version of Arial and ArialBold for most text, these are included in Windows, OSX and Ubuntu but are missing from many other Linux distro\u0027s and in Wine which is why I made them available in the Linux compatibility thread.\u003C/p\u003E\u003Cp\u003EAlso if the Windows or OSX versions of Arial are corrupted or uninstalled, the text is lost on those platforms.\u003C/p\u003E\u003Cp\u003EThere\u0027s no info on the Unity site that I can find on fonts, so I guess you would have to either stick to common fonts, do a check of the filesystem for the font or just include your font if licensing permits.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-05-18T07:17:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThere\u0027s no info on the Unity site that I can find on fonts, so I guess you would have to either stick to common fonts, do a check of the filesystem for the font or just include your font if licensing permits.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the fast reply. Assuming I find a TTF fixed width font to use, and that the licensing permits its use in the mod, can I just include it in the mod\u0027s GameData folder and tell unity where to find it?\u003C/p\u003E\u003Cp\u003EUnity\u0027s documentation talks about having to put the font into your \u0022assets folder\u0022 but I don\u0027t know where that is for a mod.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-18T07:22:40Z","Content":"\n\u003Cp\u003EIf Unity knows where to look then hopefully yes, my problem was that Unity was just looking at the default system fonts folder so I had to put the TTF in there or it would not work at all.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.openfontlibrary.org/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EHere is a source for freely usable fonts\u003C/strong\u003E\u003C/a\u003E, I think the only way to be sure on this is to test it.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-05-18T08:26:01Z","Content":"\n\u003Cp\u003EHmm I just dug some more and found that this will do it:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E    string msg= \u0022\u0022;\u003Cbr\u003E    Object[] fonts = UnityEngine.Resources.FindObjectsOfTypeAll( typeof(UnityEngine.Font) );\u003Cbr\u003E    foreach (Object f in fonts) {\u003Cbr\u003E        msg \u002B= \u0022font=\u0022\u002B((UnityEngine.Font)f).name\u002B\u0022\\n\u0022;\u003Cbr\u003E    }\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI got this result in the msg string:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Efont=Arial\u003Cbr\u003Efont=CALIBRI\u003Cbr\u003Efont=HEADINGFONT\u003Cbr\u003Efont=calibri\u003Cbr\u003Efont=calibrib\u003Cbr\u003Efont=calibriz\u003Cbr\u003Efont=calibril\u003Cbr\u003Efont=dotty\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESadly, none of those are fixed-width.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-18T08:30:28Z","Content":"\n\u003Cp\u003EDotty rings a bell, it\u0027s the one used for the \u0022Start Game\u0022 menu screen and version number.\u003C/p\u003E\u003Cp\u003EI think Calibri is used for part descriptions, Arial is of course common as muck, as for Heeadingfont, no idea.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-05-18T08:43:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EDotty rings a bell, it\u0027s the one used for the \u0022Start Game\u0022 menu screen and version number.\u003Cp\u003EI think Calibri is used for part descriptions, Arial is of course common as muck, as for Heeadingfont, no idea.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnity *claims* that it will only load font files in the resources folder but I wonder about a font file called \u0022../../GameData/modname/Resources/myfont\u0022, using the ..\u0027s to escape from the KSP_Data/Resources folder.\u003C/p\u003E\u003Cp\u003EI\u0027ll see about it next time. I\u0027m done for tonight.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-05-30T20:28:35Z","Content":"\n\u003Cp\u003EThe \u0022Ressource\u0022 folder of unity is related to unity editor. You can\u0027t load much at runtime unless you make an asset bundle with unity pro\u003C/p\u003E\n"}]}