{"TopicId":75851,"ForumId":29,"TopicTitle":"Centre of Mass","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-24T14:34:09Z","PageNum":1,"Articles":[{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-24T14:34:09Z","Content":"\n\u003Cp\u003EHi\u003C/p\u003E\u003Cp\u003EI\u0027m having some trouble reading the centre of mass of a vessel. It always gets returned as (0, 0, 0).\u003C/p\u003E\u003Cp\u003EI can\u0027t quite figure out what position it should return relative to, but part.orgPos always gets returned in relation to the root part, so I assumed it would be similar to that.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EVector3 thisVesselCoM = this.part.vessel.CoM;\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHave I completely lost the plot? Any insights would be appreciated - I\u0027m trying to figure out a parts position relative to the CoM.\u003C/p\u003E\u003Cp\u003EManaged to figure most things out now, but this has got me stumped.\u003C/p\u003E\u003Cp\u003ECheers and thanks in advance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-06-24T15:53:11Z","Content":"\n\u003Cp\u003ETwo possible problems:\u003C/p\u003E\u003Cp\u003E1 - Are you taking the reading while the vessel is on rails? If so it won\u0027t work and you just get a hardcoded (0,0,0) answer.\u003C/p\u003E\u003Cp\u003E2 - Are you taking the reading immediately after the vessel comes off of rails? If so then (0,0,0) is actually the correct answer. When the vessel first comes off of rails KSP builds the Unity world using a reference frame centered right where the vessel CoM is. After the physics sim has been running a few minutes, you will then see that the ship has drifted away from the origin.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-24T16:23:46Z","Content":"\n\u003Cp\u003EAha, that would explain it. It\u0027s in the OnStart override so yes and no. I\u0027ll have to use a different method but the sound of it.\u003C/p\u003E\u003Cp\u003EThank you, I\u0027ll run some further testing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-06-25T21:09:57Z","Content":"\n\u003Cp\u003EIf the world coordinates are currently centered on the CoM then it should work fine - the coordinates of anything else will be returned relative to that.\u003C/p\u003E\u003Cp\u003EWhat are you actually trying to find out? The location of ___ relative to ___? Fill in the blanks and I can give suggestions.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-25T21:20:54Z","Content":"\n\u003Cp\u003ESorry, I\u0027ve been so busy coding I\u0027ve not updated the thread. So, a more full explanation:\u003C/p\u003E\u003Cp\u003E I\u0027m working with wheels and I want to find the wheels position relative to the vessel CoM to calculate how much it should steer. Wheels further from the CoM should turn the full amount, wheels close to it should turn proportionally less. I\u0027ve figured out a way to do it simply using the length of the wheelbase, but being relative to CoM would be the icing on the cake. My dev thread is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84102-WIP-PARTS-PLUGIN-Kerbal-Foundries-wheelpack-anti-grav-repulsors\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/84102-WIP-PARTS-PLUGIN-Kerbal-Foundries-wheelpack-anti-grav-repulsors\u003C/a\u003E so you can see what I\u0027m doing.\u003C/p\u003E\u003Cp\u003EI\u0027ve been poking around at what I can call from this.vessel, though the world co-ord from .CoM doesn\u0027t seem to help here, unless there\u0027s some way of inverting it to co-ords local to the vessel?\u003C/p\u003E\u003Cp\u003EThanks for your time, appreciate it!\u003C/p\u003E\n"}]}