{"TopicId":76307,"ForumId":29,"TopicTitle":"Making New Worlds","CreatedByName":"GreatWyrmGold","CreatedById":107272,"CreatedDateTime":"2014-06-30T02:42:11Z","PageNum":1,"Articles":[{"CreatedByName":"GreatWyrmGold","CreatedById":107272,"CreatedDateTime":"2014-06-30T02:42:11Z","Content":"\n\u003Cp\u003EHow would one make new planets, moons, or whatever for the Kerbolal system? I know it\u0027s possible, and it seems like an idea with a wide array of potential ideas that haven\u0027t already been done by people with far more skill in all relevant areas. Hence, I\u0027ve often considered learning how to do so. I have a few questions on the subject.\u003C/p\u003E\u003Cp\u003E1. Does anyone have any general advice? How the planets are coded, where they\u0027re stored, general things like that?\u003C/p\u003E\u003Cp\u003E2. For making the shape, and ideally the texture, would a tool like \u003Ca href=\u0022http://stephaneginier.com/sculptgl/\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E work? If not, what would I need to do?\u003C/p\u003E\u003Cp\u003E3. For future reference (once I get into advanced projects), is it possible to give planets unique resources a la kethane?\u003C/p\u003E\u003Cp\u003EKeep in mind that I\u0027m pretty new to the whole modding thing. I have some vague idea of what can be done, and have a little experience with programming, but I don\u0027t know much more than my own ignorance.\u003C/p\u003E\u003Cp\u003EThanks in advance for any help you can give.\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2014-06-30T07:56:26Z","Content":"\n\u003Cp\u003EI guess you will need to have a look at tools like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65401-WIP-PlanetFactory-CE\u0022 rel=\u0022external nofollow\u0022\u003Eplanet factory\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"GreatWyrmGold","CreatedById":107272,"CreatedDateTime":"2014-06-30T13:38:41Z","Content":"\n\u003Cp\u003EHuh. I thought that was just a package of planets. That is more helpful than I had anticipated! Thank you!\u003C/p\u003E\n"}]}