{"TopicId":215670,"ForumId":197,"TopicTitle":"Strength/integrity of radially attached parts inconsistent and erroneous","CreatedByName":"twich22","CreatedById":110030,"CreatedDateTime":"2023-03-21T12:58:09Z","PageNum":1,"Articles":[{"CreatedByName":"twich22","CreatedById":110030,"CreatedDateTime":"2023-03-21T12:58:09Z","Content":"\n\u003Cp\u003E\nAs title suggests, the strength of radially attached parts is not appropriate in many cases. Here is the best example of this:\n\u003C/p\u003E\n\u003Cp\u003E\ntrying to attach 2 of the largest XL fuel tanks together side by side. If one tank is supported by the ground/clamp, and the other is free floating, the free floating one will immediately detach due to its own weight and weak attachment. However, if you use a different part to attach the two tanks together, depending on the particular part, it may or may not be strong enough to hold the tank suspended in the air. For example, if you use a docking clamp or radial attachment point and attach the tank that way, it is sometimes strong enough to hold the weight. If you use a girder and attach it that way, it is sometimes strong enough. An XL radial decoupler is far stronger and will hold the two tanks together fairly securely. However, one of the strongest attachments I have found is actually the “smallest” XL fuel tank, which is a conundrum as it should be no stronger than the largest XL fuel tank. However, you you attach the smallest XL fuel tank to the side of the largest XL fuel tank, and then add another of the largest XL fuel tanks to the attachment node of the smallest XL fuel tank, you will find that it holds the tanks together very securely.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI am guessing this might have something to do with the weight of the attached part, however this does not really explain the behavior for using radial attachment nodes or docking clamps. Regardless, there should be some tiered system or simply a flat out consistent level for the strength of an attachment relative to other attachments. Similarly, there should be some comparison between a part that is radially attached and one that is nodaly attached.\n\u003C/p\u003E\n"},{"CreatedByName":"VlonaldKerman","CreatedById":225683,"CreatedDateTime":"2023-03-21T15:31:19Z","Content":"\n\u003Cp\u003E\nI have also experienced this with landing legs falling off and dropping my lander to the ground for no reason, after the craft has landed and been stable for several seconds.\n\u003C/p\u003E\n"},{"CreatedByName":"twich22","CreatedById":110030,"CreatedDateTime":"2023-03-22T10:07:49Z","Content":"\n\u003Cp\u003E\nI have also seen things that don’t make sense at all. For example, attaching a radial attachment point part to a metal bar to another radial attachment point, it is weaker than just having one radial attachment point attached to a metal bar. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-22T10:08:25Z\u0022 title=\u002203/22/2023 10:08  AM\u0022 data-short=\u00221 yr\u0022\u003EMarch 22, 2023\u003C/time\u003E by twich22\u003C/strong\u003E\n\u003C/span\u003E\n"}]}