{"TopicId":213228,"ForumId":120,"TopicTitle":"Suggestion: Put potentially shareable files (saves, crafts) in a more accesible location","CreatedByName":"Haustvindr","CreatedById":218813,"CreatedDateTime":"2023-02-26T16:21:23Z","PageNum":1,"Articles":[{"CreatedByName":"Haustvindr","CreatedById":218813,"CreatedDateTime":"2023-02-26T16:21:23Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003ETo the devs: \u003Cstrong\u003EIf you have already planned a different method to share stuff, like an export/import system from within the game, then please ignore this post.\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E---\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith that said, let\u0027s get to it. I\u0027ll try to explain properly.\n\u003C/p\u003E\n\u003Cp\u003E\nRight now \u003Cu\u003Eeverything that the game needs to persistently save it\u0027s located within appdata\u003C/u\u003E. That\u0027s okay for the most part, but there\u0027s a little issue for normal folks: \u003Cstrong\u003E\u003Cu\u003Eappdata folder is hidden by default\u003C/u\u003E\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOkay, so, what does it means?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThat means that for the typical user, when they want to share a craft file: they would open the file explorer, then try to navigate to appdata using nothing else than their mouse/trackpad, and get frustrated because they cannot see any \u0022appdata\u0022 folder. Therefore, it might be actually useful to split the game data between \u0022shareable\u0022 and \u0022local\u0022 data.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, many people in the forum will think that this is just a stupid suggestion, since it is very easy to reach appdata, but... I know, many (all?) developers know, and pretty sure Intercept knows, that the typcial user is... well, let\u0027s say that they are a bulb at half power. Moreover, Intercept are trying to make the game more accesible, including attracting both younger and less technical savvy players, so I think it is indeed a relevant suggestion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESo, what do I propose?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMy to-go proposition is to use the \u0022saved games\u0022 folder, which was introduced with Vista just for... well, savegames. It is not visible in the \u0022promoted\u0022 folders in the file explorer tree under your user name, but it is not a hidden folder and can be easily accesed just navigating to it (in \u0026lt;drive\u0026gt;:\\Users\\\u0026lt;user\u0026gt;\\Saved games).\n\u003C/p\u003E\n\u003Cp\u003E\nAlternatively, you could just use the \u0022my documents\u0022 folder, just as many other games do.\n\u003C/p\u003E\n\u003Cp\u003E\nBy placing those files in an easily accesible location, you will be making much easier the life of many many players that are not midly-advanced Windows users. Also, I don\u0027t know how the locations will be in Linux/Mac, but they might find it useful as well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThen, which files I propose to move to a more accesible location?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt should include our campaigns, workspaces and individual crafts (or the equivalent). Generally speaking, it should be moved anything consciously created by the player:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nA campaign save file would be relocated\n\u003C/li\u003E\n\u003Cli\u003E\nBut the global game settings (screen resolution, UI scale, graphics quality, ...) does not need to relocate\n\u003C/li\u003E\n\u003Cli\u003E\nCraft/workspace files would be relocated\n\u003C/li\u003E\n\u003Cli\u003E\nBut the default craft/workspaces would not\n\u003C/li\u003E\n\u003Cli\u003E\nScreenshots made within the game would be relocated\n\u003C/li\u003E\n\u003Cli\u003E\nEtcetera\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nOf course, I don\u0027t know how many files the game will create, and which of those should be relocated or not, but I hope the idea was trasmitted properly and you would probably have a much better idea about which contents may be \u0022shareable\u0022 and which don\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOkay, sounds fine, but how difficult is it?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d guess not much since it is just a redirection for the paths of some specific contents. Moreover, it could even be done with junctions at the filesystem level and don\u0027t even bother with redirections, though I don\u0027t recommend it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESome last words?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYes, just thank you for your work bringing this game to life.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-26T16:24:41Z\u0022 title=\u002202/26/2023 04:24  PM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 26, 2023\u003C/time\u003E by Haustvindr\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mattihase","CreatedById":73161,"CreatedDateTime":"2023-02-26T17:48:27Z","Content":"\n\u003Cp\u003E\nEven as someone who\u0027s used appdata a lot, this is (I think) the first time I\u0027ve had to go hunting in LocalLow for anything as opposed to Local or Roaming. Very unique design decision.\n\u003C/p\u003E\n"},{"CreatedByName":"TechDragon","CreatedById":188807,"CreatedDateTime":"2023-02-28T07:52:14Z","Content":"\n\u003Cp\u003E\nAs someone with multiple hard drives... This \u003Cem\u003E\u003Cstrong\u003Einfuriates me\u003C/strong\u003E\u003C/em\u003E because I put KSP2 on a separate hard drive. I was asked where I wanted KSP2 to live, I selected the place I wanted KSP2 to live... and KSP2 decided \u0022nah, were just going to throw our crap where ever we like\u0022 and puts stuff on my busy, space constrained, C drive... I don\u0027t like it when Adobe does this, and I like it when games do it even less. \n\u003C/p\u003E\n\u003Cp\u003E\nSecondarily to the \u0022I hate programs taking up space on a hard drive I didn\u0027t install them to\u0022 issue... \n\u003C/p\u003E\n\u003Cp\u003E\nThis has repercussions for mods and beta install testing and the sort of thing most of us have gotten used to doing when we keep a rich collection of mods. I cant have 6 installs of KSP2 nicely sitting side by side if they all try to load save files from the same folder with potential corruption issues if the games try to automatically load files in the directory, I\u0027ve seen some games that just auto delete save files they cant load... who knows. Its just not how I as someone that loves mods want KSP2 to work... I want it to keep the save files for a copy of KSP2... with that copy of KSP2. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-28T07:53:31Z\u0022 title=\u002202/28/2023 07:53  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 28, 2023\u003C/time\u003E by TechDragon\u003C/strong\u003E\n\u003C/span\u003E\n"}]}