{"TopicId":214034,"ForumId":120,"TopicTitle":"Data taken fro SteamDB - is the first hotfix closer than we think?","CreatedByName":"Roter","CreatedById":227053,"CreatedDateTime":"2023-03-01T08:28:53Z","PageNum":1,"Articles":[{"CreatedByName":"Roter","CreatedById":227053,"CreatedDateTime":"2023-03-01T08:28:53Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://steamdb.info/app/954850/depots/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://steamdb.info/app/954850/depots/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWe can see that there have been recent updates in the Branches of KSP2. Does this mean they might already be testing a new version of the game and we are about to get the first patch sooner than we thought?\n\u003C/p\u003E\n\u003Cp\u003E\nAt least it gives me the impression that the devs are in fact working hard on giving first solutions to gamebreaking bugs.\n\u003C/p\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-03-01T08:33:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224248450\u0022 data-ipsquote-contentid=\u0022214034\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677659333\u0022 data-ipsquote-userid=\u0022227053\u0022 data-ipsquote-username=\u0022Roter\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Roter said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe can see that there have been recent updates in the Branches of KSP2. Does this mean they might already be testing a new version of the game and we are about to get the first patch sooner than we thought?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt certainly means they\u0027re testing builds. Please don\u0027t draw any conclusions about when they\u0027ll decide a build is good enough to release as an update. \n\u003C/p\u003E\n\u003Cp\u003E\nThere are two ways they could be thinking about this:\n\u003C/p\u003E\n\u003Col\u003E\n\u003Cli\u003E\n\u0022We have to get a patch out fast, it doesn\u0027t matter if lots of things are still broken or even if it breaks a few new minor things, as long as a couple of really big things are fixed\u0022 \n\u003C/li\u003E\n\u003Cli\u003E\n\u0022We have to get it right in the first patch, it can\u0027t break any new things and we have to deliver major improvements in several areas, even if it takes longer\u0022\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cp\u003E\nThere\u0027s no way to tell which way they\u0027re going to tilt. It could be tomorrow, it could be towards the end of the month, it could be anything in-between.\n\u003C/p\u003E\n"},{"CreatedByName":"MarcAbaddon","CreatedById":192494,"CreatedDateTime":"2023-03-01T08:55:32Z","Content":"\n\u003Cp\u003E\nI predict there\u0027ll be branch updates pretty much every day. It\u0027s just a sign of active development. We\u0027ll see what patch cadence to expect once they start releasing some.\n\u003C/p\u003E\n"},{"CreatedByName":"Cailean_556","CreatedById":12297,"CreatedDateTime":"2023-03-01T09:46:57Z","Content":"\n\u003Cp\u003E\nOf course the devs are \u0022in fact working hard\u0022. Silence does not equate to the devs not working. In fact, silence is pretty much what you want from devs after a...problematic...release.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat that shows is that they are indeed actively developing iterations for release but it doesn\u0027t necessarily mean that a patch/update is imminent. Outside of \u0022weeks not months\u0022, I\u0027d ease up on those expectations of \u0022quick fixes\u0022. There\u0027s a lot riding on this first update so I doubt they\u0027re going to rush it. If it adds more issues, or fails to resolve \u0022obvious\u0022 issues, out come those pitch forks and torches again. So, once they\u0027re confident it has its bang for buck, we\u0027ll see it drop. Not before.\n\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2023-03-01T13:51:14Z","Content":"\n\u003Cp\u003E\nThere was another “development” branch pushed a hour ago this morning, so not yet, unfortunately. \n\u003C/p\u003E\n"},{"CreatedByName":"HowDoKerbal","CreatedById":226852,"CreatedDateTime":"2023-03-01T14:02:18Z","Content":"\n\u003Cp\u003E\n“releasetest” and “candidate” are the interesting branches for our concerns. The latter likely refers to a build that is a candidate for a live release.\n\u003C/p\u003E\n\u003Cp\u003E\nNo doubt they are working hard to get a patch out that addresses the most critical bugs.\n\u003C/p\u003E\n"}]}