{"TopicId":214204,"ForumId":120,"TopicTitle":"Have the Kerbals save replays of crashes throughout your game!","CreatedByName":"TheZBillDyl","CreatedById":227165,"CreatedDateTime":"2023-03-02T15:32:39Z","PageNum":1,"Articles":[{"CreatedByName":"TheZBillDyl","CreatedById":227165,"CreatedDateTime":"2023-03-02T15:32:39Z","Content":"\n\u003Cp\u003E\nIt would be such a fun little feature. It could happen randomly when you crash or after some calculated value. The game will secretly record the past like 5-10 seconds and save it. After a year or so in game the player gets a prompt saying \u0022The annual failure report is in\u0022. If the player clicks on the prompt, they\u0027re taken to a fun presentation in front of a bunch of kerbals. The presentation is just a bunch of your \u0022highlights\u0022 throughout the year \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \u003Cbr\u003E\n\u003Cbr\u003E\nI guess this could also be done with accomplishments as well. It would be a neat feature to think about. Plus, playing into the kerbal personas is something KSP2 should do in my opinion. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThank you for your time!\n\u003C/p\u003E\n"},{"CreatedByName":"zeekzeek22","CreatedById":223169,"CreatedDateTime":"2023-03-02T19:02:53Z","Content":"\n\u003Cp\u003E\nI second this sort of feature (which could all be lumped into a category that can be toggled in settings with one click, for those who like their simulator without the silliness). This is definitely a long-future, probably past 1.0 feature, but these kinds of things would be really fun and could be exported as shareable videos.\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0027d be down with a vertical split screen: one side shows the crash, the other side shows the Kerbal audience who has great reactions to the crashes, including a cheer for a successful landing or something.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe it could be a tab in the training center titled \u0022Debriefs\u0022 or something, and you can click in and it will have a few autogenerated ones...an achievements debrief, a crashes debrief, and maybe other tools for sharing recorded footage, with features accumulating to make it the social media menu, with maybe even a clip editor to add filters and effects (add a retro film countdown to some grain-ified moon landing footage)...a not-real-time video-editor analog to the common photo modes. At the very least, modes like this makes people\u0027s shared content into better autoadvertizement for late-stage sales, which is probably why these modes are so ubiquitous.\n\u003C/p\u003E\n\u003Cp\u003E\nYeah this idea spiralled out from a small feature into a long-term major feature suite. I don\u0027t even use photo modes, I just know the community would love this. Or I may be wrong, and all these features are a waste of time to integrate, since video editor already exist.\n\u003C/p\u003E\n"},{"CreatedByName":"TheOtherDave","CreatedById":32305,"CreatedDateTime":"2023-03-02T19:20:17Z","Content":"\n\u003Cp\u003E\nWhy not save all inputs and random events? It’d let you do complete analysis on everything, and would also let people play their mission with a “full” UI and high performance/low-rez graphics settings, then “replay” it with a “cinematic” (or no) UI, free camera control, and ultra/high-rez graphics settings.\n\u003C/p\u003E\n"},{"CreatedByName":"zeekzeek22","CreatedById":223169,"CreatedDateTime":"2023-03-03T15:15:54Z","Content":"\n\u003Cp\u003E\nThat could be a setting (that would probably slow things down a bunch and make enormous save files). But it sounds like a feature that would 90% be for streamers and would only be for people with the best computers. Would be cool but hard to imagine it\u0027d be prioritized. Short recorded nuggets would be ideal and the most appealing for a broad audience.\n\u003C/p\u003E\n"},{"CreatedByName":"TheOtherDave","CreatedById":32305,"CreatedDateTime":"2023-03-04T00:06:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224250689\u0022 data-ipsquote-contentid=\u0022214204\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221677856554\u0022 data-ipsquote-userid=\u0022223169\u0022 data-ipsquote-username=\u0022zeekzeek22\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, zeekzeek22 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat could be a setting (that would probably slow things down a bunch and make enormous save files). But it sounds like a feature that would 90% be for streamers and would only be for people with the best computers. Would be cool but hard to imagine it\u0027d be prioritized. Short recorded nuggets would be ideal and the most appealing for a broad audience.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou’re correct, but unless you’re literally just talking about saving video (which can eat up a lot of space), it’s essentially the same mechanism as what I’m describing… the only two differences are how much gets logged and the decoupling of the playback from the current graphics settings.\n\u003C/p\u003E\n"},{"CreatedByName":"hyx5020","CreatedById":173986,"CreatedDateTime":"2023-03-04T22:12:40Z","Content":"\n\u003Cp\u003E\nConsidering how fast the game can load a scene, recording the \u0027flight data\u0027 but not the actual video, then re-simulating the recorded data would be ideal.\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\n\u003C/p\u003E\n"}]}