{"TopicId":214492,"ForumId":120,"TopicTitle":"Plant life on Kerbin","CreatedByName":"kicka55","CreatedById":227402,"CreatedDateTime":"2023-03-05T15:30:05Z","PageNum":1,"Articles":[{"CreatedByName":"kicka55","CreatedById":227402,"CreatedDateTime":"2023-03-05T15:30:05Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EYooo Kerbals!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure how final or telling of the final product the current plant life of on Kerbin  is. So this post could be obsolete. However, I still wanted to give some input about how I imagine plant life on Kerbin could look like. It\u0027s early access after all and I personally don\u0027t \u0022feel\u0022 the current one as much.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003ESome pseudo scientific derivation\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBeing a planet with high density air means plants could evolve to grow bigger using buoyancy (The physical rule where light stuff floats up, heavy stuff sinks down). Trees on Kerbin are therefore not limited by what their molecules can structurally support. Gases like methane that can be created biochemically are lighter than air so plants could make use of bacteria to create this stuff and trap it in leaf bubbles that rise up and provide additional support. These methane plants / trees could also be used by Kerbals to harness their beloved propellant. As in: Recent development made it possible switching from fossil fuel to \u0022renewable\u0022 methane. I picture methane farms that have needles sticking into those bubbles or Harvesters harvesting them. Old leaf bubbles could become floaters that pose dangers threats to low flying air craft.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom that a problem arises: Where do those trees get all the nutrients from the bacteria can digest? They would quickly drain all their surroundings and die. (Could be a reason to not have much grass surrounding trees btw.) It takes an underground form of life that digests food and thereby fertilizes the ground efficiently to provide nutrients to said trees. A form of life that famously lives in symbioses with trees are mushrooms / fungi! \n\u003C/p\u003E\n\u003Cp\u003E\nKerbin could have a huge form of fungus that spreads its mycelium as thick roots through ground which occasionally stick out of the ground. The bottom of each connected tree to this nutrient highway would have some kind of visible feature. Some trees would not be connected and smaller while others would be bigger to have some diversity. And these mega fungi of course would also produce mega mushrooms the size of small trees here on Earth. \n\u003C/p\u003E\n\u003Cp\u003E\nSo to sum it up, one of Kerbin\u0027s biomes could be populated by such gigantic trees and mushrooms and the occasional mega mycelium sticking out. I drew a sketch of how I imagine Kerbin could look like. I\u0027m not a great artist but I hope you get the idea!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AXzdc5i.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002266.67\u0022 height=\u0022600\u0022 width=\u0022900\u0022 src=\u0022https://i.imgur.com/AXzdc5i.jpeg\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-05T15:31:29Z\u0022 title=\u002203/05/2023 03:31  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 5, 2023\u003C/time\u003E by kicka55\u003C/strong\u003E\n\u003C/span\u003E\n"}]}