{"TopicId":214665,"ForumId":120,"TopicTitle":"Don\u0027t swipe-animate tooltips","CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2023-03-07T18:10:47Z","PageNum":1,"Articles":[{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2023-03-07T18:10:47Z","Content":"\n\u003Cp\u003E\nThe UI is full of tooltips like this one:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kIIx5n8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002234.30\u0022 height=\u0022177\u0022 width=\u0022516\u0022 src=\u0022https://i.imgur.com/kIIx5n8.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhen displaying tooltips, there are basically three options I can think of for displaying.  KSP2 is currently using the third.\n\u003C/p\u003E\n\u003Col\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EInstant.\u003C/strong\u003E  When the mouse goes over the control, the tooltip instantly pops up, with full text\n\u003Cul\u003E\n\u003Cli\u003E\nAdvantage:  Instantly informative.\n\u003C/li\u003E\n\u003Cli\u003E\nDisadvantage:  Distracting (too easy to trigger accidentally or unnecessarily).\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EDelayed.\u003C/strong\u003E  When the mouse goes over the control, nothing happens at once.  But if the mouse hovers there for some timer period, then the tooltip pops up, with full text.\n\u003Cul\u003E\n\u003Cli\u003E\nAdvantage:  Unintrusive (doesn\u0027t show up unless you hover, which is typically an intentional act).\n\u003C/li\u003E\n\u003Cli\u003E\nDisadvantage:  Slow (if the user wants the info, forces them to wait for it)\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESwipe-animated.\u003C/strong\u003E  When the mouse goes over the control, instantly pop up a blank tooltip with no text.  Then the text gradually animates into place, \u0022swiping\u0022 from left, like low-baud-rate text coming over a modem or something.  (This is what KSP2 is doing now.)\n\u003Cul\u003E\n\u003Cli\u003E\nAdvantage:  None\n\u003C/li\u003E\n\u003Cli\u003E\nDisadvantage:  Manages to be \u003Cem\u003E\u003Cu\u003Eboth\u003C/u\u003E\u003C/em\u003E  distracting \u003Cem\u003E\u003Cu\u003Eand\u003C/u\u003E\u003C/em\u003E slow.  Triggers instantly and distractingly every time, even if you didn\u0027t need the tip... but once it \u003Cem\u003E\u003Cu\u003Edoes\u003C/u\u003E\u003C/em\u003E trigger, forces you to wait for the content while it swipes.  Also, maybe this is just me, but the motion and animation is absolutely maddening and jarring-- it\u0027s injecting flashy motion into a scene that\u0027s otherwise fairly static, and it drags my eye away from the important stuff on the screen.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cp\u003E\nIt\u0027s a really cute idea, and I\u0027m sure it sounded great on paper, and it certainly is \u0022stylish\u0022.  However, in practical terms, these animated tooltips are driving me absolutely batty.  The animation serves no useful purpose, and gives them the  worst of both worlds.\n\u003C/p\u003E\n\u003Cp\u003E\nMy suggestion is, pick either the \u0022instant\u0022 or the \u0022delayed\u0022 model, and go with that.  My personal preference is for the \u0022delayed\u0022 model, since that\u0027s how tooltips work for virtually every UI I\u0027ve ever used, and for good reason.  However, even though I would like \u0022instant\u0022 a lot less than \u0022delayed\u0022, it would still be \u003Cem\u003E\u003Cu\u003Einfinitely\u003C/u\u003E\u003C/em\u003E better than the current animated behavior, which I find a distracting nuisance.\n\u003C/p\u003E\n"}]}