{"TopicId":220090,"ForumId":120,"TopicTitle":"The thing I hated about science and the career game in KSP1","CreatedByName":"cephalo","CreatedById":143148,"CreatedDateTime":"2023-10-18T15:31:37Z","PageNum":1,"Articles":[{"CreatedByName":"cephalo","CreatedById":143148,"CreatedDateTime":"2023-10-18T15:31:37Z","Content":"\n\u003Cp\u003E\nThe thing I didn\u0027t like about science in KSP1 is that it was linked to the tech tree. Once I had all the parts, I just couldn\u0027t shake the feeling that I was done with the game. Science labs were fun, but they even shortened this process so on some runs I didn\u0027t even have to go to Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my opinion the tech tree should be achievement based, like once you\u0027ve done X you can do Y,  and then it\u0027s ok to unlock the tech tree early. I.E. Once you learn to make an orbital rendezvous, you can make a docking port etc.\n\u003C/p\u003E\n\u003Cp\u003E\nScience in my opinion, should be where nearly all your funding should come from, and there should be a marketplace where people are looking for experiments done in different environments, and you try pack in as many as you can per mission. There should be lots of choices of science contracts to take. I was always unsatisfied with the contracts available in KSP1, they were very rarely appropriate for the mission I wanted to do. There might be one to my planned destination, and then six to the Mun where I\u0027d already been too many times. I don\u0027t want to test out some vehicle part in some goofy, inappropriate place where it shouldn\u0027t even be operating. Funding should come from science because it makes more sense.\n\u003C/p\u003E\n\u003Cp\u003E\nI would rather choose a destination or destinations, and then have the science community offer up requests and payment amounts. Orbital science stations could play a role in long term, steady funding.\n\u003C/p\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-10-23T08:50:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224331166\u0022 data-ipsquote-contentid=\u0022220090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221697643097\u0022 data-ipsquote-userid=\u0022143148\u0022 data-ipsquote-username=\u0022cephalo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/18/2023 at 6:31 PM, cephalo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe thing I didn\u0027t like about science in KSP1 is that it was linked to the tech tree. Once I had all the parts, I just couldn\u0027t shake the feeling that I was done with the game. Science labs were fun, but they even shortened this process so on some runs I didn\u0027t even have to go to Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my opinion the tech tree should be achievement based, like once you\u0027ve done X you can do Y,  and then it\u0027s ok to unlock the tech tree early. I.E. Once you learn to make an orbital rendezvous, you can make a docking port etc.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think this is more of a balancing issue really, and the \u0022future tech\u0022 part of KSP2 will help address it a lot! They just need to slow progression as you get higher up the tree so you don\u0027t unlock it all so quickly. They could have a geometric progression in science cost and science rewards so that, say, Kerbin-based science yields only 10s of points but basic rocket tech that\u0027ll let you get to the Mun and Minmus also costs only 10s of points but the earliest interstellar engine could cost 10,000 points, and to get that, you\u0027d need to have interplanetary colonies with research labs that could produce thorse points. And the endgame tech could cost 1,000,000 points which you could only (realistically) earn by building an interstellar colony. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224331166\u0022 data-ipsquote-contentid=\u0022220090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221697643097\u0022 data-ipsquote-userid=\u0022143148\u0022 data-ipsquote-username=\u0022cephalo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/18/2023 at 6:31 PM, cephalo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nScience in my opinion, should be where nearly all your funding should come from, and there should be a marketplace where people are looking for experiments done in different environments, and you try pack in as many as you can per mission. There should be lots of choices of science contracts to take. I was always unsatisfied with the contracts available in KSP1, they were very rarely appropriate for the mission I wanted to do. There might be one to my planned destination, and then six to the Mun where I\u0027d already been too many times. I don\u0027t want to test out some vehicle part in some goofy, inappropriate place where it shouldn\u0027t even be operating. Funding should come from science because it makes more sense.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere won\u0027t be any funds in the game at all. There will be missions and going by what they\u0027ve said, they want to make the missions make sense and have a logical progression like KSP1 contracts never did. Even though I mostly played career mode, I do agree that the KSP1 contracts were mostly just silly and pointless, just busywork that would get you to do \u003Cem\u003Esomething.\u003C/em\u003E If they don\u0027t do a lot better than that I will be sad!\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2023-10-23T13:23:30Z","Content":"\n\u003Cp\u003E\nOne thing to keep in mind is that the whole science/contracts/tech was a Frankenstruct bolted onto the game in an attempt to overcome the lack of goals in Sandbox. It tried to achieve various things at once and that never works well:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nEase beginning players into the game by limiting the parts they can choose from, and learn the basics with small rockets\n\u003C/li\u003E\n\u003Cli\u003E\nProvide an in-game challenge\n\u003C/li\u003E\n\u003Cli\u003E\nMake it more realistic by providing penalties for a \u0022moar boosters\u0022 approach when building rockets\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nWe ended up with a tech tree that doesn\u0027t make sense (manned flight before remote flight, for gaming purposes) with certain items in the tech tree in places that were backwards. The Vostok-style inflatable airlock is only available late game, when most of us long stopped using those command modules. And don\u0027t get anyone started on the ladders.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat was suggested during the run-up to EA release what that the whole concept was given a thorough evaluation, by industry professionals who, armed with spreadsheets and experience, know how this stuff works out and how it\u0027s supposed to work out. And instead of bolting it onto an existing game, they can integrate it with progression mode from the ground up. What\u0027s more, they already have experience with what worked, and what didn\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course a lot was suggested pre-release that hasn\u0027t been delivered on, and we\u0027ll have to wait until the 0.2 release (I\u0027m carefully avoiding \u0022December,\u0022 we know how that goes) to see how it works out.\n\u003C/p\u003E\n"}]}