{"TopicId":220751,"ForumId":120,"TopicTitle":"Rethinking Propellers","CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-11-10T12:49:07Z","PageNum":1,"Articles":[{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-11-10T12:49:07Z","Content":"\n\u003Cp\u003E\nPropellers popped up in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/topic/220743-top-10-requests/?do=getNewComment\u0022 rel=\u0022\u0022\u003EDakota\u0027s Top Ten Requests thread\u003C/a\u003E a few times and I got to thinking about them. I really enjoyed making propeller and rotorcraft in KSP1 but I thought they were really fiddly and I think they need to be re-thought for KSP2, if they decide to implement them. Here\u0027s how I\u0027d go about it!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EWe should still have torque\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s an important design consideration and getting rid of it would make propellers too similar to jet engines!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EBlades should be parameters\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nInstead of attaching blades to motors and then fiddling with them, the critical things should be parameters on the motor:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nNumber of blades\n\u003C/li\u003E\n\u003Cli\u003E\nSize of blade\n\u003C/li\u003E\n\u003Cli\u003E\nRotation direction (affects both blade variant and motor direction so they always match)\n\u003C/li\u003E\n\u003Cli\u003E\nReverse rotation switch (for backward-facing props)\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nThese should have a sensible default for each motor size.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EBlades should have auto-pitch as the default option\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWe\u0027ve had constant-speed propellers with automatic pitch for ages and ages and I think we should have them in KSP as well. There should be an option to switch to manual pitch as well because sometimes you want to. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EDefault axis binds for torque and pitch\u003C/u\u003E\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThrottle controls engine torque\n\u003C/li\u003E\n\u003Cli\u003E\nUp/Down controls blade pitch (if not set to automatic/constant-speed)\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nYou could reassign these but you shouldn\u0027t have to assign them manually every time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EHandle helicopter main rotors separately\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYou would have to explicitly choose to make a propeller a helicopter rotor. This would change its axis/keybinds and behavior. These could be entirely different parts, or a switch you can flip on a part.\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nConstant-speed/automatic pitch would be removed\n\u003C/li\u003E\n\u003Cli\u003E\nThe up/down axis would control pitch \n\u003C/li\u003E\n\u003Cli\u003E\nThe roll and pitch axes (QE/WS) would control cyclic\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n\u003Cu\u003EHandle helicopter tail rotors separately\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLike for the main rotor, the tail rotor should be either a designated part or a mode/switch you can flip. \n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nIt has auto-torque to keep it constant speed\n\u003C/li\u003E\n\u003Cli\u003E\nThe yaw axis (AD) will control pitch\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E will automatically adjust it to keep the craft\u0027s orientation stable\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n\u003Cu\u003EIn sum\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf they were designed this way, making a functional propeller plane would be almost as easy as making a jet plane, as you\u0027d only have to deal with torque. Making a functional helicopter would be fairly straightforward too: install a main rotor and tail rotor (or two counterrotating main rotors), and off you go.\n\u003C/p\u003E\n\u003Cp\u003E\nI know that this may sound too much like \u0022easy mode\u0022 for some people, but I really think they were too difficult to get into for most people, and even when you knew how they worked, they needed too much manual tweaking to fly. Single main rotor helicopters in particular were really hard to build and even when built right were really squirrelly. I think that with this kind of approach, lots more people would use them, and you\u0027d still be able to set them to \u0022full manual\u0022 if you wanted the advanced stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat do you think? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-10T17:02:14Z\u0022 title=\u002211/10/2023 05:02  PM\u0022 data-short=\u0022Nov 10\u0022\u003ENovember 10, 2023\u003C/time\u003E by Periple\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"gluckez","CreatedById":226569,"CreatedDateTime":"2023-11-10T12:57:22Z","Content":"\n\u003Cp\u003E\nI think the concept of a propeller itself should be considered, it\u0027s really nothing more than a wheel with wings attached. introducing specific propeller components is one possibility, but to me there\u0027s more freedom if you split this up into it\u0027s own seperate parts. A rotating component could be used for artificial gravity for example if you rotate it slower and attach habitation modules, but it could also be used to achieve lift if you attach wings. \u003Cbr\u003E\nSo perhaps a simpler solution would be to use different size, configurable rotators, combined with procedural wings.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: combine this with the option to save crafts as individual components and you can easily make your own propellors that you can attach to your craft\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-10T12:58:52Z\u0022 title=\u002211/10/2023 12:58  PM\u0022 data-short=\u0022Nov 10\u0022\u003ENovember 10, 2023\u003C/time\u003E by gluckez\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-11-10T13:06:11Z","Content":"\n\u003Cp\u003E\nI think there should still be plain old motors that rotate things. I just think that the specific behaviors propellers and helicopter rotors need to have to make it enjoyable to design and fly them are so complicated that modeling them from first principles gets too fiddly. \n\u003C/p\u003E\n\u003Cp\u003E\nOne possibility would be to have a mode switch in the part configurator: \n\u003C/p\u003E\n\u003Col\u003E\n\u003Cli\u003E\nPlain motor -- no blades, no control mappings, attachment points at both ends and 2-8 on the side like in KSP1\n\u003C/li\u003E\n\u003Cli\u003E\nPropeller engine -- as described above\n\u003C/li\u003E\n\u003Cli\u003E\nHelicopter main rotor -- as described above\n\u003C/li\u003E\n\u003Cli\u003E\nHelicopter tail rotor -- as described above\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cp\u003E\nBasically, I\u0027d like an easy way to accomplish the following:\n\u003C/p\u003E\n\u003Col\u003E\n\u003Cli\u003E\nToggle constant-speed/auto-pitch - constant-speed/auto-torque - full manual torque/pitch\n\u003C/li\u003E\n\u003Cli\u003E\nBind cyclic to pitch/roll and collective to up/down\n\u003C/li\u003E\n\u003Cli\u003E\nBind pitch to yaw and make it work as expected with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E (tail rotor case)\n\u003C/li\u003E\n\u003Cli\u003E\nSpecify the number and type of blades easily\n\u003C/li\u003E\n\u003Cli\u003E\nSpecify the rotation direction of the whole assembly rather than having to do it separately for the blades and the motor\n\u003C/li\u003E\n\u003Cli\u003E\nIntuitively handle backward-pointing propellers (reverse direction switch)\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cp\u003E\nThis should also be easy enough and have good enough defaults that you could assemble a plane or a helicopter, and it would work more or less like you\u0027d naively expect it to work. If you were doing it completely from scratch, the only new thing you\u0027d have to deal with is torque.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-10T17:04:05Z\u0022 title=\u002211/10/2023 05:04  PM\u0022 data-short=\u0022Nov 10\u0022\u003ENovember 10, 2023\u003C/time\u003E by Periple\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sea_Kerman","CreatedById":226149,"CreatedDateTime":"2023-11-11T08:45:57Z","Content":"\n\u003Cp\u003E\nwhy should blade pitch on the tail rotor variant be just bindable to yaw? let us bind anything to anything! \n\u003C/p\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-11-11T08:53:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224338893\u0022 data-ipsquote-contentid=\u0022220751\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699692357\u0022 data-ipsquote-userid=\u0022226149\u0022 data-ipsquote-username=\u0022Sea_Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Sea_Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhy should blade pitch on the tail rotor variant be just bindable to yaw? let us bind anything to anything! \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think bindings should be overridable. The main problem is making \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E understand that it controls yaw.\n\u003C/p\u003E\n"},{"CreatedByName":"NexusHelium","CreatedById":230359,"CreatedDateTime":"2023-11-16T14:40:38Z","Content":"\n\u003Cp\u003E\nI would also personally like the motors and the chopping and moving of the propeller to have sound (From what I remember, it didn\u0027t in KSP 1)\n\u003C/p\u003E\n"}]}