{"TopicId":220842,"ForumId":120,"TopicTitle":"Suggestion: display rotational axis","CreatedByName":"BComFly","CreatedById":228687,"CreatedDateTime":"2023-11-16T06:52:49Z","PageNum":1,"Articles":[{"CreatedByName":"BComFly","CreatedById":228687,"CreatedDateTime":"2023-11-16T06:52:49Z","Content":"\n\u003Cp\u003E\nAs we all know, in KSP 2 celestial bodies can have tilted rotational axis. However, there is currently no way to know the rotational axis of your target, unless you time warp and watch it with your own eyes. This may be okay for a simple exploration mission, but for a colonization mission later on, knowing the rotational axis becomes a valuable information, as your orbital inclination relative to the equatorial plane dictates whether or not you can land at your target. It is also a pain to guess whether you are in an equatorial orbit or not when tilted axis are in play.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease consider adding some display for the tilted axis. It would be better if it could be set as a display option. I have some suggestions on how this information could be displayed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E1. Show the axis.\u003C/strong\u003E Simple and easy. We can also add an arrow to indicate the north.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E2. Highlight the equator.\u003C/strong\u003E In my opinion, knowing the equator is much more valuable than knowing the axis. Most of the time, we are more interested in finding the equator. Although the highlighted equator can be a bit distractive when you are trying to look at the surface near the equator, we can always fade it out just like how we fade out a planet’s orbit when zoomed in.\n\u003C/p\u003E\n\u003Cp\u003E\nBelow is a simple sketch showing my two suggestions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022?imw=5000\u0026amp;imh=5000\u0026amp;ima=fit\u0026amp;impolicy=Lett\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002252.56\u0022 height=\u0022349\u0022 width=\u0022664\u0022 src=\u0022https://steamuserimages-a.akamaihd.net/ugc/2220899066136999116/CB9B523EFBC51DEE27A39168951FF643DABDA7FF/?imw=5000\u0026amp;imh=5000\u0026amp;ima=fit\u0026amp;impolicy=Letterbox\u0026amp;imcolor=%23000000\u0026amp;letterbox=false\u0022\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-16T06:56:44Z\u0022 title=\u002211/16/2023 06:56  AM\u0022 data-short=\u0022Nov 16\u0022\u003ENovember 16, 2023\u003C/time\u003E by BComFly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vl3d","CreatedById":219348,"CreatedDateTime":"2023-11-16T11:37:37Z","Content":"\n\u003Cp\u003E\nIt\u0027s sufficient to show the direction of rotation. That\u0027s what\u0027s missing, as it\u0027s usually counter clockwise looking at N from above. Equator can be determined using the nav ball and inclination value.\n\u003C/p\u003E\n"},{"CreatedByName":"Periple","CreatedById":225622,"CreatedDateTime":"2023-11-16T13:51:26Z","Content":"\n\u003Cp\u003E\nI\u0027d like to have some indication of An and Dn relative to the equator when orbiting a planet. It would be nice to be able to get into an equatorial orbit without having to eyeball it!\n\u003C/p\u003E\n"}]}