{"TopicId":222625,"ForumId":120,"TopicTitle":"My immpresions about 0.2 \u0022For science\u0022 update","CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2024-01-05T16:35:52Z","PageNum":1,"Articles":[{"CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2024-01-05T16:35:52Z","Content":"\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EThe main feature of update was Exploration mode. Now I have goals to explore Kerbolar system. Lack of parts makes me to solve puzzles, how to achieve target with current parts, what parts should I unlock, where should I go. I have enjoyment from overcoming limitations and have feeling of progression during comliting missions and unlocking new parts. Second feature which makes me continue exploration is plot. It’s not cinematographic, but messages are funny and well writed, lore is very intriguing. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EBut not all in exploration mode is well as it seems to me. I encountered missing text for science reports which was written as “default message” or “crew assess environment and collect its characteristics”. The well written examples are soil sample reports, now I didn’t see them written in default message style. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003ESome missions in exploration mode are dishonest and absurd balanced. For example mission “LIL CHONKER” where you get only 35 points for delivering 200 tons Minmus, but for Kapy rock you get 200 points. In Kerwide Tour missions it seemed to me annoying to use cabin cans for my crafts. They are like they were made for planes, but instead doing any crew observations you must bring with you unsuitable parts which very much interfere your flight.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EMissions also suffer from an inadequate interface and lack of important position and orbit information that would come in handy during complex missions. For example, an orbit rounding mission gives the orbit parameters not as an eccentricity and a large semi-axis, but as a perigee and apogee. This is done due to the fact that the player has nowhere to see the eccentricity, although this is a very important parameter in orbital mechanics. As a result, this parameter will not be stored in the player\u0027s head and it will be more difficult for him to plan and execute more complex orbital maneuvers in the absence of this knowledge. Or the plot mission where you need to put a satellite into Minmus orbit. The inclination of the orbit of 45 degrees is proposed to be determined by eye. It is clear that this is not particularly difficult to do and it is so well chosen, but it greatly reduces the number of goals that could be set for the player. The game really needs a tool that shows all the parameters of the orbit with great accuracy. The window can be placed specifically for this purpose in the same place as the panels with the resource manager, details, etc.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EVery much interferes with the exploration process that you have to memorize in your mind all the places you have visited in order not to waste time flying to the same place 2 times. There is no archive for science reports and the most of your reports you see once in the campaign. You can miss story or lore if you skip them accidentaly.\u003Cspan\u003E  \u003C/span\u003EAlso other things, like discoverables, are not saved on your map. After you found it game doesn’t add it as known object in tracking station. Founding of discoverables is interesting, but very time consuming process. You must fly above surface or drive rover for a very long time and it’s not a fact, that discoverable is big enough to spot it for a first time. I suggest to add scanner on 3-4 tech level, which can orbit celestial body and if it flies above discoverable it detects it and give a player a area on map, where player should search for it. Maybe telescope, which should fly above area of interest for certain time within the permissible speed range. It would create a new and interesting challenge for the player. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EThere are no credits as in KSP1. At first glance it seems to be missing feature, but in my opinion in KSP2 it’s unnecessary layer. Not in terms that in future player must also control resources in colonies, but it motivates you to explore and fly instead of using mechanics like financial strategies. On the second tech tier I built rocket which delivered communication sat and lander to Moho without using any gravitational maneuvers, with KSP1 money restrictions I wouldn’t do it. So to gather science I went to Moho instead of farming some boring stuff in Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. My rocket was large enough and it seemed that there are no restrictions for craft size, but during construction of rocket I encountered one. It was mass. Without powerful engines you can lift heavy masses, and to unlock these engines you must collect science, do missions and fly to another places.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EBut what could be taken from KSP 1 is the center for the recruitment of kerbonauts, so that you can quickly find out the list and statuses of all the kerbonats, because it is not very convenient to watch them in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EAfter compliting Minmus plot mission I got mission to do the same but on Duna. Building interplanetary ships and mission to Minmus are much different things, and it seemed like it is very big leap for inexperienced players. Of course there was no timer and you can pracitce and collect science for unlocking parts building simple probe to Duna or to another planet, but for inexperienced players it can be non-obviously. And there were no secondary missions after comliting Minmus mission when player must send light probe to another planet, this mission would encourage players not to be afraid to try to send missions easier than landing on the Mun, but to other planets.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EDuring complex flights and missions there were some very big inconveniences with the map view. At the moment the map mode is very inconvenient to use, the screen is too cluttered. When trying to edit a maneuver, you constantly misclick because the cursor sensitivity zones are oddly configured, windows from different points in the orbits open and block the maneuver editor, when you turn the camera some parts of the editor disappear. With a large number of elements, a separate panel would be useful where all the maneuver parameters could be precisely adjusted: the velocity vector, the perigee argument, the number of the turn. It would be possible to find out from there the exact parameters of the orbit before and after\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EIcons of all crafts look exactly the same and change size incorrectly when you change the distance from the camera. As the number of crafts increases, you need to hide some devices not only from the list in the tracking station, but also from the map for convenience. But there is no such option and you are forced to see all your units ever launched. After several launches in the map mode you get an unpleasant jumble. Using the list to select devices is also not convenient because there is no division into types of devices. The presence of filters of vehicles by type, such as manned ship, probe, satellite, lander, rover, etc. would give convenience, obviously visible visual difference and the ability to immediately find the desired craft. But so far in the game there is no possibility to set the type of vehicle to the control module.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EAlso the game has an obscure naming system. After you have docked or undocked the units, they do not retain their original name and you have to remember what is what again. Setting the main unit in a bundle and the ability to rename control modules piece by piece, so that after docking and undocking for the resulting units were automatically assigned to the types and names you specify, would solve the problem. Such a system is available in KSP1.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EWorkspace system in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E is very incomprehensible, the game nowhere gives instructions on how to use it and it is difficult to understand waiting for an unaware player what its advantage is.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EOf course the update made a positive impression and I was able to get a lot more emotions when playing than before, but there are still a lot of problems in the form of some unbalanced missions, difficult and insufficient interface especially in map mode, serious bugs. But there\u0027s still room for improvement\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2024-01-06T01:33:13Z","Content":"\n\u003Cp\u003E\nGreat list. I agree with almost all of this. \n\u003C/p\u003E\n"}]}