{"TopicId":223259,"ForumId":120,"TopicTitle":"Grouping stages in VAB","CreatedByName":"bmyers831","CreatedById":113233,"CreatedDateTime":"2024-01-25T17:30:30Z","PageNum":1,"Articles":[{"CreatedByName":"bmyers831","CreatedById":113233,"CreatedDateTime":"2024-01-25T17:30:30Z","Content":"\n\u003Cp\u003E\nFeature request:\n\u003C/p\u003E\n\u003Cp\u003E\nAbility to assign stages to a group and to move that group around as a group.\n\u003C/p\u003E\n\u003Cp\u003E\nUse case is for larger crafts set up to perform multiple sub missions.  Like a carrier craft carrying several lander probes, each with their own stages that won\u0027t be used until they are separated from the main carrier.  Or now that I think about it, even a simple apollo-style stack.\n\u003C/p\u003E\n\u003Cp\u003E\nTake the apollo example since it\u0027s simple and we\u0027re all familiar with it.\n\u003C/p\u003E\n\u003Cp\u003E\nYou have your lander stages.  You Group them and send them to the top of the stage stack because you never want to re-organize them again, or see them mixed in with the entire craft as you build the main rocket underneath.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d probably set the capsule re-entry sequence to it\u0027s own group too.\n\u003C/p\u003E\n\u003Cp\u003E\nThis would cut down with the hassle as you build, and rebuild the complex staging that usually sits between the ground and when you actually use that Moho probe and make things more organized in general.\n\u003C/p\u003E\n"},{"CreatedByName":"pg17","CreatedById":232200,"CreatedDateTime":"2024-01-25T18:14:32Z","Content":"\n\u003Cp\u003E\nI concur! I don\u0027t know if this should be this solution \u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cem\u003E(or something like having multiple color coded stacks with only one active, like those multiple shortcut bars in RPGs)\u003C/em\u003E\u003C/span\u003E but we need something to address the underlying issue.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the point I am in the game this is among the most frustrating things for me. I would take any form of improvement!\u003Cbr\u003E\nI often build rockets delivering multiple vessels at once \u003Cem\u003E(for example a station, a lander, a communication satellite, a science return vessels, ...)\u003C/em\u003E. Assembling it all together always result in an awfully long and messy stage \u0022stack\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would also be helpful if those stage groups could be \u0022locked\u0022 even outside of \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E too, so that when docking, the groups of each vessels are preserved.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EMaybe the groups could also be linked to the main shortcuts on the left (braking, solar panels, lights, ...) in a way as to trigger only the corresponding elements in the active / main groups.\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"steveman0","CreatedById":64580,"CreatedDateTime":"2024-01-26T16:31:48Z","Content":"\n\u003Cp\u003E\nI have been bothered by this on several occasions. I like to build Apollo-style missions or even multi-craft loaded interplanetary vessels. I usually end up cramming all of the transported craft staged components to the top of the list somewhere. I can\u0027t be bothered to build this into a meaningful dozen\u002B stages given they tend to shift around on undocking anyway. This gets them out of the way but always results in a mess on undocking.\n\u003C/p\u003E\n\u003Cp\u003E\nGrouping might be the smartest way to handle the challenge of how to associate stage orders for undocked vessels as the grouping would provide some guiding hint how the (un)docked craft should be configured.\n\u003C/p\u003E\n"}]}