{"TopicId":223208,"ForumId":120,"TopicTitle":"Alert and Pause / Focus as an option on map routes, plus events window display","CreatedByName":"bolloxim","CreatedById":185398,"CreatedDateTime":"2024-01-23T04:24:31Z","PageNum":1,"Articles":[{"CreatedByName":"bolloxim","CreatedById":185398,"CreatedDateTime":"2024-01-23T04:24:31Z","Content":"\n\u003Cp\u003E\nSo, I like to run multiple missions, for example rescue Kerbals from Tylo because I didn\u0027t have the ΔV.   whilst also sending out a new ship to Dres.   However,  When adding a new Maneuver it doesn\u0027t stop at it, or worse if I setup multiple encounters I don\u0027t have any method except figure out the time to next event and make sure I don\u0027t error.  Which I end up doing.  So waiting 3 yrs for the next event in the chain..  I\u0027d rather launch a new Eeloo mission or Moho but now I have to wait till a transfer window occurs.\n\u003C/p\u003E\n\u003Cp\u003E\nSo my suggestion is that there is a method Add Alert on the time line which would halt any fast forwarding of time..  Adding an alert would then add it to an up-and-coming events window.\n\u003C/p\u003E\n\u003Cp\u003E\nThis window would let a player Time warp to the next event.  This could be include system generated events such as Orbital windows opening and closing with regards to to and from planets.. also with options to add an alert/pause by selecting it. \n\u003C/p\u003E\n\u003Cp\u003E\nBasically its a list of all events in chronological order, with ability to halt and focus on them.\n\u003C/p\u003E\n\u003Cp\u003E\nthank you for reading\n\u003C/p\u003E\n"},{"CreatedByName":"pg17","CreatedById":232200,"CreatedDateTime":"2024-01-23T16:49:55Z","Content":"\n\u003Cp\u003E\nJust a quick thought (in addition to the suggested alerts) \u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E: \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003Eit could be nice to have a timeline in the UI, with a dynamic or logarithmic scale, where you could see maneuver nodes and specific events (you could hover a label to get the type of event, craft concerned, time remaining and a \u0022fast forward to\u0022 button). Also, I don\u0027t know how multiplayer will work exactly, but it could also be used to see where (or in fact \u0022when\u0022) each player is currently at.\n\u003C/p\u003E\n"},{"CreatedByName":"bolloxim","CreatedById":185398,"CreatedDateTime":"2024-01-23T19:13:35Z","Content":"\n\u003Cp\u003E\nkind of how I thought multiplayer would work too, where you would see ghosts of other players that are now in the future,  then you would be able to sync time with the players for coop stuff, that would tie into an events window as you said so you can see where in time another player is, and sync to them..  nice addition pg17 \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}