{"TopicId":103334,"ForumId":56,"TopicTitle":"Saludos y dudas y mas dudas.","CreatedByName":"killerbram","CreatedById":140421,"CreatedDateTime":"2015-04-03T18:19:02Z","PageNum":1,"Articles":[{"CreatedByName":"killerbram","CreatedById":140421,"CreatedDateTime":"2015-04-03T18:19:02Z","Content":"Saludos desde uno de los centros de mandos de Kerbal en Malaga (Sur de EspaÃƒÂ±a) xd xd.\n\nllevo meses jugando a este juego (de casi 100 juegos de steam sin duda se ha convertido en mi favorito). Pero por mi cabezoneria (tozudez) de no usar mods (salvo mechjebs aunque solo con caracter informativo, para saber masa, altura real, relacion empuje y poco mas).\n\nLa cosa es que no he pasado de Mun y Minmus. De tomar tierra me refiero. Para poder aprender a jugar he empezado desde cero al menos 4 o 5 veces. Ahora al fin voy bien, estoy haciendo muchisimos puntos con solo haber explorado Kerbin, Mun y Minmus. Pero empieza lo complicado.\n\nResto de planetas, asteroides y las magnificas estaciones espaciales.\n\n**Tengo muchas dudas, algunas ya las he solucionado yo, otras las voy arreglando \u0022a golpes contra el teclado y a base de echarle horas\u0022 pero hay dos que no consigo tener claras aun y os las voy a preguntar.**\n\n**1) el \u0022control from here\u0022 no me termina de funcionar bien**\n\n**2) no termino de tener claro lo de \u0022engine LSP (ASP) y (VAC)\u0022**\n\n**o sea se lo que es, pero por ejemplo yendo a los motores que menos he usado, los de yet, si se supone que sin aire no funcionan porque te da datos de funcionamiento en vacio y encima datos tan buenos?**\n\n**O porque el \u0022jet basico\u0022 parece ser mucho mas rentable en ratio potencia consumo que el turbojet?**\n\n**Y porque el jet basico a veces me entrega toda la potencia y a veces no? (y como se calcula la cantidad de aire que un motor jet necesita?**\n\n**Y lo del control from here directamente no se porque funciona solo a veces, cuando lo uso, normalmente acabo teniendo el control de una de las naves y perdiendo el contro de la otra para siempre.**\n\n**Si alguien puede echarme una mano seria de mucha ayuda, gracias.**"},{"CreatedByName":"fitiales","CreatedById":66011,"CreatedDateTime":"2015-04-04T19:05:44Z","Content":"Hola killerbram.\n\nEn mi opiniÃƒÂ³n, no por poner mods vas a restarle emociÃƒÂ³n... al revÃƒÂ©s, anÃƒÂ­mate hombre con el Mechjeb jejeje, una cosa no quita la otra. CrÃƒÂ©eme, tarde o temprano lo utilizaras...\n\nBueno en todo caso te explico mÃƒÂ¡s o menos hasta donde yo sÃƒÂ©.\n\n1- No tengo ni idea que puede ser.\n\nSi no expones mas datos, versiÃƒÂ³n del juego, del modulemanager, del mechjb.... yo dirÃƒÂ­a que puede ser algÃƒÂºn tipo de conflicto entre estos ÃƒÂºltimos lo que podrÃƒÂ­a estar afectÃƒÂ¡ndote.\n\n2- Las siglas de impulso especÃƒÂ­fico en inglÃƒÂ©s para motores ASP (atmosfÃƒÂ©ricos) y VAC (en vacÃƒÂ­o).\n\nLos motores yet no funcionan sÃƒÂ­n aire, pero hay una partes como \u0022Ram Air Intake\u0022 y \u0022Shock Cone Intake\u0022 que si no recuerdo mal sirven de compresores a alturas extremas. Por eso muestran valores en vacÃƒÂ­o.\n\n-Te va a sonar a cantonÃƒÂ©s pero yo te dejo estos datos [**AQUÃƒÂ**](http://wiki.kerbalspaceprogram.com/wiki/Air_intake) y [**AQUÃƒÂ**](https://forum.kerbalspaceprogram.com/threads/97615-0-25-KSP-air-intakes-compared) y cuando puedas echas un ojo.\n\n-Este apartado de las naves no lo he entendido....sorry ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) y saludos ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)"},{"CreatedByName":"killerbram","CreatedById":140421,"CreatedDateTime":"2015-04-04T20:44:15Z","Content":"\u003E \n\u003E Hola killerbram.\n\u003E En mi opiniÃƒÂ³n, no por poner mods vas a restarle emociÃƒÂ³n... al revÃƒÂ©s, anÃƒÂ­mate hombre con el Mechjeb jejeje, una cosa no quita la otra. CrÃƒÂ©eme, tarde o temprano lo utilizaras...\n\u003E \n\u003E Bueno en todo caso te explico mÃƒÂ¡s o menos hasta donde yo sÃƒÂ©.\n\u003E \n\u003E 1- No tengo ni idea que puede ser.\n\u003E \n\u003E Si no expones mas datos, versiÃƒÂ³n del juego, del modulemanager, del mechjb.... yo dirÃƒÂ­a que puede ser algÃƒÂºn tipo de conflicto entre estos ÃƒÂºltimos lo que podrÃƒÂ­a estar afectÃƒÂ¡ndote.\n\u003E \n\u003E 2- Las siglas de impulso especÃƒÂ­fico en inglÃƒÂ©s para motores ASP (atmosfÃƒÂ©ricos) y VAC (en vacÃƒÂ­o).\n\u003E \n\u003E Los motores yet no funcionan sÃƒÂ­n aire, pero hay una partes como \u0022Ram Air Intake\u0022 y \u0022Shock Cone Intake\u0022 que si no recuerdo mal sirven de compresores a alturas extremas. Por eso muestran valores en vacÃƒÂ­o.\n\u003E \n\u003E -Te va a sonar a cantonÃƒÂ©s pero yo te dejo estos datos [**AQUÃƒÂ**](http://wiki.kerbalspaceprogram.com/wiki/Air_intake) y [**AQUÃƒÂ**](https://forum.kerbalspaceprogram.com/threads/97615-0-25-KSP-air-intakes-compared) y cuando puedas echas un ojo.\n\u003E \n\u003E -Este apartado de las naves no lo he entendido....sorry ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) y saludos ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)\n\ngracias por tu respuesta.\n\npues el juego lo tengo original y actualizado, con respecto al mechjet, lo que podria hacer es borrarlo y ponerla ultima version que haya, el module manager no se que version tengo y cual deberia tener para el juego actual la verdad.\n\ncon respecto al fallo de \u0022control fron here\u0022 aqui os dejo un ejemplo super basico\n\n[http://gyazo.com/35dbb268bed5de49d337467e93b467ca](http://gyazo.com/35dbb268bed5de49d337467e93b467ca)\n\nSaco a mi Kerbal de la capsula, antes de ello le doy a \u0022control from here\u0022 en la esfera de arriba del todo, la del satelite, pero en cuanto el kerbal esta fuera de la capsula, pierto TODO el control del vehiculo.\n\nOtros ejemplos de mis paranoias:\n\nMi ultimo gran cohete, donde \u0022el tamaÃƒÂ±o\u0022, si que importa xd xd:\n\n[http://gyazo.com/2d2400067c26c178ce0412a88fe24f36](http://gyazo.com/2d2400067c26c178ce0412a88fe24f36)\n\nY mi gran locura donde se mezcla el \u0022se podria hacer?\u0022 con \u0022esto vuela por mis cojones!\u0022\n\n...mmm bueno esta la tengo en otra carpeta y ahora no la encuentro, ya la subire!"},{"CreatedByName":"Nitojmg","CreatedById":139100,"CreatedDateTime":"2015-04-07T05:50:26Z","Content":"Hola @Killerbram, soy un usuario diario del KSP y soy de argentina, quizÃƒÂ¡s con estos tips te pueda ayudar.\n\nCon respecto a los motores: Leyendo en el foro, en Reddit y gracias a Scott Manley (si manejas Ingles fluidamente, ve sus videos en youtube, la verdad no te arrepentiras) los motores atmosfÃƒÂ©ricos funcionan mas o menos asi: \n\nEl motor mas bÃƒÂ¡sico de Jet (jet Engine) funciona mejor a baja cota (altura) y con mucho aire entrando por las tomas de aire (intakes). Su ISP (Specific Impulse o impulso especifico) es muy alto a baja altura donde la atmosfera es mas densa(desde los 0 mts a nivel del mar hasta los 10 km, pero a los 3 km ya comienzan a perder eficiencia), en la vida real es asÃƒÂ­ tambiÃƒÂ©n ya que estos funcionan haciendo pasar una corriente de aire directa por el motor, recalentandolo y haciendo que salga a presiÃƒÂ³n por detrÃƒÂ¡s de la tobera. Con 2 o 4 intakes estarÃƒÂ¡s bien, ten en cuenta que las intakes funcionan mejor mientras mas veloz vayas y mas densa sea la atmosfera, las primeras tomas de aire (intakes) tienen poco flujo de aire pero mas adelante seran mas rendidoras.\n\nEl turbo Jet Engine esta diseÃƒÂ±ado para vuelo de cota alta o vuelo de altitud (desde los 5 km hasta los 25-30 km), esto es debido a que estos motores funcionan con menos aire que los Jet comunes. Junto con estos motores has de utilizar las intakes de alto rendimiento (ram intakes) o los conos de choque (shock cone intake) ya que rinden mucho mas mientras mas alto y mas veloz se desplaza el aviÃƒÂ³n. \n\nEl ISP de las Turbo Jet puede llegar a ser muy alto y es mas alto aun mientras mas rÃƒÂ¡pido se va, pero entre los 25 - 30 km comienzan a perder empuje ya que se quedan sin aire y ten cuidado con el burnout (apagado rÃƒÂ¡pido) de alguna de estas ya que desestabiliza todo el aviÃƒÂ³n. El ISP mas alto de estas turbinas se encuentra cerca de los 18-20 km. \n\nAlgo que hay que tener en cuenta es que la cantidad de aire que hay a los 20 km es MuchÃƒÂ­simo menor que a los 3 km, por ende necesitaremos mas Intakes (ya sea de las Ram o de las Shock Cones) mÃƒÂ­nimo 2 por cada motor turbo que pongas al aviÃƒÂ³n.\n\nTIP: nunca pero NUNCA subas muy rÃƒÂ¡pido hasta la parte menos densa de la atmÃƒÂ³sfera (estratosfera) porque las turbinas se quedaran sin aire mucho mas rÃƒÂ¡pido. Si quieres ganar mucha velocidad y llegar al espacio, debes viajar con no mas de 20 Grados de inclinaciÃƒÂ³n hacia el espacio, asÃƒÂ­ las turbojet llegaran funcionando hasta los 35 km inclusive!\n\nLos motores duales como el RAPIER (stock) o el Sabre (B9 Aerospace Division) son motores que se utilizan para la construcciÃƒÂ³n de SSTO\u0027S (Single Stage To Orbit vehicle - vehÃƒÂ­culo de un solo stage hasta ÃƒÂ³rbita) y poseen menos potencia y menos ISP que los otros dos, pero con la capacidad de cambiar de modo (ciclo con aire - cliclo cerrado con oxidante, como un cohete comun).\n\nEstos motores ayudan a la hora de construir un SSTO, pero poseen menos empuje y menos ISP y por lo tanto menos rendimiento en atmÃƒÂ³sfera que los demÃƒÂ¡s pero al cambiar de modo se tiene un motor jet y un motor cohete, en una misma parte :3\n\nPara estos motores es recomendable hacer un cluster (poner muchos del mismo tipo RAPIER o Sabre) para tener mas potencia en la atmÃƒÂ³sfera y a la vez luego tener potencia en el espacio. Con los motores en modo ciclo de aire se puede llegar hasta los 30 -34 km teniendo 3 intakes por motor (Aprox), luego se cambian de modo y se recorre todo el trayecto en modo cohete.\n\nNOTA: al montar motores RAPIER o Sabre hay que tener en cuenta que hay que llevar combustible como para un cohete (Liquid Fuel \u002B Oxidizer) sino los motores en el espacio no funcionaran, eso conlleva a un aviÃƒÂ³n mas pesado y por ende el uso de mas motores para llevarlo a ÃƒÂ³rbita.\n\nCada turbina consume un mÃƒÂ­nimo de 0.2 de aire, a veces las turbojet funcionan con 0.1 cada una, pero es muy arriesgado y se consigue a altas velocidades.\n\nCon respecto a lo del problema controlando las naves:\n\nLa opcion \u0022control from here\u0022es utilizada cuando tienes mas de un modulo de control en una nave, por ej, tienes una capsula de comando MK1 y a la vez le acoplas una zonda OKTO por encima, la nave tendra dos lugares de donde puede ser controlada, con esa opciÃƒÂ³n puedes elegir desde donde sera controlada.\n\nSi sales de la nave con tu Kerbal, no importa que antes hayas puesto \u0022control from here\u0022, el Kerbal es tratado por el juego como otra \u0022nave\u0022, para volver a controlar la anterior nave tiene que usar las teclas [ ÃƒÂ³ ] que te permiten seleccionar cualquier modulo de comando o nave que este dentro de los 2,5 km cercanos a ti. Asi puedes ir intercalando entre manejar tu Kerbal en EVA o tu nave si es que posee una zonda (probe) como la que esta en la foto. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nBueno eso es todo lo que puedo aportar por ahora, ante cualquier duda o consulta no dudes en escribir! saludos y suerte en tus misiones Kerbalicas!"},{"CreatedByName":"marcoycoco","CreatedById":141795,"CreatedDateTime":"2015-04-27T14:18:43Z","Content":"Excelentes explicaciones! QuizÃƒÂ¡ aÃƒÂ±adirÃƒÂ­a que una vez has sacado un kerbal a pasear puedes darle a la tecla \u0022?\u0022 y cambiarÃƒÂ¡ el control a la nave o vehÃƒÂ­culo mÃƒÂ¡s cercano. Si sigues presionando volverÃƒÂ¡s a controlar de nuevo a tu kerbal. Es muy ÃƒÂºtil cuando tienes que acoplar dos naves para pasar de una a otra sin parar el juego (encender luces, activar estabilizador, abrir docking portal...etc)"},{"CreatedByName":"Kid A","CreatedById":148674,"CreatedDateTime":"2015-07-23T12:31:17Z","Content":"\u003E \n\u003E Con 2 o 4 intakes estarÃƒÂ¡s bien, ten en cuenta que las intakes funcionan mejor mientras mas veloz vayas y mas densa sea la atmosfera, las primeras tomas de aire (intakes) tienen poco flujo de aire pero mas adelante seran mas rendidoras.\n\u003E Algo que hay que tener en cuenta es que la cantidad de aire que hay a los 20 km es MuchÃƒÂ­simo menor que a los 3 km, por ende necesitaremos mas Intakes (ya sea de las Ram o de las Shock Cones) mÃƒÂ­nimo 2 por cada motor turbo que pongas al aviÃƒÂ³n.\n\nBuenas,\n\nBuenas explicaciones Nitojmg, solo una apreciaciÃƒÂ³n: cuidado con poner un nÃƒÂºmero muy elevado de intakes en un aviÃƒÂ³n, especialmente si es un SSTO. Con el cambio en la versiÃƒÂ³n 1.0 del modelo atmosfÃƒÂ©rico ahora el \u0027drag\u0027 (resistencia aerodinamica) tiene mucha mayor importancia. Es muy importante que tu aviÃƒÂ³n o SSTO tenga la menor resistencia aerodinamica posible, es decir, hay que intentar que sea lo mÃƒÂ¡s aerodinÃƒÂ¡mico posible: usa alas de perfil delta, poca superficie de alas, etc. Los intakes generan bastante resistencia aerodinamica, por lo que conviene minimizar su uso.\n\nAl final el tema es tratar de conseguir que haya un buen equilibrio entre la resistencia aerodinamica y el empuje generado por los motores. En mi experiencia, tener un intake de 1 (ram air intake) y uno o dos structural intake por turbo jet engine es suficiente para un SSTO de pequeÃƒÂ±o tamaÃƒÂ±o.\n\nAdemÃƒÂ¡s es conveniente cerrar los intakes cuando se activan los motores cohete (en la ÃƒÂºltima parte del ascenso, alrededor de 25-30 Km. de altura), esto se puede configurar en los action groups.\n\nVenga un saludo."}]}