{"TopicId":156666,"ForumId":56,"TopicTitle":"Conexión con kerbin","CreatedByName":"Asasing","CreatedById":175085,"CreatedDateTime":"2017-02-19T00:59:18Z","PageNum":1,"Articles":[{"CreatedByName":"Asasing","CreatedById":175085,"CreatedDateTime":"2017-02-19T00:59:18Z","Content":"\n\u003Cp\u003E\nHola, hace mucho que no toco el juego y ahora que he vuelto me he encontrado con la actualización de las antenas de comunicaciones y quería preguntar.\n\u003C/p\u003E\n\u003Cp\u003E\n¿Para que sirve estar conectado con kerbin?\n\u003C/p\u003E\n"},{"CreatedByName":"sandroxil","CreatedById":149348,"CreatedDateTime":"2017-02-19T09:52:36Z","Content":"\n\u003Cp\u003E\n1. Para poder manejar naves no tripuladas. Si no hay conexión directa, el centro espacial no puede conectar con la nave y por lo tanto no se puede controlar; se queda muerta hasta que hay conexión de nuevo. Esto puede ser un problema si es necesario hacer una maniobra, porque te pasas de largo y puedes perder la nave; si está en órbita, no es tan grave, ya que antes o después, volverá a haber conexión y se podrá maniobrar.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Para transmitir datos de ciencia. Las naves tripuladas se pueden pilotar sin que haya conexión, pero es necesaria la conexión para transmitir datos científicos y obtener ciencia.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPuedes poner varios satélites en órbita para que repitan la señal y así tener siempre una vía de conexión con el \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nY si quieres un poco más de dificultad, instalando el RemoteTech, es necesario dirigir cada antena para conectarlas entre ellas. Sin este mod, con que haya antenas, la señal busca el recorrido automáticamente.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}