{"TopicId":75005,"ForumId":56,"TopicTitle":"Bug? Reporte espacial","CreatedByName":"enzopasquali","CreatedById":110003,"CreatedDateTime":"2014-06-14T06:15:27Z","PageNum":1,"Articles":[{"CreatedByName":"enzopasquali","CreatedById":110003,"CreatedDateTime":"2014-06-14T06:15:27Z","Content":"\n\u003Cp\u003EQue tal gente, despÃƒÂ¹es de la ayuda que me dieron con el mechjeb, me volvÃƒÂ¬ un experto \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E (bueno basta de pabadas), solo lo utilizo para ver el dv que tengo y nada mÃƒÂ s, pude aterrizar en varios planetas y me puso muy contento, enviÃƒÂ¨ muchas sondas y tengo una buena cantidad de tanques de combustibles esperando para que mi nave se rellene en orbita ( me cuesta trabajo el doking aÃƒÂ¹n, solo hize 4 en kerbin y un doking para rescatar a bob que se quedo sin combusible en la orbita de duna)\u003C/p\u003E\u003Cp\u003EPero que susto me peguÃƒÂ¨ hoy cuando fui por primera vez a jool! lleve una nave tripulada con 2 sondas, pero al enviar la primera a la superficie, cuando llegÃƒÂ² a 0m empezÃƒÂ³ a descender!(nunca toco suelo) Fue directo al centro del planeta, y luego exploto a unos 250m debajo de la superficie (el mechjeb indicaba negativo) Me imagino que al ser un planeta gaseoso no tiene un suelo, pero pude ver algunas imagenes de que hasta podÃƒÂ¬an bajar kerbals, claro que la presion los destruia!!\u003C/p\u003E\u003Cp\u003EBueno eso era lo que queria contarles, ahora intentarÃƒÂ¨ descender la otra sonda en \u003Cspan style=\u0022font-family:sans-serif;\u0022\u003Elaythe sin estrellarme!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E les dejo la unica captura de pantalla que pude hacer. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/9sK3G.jpg\u0022 alt=\u00229sK3G.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2014-06-14T16:40:44Z","Content":"\n\u003Cp\u003EPor si no lo sabias Jool No es un planeta solido, Es gaseoso, por tanto carece de superficie solida y es una gran esfera de gases, No me extraÃƒÂ±arÃƒÂ­a que explotara por esa altura, Porque crees que nadie a colocado bases ahÃƒÂ­ que se sepa en los foros?, En fin, Supongo que la prÃƒÂ³xima vez deberÃƒÂ­as apuntar a Laythe que es una luna de islas y ahÃƒÂ­ funcionan los motores jet.\u003C/p\u003E\n"},{"CreatedByName":"Caid","CreatedById":74222,"CreatedDateTime":"2014-06-15T08:14:45Z","Content":"\n\u003Cp\u003EA veces, afortunadamente muy pocas, el juego no detecta la \u0022colision\u0022 entre la superficie de un planeta y la nave, por lo que la nave sigue bajando por debajo de la superficie. Creo que antes era un fallo mÃƒÂ¡s comÃƒÂºn, ahora no suele pasar.\u003C/p\u003E\u003Cp\u003EEn cualquier caso, Jool es una planeta gaseoso, asÃƒÂ­ que las sondas / naves / cualquier cosa que metas ahÃƒÂ­ acaba explotando por la presiÃƒÂ³n. No has perdido nada.\u003C/p\u003E\u003Cp\u003EA Laythe es fÃƒÂ¡cil bajar, cualquier cosa con paracaidas llegarÃƒÂ¡ al suelo sana y salva. El problema es que, o apuntas bien, o acabarÃƒÂ¡ flotando en el ocÃƒÂ©ano. \u003C/p\u003E\u003Cp\u003EValls tambiÃƒÂ©n se merece una visita \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/450665965894960318/140B99F019F2766C2942AD772F36B020FD01187E/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-16T19:22:04Z","Content":"\n\u003Cp\u003ENo se si tenga que ver con el tema, pero leyendo los mensajes, me di cuenta que quiero saber que es el DELTA-AV, ni idea y eso de TWT tampoco se... osea hay alguna guia que explique basicamente que significan esas siglas, o terminos... que ni idea.. me baje por ejemplo el Engenier Redux, que tiene todo eso, pero no entiendo mucho... creo que (tirando fruta) es cuan lejos se puede llegar, o el poder de los motores, algo vi en wikipedia pero no gaste demasiado tiempo en comprender, pq leia y no entendia mucho, y ta queria viciarme y jugar jejej.\u003C/p\u003E\u003Cp\u003EEntonces agradezco alguna guia o terminos basicos por ejemplo.\u003C/p\u003E\u003Cp\u003EGracias. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"fitiales","CreatedById":66011,"CreatedDateTime":"2014-06-16T20:29:37Z","Content":"\n\u003Cp\u003EEl Delta-V es una medida. Es el cambio de velocidad o empuje realizado por los motores dentro de un espacio/tiempo.\u003C/p\u003E\u003Cp\u003EMuy util en los viajes largos (y no tan largos), en mechjeb por ejemplo:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.kerbalspaceprogram.fr/wp-content/uploads/2013/08/mechjeb-deltav-300x174.png\u0022 alt=\u0022mechjeb-deltav-300x174.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage AV y Total AV\u003C/strong\u003E (no tiene misterio, son metros/segundo)\u003C/p\u003E\u003Cp\u003EAparecen las fases (\u003Cstrong\u003Estages\u003C/strong\u003E)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThrust-to-weight ratio TWR\u003C/strong\u003E (RelaciÃƒÂ³n empuje-peso)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAtmo AV\u003C/strong\u003E (empuje vectorial atmosferico)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAtmo time\u003C/strong\u003E (tiempo de quema de motor en atmosfera al 100% , creo)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVac AV\u003C/strong\u003E (empuje vectorial en vacio)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVac time\u003C/strong\u003E (tiempo de quema de motor en vacio al 100% , creo)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERCS AV\u003C/strong\u003E (monopropelente)\u003C/p\u003E\u003Cp\u003E--------------------------------------------------------------\u003C/p\u003E\u003Cp\u003ETodas son muy validas a la hora de construir naves o planear viajes dado que va sumando el total del DeltaV necesario para cada orbita y planeta.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-16T20:32:11Z\u0022 title=\u002206/16/2014 08:32  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 16, 2014\u003C/time\u003E by fitiales\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-16T21:36:13Z","Content":"\n\u003Cp\u003ESigo viendo caracteres jeje..\u003C/p\u003E\u003Cp\u003EQue estaria bien en ese caso, por ahi lei que el TWR no puede ser menor a 1. Por ejemplo ese AV total de 2266,3425 m/s Ã‚Â¿que seria? el total de m/s que la nave llegaria?\u003C/p\u003E\n"},{"CreatedByName":"enzopasquali","CreatedById":110003,"CreatedDateTime":"2014-06-18T21:24:29Z","Content":"\n\u003Cp\u003EGracias a todos por sus respuestas, eh logrado aterrizar en Lahyte, bastante sencillo, aunque aterrize en el agua, estoy construyendo un rover para enviarlo ahora mismo, aunque no me esta resultando sencillo la construccion, ya que es difici conseguir un centro de gravedad que no me desvÃƒÂ¬e la nave.\u003C/p\u003E\u003Cp\u003EGotcha :\u003C/p\u003E\u003Cp\u003ESi estas despegando de Kerbin y el TWR es menor a uno no asciende. Si es 1, apenas se levanta hasta que consume un poco de combustible y el TWR aumenta, pero en el espacio el TWR no tiene porque ser mayor que 1, pero con un valor pequeÃƒÂ±o, digamos 0.05 tendrias que estar quemando mucho tiempo para logar la misma orbita que con un TWR mayor lo harÃƒÂ¬as en minutos\u003C/p\u003E\u003Cp\u003ENo estoy seguro de esto, pero el AV es una medida ( escalar cuando estas refiriendote a la cantidad que tienen el la nave, o vectorial cuando haces un manuver node).\u003C/p\u003E\u003Cp\u003ECuando estas en el espacio, el total de AV es el cambio de velocidad que podras lograr en ese punto de la orbita ( ya que si no es perfectamente circular, la velocidad varÃƒÂ¬a en los distintos puntos de la orbita excÃƒÂ©ntrica )\u003C/p\u003E\n"}]}