{"TopicId":75936,"ForumId":56,"TopicTitle":"Preguntas Mod Remote-Tech 2","CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-25T17:10:06Z","PageNum":1,"Articles":[{"CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-25T17:10:06Z","Content":"\n\u003Cp\u003EHola bueno,venia jugando ya, ya habia puesto algunos satelites en tierra, y en la luna de esos de scanera la superficie con el ScanSat. Ahora bien, instale el RemoteTech y claro esos ya no los puedo manejar, y todo es porque me cambia el funcionamiento debido al mod RemoteTech... pregunto: Ã‚Â¿puedo mandar una mision a un macaco a arreglar la antena que tiene ya puesta este mod, o mandarlo a colocarle otra antena sin tener que traer esos satelites de nuevo? cosa q para eso tendria que sacar el mod RemoteTEch, traer las naves a tierra, colocar el mod y volver a mandar las naves.\u003C/p\u003E\u003Cp\u003EOtra pregunta referido al mod: ahora ya no todas las antenas sirven? creo que por lo que vi ahora para colocar antenas es preferible por no decir obligatorio colocar las antenas que vienen en el mod? pq ya las otras que vienen \u0022de fabrica\u0022 no sirven?\u003C/p\u003E\u003Cp\u003EGracias.\u003C/p\u003E\u003Cp\u003ESlds.\u003C/p\u003E\n"},{"CreatedByName":"fitiales","CreatedById":66011,"CreatedDateTime":"2014-06-25T18:52:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gotcha\u0022 data-cite=\u0022Gotcha\u0022\u003E\u003Cdiv\u003E... pregunto: Ã‚Â¿puedo mandar una mision a un macaco a arreglar la antena que tiene ya puesta este mod, o mandarlo a colocarle otra antena sin tener que traer esos satelites de nuevo? \u003Cp\u003EOtra pregunta referido al mod: ahora ya no todas las antenas sirven? creo que por lo que vi ahora para colocar antenas es preferible por no decir obligatorio colocar las antenas que vienen en el mod? pq ya las otras que vienen \u0022de fabrica\u0022 no sirven?\u003C/p\u003E\u003Cp\u003ESlds.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELa primera es que si, puedes mandar a alguien. Siempre y cuando la antena tenga el ModuloGrab de KAS y puedas agarrarla.\u003C/p\u003E\u003Cp\u003EPara la segunda, si sirven, si tienes los archivos CFG de cada mod (con el mismo Remotetech vienen para squad y capsulas).\u003C/p\u003E\u003Cp\u003EAqui en el quinto post , el cfg para AIES, que lo puedes ubicar dentro de la misma carpeta Remotetech.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/56399-Now-defunct-thread-that-should-not-appear-in-google-search?p=968400\u0026amp;highlight=aies#post968400\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/56399-Now-defunct-thread-that-should-not-appear-in-google-search?p=968400\u0026amp;highlight=aies#post968400\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-25T18:56:15Z\u0022 title=\u002206/25/2014 06:56  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 25, 2014\u003C/time\u003E by fitiales\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2014-06-25T20:28:44Z","Content":"\n\u003Cp\u003ENo es porque las antenas no sirvan, Mas bien estÃƒÂ¡n fuera de su rango mÃƒÂ¡ximo de repeticiÃƒÂ³n (RepeticiÃƒÂ³n es el termino usado para decir que la sonda esta respondiendo) Todas las antenas del mod (Y las del stock segÃƒÂºn la configuraciÃƒÂ³n) Mostraran su rango mÃƒÂ¡ximo, Trata de no excederte de el o pasaran cosas malas, No es chiste porque de todos los mods que he usado este es uno de los mas complejos, Requieres montar una red de comunicaciones extensa y elaborada para esto, La soluciÃƒÂ³n mas fÃƒÂ¡cil seria como yo lo hice, Por medio del transbordador.\u003C/p\u003E\u003Cp\u003ECabe aclarar que no trate de responder la pregunta nadamas, Sino que tambiÃƒÂ©n te doy mi consejo para que puedas sobrevivir a las adversidades que genera ese mod.\u003C/p\u003E\n"},{"CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-26T19:13:44Z","Content":"\n\u003Cp\u003ESi, funciono, tuve que mandar a jebediah para colocar y a redireccionar un satelite. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-28T03:26:30Z","Content":"\n\u003Cp\u003EUna duda del remote tech... a la hora de configurar una antena, esta la opcion de \u0022activate vessel\u0022 .. no entiendo la utilidad, pq lo probe sin activar y activado y no note la diferencia. Alguien me explica.\u003C/p\u003E\u003Cp\u003EOtra pregunta acerca del mod es: Ã‚Â¿para detectar objetos, digamos asteorides, rocas, etc ... se puede apuntar antenas a diferentes secciones del espacio? o se descubren de otra manera?\u003C/p\u003E\u003Cp\u003EGracias.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T03:29:45Z\u0022 title=\u002206/28/2014 03:29  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by Gotcha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fitiales","CreatedById":66011,"CreatedDateTime":"2014-06-28T14:10:06Z","Content":"\n\u003Cp\u003ECreo recordar que cuando se \u0022deja\u0022 \u003Cem\u003E(creo que es esencial dejarlo puesto)\u003C/em\u003E Active Vessel puesto o activado , automaticamente esas antena/s que lleve la nave apuntaran a la que tu estas controlando para tener control sobre la misma.\u003C/p\u003E\u003Cp\u003ESi quieres mas info, estoy terminando de traducir este apartado en la wiki-kerbal, aunque me queda bastante, (me lleva a ratos) .... (que sepais que se puede colaborar a modificar y/o aÃƒÂ±adir lo que os parezca) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:RemoteTech2/es\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Tutorial:RemoteTech2/es\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPara detectar objetos, solo conozco desde el menÃƒÂº El Campo de Antenas y ahÃƒÂ­ haces un seguimiento de los asteroides, pero nada mas...\u003C/p\u003E\u003Cp\u003ECreo y desconozco que de momento si no es con algÃƒÂºn mod, que no haya mas objetos que descubrir, (no sÃƒÂ© sÃƒÂ­ entendÃƒÂ­ bien tu pregunta), quitando los de mapeo como khetano y Scansat.\u003C/p\u003E\u003Cp\u003EPD: no tiene nada que ver pero ya que hoy es el dia algunos partidos, querÃƒÂ­a desear suerte a todos los aficionados americanos al futbol, sur y norte, para esos octavos de final, estÃƒÂ¡n haciendo un gran Mundial . . . a por ellos!! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E:cool:\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T14:24:41Z\u0022 title=\u002206/28/2014 02:24  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by fitiales\u003C/strong\u003E\n\u003Cbr\u003EPD\n\u003C/span\u003E\n"},{"CreatedByName":"lepla","CreatedById":114134,"CreatedDateTime":"2014-07-08T16:47:27Z","Content":"\n\u003Cp\u003Euna pregunta,\u003C/p\u003E\u003Cp\u003Eigual no tengo debidamente instalado el mod:\u003C/p\u003E\u003Cp\u003Eno veo en mi KSP las rayitas de intercomunicacion que se aprecian en esta foto\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/d/d8/RT2-first-relay-sats.png\u0022 alt=\u0022RT2-first-relay-sats.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ey lo ÃƒÂºnico que parece que ocurre al tener instalado el parche es que no se mandan los reports EVA o Crew Report desde la luna. en el resto de temas no veo ninguna cosa.\u003C/p\u003E\u003Cp\u003Etambien es cierto que tengo 14 mods funcionando, igual algunos inciden sobre otros de manera insospechada.\u003C/p\u003E\n"},{"CreatedByName":"fitiales","CreatedById":66011,"CreatedDateTime":"2014-07-08T19:52:10Z","Content":"\n\u003Cp\u003ETienes que tener una paleta con iconos en la parte de abajo a la derecha , tal como esta:\u003C/p\u003E\u003Cp\u003EEn mi caso tengo instalada la Version 1.4.0 y no me salen del todo, (me salen casi desfondados en la parte mas inferior de la pantalla, pero se que es problema de la resoluciÃƒÂ³n con la que juego y aun asi puedo usarlos)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/raENChN.png\u0022 alt=\u0022raENChN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EY esta es la que te hace desaparecer o mostrar las lineas de conexiÃƒÂ³n con el KSC.\u003C/p\u003E\u003Cp\u003EEs por eso que no puedes transmitir datos , dado que la linea tiene que estar en verde para que funcione la conexion de datos, no creo que los otros mods te esten machacando.\u003C/p\u003E\u003Cp\u003EPongo unas referencias que pueden ayudar: escrito por Creat en el post RT2.\u003C/p\u003E\u003Cp\u003E Verde (lÃƒÂ­nea normal): Connect/Targeted\u0027\u003C/p\u003E\u003Cp\u003E Verde (lÃƒÂ­nea discontinua): \u0027Connected/Active Vessel\u0027\u003C/p\u003E\u003Cp\u003E Verde (lÃƒÂ­nea de puntos): \u0027Connectec/In target Cone\u0027\u003C/p\u003E\u003Cp\u003E Amarillo (lÃƒÂ­nea normal): \u0027LoS Obstruction\u0027\u003C/p\u003E\u003Cp\u003E Amarillo (lÃƒÂ­nea discontinua): \u0027LoS Obstruction/Active Vessel\u0027\u003C/p\u003E\u003Cp\u003E Amarillo (lÃƒÂ­nea de puntos): \u0027Connectec/In target Cone\u0027\u003C/p\u003E\u003Cp\u003E Rojo: Igual que el anterior, que significa \u0022Fuera de alcance\u0022\u003C/p\u003E\u003Cp\u003ESaludos\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-08T20:00:23Z\u0022 title=\u002207/08/2014 08:00  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 8, 2014\u003C/time\u003E by fitiales\u003C/strong\u003E\n\u003Cbr\u003Epd\n\u003C/span\u003E\n"},{"CreatedByName":"lepla","CreatedById":114134,"CreatedDateTime":"2014-07-09T06:33:08Z","Content":"\n\u003Cp\u003Egracias, lo cierto es que no tenia el mod instalado (tengo 20 mods y creÃƒÂ­a que este estaba instalado, pero no) \u003C/p\u003E\u003Cp\u003Eya lo he puesto y va perfecto. es genial. le da una profundidad maravillosa.\u003C/p\u003E\u003Cp\u003Elo que tengo que hacer ahora es instalar una antena en mi base lunar (por ahora solo un extractor de Ketano) para que vuelva a funcionar.\u003C/p\u003E\n"},{"CreatedByName":"MawLr","CreatedById":77407,"CreatedDateTime":"2014-08-10T05:09:23Z","Content":"\n\u003Cp\u003EA mi me pasa lo mismo, no me aparece la conexiÃƒÂ³n con el KSC (ni las lineas de conexiÃƒÂ³n) pero lo demÃƒÂ¡s si me aparece, lo extraÃƒÂ±o es que al parecer solo funcionan los GUI\u0027s que tiene el mod, creo que lo he instalado incorrectamente pero todo parece normal, cuando mande el primer satÃƒÂ©lite en ÃƒÂ³rbita geosÃƒÂ­ncrona de Kerbin (700km si no me equivoco), tenia la antena Reflectron DT-10 (y la antena con forma de plato pequeÃƒÂ±a con una Communtron 36) pero aun asÃƒÂ­ cuando estaba en la plataforma de despegue aparecÃƒÂ­a que no tenia conexiÃƒÂ³n, lo extraÃƒÂ±o es que yo tenia control sobre el cohete, incluso cuando realize varias ÃƒÂ³rbitas seguÃƒÂ­a con control del satÃƒÂ©lite, la verdad no se si es problema de instalaciÃƒÂ³n. Cabe mencionar que mi KSP es la version de Mac 0.24.2 y que si, efectivamente tengo el ModuleManager instalado. (los ÃƒÂºnicos mods instalados que tengo ademas de este son el MechJeb2, KW Rocketry, Final Frontier y el Chatterer.)\u003C/p\u003E\n"},{"CreatedByName":"Angel.mq","CreatedById":150528,"CreatedDateTime":"2015-08-31T17:13:07Z","Content":"\n\u003Cp\u003EBuenas tardes chicos, estoy viendo los mensajes de este hilo y veo que son bastante antiguos.. ojala tenga suerte y alguien lo lea y pueda ayudarme. \u003C/p\u003E\u003Cp\u003EJuego en 1.0.4 y he insatalado el Remote Tech. Todo perfecto hasta que he intentado crear mi primera red de satelites \u0022Lansat\u0022. Son 3 satelites identicos, equipados cada uno con 4 antenas de las de palito blancas y rojas de mas alcance y una de las grandes doradas. El problema es que no consigo triangular la seÃƒÂ±al entre ellos, estan en orbita geoestacionaria a 2.868,75 km a una velocidad de 1009 m/s, que creo que son los datos correctos. No se si es que tendre que orientar las antenas de los satelites de alguna forma o algo.. A ver si alguien me ayuda, gracias!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFoto de como esta ahora mismo el sistema.\u003C/p\u003E\n"}]}