{"TopicId":110002,"ForumId":66,"TopicTitle":"Devnote Tuesday: Back to Work!","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2015-05-19T21:02:00Z","PageNum":6,"Articles":[{"CreatedByName":"Jovzin","CreatedById":105152,"CreatedDateTime":"2015-05-21T06:30:28Z","Content":"Why multiplayer crap ? First fix that damn memory leak!!! I heard that the switching between plane and buildings memory leak is still present in 1.0.2 !!! And you told us that you fixed it !!! \n\nGuys I am loosing interest in this game becuase of those lies and bugs this game has. Those memory leaks are really the worst thing in the game. \n\nBtw why multiplayer ? It should be single player game right ? Why community wants that multiplayer so much ? Go play Dota or wow which are multi player games. But KSP ?? Hmm I do not think KSP should have multiplayer. What you get with it ? Ability to boast who has bigger rocket ??? Stupid..."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-05-21T07:45:09Z","Content":"\u003E \n\u003E It\u0027s been said a few times here, but seriously: no hotfix?\n\nDid you miss this, quoted a few pages back?\n\n\u003E \n\u003E Unity 5 is a timeconsuming but very rewarding task. However, fingers crossed and we\u0027ll have 1.0.3 out before the week\u0027s over.\n\n\u003E \n\u003E Just to clarify, that\u0027s 1.0.3 coming this week if everything works out. Not Unity 5. You savages."},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-05-21T08:36:19Z","Content":"\u003E \n\u003E Did you miss this, quoted a few pages back?\n\nAha! I did, thanks!\n\nI\u0027m now a much happier camper ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-21T08:54:09Z","Content":"\u003E \n\u003E Did you miss this, quoted a few pages back?\n\nI missed that too, thanks for relaying it again ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nLol, it would help if that sort of important detail got edited into the first page post rather than just idly tweeted on a tuesday afternoon ^^;"},{"CreatedByName":"ShadowZone","CreatedById":112420,"CreatedDateTime":"2015-05-21T11:39:19Z","Content":"\u003E \n\u003E Why multiplayer crap ? First fix that damn memory leak!!! I heard that the switching between plane and buildings memory leak is still present in 1.0.2 !!! And you told us that you fixed it !!! \n\u003E Guys I am loosing interest in this game becuase of those lies and bugs this game has. Those memory leaks are really the worst thing in the game. \n\u003E \n\u003E Btw why multiplayer ? It should be single player game right ? Why community wants that multiplayer so much ? Go play Dota or wow which are multi player games. But KSP ?? Hmm I do not think KSP should have multiplayer. What you get with it ? Ability to boast who has bigger rocket ??? Stupid...\n\nWhile I am no friend of Multiplayer in general, I had a few situations where playing with others would have helped. I was building a base on Minmus - and travelling between base, orbit and ore refinery (2 lifter cranes, 1 transport rover, 1 mining rig, 1 orbital station) was rather tedious. If I would have had help I could have done it a lot quicker and it would have been more fun.\n\n\u0022Hey, get back up into orbit and get us the next module while I fiddle with the ones on the ground trying to make them fit together.\u0022\n\nSo yeah... Multiplayer can have its merits. Nobody forces you to do it, KSP will still be a strongly focused single player game, I imagine.\n\nAnd while I agree on your criticism of the memory leaks I do not agree with the tone you are using."},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-05-21T11:59:45Z","Content":"Welcome back. Glad none of you had a lithobraking incident.\n\nGreat news regarding U5. Looks like a lot of good things are in the pipeline. If the game stays the same and runs on that platform (with multithreaded physics and 64 bit) I will be very impressed with the amount of hard work that you guys will have done.\n\nKeeping things the same on a different platform is not as easy as a lot of people may think.\n\nVery much looking forward to seeing a hotfix in the near future, some comment about it on the official forum (rather than a repost from twitter or reddit) would be nice though..."},{"CreatedByName":"nadreck","CreatedById":89087,"CreatedDateTime":"2015-05-21T17:03:54Z","Content":"\u003E \n\u003E Aerocapture. You\u0027re going from hyperbolic to elliptical orbit. Aerocapture does not denote a circular orbit, it denotes being *captured* by the target body.\n\nYet you quoted earlier:\n\n\u003E \n\u003E NASA defines them as two different things; aerocapture is a very sudden maneuver designed for orbital insertion, diving deeply into an atmosphere to scrub interplanetary velocities, aerobraking is a very gentle maneuver designed for use once in a stable orbit, skimming the atmosphere to reduce apoapsis over time. Hell, even the KSP Wiki makes that distinction. They\u0027re distinct techniques even though people around here use aerobraking interchangeably with aerocapture.\n\nso which is it deep and sudden, or all maneuvers that use the atmosphere of the target body to \u0027capture\u0027 the craft in orbit\n\nbut be careful if you can change that definition to suit you and to be less specific but within the meaning of prefix and suffix roots of the word then I get to define aerobraking based on the same meanings and braking means slowing\n\n\u003E \n\u003E No one cares, we\u0027re having an argument here.\n\n![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-05-21T18:29:08Z","Content":"\u003E \n\u003E so which is it deep and sudden, or all maneuvers that use the atmosphere of the target body to \u0027capture\u0027 the craft in orbit\n\u003E but be careful if you can change that definition to suit you and to be less specific but within the meaning of prefix and suffix roots of the word then I get to define aerobraking based on the same meanings and braking means slowing\n\nGood catch. The definition I see pretty much everywhere *but* the KSP forums is that aerocapture is a maneuver that involves being captured into an elliptical orbit from a hyperbolic one using a body\u0027s atmosphere to slow down. Aerobraking, on the other hand, is used once one is in an elliptical orbit to reduce apoapsis. An aerogravity assist would be one where you use the inherent lift of your craft while diving into a body\u0027s atmosphere to attain even greater velocities from a gravity assist. All of these fall under the general heading of \u0022aeroassist\u0022 rather than \u0022aerobraking\u0022 since certain maneuvers don\u0027t involve braking. Aerobraking is a specific maneuver."},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2015-05-21T21:22:11Z","Content":"I honestly think there should be a patch to fix 1.0, as it seemed rushed. Then you can start the monumental task of recreating the game in Unity 5. Are you going to update the current game or focus only on the new version?"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-05-21T21:50:52Z","Content":"\u003E \n\u003E I honestly think there should be a patch to fix 1.0, as it seemed rushed. Then you can start the monumental task of recreating the game in Unity 5. Are you going to update the current game or focus only on the new version?\n\nThey\u0027ve already mentioned a patch in the works, should hopefully be out soon."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-05-23T04:48:57Z","Content":"\u003E \n\u003E Sorry about the Squadcast this week guys, had a work emergency to deal with. We\u0027re still working on 1.0.3\n\nPerhaps next week. Not too surprised the patch didn\u0027t make it this week, given the previous SQ talk and other broad signs that per-part drag tweaks are needed, to bring things into better balance."},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2015-05-23T05:33:47Z","Content":"Sweet! If I come to mexico, can we jump/fall out of a plane together? Pretty please? ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-05-23T11:50:14Z","Content":"\u003E \n\u003E I honestly think there should be a patch to fix 1.0, as it seemed rushed. Then you can start the monumental task of recreating the game in Unity 5. Are you going to update the current game or focus only on the new version?\n\nThere have been two patches to fix 1.0\n\nThere was 1.0.1 and then 1.0.2. \n\nStill needs a patch though."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-23T12:11:26Z","Content":"The good news is that 1.0.3 is under development and should be released Soon."},{"CreatedByName":"ghostbuzzer7","CreatedById":138096,"CreatedDateTime":"2015-05-23T12:49:32Z","Content":"\u003E \n\u003E The good news is that 1.0.3 is under development and should be released Soon.\n\nNo spoilers for us? Ahh, can\u0027t wait then ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-23T18:06:18Z","Content":"\u003E \n\u003E No spoilers for us? Ahh, can\u0027t wait then ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nRed\u0027s in the same boat with the rest of us. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"s.maelstrom","CreatedById":116120,"CreatedDateTime":"2015-05-25T12:40:50Z","Content":"\u003E \n\u003E Can you turn up the re-entry heat just a little?\n\nYou can modify savefile config to put reentry heating to as high as you like. I personally set it to 280%. In persistent.sfs the line you\u0027re looking for is \u0022ReentryHeatScale\u0022.\n\n**Edited \u003Ctime datetime=\u00222015-05-25T14:21:16Z\u0022 title=\u002205/25/2015 02:21  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 25, 2015\u003C/time\u003E by s.maelstrom**"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-05-25T22:20:11Z","Content":"So if there are going to be U.I. updates, can we finally get a useful radar altimeter readout outside of IVA mode, also Delta-v and TWR stats in the engineer\u0027s report?\n\nI consider some type of docking port alignment indicator an optional extra, but that would be nice too.\n\nEverything else is great, you know, except for the bugs.\n\nThanks,\n\nChris Maillet"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-05-26T00:14:45Z","Content":"\u003E \n\u003E So if there are going to be U.I. updates, can we finally get a useful radar altimeter readout outside of IVA mode, also Delta-v and TWR stats in the engineer\u0027s report?\n\u003E I consider some type of docking port alignment indicator an optional extra, but that would be nice too.\n\nSo, basically, please stockify VOID and Navball Docking Alignment Indicator"}]}