{"TopicId":146868,"ForumId":66,"TopicTitle":"Devnote Tuesday: QA focus","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2016-08-31T12:25:23Z","PageNum":7,"Articles":[{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-09-04T13:32:30Z","Content":"\n\u003Cp\u003E\nLots of discussion once again on career mode/science, and there is no one way to make everyone happy. I think the options/resource sliders that you can tweak when starting a game are pretty powerful, and that combined with Contract Configurator makes the game pretty customizable.\n\u003C/p\u003E\n\u003Cp\u003E\nFor fun I\u0027ll throw out another career idea:\n\u003C/p\u003E\n\u003Cp\u003E\nThe tech tree is gone, replaced by a system where closed tech branches \u0022get the OK to proceed,\u0022 aka open up, when X amount of science is obtained from Y body. The tech can then be unlocked for use by using funds. The balance will give enough tech to proceed to the next logical planet, yet give skilled players enough to shoot for more advanced ones. Extra science from a body can be traded in for funds at a rate that increases based on where it was obtained from. The main benefit: getting cool new parts is a great motivation to get players to go interplanetary, as opposed to contracts. Currently one can unlock the tech tree without leaving Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, which seems a bit too easy IMO. Also, it makes \u0022realistic\u0022 sense in a way- the space program has to prove it can comfortably achieve certain goals before moving on to harder ones.\n\u003C/p\u003E\n\u003Cp\u003E\nJust another career mode idea, nothing to see here \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"StahnAileron","CreatedById":139783,"CreatedDateTime":"2016-09-04T13:32:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741149\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472938841\u0022 data-ipsquote-userid=\u0022107529\u0022 data-ipsquote-username=\u0022Curveball Anders\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Curveball Anders said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn other words, you want a different game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTo an extent, I do, in fact. I love KSP because of the topic it covers more than anything else. It\u0027s a great sandbox\u003Cem\u003E simulation \u003C/em\u003Eof a complex subject. But make no mistake, KSP as it currently stands has little to no gameplay mechanics in relation to what I would define as a \u0022game\u0022. There is no set goal (fine for some, troublesome for others, like myself; I want/need an objective/purpose OTHER than anything I can come up with myself); the token gameplay mechanics that are implemented are half-baked, ill-thought out, or just make no sense; there\u0027s no end-game content/activities for long-term play past meeting any goals. A lot of this can be corrected by mods, but a \u0022game\u0022 that relies on community supplied mods is not a game in itself: it\u0027s a \u003Cem\u003Eplatform\u003C/em\u003E for a game.\n\u003C/p\u003E\n\u003Cp\u003E\nTo top this off, KSP is a cluster of a programming project. Engine refactor post-commercial release that\u0027s advertised as a Patch/Update? I have never seen that done before, not without a full version release. (Or a re-released edition, like Directors cuts, but those also add more content like a mini-expansion... Or as it\u0027s known these days, DLC Add-on.)\n\u003C/p\u003E\n\u003Cp\u003E\nFor gameplay mechanics, Career is a joke. Funds don\u0027t really mean much except in the early game. It (along with a player\u0027s patience and ability to multi-task) is just a limiter on how many craft you can have active at any point. Fine, but that\u0027s about it\u0027s ONLY purpose. Science as a resource that easy but tedious to acquire is just boring. And you can practically ignore Reputation. Strategies make no sense (assuming they even work right...). The research system is fairly limited (this I can forgive a bit due to the sheer number of parts in the game that would have to be tracked for a GOOD research tree...) Pilot stats mean nothing in practice. Pilot levels have little bearing in typical play. (Probe cores can supplement Pilots, not breaking things make Engineers pointless, and Scientists make a tedious mechanic either more or less tedious depending on how much you care about efficiency; the increasing hiring cost makes no bloody sense either. I\u0027d rather pay a daily wage to my kerbonauts.) Lastly, the various mechanics barely feedback into one another. You can practically remove any of those mechanics and it wouldn\u0027t affect basic play in career. What kind of game has mechanics that don\u0027t support one another?\n\u003C/p\u003E\n\u003Cp\u003E\nIf I look at KSP as just a game in it stands now, it\u0027s boring as hell. Everything is tedium. (Unless you\u0027re an engineer who spends more time designing than \u0022playing\u0022.) There\u0027s little to no incentive to do anything once you get used to playing. Practically all the real fun and joy of KSP lies in the first-time experience. \u0022Woo! Rocket didn\u0027t blow up on launch!\u0022, \u0022Yay! Space!\u0022, \u0022Heck yeah! Orbit!\u0022 etc. If you get adept at it, everything is a repetitive chore. \u0022Okay, circularizing burn now\u0022, \u0022Apo burn #3\u0022, \u0022Ah, there\u0027s the Mun, time to burn\u0022, etc. If I understand and know how to launch a rocket into orbit routinely, why must I do it for the umpteenth time to do anything that would be new to me? At some point, I should be able to graduate from the micromanagement to macro-management. Do I really need to personally be involved in every action in the game? I say no: by \u0022end-game\u0022 (whatever that is), I should be able to just say, \u0022Okay, at this point, do a 100m/s burn for injection. Then at intercept periapsis, circularize.\u0022 I shouldn\u0027t need to be personally present for a craft to accomplish that.\n\u003C/p\u003E\n\u003Cp\u003E\n...All right, now I\u0027m really starting to rant. I\u0027m gonna cut myself short now. There\u0027s more I can/want to say to explain my view more/better, but I\u0027ve been at this long enough. I\u0027ll shut up now.\n\u003C/p\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2016-09-04T13:39:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741707\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472995960\u0022 data-ipsquote-userid=\u0022139783\u0022 data-ipsquote-username=\u0022StahnAileron\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, StahnAileron said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTo an extent, I do, in fact.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile I agree with some of your points I don\u0027t think such massive rewrites of several core systems is something that can be solved in free updates.\n\u003C/p\u003E\n\u003Cp\u003E\nWe\u0027ve discussed a theoretical KSP2 several times on the forums, and I think you\u0027ve outlined several things that could make such a beast possible.\n\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2016-09-04T14:42:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741659\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472991549\u0022 data-ipsquote-userid=\u0022100625\u0022 data-ipsquote-username=\u0022GorillaZilla\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, GorillaZilla said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve hated the current science system from the start because of how nonsensical and arbitrary it is,  might has well have been:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022collect samples  of all the different coloured and flavoured jelly beans that are scattered throughout the solar system, ,  bring them home and funnel them into the magical jelly bean grinder that then poops out completely unrelated knowledge and blueprints of new technologies and parts,  and special new jelly bean scoops that can scoop up the special harder to scoop beans you couldn\u0027t scoop before.......\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nConsidering that the primary game-play is the building and flying of rockets, what is wrong with using a tried and true approach to getting better gear availability for the game modes where that is part of the process?\n\u003C/p\u003E\n\u003Cp\u003E\nIt uses well established mechanics used in many other games and provides almost no additional learning curve for that aspect of the game.\n\u003C/p\u003E\n\u003Cp\u003E\nSounds like a good idea if one of your objectives is to limit the steepness of what is necessarily a rather steep learning curve for new players...\n\u003C/p\u003E\n\u003Cp\u003E\nThis is not the \u0027Kerbal Research Simulator\u0027 after all.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, GorillaZilla said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd its true for me too, in a way, the current Science system killed the game for me.   \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSandbox mode has none of that.  If the science collecting add-on functionality is not to your liking, the stock game has a play option where that is not an issue.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if you still want to have contracts and funding, you can just bump up both the starting science and the science bonus and unlock the entire tree in your first few launches.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, GorillaZilla said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe basics of the new system would be:\n\u003C/p\u003E\n\u003Cp\u003E\nThe people of the world want to know what is out there and how the universe works....   \n\u003C/p\u003E\n\u003Cp\u003E\nSo they pay and donate you cash in return for experiment data and accounts of first hand kerbal experiences on what you find out there,   you use that cash \u002B time \u002B feedback from real world flight testing    to further develop the technology you need to get out further and faster to find out more about that\u0027s out there,  which of course,  you and the world want to know....  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, GorillaZilla said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd for example If you want better rocket engines,   Flying with what you have at the start,  and running them in different conditions,  speeds and atmospheric compositions, pressures and temperatures while attempting to achieve your own self set goals of higher and faster....\n\u003C/p\u003E\n\u003Cp\u003E\nWill build up flight data on rocket engine dynamics...  which your engineers and scientists can use alongside cash and time to shed light on ways to improve understanding of rocket engine technology which opens up ideas for new rocket engine designs,  which when flown themselves with their differences and application of new ideas shed more light on how rocketry works when run in different conditions...\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, in short you want a very complex and \u0027realistic\u0027 research game in place of the current science system.\n\u003C/p\u003E\n\u003Cp\u003E\nWith a nice, fat learning curve on top of the already existent learning curve for the actual rocket science.\n\u003C/p\u003E\n\u003Cp\u003E\nSort of like a \u0027spreadsheets to get the parts to get to space\u0027 type game.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m kind of glad SQUAD never attempted such a complex and convoluted monstrosity as I would never have heard about it from the dozen players who would actually have enough bloody-minded determination(or initial aerospace research training) to get past the horrendous learning curve and actually get to the point where they could enjoy the game and do what they want to do.(assuming SQUAD could get it out the door before running out of money of course)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2016-09-04T15:23:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741755\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473000172\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nConsidering that the primary game-play is the building and flying of rockets\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI too consider that the primary game-play.\n\u003C/p\u003E\n\u003Cp\u003E\nI play mainly career because it fits my style and my own story.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I acknowledge that not everyone is playing the game the same way or want the same thing from playing.\n\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2016-09-04T15:58:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741755\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473000172\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m kind of glad SQUAD never attempted such a complex and convoluted monstrosity as I would never have heard about it from the dozen players who would actually have enough bloody-minded determination(or initial aerospace research training) to get past the horrendous learning curve and actually get to the point where they could enjoy the game and do what they want to do.(assuming SQUAD could get it out the door before running out of money of course\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think you read the meaning of my post correctly,  If anything is a complex convoluted monstrosity,  it\u0027s whatever you were imagining while reading it.   (and also the contracts system, THAT is a complex convoluted monstrosity with all it\u0027s clauses and stipulations and Lawyer infestation)\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll explain it simply without any of the surrounding fluff that\u0027s there to put things in context.\n\u003C/p\u003E\n\u003Cp\u003E\nTechnology points for using your parts in ways/situations they have not been used before*,   Technology points \u002B cash are used to unlock Nodes.  And Node\u0027s parts become available for use after a certain amount of time has passed after you have chosen to unlock using points and cash.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRoughly analogous to real life,  makes sense,  but is still Simples :-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd if done correctly,  it would for the most part manage itself in the background,  and simply notify you when new shiny things are available because of what you have been doing in the game....\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nScience traded in for cash,    Cash,  \u002B real world experience(testing) \u002B time = new technology\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nScience collection should chug away in the background so you can get on with actually playing the core game,  which is the designing,  building and flying (Crashing)  of Rockets....\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*which represents experience from real world practice of theory......\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-04T16:18:04Z\u0022 title=\u002209/04/2016 04:18  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 4, 2016\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StahnAileron","CreatedById":139783,"CreatedDateTime":"2016-09-04T16:56:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741713\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472996398\u0022 data-ipsquote-userid=\u0022107529\u0022 data-ipsquote-username=\u0022Curveball Anders\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Curveball Anders said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhile I agree with some of your points I don\u0027t think such massive rewrites of several core systems is something that can be solved in free updates.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is precisely why I find the current code refactor so odd. Something that historically is usually a new release, not an update. It\u0027s also why I think KSP shouldn\u0027t have been release in the state it was in. v1.0 was more sandbox simulator tech demo advertised as a game. Commercial 1.0 KSP was more a proof of concept than finished product because the tech and experience didn\u0027t exist to help meet the ambitions it had. (I\u0027d say expectations, but most expectations can never be met unless they\u0027ve been tempered in/by reality.)\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741713\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472996398\u0022 data-ipsquote-userid=\u0022107529\u0022 data-ipsquote-username=\u0022Curveball Anders\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Curveball Anders said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe\u0027ve discussed a theoretical KSP2 several times on the forums, and I think you\u0027ve outlined several things that could make such a beast possible.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAt this point, I think this is what KSP needs to be a full-fledged game rather than this ill-conceived approximation of a game. At least the programming issues are getting hammered out and rectified (though that should\u0027ve been most done before commercial release.) Once they get KSP to not be what sounds like spaghetti code, the next step to tackle would be actual gameplay mechanics and progression. (Any complaints about added content can wait until there\u0027s a game for content to be used in. Extra parts/planets/things won\u0027t inherently make good/interesting gameplay.)\n\u003C/p\u003E\n\u003Cp\u003E\nIf anything, I think one fault of SQUAD is the lack of a roadmap for long-term play. At this point, looking back, it feels like they were too shortsighted with getting something to meet the basic ambition of the game (which I think was \u0022fun/amusing entry lego-style rocket simulator\u0022). The long term aims weren\u0027t planned or got short-changed in the process. As I\u0027ve mention many times across the forum, the gameplay mechanics feel arbitrary and tacked on to tick a box on a checklist instead of being fleshed out and made meaningful.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve mostly gotten my $30 out of KSP (got it at v0.90). Being able to design and semi-realistically fly my own aircraft within certain limitations was worth it. I just wish there was more activities to do that felt rewarding without feeling tedious. (I know it Kerbal SPACE Program, but I\u0027d like more content on Kerbin for just airplanes. Yeah, there are mods, but modders can only do so much if there\u0027s little to no framework in place to support them.) I\u0027d honestly welcome a KSP2 and let KSP1 languish in just bug-maintenance if it meant KSP2 could correct everything wrong with KSP1 while improving what it got right. I\u0027d pay another $30-$40 for that privilege.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-04T16:58:04Z\u0022 title=\u002209/04/2016 04:58  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 4, 2016\u003C/time\u003E by StahnAileron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2016-09-04T17:09:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741874\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473008197\u0022 data-ipsquote-userid=\u0022139783\u0022 data-ipsquote-username=\u0022StahnAileron\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, StahnAileron said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is precisely why I find the current code refactor so odd. Something that historically is usually a new release, not an update.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s far from odd for a game based on a 3rd-party engine.\n\u003C/p\u003E\n\u003Cp\u003E\nAdapting to changes and new features is part of the price you pay if you can\u0027t afford to spend the time and resources to build from scratch.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the always ongoing choice of polish or rewrite of old code also comes with the territory of a pre-release funded indie game\n\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2016-09-04T18:29:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741821\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473004738\u0022 data-ipsquote-userid=\u0022100625\u0022 data-ipsquote-username=\u0022GorillaZilla\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, GorillaZilla said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think you read the meaning of my post correctly,  If anything is a complex convoluted monstrosity,  it\u0027s whatever you were imagining while reading it.   (and also the contracts system, THAT is a complex convoluted monstrosity with all it\u0027s clauses and stipulations and Lawyer infestation)\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll explain it simply without any of the surrounding fluff that\u0027s there to put things in context.\n\u003C/p\u003E\n\u003Cp\u003E\nTechnology points for using your parts in ways/situations they have not been used before*,   Technology points \u002B cash are used to unlock Nodes.  And Node\u0027s parts become available for use after a certain amount of time has passed after you have chosen to unlock using points and cash.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRoughly analogous to real life,  makes sense,  but is still Simples :-)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYes situational awareness is nice and simple.  It is not like there are trillion dollar companies spending billions of dollars trying to get enough situational awareness to let a car drive itself or anything.\n\u003C/p\u003E\n\u003Cp\u003E\nThe simplest approximation would be each distinct part having a record of each biome it has visited and when the craft is recovered the \u0027points\u0027 for each part that has been in a biome that distinct part has not been in before(as in no Rhino engine has ever been recovered after being landed at the shore), it will contribute a certain number of \u0027points\u0027 to a specified list of \u0027improvement targets\u0027 to let you unlock new parts.\n\u003C/p\u003E\n\u003Cp\u003E\nEven then you are tracking each biome for each part in the game(and any modders that want to add parts will also need to define what sorts of research they can help with).  This adds a non-trivial additional memory overhead for each loaded part, meaning that before 64 bit KSP 100\u002B part ships might well have been flatly impossible, while bringing two 60 part ships inside the same physics bubble would have crashed the game.  And of course adding things like 20 additional stylized wing parts would also be akin to cheating the system because now you can get a lot more aerodynamics science progress just from using those wings around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd remember, this is the *simplest* version of what you are asking for, one that still has nonsensical activities like taking jet engines biome hopping on the Mun to unlock new jet engines.  To do this research system in a way that would make you happy would probably require more development time than having SQUAD write their own game engine, and I would rather have SQUAD throw in something simplistic like the current system, than never be able to bring the game to market at all.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, GorillaZilla said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nScience traded in for cash,    Cash,  \u002B real world experience(testing) \u002B time = new technology\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nScience collection should chug away in the background so you can get on with actually playing the core game,  which is the designing,  building and flying (Crashing)  of Rockets....\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*which represents experience from real world practice of theory......\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhy bother with collecting science for cash when I could even more easily set up the \u0027Kerbal Fuel Refinery Service\u0027 to convert ore to fuel on the launchpad and make money that way?\n\u003C/p\u003E\n\u003Cp\u003E\nThat is a good \u0027real world\u0027 way to make money, but hardly seems like the type of behavior you want to encourage in a game about rocket ships...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2016-09-04T19:05:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222740486\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472903071\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/3/2016 at 6:44 AM, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI ask a different question: Why do we have to click at all? I brought the Kerbals along. I threw in the cash for the extra fuel. Why can\u0027t THEY run the experiments themselves? And isn\u0027t there some underling on the ground who can tell the probe to do these experiments as well? I play this game to build and fly rocket ships, not hunt for 4-pixel-wide doodads stuck to my ship so I can right click them.\n\u003C/p\u003E\n\u003Cp\u003E\nI won\u0027t play anymore without some sort of automated science gathering mod, ever since the time I realized I did not ONCE look at the planet I was flying by on close approach, so engrossed was I with \u0022clicking all the things.\u0022 And that was one click each (I consider that \u0022maximum science\u0022) so no, reducing it to once won\u0027t help.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne of the biggest concerns with how science is treated in KSP, that I agree with, is that there isn\u0027t enough to do once you get to a planet or moon, and that the experiments seem decoupled from what it actually takes to advance the relevant technologies. But most suggestions for improving this usually end up requiring such a massive overhaul of the system that I don\u0027t think it could be implemented until a 2.0 edition. A new game.\n\u003C/p\u003E\n\u003Cp\u003E\nI suggest something a bit more moderate.\n\u003C/p\u003E\n\u003Cp\u003E\nInstead of entire expansive biomes being representative of all of the science available in that area you should have to explore the surface within biomes and use your scientific instruments to guide you to pockets of high value samples sprinkled around within the biome. Imagine if the value of surface samples followed a random distribution between and within biomes in the same way that ore concentration is revealed by the orbital scanner and surface scanner. Sites of particular value would essentially be highly localized \u0022Easter eggs\u0022 that increased the science data returned, even perhaps allowing full transmission values from the surface. The gravity experiment, seismic detector, thermometer and all would be used to help guide you to these pockets to sample. Examining these sites should generate a contract branch that helps you explore nearby related features and return reputation and funds as you do so. This would make EVA exploration worthwhile and increase the utility of rovers and planes.\n\u003C/p\u003E\n\u003Cp\u003E\nIf a player chooses a science career then running science experiments should be part of the fun and a gameplay investment. The best games are the ones that allow you to expand upon the potential you have built from the resources you\u0027ve invested previously. More boldly, it would be nice if there was a \u0022recipe\u0022 of experimental data that could be combined inside the mobile processing lab that would lead to \u0022scientific breakthroughs\u0022 for the body that you are investigating. You should be able to add to the body of knowledge for that world with these breakthroughs that would give you valuable information about how to explore that world in future missions. It could unlock radar altitude data for landing, increase resistance to crash damage, improve the performance of engines, reduce heat damage, increase the efficiency of solar panels and RTGs, etc...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-04T19:09:05Z\u0022 title=\u002209/04/2016 07:09  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 4, 2016\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JimmyAgent007","CreatedById":74761,"CreatedDateTime":"2016-09-04T19:25:13Z","Content":"\n\u003Cp\u003E\nSo something like Pokemon GO but with science?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIve always seen science as \u0027nerd bait\u0027 for Kerbals.  Taking samples of the mun might not let you make better rockets but it may attract new scientists to the field because you accoplished something.  Sort of indirectly improving your rockets with mun rocks.  Just skipping the middle bit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nId also like some degree of science over time, but in real time that ignores time warp.  So you cant just set something simple up and time warp the tech tree.\n\u003C/p\u003E\n"},{"CreatedByName":"StahnAileron","CreatedById":139783,"CreatedDateTime":"2016-09-04T19:38:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741885\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473008989\u0022 data-ipsquote-userid=\u0022107529\u0022 data-ipsquote-username=\u0022Curveball Anders\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Curveball Anders said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s far from odd for a game based on a 3rd-party engine.\n\u003C/p\u003E\n\u003Cp\u003E\nAdapting to changes and new features is part of the price you pay if you can\u0027t afford to spend the time and resources to build from scratch.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the always ongoing choice of polish or rewrite of old code also comes with the territory of a pre-release funded indie game\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI get changing engines, platform updates, and such, but not post-commercial release. They usually lock the platform at that point for ease of maintenance. I know of minor point updates (I think Satellite Reign or Wasteland 2 did a release that was a based on a point release update to the platform, like Unity 5.0 to 5.1 as an example), but not wholesale rewrites of the underlying program. Especially within a year of commercial release.\n\u003C/p\u003E\n\u003Cp\u003E\nGranted, KSP had some questionable programming it seems, but that makes me feel that KSP wasn\u0027t ready for prime time yet even more. (Yes, I know there\u0027s more that just coding decisions to make. They are a business that needs to make a profit and all.) *sigh* I apologize; I guess I\u0027ve just gotten sick and tired of the currently mentality in software development to \u0022release now, fix later (if ever)\u0022. I was fine with post-release patches on the PC side (PC was way more complex than fixed-specs platforms), but once the always connected consoles started allowing patches, it\u0027s been downhill since. It bled over to PC, taking it from \u0022reasonable and understandable\u0022 to \u0022tolerated\u0022 to \u0022*insert profanity* *insert company*\u0022. Now it\u0027s just a fact of life. (Disclosure: I\u0027ve been a regular PC gamer since about 2000 when I got my own PC, even if it was a hand-me-down. I\u0027ve played consoles since 1990. Had to say this so I don\u0027t started a platform war blaming consoles for problem on the PC. Developers and/or publishers are to blame more than the platform.)\n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2016-09-04T21:39:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742033\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473017113\u0022 data-ipsquote-userid=\u002274761\u0022 data-ipsquote-username=\u0022JimmyAgent007\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, JimmyAgent007 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo something like Pokemon GO but with science?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIve always seen science as \u0027nerd bait\u0027 for Kerbals.  Taking samples of the mun might not let you make better rockets but it may attract new scientists to the field because you accoplished something.  Sort of indirectly improving your rockets with mun rocks.  Just skipping the middle bit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nId also like some degree of science over time, but in real time that ignores time warp.  So you cant just set something simple up and time warp the tech tree.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA bit like that, yes. If the reputation meter was more prominent and you could target which contract paths you wanted to explore then I could definitely see a reputation reward for hitting some of these high value sites being translated into recruiting more scientists. Maybe even reducing the cost of hiring Kerbals from the Astronaut Complex.\n\u003C/p\u003E\n\u003Cp\u003E\nMy line of thinking was that atmospheric scans of Kerbin\u0027s atmosphere provided a buff to engines used on Kerbin, but you would have to do the scans for Duna and Laythe if you wanted the improvements to work in their atmospheres. Pressure and gravity scans could reveal information that would tell you when to set your parachutes to auto-deploy. That would also encourage players to send small, light uncrewed probes to sample the atmosphere before designing big manned missions to those worlds, because then you could benefit from having engines tuned to land in their specific environments; to know the elevations within scanned biomes; and understand at what air density mark a parachute is safe to deploy on that world without tearing it apart.\n\u003C/p\u003E\n\u003Cp\u003E\nSurface samples and seismic scans could increase the thermal efficiency and ore extraction rate of ore drills within only those specific biomes that were tested. Thermometers and Science Jr. labs could test the radiant energy and micrometeorite prevalence in orbit of different worlds to boost the strength and efficiency of solar panels and radiators operating around those worlds. Maybe you have to have a thermometer on a craft for ISRUs, radiators and other heat managements systems to work at peak efficiency. Or even have thermometers work as thermostats to auto-deploy radiators when necessary.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal EVA reports from the surface could expose previously hidden waypoint markers for exploration contracts within specific biomes. EVA reports from orbit could unlock a wider area at a time, but surface reports would unlock a greater local density of targets.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a lot of related opportunities to make the science experiments contribute to the gameplay rather than slowing it down.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-04T22:44:04Z\u0022 title=\u002209/04/2016 10:44  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 4, 2016\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2016-09-05T00:58:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741987\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473013771\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYes situational awareness is nice and simple.  It is not like there are trillion dollar companies spending billions of dollars trying to get enough situational awareness to let a car drive itself or anything.\n\u003C/p\u003E\n\u003Cp\u003E\nThe simplest approximation would be each distinct part having a record of each biome it has visited and when the craft is recovered the \u0027points\u0027 for each part that has been in a biome that distinct part has not been in before(as in no Rhino engine has ever been recovered after being landed at the shore), it will contribute a certain number of \u0027points\u0027 to a specified list of \u0027improvement targets\u0027 to let you unlock new parts.\n\u003C/p\u003E\n\u003Cp\u003E\nEven then you are tracking each biome for each part in the game(and any modders that want to add parts will also need to define what sorts of research they can help with).  This adds a non-trivial additional memory overhead for each loaded part, meaning that before 64 bit KSP 100\u002B part ships might well have been flatly impossible, while bringing two 60 part ships inside the same physics bubble would have crashed the game.  And of course adding things like 20 additional stylized wing parts would also be akin to cheating the system because now you can get a lot more aerodynamics science progress just from using those wings around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd remember, this is the *simplest* version of what you are asking for, one that still has nonsensical activities like taking jet engines biome hopping on the Mun to unlock new jet engines.  To do this research system in a way that would make you happy would probably require more development time than having SQUAD write their own game engine, and I would rather have SQUAD throw in something simplistic like the current system, than never be able to bring the game to market at all.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhy bother with collecting science for cash when I could even more easily set up the \u0027Kerbal Fuel Refinery Service\u0027 to convert ore to fuel on the launchpad and make money that way?\n\u003C/p\u003E\n\u003Cp\u003E\nThat is a good \u0027real world\u0027 way to make money, but hardly seems like the type of behavior you want to encourage in a game about rocket ships...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNow I KNOW you are not reading my posts correctly,  I said nothing about Biomes,  or tracking every part all the time,  you just assumed and imagined something crazy,  the Simplest Approximation you just provided was of the Complex and twisted \u0022Lum the Mad/Bergholt Stuttley Johnson\u0022 monstrosity you must have cooked up in your head.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd using a refinery on the launchpad to generate money?   That\u0027s just as ludicrous a game mechanic as your wild and unkempt imagination.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI suppose,  If I want something Done properly I have to do it myself.      I don\u0027t trust an automated system to handle Funds and advancement much anyway.     I\u0027ll Manage it myself.  I\u0027ll just strip out everything insane and nonsensical out of the game,  then just keep tabs on what the kids are doing in their saves,  and add extra Cash,   and add in new parts via file editing depending on what I see they have accomplished.    Personal management trumps any automated system,  Especially if Loons like you are running the Asylum,  no offense intended.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe modded version I\u0027ll put together will be aimed at realistic yet simplistic and fun,   roughly based on real world history of achievement and progression.   Something that will give a good idea about the real world realities of physics, flight,  and spaceflight.  Something where things learned in the game relate to real life,  and in turn knowledge and mathematics from real life will be applicable in game.\n\u003C/p\u003E\n\u003Cp\u003E\nFor incentive I\u0027m thinking small real world prizes scattered around the solar system,   objects of varying sizes, shapes and appearances that need to be brought back to the launchpad to claim the prize,   a few sweets and knickknacks about \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E,  Slightly more substantial things around kerbin,  and so on.  The further and harder to return,  the better the prize.     Up to perhaps a Firestorm Flux  being a 5 ton crate on Europa perhaps...   I Do have an unbuilt custom brushless Hyper 7 under the eves,  that would make a good endgame prize.....   But where to put it and how heavy you think?      Real world rockets,  up to Nervas (or maybe theoretically possible drives too,  Project Orion at the most extreme end) and \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E....  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-05T01:23:16Z\u0022 title=\u002209/05/2016 01:23  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 5, 2016\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2016-09-05T01:02:29Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100625-gorillazilla/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022100625\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100625-gorillazilla/\u0022 rel=\u0022\u0022\u003E@GorillaZilla\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151611-waxing_kibbous/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022151611\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151611-waxing_kibbous/\u0022 rel=\u0022\u0022\u003E@Waxing_Kibbous\u003C/a\u003E, There\u0027s a thread for you \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/146756-disconnect-science-from-tech-research/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E. There are reasons this isn\u0027t a great idea, mainly that if you base tech tree development on funds rather than experimentation players will just find the most lucrative thing and repeat it until the tech tree is complete. In many ways this makes the grind situation worse.\n\u003C/p\u003E\n\u003Cp\u003E\nScience could definitely get some love I just don\u0027t think this is the best way to go about it.\n\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2016-09-05T01:17:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742362\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473037349\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100625-gorillazilla/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022100625\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100625-gorillazilla/\u0022 rel=\u0022\u0022\u003E@GorillaZilla\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151611-waxing_kibbous/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022151611\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151611-waxing_kibbous/\u0022 rel=\u0022\u0022\u003E@Waxing_Kibbous\u003C/a\u003E, There\u0027s a thread for you \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/146756-disconnect-science-from-tech-research/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E. There are reasons this isn\u0027t a great idea, mainly that if you base tech tree development on funds rather than experimentation players will just find the most lucrative thing and repeat it until the tech tree is complete. In many ways this makes the grind situation worse.\n\u003C/p\u003E\n\u003Cp\u003E\nScience could definitely get some love I just don\u0027t think this is the best way to go about it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOnly partially based on funds,  the main bulk of unlocking would literally be Technology points literally gained through wild experimentation.....\n\u003C/p\u003E\n\u003Cp\u003E\nAppears that proper and thorough reading,  and divination of all possible meanings of what someone has said, until coming to the one that makes the most sense is a skill that is rarer than I expected it to be,  which makes things rather difficult when trying to use such a crude language to get ones thoughts across.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNo matter,  disregard my suggestions.   I\u0027ve decided to take the matter into my own hands as I said in the post above.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nApologies if this causes any offense,  It\u0027s not intended.  And thank you for trying to help regardless :-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is another thing that makes KSP great,  the ease of access to changing the game to fix what is broken yourself ;-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-05T01:21:16Z\u0022 title=\u002209/05/2016 01:21  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 5, 2016\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2016-09-05T01:32:31Z","Content":"\n\u003Cp\u003E\nDiscussing how Career should be implemented is like claiming how much better it would be if the sun rose in the west instead of in the east.\n\u003C/p\u003E\n\u003Cp\u003E\nYou might have good, yes great arguments to support your cause. It might be *so* much better than what we have right now.\n\u003C/p\u003E\n\u003Cp\u003E\nNow think of what\u0027s required to make it happen (hunt: it won\u0027t).\n\u003C/p\u003E\n"},{"CreatedByName":"Frybert","CreatedById":97766,"CreatedDateTime":"2016-09-05T04:35:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742380\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473039151\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow think of what\u0027s required to make it happen (hunt: it won\u0027t).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCareer mode needs hunting! \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0022 rel=\u0022\u0022\u003E@SQUAD\u003C/a\u003E make it happen!\n\u003C/p\u003E\n"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2016-09-05T05:07:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742483\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473050144\u0022 data-ipsquote-userid=\u002297766\u0022 data-ipsquote-username=\u0022Frybert\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, Frybert said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nCareer mode needs hunting! \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0022 id=\u0022ips_uid_31_4\u0022 rel=\u0022\u0022\u003E@SQUAD\u003C/a\u003E make it happen!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow \u0027bout fishing?\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/135728-113-kerbal-sports-jebediah-kermans-fishing-challenge-v105-2016-05-14/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2016-09-05T08:15:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222741821\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473004738\u0022 data-ipsquote-userid=\u0022100625\u0022 data-ipsquote-username=\u0022GorillaZilla\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, GorillaZilla said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTechnology points \u002B cash are used to unlock Nodes.  And Node\u0027s parts become available for use after a certain amount of time has passed after you have chosen to unlock using points and cash.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRoughly analogous to real life,  makes sense,  but is still Simples :-)\n\u003C/p\u003E\n\u003Cp\u003E\nScience traded in for cash,    Cash,  \u002B real world experience(testing) \u002B time = new technology\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo instead of flying, collecting and unlocking you want it to be flying, collecting ... and then simply time warp? Fly simple missions without new parts until research is done? That would serve no purpose in my eyes.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742033\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473017113\u0022 data-ipsquote-userid=\u002274761\u0022 data-ipsquote-username=\u0022JimmyAgent007\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, JimmyAgent007 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIve always seen science as \u0027nerd bait\u0027 for Kerbals.  Taking samples of the mun might not let you make better rockets but it may attract new scientists to the field because you accoplished something.  Sort of indirectly improving your rockets with mun rocks.  Just skipping the middle bit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is the way I have been looking at research in KSP all the time, cutting out the \u0022publish and monetize science\u0022 part and just use it directly as a currency.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742046\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473017915\u0022 data-ipsquote-userid=\u0022139783\u0022 data-ipsquote-username=\u0022StahnAileron\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, StahnAileron said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI get changing engines, platform updates, and such, but not post-commercial release. They usually lock the platform at that point for ease of maintenance. I know of minor point updates (I think Satellite Reign or Wasteland 2 did a release that was a based on a point release update to the platform, like Unity 5.0 to 5.1 as an example), but not wholesale rewrites of the underlying program. Especially within a year of commercial release.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo you rather would have Squad remain on an outdated platform with all its bugs (wheels) and limitaions (32bit)?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742159\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473025193\u0022 data-ipsquote-userid=\u0022146104\u0022 data-ipsquote-username=\u0022HvP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, HvP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA bit like that, yes. If the reputation meter was more prominent and you could target which contract paths you wanted to explore then I could definitely see a reputation reward for hitting some of these high value sites being translated into recruiting more scientists. Maybe even reducing the cost of hiring Kerbals from the Astronaut Complex.\n\u003C/p\u003E\n\u003Cp\u003E\nMy line of thinking was that atmospheric scans of Kerbin\u0027s atmosphere provided a buff to engines used on Kerbin, but you would have to do the scans for Duna and Laythe if you wanted the improvements to work in their atmospheres. Pressure and gravity scans could reveal information that would tell you when to set your parachutes to auto-deploy. That would also encourage players to send small, light uncrewed probes to sample the atmosphere before designing big manned missions to those worlds, because then you could benefit from having engines tuned to land in their specific environments; to know the elevations within scanned biomes; and understand at what air density mark a parachute is safe to deploy on that world without tearing it apart.\n\u003C/p\u003E\n\u003Cp\u003E\nSurface samples and seismic scans could increase the thermal efficiency and ore extraction rate of ore drills within only those specific biomes that were tested. Thermometers and Science Jr. labs could test the radiant energy and micrometeorite prevalence in orbit of different worlds to boost the strength and efficiency of solar panels and radiators operating around those worlds. Maybe you have to have a thermometer on a craft for ISRUs, radiators and other heat managements systems to work at peak efficiency. Or even have thermometers work as thermostats to auto-deploy radiators when necessary.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal EVA reports from the surface could expose previously hidden waypoint markers for exploration contracts within specific biomes. EVA reports from orbit could unlock a wider area at a time, but surface reports would unlock a greater local density of targets.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt is a long standing rule that parts will not change their abilites, not with engineers on board, nor with new tech nodes unlocked. And the bigger part of the community stands behind this, is actually responsible for engineers not buffing engines by the uproar the devs\u0027 suggestion caused.\u003Cbr\u003E\nI also concur with this decision, only thing I keep trying to implant into the devs\u0027 minds is probe cores getting upgrades to keep them being useful - I like the sputnikess small satellites.\n\u003C/p\u003E\n\u003Cp\u003E\nRegarding your last paragraph and what HvP wrote:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742022\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473015908\u0022 data-ipsquote-userid=\u0022146104\u0022 data-ipsquote-username=\u0022HvP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, HvP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nInstead of entire expansive biomes being representative of all of the science available in that area you should have to explore the surface within biomes and use your scientific instruments to guide you to pockets of high value samples sprinkled around within the biome. Imagine if the value of surface samples followed a random distribution between and within biomes in the same way that ore concentration is revealed by the orbital scanner and surface scanner. Sites of particular value would essentially be highly localized \u0022Easter eggs\u0022 that increased the science data returned, even perhaps allowing full transmission values from the surface. The gravity experiment, seismic detector, thermometer and all would be used to help guide you to these pockets to sample. Examining these sites should generate a contract branch that helps you explore nearby related features and return reputation and funds as you do so. This would make EVA exploration worthwhile and increase the utility of rovers and planes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is actually already possible with the contract system. The science output of these contracts just is not very high. Maybe this should be reworked, like the tourist contracts giving more reputation than others.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegarding the clickiness of the science system - there are action groups - and mods or the simple option to reconfig the game to allow for 100% science to be 100% transmittable in the first go. (Might add that to my long neglected post of small tweaks.)\n\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2016-09-05T09:15:56Z","Content":"\n\u003Cp\u003E\nWell, from all this I conclude that squad has pulled a \u0022Bloody Stupid Johnson\u0022  By trying to put a half baked,  poorly thought out career mode in the game in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nThey would have better spent that time and effort on fixing bugs,  and improving the underlying foundation of the game,  and left modders the keys to make all the different flavors of progression system that all the different people want.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no best sauce,  just a different best sauce for each and every single person.\n\u003C/p\u003E\n"},{"CreatedByName":"StahnAileron","CreatedById":139783,"CreatedDateTime":"2016-09-05T10:37:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742617\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473063312\u0022 data-ipsquote-userid=\u002270338\u0022 data-ipsquote-username=\u0022KerbMav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, KerbMav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo you rather would have Squad remain on an outdated platform with all its bugs (wheels) and limitaions (32bit)?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI never said anything like that at all. I simply point out something that usually doesn\u0027t happen. Also, wheels got broken and the platform officially updated to 64-bits in 1.1. Granted, \u003Cem\u003EI\u0027m \u003C/em\u003Eplaying KSP 1.0.5, but wheels/legs work there and I\u0027m using the 64-bit workaround with minimal problems. (The only major headache for me I was able to trace back to RPM. Since I don\u0027t use IVA, removing RPM solved it.) The only problems I consider major with 1.0.5 is the un-optimized code and the 32-bit limitation (which probably could be mitigated a bit if the code was optimized.) Wheels aren\u0027t the best, but they \u003Cem\u003Ework.\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2016-09-05T12:01:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222739421\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472822239\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 02/09/2016 at 10:17 AM, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI see it as an incentive to bring along a scientist and a lab.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you bring both of those, you can get all the science for each biome in one trip.\n\u003C/p\u003E\n\u003Cp\u003E\nKind of makes sense that if you want that last bit of science that you probably want to bring a scientist and lb with you, and anything less will mean lots of trips.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI understand that, but I think not having to return the experiment in the first place is reason enough to bring a scientist. You\u0027ll have to return him/her eventually, but it doesn\u0027t have to be in this mission, and you get the full science while on the field (plus, reusable experiments!).\n\u003C/p\u003E\n\u003Cp\u003E\nHaving to bring repeated results from the same experiment/biome to me is just more clicking.\n\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-09-05T15:48:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742362\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473037349\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100625-gorillazilla/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022100625\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100625-gorillazilla/\u0022 rel=\u0022\u0022\u003E@GorillaZilla\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151611-waxing_kibbous/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022151611\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151611-waxing_kibbous/\u0022 rel=\u0022\u0022\u003E@Waxing_Kibbous\u003C/a\u003E, There\u0027s a thread for you \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/146756-disconnect-science-from-tech-research/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E. There are reasons this isn\u0027t a great idea, mainly that if you base tech tree development on funds rather than experimentation players will just find the most lucrative thing and repeat it until the tech tree is complete. In many ways this makes the grind situation worse.\n\u003C/p\u003E\n\u003Cp\u003E\nScience could definitely get some love I just don\u0027t think this is the best way to go about it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n* just want to say that in my suggestion science would still be used to unlock tech. Just a rough idea how it would work:\n\u003C/p\u003E\n\u003Cp\u003E\nGetting 500 science around Kerbin would unlock a Kerbin tech branch that would open up things like light landers for moon exploration. The parts in the newly unlocked branch would then cost money to unlock.\n\u003C/p\u003E\n\u003Cp\u003E\nGetting 1500 science around the Mun would unlock a Mun tech branch, unlocking 3000 science around Minmus would unlock the Minmus Branch, these would open up tech that would make a Duna mission feasible, and so on. This is just an idea that could encourage more interplanetary travel, but it would be a bear to balance- aaaand it won\u0027t happen anyway so I\u0027ll stop typing now \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2016-09-05T19:11:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222742906\u0022 data-ipsquote-contentid=\u0022146868\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473090495\u0022 data-ipsquote-userid=\u0022151611\u0022 data-ipsquote-username=\u0022Waxing_Kibbous\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Waxing_Kibbous said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n* just want to say that in my suggestion science would still be used to unlock tech. Just a rough idea how it would work:\n\u003C/p\u003E\n\u003Cp\u003E\nGetting 500 science around Kerbin would unlock a Kerbin tech branch that would open up things like light landers for moon exploration. The parts in the newly unlocked branch would then cost money to unlock.\n\u003C/p\u003E\n\u003Cp\u003E\nGetting 1500 science around the Mun would unlock a Mun tech branch, unlocking 3000 science around Minmus would unlock the Minmus Branch, these would open up tech that would make a Duna mission feasible, and so on. This is just an idea that could encourage more interplanetary travel, but it would be a bear to balance- aaaand it won\u0027t happen anyway so I\u0027ll stop typing now \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt was spedifically decided to leave it up to the player where he wants to go first/next. Even the contract system tries to be open in this regard.\n\u003C/p\u003E\n"}]}