{"TopicId":148803,"ForumId":66,"TopicTitle":"Devnote Tuesday: The wait is almost over!","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2016-09-27T23:10:43Z","PageNum":1,"Articles":[{"CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2016-09-27T23:10:43Z","Content":"\n\u003Cfigure class=\u0022tmblr-full\u0022 data-orig-height=\u002292\u0022 data-orig-width=\u0022480\u0022\u003E\u003Cimg src=\u0022https://67.media.tumblr.com/d7742ffeeb1a06286bc834ec48a63051/tumblr_inline_oe6qnhRgNj1rr2wit_540.jpg\u0022 data-orig-height=\u002292\u0022 data-orig-width=\u0022480\u0022 alt=\u0022tumblr_inline_oe6qnhRgNj1rr2wit_540.jpg\u0022\u003E\u003C/figure\u003E\u003Cp\u003EHello everyone!\u003Cb\u003E\u003Cbr\u003E\u003C/b\u003E\u003C/p\u003E\n\u003Cp\u003EWe’re getting very excited with the upcoming release of the 1.2 Update! After countless hours of hard work, it’s very fulfilling to see a project coming to fruition. The development process of any update is long and all the steps within it are vital to a successful release; that includes this final phase, where the participation of the community has been and is crucial to polish the final details. We’re almost there and we couldn’t be any prouder!\u003C/p\u003E\n\u003Cp\u003EWe’ll start by thanking everyone who has submitted their bug reports on the pre-release project on the \u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/projects/prerelease/issues\u0022 rel=\u0022external nofollow\u0022\u003E KSP’s Bug Tracker\u003C/a\u003E and congratulating the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/148724-first-winners-bug-hunting-contest/\u0022 rel=\u0022\u0022\u003Efirst 3 winners of the Bug Hunting Contest\u003C/a\u003E. Remember that the contest isn’t over yet, so keep those reports coming!\u003C/p\u003E\n\u003Cp\u003ESteve (Squelch), Dave (TriggerAu) and the QA team have been wrapping up the test cases this past week. They’ve also been keeping an eye on the public tracker alongside the experimentals to keep them in sync. There have been some great reports coming in, and the Devs have been hard at work fixing, passing them to QA and Experimentals for first and second pass testing before applying them to the latest pre-release build. A big shout out to the rest of the QA team that rarely get a mention and are the unsung heroes. They have done a stirling job working through the test cases and generally being on the ball with fix testing.\u003C/p\u003E\n\u003Cp\u003EThe pre-release has been going very well. We’re spending a lot of time fixing bugs, doing performance optimisations and balancing the new features. Let’s go through the details that Mike (Mu) and the team has been working on:\u003C/p\u003E\n\u003Cp\u003EThroughout the week, Jim (Romfarer) has been fixing mostly non-critical bugs, he also fixed an old bug/feature where you were not able to undo deleting a whole vessel in the editor. This is now possible and should hopefully make for a lot less grief when this happens accidentally. \u003C/p\u003E\n\u003Cp\u003EIn addition to the usual round of bug fixes, Bob (Roverdude) had some time to add on the new 0.625m heat shield, and continued on the biome rework. Part of this is looking for ways to make each of the planets a bit more interesting, as well as make the maps themselves more aesthetically pleasing, since they are now visible in KerbNet (and not just via the cheat menu). Eve has now fourteen biomes, and has a much prettier \u003Ca href=\u0022http://i.imgur.com/8VnKqeX.png\u0022 rel=\u0022external nofollow\u0022\u003Ebiome map\u003C/a\u003E.\u003C/p\u003E\n\u003Cp\u003ELast week our valiant pre-release testers uncovered a logical issue that was causing Exploration contracts to only issue flyby objectives. Upon fixing that, and discussing feedback with them, we went ahead and made Exploration contracts have a 100% chance to appear if you enter Mission Control and one isn’t on the board. This should go a long way towards giving career mode some more structured narrative, and has been received well by the testers. Brian (Arsonide) also worked with Jeremie (Nightingale) on changing the contract weighting logic to add a small negative weight to contracts that were read but never accepted, which should make weighing much more intelligent. Jeremie also made the tourist contracts play better with the optional Kerbal Gee functionality (including adding a small chance for a special contract).\u003C/p\u003E\n\u003Cp\u003ENathanael (NathanKell), made some further refinements to Krakensbane and Floating Origin. Position and velocity precision is maintained much better now, explosions stay fixed to the ground where they occur, and vessels don’t jump when you fly near them. In addition, Nathanael made the resources and modules on EVA kerbals accessible through an external cfg file to let the community modify some of their key parameters, this will solve some of the issues people had been having while adding resources to them in the pre-release. \u003C/p\u003E\n\u003Cp\u003EBill (taniwha) recently returned from a trip to Australia visiting family and taking part in the Koala Space Program. On return, Bill fixed placing maneuver nodes on solar hyperbolic trajectories, and fixed the world disappearing when the camera is under \u003Ca href=\u0022http://taniwha.org/~bill/deep.png\u0022 rel=\u0022external nofollow\u0022\u003E1000m below sea level\u003C/a\u003E. \u003C/p\u003E\n\u003Cp\u003ENathan (Claw) continues to add refinements and quality of life additions, as well as fixing some crashtastic bugs. Near-range targeting now has a bit more logic. If you double click on a targetable part (such as a docking port), that part will become the target, while clicking on other parts of a ship will target the vessel itself. Furthermore, clicking on the ship in control will now deselect the target. Claw also tracked down a bug that was causing the game to crash when decoupling certain parts and flying them away from the mothership. \u003C/p\u003E\n\u003Cp\u003ELike most of the team, Sébastien (Sarbian) has been focusing on bug fixing, but there are 3 things that stand out among these tasks. First, Sarbian spent some time with the Text Mesh Pro font editor to add more characters to our default font. Secondly, Sébastien worked together with Nestor, Roy and Manuel on finding a solution for a issue we’re experiencing with the Steam Controller in 1.2 and it looks like a solution is near. Third, but not least, Sarbian invested some time playing with Quaternions and we finally have a fix for the LT-1 and LT-2 leg rotation in the editor!\u003C/p\u003E\n\u003Cp\u003ERodrigo (Roy) worked on the launcher for KSP; it has been updated according to our new patch solution and its visuals have been improved a little, too. Roy also helped fixing some bugs on the tracker, most of them regarding interface or part issues.\u003C/p\u003E\n\u003Cp\u003EPablo (Paul_Amsterdam) and Leticia (Leto) are working very hard on the 1.2 teaser \u0026amp; cinematic trailer and it’s looking GOOD! We can’t wait to premier it and let you see the final product!\u003C/p\u003E\n\u003Cp\u003EOn the Social Media \u0026amp; Communication front we’ve been working on and implementing new ideas to enrich the content we share and to engage with the community. Andrea (Badie) wants to let you know that we’re open to feedback and suggestions. Furthermore, Daniele (UomoCapra) and Alejandro (alecenturion), our business developer, will be attending Twitchcon this week, so if you happen to be there, come by and say hi! \u003C/p\u003E\n\u003Cp\u003ENestor, our producer, has some great news: the Xbox One patch has passed certification! This patch will be released this week and it will finally solve the save file issue that Xbox One players have been experiencing. Please stay tuned on the forum for the announcement. Nestor also wanted to let you know that we are still testing the PS4 patch to solve all the issues this port has presented, we’ll keep you informed about the advancements, but unfortunately there are no news regarding the release date for that patch, yet.\u003C/p\u003E\n\u003Cp\u003ESadly we have a man down for this Devnote, so no poetry from Mathew (sal_vager) due to an unscheduled excursion to the hospital. Join us in wishing him well and a speedy recovery. \u003C/p\u003E\n\u003Cp\u003EThat’s it for this week. Be sure to join us on our official forums, and don’t forget to follow us on Twitter and Facebook. The KSP subreddit is also a great place to hang out and discuss the upcoming update. Stay tuned for more exciting and upcoming news!\u003C/p\u003E\n\u003Cp\u003EHappy launchings, Kerbonauts!\u003C/p\u003E\n"},{"CreatedByName":"nomercy4you","CreatedById":147707,"CreatedDateTime":"2016-09-27T23:15:18Z","Content":"\n\u003Cp\u003E\nFirst \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E I am excited too! Looking forward for a release next tuesday *pray*\n\u003C/p\u003E\n\u003Cp\u003E\nHope Mathew gets well soon!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBtw. nice job with the eve map.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-27T23:22:29Z\u0022 title=\u002209/27/2016 11:22  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 27, 2016\u003C/time\u003E by nomercy4you\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2016-09-27T23:19:55Z","Content":"\n\u003Cp\u003E\nI hope you get better \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0026amp;do=hovercard\u0022 data-mentionid=\u002216426\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0022 rel=\u0022\u0022\u003E@sal_vager\u003C/a\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise, awesome devnotes! Can\u0027t wait for 1.2 to be out!\n\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2016-09-27T23:20:00Z","Content":"\n\u003Cp\u003E\nPlease extend our best wishes to Mathew (sal_vager) and we hope he makes a full and speedy recovery\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-27T23:20:32Z\u0022 title=\u002209/27/2016 11:20  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 27, 2016\u003C/time\u003E by linuxgurugamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deadmanrunning","CreatedById":169231,"CreatedDateTime":"2016-09-27T23:23:46Z","Content":"\n\u003Cp\u003E\nHave fun xbone\u0027rs. Hope this means good news soon for us PS4 people.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso hope SAL gets good news too\n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-09-27T23:23:47Z","Content":"\n\u003Cp\u003E\nGreat devnotes!  Things are starting to get really polished.\n\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2016-09-27T23:30:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222777124\u0022 data-ipsquote-contentid=\u0022148803\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475017843\u0022 data-ipsquote-userid=\u002266485\u0022 data-ipsquote-username=\u0022SQUAD\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, SQUAD said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThird, but not least, Sarbian invested some time playing with Quaternions and we finally have a fix for the LT-1 and LT-2 leg rotation in the editor!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is by far the biggest news of the patch for me. Not even joking. Three cheers for Sarbian!\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-09-27T23:35:10Z","Content":"\n\u003Cp\u003E\nHeal up, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0026amp;do=hovercard\u0022 data-mentionid=\u002216426\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0022 rel=\u0022\u0022\u003E@sal_vager\u003C/a\u003E! \n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-09-27T23:37:52Z","Content":"\n\u003Cp\u003E\nGreat devnotes. The past several have been fantastic and this one is no different. A wonderful read! Too many good things to talk about to make a pointed reply, but thanks to everybody for making this great game.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd get better Matthew!\n\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2016-09-27T23:45:33Z","Content":"\n\u003Cp\u003E\nTook the sparks right out of my brain !\n\u003C/p\u003E\n\u003Cp\u003E\nMatthew, You better get better!\n\u003C/p\u003E\n"},{"CreatedByName":"erikinthebakery","CreatedById":166663,"CreatedDateTime":"2016-09-27T23:48:23Z","Content":"\n\u003Cp\u003E\nXbox patch!!!!!!!!!! Hurrah!!!!!\n\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2016-09-27T23:52:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222777124\u0022 data-ipsquote-contentid=\u0022148803\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475017843\u0022 data-ipsquote-userid=\u002266485\u0022 data-ipsquote-username=\u0022SQUAD\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n43 minutes ago, SQUAD said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNathanael made the resources and modules on EVA kerbals accessible through an external cfg file to let the community modify some of their key parameters, this will solve some of the issues people had been having while adding resources to them in the pre-release.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWait.  So did this mean a limited EVA fuel resource can be more easily modded in!?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-27T23:54:10Z\u0022 title=\u002209/27/2016 11:54  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 27, 2016\u003C/time\u003E by klgraham1013\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2016-09-27T23:59:50Z","Content":"\n\u003Cp\u003E\nBest wishes for a speedy recovery at sal_vager!\n\u003C/p\u003E\n\u003Cp\u003E\nThis update continues marching towards \u0022best ever\u0022 status. Technical debt is being paid off in huge chunks. Mad Props at Sarbian and Arsonide for landing gear and wheel fixes, so many now that I\u0027ve lost track. Keep up the good works!\n\u003C/p\u003E\n"},{"CreatedByName":"dr_evil","CreatedById":145473,"CreatedDateTime":"2016-09-28T00:03:37Z","Content":"\n\u003Cp\u003E\nGet well soon Mr  sal_vager aka Mathew. I hope it is nothing serious.\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise great devnotes, looking forward to 1.2 with all those awesome new features and performance tweaks.\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way for Good Old Games userst to download the pre release version of KSP?\n\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2016-09-28T00:08:20Z","Content":"\n\u003Cp\u003E\nHope you get better \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0026amp;do=hovercard\u0022 data-mentionid=\u002216426\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0022 rel=\u0022\u0022\u003E@sal_vager\u003C/a\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\n0.625m Heatshield? YES!\n\u003C/p\u003E\n"},{"CreatedByName":"Papa_Joe","CreatedById":10788,"CreatedDateTime":"2016-09-28T00:14:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222777182\u0022 data-ipsquote-contentid=\u0022148803\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475021017\u0022 data-ipsquote-userid=\u0022145473\u0022 data-ipsquote-username=\u0022dr_evil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, dr_evil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGet well soon Mr  sal_vager aka Mathew. I hope it is nothing serious.\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise great devnotes, looking forward to 1.2 with all those awesome new features and performance tweaks.\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way for Good Old Games userst to download the pre release version of KSP?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyes.  yes there is, both via steam and the KSP store\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/147582-update-12-pre-release-is-here/\u0026amp;do=embed\u0026amp;comment=2755505\u0026amp;embedComment=2755505\u0026amp;embedDo=findComment\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nUpdate. I misread your post... I was thinking \u0022Good Old Gamers\u0022, like me... not if you purchased from Good Old Games...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-28T00:24:39Z\u0022 title=\u002209/28/2016 12:24  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 28, 2016\u003C/time\u003E by Papa_Joe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LaytheDragon","CreatedById":149656,"CreatedDateTime":"2016-09-28T00:17:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222777124\u0022 data-ipsquote-contentid=\u0022148803\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475017843\u0022 data-ipsquote-userid=\u002266485\u0022 data-ipsquote-username=\u0022SQUAD\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SQUAD said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBrian (Arsonide) also worked with Jeremie (Nightingale) on changing the contract weighting logic to add a small negative weight to contracts that were read but never accepted, which should make weighing much more intelligent.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIs this for all contracts generated in mission control, that have been in mission control when it was entered by the player at least once, but never accepted before the deadline? Or is it for all contracts that were clicked on in mission control but never accepted before the deadline? Either way it sounds good \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Carcara","CreatedById":141214,"CreatedDateTime":"2016-09-28T00:25:14Z","Content":"\n\u003Cp\u003E\nAs always, thanks for the news. Happy to contribute to eliminate some bugs on this nice update. \u003Cbr\u003E\u003Cbr\u003E\nAnd of course, I hope \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0026amp;do=hovercard\u0022 data-mentionid=\u002216426\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0022 rel=\u0022\u0022\u003E@sal_vager\u003C/a\u003E\u003C/span\u003E gets well soon.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-28T00:30:16Z","Content":"\n\u003Cp\u003E\nYes! Soon!\n\u003C/p\u003E\n"},{"CreatedByName":"GeneCash","CreatedById":81605,"CreatedDateTime":"2016-09-28T00:33:40Z","Content":"\n\u003Cp\u003E\nSo what are you going to name it? We have to match the awesomeness of \u0022Beta Than Ever\u0022, \u0022First Contract\u0022 and \u0022Economic Boom\u0022 - How about \u0022Nothin\u0027 but \u0027Net\u0022 ?\n\u003C/p\u003E\n"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2016-09-28T00:34:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222777198\u0022 data-ipsquote-contentid=\u0022148803\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475021845\u0022 data-ipsquote-userid=\u0022149656\u0022 data-ipsquote-username=\u0022LaytheDragon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, LaytheDragon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nIs this for all contracts generated in mission control, that have been in mission control when it was entered by the player at least once, but never accepted before the deadline? Or is it for all contracts that were clicked on in mission control but never accepted before the deadline? Either way it sounds good \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBoth!  It\u0027s a -1 modifier for a \u0022seen\u0022 contact that was not clicked on and -2 for a \u0022read\u0022 contract that has been clicked on.  Note as always that these numbers are both moddable and subject to change based on balance.\n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-09-28T00:35:47Z","Content":"\n\u003Cp\u003E\nIT\u0027S THE FIANL COUNTDOWN TO MOAR AWESOMENESS!!! Not much longer...\n\u003C/p\u003E\n"},{"CreatedByName":"Papa_Joe","CreatedById":10788,"CreatedDateTime":"2016-09-28T00:37:12Z","Content":"\n\u003Cp\u003E\nI say we call it \u0022Kerbals in Paradise\u0022....\n\u003C/p\u003E\n"},{"CreatedByName":"dr_evil","CreatedById":145473,"CreatedDateTime":"2016-09-28T00:37:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222777194\u0022 data-ipsquote-contentid=\u0022148803\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475021647\u0022 data-ipsquote-userid=\u002210788\u0022 data-ipsquote-username=\u0022Papa_Joe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, Papa_Joe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyes.  yes there is, both via steam and the KSP store\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPapa_Joe how is that? I have bought the game on gog.com, I do not have it on my steam account neither do I have a KSP store account. If there still is a way to get my hands on the pre release I would be very grateful for a hint \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-09-28T00:38:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222777198\u0022 data-ipsquote-contentid=\u0022148803\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475021845\u0022 data-ipsquote-userid=\u0022149656\u0022 data-ipsquote-username=\u0022LaytheDragon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, LaytheDragon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs this for all contracts generated in mission control, that have been in mission control when it was entered by the player at least once, but never accepted before the deadline? Or is it for all contracts that were clicked on in mission control but never accepted before the deadline? Either way it sounds good \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLooks like it\u0027s a combination of both, with a heavier weight being applied if you\u0027ve read the details. From the change-log for pre-release build 1532:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cul style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:13px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255,255,255);\u0022\u003E\u003Cli\u003E\nContract weighting now applies negatively on expiration as well as decline. Expiration weighting is much lighter than decline weighting if the player has only seen the contract, but is heavier if the player has actually read the details of it. Unseen contracts that generate and expire before the player sees them (while he is flying a mission, for example) do not affect weight. Positive weighting was adjusted to compensate. The end result should be smarter weighting.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}