{"TopicId":167409,"ForumId":66,"TopicTitle":"KSP Weekly: An Interstellar Visitor","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2017-11-10T22:20:54Z","PageNum":1,"Articles":[{"CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2017-11-10T22:20:54Z","Content":"\n\u003Cfigure class=\u0022tmblr-full\u0022 data-orig-height=\u0022184\u0022 data-orig-width=\u00221008\u0022\u003E\u003Cimg src=\u0022https://78.media.tumblr.com/3db9e8ae8e8c09f26e2bf538ef81ce63/tumblr_inline_oz81w74wTD1rr2wit_540.png\u0022 data-orig-height=\u0022184\u0022 data-orig-width=\u00221008\u0022 alt=\u0022tumblr_inline_oz81w74wTD1rr2wit_540.png\u0022\u003E\u003C/figure\u003E\u003Cp\u003EWelcome to \u003Ci\u003EKSP Weekly\u003C/i\u003E everyone. This week we’ll talk about \u003Ci\u003EA/2017 U1\u003C/i\u003E - also known as \u003Ci\u003E1I/’Oumuamua\u003C/i\u003E - an unexpected visitor from interstellar space. This story begins on October 19, when astronomers using the \u003Ci\u003EPan-STARRS\u003C/i\u003E telescope in Hawaii noticed an unclassified object in the sky. Being less than half a kilometer wide, it looked like a regular asteroid at first glance, but after mapping its path through space they realized that it’s moving with a hyperbolic excess velocity of 26 km/s with respect to the Sun, way too fast for an object orbiting our star.\u003C/p\u003E\n\u003Cp\u003EThis is most likely the first known example of an interstellar object, which are hypothesized to come from planetary systems in state of formation. When the newly formed planets pass through debris clouds they should occasionally sling leftover rocks into interstellar space. Although we never had seen an object like \u003Ci\u003EA/2017 U1\u003C/i\u003E, scientist speculated that from time to time, some of those objects would enter another star system, carrying chemical clues about the place it came from. \u003C/p\u003E\n\u003Cp\u003EAt first astronomers thought that \u003Ci\u003EOumuamua \u003C/i\u003Ewas just a Near-Earth Object, a name for any large rock whose orbit passes near Earth’s. However, after calculating its speed and trajectory, they discovered that it couldn’t be an NEO: Those orbit our star and \u003Ci\u003EOumuamua \u003C/i\u003Eis going too fast to be held or even slowed down by the Sun’s gravity. Coupled with that, scientists don’t know anything along its path that could’ve sped it up that much, so this means it must have come from somewhere else. \u003C/p\u003E\n\u003Cp\u003EWhile extrapolating the orbit backwards, astronomers calculated that the asteroid had made its closest approach to the Sun on September 9, 2017 and to have passed approximately 0.161 AU (24,100,000 km) from Earth on October 14, 2017. Scientist have also been able to infer that the object appears to come from roughly the direction of the star \u003Ci\u003EVega \u003C/i\u003Ein the constellation \u003Ci\u003ELyra\u003C/i\u003E.\u003C/p\u003E\n\u003Cp\u003E\u003Ci\u003EA/2017 U1\u003C/i\u003E is currently travelling out of the solar system at about 44km/s (almost twice as fast as the average asteroid) and it will probably never come back. So researchers all over the globe have been spending these past few weeks observing the object, hoping to learn as much as they can about its composition, behavior and trajectory, before it reaches its observable threshold, something that will happen very soon, as it’ll be so far from our sun that no human telescope will be able to see it anymore.\u003C/p\u003E\n\u003Cp\u003EWe don’t know much about \u003Ci\u003EOumuamua\u003C/i\u003E, but for now it seems it’s the closest we’ve ever been to another star system and although its visit has been brief, it will provide scientists and astronomers with invaluable data and insight about neighboring planetary systems and our Universe. Maybe \u003Ci\u003EOumuamua \u003C/i\u003Ewill pass through the Kerbol System next, and Kerbals will be able to capture it… who knows. In the meantime we can continue to learn about KSP development.\u003C/p\u003E\n\u003Cp\u003E\u003Cb\u003E[Development news start here]\u003C/b\u003E\u003C/p\u003E\n\u003Cp\u003ELet’s begin with \u003Cb\u003Ethe progress made on the \u003Ci\u003EMaking History Expansion\u003C/i\u003E\u003C/b\u003E. This week saw work on the \u003Cb\u003Eimplementation of the “Event Node” system\u003C/b\u003E. These are nodes that have been flagged in the mission flow. This flag means that the objectives on the out path of the event node are not shown until that node becomes active and becomes relevant to the Mission Player. For example, let say that during a Mission where a Player is supposed to orbit Mun and then return to Kerbin, the Mission Creator has set an Event Flag during the ‘orbit Mun’ section of the mission that activates after the Player has orbited the satellite for 30 seconds and then it shows up and tells the Player to land on Mun. That “secondary” objective will only appear to the Player if the set conditions are met. Coupled with that, the team \u003Cb\u003Eworked to complete the Mission Objectives UI display\u003C/b\u003E, so that Players get a more accurate list of upcoming objectives that follow the Mission Flow Path and Event Nodes in a meaningful way.\u003C/p\u003E\n\u003Cp\u003EThe team has also been \u003Cb\u003Eworking on the Scoring System for Missions\u003C/b\u003E. Specifically on hooking the Scoring Information to the Mission Summary screen, in order that players are able to see their full scoring details after completing a mission.\u003C/p\u003E\n\u003Cp\u003EAdditionally, the developers continue to advance with the \u003Cb\u003Eimplementation of the Resource Scenario in Missions\u003C/b\u003E. Adjustments to generate and store the resource seeds for a Mission have been made, in order to allow Players to return to a saved Mission and having consistent resources each time this happens. Simultaneously, the team implemented a button into the Graphic Action Pane’s Celestial Body display that will toggle the resources overlay. \u003C/p\u003E\n\u003Cp\u003EFurthermore, we want to let you know that \u003Cb\u003E\u003Ci\u003EMaking History\u003C/i\u003E will be localized into all the languages that we are currently supporting\u003C/b\u003E, so regardless of playing KSP in Spanish or Chinese, you’ll be able to play the expansion in its corresponding language. The team has been working on preparing the localization strings since the beginning of the development, so that this process will be easy to realize.\u003C/p\u003E\n\u003Cp\u003EOn top of that, this week we have been able to test another batch of nodes, which include the following (please note that the names of the nodes may still change):\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\n\u003Cb\u003EExplode Part Node\u003C/b\u003E (Action type): This node will allow you to set up a part to explode at certain point during a mission.\u003Cbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EExplode Vessel Node\u003C/b\u003E (Action type): With this node mission creators will be able to cause the explosion of entire vessels at specific moments during a mission. You’ll be able to select the active vessel or a specific one for the event.\u003Cbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EResource Amount Node\u003C/b\u003E (Logic type): With this node, you’ll be able to check a specific amount of a resource and set a comparison operator, e.g. the Munar Rover needs to have 700 units of ore/liquid fuel/monopropellant, etc.\u003Cbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EChange Part Resource Levels Node\u003C/b\u003E (Action type): This node will let you adjust a resource level to another value. It may be more or less than the current resource level a player has at that point and it can also be part/vessel specific.\u003Cbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EAction Part Resource Drain Node\u003C/b\u003E (Action type):  Using this node will allow you to drain or remove a resource over a period of time, e.g. make a fuel tank lose 300 units of liquid fuel in 120 seconds.\u003Cbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EGet In Node\u003C/b\u003E (Location): This node is for having a Kerbal board a vessel at a given moment during your mission.\u003Cbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EKerbal EVA Node\u003C/b\u003E (Location): This one is also quite self-explanatory, as it is to have Kerbals perform extra vehicular activities at a given point in the mission.  \u003Cbr\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003EOn the artistic side of development, this week we \u003Cb\u003Econtinued work on a new engine inspired by the J-2\u003C/b\u003E.  This is an upper stage engine suitable for clustering or as a stack mount with included tank butt (similar to our F-1 analogue).  While the final specifications are subject to QA feedback and testing, this engine will help bridge the gap between the 1.875 and 2.5 engines, with less thrust than the Skipper, but slightly better atmospheric performance and slightly diminished vacuum performance.  As noted in a previous \u003Ci\u003EKSP Weekly\u003C/i\u003E, we’re ensuring that our new engines fill some of the larger gaps, and ensuring engines have enough variance in stats to provide a wide array of new options for players without overlapping functionality. You can see the new engine below:\u003C/p\u003E\n\u003Cfigure class=\u0022tmblr-full\u0022 data-orig-height=\u0022851\u0022 data-orig-width=\u00221126\u0022\u003E\u003Cimg src=\u0022https://78.media.tumblr.com/0ba85d99e947a1df8279f4e918617bc9/tumblr_inline_oz81wxPXrk1rr2wit_540.png\u0022 data-orig-height=\u0022851\u0022 data-orig-width=\u00221126\u0022 alt=\u0022tumblr_inline_oz81wxPXrk1rr2wit_540.png\u0022\u003E\u003C/figure\u003E\u003Cp\u003EThe \u003Cb\u003Eupdated versions of KSP on consoles continue to undertake a vigorous quality assurance process\u003C/b\u003E. With each new build, the testers find fewer issues, and when they do, these are being quickly fixed by our friends at \u003Ci\u003EBlitworks\u003C/i\u003E. A noticeable issue fixed this week includes a bug that prevented testers from placing maneuver nodes in the map view while using one specific controller preset. Luckily, this one was detected and solved before these version saw the light of day, so you won’t have to worry about it.\u003C/p\u003E\n\u003Cp\u003EFinally, we encourage you to participate in our latest \u003Ci\u003E\u003Cb\u003EKSP Challenge\u003C/b\u003E - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/167335-ksp-challenge-destroy-the-ksc/\u0022 rel=\u0022\u0022\u003EDestroy the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E!\u003C/a\u003E\u003C/i\u003E This time around, the challenge consists of destroying the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E while using as few and as low cost parts as possible in a single launch. Are you up to the challenge? Check it out and share your creations!\u003C/p\u003E\n\u003Cp\u003EThat’s it for this week. Be sure to join us on our official forums, and don’t forget to follow us on \u003Ca href=\u0022https://twitter.com/KerbalSpaceP\u0022 rel=\u0022external nofollow\u0022\u003E\u003Ci\u003ETwitter\u003C/i\u003E\u003C/a\u003E and \u003Ca href=\u0022https://www.facebook.com/kerbalspaceprogram/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Ci\u003EFacebook\u003C/i\u003E\u003C/a\u003E. Stay tuned for more exciting and upcoming news and development updates!  \u003C/p\u003E\n\u003Cp\u003EHappy launchings!\u003C/p\u003E\n"},{"CreatedByName":"SamBelanger","CreatedById":166917,"CreatedDateTime":"2017-11-10T22:23:53Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003ECool! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Kosmonaut","CreatedById":137785,"CreatedDateTime":"2017-11-10T23:00:28Z","Content":"\n\u003Cp\u003E\nIncredible work on the engine\n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2017-11-10T23:02:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216229\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510354828\u0022 data-ipsquote-userid=\u0022137785\u0022 data-ipsquote-username=\u0022Kosmonaut\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Kosmonaut said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIncredible work on the engine\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed! Lovin\u0027 those engines!!! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-10T23:02:57Z\u0022 title=\u002211/10/2017 11:02  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 10, 2017\u003C/time\u003E by Just Jim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"gmiddlemass","CreatedById":111037,"CreatedDateTime":"2017-11-11T01:15:59Z","Content":"\n\u003Cp\u003E\nLooking good \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2017-11-11T01:45:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216195\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510352454\u0022 data-ipsquote-userid=\u002266485\u0022 data-ipsquote-username=\u0022SQUAD\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, SQUAD said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe team has also been \u003Cb\u003Eworking on the Scoring System for Missions\u003C/b\u003E. Specifically on hooking the Scoring Information to the Mission Summary screen, in order that players are able to see their full scoring details after completing a mission.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWondering if this is going to be a numerical scoring system or just a pass/fail type of scoring?\n\u003C/p\u003E\n"},{"CreatedByName":"JPLRepo","CreatedById":114736,"CreatedDateTime":"2017-11-11T01:47:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216320\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510364715\u0022 data-ipsquote-userid=\u0022113880\u0022 data-ipsquote-username=\u0022shdwlrd\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, shdwlrd said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nWondering if this is going to be a numerical scoring system or just a pass/fail type of scoring?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe scoring system is very flexible and allows the mission creator many options, and yes it is a numerical system.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2017-11-11T01:57:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216321\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510364870\u0022 data-ipsquote-userid=\u0022114736\u0022 data-ipsquote-username=\u0022JPLRepo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, JPLRepo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe scoring system is very flexible and allows the mission creator many options, and yes it is a numerical system.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCool, good to know. No more confusion for scoring challenges. I\u0027m all about that. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-11-11T02:06:15Z","Content":"\n\u003Cp\u003E\nso with the making of missions, if I wanted to I could make tutorials for new players, stuff like landing on The Mun, getting to orbit, stuff like that? that\u0027s a kind of mission I could make with MH? \u003Cspan style=\u0022color:#ffffff;\u0022\u003Efinally I\u0027m going to be useful at something!\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2017-11-11T03:00:52Z","Content":"\n\u003Cp\u003E\nSo are these missions limited to specific vehicles built by the mission creator, or can a player fly a mission using their own vehicle, provided it fits within mission parameters (size limits, mass limits, use a specific part, things like that)?\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-11-11T03:02:10Z","Content":"\n\u003Cp\u003E\nMmm. Nice butt.\n\u003C/p\u003E\n"},{"CreatedByName":"JPLRepo","CreatedById":114736,"CreatedDateTime":"2017-11-11T03:39:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216356\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510369252\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nSo are these missions limited to specific vehicles built by the mission creator, or can a player fly a mission using their own vehicle, provided it fits within mission parameters (size limits, mass limits, use a specific part, things like that)?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe mission creator specifies the vessels in the mission and other mission specific characteristics.\u003Cbr\u003E\nThe mission creator can supply defined vessels for some or all of the vessels in the mission, or the mission creator can specify any particular number of vessels in the mission to be mission player built.\n\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2017-11-11T04:24:25Z","Content":"\n\u003Cp\u003E\nOkay, that \u0022Oumuamua\u0022 stuff is kind of frightening. I know it\u0027s gonna miss us and all but still,,, Yikes!\n\u003C/p\u003E\n\u003Cp\u003E\nUnleash the Claws!\n\u003C/p\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2017-11-11T04:55:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216334\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510365975\u0022 data-ipsquote-userid=\u0022171175\u0022 data-ipsquote-username=\u0022StupidAndy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, StupidAndy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nso with the making of missions, if I wanted to I could make tutorials for new players, stuff like landing on The Mun, getting to orbit, stuff like that? that\u0027s a kind of mission I could make with MH? \u003Cspan style=\u0022color:#ffffff;\u0022\u003Efinally I\u0027m going to be useful at something!\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou could certainly set up specific goals for the player, display messages and some other actions, whether you could do all the logic you might want for a tutorial would depend on what sort of logic checks you wanted to do and how interactive you wanted it to be. That said the nodes are \u0022moddable\u0022 so tests/actions that are not built in stock could be extended on.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally I think you could do it, but depends on how speicifc you wanna be as to whether it will all be there outta the box\n\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2017-11-11T07:36:26Z","Content":"\n\u003Cp\u003E\nCould one Mission lead to another, with some data passing from one to the next?  (A \u0022campaign\u0022 of semi related activities.)\n\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2017-11-11T15:48:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216195\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510352454\u0022 data-ipsquote-userid=\u002266485\u0022 data-ipsquote-username=\u0022SQUAD\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, SQUAD said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs noted in a previous \u003Ci\u003EKSP Weekly\u003C/i\u003E, we’re ensuring that our new engines fill some of the larger gaps, and ensuring engines have enough variance in stats to provide a wide array of new options for players without overlapping functionality.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOf course, if it\u0027s performance was modeled after the J-2 it would be a smaller Rhino (what a coincidence!) and utterly declass the Poodle. I can see how this would be a problem.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, taking one of the most famous and recognizable engines and assigning it a wholly different role as mandated by the (essentially random) gaps in your existing lineup is not nice. Besides, I for one wouldn\u0027t mind if the Poodle was declassed.\n\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2017-11-11T15:55:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216705\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510415283\u0022 data-ipsquote-userid=\u0022110461\u0022 data-ipsquote-username=\u0022Laie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Laie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nOf course, if it\u0027s performance was modeled after the J-2 it would be a smaller Rhino (what a coincidence!) and utterly declass the Poodle. I can see how this would be a problem.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, taking one of the most famous and recognizable engines and assigning it a wholly different role as mandated by the (essentially random) gaps in your existing lineup is not nice. Besides, I for one wouldn\u0027t mind if the Poodle was declassed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a pretty drastic set of random assumptions.\n\u003C/p\u003E\n"},{"CreatedByName":"Raptor9","CreatedById":67915,"CreatedDateTime":"2017-11-11T16:10:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216458\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510385786\u0022 data-ipsquote-userid=\u0022109920\u0022 data-ipsquote-username=\u0022basic.syntax\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, basic.syntax said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCould one Mission lead to another, with some data passing from one to the next?  (A \u0022campaign\u0022 of semi related activities.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve been pondering this myself. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPersonally, as much as I\u0027m looking forward to the mission builder aspect,\u003Cem\u003E the first\u003C/em\u003E thing I\u0027ll be doing when the DLC drops is making Saturn V and Soyuz look-a-likes.  So many engines, so much clustering to do. \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2017-11-11T16:25:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216709\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510415708\u0022 data-ipsquote-userid=\u0022105198\u0022 data-ipsquote-username=\u0022RoverDude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, RoverDude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s a pretty drastic set of random assumptions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI object to my assumptions being \u0022random\u0022: devnotes above state that the KSP J-2 is to be less vacuum-y than even the skipper. That puts it in quite a different role than the real J-2, doesn\u0027t it?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-11T16:36:56Z\u0022 title=\u002211/11/2017 04:36  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 11, 2017\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2017-11-11T18:06:20Z","Content":"\n\u003Cp\u003E\nI am really looking forward to the coming Add On and the new parts. Incredible work!\n\u003C/p\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-11-11T20:40:22Z","Content":"\n\u003Cp\u003E\nrandom question #2:\n\u003C/p\u003E\n\u003Cp\u003E\nwhere will we be able to get these missions? will we get them like mods and download them off curse/spacedock?\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-11-11T20:59:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216904\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510432822\u0022 data-ipsquote-userid=\u0022171175\u0022 data-ipsquote-username=\u0022StupidAndy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, StupidAndy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nrandom question #2:\n\u003C/p\u003E\n\u003Cp\u003E\nwhere will we be able to get these missions? will we get them like mods and download them off curse/spacedock?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m thinking the Challenges subforum will be a fertile testing ground for the mission builder.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-11T21:00:19Z\u0022 title=\u002211/11/2017 09:00  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 11, 2017\u003C/time\u003E by Cpt Kerbalkrunch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-11-11T22:17:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216926\u0022 data-ipsquote-contentid=\u0022167409\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510433978\u0022 data-ipsquote-userid=\u0022175588\u0022 data-ipsquote-username=\u0022Cpt Kerbalkrunch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Cpt Kerbalkrunch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m thinking the Challenges subforum will be a fertile testing ground for the mission builder.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nmaybe an entire new subforum?\n\u003C/p\u003E\n"},{"CreatedByName":"CoreI","CreatedById":173589,"CreatedDateTime":"2017-11-12T23:10:14Z","Content":"\n\u003Cp\u003E\nGreat news! I love the new engine!\n\u003C/p\u003E\n\u003Cp\u003E\nWill it be possible for engines (or other parts for that matter) to “break” without fully exploding? That would allow challenges like: Make a rocket that can get to orbit with one engine failure. (Rocket must have less than X engines)\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, with these new part failure features, will parts be able to fail/explode in a regular sandbox/science/career game?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-12T23:11:22Z\u0022 title=\u002211/12/2017 11:11  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 12, 2017\u003C/time\u003E by CoreI\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EleSigma","CreatedById":11215,"CreatedDateTime":"2017-11-13T00:30:06Z","Content":"\n\u003Cp\u003E\nHow far are the devs going for the making history parts? Space Shuttle and ISS? moon, mars and near future missions? Have they even decided?\n\u003C/p\u003E\n"}]}