{"TopicId":223214,"ForumId":123,"TopicTitle":"A jaunt to Jool","CreatedByName":"ncw33","CreatedById":225125,"CreatedDateTime":"2024-01-23T13:46:54Z","PageNum":1,"Articles":[{"CreatedByName":"ncw33","CreatedById":225125,"CreatedDateTime":"2024-01-23T13:46:54Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EExclusive news report! Our brave Kerbonauts have returned from Jool.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSince year 25, Jeb, Val, Bill, and Bob have been bravely exploring the Jool system. Now they return to tell their tale!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThe journey begins\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe trip consisted of two launches, both launched on the same day of the Jool transfer window in year 25.\n\u003C/p\u003E\n\u003Cp\u003E\nThe launch vehicles were similar: a 6× Vector lower stage, with SRBs; a SWERV transfer stage, and a payload on top.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first launch (below) contained an unmanned (or so we thought!) Tylo lander, with a Mk-1 lander can on top of an ascent stage, a payload bay for science, and a descent stage to be dropped just before landing the upper stage.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20201307.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20201307.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe robotic upper stage was sent from a 120km circular orbit on a fairly unremarkable transfer to Jool, in fact, not even using up all the Methalox:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20201654.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20201654.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBill says, \u0022we slapped the rocket together according to Jeb\u0027s design, without precalculating the δv. Naturally we ended up with 800m/s too much Methalox and about 1000m/s too little Hydrogen. But our fuel tanks have remarkably little fuel boil-off so who cares!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nNext, the crewed stage launched (below). The lower stages were the same, with an upper stage consisting of a Mk-3 capsule, a docking port, and a honking big Tuba engine. We put an Orbital Science module in the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\nIn true Kerbal style, Jeb says: \u0022I used some parts from my junkyard to build a fairing over the docking port on the nose, because Bob said he needed to make 2000 more scientific discoveries before he could work out how to put a hatch over the docking port. I don\u0027t know what 2000 discoveries means, but my fairing worked fine\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nVal commented, \u0022I put plenty of fuel in the crewed stage, so that we could refuel the lander as we visited different Joolian müns. After the Tylo ascent, the lander will definitely need a refill, but the upper stage (that we didn\u0027t expend on Tylo) will have plenty of capacity to hop around the other müns.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20201724.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20201724.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOur Kerbonauts made another unremarkable transfer, pretty efficient with the outward trajectory from Kerbin almost parallel to Kerbin. Val chose to include a radial component in the ejection burn, as she normally does, to reduce the relative inclination for later.\n\u003C/p\u003E\n\u003Cp\u003E\nVal admits, \u0022I\u0027m still waiting for Bob to learn how to calculate transfer angles, so I eyeballed the transfer window in the Tracking Station. Honestly, when our \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E GUI gets that update we\u0027ll all be glad. It\u0027s remarkable how much δv you waste on radial adjustments if you\u0027ve 5-10° out in the transfers.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20201654.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20201654.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFor the interest of our readers, Jeb insists on showing you his mid-course corrections, for both the lander and crewed capsule in their convoy. The editor apologises that we didn\u0027t have time to commission high-quality infographics.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20201824.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20201824.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20222301.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20222301.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe mid-course correction to Jool is done at the \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E, and here we spent some δv on adjusting the encounter to get a nice flyby of Tylo, on the near side of Jool, for both vehicles. Although the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E GUI doesn\u0027t show it very well, we have got a free Jool capture for each vehicle.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EArrival at Jool\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, many months (many müns?) later, our Kerbonauts arrived at Jool.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb apologises that he forgot to capture the manoeuvres performed there!\n\u003C/p\u003E\n\u003Cp\u003E\nJeb does \u003Cem\u003Enot\u003C/em\u003E believe that it is efficient to do a capture burn around Tylo. Instead he does a zero-burn flypast of Tylo to reach an elliptical Jool orbit with roughly the same semi-major axis to Tylo (with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E adjustments perhaps to get the inclination to zero on the way past). Then, Jeb burns at Jool \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E/\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E to \u0022rendezvous\u0022 with Tylo (waiting one orbit of Jool...) and the capture burn around Tylo is then very cheap.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth our vehicles reach Tylo orbit, then rendezvous, and dock. Val did remember to grab some pictures of this, at least (using her magic camera mounted goodness-knows-where outside the ship).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20222551.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20222551.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20222654.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20222654.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWe transferred the remaining Hydrogen into a single tank, using an EVA to set up one of Bob\u0027s long cryogenic fuel hoses that was stored somewhere on board, then jettisoned the SWERV that we didn\u0027t need.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDisaster strikes!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNow at this point, our crew made a surprise discovery. Bob was on the \u0022uncrewed\u0022 lander! Cheeky stowaway... after testing our rockets a few times, he must have snuck on board. [Editor: yes, doing \u0022Revert to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u0022 can repopulate your Kerbals... watch out!]\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the crew chanted \u0022Kraken\u0027s fate, kraken\u0027s fate, kraken\u0027s fate\u0022 [Editor: Alt\u002BF8] until he disappeared back to Kerbin in a puff of magic Kraken dust. Too much time was spent on this mission to start again [Ed: I have no shame working around a bug with F8].\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDescent to Tylo\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTim C bravely used his lower-stage Trumpet to do a tiny de-orbit burn, then a 2000m/s suicide burn on a precise trajectory to reach the source of a strange signal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20222948.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20222948.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe lower stage, thankfully, had about 1000m/s of extra fuel. Tim C knew that Tylo needed \u00222000 down, 2000 up\u0022 but budgeted an extra 1000 for hovering around near the ground to adjust the precision landing.\n\u003C/p\u003E\n\u003Cp\u003E\nTim C adds, \u0022Bill, you\u0027d better work out how to add targets to our navball \u003Cem\u003Efast\u003C/em\u003E, or I\u0027m going to go crazy. Even 1000m/s of wasted δv on the wretched landing was only just enough to get close to the target. We worked our \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to the max on some crazy switches between horizontal and vertical burns to move a few km closer to the target while minimizing time spent hovering.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBut, we did it:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20223402.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20223402.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDisaster strikes again!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTo take a sample from the monument, Tim C had to go on an EVA to walk a few 100m closer. But his feet got stuck in the Tylo regolith!\n\u003C/p\u003E\n\u003Cp\u003E\nTotally stuck.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter lots of fiddling with his suit controls [Ed: timewarp] Tim C gave up again and chanted \u0022Kraken Fate\u0022 until he teleported close enough to grab a sample, then headed back to the lander the same way. [Ed: yes really, no shame using F8 if the Kerbals can\u0027t walk on flat ground.]\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETransfer to Pol\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter docking and refueling the lander, the crew headed out to Pol, using the last of the Hydrogen and then moving on to the Tuba\u0027s big Methalox tank.\n\u003C/p\u003E\n\u003Cp\u003E\nThere were not many opportunities to save (or waste) fuel on the way, so it was a gentle ride.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20223725.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20223725.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTim C landed on each biome of Pol (only one shown below for brevity):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20223814.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20223814.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThen, Tim C entered a polar orbit at 4km \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E/\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E and started looking for fun objects to explore.\n\u003C/p\u003E\n\u003Cp\u003E\nOne was found rather quickly:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20223917.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20223917.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nOne took an \u003Cem\u003Eincredibly\u003C/em\u003E long time to find:\n\u003C/p\u003E\n\u003Cp\u003E\n[Ed: the timewarp speeds are ludicrously limiting on Pol. We need to be able to orbit faster if we\u0027re going to stand a chance of finding all the discoverables without cheating for coords from Discord.]\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20223955.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20223955.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThe journey home\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, our crew re-united, ditched the lander, and with the weight saved from that, had plenty of fuel left to return.\n\u003C/p\u003E\n\u003Cp\u003E\nVal comments: \u0022I was sad not to be allowed to land on this trip. But next time I\u0027ll get my chance!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20224120.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20224120.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a standard return transfer (after a long wait!) Jeb \u0026amp; Val made the following small mid-course correction burn.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20224251.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20224251.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20224226.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20224226.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd here they are, the brave heros!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Screenshot%202024-01-18%20224407.png?raw\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://github.com/NWilson/public/blob/main/Pictures/KSP/Jool/Screenshot%202024-01-18%20224407.png?raw=true\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E[Editor\u0027s appendix - Bugs/issues encountered]\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nIssues with \u0022Revert to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u0022 changing the Kerbal complement of capsules\n\u003C/li\u003E\n\u003Cli\u003E\nCouldn\u0027t use the SWERV layout I wanted due to δv bugs\n\u003C/li\u003E\n\u003Cli\u003E\nEncounters sometimes not showing up properly made it hard to get the free capture from Tylo\n\u003C/li\u003E\n\u003Cli\u003E\nLack of UI for transfers a bit of a pain. Also Manoeuvre mod is a must.\n\u003C/li\u003E\n\u003Cli\u003E\nLack of navball assist on Tylo monument landing a total pain. Not enough δv to hover while trying to move closer.\n\u003C/li\u003E\n\u003Cli\u003E\nKerbals can\u0027t walk on Tylo?\n\u003C/li\u003E\n\u003Cli\u003E\nTimewarp limits made Pol discoverables a total pain.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cem\u003ELots\u003C/em\u003E of savefile issues. I encountered the infamous \u0022Landed state in orbit\u0022 bug, and some weird ones where vessels disappeared or had their orbits badly messed up (into crashing trajectories) on save/load.\n\u003C/li\u003E\n\u003Cli\u003E\nI also had the \u0022vessel throttle set to max on switching vessel\u0022 bug.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nI upvoted all the relevant bugs, as usual.\n\u003C/p\u003E\n"}]}