{"TopicId":223333,"ForumId":123,"TopicTitle":"Clouds of Laythe","CreatedByName":"Jason_25","CreatedById":55730,"CreatedDateTime":"2024-01-29T20:22:19Z","PageNum":1,"Articles":[{"CreatedByName":"Jason_25","CreatedById":55730,"CreatedDateTime":"2024-01-29T20:22:19Z","Content":"\n\u003Cp\u003E\nMission highlights and objectives:\n\u003C/p\u003E\n\u003Cp\u003E\nTest stacking several ships together mostly inline as a huge upper stage with almost 50K \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E in orbit\n\u003C/p\u003E\n\u003Cp\u003E\nTest multiple corridors or passages that break up an otherwise linear design\n\u003C/p\u003E\n\u003Cp\u003E\nTest \u0022fallout shelter\u0022 with various objects shielding Spiderbot berths while in transit\n\u003C/p\u003E\n\u003Cp\u003E\nTest Durandal Excalibur as a carrier with parasite fighter in an extended mission\n\u003C/p\u003E\n\u003Cp\u003E\nTest \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E \u0022Quebec\u0022 STOVL performance as parasite fighter on Laythe\n\u003C/p\u003E\n\u003Cp\u003E\nTest Islandhorse with aero drop tanks on bonus Jool mission to establish elliptical orbit and launch probes\n\u003C/p\u003E\n\u003Cp\u003E\nTest Headless Horseman probe alpha on bonus mission to \u0022land\u0022 on Jool\u0027s surface\n\u003C/p\u003E\n\u003Cp\u003E\nTest Headless Horseman probe bravo on bonus mission to establish a low orbit around Vall\n\u003C/p\u003E\n\u003Cp\u003E\nTest Spiderbot on bonus mission to establish a low orbit around Bop\n\u003C/p\u003E\n\u003Cp\u003E\nMission synopsis:\n\u003C/p\u003E\n\u003Cp\u003E\nWith assistance from 2 \u0022Gargantua\u0022 class boosters and Islandhorse the launch stack roared into space and established a parking orbit.  The frame rate is so low here that any redesign was essentially impossible.  This mission had to be one shot once we made orbit in terms of redesign - not so much in terms of save/load.  The transfer to Jool went uneventfully and we were set up with luck for an easy burn to encounter Laythe for an aerobrake.  It was at this point that we realized that it would be best to begin to deploy vehicles from the stack so the aero vehicles could enter Laythe\u0027s atmosphere alone.  As outlined in the mission highlights and objectives these bonus missions were successfully spun off.  Notably Pol and Tylo were not visited as the goal quickly became to leave hardware on each visited world as a kind of rule.  Most suprisingly probe alpha did successfully touch down softly on some sort of surface on Jool after deploying a parachute making for a very strange hazy green view of the sky above.  By now, the only bugs encountered were low frame rate during launch and various bugs with the maneuver planner. \n\u003C/p\u003E\n\u003Cp\u003E\nBut that gentle beginning of the mission was all about to change.  The trouble really began at Laythe atmospheric interface.  3-4 FPS was all we could achieve here and a series of complex structural stability and other bugs ensued for the aero vehicles.  Certainly the aero vehicles have an \u0022aggressive design\u0022 with a fair amount of clipping but the game waits to punish you for these things at the worst possible times.  Very little could be done but a large amount of save/reload actions here to keep the right wing and right engine from falling off Quebec.  This was the first nightmare.  We have the terrible heating system disabled so aerobraking slowed us down hugely after working past the bugs.  After aerobraking and establishing orbit the aero vehicles were separated. \n\u003C/p\u003E\n\u003Cp\u003E\nEventually both Aero vehicles were landed on Laythe\u0027s surface.  Second nightmare was with Quebec which has a bug with the cargo bays that it thinks it is crashing into ground at 100 meters but a \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E landing instead of a conventional one solved that.  Third nightmare was with the Excalibur deorbit and landing that has 2 separate random structural stability bugs which include random rapid shaking which destroys the vehicle and random loss of part cohesion which could not always be worked around with save/reload or fast forward.  To make things worse, K2-D2 does not handle as well as \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E alone, triggers structural stability bug 1 more often, and does not give good feedback during an emergency that it has taken control away from the player.  Furthermore, fuel COG is an issue with Excalibur and there are too many tanks for a manual transfer and it takes too long to transfer fuel during an emergency and there is no automatic facility to do so and the game logic does not prioritize fuel consumption well.  All of the troubleshooting and desperately grasping for answers happens at 3 FPS which is both a good and bad thing.  Ultimately we have found it is best to let Excalibur flat spin towards the ground and orient retrograde at about 2000 meters altitude and fire the engines full blast and switch \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E mode from retrograde to normal.  At low altitude it is controllable at a low thrust setting even with the COG pushed far aft and even with structural stability bug 2 happening.  This is a good design - the trashiness of the game code is trying to destroy it but it just keeps flying.\n\u003C/p\u003E\n\u003Cp\u003E\nEventually Excalibur made a conventional landing around 3KM from Quebec and Quebec taxied over to it because  it would have taken hours with the framerate so low to do it the other way.  Finally Excalibur takes back off again but not before another bug/poor game design with Jeb not being able to join Valentina because he can not get out of the cockpit of Quebec.  Valentina checks out the clouds and gets used to the controls before climbing out using Tylo for a gravity assist back to a Kerbin aerobrake and landing.  A bonus nightmare if you will is getting the deorbit right so we deorbit anywhere near the space center and also without a ridiculous vertical velocity but also do not overshoot!  Then there is of course the same nightmare #3 that happens on Kerbin after deorbit as well.  During landing we had a really strong 7 FPS so that was a happy time  The FPS drops a lot when \u0022in play\u0022 and the engines are running so the counter does not show how low the typical FPS is.  Anyway bugfest complete.\n\u003C/p\u003E\n\u003Cp\u003E\nComic strip captions:\n\u003C/p\u003E\n\u003Cp\u003E\nUpper left - Orbital stack shown.  Includes Islandhorse\u002B and 2 headless horseman probes.  Next in line is crew-optional Spiderbot.  Above Spiderbot is the interstitial stage.  Next in line is Excalibur with the mini interstitial above and then \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E Quebec above the mini interstitial.\n\u003C/p\u003E\n\u003Cp\u003E\nUpper right - Landed at Laythe.  The aspect here causes Quebec to look larger and Excalibur to look smaller.  Note that running through rocks has no affect.  The other vehicles at this point are all still in one piece and on bonus missions.  The sky is very gray but flying is not much different.\n\u003C/p\u003E\n\u003Cp\u003E\nLower Left - Flying in clouds of Laythe.  Initially I thought the trailer showed Valentina flying on Laythe but now I see that there is a ringed planet in the background.  Also the clouds in the trailer are larger and more numerous than the wispy clouds of Laythe.  There is significant haze in the air.\n\u003C/p\u003E\n\u003Cp\u003E\nLower right - Stopped at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.  Do not be fooled by the fuel level because this vehicle has 45K \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E when fully fueled.  A lot of fuel was used fighting with it due to bugs and design deficiencies with the game.  With some reinforcement or structural bug fixing much less fuel could have been used.    The lighting is amazing here.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LAYTHEMISSIONCOLLAGE.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022http://softwarefreedomsolutions.com:6001/LAYTHEMISSIONCOLLAGE.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNote 1 - If you can not see the comic strip then reload or try a new tab or restart your browser.  Thanks for your understanding.\n\u003C/p\u003E\n\u003Cp\u003E\nNote 2 - Most of these are modded vehicles that I shamefully call \u0022Cheatbirds\u0022\n\u003C/p\u003E\n"}]}