{"TopicId":172758,"ForumId":97,"TopicTitle":"(Mission Builder) Detect that a vessel is gone, regardless of how","CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2018-03-21T10:21:23Z","PageNum":1,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2018-03-21T10:21:23Z","Content":"\n\u003Cp\u003E\nThere are 3 ways I can think of that a vessel becomes gone:\n\u003C/p\u003E\n\u003Cp\u003E\n1 - Destroyed.\n\u003C/p\u003E\n\u003Cp\u003E\n2 - Splashed or Landed and then recovered.\n\u003C/p\u003E\n\u003Cp\u003E\n3 - Merged into another craft via docking.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t figure out, after several hours of trying, how to form  test that can detect if a vessel is gone and *not care* which reason there is that it\u0027s gone.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternatively, if I could test a simple dumb count of how many vessels exist, period, that would give me what I need too.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I\u0027m trying to do is make a mission that does \u0022space junk clearing\u0022.  It will spawn a few vessels in orbit for the player to try to recover, then later end the mission only after there\u0027s no vessels left in orbit.  I don\u0027t care about the order they get taken care of.  The mission score is based on whether you\u0027ve made profit on the recovery costs that exceeds the money you spent building rockets.\n\u003C/p\u003E\n\u003Cp\u003E\nI figured out how to score based on recovery cost/profit - I just can\u0027t figure out how on earth to trigger the end of the mission by detecting that all vessels aren\u0027t in orbit anymore, since there\u0027s so many different ways for a vessel to stop existing and I can\u0027t quite work out how to cover all of them.  The ugly problem is that if the player docks with the satellite and then brings it down to a soft landing, it\u0027s no longer *that* vessel anymore - it has become part of the recovery vessel, so any triggers based on *that* vessel being landed aren\u0027t going to be true.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-21T10:23:16Z\u0022 title=\u002203/21/2018 10:23  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 21, 2018\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"}]}