{"TopicId":175225,"ForumId":97,"TopicTitle":"What grade would you give the Making History expansion?","CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2018-05-23T16:32:55Z","PageNum":1,"Articles":[{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2018-05-23T16:32:55Z","Content":"\n\u003Cp\u003E\nIf you own the Making History expansion, I am curious as to how you feel about it.  Vote for a letter grade in the poll and if you care to elaborate on why you scored it as you did, leave a comment.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-03T15:18:20Z\u0022 title=\u002209/03/2018 03:18  PM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 3, 2018\u003C/time\u003E by klesh\u003C/strong\u003E\n\u003Cbr\u003EPlease don\u0026#039;t move this to the Making History discussion forum. No one visits there.\n\u003C/span\u003E\n"},{"CreatedByName":"blakemw","CreatedById":168819,"CreatedDateTime":"2018-05-23T21:17:35Z","Content":"\n\u003Cp\u003E\nI\u0027d give it a C-, a barest passing grade, though I\u0027m not interested in the mission builder so that feature does not affect the grade either positively or negatively.\n\u003C/p\u003E\n\u003Cp\u003E\nThe new engines are poorly balanced, with the Wolfhound being much too cheap and the Mastodon being too weak to lift a Saturn V KSP-equivalent replica (you had one job Mastodon!) and the Kodiak being literally equal to or worse than the Reliant in every way (why not give it \u002B10kN thrust or something). It has flaws like Structural tubes having internal attachments nodes but not shielding their contents from drag and bugs like Wolfhound nozzles being indestructible in certain variants and Service Modules being indecisive about whether they are shrouded/open or not. 1 grade off for not balancing parts harmoniously with existing parts \u0026amp; their replica roles, 1 grade off for bugs and flaws, and a - just because.\n\u003C/p\u003E\n\u003Cp\u003E\nIt still gets a passing grade because the 1.8m parts, 5m parts and engine plates add something to the game and the additional launch sites and quick-switch between \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E are also welcome additions.\n\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2018-05-25T14:01:36Z","Content":"\n\u003Cp\u003E\nStrange.  A clean 100 views and only 11 votes.  Either Making History is really unpopular, or no one cares enough about it to bother clicking a score to show their support for it. \n\u003C/p\u003E\n\u003Cp\u003E\nInteresting that for the same product some people would give it an A or A- while others would give it an F.   Throwing out the 2 highest and two lowest grades gives us an average grade of C\u002B, though obviously the statistical significance of 11 pieces of data is essentially zero.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI wonder how people would\u0027ve felt if the Mission Builder and the History Pack were sold separately?\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2018-05-25T15:20:09Z","Content":"\n\u003Cp\u003E\nSince this is about the Making History expansion, I\u0027ve moved it to the Making History discussion.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2018-05-25T15:44:06Z","Content":"\n\u003Cp\u003E\nTBH, I haven\u0027t played any of the missions, and I\u0027ve just used the mission editor as a way to place launchpads in various places - That ability, in stock, is very nice. Having to go about making a barebones mission to do it is a bit meh (but I just use one template), it would have been nice if it was a toggle-able sandbox feature.\n\u003C/p\u003E\n\u003Cp\u003E\nI like the additional launch sites, the thrust plates are nice, making use of variant switching is nice, the new parts are well modeled, but not well balanced.\n\u003C/p\u003E\n\u003Cp\u003E\nIts only the addition of a mission editor that warrants the label expansion, otherwise its a DLC parts pack. So far I\u0027m still not entirely sure of the mission builder potential.\n\u003C/p\u003E\n\u003Cp\u003E\nTo me it meets the minimum requirements, but doesn\u0027t \u0022wow\u0022 me, so... a C.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Tyko","CreatedById":164179,"CreatedDateTime":"2018-05-25T18:41:32Z","Content":"\n\u003Cp\u003E\nI haven\u0027t used Mission Builder and never intend to. I bought the MH expansion for the additional parts. It was sad how buggy and unbalanced parts were. I feel like creating and balancing parts should be table stakes for Squad at this point, so that was a big let down. I\u0027ve gotten many better functioning, better balanced parts for free from modders. I\u0027ve since switched back to 1.3.1 and wish I could get my money back until MH is fixed. I certainly won\u0027t be buying the next DLC on day one.\n\u003C/p\u003E\n\u003Cp\u003E\nI gave it a C\u002B in anticipation of Squad getting it together and actually delivering something with less bugs.\n\u003C/p\u003E\n"},{"CreatedByName":"Bottle Rocketeer 500","CreatedById":178766,"CreatedDateTime":"2018-05-25T20:17:25Z","Content":"\n\u003Cp\u003E\nF\n\u003C/p\u003E\n\u003Cp\u003E\nRushed, poorly implemented\n\u003C/p\u003E\n\u003Cp\u003E\nAll I can say\n\u003C/p\u003E\n"},{"CreatedByName":"Dark Lion","CreatedById":166634,"CreatedDateTime":"2018-05-25T20:33:12Z","Content":"\n\u003Cp\u003E\nI\u0027d let it pass by the width of a frog\u0027s hair. Here\u0027s why:\u003Cbr\u003E\nFor all intents and purposes, the game has not been changed for the worse, therefore the additional parts and variants will expand the players\u0027 potential for creativity. Alright, but \u003Cem\u003Ejust\u003C/em\u003E alright. I wouldn\u0027t call that a fail.\u003Cbr\u003E\u003Cbr\u003E\nRight off the bat, I built a kerbal-scaled Saturn V replica that couldn\u0027t lift off, using the very engines Squad gave us with MH. Oh, right... I totally forgot that NASA always wastes space, and doesn\u0027t fill fuel tanks up all the way! OF COURSE! Either this was never really part of the agenda, or no one bothered to do (in testing) what they must\u0027ve all known would\u0027ve been a more popular activity, once the expansion went live... Seriously...? Why aren\u0027t the Soyuz and Saturn the easier things to make?! \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0022 rel=\u0022\u0022\u003E@SQUAD\u003C/a\u003E you must know those systems will be like a honeypot to new players! Anyway... back to your alternative school lesson...\n\u003C/p\u003E\n\u003Cp\u003E\nDuring the pre-release hype, I saw squares and triangles in a few sizes and those boarded up windows to my creativity \u003Cem\u003Eexploded\u003C/em\u003E with new, tidier, and more resilient structures. The offered structural panels would allow for new architectural, artistic and even more robust vehicle designs. The day MH went live, I was nearly nuclear. I was so hot about having ten attachment nodes (who the hell thought this was a good idea?!) to each part I could\u0027ve fused the bits together with the heat coming from my head. A lot faster, and probably more neatly. By and large, this is the biggest disappointment of the expansion for me, but I\u0027m not finished yet...\u003Cbr\u003E\u003Cbr\u003E\nSick with my latest wasted effort in building a simple shanty out of structural parts, I go back to the Saturn V replica I\u0027d been so disappointed in... and ripped it apart. This time I focused on using the correct engines (from MH. i.e. Wolfhound, Skiff, Mastodon, etc.) and let the words \u0022scale\u0022 and \u0022replica\u0022 go a bit by the wayside. Little did I know, some of those engine vectors were a bit on the wayside too! My lifter worked alright, but once I got to space, I realized there was no stable flight without spinning uncontrollably due to poorly aligned engine thrust vectors. And before you ask: no, I did not make any adjustments to those engines whatsoever. They came to me offset.\u003Cbr\u003E\u003Cbr\u003E\nOH! but did I mention I couldn\u0027t even look out the window, because there was no IVA? Yeah. Good save, patching that, sure... but did you even test it first? You remember that part in school, where the teach asks you to double-check your work? This particular part would have taken a minute at the most, just to put a kermanned command pod on the pad...\n\u003C/p\u003E\n\u003Cp\u003E\nI could keep going, but I feel like I should half-ass this little review too... so I\u0027m going to.\u003Cbr\u003E\n(Yes, both.)\n\u003C/p\u003E\n\u003Cp\u003E\nOkay, the main attraction failed miserably. The ideal building blocks for me is too frustrating to be anything short of fail. How about my beloved aircraft? Everything looking good there. More options is great! I\u0027m excited and building again. The fuel tank variety makes good on versatility and variety, as well as some aesthetic appeal... and then I hear the old engines making new.... \u003Cem\u003Enoise.\u003C/em\u003E Sorry Squad, but when is the last time you appreciated the vehicle you hear often suddenly making a new noise?! Exactly. You don\u0027t want that, ever, unless it\u0027s \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E UPGRADE!!!\n\u003C/p\u003E\n\u003Cp\u003E\nSure, sure, sure... I know. A patch has fixed most of this since. I\u0027m aware and playing 1.4.3\u002BMH currently. I have only Kerbal Engineer Redux installed, to be sure mods aren\u0027t conflicting anywhere, but I still have many strange bugs cropping up that I can\u0027t replicate. The wheels still misbehave at times, much like the aero bug surrounding the fairings and other shielded structural parts. I still have to revert to launch inconsistently because the entire screen is grayed over when I launch. Stranger things have happened, but bugs get crushed with time. How long exactly do you plan to pay your exterminators to fail?\n\u003C/p\u003E\n\u003Cp\u003E\nI realize that not all of these complaints are directly about the expansion, but consider the release date of it compared to 1.4.1... Unity upgrades and Squad is trying to rush through and get that money from Making History with that hurdle. I\u0027m supposed to believe there\u0027s not enough money for testing. I\u0027m convinced. But guess what?! The same way Squad can\u0027t be held accountable for a potential buyer not having a computer to run their game, I can\u0027t be held responsible for Squad\u0027s failings. Especially after selling out to a big name like Take Two Interactive... There\u0027s most certainly a \u003Cem\u003Ereason for that.\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2018-05-25T20:43:05Z","Content":"\n\u003Cp\u003E\nVery few people are making and playing Missions. The Vostok capsules are great, but they\u0027re about all I use on a regular basis for the parts.\n\u003C/p\u003E\n"},{"CreatedByName":"Dark Lion","CreatedById":166634,"CreatedDateTime":"2018-05-25T20:52:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223386006\u0022 data-ipsquote-contentid=\u0022175225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527256896\u0022 data-ipsquote-userid=\u0022110814\u0022 data-ipsquote-username=\u0022klesh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, klesh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI wonder how people would\u0027ve felt if the Mission Builder and the History Pack were sold separately?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI build missions every time I play... I don\u0027t need a program to tell me how well (or poorly) I\u0027ve done. I would\u0027ve bought the parts pack and let the mission builder rot. Furthermore, if I just want to be competitive about the objectives, there are flight logs and other evidences to prove/document them. My bias here is why I left the subject out before. I may use the mission builder in the future, but if and only if I find some epic, near-catastrophe situation I feel others will enjoy \u003Cem\u003Eand\u003C/em\u003E find myself willing to give up a few hours to accurately recreate the scenario for others. Otherwise, it\u0027s totally useless to me...\n\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2018-05-25T21:10:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223384617\u0022 data-ipsquote-contentid=\u0022175225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527093175\u0022 data-ipsquote-userid=\u0022110814\u0022 data-ipsquote-username=\u0022klesh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/23/2018 at 12:32 PM, klesh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003EPlease don\u0027t move this to the Making History discussion forum. No one visits there.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223386069\u0022 data-ipsquote-contentid=\u0022175225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527261609\u0022 data-ipsquote-userid=\u0022123837\u0022 data-ipsquote-username=\u0022Dman979\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Dman979 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSince this is about the Making History expansion, I\u0027ve moved it to the Making History discussion.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nlol, oh well.  Ironic that it got more replies after it was moved. \n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2018-05-25T23:05:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223386006\u0022 data-ipsquote-contentid=\u0022175225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527256896\u0022 data-ipsquote-userid=\u0022110814\u0022 data-ipsquote-username=\u0022klesh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, klesh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStrange.  A clean 100 views and only 11 votes.  Either Making History is really unpopular, or no one cares enough about it to bother clicking a score to show their support for it. \n\u003C/p\u003E\n\u003Cp\u003E\nI wonder how people would\u0027ve felt if the Mission Builder and the History Pack were sold separately?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI’m only one data point admittedly but I checked this thread out of curiosity despite not having MH. Might explain why some of those 100 views didn’t translate into votes?\n\u003C/p\u003E\n\u003Cp\u003E\nI think that selling the Mission Builder and History Pack separately would have been a bad move. Most of the MH reviews I read were pretty lukewarm about the History Pack but gave the complete expansion a decent mark in the expectation that the Mission Builder would provide a load of new content once the community got to grips with it.\n\u003C/p\u003E\n\u003Cp\u003E\nSeparate the two out and you end up with a not-very-well received parts and mission pack DLC and a scripting language DLC that might be great if scripting is your thing, but otherwise you’d be left waiting for the community to make some playable content for you.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the popularity of MH? I know we’re not the only KSP community out there but still - if I was running Squad I’d be alarmed at the lack of posts on the Making History subforums. It’s been out for what - over two months now? And there’s less than 400 posts in the Missions subforum?\n\u003C/p\u003E\n\u003Cp\u003E\nOuch.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"OHara","CreatedById":162784,"CreatedDateTime":"2018-05-26T01:17:17Z","Content":"\n\u003Cp\u003E\nPeople would be very wise (as KSP players probably are) to read this and everything else in the Making History Discussion sub-forum before buying the expansion ...\u003Cbr\u003E\nor decide like I did that they can spare US$15 and that supporting KSP under its new owner is a good thing to do.\n\u003C/p\u003E\n\u003Cp\u003E\nMH was disappointing, but I hope Take Two can see from player feedback which parts worked, and support better releases of KSP in the future.  I\u0027m going to the bug-tracker to enter one particular item of feedback now.\n\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2018-06-03T16:30:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223386345\u0022 data-ipsquote-contentid=\u0022175225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527289543\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/25/2018 at 7:05 PM, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs for the popularity of MH? I know we’re not the only KSP community out there but still - if I was running Squad I’d be alarmed at the lack of posts on the Making History subforums. It’s been out for what - over two months now? And there’s less than 400 posts in the Missions subforum?\n\u003C/p\u003E\n\u003Cp\u003E\nOuch.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIndeed.  It\u0027s very telling.   This week\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/175481-mission-of-the-week-%C2%A0late-to-workagain/\u0022 rel=\u0022\u0022\u003EMission of the Week\u003C/a\u003E hasn\u0027t had a post to it\u0027s thread in 2-days-shy of 2 months. \n\u003C/p\u003E\n\u003Cp\u003E\nThe previous \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/175228-mission-of-the-week-the-dunatian/\u0022 rel=\u0022\u0022\u003EMission of the Week\u003C/a\u003E  generated a whole 4 posts (and replies by the Mission\u0027s author) to it\u0027s thread by 2 different users with less than 50 posts to their accounts. Hasn\u0027t been posted to in over a week.\n\u003C/p\u003E\n\u003Cp\u003E\nPretty safe to estimate half of the 385 posts to the missions subforum are by the mission authors themselves replying to bugs found in their missions. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCurseforge, \u003Ca href=\u0022https://www.curseforge.com/kerbal/missions\u0022 rel=\u0022external nofollow\u0022\u003EKSP\u0027s Official Mission repository\u003C/a\u003E has a whopping 5 missions in total.\n\u003C/p\u003E\n\u003Cp\u003E\nReddit had an equally sparse subforum dedicated to missions, but \u003Ca href=\u0022https://www.reddit.com/r/KerbalSpaceProgram/wiki/other_reddits\u0022 rel=\u0022external nofollow\u0022\u003EI can\u0027t even seem to find it now\u003C/a\u003E.  There is \u003Ca href=\u0022https://www.reddit.com/r/KerbalMissions/\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E subreddit, but it has nothing to do with MH missions.\n\u003C/p\u003E\n\u003Cp\u003E\nSay what you like about reddit itself, but it does have a healthy KSP community who seems to have forgotten MH even exists.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2018-06-03T16:46:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223391983\u0022 data-ipsquote-contentid=\u0022175225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528043404\u0022 data-ipsquote-userid=\u0022110814\u0022 data-ipsquote-username=\u0022klesh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, klesh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCurseforge, \u003Ca href=\u0022https://www.curseforge.com/kerbal/missions\u0022 rel=\u0022external nofollow\u0022\u003EKSP\u0027s Official Mission repository\u003C/a\u003E has a whopping 5 missions in total.\u003Cbr\u003E\nReddit had an equally sparse subforum dedicated to missions, but \u003Ca href=\u0022https://www.reddit.com/r/KerbalSpaceProgram/wiki/other_reddits\u0022 rel=\u0022external nofollow\u0022\u003EI can\u0027t even seem to find it now\u003C/a\u003E.  There is \u003Ca href=\u0022https://www.reddit.com/r/KerbalMissions/\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E subreddit, but it has nothing to do with MH missions.\u003Cbr\u003E\nSay what you like about reddit itself, but it does have a healthy KSP community who seems to have forgotten MH even exists.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt didn\u0027t seem to make much of a splash in either the \u003Cem\u003EArs Technica\u003C/em\u003E or \u003Cem\u003ESpacebattles\u003C/em\u003E KSP communities either. There was a handful of comments and one fairly blunt review (attached here for reference) on the \u003Cem\u003EArs\u003C/em\u003E forum thread, then business as usual.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003ETime for a proper review of Making History, now I\u0027ve had time to play with it.\u003C/span\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EMaking History is a content pack which demos KSP 1.4\u0027s Mission Builder. It contains exactly seven missions (not including two tutorials on how to use the Mission Builder).\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EThe first, Dawn of the Space Age, is first a guided missile, then a sounding rocket, then a moderately faithful recreation of the R-7 Semyorka which launched Sputnik 1. Be careful on the last segment of that mission: It\u0027s easy to build a rocket which cannot achieve the objectives (which includes entering equatorial orbit from a very high inclination), and you cannot change the design without restarting the entire mission. You can revert to launchpad, but not to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. The parts made available railroad you to a single solution and are entirely inconsistent with history, rocket design (at one bit, you\u0027re given a 2.5m upper stage engine and nothing to use it on!), the mission\u0027s own progression, or even common sense.\u003C/span\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EThe second is an EVA rendezvous and deorbit. You get bonus points for hitting a target. The third, a trip to Minmus, the fourth is a recreation of the Gemini/Agena target vehicle docking, then a Mun mission, then a Mun landing, then a Minmus miner.\u003Cspan\u003E  \u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EThat\u0027s it. There\u0027s about an afternoon\u0027s worth of content here. If anyone played that mod which implements the Soviet, US and European space race missions into the career-mode sandbox as contracts, they\u0027re going to look at this and be sorely, sorely disappointed. Making History exists outside the normal game modes and there\u0027s no sense of progression at all.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EThe missions are pretty poorly scripted, game mechanics are sticking out like loose wires, and at one bit you\u0027re told to deorbit one vehicle but the actual objective is to deorbit the other! The game handles it, but the objective should never be stated to be one thing, then when actually checking it, turn out to be the other. \u003C/span\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EVessel staging is all over the place, known foul-ups like parachutes being on the same stage as engines by default are glaringly obvious. A prebuilt craft you encounter in orbit has its staging set up to decouple the re-entry module before the re-entry engine (which is jettisoned!) fires! Another is set up to re-enter backwards and, if you do decouple the re-entry module, you\u0027ll find it has no parachutes.\u003C/span\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EThis should never have been released as a paid content pack, not as poorly integrated as it is, not as clumsy as it is, and not as small as it is. \u003C/span\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EIt smells very much like this is all that was completed by the time the new owners got rid of all the original developers and the new team couldn\u0027t add anything, only get what was there up to release standards. One mission, you\u0027ll know which one, appears obviously incomplete, a huge part of it has simply been cut out.\u003C/span\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cbr style=\u0022color:#262626;font-size:13px;\u0022\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#262626;font-size:13px;\u0022\u003EAt this point I\u0027m not sure if the Mission Builder is part of the base KSP 1.4 update, or whether you need Making History DLC for it. If you don\u0027t need Making History for the Mission Builder, then Making History itself has nothing justifying its existence. Skip it.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI expect that some of those issues have been patched out, or arose through lack of familiarity with some of the new game features (the 2.5m engine comment sounds like one of those) but still - first impressions and all that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-03T16:46:52Z\u0022 title=\u002206/03/2018 04:46  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 3, 2018\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2018-06-07T22:44:41Z","Content":"\n\u003Cp\u003E\nI gave it a D. I feel like the engine plates and a few of the Soyuz parts are well done, the engine plates especially as they fill a role that wasn\u0027t really accomplished with mods (I think there were one or two that made some kind of interstage fairing) and make engine clusters and mismatched engine sizes in the middle of a stack work much better than before.\n\u003C/p\u003E\n\u003Cp\u003E\nBut overall the parts are mediocre at best. Squad seem to have continued their strategy of passing off parts to interns or people working on them on the side (is it too much to ask for a consistent color palette within parts of the same family, or something like stripes that match up...). I\u0027ll take others\u0027 word for it that the engines are unbalanced (the Saturn V replica engines seem like a particularly disappointing oversight), but there are many other issues that shouldn\u0027t have made it to release or seem like poor design decisions: drag issues with the variants (it\u0027s a shame they went for the most bare-bones version of variants), geometry errors on a fuel tank, fairing problems, service bays that are too small for any real use, the absurd \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E on the Mun lander, so many attachment nodes that the little structural panels are almost impossible to use (maybe use variants to cycle through different attachment nodes), and so on. And did anyone compare the preview versions of the parts with their final counterparts? I remember some UV unwrapping issues that were pointed out for the Mun lander that I immediately noticed in the final version. So I wonder how much of a \u0022work-in-progress\u0022 those version really were.\n\u003C/p\u003E\n\u003Cp\u003E\nThe mission builder is the real problem though. It makes no sense to me. Why would people go to the trouble or learning how to use the rather finicky and complex builder, only to shut out all console users and anyone who doesn\u0027t have the DLC from being able to play them. When you can just come up with a mission/challenge, write your own rules and restrictions, and post that on the forums it seems a little redundant. I understand that an in-game, formalized challenge system \u003Cem\u003Ecould\u003C/em\u003E be interesting, but this implementation, and as part of a DLC that instantly divides the player-base makes little sense to me. And given the dearth of community missions, and the complete lack of interest in the Squad missions (each one gets one or two replies compared to the old challenges that would get several pages), it seems like others think so, too.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s mostly just disappointing. This is the only time that I\u0027m aware of where Squad has dedicated a very long time and a lot of development resources to a single, gameplay-based aspect of KSP (compared to something like upgrading Unity, replacing the UI, or just improving the code and performance of the game as in 1.2). The other gamey parts - science/tech tree, contracts, strategies, Kerbal professions - all seem like they work whipped up in a month or two with little concern for how well they actually fit in or work. For contracts they spent several versions progressively making them a little better (test launch clamps on the Mun \u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E), but they are still fundamentally the same. And the Kerbal professions and science system have been haphazardly added to and changed over several versions, but I wouldn\u0027t call any of it much of an improvement, they are just a little different than they were at first. Strategies... \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo it\u0027s a shame that the mission builder is so boring.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is, is that I can\u0027t think of anything that would make for a worthwhile DLC. The presence of mods basically makes the obvious idea of selling more parts almost entirely pointless, and given the quality and attention paid to these parts, I would say insulting. Multiplayer never made sense to me for KSP, it just seems fundamentally not designed for it. I can\u0027t see anything really interesting that could be tacked onto the game as DLC.\n\u003C/p\u003E\n"},{"CreatedByName":"spenjk15","CreatedById":189612,"CreatedDateTime":"2018-06-10T03:05:38Z","Content":"\n\u003Cp\u003E\nI give it an A\u002B because, I mean, it adds the mission builder, which is amazing. Also the new diameter part is nice too, and the 3 kerbal command pod revamp was needed for that part. I\u0027m not that good at the game, so I do not really know if the parts are unbalanced or buggy.\n\u003C/p\u003E\n"},{"CreatedByName":"invision","CreatedById":178900,"CreatedDateTime":"2018-06-11T18:06:26Z","Content":"\n\u003Cp\u003E\nC\n\u003C/p\u003E\n\u003Cp\u003E\nits good for stocks players needing some new parts but thats about it.\n\u003C/p\u003E\n\u003Cp\u003E\nmission builder is meh and didnt work as i expected it too.\n\u003C/p\u003E\n\u003Cp\u003E\nits done nothing mods havent done already .\n\u003C/p\u003E\n"},{"CreatedByName":"Kevin Kyle","CreatedById":110492,"CreatedDateTime":"2018-06-11T18:50:40Z","Content":"\n\u003Cp\u003E\nI havent had time to play with this yet. But Ive seen some interesting missions and such I hope to do at some future point. Im just too busy racing for the most part which is my first love for about 20 years now. Also, I play a lot of other things as well. Oh and JWE is out tomorrow so ..........\n\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2018-06-12T19:34:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223396543\u0022 data-ipsquote-contentid=\u0022175225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528599938\u0022 data-ipsquote-userid=\u0022189612\u0022 data-ipsquote-username=\u0022spenjk15\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/9/2018 at 11:05 PM, spenjk15 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI give it an A\u002B because, I mean, it adds the mission builder, which is amazing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAn interesting take, what do you find amazing about it?\n\u003C/p\u003E\n"},{"CreatedByName":"DECQ","CreatedById":113001,"CreatedDateTime":"2018-07-02T19:30:34Z","Content":"\n\u003Cp\u003E\nHow can you fool people so? Nothing worse can not be imagined. SQUAD raped the fans of the game.\n\u003C/p\u003E\n"},{"CreatedByName":"The Cuttlefish Empire","CreatedById":177957,"CreatedDateTime":"2018-07-03T17:10:03Z","Content":"\n\u003Cp\u003E\nsolid f...\n\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2018-07-03T18:57:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223395140\u0022 data-ipsquote-contentid=\u0022175225\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221528411481\u0022 data-ipsquote-userid=\u002257416\u0022 data-ipsquote-username=\u0022DMagic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/7/2018 at 4:44 PM, DMagic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI remember\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003E some UV unwrapping issues that were pointed out for the Mun lander that I immediately noticed in the final version. So I wonder how much of a \u0022work-in-\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003Eprogress\u0022 those version really were.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cem\u003E*waves from the beach of \u0022I tried to warn y\u0027all\u0022 island*\u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-03T18:58:05Z\u0022 title=\u002207/03/2018 06:58  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 3, 2018\u003C/time\u003E by passinglurker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Araym","CreatedById":46343,"CreatedDateTime":"2018-07-03T21:48:07Z","Content":"\n\u003Cp\u003E\nI gave it a simple D.\u003Cbr\u003E\u003Cbr\u003E\nIt\u0027s not a worse \u0022F\u0022 just because I wanna be positive about the future of KSP in the whole, but, from the stand point of an old customer that entered the Kerbal world when it was at 0.13/0.14 stage, both 1.4.-something and its DLC about Making History are the first time I does not really feel the need of an upgrade, playing and keeping 1.3.1 as my \u0022main version\u0022\u003Cbr\u003E\nA lot is already said about \u0022not so much refined additional parts\u0022, but THE BIG DISAPPOINTMENT for me was the \u0022Mission Builder\u0022 itself:\u003Cbr\u003E\nI was hoping for an IN GAME (and I mean in a career, science or sandbox mode game) iteration, where I could \u0022program\u0022 my series of missions (instead to use the randomly-generated one of a career mode), to try to fulfill a whole \u0022space program\u0022, but basically we had just a \u0022scenario builder\u0022 disconnected to any \u0022long lasting\u0022 (but old and already present) game mode.\u003Cbr\u003E\u003Cbr\u003E\nIt\u0027s not a worse \u0022F\u0022, just because I give \u0022F\u0022 to the \u00221.4.-something\u0022 update of KSP, and it\u0027s not a fault of \u0022making History\u0022: unrefined, full of bugs, already arrived to it\u0027s FIFTH patch (1.4.0... 1.4.1... 1.4.2... 1.4.3... 1.4.4...) but still not finalized, giving an headache to any modded player and to any modder that tries to keep an expanded gameplay based on mods that are still not able to find a final, stable version in which update their mods.\u003Cbr\u003E\u003Cbr\u003E\nIt\u0027s not a worse \u0022F\u0022, just because i give a \u0022Z\u0022 to whoever is now running the development of KSP, not the game itself: rushed releases, parts and features designers clearly \u0022new\u0022 to the Kerbal Space Program game, at such point that a tons of modders working for PURE FREE could teach to them a thing of two about \u0022design, balancing and implementations\u0022 of ideas and parts into the core game.\u003Cbr\u003E\nFREE CONTENTS shared by the comunity (modders) have better realization than those that should be OFFICIAL PARTS released by Take Two (... yes... there is no more \u0022Squad\u0022, even if it figures still on the label).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sad to expose those bad voting, but I feel orphan, in KSP 1.4.-something:\u003Cbr\u003E\nthe game\u0027s dad sold his idea, the big company that bought it has not a really clue about it, and the actual developers (as said before by others than me)  seem just interns of a big company working at KSP as a side project in the free time from bigger projects that had to learn about it from scratches and that have less knowledge about KSP than modders.\u003Cbr\u003E\u003Cbr\u003E\nThe \u0022latest release\u0022 still working as KSP, up to now, is till 1.3.1 for me.\u003Cbr\u003E\nProbably for the moment the last one that has still a legacy of development to the \u0022original designers\u0022 of KSP.\u003Cbr\u003E\n1.4.-something (it\u0027s on the horizon already a probable 1.4.5 or a 1.5.0 version that makes 1.4.4 someway already obsolete) has the feel of a beta-release to test something that take Two does not still really know what should be, and thankfully not having bought it from Steam (to avoid an auto-update, or the need to extract it in a safe space) totally a version that I\u0027ll skip waiting \u0022future, fixed, releases\u0022.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-03T22:22:05Z\u0022 title=\u002207/03/2018 10:22  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 3, 2018\u003C/time\u003E by Araym\u003C/strong\u003E\n\u003Cbr\u003ETypos, misspelling and grammar\n\u003C/span\u003E\n"},{"CreatedByName":"DunnoAnyThing","CreatedById":180004,"CreatedDateTime":"2018-07-09T11:27:26Z","Content":"\n\u003Cp\u003E\nNot sure if it\u0027s getting better.(Well, last DevNote seems to say that the next update will fix some problems in the MH DLC(I thought some of them were designed to be like that!)\u003Cbr\u003E\nBut still, it seems to have potential-that\u0027s why I paid for it.\u003Cbr\u003E\nThough I\u0027d like to see what it turns into as time passes...\u003Cbr\u003E\nWell, currently seems to be \u0027released before being complete\u0027, but nothing can be surely complete and robust(IMO).\u003Cbr\u003E\nBTW mission builder seems to be used quite frequently in a way that is not so intended-starting from a different specific location.\n\u003C/p\u003E\n"}]}