{"TopicId":10340,"ForumId":18,"TopicTitle":"Hatred of facebook","CreatedByName":"Mojavi-Viper","CreatedById":21827,"CreatedDateTime":"2012-05-08T23:44:03Z","PageNum":1,"Articles":[{"CreatedByName":"Mojavi-Viper","CreatedById":21827,"CreatedDateTime":"2012-05-08T23:44:03Z","Content":"The clock is ticking closer to midnight for me to delete my facebook account for the simple reason I am tired of having facebook tell me what I want to read and not display everything in chronological order. Anyone else getting tired of facebook or is it just me?"},{"CreatedByName":"Caesar15","CreatedById":11257,"CreatedDateTime":"2012-05-09T00:02:31Z","Content":"I had a facebook, took all my time away, so really, i dont like facebook, if you want to tak to some you dont see, text or call them."},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-05-09T00:21:35Z","Content":"Don\\\u0027t delete it, very useful for college. Just ignore it or check your messages, no need to actually sink time into it."},{"CreatedByName":"Mojavi-Viper","CreatedById":21827,"CreatedDateTime":"2012-05-09T00:27:01Z","Content":"That is exactly the problem, all I should dedicate is like 5 mins just to read what my friends post, but no I have missed more news items than I care to mention just because fb thinks it knows what I want to read, instead I have to click on my friends accounts just to see what has been said and that 5 mins turns into an hour... I am just really P\\\u0027d off about it and I\\\u0027m about tired of fighting it. I don\\\u0027t play games or spend stupid time on it, I use it for news and short reading of my friends and other ppl I choose to follow."},{"CreatedByName":"Sordid","CreatedById":535,"CreatedDateTime":"2012-05-09T00:29:22Z","Content":"\u003E \n\u003E Don\\\u0027t delete it, very useful for college. Just ignore it or check your messages, no need to actually sink time into it.\n\nYeah, I can confirm that. I\\\u0027m finishing college right now and I feel really isolated, because everyone communicates via Facebook and I don\\\u0027t have it."},{"CreatedByName":"Amram","CreatedById":8067,"CreatedDateTime":"2012-05-09T00:48:36Z","Content":"\u003E \n\u003E and that 5 mins turns into an hour... I am just really P\\\u0027d off about it and I\\\u0027m about tired of fighting it.\n\nI would be very surprised if that ever gets better. Facebook is a company that survives as a data mining tool, except instead of searching, it gets its info to come to it and enter itself. It provides marketing data about demographics among other things, and it generates revenue of ad streams while its at it.\n\nThe more time they can convince you to spend on FB, the more ads they can feed you, and the more data they hope to squeeze from you. I suspect this isn\\\u0027t going to get better, it isn\\\u0027t going to get worse before it gets better, it just isn\\\u0027t going to get better."},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-05-09T00:54:42Z","Content":"And that\\\u0027s why free products are shit. They don\\\u0027t care about the user\\\u0027s enjoyability, they can and will make it more frustrating than necessary to eke out more profit. It\\\u0027s why a lot of older free to play games make game breaking premium weaponry or bonuses."},{"CreatedByName":"Mojavi-Viper","CreatedById":21827,"CreatedDateTime":"2012-05-09T01:19:29Z","Content":"@amram I understand all of that because I do read the terms of agreement. All of that does not bother me as much as it should be a functioning website, which I feel it is not."},{"CreatedByName":"bandit4910","CreatedById":14446,"CreatedDateTime":"2012-05-09T01:26:19Z","Content":"I used to play farmville.\n\nNEVER PLAY IT! People send off worms from Farmville.\n\nNot a second after I started playing it AVAST! detected multiple malaware sources from firefox.\n\nThe only tab/window I had opened was that so, yeah...\n\nDon\\\u0027t play Farmville.\n\nI quit FB all together I find twitter and G\u002B better."},{"CreatedByName":"Amram","CreatedById":8067,"CreatedDateTime":"2012-05-09T02:22:41Z","Content":"\u003E \n\u003E @amram I understand all of that because I do read the terms of agreement. All of that does not bother me as much as it should be a functioning website, which I feel it is not.\n\nits a perfectly functioning website supporting the income of a now massive company. Facebook stopped being about you, me, or anyone else and focused purely on forcing you to waste every conceivable second possible and load/refresh as many pages as possible quite a long time ago.\n\nIt works great, does exactly what its supposed to, but it isn\\\u0027t streamlined to get you in and out in a hurry, because thats counter productive for them. its streamlined to make you generate more revenue for them.\n\nMy point is, they won\\\u0027t ever change that. They don\\\u0027t see it as a service to you anymore so long as the majority still seem tied to it, which they are..... now its purely about getting you to work for them. The more hoops you can be made to jump through, the more meny that can gather up either directly or indirectly, and thats what the page does.\n\nYour entertainment, pleasure, frustration, or anger mean nothing to them, so long as they have your time, and they will always want more."},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-05-09T03:16:39Z","Content":"Some of my classes have FB group pages where they hand out answers...so very useful.\n\nPlus I like making random people laugh with random stories of mine. Other than that, I\\\u0027m not very addicted aside from wishing/checking someone will mention me or post on my wall\n\n/foreveralone\n\nI don\\\u0027t really get into FB stalker mode"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2012-05-09T03:20:19Z","Content":"\u003E \n\u003E Some of my classes have FB group pages where they hand out answers...so very useful.\n\nSo basically you\\\u0027re getting through your classes without actually having to do anything? That\\\u0027s appalling.\n\nFacebook is a cancer on our society. For all its benefits, the fact that it\\\u0027s practically become its own culture of mental dysfunction, pointless banter and arguments... it\\\u0027s sickening, and it needs to be destroyed."},{"CreatedByName":"Caesar15","CreatedById":11257,"CreatedDateTime":"2012-05-09T03:25:19Z","Content":"\u003E \n\u003E So basically you\\\u0027re getting through your classes without actually having to do anything? That\\\u0027s appalling.\n\u003E \n\u003E Facebook is a cancer on our society. For all its benefits, the fact that it\\\u0027s practically become its own culture of mental dysfunction, pointless banter and arguments... it\\\u0027s sickening, and it needs to be destroyed.\n\nFor once i agree with nova."},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2012-05-09T03:36:21Z","Content":"The way I see it, people get out of it what they want out of it. I use facebook to talk to people that I wouldn\\\u0027t otherwise be able to contact, to get help with school (not to share answers; I make a point of that), and to plan events that would be a logistical nightmare through traditional means. I realize that I am more likely the exception, rather than the rule, but as it stands, the Great Mirror that is the Fezbuk is little more than that: a mirror."},{"CreatedByName":"Alfastar","CreatedById":1657,"CreatedDateTime":"2012-05-09T06:15:54Z","Content":"Simple solution: Don\\\u0027t use facebook and use other social media(s)."},{"CreatedByName":"Altair1371","CreatedById":6754,"CreatedDateTime":"2012-05-09T15:03:38Z","Content":"\u003E \n\u003E For once i agree with nova.\n\nOh, Nova has a lot of wisdom. All you have to do is respect his choice of show, and you can see it all. ;D"},{"CreatedByName":"boyercam","CreatedById":21178,"CreatedDateTime":"2012-05-09T15:56:32Z","Content":"\u003E \n\u003E Some of my classes have FB group pages where they hand out answers...so very useful.\n\nWhat?! that is silly, stupid, annoying, wrong and why the heck would anyone do such a thing? ![:o](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png)"},{"CreatedByName":"Sordid","CreatedById":535,"CreatedDateTime":"2012-05-09T16:02:14Z","Content":"\u003E \n\u003E What?! that is silly, stupid, annoying, wrong and why the heck would anyone do such a thing? ![:o](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png)\n\nAltruism?"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2012-05-09T16:18:02Z","Content":"\u003E \n\u003E Facebook is a cancer on our society. For all its benefits, the fact that it\\\u0027s practically become its own culture of mental dysfunction, pointless banter and arguments... it\\\u0027s sickening, and it needs to be destroyed.\n\nI think thats down to human nature tbh..\n\nI\\\u0027ve thought about zapping my facebook, but then again if I go to uni then it might come in handy.."},{"CreatedByName":"Mojavi-Viper","CreatedById":21827,"CreatedDateTime":"2012-05-09T16:44:33Z","Content":"I am currently going to college and I mainly use facebook to see what my other friends are doing (I was in the military and a bunch of my friends from there are from very different places) and I don\\\u0027t even use it for college. I follow my school on fb but they post stupid crap that nobody cares about such as trivia. I understand why other people use it for college but I just follow the schedules that my teacher gives me which outlines quizzes, tests, exc... The thing that set me off was my sister had a minor operation (I don\\\u0027t have the closest family) and I did not know about it until a month and a half later when facebook decided that it should show up in my feed. Like I said I expect something like this to simply work like it should, not give me the bs run around for their own personal gain. Also I check fb mainly on my smart phone because it is more convenient and half the time the mobile site will not work correctly, and I gave up on the app because it will not load correctly either. I know I am on a temporary rant but I am about to stop putting myself out there expecting something that will never come..."},{"CreatedByName":"boyercam","CreatedById":21178,"CreatedDateTime":"2012-05-09T18:22:55Z","Content":"\u003E \n\u003E Altruism?\n\nThat is the one word I needed."},{"CreatedByName":"Kreuzung","CreatedById":21035,"CreatedDateTime":"2012-05-09T18:47:05Z","Content":"I never even thought about signing up there. There is only oner other student in my class without it.\n\nDon\\\u0027t even know what it is useful for, I don\\\u0027t miss anything important..."},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-05-09T19:02:29Z","Content":"For those of you that don\\\u0027t like the way Facebook looks or organizes information, look into SocialFixer. It allows you to customize your FB page in almost every way. It lets you do all kinds of nifty things.\n\nThere\\\u0027s one thing I refuse to do and everyone else should that uses it, DON\\\u0027T USE APPS! Those things are security and privacy nightmares. I have them fully disabled and don\\\u0027t have any problems.\n\nCheers!\n\nCapt\\\u0027n Skunky\n\nKSP Community Manager"},{"CreatedByName":"Rascal Nag","CreatedById":9451,"CreatedDateTime":"2012-05-09T21:37:48Z","Content":"Never opened up a facebook account, save for a junk one to get a beta key for Tribes: Ascend, which I subsequently deleted. I don\\\u0027t see the appeal. I may be a bit biased though, I am admittedly pretty introverted. If I used it, it would likely end up in a situation not unlike my cellphone\\\u0027s, which has probably been out of charge for much longer than it has been in use."},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-05-09T21:41:19Z","Content":"Main reason I have one is I need to use it for social media promotion on a few sites I run. I also found it useful for reconnecting with some old friends I had grown up with and lost contact with. It has it\\\u0027s uses, you just need to use it in moderation and not get carried away, especially with apps and games. Those things are evil incarnate.\n\nCheers!\n\nCapt\\\u0027n Skunky\n\nKSP Community Manager"}]}