{"TopicId":104319,"ForumId":18,"TopicTitle":"Squad\u0027s next project","CreatedByName":"K3RBAL KOL4","CreatedById":140935,"CreatedDateTime":"2015-04-17T16:04:19Z","PageNum":1,"Articles":[{"CreatedByName":"K3RBAL KOL4","CreatedById":140935,"CreatedDateTime":"2015-04-17T16:04:19Z","Content":"With KSP 1.0 on the horizon does Squad have any other projects aside from occasional patches/fixes to 1.0?\n\nI was watching a documentary on Netflix, one where James Cameron takes a 1-man sub to the bottom of of the supposed lowest trench in the ocean. They go from concept to design and construction of the sub and I thought this should be Squad\u0027s next project: Kerbal Marine Program (or some variant, Kerbal Sub Program, Kerbal Oceanic Program). Designing and launching ships/subs to various depths at various locations looking for various science/data.\n\nAs KSP has a secondary Space Plane program, this project would have a surface craft program where you design seaworthy ships that act as both command vessels and launch platforms for the underwater (primary) vessels.\n\nToo much to ask?"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-17T16:11:03Z","Content":"This thread isn\u0027t really about KSP, moving to the Space Lounge."},{"CreatedByName":"Jart","CreatedById":101732,"CreatedDateTime":"2015-04-17T16:11:24Z","Content":"Nope, in fact it would be perfect to integrate with submersible probes to explore underwater/liquid biomes."},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2015-04-17T16:28:03Z","Content":"A lot of work... maybe a modder might take it up.\n\nSquad\u0027s next project: KSP 2 - Bigger, better, explodier"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-04-17T18:38:49Z","Content":"We\u0027ve already decided on Kerbal Plumbing Program. Flush your Kerbals down toilets and build a network of pipes to carry them to the stars!\n\nTotally legit."},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2015-04-17T18:55:26Z","Content":"They\u0027ll probably stay focused on KSP for quite a while, considering there\u0027s still multiplayer coming out in the future, and hopefully more planets and stuff like that. I wouldn\u0027t mind paying for some DLC, if it\u0027s really good.\n\nAs for submarines, hey, that could actually work as a DLC. Not really as a full game, I think, considering how small subject it is compared to space."},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2015-04-18T00:58:26Z","Content":"What I heard during the last Kerbal Kon (if memory serves, it was then that I heard this) is that after KSP gets to a stable, complete release they\u0027ll switch over and work on another project, then come back to KSP with some expansions and whatnot. **This was only speculation on the part of SQUAD itself though, and was fortunately never really set in stone.**\n\nI think that if they move much of the team to something else right after KSP is done it could cause a fair bit of harm to the game, so hopefully they\u0027ll have some dedicated people working on expansion content while some of the other guys go and work on something new."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-04-18T01:08:17Z","Content":"I think Squad\u0027s next project is the next KSP update."},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-04-18T01:48:44Z","Content":"I think they should make another space-exploration game set in the Kerbal universe, except on an interstellar scale. Being a separate game, Squad would have no limits on taking a few steps into the theoretical neighborhood. Honestly, Kerbals a century or two later with all sorts of futuristic tech would be mind-blowing to me."},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-04-18T06:46:16Z","Content":"\u003E \n\u003E As for submarines, hey, that could actually work as a DLC. Not really as a full game, I think, considering how small subject it is compared to space.\n\nbut you can use spaceplane parts in the VAB, and rocket parts in the SPH. so you can send the submarines to space."},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2015-04-18T09:38:38Z","Content":"I think they should do an automated text editor that fills in all the annoying blank bits between words with K\u0027s... \n\nKerbalKSpaceKProgram:)"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-04-18T13:55:15Z","Content":"\u003E \n\u003E I think they should do an automated text editor that fills in all the annoying blank bits between words with K\u0027s...\n\nDidn\u0027t you read the intro tip? They make every word start with K, kot kvery kpace ketween kords! ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"jlo96","CreatedById":62307,"CreatedDateTime":"2015-04-18T15:18:51Z","Content":"SQUADs next project will probably be something to do with marketing\n\nSince they\u0027re a media/pr company\n\nAs for their game dev side, there\u0027s been a lot of speculation as to money, and other projects, and if they would let Harv do another one, but really it comes down to this: Will the current dev team propose something? It literally all depends on whether these guys want to do another thing. And maybe they don\u0027t. Maybe this was HarV\u0027s one big dream and once it\u0027s done in 50 years he\u0027ll step down and never design again. SQUAD will crumble into dust and slowly KSP will fade away from relevance on the augmented reality platform is was eventually ported to. Our grandchildren will scoff at our equivalent of 16-bit as we forever stack fuel on engine, engine on separator, trying to finally build a rocket that can get to the Gilly and back in one piece, darnit. They will laugh as we spiral into madness. MADNESS! HOW CAN WE GET THIS MUCH DELTA V?! WHERE IS THE LAGRANGE POINT?! WHY CAN THE KRAKEN SEE MY SOUL?! WHY?!!\n\nBut probably not."},{"CreatedByName":"SemiaCloud","CreatedById":138816,"CreatedDateTime":"2015-04-20T21:09:08Z","Content":"\u003E \n\u003E SQUADs next project will probably be something to do with marketing\n\u003E Since they\u0027re a media/pr company\n\u003E \n\u003E As for their game dev side, there\u0027s been a lot of speculation as to money, and other projects, and if they would let Harv do another one, but really it comes down to this: Will the current dev team propose something? It literally all depends on whether these guys want to do another thing. And maybe they don\u0027t. Maybe this was HarV\u0027s one big dream and once it\u0027s done in 50 years he\u0027ll step down and never design again. SQUAD will crumble into dust and slowly KSP will fade away from relevance on the augmented reality platform is was eventually ported to. Our grandchildren will scoff at our equivalent of 16-bit as we forever stack fuel on engine, engine on separator, trying to finally build a rocket that can get to the Gilly and back in one piece, darnit. They will laugh as we spiral into madness. MADNESS! HOW CAN WE GET THIS MUCH DELTA V?! WHERE IS THE LAGRANGE POINT?! WHY CAN THE KRAKEN SEE MY SOUL?! WHY?!!\n\u003E \n\u003E But probably not.\n\nWow. a little dramatic there..."},{"CreatedByName":"PlonioFludrasco","CreatedById":98915,"CreatedDateTime":"2015-04-20T21:18:44Z","Content":"2010: Kerbal Two\n\nWith moar suns and monoliths.\n\n**Edited \u003Ctime datetime=\u00222015-04-20T21:20:55Z\u0022 title=\u002204/20/2015 09:20  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 20, 2015\u003C/time\u003E by PlonioFludrasco**"},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-04-20T23:48:06Z","Content":"Kerbal kase krogram probably isn\u0027t the best thing to do with replacing letters"}]}