{"TopicId":110798,"ForumId":18,"TopicTitle":"Seveneves","CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2015-05-25T18:04:54Z","PageNum":1,"Articles":[{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2015-05-25T18:04:54Z","Content":"So, Neal Stephenson\u0027s new novel, published last Tuesday. I\u0027m only about 150 pages in, but I can\u0027t imagine any KSP enthusiast not being thrilled by it. It scratches the same near-future, hard-scifi, space-geek itch that The Martian or Gravity did. I\u0027ll post more once I\u0027ve finished, but so far it\u0027s highly, highly enjoyable (and paced like *Reamde* -- that is to say, I start reading and look up an hour or so later to discover 100 pages have flown by.)"},{"CreatedByName":"Dr.Klunz","CreatedById":144967,"CreatedDateTime":"2015-05-26T11:08:02Z","Content":"I have read about half of the book in 4 days. It is rather clinical at time but oh boy i love it. I try to restrict my reading time otherwise i will finish it in no time. \n\nI wonder if anyone could build it in ksp. ( it should be possible given the detailed description he gives) (hard to explain without giving away any spoilers). \n\nIf anyone build something out of this book please post \\*.craft files!"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2015-05-26T15:35:06Z","Content":"\u003E \n\u003E I have read about half of the book in 4 days. It is rather clinical at time but oh boy i love it. I try to restrict my reading time otherwise i will finish it in no time.\n\nYeah, I read 300 pages yesterday and had to force myself to stop reading so I could sleep. (There\u0027s a giant cup of coffee sitting next to me right now.) It\u0027s interesting how the publisher\u0027s description of the book emphasizes the long-term aftermath, when more than half of the book (at least) is about the preparation. \n\n\u003E \n\u003E I wonder if anyone could build it in ksp. ( it should be possible given the detailed description he gives) (hard to explain without giving away any spoilers). \n\u003E If anyone build something out of this book please post \\*.craft files!\n\nI think you could do it pretty well with some of the [thread=81754]old spacecraft packs[/thread].\n\nAnyone who\u0027s thinking about checking the book out should consider reading [the excerpt](http://www.nealstephenson.com/news/2015/04/13/seveneves-excerpt/) published on Stephenson\u0027s website. It\u0027s the first 26 pages, so no spoilers that you wouldn\u0027t get just by reading. The only drawback is that after reading that, it\u0027s unlikely that you\u0027ll be able to resist going out and buying the full novel.\n\nJust to whet your appetite, it\u0027s got tons of action in LEO with diamond hard (sci-fi hardness scale, diamond=extremely realistic) orbital dynamics. Many existing spacecraft are seen/used. The near-future technologies used are extremely believable, as they\u0027re tech that\u0027s currently in prototype/advanced design phase. It\u0027s like spaceflight candy. We rarely get sci-fi like this, so give it some love."},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2015-05-26T16:49:52Z","Content":"Ok I hate you now, it\u0027s 3 am and I just saw your post and am reading it online now."},{"CreatedByName":"air805ronin","CreatedById":40948,"CreatedDateTime":"2015-05-26T16:51:35Z","Content":"Kindle says 47% of the way through as of last night, and I have to say this first bit has been really excellent.\n\nI\u0027ve talked to a lot of people who have said roughly the same thing. The first 2/3 of the book is the exact kind of awesome hard sci-fi book that I\u0027m loving right now. The last 1/3 is a thought experiment set 5000 years in the future that actually detracts from the awesomeness of the book and almost would have been better as a sequel.\n\nI would have read 1000 pages of just this near future story. I want to capture an asteroid and build a huge complex in orbit.\n\nedit: Oh and check out the illustrations on the inside of the endpapers if you pickup the hard cover. They\u0027re gorgeous.\n\n**Edited \u003Ctime datetime=\u00222015-05-26T16:56:42Z\u0022 title=\u002205/26/2015 04:56  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by air805ronin**"},{"CreatedByName":"TythosEternal","CreatedById":117821,"CreatedDateTime":"2015-05-31T02:53:41Z","Content":"I bought this book right before a cross-country plane trip, and finished it before my flight back landed the next day. I just couldn\u0027t stop reading.\n\nThere are a few minor items I could be picky about, but only if I felt like being a whiny nitpicker. I\u0027m a huge Stephenson fan in the first place, so between that and my passion for the topic, I\u0027m more that a little biased. Still well-worth reading if you want a great, new modern sci-fi in the best traditions of the genre, balancing very detailed science and far-reaching meta-physics in the way only Stephenson can.\n\nUnlike many other Stephenson novels, though, this one reaches a great climax. I am surprised that he didn\u0027t split this into several novels that could extend and/or transition the under-developed far-future segment. Still a great read, and worth your time--if you\u0027re reading this on the forum, it\u0027s virtually guaranteed to be of interest to you.\n\nEdit: He referenced \u0022TURING\u0022 magazine again, which was formerly a Waterhouse-universe reference to \u0022Wired.\u0022 This seems to split from the near-future posited in Paranoid Chip, but it did make me wonder if there were any other tieovers I missed.\n\n**Edited \u003Ctime datetime=\u00222015-05-31T02:56:55Z\u0022 title=\u002205/31/2015 02:56  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 31, 2015\u003C/time\u003E by TythosEternal**"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2015-06-01T14:55:48Z","Content":"Sould we get a spoiler thread going, if anyone is interested I would like to discuss some aspects of the book but without having to worry about spoiling it for anyone."},{"CreatedByName":"ABZB","CreatedById":98947,"CreatedDateTime":"2015-06-01T23:35:45Z","Content":"\u003E \n\u003E Sould we get a spoiler thread going, if anyone is interested I would like to discuss some aspects of the book but without having to worry about spoiling it for anyone.\n\nprobably."},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2015-06-08T14:52:44Z","Content":"There was a funny easter egg:\n\nWhen Dinah opened the first soyuz, she got hit in the face with a bundle of lead pencils. This is a reference to the idiotic hoax that NASA spent billions on making a ballpoint pen work in space (you can get a actual fisher spacepen for 15 dollars.), while the soviets used normal pencils. (Which are flammable, produce many dangerous fragments and dust which can hurt astronauts or break equipment.)"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2015-06-08T17:03:45Z","Content":"I\u0027ve read and enjoyed most of Stephenson\u0027s works, Snow Crash being a particular favorite, and Cryptonomicon get\u0027s special mention for being the only work of fiction I\u0027ve ever seen a Perl script in. (\\*edit\\* and then there\u0027s The Diamond Age, how on earth could I forget that?)\n\nI saw the book in a store a few weeks ago, so even the slightest suggestion I\u0027ll enjoy it is enough for me, I\u0027ll be picking it up soon.\n\n**Edited \u003Ctime datetime=\u00222015-06-08T17:10:48Z\u0022 title=\u002206/08/2015 05:10  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by pxi**"},{"CreatedByName":"heng","CreatedById":126869,"CreatedDateTime":"2015-06-09T12:10:50Z","Content":"recommended viewing for everyone reading the book:\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/UC_gXD5OE88?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n:-D\n\nPS:\n\n[Author interviewed about the book (45min, mp3)](https://boingboing.net/2015/06/29/neal-stephenson-on-the-story-b.html)\n\n**Edited \u003Ctime datetime=\u00222015-06-30T14:11:33Z\u0022 title=\u002206/30/2015 02:11  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 30, 2015\u003C/time\u003E by heng**"},{"CreatedByName":"GliderPilot","CreatedById":163333,"CreatedDateTime":"2016-05-01T19:02:58Z","Content":"One thing that seemed immediately obvious (and was already addressed the first time I looked at Neal Stephenson\u0027s website) is that the torus at the aft end of Izzy is in the wrong place.  It\u0027s a big gyroscope, and since Izzy (like many other spacecraft) executes a 360-deg forward flip once per revolution (to stay properly oriented w/r/t Earth), gyroscopic precession would make it simultaneously execute a 360-deg. rotation in yaw.  Thus, halfway through each revolution, it would be flying ack-basswards.  Eliminating this precession would require constant thruster operation and would impose huge structural loads. Building the second torus (T2 in the novel) and spinning it the other way would help solve the problem--but Izzy and the first torus wouldn\u0027t have lasted long enough for that to happen.\n\nQuick and dirty solution: either build two counter-rotating tori right from the start (although the loads on their hubs and spokes would still be significant), or build a counterrotating mass (can be a lot smaller if it\u0027s denser and spins faster) on the same axle.\n\nBetter idea?: put the axle of the torus (or tori) on Izzy\u0027s port/starboard axis so that it/they rotate along the direction of orbital travel--like bicycle wheels.  Of course, in any situation in which you have to slew the spacecraft such that the gyro axis is displaced, you\u0027ll have to deal with precession.\n\nThat\u0027s why instruments like Hubble or Kepler have \u0022reaction wheels\u0022 to control their attitude in the first place!"}]}