{"TopicId":114325,"ForumId":18,"TopicTitle":"Disaster!","CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-27T05:39:49Z","PageNum":1,"Articles":[{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-27T05:39:49Z","Content":"Hard drive failure. Loud, rapid clicking followed by a pop. Total loss. No backup. All original blender models lost. Three instances of KSP 0.90 lost, along with my personal repo of 0.90 mod zips. The world has gotten darker tonight.\n\nNot to mention the actual important information lost. Should\u0027ve backed it up. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-06-27T05:42:05Z","Content":"wait for the morning ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) when thing are dark it work most the time to grab some light ... notice it could be longer near the pole north or south ; )"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-06-27T06:00:43Z","Content":"\u003E \n\u003E Hard drive failure. Loud, rapid clicking followed by a pop. Total loss. No backup. All original blender models lost. Three instances of KSP 0.90 lost, along with my personal repo of 0.90 mod zips. The world has gotten darker tonight.\n\u003E Not to mention the actual important information lost. Should\u0027ve backed it up. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\nYou only realize the importance of what you have when you lose it. Backups are so very easy to forget or neglect, yet sooner or later we all mourn the pictures and works lost."},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-06-27T06:07:20Z","Content":"boot sector fail are annoyin\u0027 when they occur true true. especially for photo and that kind of numeric and personal kind of record things nowdays ; ) it\u0027s like losing you own memory for later on in some kind a fire in the old paper days. true true\n\n**Edited \u003Ctime datetime=\u00222015-06-27T06:11:26Z\u0022 title=\u002206/27/2015 06:11  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 27, 2015\u003C/time\u003E by WinkAllKerb\u0027\u0027**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-06-27T06:08:46Z","Content":"Yow, that sucks.\n\nA couple weeks ago I started getting SMART warnings, so I threw an SSD in my Mac to replace the failing HD. My (old, crappy) gaming PC is entirely un-backed up, but the mac (with about 40,000 family pics on it) is backed up in triplicate (one off site).\n\nI think I should back up the PC having read your tale of woe (hadn\u0027t considered it worth it until just now)."},{"CreatedByName":"ColKlonk","CreatedById":137078,"CreatedDateTime":"2015-06-27T08:41:07Z","Content":"Annoying....\n\nI nowdays, from experience, always place the system OS on a small disk and my important stuff on a \u0027less used\u0027 large second disk, plus two other backup media types\n\nReminds me to start backing up now.. thanks\n\n![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-06-27T15:41:24Z","Content":"It will cost you, but there are places that do recovery off such damaged media... so if you\u0027re willing to spend the $$$$$, all is not lost. Google is your friend.\n\n**Edited \u003Ctime datetime=\u00222015-06-27T20:03:35Z\u0022 title=\u002206/27/2015 08:03  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 27, 2015\u003C/time\u003E by LordFerret**\n  \nmissed the \u0027ing\u0027 on willing. oops"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-27T18:29:42Z","Content":"\u003E \n\u003E It will cost you, but there are places that do recovery off such damaged media... so if you\u0027re will to spend the $$$$$, all is not lost. Google is your friend.\n\nI\u0027m not pleased with the loss, but I\u0027m not *that* upset about it really. I was just being dramatic.\n\nBesides, I just had to drop over $300 on a new HDD and a copy of Windows. Windows 8.1 \\*gag\\*\n\nEdit: Although I will admit it was astonishingly easy and fast to install, compared to my previous experiences.\n\nEdit2: And for some reason it thinks my name in Jenna Gibson.\n\n**Edited \u003Ctime datetime=\u00222015-06-27T18:31:50Z\u0022 title=\u002206/27/2015 06:31  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 27, 2015\u003C/time\u003E by Randazzo**"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-06-27T18:37:33Z","Content":"\u003E \n\u003E Edit2: And for some reason it thinks my name in Jenna Gibson.\n\nYou\u0027re SURE that drive was never used before?"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-06-27T20:04:45Z","Content":"Could be a refurbished drive."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-06-27T22:01:08Z","Content":"\u003E \n\u003E Could be a refurbished drive.\n\nThose should not be sold as new."},{"CreatedByName":"SemiaCloud","CreatedById":138816,"CreatedDateTime":"2015-06-27T22:06:01Z","Content":"That sucks. I once had something like that happen on my old computer."},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-27T22:12:25Z","Content":"It\u0027s related to the Microsoft Live account, not the drive."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-06-27T22:13:05Z","Content":"There is some companies ( at least in US), which can restore even badly damaged disks. Not for free, of course, but not that expensive, if disk is more or less intact - not dropped form 10000m into blazing fire for example.\n\nMake sure you repartitioned and reformatted new disk before use. \n\nIf it was repaired and resold, there might be information left on disk you don\u0027t want to keep for security (and police state surveillance) reasons."},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-06-27T22:17:21Z","Content":"yup yup residual hdd written layers .. if you really need to recover some things ..."},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-27T22:34:41Z","Content":"Again, it\u0027s a thing with the Microsoft Live account, not the drive. I have since fixed it after a google search revealed a lot of people with the same issue. Incidentally, all the names are some variation of Jen\\* \\*son, such as Jen Watson or Jennifer Paulson. Very odd indeed.\n\nalso, PSA: If you have a MSI X58-GD45 Military Class MOBO and you install windows 8.1, you will need version 0.25.2 of the bios or you will only have 2.99 gB of RAM usable."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-07-02T20:25:54Z","Content":"It\u0027s probably have something to do with Adam Jensen."},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-07-03T04:35:50Z","Content":"\u003E \n\u003E Make sure you repartitioned and reformatted new disk before use. \n\u003E If it was repaired and resold, there might be information left on disk you don\u0027t want to keep for security (and police state surveillance) reasons.\n\nIf there was a police state, then that police state would tell you that \u0022formating\u0022 only removes the data at the beginning and end of the partition and encourage you to hard-write zeros to each sector instead.\n\nI also wonder why people consider \u0022off-site backups\u0022 as backups. The webpage is under no contract to keep your data (or delete it for that matter) and can easily shut down without warning. Quite frankly, even if warning is given, the site will be DDoS\u0027d from the number of people trying to get their data off. (This is to say, that even if your data is guaranteed, it is actually being converted into a cheap monetary value based on gigabytes used, the service provider has all the cards while you have none.)\n\n**Edited \u003Ctime datetime=\u00222015-07-03T04:38:59Z\u0022 title=\u002207/03/2015 04:38  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 3, 2015\u003C/time\u003E by Fel**"},{"CreatedByName":"Amram","CreatedById":8067,"CreatedDateTime":"2015-07-04T17:44:47Z","Content":"\u0022working\u0022 copies should not be present in a single online service, for the reasons you mention, anyone else remember megaupload? Here today, gone tomorrow.\n\nBackups are different. They are by definition not the working set, its a backup. If the backup evaporates with whatever company\u0027s collapse, you create a new one from the current state somewhere else. If your primary fails, you recover from the backup.\n\nHaving a single potentially volatile backup is the bigger issue. If you rely on online, you need to distribute, 2 or more complete backups on unrelated services, the odds of losing all.....\n\nAnd still, the in house backup is warranted.\n\nI have important excel sheets and program code. I\u0027d go totally mental if I ever lost the data. It exists on my primary drive, secondary drive, a thumbdrive that only ever sees use as a periodic backup of key files, and across google drive, onedrive, mega.co.nz, and copy.com.\n\nMega might go down, as may any of the other online services. Two drives may fail the same day. The PC could take a horrendously absurd power surge and bake all hardware installed. Multiple services could go extinct simultaneously.\n\nBut 2 internal drives, a thumbdrive, and 4 separate online services to vanish simultaneously?\n\nOnline backups are perfectly viable, just don\u0027t rely on a single service as the sole source of backup for the data, and especially not as the working set of data."},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2015-07-04T18:36:53Z","Content":"If you\u0027re feeling adventurous:\n\n[http://www.cgsecurity.org/wiki/TestDisk](http://www.cgsecurity.org/wiki/TestDisk)\n\nIn an ideal world you\u0027d drop megabucks getting a professional to do it, but if you\u0027ve nothing to lose, well you still have options.\n\nIf the disk refuses to spin up, one thing that I wouldn\u0027t totally recommend, but if it were me I\u0027d probably try is put the disk inside a couple of ziplock bags, and leave in the freezer overnight. Then when powering on the disk, give it a couple of taps with a rubber mallet. It\u0027s worked for a couple of drives for us over the years.\n\n**Edited \u003Ctime datetime=\u00222015-07-04T18:47:55Z\u0022 title=\u002207/04/2015 06:47  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 4, 2015\u003C/time\u003E by pxi**"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-07-07T04:03:52Z","Content":"I just noticed this came back to life!\n\nMy old Hard Drive however, will not. Whatever happened in it\u0027s innards produced a horrendous clicking and a loud pop. I tried plugging her back in once I got my new drive/OS going, since I\u0027ve gotten data off disks that have failed before doing that. Sometimes it\u0027s just a bad sector in the wrong place, but I think this was hard mechanical failure. \n\nIn the end it\u0027s ok though, losing everything spurred me to make new things that are leaps and bounds better. All my photos and such are in online albums (and many KSP screenshots... pics or it didn\u0027t happen, you know.), and I don\u0027t keep much \u0022business\u0022 on the PC."},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2015-07-07T05:50:01Z","Content":"So something good came out of this for you!\n\nThough you might want to destroy your old HDD.\n\nScrew it open, take the nice magnets out and take a drill to the plates (not the small 2,5\u0022 ones though! those are made from glass).\n\nI might take my GF up on her request for a backup..."},{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2015-07-07T08:54:45Z","Content":"\u003E \n\u003E My old Hard Drive however, will not. Whatever happened in it\u0027s innards produced a horrendous clicking and a loud pop.\n\nWhile I know you\u0027re not so fussed for others reading this it sounds like maybe the electronics on the controller board fried. Happened to me once. What I did was get exactly the same model HDD and swapped controller boards. This let me boot up the old disk and get the data off."},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2015-07-09T17:28:48Z","Content":"You\u0027re not alone, my friend. Luckily, I back up regularly. All hail the mighty NAS."}]}