{"TopicId":115095,"ForumId":18,"TopicTitle":"So an earthquake just hit my city","CreatedByName":"CelticCossack51","CreatedById":127600,"CreatedDateTime":"2015-07-05T08:03:07Z","PageNum":1,"Articles":[{"CreatedByName":"CelticCossack51","CreatedById":127600,"CreatedDateTime":"2015-07-05T08:03:07Z","Content":"A 2.9 earthquake just shook Abbotsford,BC and I felt it. I really underestimated the power of 3.0 earthquakes. I wonder if anyone else got caught in worse situations that involved the Earth moving"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-07-05T09:03:41Z","Content":"4.7 in New Jersey years ago just before hurricane Irene. Epicenter was lake Anna in Virginia. Our vacation destination the next morning. I kid you not. Family has a house on the lake and we had a trip planned. Earythquake happened night before and we still went. Craziest weekend of my life.\n\nAftershocks hit us not five minutes after we got there and never stopped. Like a jet engine coming at the house and then the shake. Freakiest thing I\u0027ve ever experienced. Nuclear plant on the same lake had its reactor shift... lightning storms. And then hurricane Irene. A very, very interesting weekend.\n\n**Edited \u003Ctime datetime=\u00222015-07-05T09:05:56Z\u0022 title=\u002207/05/2015 09:05  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 5, 2015\u003C/time\u003E by Motokid600**"},{"CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2015-07-05T09:43:32Z","Content":"\u003E \n\u003E 4.7 in New Jersey years ago just before hurricane Irene. Epicenter was lake Anna in Virginia. Our vacation destination the next morning. I kid you not. Family has a house on the lake and we had a trip planned. Earythquake happened night before and we still went. Craziest weekend of my life.\n\u003E Aftershocks hit us not five minutes after we got there and never stopped. Like a jet engine coming at the house and then the shake. Freakiest thing I\u0027ve ever experienced. Nuclear plant on the same lake had its reactor shift... lightning storms. And then hurricane Irene. A very, very interesting weekend.\n\nI think the universal forces hate you in particular. Damn that\u0027s a lot to happen in a weekend."},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-07-05T11:26:29Z","Content":"2.9 on Richter\u0027s scale? I barely notice those. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-05T12:09:03Z","Content":"They do not call New Zealand the shaky Isles for nothing... we get so many its not funny in A DAY... but most you cannot feel.\n\nWorst quake I was in was the famous Inangahua earthquake which happened in 24 May, 1968 \n\nI was 8 years old and it was the first big quake that I had felt in my life to that point... it happened in the wee hours and really freaked me out.\n\nFurniture was dancing across the room... the only good thing about it was my father was a bricklayer and had so much work to repair chimneys that it was actually a blessing for our finances...\n\nit was 7.1 .... a 3 is NOTHING! LOL... \n\n[http://info.geonet.org.nz/display/quake/M\u002B7.1,\u002BInangahua,\u002B24\u002BMay\u002B1968](http://info.geonet.org.nz/display/quake/M\u002B7.1,\u002BInangahua,\u002B24\u002BMay\u002B1968)"},{"CreatedByName":"Kozak","CreatedById":128114,"CreatedDateTime":"2015-07-05T13:24:08Z","Content":"Been in an 8.3 before, swimming while an earthquake is happening is deadly and scary ;-;"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-07-05T13:35:30Z","Content":"\u003E \n\u003E 4.7 in New Jersey years ago just before hurricane Irene. Epicenter was lake Anna in Virginia. Our vacation destination the next morning. I kid you not. Family has a house on the lake and we had a trip planned. Earythquake happened night before and we still went. Craziest weekend of my life.\n\u003E Aftershocks hit us not five minutes after we got there and never stopped. Like a jet engine coming at the house and then the shake. Freakiest thing I\u0027ve ever experienced. Nuclear plant on the same lake had its reactor shift... lightning storms. And then hurricane Irene. A very, very interesting weekend.\n\nI remember that.\n\nIn 2011 (or was it 2012?) there was another, although I forget the epicenter. I was in Philly at the time, Abrams cancer center, up on the umpteenth floor ... the building swayed, as did all the other buildings outside. I was sitting next to a window, felt the motion, and then noticed everything outside swaying back and forth. Very very freaky."},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-07-05T15:29:07Z","Content":"Here in Oklahoma we get many, many earthquakes in the 2-4 magnitude range, as often as one a month to two a day."},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2015-07-05T16:38:18Z","Content":"pfft 2.3R you suck ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) that\u0027s nothing to what i have where i live, a 3R is the standard every couple of weeks. Last year a 5.8R earthquake hit with the epicenter a few km from where i live and its acceleration was equal to 7R earthquake (from what various scientists told at the media) a week later a second 5.6 earthquake hit at 5:00 in the morning. Many buildings were damaged but no casualties."},{"CreatedByName":"CelticCossack51","CreatedById":127600,"CreatedDateTime":"2015-07-05T19:33:51Z","Content":"The area that I live in does not get a lot of earthquakes. One news source said that it was magnitude-3.3. Looking back at it, it did not feel too powerful. That was my first quake by the way. Only one of my parents caught caught in one of the deadliest earthquakes in history in China.\n\n**Edited \u003Ctime datetime=\u00222015-07-05T19:36:08Z\u0022 title=\u002207/05/2015 07:36  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 5, 2015\u003C/time\u003E by CelticCossack51**"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-07-05T23:47:51Z","Content":"Chile:\n\n7.1,7.2,6.0.\n\nIt\u0027s very scary."},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-07-06T01:50:15Z","Content":"I live in a volcano filled part of Arizona, and have had a few minor earthquakes (nothing over 3). An exciting way to wake up, but I have never had any serious damage (well, a lego model was rather damaged once)."},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-07-06T02:02:42Z","Content":"Had a few 3s and 4s in the very general area, Burbank calif, the few I felt were like a big truck went by."},{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-07-06T02:05:29Z","Content":"\u003E \n\u003E (well, a lego model was rather damaged once).\n\n![MTjQc_.gif](https://cdn.makeagif.com/media/7-06-2015/MTjQc_.gif)"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-07-06T08:17:48Z","Content":"Long time ago had some large earthquakes (7.2) although far enough (~300 km from epicenter). Didn\u0027t felt it because I was on a bed... Then other people in my house warned me (after it ended) and I saw the lamps rocking... Some other time as well, but didn\u0027t felt them for the same reason !"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2015-07-06T08:28:29Z","Content":"I was in Tokyo for the 2011 Tohoku earthquake (M\u003Csub\u003EW\u003C/sub\u003E 9.0) so roughly 373 km from the epicenter.\n\nI can tell you that it was not fun in any way at all, although, being at such a distance, none of my friends, family or colleagues were hurt.\n\nLiving in Japan, it\u0027s surprising just how used to earthquakes you can get; generally they merit a roll-over-and-go-back-to-sleep, or at most a TV-channel-change to the public broadcaster, which has the best early coverage (and is a lot more willing than commercial stations to interrupt regular programming).\n\nThen something like 3.11 comes along and reminds you just how bad things can get."},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-07-07T23:33:55Z","Content":"Meanwhile here in England, a 2.0 earthquake is \u0027breaking news\u0027 on the BBC for like 3 days after it happened..."},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-07T23:45:55Z","Content":"Yeah, the same in Auckland, New Zealand... they think Auckland IS new Zealand, no one else in the nation matters, they rarely get a quake, but when they do... a piddly 2.0 ... they run from their homes screaming.... meanwhile... the rest of us post things like this...\n\n![r-MELBOURNE-QUAKE-600x275.jpg](http://i.huffpost.com/gen/652099/images/r-MELBOURNE-QUAKE-600x275.jpg)"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-07-08T00:12:54Z","Content":"Wow, i never experienced any kind of earthquake here in france. How does it feel ? exciting or scary ?"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-07-08T02:08:09Z","Content":"Have you ever been in a building when a really heavy truck went by outside? And the floor felt like it wiggled a little under your feet? That is what a mild earthquake feels like. \n\nA stronger one can feel like being in a boat when another boat passes and you bob around gently, swaying. \n\nThe strongest one I\u0027ve ever experienced was when I was 10 miles from the epicenter of a 4.4. That\u0027s not all that powerful, by the numbers, but we were close to it. That one felt like being next to a train track when a BIG train blasts by at high speed. There was a noise much like a jet liner flying a few hundred feet overhead, things on the walls and shelves shook and jittered around, and the ground felt like standing on a drumhead while a giant was drumming. Having grown up in California, the small ones are barely worth remarking upon, but this one scared me. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-07-08T02:16:10Z","Content":"I once experienced an earthquake in the middle of the night. It was a 4.4 at the epicenter, but I was probably 200 miles away.\n\nThings rattled, and a door kept hitting the door stop. It was very annoying in the middle of the night (like 3:00 AM), and I repeatedly yelled \u0022stop it!\u0022 Thinking it was someone of one of our pets. ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-07-08T02:36:03Z","Content":"We don\u0027t have earthquakes. We have hurricanes. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nIt\u0027s like, \u0022Alright everyone! We\u0027ll be sitting in the house with the lights out for the next week, don\u0027t go outside, and here, have some canned whatever\u0022. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nI remember when a power line set the neighbor\u0027s shed and trees on fire. That was freaky. Electrical fires are not fun."},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-07-08T03:09:31Z","Content":"\u003E \n\u003E We don\u0027t have earthquakes. We have hurricanes. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\u003E It\u0027s like, ***\u0022Alright everyone! We\u0027ll be sitting in the house with the lights out for the next week, don\u0027t go outside, and here, have some canned whatever\u0022***. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\u003E \n\u003E I remember when a power line set the neighbor\u0027s shed and trees on fire. That was freaky. Electrical fires are not fun.\n\nI know it sounds strange, I\u0027ve never been in a natural disaster, and I\u0027m a self-admitted recluse, but this sounds like fun. Granted, there\u0027d have to be nobody with me, but with my personality and lifestyle this would be easy. \n\nBut the electrical fires I agree with you. I\u0027m a bit of a pyromaniac myself but Electrical fires I won\u0027t even try. Too unpredictable and not at all controllable.\n\nEDIT::\n\nAnd I know I\u0027ll get some nasty comments for this, but I love canned food. Just for the whole factor that it takes up the same amount of space used that it does unused. You can also make neat things out of the cans or use them for collection of nuts, bolts in the workshop and hold water and any scavenged foodstuffs and cook in them in an emergency. They\u0027re almost a kind of multitool. Multi-container, maybe?\n\n**Edited \u003Ctime datetime=\u00222015-07-08T03:17:00Z\u0022 title=\u002207/08/2015 03:17  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 8, 2015\u003C/time\u003E by Flymetothemun**"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-07-08T03:30:30Z","Content":"\u003E \n\u003E I know it sounds strange, I\u0027ve never been in a natural disaster, and I\u0027m a self-admitted recluse, but this sounds like fun\n\nWell, I\u0027ve been in several, and you know what?\n\n...\n\nIt is kind of fun.\n\nMaybe I\u0027m a horrible person. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-07-08T04:00:22Z","Content":"Three years ago, there was an earthquake in Virginia and it knocked over some picture frames at my school in Lexington, North Carolina (I live two towns over from my school), but most of my school is a basement; that is the worst that happened (atleast we don\u0027t have the graduating class [only three people each] pictures from before 1976 anymore XD)."}]}