{"TopicId":119438,"ForumId":18,"TopicTitle":"The Highly Educated KSP Player - legends in our own minds? (Updated OP 16 January 2018)","CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-08-26T20:26:53Z","PageNum":4,"Articles":[{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-10-06T16:11:34Z","Content":"\n\u003Cp\u003ESome of you might be interested in reading through this, there\u0027s a lot of valuable resource in it...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.back2college.com/accelerate.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.back2college.com/accelerate.htm\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-06T16:15:12Z\u0022 title=\u002210/06/2015 04:15  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 6, 2015\u003C/time\u003E by LordFerret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GDJ","CreatedById":58462,"CreatedDateTime":"2015-10-06T16:28:15Z","Content":"\n\u003Cp\u003EAm I the only Blue collar educated person here??\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E The Life-Got-Real certificates\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Red Seal Heavy Duty Mechanics ticket\u003C/p\u003E\u003Cp\u003E-Certificate, Gardner Denver Pump Repair course\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe \u0022When I was dreaming\u0022 part of life education\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Certificate, Recording Arts Musical Production (Columbia Academy, 1991)\u003C/p\u003E\u003Cp\u003E-Certificate, Powersound Recording Studio\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe new \u0022Life-Got-Real\u0022 education\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Currently doing a online course on Home Inspections (career change)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-06T16:30:18Z\u0022 title=\u002210/06/2015 04:30  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 6, 2015\u003C/time\u003E by GDJ\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-10-06T17:34:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EIn my experience, lack of degrees is frequently a bonus. No terrible habits and preconceived notions to unlearn before actually becoming productive..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have seen this too. Too many people can become disillusioned after graduating with a college degree, then have to work in a field outside of their degree. Normally, they have a hard time with the transition from student to working stiff... especially if they feel like the position they had to take is \u0022beneath\u0022 someone with their academic achievements. You\u0027re quite right. A college degree can often be more of an employment handicap than a helpful tool.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022razark\u0022 data-cite=\u0022razark\u0022\u003E\u003Cdiv\u003EUnfortunately, I\u0027ve also seen people get passed over for positions they deserve just because, even if they obviously have the skills, they don\u0027t have the piece of paper.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt depends on if you are talking about small business versus a large corporation or government employer. I know of a few small employers here (with under 150 employees) that prefer to hire experience over education. For them, it is the practical knowledge that comes from experience that builds a stronger employee and a stronger, more productive company.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptainKorhonen\u0022 data-cite=\u0022CaptainKorhonen\u0022\u003E\u003Cdiv\u003EI graduated from high school*... Or maybe I\u0027m under the \u0022planning to enter college\u0022 category, assuming \u0022college\u0022 is the same as \u0022university\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAdded. In the U.S., for some reason, we use \u0022college\u0022 and \u0022university\u0022 for the same thing. Having lived in Europe for nearly 10 years of my life, I can appreciate the difference. A change has been made to this page. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003ENot got a university (college) degree and have very poor A levels as well. Declining health made it difficult to study though I did do 2 years of a mechanical engineering course before having to drop out ill....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt sounds \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Elike life happened\u003C/strong\u003E\u003C/span\u003E to you. You\u0027ve been added to our list.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordFerret\u0022 data-cite=\u0022LordFerret\u0022\u003E\u003Cdiv\u003ESome of you might be interested in reading through this, there\u0027s a lot of valuable resource in it...\u003Cp\u003E\u003Ca href=\u0022http://www.back2college.com/accelerate.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.back2college.com/accelerate.htm\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, indeed... a lot of great information in that site, if others will use it...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GDJ\u0022 data-cite=\u0022GDJ\u0022\u003E\u003Cdiv\u003EAm I the only Blue collar educated person here??\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, not in a long shot:\u003C/p\u003E\u003Cp\u003Eflymetothemun: Currently pursuing vocational training as a semi truck (tractor trailer for the rest of the world) driver/operator. \u003C/p\u003E\u003Cp\u003EAnd you\u0027ve been added too...\u003C/p\u003E\u003Cp\u003EThere are a few purposes of this thread; up until now I\u0027ve never had to explain why I started it. Anyhow, here it goes:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EI have seen some users on the forum berate and belittle people that simply didn\u0027t understand some aspect of physics, astronomy, etc. that the \u0022advanced and smart\u0022 users thought should be basic knowledge to play KSP. I wanted a forum to demonstrate to those feeling disillusioned that not everyone here is a rocket scientist or pilot, but that we come from a variety of backgrounds as a way to encourage others.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt also was born out of my love of education and the concept of self-betterment. Not all learning comes from a text book and learning is a life-long process. Anyone that claims they learned all they have ever needed to learn is a moron and will never become anything greater than what they currently are. Whether it be a vocational class or training, a college course, learning a new hobby, developing a new skill, or a self-taught program of study, the desire to learn and become greater than we were yesterday is an important part of our personal development. For this very reason, when flymetothemoon first sent me a message, I knew it was only right to include blue collar workers in this list for the training they have accomplished. Without blue collar workers, there would be no academics...\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt also serves as inspiration for the younger crowd. If you will notice, in a few categories you will see the notation, \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Elife happened\u003C/strong\u003E\u003C/span\u003E because life does happen. A \u0022life happened\u0022 moment is one that forces us to evaluate what our plans are for the future versus what our current circumstances are. We are forced to make a decision that often there is never a \u0022going back\u0022 moment. I feel this is extremely important; teaching at the college level for nearly 13 years, I have had students commit suicide because they had a \u0022life happened\u0022 moment and they felt they had no choice, no way out, no escape. So, rather than taking the leap of faith and making a decision, they were crushed under the weight of the decision. This part of this thread serves to encourage them that regardless of the choice they make, LIFE DOES GO ON and you can still succeed without a degree. In fact, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/72674-regex\u0022 rel=\u0022external nofollow\u0022\u003Eregex\u003C/a\u003E posted earlier in this thread that he is not only successful without an academic degree and has a family that he dearly cherishes - and \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Elife happened\u003C/strong\u003E\u003C/span\u003E to him!\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-06T17:37:04Z\u0022 title=\u002210/06/2015 05:37  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 6, 2015\u003C/time\u003E by adsii1970\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-10-06T18:52:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022adsii1970\u0022 data-cite=\u0022adsii1970\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Eflymetothemun: Currently pursuing vocational training as a semi truck (tractor trailer for the rest of the world) driver/operator. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMate, I\u0027m not enrolled in anything! Although I MIGHT go to one of the technical schools for truck driving (and maybe welding, welding pays GREAT almost everywhere and you get to stick bits of metal together like a wizard); Tech schools are cheaper, you get hands-on training rather than just reading out of a book all the time, and you\u0027re out of the place in 18 months. It\u0027s a maybe right now.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022adsii1970\u0022 data-cite=\u0022adsii1970\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd you\u0027ve been added too...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EIt also was born out of my love of education and the concept of self-betterment. Not all learning comes from a text book and learning is a life-long process. Anyone that claims they learned all they have ever needed to learn is a moron and will never become anything greater than what they currently are. Whether it be a vocational class or training, a college course, learning a new hobby, developing a new skill, or a self-taught program of study, the desire to learn and become greater than we were yesterday is an important part of our personal development. For this very reason, when flymetothemoon first sent me a message, I knew it was only right to include blue collar workers in this list for the training they have accomplished. Without blue collar workers, there would be no academics... \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood on ya! I\u0027m from a blue-collar family and area and a lot of times we think that people who have gone to college really forget about us and stay in their \u0022bubble\u0022. And then there are the ones who call us ignorant and stupid and all kinds of names that do barely anything except make themselves feel high and mighty.\u003C/p\u003E\u003Cp\u003EAlso, this is a really GREAT interview with Mike Rowe about how college is getting to be overrated or at least getting to be too high of a cost:benefit ratio:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/qzKzu86Agg0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-06T19:01:57Z\u0022 title=\u002210/06/2015 07:01  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 6, 2015\u003C/time\u003E by Flymetothemun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-10-06T19:04:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flymetothemun\u0022 data-cite=\u0022Flymetothemun\u0022\u003E\u003Cdiv\u003EMate, I\u0027m not enrolled in anything! \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmmm, might have to go back and read the old posts... I thought you were heading to technical schools for truck driving...\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-10-06T19:20:20Z","Content":"\n\u003Cp\u003EI am not yet in college, but I plan to get my bachelors (and maybe masters/doctorate) in Aerospace Engineering and go work for SpaceX before becoming an astronaut.\u003C/p\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-10-06T19:32:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022adsii1970\u0022 data-cite=\u0022adsii1970\u0022\u003E\u003Cdiv\u003EHmmm, might have to go back and read the old posts... I thought you were heading to technical schools for truck driving...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd I quote:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022I kid, I kid. I\u0027m aiming for semi truck driving, but if that doesn\u0027t go too well I\u0027m more interested in trades (Mainly welding \u0026amp; pipe/steamfitting) rather than degree-requiring jobs and most of the time you can learn trades by union apprenticeship. The rest of the times it\u0027s usually a technical school, and those are far cheaper than college, usually only last 1 1/2-2 yrs and you only learn the thing you signed up for, not all the accouterments like algebra and whatnot.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI said I\u0027m AIMING, not enrolled. Although, that\u0027s more my dialect coming through. Aiming means you\u0027re REALLY interested around where I live.\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-10-07T08:53:13Z","Content":"\n\u003Cp\u003EYoung and aspiring for me. Studying at a international (CDNIS)school in Hong Kong. Hating it in a culture that loves science and invented gunpowder and the first rockers, yet everyone says aerospace engineers make no money. I\u0027m pretty sure that is just their coverall way to discourage kids from doing something they couldn\u0027t to maintain their own self-image, because a third of my science teachers don\u0027t know what aerospace means.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI find it funny how the magic price of paper that lets you succeed in life is called a BS.\u003C/p\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-10-07T09:06:43Z","Content":"\n\u003Cp\u003EI have two choices right now, join the airforce or become an aerospace engineer.\u003C/p\u003E\u003Cp\u003EI am am not in uni yet\u003C/p\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-10-07T15:49:55Z","Content":"\n\u003Cp\u003EFlymetothemoon: I moved you to the \u0022would like to earn\u0022 category. Seems fitting...\u003C/p\u003E\u003Cp\u003ERath: Nope, you qualify for \u0022in pursuit of\u0022 and have been added to that category...\u003C/p\u003E\u003Cp\u003EBev7787: Live the dream... you\u0027re added too...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E--updated--\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBev7787: Serving in the armed forces of your home nation is not only an honorable profession, but is the making of a true patriot. There\u0027s no shame in that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-07T15:56:42Z\u0022 title=\u002210/07/2015 03:56  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 7, 2015\u003C/time\u003E by adsii1970\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-10-07T15:51:20Z","Content":"\n\u003Cp\u003EThe Air Force isn\u0027t a bad deal. Don\u0027t know if you\u0027re talking about the USAF though or another country. If USAF, if you intend on attending their college (Air Force Academy) you\u0027ll need at least 700\u0027s on your SATs before they\u0027ll accept you... they\u0027ll \u003Cem\u003Econsider\u003C/em\u003E less, but there\u0027s no guarantee. I would suggest you talk \u003Cem\u003Eextensively\u003C/em\u003E with a recruiter \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Efirst\u003C/span\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-10-07T19:21:06Z","Content":"\n\u003Cp\u003EAlrighty, I\u0027ll bite! I am in my senior year of high school but plan on snagging a master\u0027s degree in something like physics, getting a teaching certification, and go teach high school physics. Because that\u0027s the fun science to teach.\u003C/p\u003E\u003Cp\u003EKSP in class, anybody?\u003C/p\u003E\n"},{"CreatedByName":"MaxwellsDemon","CreatedById":147660,"CreatedDateTime":"2015-10-07T19:31:12Z","Content":"\n\u003Cp\u003EBA in Business Administration here, plus a number of classes on databases, etc. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (I started on an MBA right after undergrad but discovered I was thoroughly sick of school by that point; ended up joining the Army instead. Never have picked the MBA back up; probably won\u0027t.)\u003C/p\u003E\n"},{"CreatedByName":"Frybert","CreatedById":97766,"CreatedDateTime":"2015-10-08T00:05:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flymetothemun\u0022 data-cite=\u0022Flymetothemun\u0022\u003E\u003Cdiv\u003EAnd I quote:\u003Cp\u003E\u003Cem\u003E\u0022I kid, I kid. I\u0027m aiming for semi truck driving, but if that doesn\u0027t go too well I\u0027m more interested in trades (Mainly welding \u0026amp; pipe/steamfitting) rather than degree-requiring jobs and most of the time you can learn trades by union apprenticeship. The rest of the times it\u0027s usually a technical school, and those are far cheaper than college, usually only last 1 1/2-2 yrs and you only learn the thing you signed up for, not all the accouterments like algebra and whatnot.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI said I\u0027m AIMING, not enrolled. Although, that\u0027s more my dialect coming through. Aiming means you\u0027re REALLY interested around where I live.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat part of the world are you from? I drove for 3 years (and would still be if it weren\u0027t for family matters) and could have some info when the time comes.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rath\u0022 data-cite=\u0022Rath\u0022\u003E\u003Cdiv\u003EI find it funny how the magic price of paper that lets you succeed in life is called a BS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-10-08T13:07:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rath\u0022 data-cite=\u0022Rath\u0022\u003E\u003Cdiv\u003EI find it funny how the magic price of paper that lets you succeed in life is called a BS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat just got you your second rep pip.\u003C/p\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-10-21T11:24:18Z","Content":"\n\u003Cp\u003ESorry folks, been away for a bit. Between college mid-terms, picking up four classes in the spring (one course is one that I have not taught in nearly four years), and fall break, I have not had the chance to update the page the way I normally do. However, it\u0027s now updated, so here\u0027s a short list of what was done:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMaximus97\u003C/strong\u003E: \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EYou\u0027ve been added to our roster. Congrats on making the decision to go into public education, and to teach science/physics... \u003C/div\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cdiv\u003E Do you have an idea of which college you might like to attend? I add that information to this list in case you inspire someone to follow in your footsteps.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMaxwell\u0027sDemon\u003C/strong\u003E: \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003ECongrats on completing the B.A. in business management. Do you want to share the college and year of your graduation? As you can see from other bios, that\u0027s one of the things shared. As you can see from our listing, there are a lot of us who have had the \u003C/div\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003E\u003C/strong\u003E\u003C/span\u003E\u003Cdiv\u003E\u003Cstrong\u003Elife happened\u003C/strong\u003E\u003C/div\u003E\u003Cstrong\u003E\u003C/strong\u003E\u003Cdiv\u003E thing happen to us while pursuing a degree.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhen I first began this thread, I had never considered the amount of interest it has generated. On a more personal level, it has helped me to see that there are more of us why have had something happen, to have \u003Cspan style=\u0022color:#A52A2A;\u0022\u003E\u003Cstrong\u003Elife happen\u003C/strong\u003E\u003C/span\u003E, and while our lives didn\u0027t necessarily go where we had hoped or planned, we did survive in spite of life. There are days where my college advising kinda gets depressing, especially when you see a young person struggling with the decision to leave college or to try and press on. What also amazes me is the number of college students that waste the opportunity they\u0027ve been given, believing that college is some great rite of passage and something to be experienced rather than a transitory stage of life.\u003C/p\u003E\n"},{"CreatedByName":"Astronut","CreatedById":2077,"CreatedDateTime":"2015-10-25T00:07:35Z","Content":"\n\u003Cp\u003EI guess \u0027Life happened\u0027 might be the category I would fit into. I went straight into the Royal Air Force after leaving school working in the ATC branch as an assistant controller/ops clerk. I did start an Open University degree course while serving, but I quickly became distracted with learning to fly - do I want to study calculus today or go flying? Hmmmm. \u003C/p\u003E\u003Cp\u003ELet\u0027s just say that flying won. \u003C/p\u003E\u003Cp\u003EI fly for a living now on the business aviation side of the industry. The lack of a degree hasn\u0027t held me up much so far but I have been extremely lucky and have had a lot of help along the way.\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-10-25T01:02:41Z","Content":"\n\u003Cp\u003EDidn\u0027t finish school. I sometimes get asked if I\u0027m an engineer, based on things I\u0027ve made in RL and KSP. I\u0027ve been teaching myself constantly since leaving school, but lack deep theoretical knowledge, it\u0027s fragmented over an enormous amount of interests. I am pretty good at visualization, lateral thinking, and creating. I\u0027ve built my own car, I can build a solid house without formal education. One of the reasons I invest time in KSP with creating and inventing is I hope some day I can get a job where they can use my brain and keep me inspired.\u003C/p\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2015-10-25T01:36:15Z","Content":"\n\u003Cp\u003EI enjoy the \u0027had life have them happen to them while xyz...\u0027 category.\u003C/p\u003E\u003Cp\u003EHave about half a B.S. in both biology and environmental studies.\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-10-25T03:30:03Z","Content":"\n\u003Cp\u003Ein the international school system you need to do a thing called a personal project. I\u0027m trying to make a \u0026lt;99% reliable, TWR \u0026lt;5 rocket engine. The science teachers are now Giving me much better grades than I should on projects so long as a say \u0022I was working on my rocket thruster.\u0022\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2015-10-25T11:44:57Z","Content":"\n\u003Cp\u003EI\u0027m not yet it high school, but I do hope to one day be an astronaut.\u003C/p\u003E\u003Cp\u003EI know more about rockets than the guy at the Shuttle orbiter Endeavour.......\u003C/p\u003E\u003Cp\u003E#HumbleBrag\u003C/p\u003E\n"},{"CreatedByName":"CommanderSpock","CreatedById":147594,"CreatedDateTime":"2015-10-25T14:56:09Z","Content":"\n\u003Cp\u003EAt the moment, propulsion engineering is tickling my fancy.... My high school has a three year program to study whatever, get a mentor, and do whatever you were studying.... I\u0027m thinking of dual cycle engines to get into orbit cheaper and faster.... (basically RL rapiers)\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2015-10-26T22:41:16Z","Content":"\n\u003Cp\u003ELate 50s, disabled and retired now. Started but did not complete college. Not so much \u0022life happened\u0022, as \u0022got to college and realized I was sick to death of classrooms.\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso was a private pilot with 500 hours when I had to give up flying due to disability.\u003C/p\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-10-28T12:09:06Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EAstronut:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou\u0027ve been added to the \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Elife happened\u003C/strong\u003E\u003C/span\u003E category. As long as you are doing what you love it is more like getting paid to play! To me, that is more important than any degree or college learning because not everyone needs a college degree to be successful, happy, and financially stable. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAzimech:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI also added you to the \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Elife happened\u003C/strong\u003E\u003C/span\u003E category. Same as what I said to Astronut! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBoomerang:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAre you still in school? Did \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Elife happen\u003C/strong\u003E\u003C/span\u003E to you as well? I\u0027ve got you listed in the \u003Cstrong\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003Elife happened\u003C/span\u003E\u003C/strong\u003E category until I can get some information from you. Yes, a number of people have commented that the \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Elife happened\u003C/strong\u003E\u003C/span\u003E category is their favorite part of this thread. If I were to guess, and if I were to base it on my opinion of it, I think it is my favorite too but because it shows you do not need a college degree to be happy, successful, and financially prosper. Within western Europe, there tends to be this great disconnect between academics and blue collar workers - which I do not truly understand. If it were not for the blue collar workers, the academics and scholars would have no one to teach, no way to have education as a vocation... just some food for thought. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERath:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003ECan you tell me a little more about your school? Name, location? It helps to keep everything together, neat and tidy, that sort of thing!\u003C/span\u003E I am taking it you are a student at the Hong Kong International School? I\u0027ve added you to the \u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003Easpiring dreamers\u003C/strong\u003E\u003C/span\u003E category. If you\u0027re planning to go to college, let me know where you\u0027re planning to go and I will move you to the other category. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E_Augustus_:\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003EI put you under the \u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003Easpiring dreamers\u003C/strong\u003E\u003C/span\u003E category. Believe me, I feel your pain; being a professional historian, I always hate touring state and national parks/monuments and knowing more than the tour guides. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECommanderSpock:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI put you under the \u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003Easpiring dreamers\u003C/strong\u003E\u003C/span\u003E category. When you know what college you want to head to, let me know...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBeowolf:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EMy friend, that still falls under the \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Elife happened\u003C/strong\u003E\u003C/span\u003E category. There are many reasons people choose not to complete college. I bet if you were to ask some of those within that particular category, you might find some have the same reason for leaving college as you did! I\u0027m sorry to hear about your disability - and the fact it keeps you from flying IRL.\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2015-10-28T14:10:16Z","Content":"\n\u003Cp\u003EI think I fit all the categories! 40 years young, with \u003C/p\u003E\u003Cp\u003E- BSc Genetics, Queen\u0027s University Belfast (mid 90\u0027s) \u003C/p\u003E\u003Cp\u003E- MSc Bioinformatics, University of Ulster (mid 00\u0027s) \u003C/p\u003E\u003Cp\u003E- Currently in L3 of an Open University degree focused on astronomy and planetary science, also did oceanography and hoping to do data management and analysis (looking forward to getting stuck into Kepler data). \u003C/p\u003E\u003Cp\u003EPlanning to go for PhD in exoplanetary astrobiology or related field, and hopefully academia. Late, because life happened (health and luck), but still an aspiring dreamer.\u003C/p\u003E\n"}]}