{"TopicId":119660,"ForumId":18,"TopicTitle":"Up in Flames: An Unexpected Life Change","CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-08-29T15:18:45Z","PageNum":1,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-08-29T15:18:45Z","Content":"\n\u003Cp\u003EI was woken at 5AM this morning to the desperate yelling of my mother, whom I live with for her sake. \u0022Wake up, the roof is on fire!\u0022 For but a split second, I thought it merely a dream, but my mind is far too agile to be so deceived. Within seconds I was up, and swiftly struggled to get myself clothed. I exited my room to the smell of smoke, the cat running down the hall desperately in terror, and a fireman gesturing me out of the house. Again, were my mind not so agile, I would be wont to believe it was merely a nightmare. I inquired after the cat, but there was no chance to do anything; we had to trust that her inherent fear would drive her into hiding under my parents\u0027 bed (which she fortunately did).\u003C/p\u003E\u003Cp\u003EFor a tense 90 minutes after, sheltered under the meager roof of our car-park, we waited in anticipation and fear, rain pouring down in occasional spurts overhead. I pieced together the story from what I was told by my parents and the firefighters: dad had lit an old Aladdin lamp on the fireplace mantle, but not adjusted the wick first. The flames shot upward, catching the ceiling alight. His mind of late has been clouded, and he did not even think to waken myself or my mother, instead trying to battle the flames himself. For the sake of all of my family, I am eternally grateful that one of our neighbors saw the fire and called the fire department, and that the firefighters were able to rouse us and get us out.\u003C/p\u003E\u003Cp\u003EThe damage to our home is significant, but it would have been far worse had the fire department not been contacted. The ceiling is destroyed along two-thirds of the structure in patches, the roof similarly damaged. Though technically no fire reached below the ceiling, the fact remains that the damage caused from piercing the ceiling and roof to put out the flames has done significant damage to the floor and some of the furniture. Certainly we have a problem with an excess of water on the floor, along with the debris of the torn-away ceiling.\u003C/p\u003E\u003Cp\u003EWe have spent much of the last 90 minutes gathering together what meager supplies we can, contacting the insurance company, and arranging for housing for our cat. I sit on my porch as I type this from my laptop, spared as it fortunately was from any harm, wondering what awaits us now. We will go to live with my aunt and grandmother for a time, and I can only hope that this mess will be resolved in a timely fashion.\u003C/p\u003E\u003Cp\u003EOne of the inevitable side-effects of all of this, of course, is that I cannot access my main PC for the time being. I don\u0027t even know for sure if it\u0027s alright, as my room was one of the areas that they had to break through the ceiling. Water seeped into my room, right over my entertainment area, and I am hoping that whatever damage is done will be minimal at worst; possibly I\u0027m being over-optimistic. Whatever the case, for the time being, my life is now turned upside-down, and I find myself adrift in a way I never expected. There is no telling just how much I have actually lost yet, and I may not find out for days.\u003C/p\u003E\u003Cp\u003EIf you read through all of this, thank you. Right now, I\u0027m thankful to be alive, and to know that I have anywhere I can turn to for support. Even if it is only a friendly word, or condolences, it really does mean a lot.\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-08-29T15:20:37Z","Content":"\n\u003Cp\u003E..Oh my god. Good to hear that you\u0027re safe.\u003C/p\u003E\u003Cp\u003EBest wishes on recovery from such an event.\u003C/p\u003E\n"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-08-29T15:29:21Z","Content":"\n\u003Cp\u003EI..I\u0027m speechless.\u003C/p\u003E\u003Cp\u003EI am truly sorry you have to go through this. Why disasters like this have to happen, I will never know. I hope you and your family recover from this a quickly and as easily as possible.\u003C/p\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-08-29T15:50:28Z","Content":"\n\u003Cp\u003EGood luck to you and your family in the duration. Don\u0027t ever feel like you are alone; There are surely folks in your neighborhood that will help and house fires have happened to millions, if not billions of people, so you\u0027re in plenty of company. And as for your computer, the insurance company will most likely pay for a new one (That\u0027s why the hell people have insurance in the first place, to pay for new stuff if something happens to the old stuff), but I\u0027d focus on recovering the HDD at least. The water/flame would\u0027ve had to go through the case and possibly a retaining bracket, so it might be safe.\u003C/p\u003E\n"},{"CreatedByName":"Plume \u0026amp; Akakak","CreatedById":142955,"CreatedDateTime":"2015-08-29T15:52:58Z","Content":"\n\u003Cp\u003ENo one was physically harmed, that\u0027s the most important.\u003C/p\u003E\u003Cp\u003EI wish you and your family all the best in this difficult situation.\u003C/p\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-08-29T16:20:52Z","Content":"\n\u003Cp\u003EI know that things are rough, but as the Bible says, \u0022these things too, shall come to pass...\u0022 One thing about life is that it always changes; each change, whether good or bad, can bring out the best or the worst in us. The important thing is you and your family are ok; I know that everyone tells you things can be replaced, and they can, but it doesn\u0027t mean that you won\u0027t feel a loss. Nevertheless, they are just things and many of them can be replaced. It\u0027s what insurance is for. \u003C/p\u003E\u003Cp\u003EMy prayers and thoughts are with you...\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-08-29T16:24:17Z","Content":"\n\u003Cp\u003ESorry to hear this. Fires and floods and such really suck. Fortunately you lost only \u0027things\u0027 and not what really matters - your life and that of your loved ones. Wishing you the best during these hard times.\u003C/p\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2015-08-29T16:40:59Z","Content":"\n\u003Cp\u003EIt must have been quite the ordeal.\u003C/p\u003E\u003Cp\u003EGood to hear everyone made it safely out.\u003C/p\u003E\u003Cp\u003EBest of luck in these trying times.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-29T17:49:05Z","Content":"\n\u003Cp\u003EBest of luck for the future SkyRender, if there\u0027s anything to be thankful for it\u0027s that everyone walked away.\u003C/p\u003E\u003Cp\u003EAll our thoughts are with you.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-08-29T18:01:52Z","Content":"\n\u003Cp\u003EMost of the photos I took during the aftermath did not come out well. One in particular, however blurred it may be at the edges, perfectly captures just what it was like though.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XYqJbyq.jpg\u0022 alt=\u0022XYqJbyq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, that is the very lamp that started the blaze. The warpath of destruction from the flames ignited above it is only hinted at.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-08-29T18:36:06Z","Content":"\n\u003Cp\u003EDisasters like this are beyond me, as I\u0027ve never personally experienced something close to it, but there have been moments that have given me some hints to what it must be like. A few years ago during a hurricane, a power line went down in our backyard and lit the neighbor\u0027s shed on fire, and being an electrical fire, the rain and the firefighters couldn\u0027t put it out very easily. Our house filled with smoke, and you could hear the wind and rain outside buffeting the windows. Another time my father woke me up in the middle of the night. The house down the street was on fire, a really \u003Cstrong\u003Ebig\u003C/strong\u003E cloud of smoke and flames billowing up out of the roof. The structure was stripped bare by the blaze, nothing but the concrete walls still standing. Then last winter, a water pipe broke in our house up in Michigan, filling our basement with a foot of water or more. (I was down in Miami at the time, our family primarily lives there but we go up north whenever we can to visit relatives). In terms of actual value, not much was lost, but there were countless priceless items ruined by the flood. Old books, memorabilia, things like that. It was a while before we got everything back in order.\u003C/p\u003E\u003Cp\u003ENone of these things come close to what you\u0027ve been through, though, and I wish you the best.\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-08-30T00:43:52Z","Content":"\n\u003Cp\u003EI\u0027ve been through a big fire like that. Not fun at all. The soot gets EVERYWHERE. \u003C/p\u003E\u003Cp\u003EI hope that you are able to recover your possessions intact and that the reconstruction and cleaning goes quickly. Life will go on, but the next month or so will probably be a little rough. Good luck!\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-09-02T17:03:32Z","Content":"\n\u003Cp\u003EOh my lord.\u003C/p\u003E\u003Cp\u003EI am so glad you are ok.\u003C/p\u003E\u003Cp\u003EYou\u0027ll get through this, and I wish you best of luck to you and your family.\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2015-09-02T17:11:55Z","Content":"\n\u003Cp\u003EI\u0027ve been in a house fire. It\u0027s a real panic once you find out what is going on. It was an apartment building and one of the tenets was a drug dealer. Someone tried to kill him by setting the basement under his apartment on fire. A couple of years ago the woods in back of my house caught fire. Woke up at about 2am with smoke filling the house. I was really nervous that the trees closer to my house would catch fire. Other than that it was pretty spectacular seeing 60 to 70 foot pines on fire. Flames must have been at least a 100 feet tall.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-02T17:14:22Z\u0022 title=\u002209/02/2015 05:14  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 2, 2015\u003C/time\u003E by dr_jt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-09-02T18:03:00Z","Content":"\n\u003Cp\u003EIf you want to really help SkyRender out, check this out. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/133259-Project-Phoenix%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/133259-Project-Phoenix%21\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-09-05T11:42:16Z","Content":"\n\u003Cp\u003EAgain, I\u0027m really sorry this happened.\u003C/p\u003E\u003Cp\u003EJust out of curiosity, what city was this in?\u003C/p\u003E\u003Cp\u003EDMSP\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-09-05T12:48:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMSP\u0022 data-cite=\u0022DMSP\u0022\u003E\u003Cdiv\u003EAgain, I\u0027m really sorry this happened.\u003Cp\u003EJust out of curiosity, what city was this in?\u003C/p\u003E\u003Cp\u003EDMSP\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe live in Portland, as does a surprisingly large portion of Oregon\u0027s residents actually.\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-09-05T13:14:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EWe live in Portland, as does a surprisingly large portion of Oregon\u0027s residents actually.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk.\u003C/p\u003E\u003Cp\u003EI thought I saw a news artical on it.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-09-05T13:27:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMSP\u0022 data-cite=\u0022DMSP\u0022\u003E\u003Cdiv\u003EOk.\u003Cp\u003EI thought I saw a news artical on it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would be very surprised at that. We haven\u0027t spoken to anyone from the media, at least that I\u0027m aware of...\u003C/p\u003E\n"}]}