{"TopicId":121813,"ForumId":18,"TopicTitle":"Loneliness","CreatedByName":"MrWalrus123","CreatedById":119099,"CreatedDateTime":"2015-09-27T15:36:11Z","PageNum":1,"Articles":[{"CreatedByName":"MrWalrus123","CreatedById":119099,"CreatedDateTime":"2015-09-27T15:36:11Z","Content":"\n\u003Cp\u003EI\u0027m assuming you\u0027ve all watched Vsauce\u0027s video about being lonely. In it, Michael talks about the feeling and other things related to it, for example, how during Apollo 11, when Michael Collins was on the \u0022dark side of the moon\u0022, he lost all radio contact with the lander, and mission control and how \u0022he was the farthest any human has been from another human\u0022; he was \u0022literally the most loneliest person in the \u0022world\u0022. He also mentions how on the voyager probe\u0027s \u0022Sounds of the Earth\u0022, Carl Sagan and some other people gathered various images, a heart beat, greetings in various languages, and 25 songs (some where chosen to represent basic emotions)that shows what it is to be human. One of the songs that was chosen was made to represent the basic feeling of \u0022loneliness\u0022, to show other worldly beings what that basic emotion is (they probably have different feelings, maybe even no feelings at all.). This song was written by a blues artist in the 1930\u0027s, he went by the name \u0022Blind Willie Johnson\u0022. He was blinded when his step-mom threw lye in his eyes. The song is titled \u0022Dark was the Night and Cold was the Ground\u0022 Willie was poor and homeless for most of his life, he died on wet newspaper. Anyways the song is embed below.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/BNj2BXW852g?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EEnjoy\u003C/p\u003E\n"}]}