{"TopicId":122550,"ForumId":18,"TopicTitle":"Silent Hunter Series (and other sub games)","CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2015-10-08T00:31:56Z","PageNum":1,"Articles":[{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2015-10-08T00:31:56Z","Content":"\n\u003Cp\u003EI know that space sims and sub sims are two very different types of games, but I\u0027ve seen a few people on this forum who play the Silent Hunter games. I myself own SH5, and it\u0027s a pretty ok game, despite the fact that it seems to be largely unfinished.\u003C/p\u003E\u003Cp\u003EThis thread is for us part time submariners to discuss Silent Hunter, post screenshots, develop tactics, etc. Maybe it will take off, maybe it won\u0027t get a lot of views, I won\u0027t really be surprised either way.\u003C/p\u003E\u003Cp\u003EAny other submarine games besides Silent Hunter are welcome too, since the genre isn\u0027t as big as it might be.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-08T00:36:17Z\u0022 title=\u002210/08/2015 12:36  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 8, 2015\u003C/time\u003E by pTrevTrevs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Noname117","CreatedById":53624,"CreatedDateTime":"2015-10-08T01:28:32Z","Content":"\n\u003Cp\u003EI did get Sh5, and found it quite fun (Though I eventually stopped playing because the game was too unfinished). Does anybody know of the mods which improve the game, as I think it would get better by installing a few of them.\u003C/p\u003E\u003Cp\u003EAnyways, I\u0027ve found that there have been a couple decent mobile sub games. Crash Dive played quite well, though felt like a toned down version of the Silent Hunters.\u003C/p\u003E\u003Cp\u003EAtlantic Fleet is probably the most fun I\u0027ve had with a mobile game. Although it is turn based, it has quite good submarine mechanics, and actually quite good all around ship combat mechanics. If you have the money to get it, I do recommend it.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2015-10-08T04:01:23Z","Content":"\n\u003Cp\u003EI\u0027ve not kept up with this game, but my brother really likes it and you can micromanage just about every aspect of running a sub.\u003C/p\u003E\n"}]}