{"TopicId":125529,"ForumId":18,"TopicTitle":"Vehicle Restoration","CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2015-11-15T15:41:41Z","PageNum":1,"Articles":[{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2015-11-15T15:41:41Z","Content":"\n\u003Cp\u003EHey guys, I turned 18 in May and in heireted a 1998, Dodge Ram 2500. This truck has a lot of memories for me and also I use it as my everyday truck to go to work and school etc.I\u0027ve kinda turned a blind eye towards the trucks problems until now. The engine and drive train are mechanically sound but the cooling system, steering, and suspension needs some work and I don\u0027t have the money to do it. So I started a \u0022GoFundMe\u0022 to try and raise support for getting work done to this truck and preserving memories that are extremely important to me. \u003C/p\u003E\u003Cp\u003EThank you for reading and if you would like to support me doing this [snip]\u003C/p\u003E\u003Cp\u003EAny support is appreciated thank you guys.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-15T22:58:32Z\u0022 title=\u002211/15/2015 10:58  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 15, 2015\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-11-15T15:49:15Z","Content":"\n\u003Cp\u003EThat\u0027s quite a bit to ask for, isn\u0027t it?\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2015-11-16T04:14:02Z","Content":"\nI\u0026#39;m looking at 2 grand just for body work, another 2 for paint, tires are 700. so not really lol\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-11-16T07:06:36Z","Content":"\nI understand that is the cost to fix this particular car, but the total amount is still significant. For what you are asking, to restore your 15yo car, you can buy a [I]very[/I] good used smaller one. Selling the Ram would probably cover it easily.\u003Cbr\u003E\nLet\u0026#39;s be honest here. You don\u0026#39;t need a 6L V8 to go to school. A bicycle will do just fine on a dry day and there is probably some public transportation too.\u003Cbr\u003E\nIf you can\u0026#39;t afford to maintain such an expensive car, you really should not have it. Seriously, that\u0026#39;s a life lesson you should have already learned.\u003Cbr\u003E\n\u003Cbr\u003E\nYeah, maybe somebody will donate you couple of hundred dollars, or you might somehow even meet the 7k goal, but what happens in couple of years when you need to service something else? You\u0026#39;ll ask for charity again? Don\u0026#39;t live above you income.\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-11-16T07:53:31Z","Content":"\n[quote name=\u0027Shpaget\u0027]I understand that is the cost to fix this particular car, but the total amount is still significant. For what you are asking, to restore your 15yo car, you can buy a [I]very[/I] good used smaller one. Selling the Ram would probably cover it easily.\u003Cbr\u003E\nLet\u0026#39;s be honest here. You don\u0026#39;t need a 6L V8 to go to school. [I][B]A bicycle will do just fine on a dry day and there is probably some public transportation too.[/B][/I]\u003Cbr\u003E\nIf you can\u0026#39;t afford to maintain such an expensive car, you really should not have it. Seriously, that\u0026#39;s a life lesson you should have already learned.\u003Cbr\u003E\n\u003Cbr\u003E\nYeah, maybe somebody will donate you couple of hundred dollars, or you might somehow even meet the 7k goal, but what happens in couple of years when you need to service something else? You\u0026#39;ll ask for charity again? Don\u0026#39;t live above you income.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nIt\u0026#39;s West Virginia. If you think you can go places on a bike in West Virginia, you\u0026#39;re completely insane. You\u0026#39;d have a better chance getting a 10 inch diameter rod to fit in a 1 inch diameter hole. It\u0026#39;s hillier than hell, it\u0026#39;s right in the middle of appalachia for goodness sakes. Places in WV are REALLY spaced out too. And Public Transport? Snowball\u0026#39;s chance in hell there\u0026#39;s any public transport in WV outside of the city, which he\u0026#39;s probably out of, because he inherited a pickup. Not everybody lives in a flat, well-maintained city. The winters in this part of the country suck too, I live 3 hours away from the north border of WV, and trucks are the best thing for them. And before you say about the road trucks with the salt, the trucks don\u0026#39;t get everywhere. In some places you have 45-50 degree inclines with ice on the roads. One time I got stuck on one and had to drive half on the road and on the grass while flooring the pedal to get up the hill.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, the guy\u0026#39;s 18. He just started out and he probably doesn\u0026#39;t have a bunch of money in his savings account. From his page, he\u0026#39;s a cashier. He doesn\u0026#39;t have a lot of money, PERIOD. I don\u0026#39;t think asking for money\u0026#39;s unreasonable at this stage of his game. And he has a lot of memories in it.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, 7499275, see if somebody you know will loan you the money. Just agree to pay them back once you get the cash. Or maybe ask for a part of the money and raise the rest yourself. And if it needs done right now, see if the bank will loan you something, you\u0026#39;ll have to pay a lot of interest on it, but at least your truck will be working. And, if you do some things yourself, you can save a lot. If you have an air compressor with a decent capacity tank (or could borrow one off a buddy), you can probably do the paint yourself with a sprayer. Just look up some instructions and go at it, if you screw up then at least you learned something and you know what you need to do next time. If you can put on the body panels yourself, you can save a little there, just stand them up on some blocks or get a buddy to hold them on while you bolt them in. You can even go to the junkyard and see if the trucks there have the part you need, and if they do, just take it home, clean it up, paint it, and you\u0026#39;re ready to bolt the sucker on. But don\u0026#39;t cheap out on the tires, you\u0026#39;ll waste money cheaping out on the tires.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, according the the Kelly Blue Book, using his description to put in the information, and using a Charleston, WV zip code, he could get around 2500-3000 bucks for his truck. In this economy, you can get a beater car that\u0026#39;d need the same amount of work for that money. It\u0026#39;s probably better to fix it up than to sell it.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-16T07:57:34Z\u0022 title=\u002211/16/2015 07:57  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 16, 2015\u003C/time\u003E by Flymetothemun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2015-11-16T08:40:20Z","Content":"\n[quote name=\u0027Shpaget\u0027]Yeah, maybe somebody will donate you couple of hundred dollars, or you might somehow even meet the 7k goal, but what happens in couple of years when you need to service something else? You\u0026#39;ll ask for charity again? Don\u0026#39;t live above you income.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nYou might not be surprised to learn he also needs about $700 to finish off his \u0026#39;badass\u0026#39; PC build.\u003Cbr\u003E\n\u003Cbr\u003E\n[video=youtube;tegai-1maas]https://www.youtube.com/watch?v=tegai-1maas[/video]\u003Cbr\u003E\n\u003Cbr\u003E\nIt occurs to me that 7499275 might be better off trying to raise the cash he needs via a patreon for his youtube channel or somesuch. It would certainly have more of an air of earning money for rendering a service, as opposed to what his current approach looks like.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-16T08:45:24Z\u0022 title=\u002211/16/2015 08:45  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 16, 2015\u003C/time\u003E by pxi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-11-16T17:00:47Z","Content":"\n[quote name=\u0027Flymetothemun\u0027]...[/QUOTE]\u003Cbr\u003E\nGoFundMe page says Port Orange, Florida.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027pxi\u0027]You might not be surprised...[/QUOTE]\u003Cbr\u003E\nNot terribly.\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-11-16T17:12:17Z","Content":"\n[quote name=\u0027Shpaget\u0027]GoFundMe page says Port Orange, Florida.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nNot terribly.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nOh, well looking at the topo map a bike would most definitely work in Port Orange. maybe he can stash the truck somewhere while he gets the money.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd bud, I\u0026#39;d focus on the truck rather than the computer.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-16T17:20:35Z\u0022 title=\u002211/16/2015 05:20  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 16, 2015\u003C/time\u003E by Flymetothemun\u003C/strong\u003E\n\u003C/span\u003E\n"}]}