{"TopicId":125655,"ForumId":18,"TopicTitle":"Computer can\u0026#039;t seem to handle KSP","CreatedByName":"QmVuamk","CreatedById":153675,"CreatedDateTime":"2015-11-16T20:07:54Z","PageNum":1,"Articles":[{"CreatedByName":"QmVuamk","CreatedById":153675,"CreatedDateTime":"2015-11-16T20:07:54Z","Content":"\nMy computer can\u0026#39;t seem to handle KSP even on the lowest graphics settings without dropping to about a frame every 3 seconds. I remember that it used to work fine, and I don\u0026#39;t know what I might have changed to cause this. The RAM and CPU usage don\u0026#39;t max out or anything, it just gets really slow all of a sudden. Any advice would be appreciated. Here are my specs:\u003Cbr\u003E\nLaptop: HP Pavilion 17\u003Cbr\u003E\nOS: Windows 10 64-bit\u003Cbr\u003E\nCPU: Intel Core i3-3130M @2.60 GHz\u003Cbr\u003E\nRAM: 8GB DDR3\u003Cbr\u003E\nGPU: Intel HD Graphics 4000\u003Cbr\u003E\nKSP Version: 1.0.4 32-bit\u003Cbr\u003E\nDisplay Size: 1600 x 900\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-11-16T20:25:10Z","Content":"\nIf it used to work, then either you installed some software or drivers that are misbehaving, or its full of fluff and overheating :)\n"},{"CreatedByName":"JTpopcorn","CreatedById":130311,"CreatedDateTime":"2015-11-16T20:43:06Z","Content":"\nKsp uses one core, so a quad core i5 may show it uses a maximum of 25% cpu. 8gb is enough ram. Intel hd 4000 isn\u0026#39;t enough for high graphics settings or lots of mods but stock should work.\u003Cbr\u003E\nIf you added mods, that might be the problem.\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2015-11-17T00:04:58Z","Content":"\nFirst try reproducing the issue and then check the output_log.txt file in the KSP_DATA folder to see if there is a large amount of repeated messages. Either way, please upload the file somewhere so we can have a look. Another thing to check, similar to the possible overheating issue described above, is that your computer may be set to a power saving mode. Make sure it is set to a Maximum performance mode rather than any sort of balanced or more saving mode. Some laptops have been known to throttle back the clock speed to well under 1 ghz even though KSP is trying to use a full core of cpu.\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-11-17T00:20:20Z","Content":"\nI stopped reading at Windows. Seriously though, you may have some malware. It runs rampant around Windows. Consider running a scan.\n"},{"CreatedByName":"X9Squared","CreatedById":149583,"CreatedDateTime":"2015-11-17T01:38:40Z","Content":"\n[quote name=\u0027QmVuamk\u0027]My computer can\u0026#39;t seem to handle KSP even on the lowest graphics settings without dropping to about a frame every 3 seconds. I remember that it used to work fine, and I don\u0026#39;t know what I might have changed to cause this. The RAM and CPU usage don\u0026#39;t max out or anything, it just gets really slow all of a sudden. Any advice would be appreciated. Here are my specs:\u003Cbr\u003E\nLaptop: HP Pavilion 17\u003Cbr\u003E\nOS: Windows 10 64-bit\u003Cbr\u003E\nCPU: Intel Core i3-3130M @2.60 GHz\u003Cbr\u003E\nRAM: 8GB DDR3\u003Cbr\u003E\nGPU: Intel HD Graphics 4000\u003Cbr\u003E\nKSP Version: 1.0.4 32-bit\u003Cbr\u003E\nDisplay Size: 1600 x 900[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nI bet this is probably not the problem, but check your Max Time per Delta-frame or Max frame per Delta-time (I still get those mixed up), if it\u0026#39;s set super low than your CPU may not be able to handle the frames. Also, 64-bit Windows is kinda... unfriendly to KSP. If none of this works, 1.1 may fix a lot of the performance issues.\n"},{"CreatedByName":"Violent Jeb","CreatedById":130681,"CreatedDateTime":"2015-11-17T18:41:32Z","Content":"\nI found that there is at least one rogue mod in 1.0.5 CKAN which caused my game to lag massively. I did a fresh re-install, and it seems to be fine now. I will be installing mods 1 by 1 for the meanwhile to try and identify the culprit and conflict.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, have you or do you use Active Texture Management? I\u0026#39;ve found that since ~ 0.9 it has been quite helpful at compensating for the high stock number of parts. It is required mod/utility #1 for me.\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-11-18T04:37:14Z","Content":"\nWe keep these kinds of the threads in the off-topic sub, and so, moved.\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-18T12:43:11Z","Content":"\nThat PC *should* run KSP well enough. First test using the bone stock game, but copy your usual settings.cfg over, if that\u0026#39;s fine your problem is a mod. Then check graphics drivers I\u0026#39;d say.\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-11-18T16:18:01Z","Content":"\n[quote name=\u0027CliftonM\u0027]I stopped reading at Windows. Seriously though, you may have some malware. It runs rampant around Windows. Consider running a scan.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nKSP runs, as it stands, best on Windows. These kinds of flames are unnecessary and harmful.\n"}]}