{"TopicId":128946,"ForumId":18,"TopicTitle":"HR gigerworld","CreatedByName":"Souper","CreatedById":86003,"CreatedDateTime":"2015-12-31T03:25:47Z","PageNum":1,"Articles":[{"CreatedByName":"Souper","CreatedById":86003,"CreatedDateTime":"2015-12-31T03:25:47Z","Content":"\n\u003Cp\u003E\nI\u0027mnot sure where to put this since i didn\u0027t see a forum or sub-forum suitable for writing. Oh well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI wonder if we attempted to vividly describe a world (and story) made entirely out of H.R giger\u0027s nightmarish art. (Rest in peace, my god of horror. If only you and HP Lovecraft could have seen eatchother...)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn the distant future, Humanity\u0027s technology becomes more and more integrated into biology to the point that structures were built out of masses of pipe-like tunnels of flesh and plastic wires. Mankind had overpopulated so much that the world became a desperate hellscape of starvation, violence and despair. Bodies filled the cold, grey landscape, which were collected and fed to construction machines to be turned into cities of dead tissue. Healthy humans, as seen today, are so rare and valuable that the disgusting, parasite creatures that slither and bounce off of round cages of bone and exposed marrow, made slippery by the grey blood of the bio-pipes dripping down on them would immediately impale and kill them to assimilate their high-quality components. Before these twisted times, a single male Human froze himself for a time long forgotten. He awakens to this anti-paradise and now seeks to put and end to the hideous creature that controls the biomechanical world so that thing may get back on track. Armed only with a Glock .45 pistol, he sets out on a long trek through a desert of nightmares.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow the fun part: You get to add to the story! \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-31T03:27:29Z\u0022 title=\u002212/31/2015 03:27  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 31, 2015\u003C/time\u003E by Souper\u003C/strong\u003E\n\u003C/span\u003E\n"}]}