{"TopicId":144361,"ForumId":18,"TopicTitle":"I have a really cool idea for KSP-like game!","CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-07-22T22:11:14Z","PageNum":1,"Articles":[{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-07-22T22:11:14Z","Content":"\n\u003Cp\u003E\nSo I was thinking about KSP and I like all the orbital mechanics and stuff, but I think it\u0027d be really cool to basically make another game out of the whole resource mining thing, and expand on that.  You have the exact same craft building system but it\u0027s built more around the idea of futuristic space travel, where you would use more \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003E\u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E\u003C/abbr\u003E style flight to take off, retract landing legs, and then fly quickly and seamlessly into space.  I don\u0027t know how you could deal with the orbital mechanics system to make things less tedious, but I\u0027m picturing basically taking off the launch pad and being in orbit in maybe 20 seconds.  I\u0027m tempted to say that orbital mechanics would be almost done away with, to save time for going to other planets and traveling around Kerbin(or other planet if made different).  But what I imagine is where for career mode you have like, X cargo to deliver from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E to Kerbin north pole, or something.  Then you build a freighter and load it up with premade cargo containers, and the cargo you take is taken from a stockpile of resources you have.  So you fill orders and make money to buy resources and then start mining your own resources and expand to other planets, etc.  But the whole orbital mechanics thing just kinda slows things down and makes them tedious.  It should take 15-20 seconds to get into space, not 5 minutes, for this type of game.  The only problem there is how you get to other planets.  Do you just \u0022point and shoot\u0022?  The idea that the planets are moving is too big of a fact to ignore for convenience and time, so I dunno.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut that\u0027s my basic idea, is just a trading/infrastructure type game that you have a career in but keep the sandbox aspect of building your own fleet of ships and stuff.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBy the way, I don\u0027t know if this is the right place for a topic like this, I felt that the suggestions section still didn\u0027t fit with this kind of idea.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet me know what you think, I\u0027d like to bounce some ideas around with other people, too!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-22T22:12:04Z\u0022 title=\u002207/22/2016 10:12  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 22, 2016\u003C/time\u003E by SlabGizor117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2016-07-22T22:26:24Z","Content":"\n\u003Cp\u003E\nSounds like you want something like Freespace, but with orbital mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure how you\u0027d get into orbit without timewarp, with a realistic profile, and in less than thirty seconds. If you don\u0027t want time-limitations, you\u0027d have something along the lines of mechjeb doing the piloting for you, and you can get \u0027point and shoot\u0027 transits with unlimited \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E... but at that point the only thing you\u0027re really keeping of orbital mechanics are the moving planets.\n\u003C/p\u003E\n"},{"CreatedByName":"Jimmidii","CreatedById":9293,"CreatedDateTime":"2016-07-22T22:32:23Z","Content":"\n\u003Cp\u003E\nSounds like you\u0027re looking for a game like Empyrion, or maybe Space Engineers, since they added planets.\n\u003C/p\u003E\n"},{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-07-22T22:48:50Z","Content":"\n\u003Cp\u003E\nFREESPACE!!! YES!! I love Freespace!  As far as space travel mechanics go, yes it would basically be like freespace, but you would build your own ships and do trading and mining and stuff.  I\u0027m thinking that as soon as you go from ground to space it\u0027ll just kinda magically put you into an orbit in whatever plane you were pointed in to start with, kinda like this:   \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/n2Ys7ETNdjw?start=703\u0026amp;feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt wouldn\u0027t really be anything more than a cinematic thing I think, to see Kerbin moving under you, because I want the Star Wars style physics for ships.  Speaking of which, it should also allow you to make big cruiser style ships.  Like you said, the only thing hard about point and shoot would be the motion of the planets, but I think you may be able to make the gameplay just that - in the map, select a planet and it\u0027ll give you a marker to point at to rendezvous with the planet in about 30 seconds, no year long time warp.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for Jimmidii, I actually haven\u0027t heard of Empyrion, but yeah the gameplay would be much like Space Engineers.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-22T22:51:50Z\u0022 title=\u002207/22/2016 10:51  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 22, 2016\u003C/time\u003E by SlabGizor117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ozzallos","CreatedById":34057,"CreatedDateTime":"2016-07-23T11:22:23Z","Content":"\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022https://www.dropbox.com/s/9oh63j3yrrmdpkl/Screenshot%202016-06-27%2023.10.18.png?raw=1\u0022 alt=\u0022Screenshot%202016-06-27%2023.10.18.png?r\u0022\u003EI cant make space inside 20 seconds, but i can do it in about a minute, minute and a half using 22 vertical takeoff rapiers. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-23T11:25:57Z\u0022 title=\u002207/23/2016 11:25  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 23, 2016\u003C/time\u003E by Ozzallos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-07-23T17:01:16Z","Content":"\n\u003Cp\u003E\nSince this is not about KSP, the thread has been moved to the off-topic Lounge. \n\u003C/p\u003E\n"},{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-07-24T19:36:43Z","Content":"\n\u003Cp\u003E\nOk!  Thanks, Vanamonde.\n\u003C/p\u003E\n"}]}