{"TopicId":145959,"ForumId":18,"TopicTitle":"A Participant\u0026#039;s Perspective on the Louisiana Flooding","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-15T04:21:10Z","PageNum":1,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-15T04:21:10Z","Content":"\n\u003Cp\u003E\nAs some of you know, I\u0027m a firefighter in Louisiana (aka \u0022Lousy Anna\u0022).  You all might also have heard that things have been a bit damp here lately, to say the least.  I only just got home (to a totally high and dry house) from working 62.25 hours straight as a result of that \u0022dampness\u0022.  My efforts to counteract with ethanol the residual adrenaline and caffeine in my system having so far failed, I figured I might as well vent to pass the time until I finally feel sleepy.  So here goes.\n\u003C/p\u003E\n\u003Cp\u003E\nFor them as don\u0027t know, starting in the wee hours of Friday, 12 August, and continuing most of that day, an unprecedented (in US history) deluge dropped on the \u0022laces\u0022 area of the \u0022boot\u0022 of Louisiana and adjacent areas of Mississippi.  I live on the NW edge of this area, about where you\u0027d knot the laces, and got 15 inches before noon.  Going west on my latitude, the rainfall in that  period increased up to about 2 feet in the middle of the \u0022laces\u0022 and then decreased to about 15 inches again by the top of the \u0022toe\u0022.  And it then kept on raining, although not quite as hard for such long periods of time.  Still, often it was hard to see the front end of my firetruck\u0027s hood (\u0022bonnet\u0022 to the Brits) and we mostly drove by Braille when responding to calls.  This is all to say, where I live we got some SERIOUS flash flooding and had to do quite a few rescues.  We also had 4 houses and 1 large church hit by lightning in the midst of this but, fortunately, it was raining so hard that no sustained fires resulted.  One of these houses was flooding at the time and we had guys inside it rescuing residents when it was hit, but apart from being momentarily blinded and deafened, nobody was hurt.  Basically, Friday and into early Saturday was our main time of it and that was so long ago (since I had a decent night\u0027s sleep, anyway), and so much has happened since, that it\u0027s all a blur now.\n\u003C/p\u003E\n\u003Cp\u003E\nSince then., we\u0027ve been licking our wounds and picking up pieces.  Meanwhile, all the rain we got up front has been oozing down various rivers and bayous onto the alluvial plain surrounding the peninsula of high ground I live on.  It has already and is continuing to spread beaucoup ruin as it flows south.  It differs from a hurricane in that there was no wind, so it wasn\u0027t even a named storm. This was all just a bad rain storm.  Most trees, and therefore most power lines, are still up. Also, no winds meant no flying debris, so rescuers by air, land,and flooded road could get in there immediately.  Still, it came from nowhere, instead of giving us several days to prepare like a hurricane does, and the downstream rivers are flooding way above any historical records. Many folks, relying on previous experience of not flooding, stayed put, and are now having to be rescued,  And then the storm moved west and did the same sort of thing to Lafayette and surrounding areas.  About half the state is flooded right now.\n\u003C/p\u003E\n\u003Cp\u003E\nMy thoughts are with all those who have lost everything in this.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-15T04:39:52Z\u0022 title=\u002208/15/2016 04:39  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 15, 2016\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2016-08-15T13:07:07Z","Content":"\n\u003Cp\u003E\nKudos to you for all the work you\u0027ve put in to help!\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-08-15T14:31:10Z","Content":"\n\u003Cp\u003E\nI never heard about that... I guess I\u0027m more out of touch than I thought. I hope it doesn\u0027t get any worse...\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-08-15T20:11:00Z","Content":"\n\u003Cp\u003E\nGo get some sleep, and stay away from alcohol for a bit. You need to be aware of your surroundings when working, and alcohol doesn\u0027t do that.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I\u0027m sure you already knew that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t imagine having to do that kind of rescue work. Stay safe.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-16T00:07:56Z","Content":"\n\u003Cp\u003E\nThanks for the kind words.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I slept in this morning (about 11 hours) and had a slight hangover.  I scoured the internet for info on what was happening elsewhere, drove around looking at local damage that I hadn\u0027t seen previously, then reported back into work in the early afternoon.  I was expecting to be given something to do, or be sent somewhere harder hit, but neither happened so I went back home (this being my normal day off).  Tomorrow I\u0027ll go around a couple of neighborhoods documenting damage.  As I understand things, my parish is or soon will be added to the federal disaster area and there\u0027s a LOT of paperwork to do about that.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my tour today, I took some pics which I\u0027ll get to in a minute.  But first, here\u0027s a map showing how much rain we got Friday and Saturday:  My bailiwick is in the red box.  I live in one of the gray spots in it that got 15\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://flic.kr/p/KfMAHy\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u002200 Rain Map\u0022 class=\u0022ipsImage\u0022 src=\u0022https://farm9.staticflickr.com/8330/28390668794_36c06d8058_b.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe problems in Baton Rouge and points east of the Mississippi River are due mostly to the rain that fell not just right there, but at my latitude and into Mississippi.  This area is the headwaters of all rivers that overflowed so much and flooded everybody out further south.  The flooding around Lafayette is from its own drainage systems on the other side of the Mississippi River.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is just an insane amount of rain in such a short period of time. Especially because about 3/4 of rain east of the Mississippi all fell Friday morning, and the bulk of the rain west of the Mississippi all fell Saturday.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, some local damage.  My bailiwick is a peninsula of high ground and hills surrounded on 3 sides by flood plain, so the water didn\u0027t pool up.  Instead, it quickly ran off down the various creeks and bayous.  These of course way overflowed their banks and wiped out whatever was close to them, but those were the only problem areas we had.  Most folks live on the ridges between waterways so only a small fraction of our total population is now homeless.  We also lost a few bridges, and apparently 1 idiot who decided to try kayaking at the height of the storm.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://flic.kr/p/KfMBAL\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u002201 Solitude Low Water Bridge\u0022 class=\u0022ipsImage\u0022 src=\u0022https://farm9.staticflickr.com/8548/28390671764_a4e40c50c7_b.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the \u0022low water bridge\u0022 (basically an improved ford) across Bayou Sara.  The water level is already back nearly to its normal level at this spot just 48 hours later, which is why this sorry excuse for a \u0022bridge\u0022 suffices.  However, at its height, the water line was about at eye level where I was standing when I took this pic.  Rather surprisingly, the bridge itself seems to have survived but the approaches on both ends are rather badly eroded.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://flic.kr/p/L3h275\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u002202 Jaycock Bridge\u0022 class=\u0022ipsImage\u0022 src=\u0022https://farm8.staticflickr.com/7774/28905456292_ec294ec2a2_b.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis bridge is on Jaycock Road where it crosses Alexander\u0027s Creek.  There is a subdivision and a trailer park on the high ground on the other side and this is only real way in or out for both, although there\u0027s a trail out the back passable by 4WD.  Thus, in the several days we normally have before a hurricane hits, we evacuate all these folks.  This time, we had no warning so they\u0027re all trapped, except for a few breadwinners who left early for work Friday morning.  However, these folks have all their utilities still running and their houses didn\u0027t flood, so they\u0027re not in danger.  We can get supplies in there to them (and some can get their own with personal 4WDs), and can get medics in there if needed.  The main problem is, we can\u0027t get a fire truck in there so hopefully none of them will get stupid with fire until the bridge gets fixed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://flic.kr/p/KfMB6N\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u002203 Flower Hill\u0022 class=\u0022ipsImage\u0022 src=\u0022https://farm9.staticflickr.com/8472/28390670084_132066ce52_b.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis house is in the Flower Hill neighborhood at the confluence of Big and Little Bayou Sara.  As you can see, it was moved about 30 yards off its foundations by a colossal flow moving from right to left.  All the houses in this neighborhood (about 20) got about 5 feet of water in them.  We evacuated all these people when the water was only about 1-2 feet deep here, so nobody got hurt when this happened.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://flic.kr/p/L3h1ow\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u002204 Site of Marydale Rescue\u0022 class=\u0022ipsImage\u0022 src=\u0022https://farm8.staticflickr.com/7714/28905453882_7f45f15713_b.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is Marydale Road where it crosses Alexander\u0027s Creek.  At the height of the flood, the water level was even with the bridge deck in the background so was about 6\u0027 deep in the low area in the foreground.  Note that the creek bed is about 20 feet deep below the bridge and normally has only a trickle in it.  This is the east side of the bridge and there\u0027s a similar low spot on the west side, although it\u0027s only about 2-3 feet below the bridge deck.  Anyway, Friday afternoon at the height of the flood, a kid waded the west part, walked across the bridge, and tried to wade this part.  He didn\u0027t make it and got washed into the woods on the left side of the road about even with the sign, where he clung to a tree.  Fortunately, he had a less-adventurous friend who called for help.  So 8 of us got on a rope, 7 in a line from this end of the bridge out into the deep area, then fed the 8th guy out on the end of the rope to the kid.  He got a life jacket on the kid, tied him to the rope, and then we hauled them both back.  This operation took only about 10 minutes from arrival to completion and was the only bit of semi-derring-do in my area.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://flic.kr/p/L3gZNU\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u002205 Island Rd RR Bridge\u0022 class=\u0022ipsImage\u0022 src=\u0022https://farm9.staticflickr.com/8835/28905451932_88c5aa5099_b.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is what we called the \u0022Railroad Bridge\u0022, not because it was for trains but because the deck of the bridge was made of 3 old flatcars in classic \u0022redneck engineering\u0022 style.  It was on Island Road over Williams Creek.  Needless to say, it didn\u0027t survive.  Fortunately, both ends of Island Road. are accessible from other roads so this isn\u0027t as much of an inconvenience as the Jaycock Road bridge.\n\u003C/p\u003E\n\u003Cp\u003E\nThe good news is that the main bridge of US Hwy 61 over Thompson Creek is OK, despite having been totally submerged for a while.  Initial reports were that it had been damaged, which would have been a big problem because it\u0027s the main supply route into my bailiwick.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, that\u0027s about the it for my bailiwick.  At some point I might be sent down to the major disaster area to give some local fireman a break but that\u0027s not in the immediate future.  Again, all thoughts and prayers to all the thousands who have it so much worse.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-16T00:18:00Z\u0022 title=\u002208/16/2016 12:18  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 16, 2016\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-08-16T00:20:51Z","Content":"\n\u003Cp\u003E\nMississippi is literally only a state away from where I (and tens of thousands of others) live... Damn, that\u0027s insane.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-16T00:21:24Z\u0022 title=\u002208/16/2016 12:21  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 16, 2016\u003C/time\u003E by Bill Phil\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Andem","CreatedById":155578,"CreatedDateTime":"2016-08-16T02:29:26Z","Content":"\n\u003Cp\u003E\nI saw some footage of a woman and her dog in a convertable nearly drowning and getting rescued. Terrifying.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-08-16T02:45:10Z","Content":"\n\u003Cp\u003E\nRain.\n\u003C/p\u003E\n\u003Cp\u003E\nI think we\u0027ve all had enough of these random \u0022hey, surprise!\u0022 storms this year. Here in two weeks I\u0027m headed back home (West Virginia) to survey our damage (which doesn\u0027t seem to be too bad compared to some), but I _was_ planning to go the Southern route. Guess I\u0027m driving across Tennessee instead. \n\u003C/p\u003E\n\u003Cp\u003E\nGlad to hear you\u0027re afloat and mostly dry. That rainfall map coloring is wild - it gets so bad that it wraps back around to nothing (from white to white).\n\u003C/p\u003E\n\u003Cp\u003E\nRain.\n\u003C/p\u003E\n\u003Cp\u003E\nGuess it\u0027s better than nothing.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-16T04:32:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222718597\u0022 data-ipsquote-contentid=\u0022145959\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471315510\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think we\u0027ve all had enough of these random \u0022hey, surprise!\u0022 storms this year. Here in two weeks I\u0027m headed back home (West Virginia) to survey our damage (which doesn\u0027t seem to be too bad compared to some), but I _was_ planning to go the Southern route. Guess I\u0027m driving across Tennessee instead. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow, I hope nothing\u0027s too bad up on WV.  Good luck with that.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to traversing this part of the world in 2 weeks, ask me closer to the time.  The water will be long gone, the interstates probably didn\u0027t take much damage, there\u0027s not a lot of debris to clear away (other than flooded cars), and the utilities mostly still work.   Thus, bringing in relief supplies and removing non-essential refugees will be well advanced by then, and getting the gas stations and grocery stores back online is always the highest priority, because everything else in the community relies on them.  So I figure in 2 weeks, you should be able to pass through here no problem.  There will certainly be a lot of traffic (relief supplies coming in, junk and refugees going out) and prices might be a bit high, but you should be OK.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat rainfall map coloring is wild - it gets so bad that it wraps back around to nothing (from white to white).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I noticed that, too.  Never seen the like.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-16T15:51:47Z\u0022 title=\u002208/16/2016 03:51  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 16, 2016\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Atlas2342","CreatedById":155194,"CreatedDateTime":"2016-08-16T14:53:56Z","Content":"\n\u003Cp\u003E\nSeeing as I live in the Philippines, once hit by Typhoon Haiyan, one of the strongest storms recorded, I understand the feeling of seeing the damage around you. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022 rel=\u0022\u0022\u003E@Geschosskopf\u003C/a\u003E, my thoughts go out to you (being a firefighter is really hard) and to those affected...\n\u003C/p\u003E\n"},{"CreatedByName":"Angelo Kerman","CreatedById":106975,"CreatedDateTime":"2016-08-16T15:28:40Z","Content":"\n\u003Cp\u003E\nGlobal climate change is causing a real mess. California and the southwest are getting epic drought, while where you\u0027re at is getting torrential rain. Thank you for your service, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022 rel=\u0022\u0022\u003E@Geschosskopf\u003C/a\u003E, were it not for folks like you, people would have it even worse.\n\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2016-08-17T02:24:47Z","Content":"\n\u003Cp\u003E\nSome things are just beyond words.  I wish you well.  I can\u0027t do much but I have contributed to a charity which has a proven track record of helping people during such emergencies.  I recommend that if possible, people learn about well established charities and contribute; even if it is only a small amount.  These small amounts can add up to making  significant help to others in need.\n\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2016-08-17T03:02:40Z","Content":"\n\u003Cp\u003E\nWe had a pretty bad windstorm here last year. Winds reached 100 miles an hour, and it was rain and lightning all over. The power went out a few moments before the brunt of the storm came. The trees in the backyard tipped over and either hit the ground or someone else\u0027s house. The tree that hit the house opened up a huge gap in the roof, and the people had to patch it up with tarp. The firefighters had to come to help in the neighborhood after, and they also had to put out a small fire due to the electric wires snapping. \n\u003C/p\u003E\n\u003Cp\u003E\nThank you for helping in that storm. Even though I live 1,500 miles away, this storm was shocking. I\u0027m glad we have such a wonderful person on the forums.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-17T16:10:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222719705\u0022 data-ipsquote-contentid=\u0022145959\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471400687\u0022 data-ipsquote-userid=\u002278707\u0022 data-ipsquote-username=\u0022Dispatcher\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Dispatcher said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI can\u0027t do much but I have contributed to a charity which has a proven track record of helping people during such emergencies.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks.  There are tens of thousands of folks in dire need and every little bit helps.  But as you say, be sure to vet the charity because such disasters always attract scam artists to set up fake charities to make themselves rich rather than helping the victims.\n\u003C/p\u003E\n\u003Cp\u003E\nDonating is pretty easy these days.  Many of the major, reputable charities now have very simply ways to donate.  You just text a special phrase to a certain number and a small amount (like $10) gets added to your phone bill and goes to that charity for use specifically on this particular disaster.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222719733\u0022 data-ipsquote-contentid=\u0022145959\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471402960\u0022 data-ipsquote-userid=\u0022138353\u0022 data-ipsquote-username=\u0022HoloYolo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, HoloYolo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThank you for helping in that storm.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks for the props.\n\u003C/p\u003E\n\u003Cp\u003E\n--------------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, an update as of the morning of Wednesday 17 August....\n\u003C/p\u003E\n\u003Cp\u003E\nIn the big picture, I really don\u0027t know what\u0027s happening in the Lafayette area because my TV news comes out of Baton Rouge so is, of course, focused on local events.  But in the Baton Rouge area, the water has largely drained away at the latitude of Baton Rouge so from there north is now in recovery mode.  However, this just means the water is now further south, where it\u0027s still overrunning new neighborhoods and rescues are still going on down there.  This will probably continue for another day or 2 before the water finally dumps into Lake Maurepas to the NW of New Orleans.  See, the Mississippi River runs SE from Baton Rouge to New Orleans and the several smaller rivers, the ones that overflowed and flooded everybody, run parallel to the Mississippi instead of dumping into it.  And people live all long them, so this is going to keep happening all the way to the mouths of the smaller rivers.\n\u003C/p\u003E\n\u003Cp\u003E\nWith the water now gone in the northern area, folks can get back in there and begin assessing damage and starting repairs and recovery.  This has started firming up the numbers on the size of this disaster.  The most shocking number I heard was that about 85% of all homes in Livingston Parish (2010 population over 128,000) were \u0022totally destroyed\u0022, although AFAIK from pictures (I haven\u0027t been there myself) they\u0027re still standing.  So I take this to mean all the contents ruined and the house requiring all the wall board and flooring replaced, but still structurally sound.  Anyway, folks are now going back home in these areas and trying to make the best of the situation.  Already the sidewalks of Denham Springs are taking on the typical Louisiana post-storm look.of piles of soggy sofas, mattresses, carpets, and ruined refrigerators as people start cleaning out their houses.  And this is just 1 of the 20 parishes (including mine) now in the federal disaster area.\n\u003C/p\u003E\n\u003Cp\u003E\nSo obviously there\u0027s a HUGE number of people severely impacted by this, certainly well over 100,000.  Many of these folks have nothing but the clothes on their backs..  And while relief efforts largely focus on filling their personal survival needs, that\u0027s really only the tip of the iceberg here in terms of long-term recovery.  Just as so many houses flooded, so did all the adjacent businesses and schools.  Even if charities, FEMA, and insurance help them get their households back online, many of these people aren\u0027t going to hang around if they have no job and their kids can\u0027t go to school.  So I suspect that, just as about half the pre-Katrina population of New Orleans never returned there, there will be a large and permanent exodus from this disaster area.  We might even see a net population drop in my own, high-and-dry bailiwick, simply because we\u0027re mostly a bedroom community for Baton Rouge, so many of our residents have lost their jobs.  But OTOH, we have functioning schools with high reputations within the state (but with Louisiana usually ranking about 49th out of 50 in public education, isn\u0027t really saying much), so we\u0027ll probably see some influx for that reason.  But there will be a lot of major disruptions over a this whole region for a long time to come.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m very curious as to what FEMA will do this time around to provide temporary housing.  Back in Katrina, there were the now-infamous \u0022FEMA Trailers\u0022, which were small, cheap, shoddily built, and lacking many normal health-and-safety features.  They were so poorly made that they started falling apart after a few weeks.  Some folks used these as intended, parked in their driveways while they rebuilt their real homes, and that worked OK.  But quite a few Katrina refugees from New Orleans came from public housing and had been unemployed before the storm.  They had nothing of their own to go back to, no control over rebuilding their former homes, and no ability to better their situations, so for them the trailers became permanent quarters.  Soon the vast refugee trailer parks planted around the region sank into abject squalor and much more suffering and associated crime ensued.  Yesterday, I heard the governor and the local FEMA honcho saying they were NOT going to repeat that, but \u0022no plans were in place\u0022 for what they were going to do instead.  That\u0027s a bit ominous.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m still trying to wrap my head around the amount of water that suddenly dumped on us the other day.  The number of acre-feet is just off the charts.  They say this was a \u00221000-year flood\u0022.  The small rivers all exceeded their previous all-time record levels by about 5 feet.  Considering that the land around them is very flat, 5 feet of height makes a huge amount of extra width, which is why so many places that had never come close to flooding before got flooded this time.  And there\u0027s still no official name for this disaster.  Some are calling it the \u0022Great Flood\u0022, some the \u0022Historic Flood\u0022, some the \u0022Big Rain\u0022, and several others.  Hurricanes are less confusing because they have their own unique names.\n\u003C/p\u003E\n\u003Cp\u003E\nDown at the small picture level, I have today off.  I spent yesterday going door-to-door documenting damage to personal property (houses, cars, etc.) in areas away from the creeks and bayous.  My parish is a huge pile of Pleistocene loess so has lots of little terrain undulations across the surface.  When a large tract of land gets broken up into subdivision lots, some of these lots necessarily are in the low spots between little hills.  Rain runoff goes to these low spots but they have storm drains so this isn\u0027t usually a problem.  However, this storm made so much rain so fast that it overwhelmed the drain systems, so a number of these lower houses got some water in them, from a few inches to about 1 foot.  That\u0027s not nearly as bad as flooding to the window sills or higher, but it\u0027s still a serious problem for the residents.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, things have calmed down a lot where I live and are starting to get back to normal.  Most of our spare bedrooms and all our motel rooms are full, and the schools are trying to figure out how many more students they can handle.  Meanwhile, we still await possible deployment to other places.\n\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2016-08-26T09:55:18Z","Content":"\n\u003Cp\u003E\nAll this happened while I was out of town last week; it was around yesterday I thought \u0022hey, Geschosskopf must be waist deep in mulch rescuing people down there in le armpit\u0022 Thanks for keeping us up to date with these mission reports, glad you\u0027re safe and may FEMA be with you \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2016-08-26T11:42:41Z","Content":"\n\u003Cp\u003E\nHow did I miss this thread?\n\u003C/p\u003E\n\u003Cp\u003E\nThis sounds just like when Debbie hit us a couple years ago. We came out OK, but the houses just a couple blocks away were devastated. I wish there was something I could do, or someway I could help, other than just saying I know how you feel... I really do.\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2016-08-27T14:58:03Z","Content":"\n\u003Cp\u003E\nWhat a disaster! I live below sea level and i am very close to the sea. My house could be under water in 10 years. You are a hero for helping against the flood!\n\u003C/p\u003E\n"}]}