{"TopicId":14655,"ForumId":18,"TopicTitle":"Science is not about seaking truth anymore","CreatedByName":"ronnronn","CreatedById":9730,"CreatedDateTime":"2012-07-19T17:26:51Z","PageNum":1,"Articles":[{"CreatedByName":"ronnronn","CreatedById":9730,"CreatedDateTime":"2012-07-19T17:26:51Z","Content":"\n\u003Cp\u003EIt seem that this day in age science, is no longer about the search for truth. It is a search for funding, and a quest for followers.\u003C/p\u003E\u003Cp\u003EYes thats right, scientists are usualy the most narcissistic people on the face of the earth. A good example is if you try to discus a theory of theres against conflicting data, they become extreamly defensive, and refuse to answer the challenges. instead they pull on the degrees they have aquired over the years, and compare them to your education. I just spent 45 min trying to get a strait answer out of an evolutionist. OMFG this was the worst 45 min of conversation Ive ever had!\u003C/p\u003E\u003Cp\u003EI asked him about a discrepancy in a basic charactureistic that must take place in a lifeforms dna that would allow a speices to change its number of chromozones.\u003C/p\u003E\u003Cp\u003EHe responded that this kind of science was above my head!\u003C/p\u003E\u003Cp\u003ESo after explaning that I understood enough about biology, biochemistry, and gennetics to run rings around him, and after proving this to him by means of explaning genetic process that he had no clew about the function or even discovery ther of. I again asked him to explane how a creature could change its number of chromozones? DNA and RNA have an intresting safeguard, that prevents any cross breeding of species with differing genetic codes especialy those with different numbers of chromozones. All living creatures plants and even bacteria poses this trait, so for a species to jump to a high or lower number of cromozones, there would have to be several of them doing it at the same time, or they would have to reproduce A-sexualy.\u003C/p\u003E\u003Cp\u003EDoes this sound unreasonable to any of you? Because it p!22ed him right off. He became unreasonable, and verbaly offensive. The part I couldnt under stand is, is he started bringing religion into the discussion, saying: \u0027Your just upset that science has dissproved the existance of your pitifull God!\u0027 Realy? Thats whats I said? Hmm....\u003C/p\u003E\u003Cp\u003ESorry to to write so much, but Id like to get a reasonable persons point of view on this.\u003C/p\u003E\n"},{"CreatedByName":"flying_chair","CreatedById":10362,"CreatedDateTime":"2012-07-19T17:32:12Z","Content":"\n\u003Cp\u003EDat evolutionist is a rude guise.\u003C/p\u003E\n"},{"CreatedByName":"ronnronn","CreatedById":9730,"CreatedDateTime":"2012-07-19T17:39:59Z","Content":"\n\u003Cp\u003EYeah and the thing is Ive never discused faith or relig around him or said anything about my relig or lack there of.\u003C/p\u003E\u003Cp\u003EHonestly it had no bearing on the issue i was raising. it seam this day in age that its easyer to defend your theory than to to try to prove how something realy works.\u003C/p\u003E\u003Cp\u003EThere are a lot of gaps in a lot of theories, its doesn\\\u0027t make them wrong, but you should at least be willing to find out why theres a gap and how it can be explained, not get upset when somone points it out. He told me hes going to talk with my prof\\\u0027s and see what they have to say about my attitude.\u003C/p\u003E\n"},{"CreatedByName":"Phoenix Aerospace","CreatedById":26120,"CreatedDateTime":"2012-07-19T18:04:34Z","Content":"\n\u003Cp\u003E Calm down there, ronnronn. I agree that he was rude, and that his actions were completely unrequited, but let\\\u0027s try not to flare up. The way we set things up, imo , that is that things cost money in this world, this is the way we have to go about things. Before we can go chasing the truth, you have to go chase grants. Also, from my experience, it\\\u0027s natural for people to want to defend their ideas. It\\\u0027s human nature when confronted with new ideas, and yes, I agree that it may not be the greatest thing either. Also, is this how every scientist you\\\u0027ve talked to reacts, or is it just him?\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2012-07-19T18:18:14Z","Content":"\n\u003Cp\u003E He might have responded badly because you regurgitated some arguments you clearly don\\\u0027t understand from a creationist website somewhere.\u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-07-19T19:30:10Z","Content":"\n\u003Cp\u003EAre you also a scientist? Explaining a process that he doesn\\\u0027t know about doesn\\\u0027t make you more intelligent.\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-07-19T19:41:51Z","Content":"\n\u003Cp\u003EAbout differing numbers of chromosomes:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/zi8FfMBYCkk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIgnore the slight battle against creationists, I\\\u0027m just pointing out that we seem to have evidence that chimpanzee chromosomes merged together, giving humans 23 pairs of chromosomes vs. chimpanzee\\\u0027s 24 pairs.\u003C/p\u003E\u003Cp\u003EThat\\\u0027s one way chromosome numbers could change.\u003C/p\u003E\u003Cp\u003EOther than that, I would say it really just comes down to freak genetic occurances/mutations ya know?\u003C/p\u003E\u003Cp\u003EUsually it\\\u0027s pretty fatal, but every now and then it\\\u0027s not\u003C/p\u003E\n"},{"CreatedByName":"Naiba","CreatedById":3221,"CreatedDateTime":"2012-07-19T19:54:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ronnronn\u0022 data-cite=\u0022ronnronn\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Ean evolutionist\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo... Was this just some random guy you met on the street? Or worse, the internet?\u003C/p\u003E\u003Cp\u003EThere\\\u0027s no such thing as an evolutionist.\u003C/p\u003E\n"},{"CreatedByName":"ronnronn","CreatedById":9730,"CreatedDateTime":"2012-07-19T20:05:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E Calm down there, ronnronn. I agree that he was rude, and that his actions were completely unrequited, but let\\\u0027s try not to flare up. The way we set things up, imo , that is that things cost money in this world, this is the way we have to go about things. Before we can go chasing the truth, you have to go chase grants. Also, from my experience, it\\\u0027s natural for people to want to defend their ideas. It\\\u0027s human nature when confronted with new ideas, and yes, I agree that it may not be the greatest thing either. Also, is this how every scientist you\\\u0027ve talked to reacts, or is it just him?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo its not just him. A cpl physics professors I have met have also taken a harsh view toward anyone who raises another answer to theire theories.\u003C/p\u003E\u003Cp\u003EAs to regurgitating creationists ideas... ah no, my theory is that for a species to reproduce after going through a genetic alteration, would require that the DNA of older species had lower leveles of the safe guards we have in living animal today allowing for more mutation of a species, but also making it more likely to produce physical retardation. this would allow for drastic changes in genetic structure and physical form, then after a certain point the dna would start hardening itself against chainge, or to make it simple those form best adapted to survival in ther environment \u003C/p\u003E\u003Cp\u003Ewould breed enough to cause the genetic code to rule out all other posabilities, also this give way to the idea that Vast numbers of species would have made the transition from water to land, not just one or two.\u003C/p\u003E\n"},{"CreatedByName":"Cthulufaic","CreatedById":6660,"CreatedDateTime":"2012-07-19T20:05:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Naiba\u0022 data-cite=\u0022Naiba\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo... Was this just some random guy you met on the street? Or worse, the internet?\u003C/p\u003E\u003Cp\u003EThere\\\u0027s no such thing as an evolutionist.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes there are. There are still people who believe in Creationism, and those are called Creationists and those who believe in Evolution are called Evolutionists.\u003C/p\u003E\n"},{"CreatedByName":"ronnronn","CreatedById":9730,"CreatedDateTime":"2012-07-19T20:06:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Naiba\u0022 data-cite=\u0022Naiba\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo... Was this just some random guy you met on the street? Or worse, the internet?\u003C/p\u003E\u003Cp\u003EThere\\\u0027s no such thing as an evolutionist.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe teaches evolutionary science, and biological history. Met him at UTA. His degree is in evolutionary biology\u003C/p\u003E\n"},{"CreatedByName":"shadowfax","CreatedById":3742,"CreatedDateTime":"2012-07-19T20:16:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cthulufaic\u0022 data-cite=\u0022Cthulufaic\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYes there are. There are still people who believe in Creationism, and those are called Creationists and those who believe in Evolution are called Evolutionists.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople with Down\\\u0027s syndrome can occasionally reproduce. They generally have an extra chromosome. The fact that they can reproduce invalidates your argument that evolution doesn\\\u0027t work because of different numbers of chromosomes. \u003C/p\u003E\u003Cp\u003EYou must understand that science is and has been under continuous assault by religion since before Galileo. Those of us on science\\\u0027s side get awfully tired of hearing the same, wrong, arguments trying to disprove scientific findings from a platform of ignorance. If you have something real to add to the scientific discovery, scientists will often listen, but if you\\\u0027re just repeating the same thing thousands of other people have said, and that have already been dismissed, then I don\\\u0027t blame them all that much for getting annoyed. \u003C/p\u003E\u003Cp\u003EFurther, you were rude first: \u0027So after explaning that I understood enough about biology, biochemistry, and gennetics to run rings around him...\u0027 That\\\u0027s not exactly a polite way to state your case - it\\\u0027s basically saying \u0027I don\\\u0027t care what you\\\u0027ve studied your whole life, you\\\u0027re a dumbass, and I know more about it than you, so shove it.\u0027 I\\\u0027m not at all surprised that you irritated the guy. \u003C/p\u003E\u003Cp\u003EI\\\u0027ll also note that you have yet to tell us *your* qualifications. What are they, that makes you more qualified than an evolutionary biologist to speak on evolution?\u003C/p\u003E\n"},{"CreatedByName":"closette","CreatedById":11773,"CreatedDateTime":"2012-07-19T20:19:14Z","Content":"\n\u003Cp\u003EPlease don\\\u0027t judge all scientists by a few bad apples. Being rude and defensive doesn\\\u0027t make them wrong and you correct of course, and I think you realize that. Nevertheless, NO SCIENTIST SHOULD BE OFFENDED WHEN THEIR FUNDAMENTAL ASSUMPTIONS ARE QUESTIONED. And it should not matter who is asking the question or how many letters anyone has after their name. That\\\u0027s how our understanding of the Universe itself \u0027evolves\u0027. \u003C/p\u003E\u003Cp\u003EHaving said that, science is a human activity, and has its flaws, such as tying either \u0027being first to discover\u0027 or \u0027confirming the status quo\u0027 to putting food on the table (which is what \u0027funding\u0027 ultimately boils down to). I have seen, and felt pressure from myself, examples of confirmation bias which really made me stop and think \u0027Is this worth confronting an egotistical supervisor to mention?\u0027. Not a good situation, so I got out fast.\u003C/p\u003E\u003Cp\u003EI\\\u0027m sorry you were treated rudely and hope you can continue asking great questions. I don\\\u0027t know much about biology...but I do know that there are many questions about evolution that still need to be explored, and you have every right to ask away, as long as you keep an open mind to the responses.\u003C/p\u003E\n"},{"CreatedByName":"Sordid","CreatedById":535,"CreatedDateTime":"2012-07-19T20:23:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ronnronn\u0022 data-cite=\u0022ronnronn\u0022\u003E\u003Cdiv\u003EDNA and RNA have an intresting safeguard, that prevents any cross breeding of species with differing genetic codes especialy those with different numbers of chromozones.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFalse, hybrids between animals with different numbers of chromosomes are possible and in fact there are many examples. The best known of these is the mule, which has 63 chromosomes while its parents have 64 and 62. Their fertility is poor, yes, more so in males, but there have been dozens of documented cases of female mules giving birth to offspring when mated with a pure horse or a pure donkey.\u003C/p\u003E\u003Cp\u003EI\\\u0027m shocked that one so well-versed in biology as you does not know this.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2012-07-19T20:30:38Z","Content":"\n\u003Cp\u003EChrist. Generalization much, ronnronn...?\u003C/p\u003E\n"},{"CreatedByName":"Rascal Nag","CreatedById":9451,"CreatedDateTime":"2012-07-19T20:49:27Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://scienceblogs.com/pharyngula/2008/04/21/basics-how-can-chromosome-numb/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://scienceblogs.com/pharyngula/2008/04/21/basics-how-can-chromosome-numb/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERead it, ronnronn.\u003C/p\u003E\u003Cp\u003EYou don\\\u0027t seem to be as proficient in biology as you flaunted yourself to be.\u003C/p\u003E\n"},{"CreatedByName":"bradx954","CreatedById":14466,"CreatedDateTime":"2012-07-19T20:53:19Z","Content":"\n\u003Cp\u003Elol someguy pisses you off and you decide to rage about it on the ksp forums? If you are just looking for someone to say yeah your right your the smartest guy on earth fine yeah your right and your the smartest guy on earth. Feel better?\u003C/p\u003E\n"},{"CreatedByName":"Yorik","CreatedById":3479,"CreatedDateTime":"2012-07-19T21:19:33Z","Content":"\n\u003Cp\u003EInterestingly, there\\\u0027s an ant that only needs a single chromosome pair to reproduce: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Jack_jumper_ant\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Jack_jumper_ant\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"RayneCloud","CreatedById":11227,"CreatedDateTime":"2012-07-19T21:24:26Z","Content":"\n\u003Cp\u003EYeah...this wont end well. Locked.\u003C/p\u003E\n"}]}