{"TopicId":150332,"ForumId":18,"TopicTitle":"Alpha Centauri","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2016-10-19T01:33:40Z","PageNum":1,"Articles":[{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2016-10-19T01:33:40Z","Content":"\n\u003Cp\u003E\nSo, I\u0027ve been playing a bit of the old 4X game Sid Meier\u0027s Alpha Centauri a lot lately (by the way, if you don\u0027t have it they sell it on Steam, and GOG.com has regular sales of it) and felt like discussing it with other Kerbalites...\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully it\u0027s within the subforum rules to discuss this old game here?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, Alpha Centauri was a game and a work of science fiction far ahead of its time in many ways.  It powerfully envisioned the future in such a compelling way I still find myself quoting it from time to time (and I don\u0027t usually quote games).  Here is one of my favorite quotes from the game, for instance:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Human behavior is economic behavior.  The particulars may vary, but competition for limited resources remains a constant.  Need as well as greed have followed us to the stars, and the rewards of wealth still await those wise enough to recognize this deep thrumming of our common pulse.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n- CEO Nwabudike Morgan, \u0022The Ethics of Greed\u0022 -\n\u003C/p\u003E\n\u003Cp\u003E\nThere are many other interesting and thought-provoking quotes in this game on everything from how to fight a war, to the nature of liberty.  For instance:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Beware of he who seeks to deny you access to information, for in his heart, he dreams himself your master.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n- Commissioner Pravin Lal, \u0022U.N. Declaration of Rights\u0022 -\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EI\u0027lI have to post audio clips of the in-game readings of these quotes some time, because Alpha Centauri\u0027s voice acting is simply superb.  Anyways, for now that should be enough to bring back a few memories and stimulate some discussion.  Go forth and converse!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ERegards,\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ENorthstar\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-19T02:01:55Z\u0022 title=\u002210/19/2016 02:01  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 19, 2016\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-10-19T07:51:05Z","Content":"\n\u003Cp\u003E\nThis was my first addictive PC game. Yeah, the faction leaders are nice stereotypes, almost comic style. Well done by the game creators :-)\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-10-19T08:18:09Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222811898\u0022 data-ipsquote-contentid=\u0022150332\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221476840820\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnyways, Alpha Centauri was a game and a work of science fiction far ahead of its time in many ways.  It powerfully envisioned the future in such a compelling way\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed. Fantastic game. And speaking of quotes, I was always rather fond of this one from the good Provost:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Man\u0027s unfailing capacity to believe what he prefers to be true rather than what the evidence shows to be likely and possible has always astounded me. We long for a caring Universe which will save us from our childish mistakes, and in the face of mountains of evidence to the contrary we will pin all our hopes on the slimmest of doubts.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHeard after researching \u0027Intellectual Integrity\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nDarn you Northstar - time to dig out my copy of SMACX tonight. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2016-10-19T13:11:26Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003EGreat game.\u003C/em\u003E I liked how, even after the game was \u0027over\u0027, you could keep on playing.\n\u003C/p\u003E\n\u003Cp\u003E\nAlways loved the Nietzsche quotes (Homo Superior).\n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2016-10-19T13:47:41Z","Content":"\n\u003Cp\u003E\nAgreed, it\u0027s one of my favorites as well...  \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-10-19T15:49:04Z","Content":"\n\u003Cp\u003E\nGo on then - I\u0027ll bite. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhich were your favourite factions and why? We\u0027ll go with vanilla SMAC rather than SMACX for now - mainly because I don\u0027t recall a lot about the expansion factions.\n\u003C/p\u003E\n\u003Cp\u003E\nActually, I\u0027ll start by flipping that on it\u0027s head. My least favourite factions were the Spartans, the Believers and the Peacekeepers. Ideologically I wasn\u0027t much for the first two - and I found them difficult to play as well. Not really a surprise since  I always preferred a builder type game to an early military, conquest style game. The Peacekeepers, I could completely get behind but they were the classic jack of all trades, master of none, so I found them quite dull to play.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-10-20T00:35:52Z","Content":"\n\u003Cp\u003E\nI seem to be the only person in the world who did not like this game. \n\u003C/p\u003E\n\u003Cp\u003E\nFirstly, in every game I played, the hyper-aggressive Believer faction would ignore nearby rivals and make a beeline straight to my faction, make demands, and then start a war when I didn\u0027t give in to their attempts at extortion. And then, following the habit of altogether too many game AIs, they would refuse to make peace, no matter how badly I was beating them, so that the only way to end the war was to kill the entire faction off entirely. Very aggravating and tedious. \n\u003C/p\u003E\n\u003Cp\u003E\nSecondly, the Civilization family of games are all driven by economic/industrial growth, and then in the late game, you suffer environmental penalties for having a highly developing industrial base. In the others, though, it was a relatively minor problem. it didn\u0027t spoil the game for me. But in SMAC, the result was that you would be targeted by a never-ending succession of mindworm attacks, and it would just keep getting worse until my nation was either crippled by the constant fighting, or by having to dismantle enough of my industry to be acceptable to the damned worms again. \n\u003C/p\u003E\n\u003Cp\u003E\nI \u003Cem\u003Ereally \u003C/em\u003Edid not like that game. Yes, I know. I\u0027m the only one. \n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-10-20T08:14:38Z","Content":"\n\u003Cp\u003E\nGo Green, build a couple of Psi troops and have yourself an endlessly regenerating army to bug the AI with. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n I\u0027m right with you on the Believers though, although luckily they tended to be incompetent as well as aggravating. And as soon as I worked my way up Mind-Machine Interface on the tech tree - well anything that was left of Miriam\u0027s troops tended to melt under an unending wave of Chaos Choppers.\n\u003C/p\u003E\n\u003Cp\u003E\nStrangely, it was Morgan who always used to irritate/amuse me. \u0022You won\u0027t let me rip you off - then I must declare unending war on you.\u0022 Because killing off your customers is such an efficient business strategy.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-20T08:16:26Z\u0022 title=\u002210/20/2016 08:16  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 20, 2016\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2016-10-21T04:55:23Z","Content":"\n\u003Cp\u003E\nI remember there being a novella of sorts on the Firaxis website when the game first came out (\u003Ca href=\u0022http://www.ign.com/faqs/2005/sid-meiers-alpha-centauri-storyplot-faq-577701\u0022 rel=\u0022external nofollow\u0022\u003Efound it\u003C/a\u003E), and it more or less drove my choice of faction. Hidden steel is the best kind. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0022As we approached we were confronted by the ruined splendor of Sparta Command. The true immensity of the place became instantly apparent as our Quantum Tank crunched over the rubble and parked next to a shattered bunker, but the extent of the destruction took weeks to assess. The shielded datacore had sustained several massive breaches and smoke still billowed from the numerous cannon ports. There were few signs of human life.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E-- Lady Deirdre Skye, \u0022Our Secret War\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2016-10-21T17:12:20Z","Content":"\n\u003Cp\u003E\nI have Alpha Centauri here somewhere, but I know I have Beyond Earth sitting there waiting for a playthrough in my steam account.  Think I\u0027ll take that for a spin.\n\u003C/p\u003E\n\u003Cp\u003E\nYou were really going to like the game or not, similar to Colonization.  (And I suspect most fans will admit to having certain strong opinions when it comes to the version of Civ they prefer...)\n\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2016-10-22T03:47:54Z","Content":"\n\u003Cp\u003E\nIn the course of global conquest, I always played as Zakharov (dig those funky glasses, dude was a total party animal), and always kept Lady Deirdre around ... because ... well ... \u003Cem\u003Eshe was a really cute babe\u003C/em\u003E. \u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hqdefault.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.ytimg.com/vi/1DT56Imed9w/hqdefault.jpg\u0022\u003E\u003C/p\u003E\n"}]}