{"TopicId":157248,"ForumId":18,"TopicTitle":"some real talk","CreatedByName":"noobsrtoast","CreatedById":65729,"CreatedDateTime":"2017-03-03T12:27:48Z","PageNum":1,"Articles":[{"CreatedByName":"noobsrtoast","CreatedById":65729,"CreatedDateTime":"2017-03-03T12:27:48Z","Content":"\n\u003Cp\u003E\neach day i live, i grow more and more concerned about the future of our species, i firmly believe were not thinking hard enough as a species about where we want to be in 100 years, weve made it so far, weve modernised to a point that its possible no other species in the universe has yet reached our level of advancement, we were fortunate enough to evolve higher than average intelligence in the mess that is the evolution of life, and yet we choose to destroy our planet without thinking about where were going to go next when the planet can no longer support us, were well aware of the effects we have on it, and that were relying on outdated and non renewable methods of obtaining energy, so we cant be a stay at home civilisation as it stands, and were not certain such a civilisation is even possible, we fight each other, hunt species to extinction, and have extremely closed minded thinking when it comes to our view of the world. im going to get to the point now, if we are to continue surviving as a species, we need to leave the planet, this is extremely clear at this point and yet people only think of themselves and what the taxes they pay to the government can do for them personally, at this point theres probably a few people who think im a hypocrite for saying these things  but let me make it very clear, i want the taxes they pay to go to turning us into a spacefaring species, not into weapons to wage war, not into a health care system ill only take advantage of later in my life, and not into construction projects to create jobs, none of these things matter while the clock counts down to the time when we run out of non renewable resources and no longer have a way to leave the planet weve now destroyed.\n\u003C/p\u003E\n\u003Cp\u003E\nif we invest in our space programs, things will be rough for a long time im not going to deny this truth. people in first world countries who dont have jobs will still not have jobs, the national debt in the case of the united states will still be there, people in first world countries will still starve and have no access to clean water, but with the population growth running as rampant as it is, we do not have the means to solve those problems directly no matter how much time and resources we put into it, but if we had access to the solar system weve been ignoring for next to no reason other than the general public isnt interested in \u0022that waste of money, build more weapons to keep us safe, and my brother johnny still has no job\u0022, we would have the resources to solve all those problems and more, and the economy would enter a boom for the next couple of thousand years. my personal feelings are that we need to stop giving government run space programs pocket change that they can barely do anything besides send a small probe to some place with, and start giving them large amounts of money they can actually make some progress with, commercial spaceflight shouldnt just be about touring low earth orbit, it should be about settling humans on other worlds, we have access to so many asteroids we could gather valuable resources from, and use as space colonies using the rock of the asteroid to shield us from radiation extremely close to us on a cosmic scale, were missing out on a very powerful kickstart to completely solving the problems we have here on earth just because we feel we should focus on them right now, but the direct approach is not always the best as weve proven countless times throughout history and appear to be proving yet again\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nanyway that was my real talk, feel free to add your thoughts \n\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2017-03-03T12:40:28Z","Content":"\n\u003Cp\u003E\nI agree we need to get off this planet.  How we do it is very much up for debate.\n\u003C/p\u003E\n\u003Cp\u003E\nRespectfully, though you might not benefit right now from the taxes that go towards healthcare and the like, does not mean that you will never need these things.  Furthermore, one of the primary drivers of conflict tends to be people lacking in basic human needs.  Employment is one of the most basic of these needs.  It\u0027s all well and good to say (I\u0027m paraphrasing here) \u0022let\u0027s let everyone suffer in order to have a better future\u0022, but what you may not be considering is that there may be no better future if things go too far down that path.\n\u003C/p\u003E\n"},{"CreatedByName":"noobsrtoast","CreatedById":65729,"CreatedDateTime":"2017-03-03T13:38:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222974146\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488544828\u0022 data-ipsquote-userid=\u002278711\u0022 data-ipsquote-username=\u0022pxi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, pxi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI agree we need to get off this planet.  How we do it is very much up for debate.\n\u003C/p\u003E\n\u003Cp\u003E\nRespectfully, though you might not benefit right now from the taxes that go towards healthcare and the like, does not mean that you will never need these things.  Furthermore, one of the primary drivers of conflict tends to be people lacking in basic human needs.  Employment is one of the most basic of these needs.  It\u0027s all well and good to say (I\u0027m paraphrasing here) \u0022let\u0027s let everyone suffer in order to have a better future\u0022, but what you may not be considering is that there may be no better future if things go too far down that path.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nof course when i say i want us to focus on getting off the planet, i mean we need to do it, and then once we have access to a proper amount of resources, we can get to solving the problems we have here on our planet, unemployment goes out the window when you have a few trillion asteroid mining positions available, and on top of that you allow for businesses to grow around this industry, you also just created a trillion jobs setting up infrastructure and asteroid habitats, you just solved the population problem by giving them somewhere relatively nice to go, because you can afford to have nice places like that for them, now that you have a Quintillion dollar mining industry among many other industries, and they can afford to go there because of their newly found well paying job, you also now have access to more of the suns energy and the capability to build as many solar collectors as you so please, creating another massive energy based industry for people to find employment in, you also now have an entire solar systems worth of farming land to grow food from, and a trillion different ways to make the right fertiliser, solving that pesky hunger problem, and you now have octillions of tonnes of ice to get water from and you can more than afford to filter it properly and make it clean, solving that pesky clean water problem, which would also lead to all people being able to practice proper hygiene, thus drastically reducing the effects of that pesky disease problem(you cant eradicate disease no matter how hard you may try this is a fact of life, so ill accept coming close as an improvement)on top of the inevitable advancements in healthcare science as we learn to adapt our bodies to the new environments we now control, while we will have bad for a while that i cannot deny, if we do it right, only good will come from making this great transition \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-03T13:43:03Z\u0022 title=\u002203/03/2017 01:43  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 3, 2017\u003C/time\u003E by noobsrtoast\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2017-03-03T13:47:24Z","Content":"\n\u003Cp\u003E\nWe dont run out of resources required for spaceflight. The stuff never leaves earth, so you would just have to recycle it. The only thing we can run out is humans, e.g. after a third world war. So i would say its currently more important to solve existence threatening problems, e.g. climate change, political issues, asteroid defense...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-04T03:45:21Z\u0022 title=\u002203/04/2017 03:45  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 4, 2017\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003EEdited for pertinence.\n\u003C/span\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2017-03-03T13:57:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222974198\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488548844\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe dont run out of resources required for spaceflight. The stuff never leaves earth\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, technically...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2017-03-03T14:28:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222974183\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488548283\u0022 data-ipsquote-userid=\u002265729\u0022 data-ipsquote-username=\u0022noobsrtoast\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, noobsrtoast said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nof course when i say i want us to focus on getting off the planet, i mean we need to do it, and then once we have access to a proper amount of resources, we can get to solving the problems we have here on our planet, unemployment goes out the window when you have a few trillion asteroid mining positions available, and on top of that you allow for businesses to grow around this industry, you also just created a trillion jobs setting up infrastructure and asteroid habitats, you just solved the population problem by giving them somewhere relatively nice to go, because you can afford to have nice places like that for them, now that you have a Quintillion dollar mining industry among many other industries, and they can afford to go there because of their newly found well paying job, you also now have access to more of the suns energy and the capability to build as many solar collectors as you so please, creating another massive energy based industry for people to find employment in, you also now have an entire solar systems worth of farming land to grow food from, and a trillion different ways to make the right fertiliser, solving that pesky hunger problem, and you now have octillions of tonnes of ice to get water from and you can more than afford to filter it properly and make it clean, solving that pesky clean water problem, which would also lead to all people being able to practice proper hygiene, thus drastically reducing the effects of that pesky disease problem(you cant eradicate disease no matter how hard you may try this is a fact of life, so ill accept coming close as an improvement)on top of the inevitable advancements in healthcare science as we learn to adapt our bodies to the new environments we now control, while we will have bad for a while that i cannot deny, if we do it right, only good will come from making this great transition \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI think you are being massively optimistic about how quickly this would happen.  I couldn\u0027t see this happening in less than 50 years, I tend to think it\u0027s a scenario that would unfold over the next century or so more realistically, though I would love to be proven wrong.  That\u0027s a long painful period in the interim if we just let everyone suffer in the meantime.  A lot can happen in a year, let alone several decades.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI also wonder how badly massive access to resources would tank the global economy.  Things like gold and platinum have the prices they have in large part due to their scarcity and the cost of extracting them.  In many ways once you get access to asteroid resources the price can only go down.  The mining economy you envision may not be as profitable as you imagine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFinally I\u0027m not convinced that the average person actually wants to live in space, jobs or not.  I\u0027ve been of the opinion for a while that it\u0027s going to require something on the order of forcing non-propery-owning people to migrate in a \u0022we don\u0027t care where you go, but you can\u0027t stay here\u0022 scenario to make it happen.  Maybe this changes when we have fully-featured orbital cities and the like, but that\u0027s a lot of infrastructure away from where we are at present.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t get me wrong, I agree these things have to happen, but how it happens requires a lot of thought.\n\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2017-03-03T16:07:05Z","Content":"\n\u003Cp\u003E\nWE are not getting off this planet ever. Neither us right here specifically nor we as the population of Earth. Transporting billions of people of a planet may never happen realistically.\n\u003C/p\u003E\n\u003Cp\u003E\nThe species might have better chances to survive if we settle other planets/systems. But this cannot justify leaving behind 99% of humanity behind in terms of letting them deal with a wreck of a planet or society.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I refuse to accept that we cannot accomplish both.\n\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2017-03-04T00:14:19Z","Content":"\n\u003Cp\u003E\ni stopped reading after the word \u0022species\u0022 \u003Cspan\u003E\u003Cspan\u003E@ op (pretty soon so, sorry and nothing personnal, but)\u003C/span\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nsimply because i don\u0027t use this word it\u0027s meaning less to me, \u0022i m just a sum of atoms and even smaller things\u0022 so it\u0027s a meaningless word, i don\u0027t even see the difference between a plant , a rock, you, me, an ant and a celestial body\u003Cbr\u003E\u003Cbr\u003E\nwell it may help you, if you start asking yourself such thing in a deep, beyond and above loop\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-04T00:16:09Z\u0022 title=\u002203/04/2017 12:16  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 4, 2017\u003C/time\u003E by WinkAllKerb\u0026#039;\u0026#039;\u003C/strong\u003E\n\u003Cbr\u003Eedit: added (...)\n\u003C/span\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2017-03-04T01:27:36Z","Content":"\n\u003Cp\u003E\nI disagree, Wink. I think the pattern which the atoms et cetera assume is just as important as the atoms themselves, if not more. The pattern is what distinguishes low entropy structures from high entropy ones, and that is a \u003Cem\u003Every\u003C/em\u003E important thing.\n\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2017-03-04T02:44:25Z","Content":"\n\u003Cp\u003E\nscholar?q=psycho\u002Bself\u002Bego\u002B%26\u002Bgroup\u002Bconsciousness\u003Cbr\u003E\u003Cbr\u003E\nthat\u0027s (\u0022mostly\u0022 early to teen)schoolyard stuff to build ego per insertion \u002B contrast ... but yup i aggree later on you can remain inserted and conflictual with others group as long as your group isn\u0027t large enough, learn to unlearn mostly what\u0027s it\u0027s all about\u003Cbr\u003E\u003Cbr\u003E\nas i said my family is at atoms scale, that\u0027s a very large and commonly shared thing\u003Cbr\u003E\u003Cbr\u003E\nalso keep in mind \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222974970\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488590856\u0022 data-ipsquote-userid=\u0022110660\u0022 data-ipsquote-username=\u00220111narwhalz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, 0111narwhalz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n... some stuff ... \u0026amp; entropy\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni m not someone bound to my sum of atoms machinery assembly lifespan (and time scale reference) this explain that for part as well \u003Cbr\u003E\u003Cbr\u003E\nyou\u0027ve to understand i consider each smallest knowns single entity using it\u0027s own form of communication/interaction with it\u0027s environnement, at it\u0027s moving speed/lifespan/size scale even if they are not exactly the whole sum interaction/and communication form\u003Cbr\u003E\u003Cbr\u003E\nas long as you don\u0027t get how i m unlinked with time, various lifespan, various entities size and scale you miss something in what i m saying because your bound in a/some referential(s) different than the ones that interest me or that i refer too usually\u003Cbr\u003E\u003Cbr\u003E\ne n t r o p y:\n\u003C/p\u003E\n\u003Cp\u003E\ndoes a butterfly find it\u0027s life long or short ? Do you find a single cell live long or short, do you find the speed atom move slow or fast ? do you think a star lifespan is long or short ?\u003Cbr\u003E\nas i try to explain you makin\u0027 difference and contrast where i m not and just exactly see the same process per empathy to @said entitie lifespan.\u003Cbr\u003E\u003Cbr\u003E\na butterffly may think an elephant is like a star for example or\u003Cbr\u003E\nlet\u0027s say i m a cell, what\u0027s a biological body, well it\u0027s a universe\u003Cbr\u003E\nnow if i m a star what\u0027s a biological body, well prolly something to small for me to see it, also it appear and disappear so fast that i could call them boson ^^\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nthink frame per seconds and eyes, that\u0027s fairly simple, divide and that\u0027s doing it, the speed one consider a signal , is a false referential but most remain bound within\u003Cbr\u003E\u003Cbr\u003E\nTLDR:\u003Cbr\u003E\nso it\u0027s about relationship with time, \u0022various\u0022 re-scaling and others entities per similitude and empathy, sort off\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-04T03:14:07Z\u0022 title=\u002203/04/2017 03:14  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 4, 2017\u003C/time\u003E by WinkAllKerb\u0026#039;\u0026#039;\u003C/strong\u003E\n\u003Cbr\u003Evarious typo, and This-Lexic Pat-O-Logi-Call stuff\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-03-04T03:46:00Z","Content":"\n\u003Cp\u003E\nSome posts have been edited or removed from this thread. Please don\u0027t set yourselves up as the grammar police, guys. \n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2017-03-04T21:55:49Z","Content":"\n\u003Cp\u003E\nI agree with you. So many people i have talked to just say \u003Ci\u003Elets fix this planet before going to other planets. \u003C/i\u003EWich bassicly makes no sense, because there is no way you are gonna fix this entire planet for a second. There will always be problems. Man, 1 person cant even live his live without having 1 problematic thing in its life at least.\n\u003C/p\u003E\n\u003Cp\u003E\n1 Problem fixed and you got 10 more problems to solve. Thats the way life is.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd i cant STAND when people say space travel is stupid. Saying space travel is stupid is like saying leaving home is stupid. You are going to run out of or have an overdose of something that makes you leave your home.\n\u003C/p\u003E\n"},{"CreatedByName":"noobsrtoast","CreatedById":65729,"CreatedDateTime":"2017-03-05T02:34:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222974198\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488548844\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 03/03/2017 at 6:47 AM, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe dont run out of resources required for spaceflight. The stuff never leaves earth, so you would just have to recycle it. The only thing we can run out is humans, e.g. after a third world war. So i would say its currently more important to solve existence threatening problems, e.g. climate change, political issues, asteroid defense...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nno we can most definitely run out of the resources needed for rocket fuel, especially when its being wasted to manufacture various missiles from nuclear all the way down to standard cruise or air to air, in fact were running out of what we need to make spaceflight possible quite quickly indeed \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222975821\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488664549\u0022 data-ipsquote-userid=\u0022165635\u0022 data-ipsquote-username=\u0022NSEP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, NSEP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI agree with you. So many people i have talked to just say \u003Ci\u003Elets fix this planet before going to other planets. \u003C/i\u003EWich bassicly makes no sense, because there is no way you are gonna fix this entire planet for a second. There will always be problems. Man, 1 person cant even live his live without having 1 problematic thing in its life at least.\n\u003C/p\u003E\n\u003Cp\u003E\n1 Problem fixed and you got 10 more problems to solve. Thats the way life is.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd i cant STAND when people say space travel is stupid. Saying space travel is stupid is like saying leaving home is stupid. You are going to run out of or have an overdose of something that makes you leave your home.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nexactly when man started crossing the oceans and colonizing this planet as a whole look how much better the quality of life for the average person started to get, huge empires formed as a result that prospered for thousands of years in a wealth of resources, and we discovered the stuff that powers our society today: oil \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222975082\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488599160\u0022 data-ipsquote-userid=\u002227914\u0022 data-ipsquote-username=\u0022Vanamonde\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Vanamonde said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSome posts have been edited or removed from this thread. Please don\u0027t set yourselves up as the grammar police, guys. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nlol thanks man, my point was made this is the internet \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2017-03-05T02:39:34Z","Content":"\n\u003Cp\u003E\nThe Outer Space Treaty is the thing setting us back from having reasons to explore space.\n\u003C/p\u003E\n"},{"CreatedByName":"noobsrtoast","CreatedById":65729,"CreatedDateTime":"2017-03-05T02:42:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222976052\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488681574\u0022 data-ipsquote-userid=\u0022152223\u0022 data-ipsquote-username=\u0022Aperture Science\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Aperture Science said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Outer Space Treaty is the thing setting us back from having reasons to explore space.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni wouldnt quite say that, abolishing the outer space treaty just means we have nuclear death hanging over our heads at all times, i feel like if there was no outer space treaty countries would just dump more money into defense contracting and surround the earth with orbital bombardment weapons instead of actually getting any useful space colonisation done \n\u003C/p\u003E\n"},{"CreatedByName":"noobsrtoast","CreatedById":65729,"CreatedDateTime":"2017-03-05T03:02:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222974250\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488551309\u0022 data-ipsquote-userid=\u002278711\u0022 data-ipsquote-username=\u0022pxi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 03/03/2017 at 7:28 AM, pxi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI think you are being massively optimistic about how quickly this would happen.  I couldn\u0027t see this happening in less than 50 years, I tend to think it\u0027s a scenario that would unfold over the next century or so more realistically, though I would love to be proven wrong.  That\u0027s a long painful period in the interim if we just let everyone suffer in the meantime.  A lot can happen in a year, let alone several decades.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI also wonder how badly massive access to resources would tank the global economy.  Things like gold and platinum have the prices they have in large part due to their scarcity and the cost of extracting them.  In many ways once you get access to asteroid resources the price can only go down.  The mining economy you envision may not be as profitable as you imagine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFinally I\u0027m not convinced that the average person actually wants to live in space, jobs or not.  I\u0027ve been of the opinion for a while that it\u0027s going to require something on the order of forcing non-propery-owning people to migrate in a \u0022we don\u0027t care where you go, but you can\u0027t stay here\u0022 scenario to make it happen.  Maybe this changes when we have fully-featured orbital cities and the like, but that\u0027s a lot of infrastructure away from where we are at present.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t get me wrong, I agree these things have to happen, but how it happens requires a lot of thought.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nill go through these points one by one, i am aware that it would take the next century to establish a permanent human presence in space, and i am alright with that considering the benefits that would come afterward, i understand people would suffer in that period but like i said earlier, they were gonna suffer for much longer anyway if we didnt get a move on\n\u003C/p\u003E\n\u003Cp\u003E\nwhen i say resources im not just talking about gold and platinum, i know a common fact people say is that one asteroid contains more gold in it than humans have found in all of human history but asteroids arent just gold and platinum, you can make rocket fuel from the resources you find in asteroids, asteroid spaceships have been presented as a viable option for space travel within the solar system, not to mention the massive amounts of water, which isnt something thats really going to tank the global economy considering that we use it for so freaking much, with this new abundance of useful resources i believe the economy would be at the best its ever been since economy started to matter, same with iron and aluminum and copper and we can probably even find some carbon and oxygen mixed in there somewhere, the last thing on my mind and on anyone sane\u0027s mind is gold and platinum, also in this case a monopoly on those resources might be a good thing to keep the market from flooding should we start to decide were gonna mine gold\n\u003C/p\u003E\n\u003Cp\u003E\nif i have to go up there and build every damn thing myself, i will, you can be sure as excrements that i want to live in space be it on an asteroid or somewhere else even if the living conditions were to be uncomfortable for a long time, i would give up everything i have in my life right now to help pave the way for space colonies i wouldnt care if they didnt pay me and ended up working me to death if it means people were going to start leaving the planet and there was a brighter future ahead for our species, theres probably no one on this planet who shares the same opinion as me but as unfortunate as it is, theres also homeless people and people in 3rd world countries who are starving and dont have access to clean water and are suffering from the effects of industrialisation in their respective regions and overpopulation, those people dont act based on what they want they do what they need to in order to survive and find a better life at some point hopefully, dangling a $40-100/hr job in front of them building infrastructure in space and offering them access to food and clean water and a decent place to live to boot, they may not want to, but that is the best opportunity they have and that gives them a chance at a much better life, just like how people will immigrate to other countries in search of a better life, not because they particularly want to, but because its often the only choice they have, just no instead of it flooding our respective borders with immigrants, we have a place to put them, and a moderately nice one at that \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nas a final note i would also like to say that if we do start, i agree, we do need to take our time and think about how these things are to get done, we cant just \u0022go for gold\u0022 as you have said \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222974889\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488586459\u0022 data-ipsquote-userid=\u002278047\u0022 data-ipsquote-username=\u0022WinkAllKerb\u0027\u0027\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 03/03/2017 at 5:14 PM, WinkAllKerb\u0027\u0027 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni stopped reading after the word \u0022species\u0022 \u003Cspan\u003E\u003Cspan\u003E@ op (pretty soon so, sorry and nothing personnal, but)\u003C/span\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nsimply because i don\u0027t use this word it\u0027s meaning less to me, \u0022i m just a sum of atoms and even smaller things\u0022 so it\u0027s a meaningless word, i don\u0027t even see the difference between a plant , a rock, you, me, an ant and a celestial body\u003Cbr\u003E\u003Cbr\u003E\nwell it may help you, if you start asking yourself such thing in a deep, beyond and above loop\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nwhile this is true, i also believe life is the universes way of experiencing itself, we just so happened to develop a complex intelligence that allows us to look out there and appreciate what we see, and allows us to have a shot at going to explore it, considering we are quite likely to be one of the few species in the universe to have a large amount of complex intelligence, we deserve the title of species as do other life forms, and we need to get out there and appreciate that weve been brought into existence in the first place instead of writing ourselves off as \u0022insignificant clumps of atoms so we might as well not try\u0022 we should be trying even if we make the smallest of dents on the history of the entire universe we should go out there to appreciate that weve been allowed to experience this universe, to see in just the right wavelength of light to be able to see the true beauty of everything around us, we are fortunate, i am not creationist, but i do appreciate that we exist and would like us to make something of ourselves \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222974359\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488557225\u0022 data-ipsquote-userid=\u002270338\u0022 data-ipsquote-username=\u0022KerbMav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 03/03/2017 at 9:07 AM, KerbMav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWE are not getting off this planet ever. Neither us right here specifically nor we as the population of Earth. Transporting billions of people of a planet may never happen realistically.\n\u003C/p\u003E\n\u003Cp\u003E\nThe species might have better chances to survive if we settle other planets/systems. But this cannot justify leaving behind 99% of humanity behind in terms of letting them deal with a wreck of a planet or society.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I refuse to accept that we cannot accomplish both.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nwe can accomplish both, it will take a long time, but there is more than enough space in the solar system to house trillions of humans, at first it will only be a few and progress will be very slow, but as we put more effort into it we will develop better rocketry technology and eventually we will all get to leave earth, we will not be leaving anyone behind, we will just have to endure some hardships to get everyone a chance at a much better life, im not denying there will be suffering, but if we dont take steps soon the suffering will just continue without anyone having made an effort at all, at least if we try we can improve as many lives as possible \n\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2017-03-05T15:11:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222976063\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488682957\u0022 data-ipsquote-userid=\u002265729\u0022 data-ipsquote-username=\u0022noobsrtoast\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, noobsrtoast said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nill go through these points one by one, i am aware that it would take the next century to establish a permanent human presence in space, and i am alright with that considering the benefits that would come afterward, i understand people would suffer in that period but like i said earlier, they were gonna suffer for much longer anyway if we didnt get a move on\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou may be happy to allow people to suffer, but rightly or wrongly I strongly suspect you are in the minority.  There have been other attempts in history to re-engineer society towards a golden-age of civilisation.  Those also expected their populace to endure hardships in order to bring these things about, and almost without exception they are not well regarded by history.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are many problems we are facing.  Focussing on one aspect will not solve every problem we have, and we need to make a decent effort at tackling all of them.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222976063\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488682957\u0022 data-ipsquote-userid=\u002265729\u0022 data-ipsquote-username=\u0022noobsrtoast\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, noobsrtoast said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhen i say resources im not just talking about gold and platinum, i know a common fact people say is that one asteroid contains more gold in it than humans have found in all of human history but asteroids arent just gold and platinum, you can make rocket fuel from the resources you find in asteroids, asteroid spaceships have been presented as a viable option for space travel within the solar system, not to mention the massive amounts of water, which isnt something thats really going to tank the global economy considering that we use it for so freaking much, with this new abundance of useful resources i believe the economy would be at the best its ever been since economy started to matter, same with iron and aluminum and copper and we can probably even find some carbon and oxygen mixed in there somewhere, the last thing on my mind and on anyone sane\u0027s mind is gold and platinum, also in this case a monopoly on those resources might be a good thing to keep the market from flooding should we start to decide were gonna mine gold\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOf course I only listed gold and platinum as examples.  I don\u0027t know why you are so dismissive of them however, they have an awful lot of industrial uses.  Consider also that the price for silver is currently skyrocketing as demand for it is vastly outstripping supply.  When you have abundant supplies of something, its value goes down, there\u0027s really no getting around that fact.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to your point about placing a monopoly on asteroid resources to control the economy.  What\u0027s to stop someone from just going and getting more, and bypassing your monopoly?  Failing that, what\u0027s to stop them just taking what you have?\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2017-03-05T16:54:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222976056\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488681750\u0022 data-ipsquote-userid=\u002265729\u0022 data-ipsquote-username=\u0022noobsrtoast\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, noobsrtoast said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni wouldnt quite say that, abolishing the outer space treaty just means we have nuclear death hanging over our heads at all times, i feel like if there was no outer space treaty countries would just dump more money into defense contracting and surround the earth with orbital bombardment weapons instead of actually getting any useful space colonisation done \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNuclear war won\u0027t happen until countries have a reliable way to destroy/disable enemy nukes before they hit their targets, because of mutually assured destruction.\n\u003C/p\u003E\n\u003Cp\u003E\nIf the OST was abolished, countries would indeed militarize space, but also explore to claim territory. And militarization and territory is what\u0027s driven mankind to this date.\n\u003C/p\u003E\n\u003Cp\u003E\nFinding ways to militarize space = more investments in science; Claiming territory in space = more research in propulsion, or the revival of a few projects\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-05T16:55:38Z\u0022 title=\u002203/05/2017 04:55  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 5, 2017\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"noobsrtoast","CreatedById":65729,"CreatedDateTime":"2017-03-07T03:40:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222976423\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488726715\u0022 data-ipsquote-userid=\u002278711\u0022 data-ipsquote-username=\u0022pxi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 05/03/2017 at 8:11 AM, pxi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou may be happy to allow people to suffer, but rightly or wrongly I strongly suspect you are in the minority.  There have been other attempts in history to re-engineer society towards a golden-age of civilisation.  Those also expected their populace to endure hardships in order to bring these things about, and almost without exception they are not well regarded by history.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are many problems we are facing.  Focussing on one aspect will not solve every problem we have, and we need to make a decent effort at tackling all of them.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOf course I only listed gold and platinum as examples.  I don\u0027t know why you are so dismissive of them however, they have an awful lot of industrial uses.  Consider also that the price for silver is currently skyrocketing as demand for it is vastly outstripping supply.  When you have abundant supplies of something, its value goes down, there\u0027s really no getting around that fact.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to your point about placing a monopoly on asteroid resources to control the economy.  What\u0027s to stop someone from just going and getting more, and bypassing your monopoly?  Failing that, what\u0027s to stop them just taking what you have?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\na key part of economics is your ability to enforce your claims on resources, if we have an expansion into space its likely that it will be lead by powers capable of enforcing said claims, when you have an abundance of something its value overall may go down, but that does not mean its usefulness suddenly disappears we can still use those resources to manufacture useful products/more rocket fuel\n\u003C/p\u003E\n\u003Cp\u003E\ni will reiterate what i said earlier, no ones doing anything about it now, and we dont have the resources needed on the planet to be able to solve it here, population growth is skyrocketing way too fast, and its been shown that in order to improve the quality of life of everyone on the planet, you would need around 2.5 earths worth of resources to do so, while i may not be regarded so well its not about that, i would be no different than anyone who is ignoring the problem hoping it will go away itself now, except that i would be doing something to try and help even if i succeeded only halfway, i would be able to stand tall knowing that i at least tried and made a difference, for me its not about propelling humanity into a golden age, its about ending as much suffering as possible, fulfilling my dream to see humanity explore space, and insuring that we at least add a few more thousand years to our life expectancy as a species, i want us to survive not prosper,i understand very well that simply going to space wont insure humanity ends up in some kind of golden age \n\u003C/p\u003E\n\u003Cp\u003E\nas a final note, if i did accomplish this goal somehow, as this is all conjecture, i wouldnt care at all if historians ended up seeing me in a negative light, or anyone for that matter, because i would have succeeded and i myself would know that my actions lead to humanity becoming spacefaring and perhaps having some chance of surviving the next 10\u0027000 or so years and continuing the journey that was set in motion by me, because if i was able to set in motion said events, i wouldnt just be directing everything, i would be out there helping make it happen, putting my life in danger as the people who had accepted my decision were also doing and taking the same risks \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222976515\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488732865\u0022 data-ipsquote-userid=\u0022152223\u0022 data-ipsquote-username=\u0022Aperture Science\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 05/03/2017 at 9:54 AM, Aperture Science said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNuclear war won\u0027t happen until countries have a reliable way to destroy/disable enemy nukes before they hit their targets, because of mutually assured destruction.\n\u003C/p\u003E\n\u003Cp\u003E\nIf the OST was abolished, countries would indeed militarize space, but also explore to claim territory. And militarization and territory is what\u0027s driven mankind to this date.\n\u003C/p\u003E\n\u003Cp\u003E\nFinding ways to militarize space = more investments in science; Claiming territory in space = more research in propulsion, or the revival of a few projects\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nit doesnt have to be this way, we can do it peacefully too, at least i hope we can, the last thing i want is to see our first proper steps into space ones of conquest and uncertain borders \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2017-03-07T04:08:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222978240\u0022 data-ipsquote-contentid=\u0022157248\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488858002\u0022 data-ipsquote-userid=\u002265729\u0022 data-ipsquote-username=\u0022noobsrtoast\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, noobsrtoast said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt doesnt have to be this way, we can do it peacefully too, at least i hope we can, the last thing i want is to see our first proper steps into space ones of conquest and uncertain borders \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, we\u0027ve been trying to do it peacefully for the past few decades, and look what happened to NASA\u0027s budget or public interest in investing in spaceflight.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s undeniable. Conflict is what propels mankind the most, it\u0027s the reason we went from wooden sticks to nuclear weaponry.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m just waiting for politicians to withdraw from the OST. Then there\u0027s going to be another space golden age.\n\u003C/p\u003E\n"}]}