{"TopicId":160914,"ForumId":18,"TopicTitle":"Star Wars episode 8 theory!","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2017-05-22T00:47:48Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2017-05-22T00:47:48Z","Content":"\n\u003Cp\u003E\nI\u0027m bored to death and watching various stupid youtube videos about movies etc. Watching the who is snoke stuff. Some of them were mentioning a big reveal to shadow the I\u0027m your father one from the second movie. What if:\n\u003C/p\u003E\n\u003Cp\u003E\nSnoke is vader!(This has been proposed alot from what I\u0027ve seen but this is in a slightly different way.)\n\u003C/p\u003E\n\u003Cp\u003E\nHe learned enough of the supposed plageius abilities and used the force to fake the end of episode 3/6. He was alive in the fire faking his death. Used luke to kill the emporer and get himself in a top position. He then seduces the grandson and gets him as the new apprentice to get his old stuff back or something and pulled the wool over the eyes of the rebellion to reverse what everyone thought happened at the end of the first trilogy and put everything back mostly to square one and is trying to do whatever he will do as the new emporer. Luke is in hiding because he realise Vader tricked him and is devastated and trying to hide so he doesn\u0027t get him to join and take over completely.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s more straight forward and rewrites the entire thing without voiding any of it. Vader being a complete ass and doing exactly what he said he wanted to do. And the empire never really ended. Just changed hands and is regrouping or whatever. He also was responsible for messing up the new jedi and continuing his original work. And of course he wins best father of the millennium award from the sith.\n\u003C/p\u003E\n\u003Cp\u003E\nHim keeping himself alive while hiding his presence from luke in his great acting debut is the reason he looks so bad. He also managed to regrow limbs or get biological transplants to replace the old stuff. which he only couldn\u0027t do before because he was purposely stuck in the suite and the emperor would have force lightning killed him or he really did learn abilities like plagieus had and was holding them for later use or new tech came out.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, in synopsis the shadow of the I\u0027m your father reveal is another Luke, I\u0027m your father reveal! \u0026gt;\u0026lt;\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-22T00:55:14Z\u0022 title=\u002205/22/2017 12:55  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 22, 2017\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2017-05-22T00:54:52Z","Content":"\n\u003Cp\u003E\nVader appeared as a force ghost alongside Yoda and Obi-Wan at the end of RotJ.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2017-05-22T00:56:47Z","Content":"\n\u003Cp\u003E\nTechnically palatine did also in the lego version. \u0026gt;\u0026lt; maybe he went back. But, yes that might be an obstacle.\n\u003C/p\u003E\n\u003Cp\u003E\nDarn, I thought Vader being that much of a jerk might be a good story. It would be political intrigue on an epic scale. And a legitimate way to put the universe back in danger. It might also help explain the 3rd deathstar as it might have turned into Vaders obsession. Or at least give it some more legitimacy.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022Good\u0022 guys being over confident would be pretty realistic and a whole story line on them having it slowly kick them in the butt as they realize their mistake could be pretty good and potentially realistic and dramatic. Not to mention it fits the entire storyline. Once you have made a mistake you are likely to do it again. People and character don\u0027t change that quick in the real world. It is why consequences can or do play out so long. the galaxy already fell to this once. It\u0027s completely realistic it would fall for it again or continue to suffer from it to emphasize how bad the underlying problem really is.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-22T07:24:08Z\u0022 title=\u002205/22/2017 07:24  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 22, 2017\u003C/time\u003E by Dman979\u003C/strong\u003E\n\u003Cbr\u003EChanged some words to be forum-compliant.\n\u003C/span\u003E\n"}]}