{"TopicId":163482,"ForumId":18,"TopicTitle":"Laptops (gaming or not) - which ones other than Asus ROGs?","CreatedByName":"Spraki","CreatedById":155616,"CreatedDateTime":"2017-07-20T03:59:50Z","PageNum":1,"Articles":[{"CreatedByName":"Spraki","CreatedById":155616,"CreatedDateTime":"2017-07-20T03:59:50Z","Content":"\n\u003Cp\u003E\nOk. Before you throw all your jebs at me-\n\u003C/p\u003E\n\u003Cp\u003E\nI read several threads and offsite laptop review sites. I know people tend to hate these personal advice laptop threads.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I still require quite some guidance on certain laptops, especially ones that are not full gaming laptops. \n\u003C/p\u003E\n\u003Cp\u003E\nTo clarify, I am looking for one that can obviously play KSP, and other modern games like Overwatch ( note that I never play on high settings).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nComing from a 2011\u0027ish  i5  Samsung rv520 that has a GT520m, so anything could be nice.\n\u003C/p\u003E\n\u003Cp\u003E\nBut also ones that have good architecture, which apparently ASUS ROGs tend to have. Or so I read that the placement of power supply is nice and it has a nice passive cooling setuo.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI would like to hear from those who do use laptops how things are going. I am also the type who would rather have a laptop that can survive some 4 years. That is a bit of a magic 8 ball thing, but I have read here and there that MSI and DELL laptops are not sooooo reliable (now is the time to prove me wrong).\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I am looking for more manufacturer names.\n\u003C/p\u003E\n\u003Cp\u003E\nOnly recently did I hear about Schenker Laptops, Germany-based. I am studying abroad at the moment but I do live in Germany.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways. I want to hear some advice and opinions on (gaming) laptops. I know I know, it is a bit of a farce, but some of us have to rely on them these days.\n\u003C/p\u003E\n\u003Cp\u003E\nI have seen a few people playing Overwatch on these non-ROG asus laptops, so I think there are alternatives?\n\u003C/p\u003E\n\u003Cp\u003E\nI suppose I\u0027d be willing to pay up to $1300USD, but not if they are prone to breakdown due to faulty parts or crapoy architecture (hence worries read about MSI and DELL).\n\u003C/p\u003E\n\u003Cp\u003E\nThanks. Do please be thorough with your opinions on what would be viable :3\n\u003C/p\u003E\n"}]}