{"TopicId":164715,"ForumId":18,"TopicTitle":"Question: If given the technologies, would we be a more efficient and effective force than any other sci-fi universe?","CreatedByName":"Joseph Kerman","CreatedById":176176,"CreatedDateTime":"2017-08-23T13:47:55Z","PageNum":1,"Articles":[{"CreatedByName":"Joseph Kerman","CreatedById":176176,"CreatedDateTime":"2017-08-23T13:47:55Z","Content":"\n\u003Cp\u003E\nI want your opinion.\n\u003C/p\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2017-08-23T14:31:11Z","Content":"\n\u003Cp\u003E\nSo you\u0027re asking, if we had \u0022Star Trek\u0022 technology, could we beat \u0022The Federation-from-Star-Trek\u0022 in a military conflict?\n\u003C/p\u003E\n\u003Cp\u003E\nSomething about the question bugs me..something about how we (humans) are the ones writing the Sci-Fi in the first place, so we (humans) would be fighting us (humans) with the same technology.\n\u003C/p\u003E\n\u003Cp\u003E\nSo...it would always be a draw?\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2017-08-23T21:10:21Z","Content":"\n\u003Cp\u003E\nDepends on the sci-fi universe. Are we talking War of the Worlds Martian tech, or human tech? \n\u003C/p\u003E\n\u003Cp\u003E\nThere is at least one I know of: Worldwar. It\u0027s a series about World War II, and aliens invading Earth while it\u0027s embroiled in conflict. Just about the only thing we don\u0027t have from that sci-fi universe are the starships.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2017-08-23T21:41:40Z","Content":"\n\u003Cp\u003E\nI\u0027m going to say No. Just being \u0022\u003Cspan style=\u0022color:#000000;\u0022\u003Egiven the technologies\u003C/span\u003E\u0022 does not automatically give you the experience or administrative infrastructure to use them effectively. A civilization that had developed those same technologies on their own would have training programs, manufacturing facilities, military doctrines, and all manner of experts to advise them in all of those areas, and we\u0027d be playing catch-up across the board.\n\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2017-08-24T04:40:49Z","Content":"\n\u003Cp\u003E\nSome sci-fi \u0027verses are limited by things like plot. Reality has no such obligation. Things might be very boring.\n\u003C/p\u003E\n\u003Cp\u003E\nOr people would crash those FTL starships into planets and ruin it for everyone involved.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-08-24T11:39:52Z","Content":"\n\u003Cp\u003E\nIf the given technologies include the Universal cheat codes.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-08-24T17:56:35Z","Content":"\n\u003Cp\u003E\nYou can pretty much make up any scenario you want.\n\u003C/p\u003E\n\u003Cp\u003E\nYay - Humanity rules because we\u0027re just so naturally gifted at the art of mass murder. Go us!\n\u003C/p\u003E\n\u003Cp\u003E\nNo - Humanity loses badly because it fetches up against a hive mind civilization in which 98% of the population consists of mindless soldier drones and we\u0027re effectively suicide-bombed to defeat.\n\u003C/p\u003E\n\u003Cp\u003E\nEtc.\n\u003C/p\u003E\n"}]}