{"TopicId":169477,"ForumId":18,"TopicTitle":"Stellaris game thread","CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-01-11T21:48:19Z","PageNum":1,"Articles":[{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-01-11T21:48:19Z","Content":"\n\u003Cp\u003E\nHey! I got the game on Christmas, and I\u0027ve been having a lot of fun with it, roleplaying, creating interesting empires, the like. What\u0027s your experience with the game? I may even do playthroughs in the future for the game, we\u0027ll see. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Are you excited for Cherryh? I am, the update looks really cool, and the Apocalypse expansion looks amazing.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat kind of empires do you like making? What\u0027s your go-to strategy? Do you have a favorite end-game crisis? What\u0027s ascension path do you like going down (In my latest playthrough, I\u0027m trying to go down the synthetic path)? Any tips for newbies like me? \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd here\u0027s the Apocalypse expansion trailer which released earlier;\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/auDTPzdwga4?start=3\u0026amp;feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd the Utopia trailer, which I really like;\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/YmvGlBFaFEU?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-11T21:50:45Z\u0022 title=\u002201/11/2018 09:50  PM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 11, 2018\u003C/time\u003E by Spaceception\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2018-01-11T23:17:26Z","Content":"\n\u003Cp\u003E\nWell, I won the game by colonization victory, Aka colonize as many planets as possible. My empire is fungus materialist, focusing in economic warfare, an the ascension path that I take... Well I take megastructure-based ascension path, but for general strategy for newbie:\n\u003C/p\u003E\n\u003Cp\u003E\n1. In the beginning, EXPAND. Use your science ship to go to other star systems to get strategic view of the entire galaxy. If you\u0027ve researched automatic exploration, it becomes even easier. Expand your border by placing outpost and colonizing planet\n\u003C/p\u003E\n\u003Cp\u003E\n2. If there\u0027s a new alien contact and prompt to research it\u0027s language, don\u0027t bother. Let them be the one who did it for us, this gives you more time to expand\n\u003C/p\u003E\n\u003Cp\u003E\n3. Take the planet with as many times and resource nodes if possible. This will increase the space you can use to build mining camp and power plants, bolstering your economy. Sometimes colonizing a poor planet is viable if it allows you to get a strategic advantage in position\n\u003C/p\u003E\n\u003Cp\u003E\n4. If you have your first contact, the alien\u0027s territory will be revealed. If possible, RUSH immediately to capture nearby star systems around it\u0027s border, colonize and/or build outpost to confine them inside your territory/edge of galaxy. This will severely limit their movement so you can expand more. If you want to really confine them, just close your border, they won\u0027t have any free movement to expand their border\n\u003C/p\u003E\n\u003Cp\u003E\n5. Late game, energy becomes less critical, since you will mostly spend your time building fleet, where minerals is at must. In any case, you can sustain your economy alone with power plants during late game, build many power plants and use trader enclave to trade it with minerals for cash boost since energy is dirt cheap at this point. Or if you can build one, a dyson sphere can produce over 1000 energy per months, enough to cover your expenses and focus the entire planetary infrastructure for mining\n\u003C/p\u003E\n\u003Cp\u003E\n6. Weapon has their own advantage and disadvantage. Lasers are good against armor, but bad at damaging shield, projectiles are good against shield but bad at damaging armor, while missiles has no damage bonus against anything but has 100 percent accuracy against moving targets, but they can be shot down. Consider checking your enemy\u0027s ship status and their weapon preference before preparing fleet to face the\n\u003C/p\u003E\n\u003Cp\u003E\n7. My standard fleet usually consist of battleships fitted with focused arc emitter and kinetic artillery, supported by destroyers fitted with point defenses. This has a huge resource drain, but since I\u0027ve built a dyson sphere and has a stable economy, it didn\u0027t bother me for upkeep and repairs. My fleet has a power of around 700k\n\u003C/p\u003E\n\u003Cp\u003E\n8. If your standing is good with other empire (opinion 300 or higher, and you have military and technological advantage) there is usually an option (or their own request) to integrate their empire to your own (unless you\u0027re xenophobe). Doing this will integrate their species to your empire and all of their territory is transferred to yours, basically subjugating their empire without even firing a shot (I did this twice)\n\u003C/p\u003E\n\u003Cp\u003E\n9. Late game crisis can be very powerful. Observe any clues and prepare for them. If there\u0027s \u0022ghost signal\u0022 report, you will face The Contingency. if there\u0027s \u0022the coming storm\u0022, you will face Prethoryn Swarm. If there\u0027s \u0022ship warped in from another dimension\u0022, you will face the Unbidden. All of the has different mechanic and very powerful (I lost once against contingency but won against unbidden). 2 of those 3 crisis is triggered by something you or other empire did, Unbidden is triggered by researching jump drive, Contingency is triggered by Synth research (give them citizen rights)\n\u003C/p\u003E\n\u003Cp\u003E\nhope that helps \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFeel free to ask more\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-01-12T00:08:25Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/168061-ars/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022168061\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/168061-ars/\u0022 rel=\u0022\u0022\u003E@ARS\u003C/a\u003E yeah, my only problem with energy mid-late game is keeping it positive with fleets. Galactic force projection is a fun perk, I like that one.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I\u0027ve never gotten far enough to build a Dyson sphere, oh how I\u0027d like one though.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m doing a play through now, and I\u0027m rushing research and unity mainly, and trying to expand via colonization. A nearby Empire is actually inferior in tech, that never happens!! I\u0027m usually the inferior one \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve faced the contingency once, and scrouge twice (other games were done earlier because I had almost no hope), not the Unbidden though, but I have gotten jump drive before - but different crises. And I lost badly each time. Not \u003Cem\u003Enearly \u003C/em\u003Eenough fleet power. \n\u003C/p\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2018-01-12T01:05:15Z","Content":"\n\u003Cp\u003E\nA tip if you encounter unbidden in the next play through: they will warp in in one of the empire\u0027s territory (usually at the edge of the galaxy). It consist of a large fleet, an anchor and a portal. Their ship has a ton of shields but no armor and their attacks ignore armor (so don\u0027t bother equipping your ship with armor plating, they\u0027ll punch through, focus on spamming shields). Once they appear, RUSH to the portal location ASAP. Your priority target is the anchor then the portal, since portal can only be attacked after you destroy the anchor. The anchor is a beacon that calls Unbidden reinforcements every few months, so expect some heavy resistance and act fast. If you take too long, they will create another anchor in other star system and expand their territory (and reinforcement delivery rate). If your initial attack suffers more than 50 percent losses and defeat is inevitable, retreat and replenish your fleet. If you cannot repel them, then there\u0027s still hope: after a few years, the second and third faction of the unbidden will show up (with the same intention as the first) and predictably, they\u0027ll create anchor and portal too. During this time, they\u0027ll sometimes fight against each other. The key strategy for unbidden on late game is, the larger their territory, the more sparsely scattered their forces is, it also seems to delay their reinforcements. In short, once they have large enough territory, their forces is mainly on their borders while the portal and anchors deep inside their territory is unprotected or barely have any defenses. Use this opportunity to sneak a fleet to take out the portal and anchors ASAP (this will provoke main forces on the border to return to portal to defend it, but as their territory becomes large, it\u0027ll take some time before they arrived). Once all portals has been destroyed, no reinforcements will arrived anymore, leaving the rest of the unbidden is the last to deal with. The crisis ends if all unbidden fleet and their portals has been destroyed\n\u003C/p\u003E\n\u003Cp\u003E\nI managed to stop unbidden when they create their 2nd portal, when I attack it, they send all their fleet to defend it, allowing me to sneak a much larger fleet to 1st portal and destroy it before steamrolling the 2nd. Funnily enough, their portals appeared on another empire that has lower military and tech level, but constantly insulting me. Once unbidden appeared, they beg for me as a refugee, and after the crisis ends, they agreed to be integrated in my empire \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-12T01:07:21Z\u0022 title=\u002201/12/2018 01:07  AM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 12, 2018\u003C/time\u003E by ARS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-01-14T03:41:34Z","Content":"\n\u003Cp\u003E\nI\u0027m thinking of doing stellaris playthroughs at some point soon. Maybe talking about book ideas I have, and even roleplaying as alien species in it. Would you guys be interested in that? I already want to do one for an alien invasion story idea I have \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-08-23T13:30:17Z","Content":"\n\u003Cp\u003E\nSo, this is a revival, but it\u0027s also my thread, so....I\u0027m posting again!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSince 2.0 came out, I\u0027ve had a much better time building an economy, and fleet. Recently, I got Leviathans and Distant stars. And it\u0027s great! I got the Grey tempest, and fought it off with my \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E fleets (Psi jumpdrive/precog interface/shields, Dragonscale armor, everything else max tier aside from Dark matter techs) But now 2.2 is on its way, and it\u0027s a doozy. It\u0027s a full economic/planetary rework, and it looks to really improve the roleplaying and immersion aspect of the game. I\u0027m really excited for it.\n\u003C/p\u003E\n\u003Cp\u003E\nDev diary 120 \u003Ca href=\u0022https://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-120-new-economy-system.1114048/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-120-new-economy-system.1114048/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDev diary 121 \u003Ca href=\u0022https://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-121-planetary-rework-part-1-of-4.1115043/page-29#post-24588237\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-121-planetary-rework-part-1-of-4.1115043/page-29#post-24588237\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDev diary 122 (released today!) \u003Ca href=\u0022https://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-122-planetary-rework-part-2-of-4.1115992/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-122-planetary-rework-part-2-of-4.1115992/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNext one will be next week. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2018-08-23T15:14:26Z","Content":"\n\u003Cp\u003E\nI never got good at space combat, that is building ships that actually are more powerful as fleet strength comparison suggests ...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-08-23T15:15:00Z\u0022 title=\u002208/23/2018 03:15  PM\u0022 data-short=\u00225 yr\u0022\u003EAugust 23, 2018\u003C/time\u003E by KerbMav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2018-08-26T21:52:49Z","Content":"\n\u003Cp\u003E\nI\u0027ve considered buying this game, but I have two questions:\n\u003C/p\u003E\n\u003Cp\u003E\nIs there lots of replay value? Will it stop being interesting once I\u0027ve played through every main species type?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd is there a lot of micromanagement? Will large empires have much more time spent executing obvious decisions rather than deciding on what to do?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-08-27T23:46:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223440522\u0022 data-ipsquote-contentid=\u0022169477\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221535320369\u0022 data-ipsquote-userid=\u0022139256\u0022 data-ipsquote-username=\u0022Mad Rocket Scientist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/26/2018 at 5:52 PM, Mad Rocket Scientist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve considered buying this game, but I have two questions:\n\u003C/p\u003E\n\u003Cp\u003E\nIs there lots of replay value? Will it stop being interesting once I\u0027ve played through every main species type?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd is there a lot of micromanagement? Will large empires have much more time spent executing obvious decisions rather than deciding on what to do?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think so. I have 3 DLC\u0027s though (Utopia, Distant stars, and Leviathans), but I\u0027d really say: get Utopia. That\u0027s kinda a given. Because you can build megastructures and go down the ascension paths. I\u0027ve only had distant stars and leviathans for a couple weeks, but with just Utopia and the base game since Christmas, I had a lot of fun.\n\u003C/p\u003E\n\u003Cp\u003E\nThat might be up to you. I think there\u0027s lots of replay value, and there\u0027s a lot of main species types. Genocidal hive minds, spiritual psionics, synthetically ascended materialists, genetically engineered xenophiles, the list goes on. Apec has a playthrough of \u0022garbage aliens\u0022 where he played with all negative traits to see how well he\u0027d do. It\u0027s an outdated version though, still good.\n\u003C/p\u003E\n\u003Cp\u003E\nHmm, probably, yeah. Not exactly sure what you\u0027d consider obvious decisions though. When you get an advanced building you have to upgrade them individually, but that doesn\u0027t take \u003Cem\u003Etoo \u003C/em\u003Elong, and you can go back to deciding how  you want to proceed. And before wars you need to make sure your ships are retrofitted against whatever the enemy has. The 2.2 update coming out will massively improve the planetary management though, since it\u0027s a full economic and planetary update. The release date is TBD still.\n\u003C/p\u003E\n\u003Cp\u003E\nBut really, I\u0027d just watch maybe the distant stars, or apocalypse playthroughs by Aspec, as well as like the \u0022beginner\u0022 mechanics to give you a good idea of what to expect in the current game. The distant stars series is still ongoing actually. And the Apocalypse one is pretty good in my opinion. But at the end of the day, getting it is up to you. The game\u002Bexpansions can eventually get expensive without sales, so yeah, watch playthroughs before you buy \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2018-08-29T03:46:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223441059\u0022 data-ipsquote-contentid=\u0022169477\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221535413573\u0022 data-ipsquote-userid=\u0022152800\u0022 data-ipsquote-username=\u0022Spaceception\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/27/2018 at 4:46 PM, Spaceception said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think so. I have 3 DLC\u0027s though (Utopia, Distant stars, and Leviathans), but I\u0027d really say: get Utopia. That\u0027s kinda a given. Because you can build megastructures and go down the ascension paths. I\u0027ve only had distant stars and leviathans for a couple weeks, but with just Utopia and the base game since Christmas, I had a lot of fun.\n\u003C/p\u003E\n\u003Cp\u003E\nThat might be up to you. I think there\u0027s lots of replay value, and there\u0027s a lot of main species types. Genocidal hive minds, spiritual psionics, synthetically ascended materialists, genetically engineered xenophiles, the list goes on. Apec has a playthrough of \u0022garbage aliens\u0022 where he played with all negative traits to see how well he\u0027d do. It\u0027s an outdated version though, still good.\n\u003C/p\u003E\n\u003Cp\u003E\nHmm, probably, yeah. Not exactly sure what you\u0027d consider obvious decisions though. When you get an advanced building you have to upgrade them individually, but that doesn\u0027t take \u003Cem\u003Etoo \u003C/em\u003Elong, and you can go back to deciding how  you want to proceed. And before wars you need to make sure your ships are retrofitted against whatever the enemy has. The 2.2 update coming out will massively improve the planetary management though, since it\u0027s a full economic and planetary update. The release date is TBD still.\n\u003C/p\u003E\n\u003Cp\u003E\nBut really, I\u0027d just watch maybe the distant stars, or apocalypse playthroughs by Aspec, as well as like the \u0022beginner\u0022 mechanics to give you a good idea of what to expect in the current game. The distant stars series is still ongoing actually. And the Apocalypse one is pretty good in my opinion. But at the end of the day, getting it is up to you. The game\u002Bexpansions can eventually get expensive without sales, so yeah, watch playthroughs before you buy \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks, I\u0027ll take a look at those playthroughs.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-08-30T21:00:51Z","Content":"\n\u003Cp\u003E\nDev diary #123 part 3 of 4!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-123-planetary-rework-part-3-of-4.1116917/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-123-planetary-rework-part-3-of-4.1116917/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNearly forgot about this \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/No2UB8p0Y14?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2018-08-31T02:05:00Z","Content":"\n\u003Cp\u003E\nStellaris is pretty good, its my highest time played game, but usually i just make an empire and just expand until i get to a peak point around 2270, then a ton of internal stuff happens and my empire falls\n\u003C/p\u003E\n\u003Cp\u003E\ni also have no idea how to strategy for war stuff, so there\u0027s that too\n\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2018-08-31T04:44:58Z","Content":"\n\u003Cp\u003E\nIt\u0027s currently on sale on the humble store for %60 off. The DLCs are on less of a deal though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.humblebundle.com/store/stellaris\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.humblebundle.com/store/stellaris\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-08-31T13:19:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223442695\u0022 data-ipsquote-contentid=\u0022169477\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221535690698\u0022 data-ipsquote-userid=\u0022139256\u0022 data-ipsquote-username=\u0022Mad Rocket Scientist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Mad Rocket Scientist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s currently on sale on the humble store for %60 off. The DLCs are on less of a deal though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.humblebundle.com/store/stellaris\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.humblebundle.com/store/stellaris\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, for Distant stars and Apocalypse, which are recent ones. The others are pretty good. And Utopia is a great deal.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223442661\u0022 data-ipsquote-contentid=\u0022169477\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221535681100\u0022 data-ipsquote-userid=\u0022171175\u0022 data-ipsquote-username=\u0022StupidAndy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, StupidAndy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStellaris is pretty good, its my highest time played game, but usually i just make an empire and just expand until i get to a peak point around 2270, then a ton of internal stuff happens and my empire falls\n\u003C/p\u003E\n\u003Cp\u003E\ni also have no idea how to strategy for war stuff, so there\u0027s that too\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI had similar problems myself approaching the late game. But I\u0027ve gotten to the point I\u0027m superior/overwhelming to everyone aside from the fallen empires.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFor war, at least for me, I retrofit my ships to counter theirs, so I don\u0027t take much damage. And I make sure I have a bit a size advantage as well. So, for a 6k fleet, I\u0027d prefer to have an 8-10k fleet. This way I can attack their home systems with the stations as well as their fleet.\n\u003C/p\u003E\n\u003Cp\u003E\nI also look at the planets they have, and decide to attack in a way that leads me to all their worlds, and I just beeline for those. If I can, I usually leave a smaller, 2nd fleet at my borders, or a chokepoint to keep the enemy cornered until I have all their worlds. Or, if not busy, taking surrounding systems to up my war score.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-09-10T19:36:26Z","Content":"\n\u003Cp\u003E\nThis looks incredible. I can\u0027t wait to see streams of them actually playing it.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/MyJ9nYbvev0?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"XB-70A","CreatedById":144985,"CreatedDateTime":"2018-09-20T21:21:53Z","Content":"\n\u003Cp\u003E\nJust to give a huge thank to all of you for making me discover this game! Only 14 h 6 m since I downloaded it two weeks ago, but it\u0027s starting to become awesome. Despite being somewhat a bit hard (or complex to analyse) at the beginning, I\u0027ve found a way to stop being in dept, then fought and repaired the first battleship I\u0027ve met.\n\u003C/p\u003E\n\u003Cp\u003E\nThat game is really entertaining and pretty addictive too.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2018-09-20T21:27:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223454920\u0022 data-ipsquote-contentid=\u0022169477\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221537478513\u0022 data-ipsquote-userid=\u0022144985\u0022 data-ipsquote-username=\u0022XB-70A\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, XB-70A said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust to give a huge thank to all of you for making me discover this game! Only 14 h 6 m since I downloaded it two weeks ago, but it\u0027s starting to become awesome. Despite being somewhat a bit hard (or complex to analyse) at the beginning, I\u0027ve found a way to stop being in dept, then fought and repaired the first battleship I\u0027ve met.\n\u003C/p\u003E\n\u003Cp\u003E\nThat game is really entertaining and pretty addictive too.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep! The facebook group is nice too if you have facebook. I\u0027ve found it to be pretty civil so far. \n\u003C/p\u003E\n\u003Cp\u003E\nI also need to add the next dev diaries \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E124 \u003C/span\u003E\u003Ca href=\u0022https://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-124-planetary-rework-part-4-of-4.1117775/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-124-planetary-rework-part-4-of-4.1117775/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E125 \u003C/span\u003E\u003Ca href=\u0022https://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-125-the-galactic-market.1119230/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-125-the-galactic-market.1119230/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E126 (Released earlier today) \u003C/span\u003E\u003Ca href=\u0022https://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-126-sectors-and-factions-in-2-2.1120288/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://forum.paradoxplaza.com/forum/index.php?threads/stellaris-dev-diary-126-sectors-and-factions-in-2-2.1120288/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe game is only gonna get better with 2.2 \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}