{"TopicId":17697,"ForumId":18,"TopicTitle":"Second coming of my real-life work! - Click Cross! (a bike game with a twist)","CreatedByName":"Moach","CreatedById":9,"CreatedDateTime":"2012-08-24T20:34:06Z","PageNum":1,"Articles":[{"CreatedByName":"Moach","CreatedById":9,"CreatedDateTime":"2012-08-24T20:34:06Z","Content":"\n\u003Cp\u003Ealrighty then!\u003C/p\u003E\u003Cp\u003Ewe\u0027re past most of the heat now that it\u0027s been up for public beta for \u0027bout a week... still some work remains to be done, but while we\u0027re at it, i thought i\u0027d share...\u003C/p\u003E\u003Cp\u003Ethis is my job, much like my brother harvester - i am a game dev as well, and this is what i\u0027ve been up to for the last several months: \u003Ca href=\u0022www.clickjogos.com.br/clickcross\u0022 rel=\u0022external nofollow\u0022\u003Ewww.clickjogos.com.br/clickcross\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eyeah, it\u0027s a bike game! - with a full featured track editor and community-based approach to level design - plus, you can challenge your friends on the tracks you create and race through\u003C/p\u003E\u003Cp\u003Ethe UI is all in Brazillian portuguese -- but english language users don\u0027t seem to have much trouble with that up to now... as they tell me\u003C/p\u003E\u003Cp\u003Eanyways, just sharing the news about this somewhat significant milestone back here... the game is just around the corner for full completion, and it\u0027ll be my last game done in Flash (thank heavens!) -- after which, i shall take on the unmatched power of Unity3D!\u003C/p\u003E\u003Cp\u003Eanyways - have fun, then!\u003C/p\u003E\n"},{"CreatedByName":"AeroPelican","CreatedById":28509,"CreatedDateTime":"2012-08-27T07:43:06Z","Content":"\n\u003Cp\u003EPretty cool. I think I would like to be a programmer one day (once I survive school)\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-08-27T08:14:41Z","Content":"\n\u003Cp\u003ENice work! Huge fan of the level editor. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Menecroth","CreatedById":27542,"CreatedDateTime":"2012-08-28T23:42:08Z","Content":"\n\u003Cp\u003EThat\u0027s fun! Unfortunately I tend to spend more time on my face than on my wheels but still fun. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}