{"TopicId":183614,"ForumId":18,"TopicTitle":"Thread to discuss negative things in a very general way, just see where it goes y\u0026#039;know?","CreatedByName":"DAL59","CreatedById":180784,"CreatedDateTime":"2019-04-11T00:12:40Z","PageNum":114,"Articles":[{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-06-29T03:33:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224402245\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221719550601\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am upset. I was a member in good standing with a model radio control aircraft club for nearly 30 years. I joined in high school as a freshman and that was 97/98 school year. We as a club would have our dues come up in July at the meeting. Well as we know July is just days away. I was getting concerned that I had not yet seen the newsletter for June which would have the notice for the July meeting and when/ where it would be. I contacted at first the officer in charge of membership over a week ago and then a few days later having gotten 0 reply. Then yesterday I reached out to the vice president of the club seeking information. I finally got a reply back informing me the club dissolved. No word was sent out to members not on social media or not receiving the electronic newsletter or at the final meeting the dissolution occurred at. Im frustrated that this happened. Nearly 30 years dedicated in dues and loyalty to not be given the courtesy of being told the clubs gone before nearly spamming the entire leadership wanting to just be a good upstanding member.\n\u003C/p\u003E\n\u003Cp\u003E\n235606272024\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat really blows.  Im very sorry that has happened. I hope that you are able to fill that hole with local hobbyists connected through FB groups / reddit. \u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2024-06-29T05:24:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224402549\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221719632022\u0022 data-ipsquote-userid=\u0022227275\u0022 data-ipsquote-username=\u0022Fizzlebop Smith\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Fizzlebop Smith said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat really blows.  Im very sorry that has happened. I hope that you are able to fill that hole with local hobbyists connected through FB groups / reddit. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you. Part of why I had no clue aside from the officer of the club in charge of members/membership is because I avoid social media like the plague. I have fb but have not used it since maybe 2014, instagram hasnt seen me post since my cat lia passed 5 years ago. Im irritated by them not respecting not only me (ive a nasty issue there too as it feels like a pattern to my existence) but the club as a whole that is like me and doesnt do social media, avoids crowds and prefers physical literature over digital bs. I stressed over this until finding out the club was gone all because they couldnt bother informing people. Worse yet the membership guy that i contacted prior to contacting the clubs vp NEVER BOTHERED TO REPLY!!! I joined in the late 1990’s around 1997 and it counted for nothing!!! \u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E At least the vp showed respect by replying and offering alternatives.\n\u003C/p\u003E\n\u003Cp\u003E\n002406292024\n\u003C/p\u003E\n"},{"CreatedByName":"AstroWolfie","CreatedById":223932,"CreatedDateTime":"2024-06-29T17:56:43Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022It\u0027s Jebover : r/KSPMemes\u0022 data-ratio=\u0022100.00\u0022 width=\u0022500\u0022 src=\u0022https://i.redd.it/0kgp1ly8cvxc1.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Lisias","CreatedById":187168,"CreatedDateTime":"2024-06-30T11:14:08Z","Content":"\n\u003Cp\u003E\nDo you want to know why the Game Industry is risking going downhill? Whatch this video.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 title=\u0022Let’s go whaling: Tricks for monetising mobile game players with free-to-play\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube-nocookie.com/embed/xNjI03CGkb4?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSomehow, Casino businessmen got their way into this Industry in an uncontrolled and unchecked way - simple like that.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m trying hard to avoid judgments of value and morality issues here, but when you look into Casinos as a higher moral stand (there\u0027re no children on Casinos, are there?), you know you are looking into something really, really messed up.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-01T21:41:41Z\u0022 title=\u002207/01/2024 09:41  PM\u0022 data-short=\u0022Jul 1\u0022\u003EJuly 1\u003C/time\u003E by Lisias\u003C/strong\u003E\n\u003Cbr\u003EEntertaining grammars made slightely less entertaining...\n\u003C/span\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2024-06-30T22:11:59Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#27292d;color:rgba(255,255,255,0.9);font-size:16px;\u0022\u003EOur kid just bought a 2002 CRV (with our help) to get him around. I replaced the leaky oil pressure switch but it wouldn’t stop leaking. At first I didn\u0027t tighten it much, and when it kep leaking I tightened it more and more, until the leak got much worse. Uh-oh. I took it out and took a close look by lowering my phone down behind the engine while recording video. This is what I saw... \u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E. I dunno if the previous owner over tightened or if I did trying to get it to stop leaking.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Awskn6Q.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022211.42\u0022 height=\u00222000\u0022 width=\u0022923\u0022 src=\u0022https://i.imgur.com/Awskn6Q.jpeg\u0022\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#27292d;color:rgba(255,255,255,0.9);font-size:16px;\u0022\u003EI\u0027m going to try to JBWeld it to kingdom come tomorrow, after blasting it with brake cleaner...\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"AstroWolfie","CreatedById":223932,"CreatedDateTime":"2024-07-01T23:52:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224402886\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221719746048\u0022 data-ipsquote-userid=\u0022187168\u0022 data-ipsquote-username=\u0022Lisias\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/30/2024 at 4:14 AM, Lisias said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo you want to know why the Game Industry is risking going downhill? Whatch this video.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 title=\u0022Let’s go whaling: Tricks for monetising mobile game players with free-to-play\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube-nocookie.com/embed/xNjI03CGkb4?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSomehow, Casino businessmen got their way into this Industry in an uncontrolled and unchecked way - simple like that.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m trying hard to avoid judgments of value and morality issues here, but when you look into Casinos as a higher moral stand (there\u0027re no children on Casinos, are there?), you know you are looking into something really, really messed up.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe video I watched actually touched on this very video. Absolutely disgusting and evil. Can we arrest these guys?\n\u003C/p\u003E\n"},{"CreatedByName":"Lisias","CreatedById":187168,"CreatedDateTime":"2024-07-02T05:11:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224403398\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221719877927\u0022 data-ipsquote-userid=\u0022223932\u0022 data-ipsquote-username=\u0022AstroWolfie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, AstroWolfie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe video I watched actually touched on this very video. Absolutely disgusting and evil. Can we arrest these guys?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNope, there\u0027s nothing illegal on it. Casinos do exactly the same, everything inside a Casino is tweaked to induce you to spend your money. All your money.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s the reason I\u0027m (trying, and failing) to refrain myself from doing judgements of value or pinpointing morality issues - \u003Cstrong\u003Eit\u0027s not a crime, it\u0027s perfectly legal\u003C/strong\u003E do to that. Caveat emptor, literally.\n\u003C/p\u003E\n\u003Cp\u003E\nBut even Casinos don\u0027t entice kids - what these guys gladly do, even if they can\u0027t cajole money form them, as they need to keep the servers full of cannon fodders so the paying customers can have a fun on them.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m libertarian, I believe that everybody have the right to screw their lives the way they want - as long it\u0027s an informed decision.\n\u003C/p\u003E\n\u003Cp\u003E\nKids are unable of such judgment.\n\u003C/p\u003E\n\u003Cp\u003E\nThings keep going this way, we will need to rely on Nintendo as a walled garden for our kids be allowed to play videogames.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-02T06:54:55Z\u0022 title=\u002207/02/2024 06:54  AM\u0022 data-short=\u0022Jul 2\u0022\u003EJuly 2\u003C/time\u003E by Lisias\u003C/strong\u003E\n\u003Cbr\u003EYeah, tyops...\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2024-07-02T07:02:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224402886\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221719746048\u0022 data-ipsquote-userid=\u0022187168\u0022 data-ipsquote-username=\u0022Lisias\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/30/2024 at 3:14 AM, Lisias said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo you want to know why the Game Industry is risking going downhill? Whatch this video.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 title=\u0022Let’s go whaling: Tricks for monetising mobile game players with free-to-play\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube-nocookie.com/embed/xNjI03CGkb4?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSomehow, Casino businessmen got their way into this Industry in an uncontrolled and unchecked way - simple like that.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m trying hard to avoid judgments of value and morality issues here, but when you look into Casinos as a higher moral stand (there\u0027re no children on Casinos, are there?), you know you are looking into something really, really messed up.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyea im not doing f2p anymore. as mwo comes to its end and quasi-official rumors about the possibility of a new mechwarrior pvp game after the launch of clans. ive already spelled it out in clear terms that if it is f2p i am abandoning the franchise. im fed up with games that cannot be completed. because no matter what you buy they always want more. if they cant sell me a whole game at a flat rate, im not interested. i guess that leaves ksp and a bunch of retro games. at least i wont need to spend a fortune on gpus and can run linux.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-02T07:03:49Z\u0022 title=\u002207/02/2024 07:03  AM\u0022 data-short=\u0022Jul 2\u0022\u003EJuly 2\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2024-07-02T08:16:24Z","Content":"\n\u003Cp\u003E\nforgot to complain about current thing.\n\u003C/p\u003E\n\u003Cp\u003E\nmom got me out of bed early to clean up after lizzy, who keeps crapping under her desk. i presume the reason is because lizzy can no longer fit through the hole in the structure containing her litter box. keep in mind that this was a nine and a half inch circular hole. which is huge for an animal that is supposed to be able to squeeze through anything she can get her head into. so after i saw her have difficulty with said hole, this started an \u0022hour long\u0022 project to make the hole bigger. i had a piece of particle board in the shed, which is an upgrade from corrugated. i cut an ovoid by cutting two semicircular slots with my dremel radius cutter. and cut between them. now she has a 10x12 inch hole. the panel goes on the front of mom\u0027s old sewing desk, but which turned into a dumping ground for her creepy doll collection as her disabilities accumulated. perfect place for a litter box imho. i had cut a large piece of cardboard to fill the front, leaving a gap for the cubby and drawer in the corner of the desk. this was wearing out, and the cat hole was too small. so now i can cut the cardboard door down (replacing it is the next project i suppose, as soon as i find the right material on the side of the road).\n\u003C/p\u003E\n\u003Cp\u003E\ngetting the panel to fit took about 2 hours, keep in mind i had the thing laid out and cut in 30 minutes at that point. 2 dimensions were off and i ended up whittling at them with a utility knife until it fit. i needed 2 more structural bits. the thing screwed to the perimeter of the cubby/drawer compartment and a structural cross beam under the desktop. i needed a short piece of wood on the right side to screw to and a longer piece of wood on the other side for the closure and also add some stiffness to the particle board. both of them were too long. i had measured, i had marked, and checked the marks several times and still manage to cut them too long. the right side was actually the \u0022right\u0022 length, but it conflicted with the aforementioned structural beam, which i didn\u0027t account for in my measurement. and the left side was simply too long, seems i cut on the wrong mark. but dinner happened and interrupted the project. at this point 6 hours had past.\n\u003C/p\u003E\n\u003Cp\u003E\nthe cuts were also more trouble than id like to admit. my last blade for the jigsaw broke 4 projects ago (may have been the doorknob fiasco. what can i say, tooling is expensive and im cheap and poor). i had consumed all but 2 of my dremel cut off wheels on the previous case modding project (got a 4th gen intel and 1060 into a 10l business/htpc case, but its my 4th most powerful computer, out of 4 and a steam deck, the deck is #3). the hero of this story is a cheap disposable one use plastic hacksaw i bought for a quick and dirty repair when i was doing bike assembally (that was 20 years ago). not only has it lasted longer than it should but it still has the original metal cutting blade, and it has cut a lot of metal. dull af. still it managed to devour the scrap wood i found in my shed (parts of an old cradle which, also held dolls, mom has a doll problem). it turned out to be a waste of elbow grease, as 2 of the cuts were wrong. it my growing exhaustion, i drew a line and bisected it with a drill bit it 20 different directions. spinny thing cut straight? no. also complaints about my power drill would require another post of equal length. i cleaned them up with a file (oh but not a wood file, that would be easy). DONT BUY CHEAP TOOLS AND DONT SKIMP ON TOOLING!\n\u003C/p\u003E\n\u003Cp\u003E\nahem. anyway 10 hours later (not including the hour it took to clean up and put tools away) project was success. ugly yes, do the screw match, no, does the cat fit, sadie does, but lizzy hasn\u0027t stopped sleeping on my desk yet. final installation ensued. screws went in. stuff lined up. the magnetic closures i had used on the cardboard model had been successfully extracted and re-glued into holes drilled into the particle board and left side member. the hammered down and flattened pc slot covers were hot glued to the remaining cardboard door. i sunk a few more screws and put one on the inside to hang my litter scoop. cats are low maintenance they say. ha!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-02T08:18:02Z\u0022 title=\u002207/02/2024 08:18  AM\u0022 data-short=\u0022Jul 2\u0022\u003EJuly 2\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2024-07-03T07:25:35Z","Content":"\n\u003Cp\u003E\nive been watching a ton of youtube shorts and have been seeing a bunch involving the movie: Hidden Figures. I finally decided that I want to see/buy the movie, so I did as I always would went to the website for best buy and searched for the movie. I was confused why toys not related to a NASA themed movie set in the late 50\u0027s early 60\u0027s was popping up. Then I tried to search their departments not finding the one related to movies. I could not fathom why I couldnt find anything. Then I googled the query: did best buy stop selling movies. Answer? Yup. They have decided to cease all physical media sales other than video games as of the start of this year. I am sorry but what? I am wholeheartedly against only having access to digital copies of anything. It makes me nervous to only have digital copies of Elite Dangerous and MSFS2020 as examples. I do not fully own these copies, only my access to them that can frankly be revoked by Frontier or Microsoft at any time for any reason even if I have broken no rules. The same goes for e-books or digital copies of movies. Do any of you remember digital copies from Ultraviolet? I doubt most of you will. See, thats a problem. When you have only a digital copy of something you do not truly own it. Anyone a fan of the movie Dogma? If you do not have a copy good luck. You cannot stream it, you cannot buy it anywhere for cheap. Its impossible to find. If you had a digital copy of it, you dont now. That simple. Heck, I love going into libraries that have been around 50\u002B years just to smell the musty tome smell. I love wandering the stacks. Cannot get that on a kindle. I hate our NOW NOW NOW GIMME GIMME GIMME ME ME ME ME eww youre different get away from me and stop existing society we have now and its getting worse. This recent discovery that now I have to search further afield to find things like Studio Ghibli movies or even movies from a few years ago or anything is alarming and it should be to you too.\n\u003C/p\u003E\n\u003Cp\u003E\n022407032024\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2024-07-03T19:58:21Z","Content":"\n\u003Cp\u003E\nits like the decline and fall of the roman empire, part 2. the decadence is there, the internal strife is there, the degradation of moral principals. all there. they want to charge you $10 for a bologna sandwich (no cheese, no condiments, one slice of meat on white bread), then call you entitled when you cant afford it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-03T20:01:51Z\u0022 title=\u002207/03/2024 08:01  PM\u0022 data-short=\u0022Jul 3\u0022\u003EJuly 3\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LHACK4142","CreatedById":208897,"CreatedDateTime":"2024-07-04T18:47:30Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to learn Haydn\u0027s cello concerto in C, but impatience and frustration is getting to me.  It feels like there\u0027s an indefinite amount of slow practice I have to do over and over again, and that I\u0027ll never be able to actually play the piece.  I wanna play the piece, dangit!!  So, I end up rushing through it just to \u0022play\u0022 it, then I miss all the notes, and get frustrated.  This \u003Cem\u003Every\u003C/em\u003E delayed gratification is a good thing to learn, especially in this internet/instant gratification era, but man is it hard.\n\u003C/p\u003E\n\u003Cp\u003E\nI also don\u0027t know what to think while practicing.  Often I\u0027m just practicing, and some random thought comes through and I screw up.  UGH!\n\u003C/p\u003E\n"},{"CreatedByName":"Fizzlebop Smith","CreatedById":227275,"CreatedDateTime":"2024-07-04T19:19:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224402886\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221719746048\u0022 data-ipsquote-userid=\u0022187168\u0022 data-ipsquote-username=\u0022Lisias\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/30/2024 at 4:14 AM, Lisias said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo you want to know why the Game Industry is risking going downhill? Whatch this video.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 title=\u0022Let’s go whaling: Tricks for monetising mobile game players with free-to-play\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube-nocookie.com/embed/xNjI03CGkb4?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSomehow, Casino businessmen got their way into this Industry in an uncontrolled and unchecked way - simple like that.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m trying hard to avoid judgments of value and morality issues here, but when you look into Casinos as a higher moral stand (there\u0027re no children on Casinos, are there?), you know you are looking into something really, really messed up.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI feel this as infected much of the world. \n\u003C/p\u003E\n\u003Cp\u003E\nI work in a very small corner of an engineering field. Once upon a time, the engineers were... well engineers. I cannot tell you how much I have learned from engineers with a PhD.\n\u003C/p\u003E\n\u003Cp\u003E\nI cannot tell you when it happened.. like some slimy insidious mild that infects EVERYTHING before you realize it is too late.\n\u003C/p\u003E\n\u003Cp\u003E\nNow all the Engineers have MBA \u0026amp; the quality standard has become \u0022it\u0027s not just good, it\u0027s good enough\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI grow ever more frustrated as the focus continues to shift from quality to quantity. I\u0027ve only became aware of my own \u0022footprint\u0022 in the last decade or so. I hate that I was not more conscientious during my formative years.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-04T19:50:48Z\u0022 title=\u002207/04/2024 07:50  PM\u0022 data-short=\u0022Jul 4\u0022\u003EJuly 4\u003C/time\u003E by Fizzlebop Smith\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2024-07-04T21:23:37Z","Content":"\n\u003Cp\u003E\nits sad when what once was a $100/hr job is now done by interns. nobody wants to pay for talent anymore when you can just sell a bunch of defective junk that the customer has to buy again in 2 years. same kind of bs happens in music, movies, video games, etc. the only solution is for people to stop buying these products en masse.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nmom is already yelling at me to go downtown for street food. she refuses to go herself even though she constantly complains about being cooped up in the house because of her disabilities. she can do it, she has the power chair. ive never been comfortable asking someone to do something i wouldn\u0027t do myself. especially when i have crippling anxiety about crowds. i suppose il just get it over with and get yelled at again when i get something she doesn\u0027t like.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-04T21:24:48Z\u0022 title=\u002207/04/2024 09:24  PM\u0022 data-short=\u0022Jul 4\u0022\u003EJuly 4\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lisias","CreatedById":187168,"CreatedDateTime":"2024-07-04T21:54:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224404511\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720120750\u0022 data-ipsquote-userid=\u0022227275\u0022 data-ipsquote-username=\u0022Fizzlebop Smith\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Fizzlebop Smith said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNow all the Engineers have MBA \u0026amp; the quality standard has become \u0022it\u0027s not just good, it\u0027s good enough\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIMHO, that\u0027s the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nYou see, good engineering was always about finding the \u0022good enough\u0022 sweat spot - money is a finite resource, trying to do everything perfect will bankrupt you before the end of the project.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027re exceptions to that rule, but they are few.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\nAs an example, see Boeing Starliner - a unholy mashup of good engineering and bad engineering tied together and launched into space. That damned thing didn\u0027t killed anyone because there\u0027re very, very good engineers working on that thing. But it\u0027s failing to fulfill its role properly because there\u0027re some bad ones working unchecked on that thing too.\n\u003C/p\u003E\n\u003Cp\u003E\nYou didn\u0027t realize the problem because the previous generation (the ones that came before you and me) did a really, really, really good job. It took decades until the bad ones managed to start to screw up things enough to the industry start to crumble.\n\u003C/p\u003E\n\u003Cp\u003E\nI know you know what follows, but some people around here doesn\u0027t, so I will go \u0022condescending mode\u0022 from this point so they can be part of this discussion. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWe write software in layers. The best are the lower layers, most resilient they are to stupidities made on the higher ones.\n\u003C/p\u003E\n\u003Cp\u003E\nFor some time, idiots on the higher management managed (pun not intended) to walk from their stupidity because there were good engineers enough in the field working on the lower layers of the Software, and these heroes carried on the burden on their shoulders and prevented the disaster.\n\u003C/p\u003E\n\u003Cp\u003E\nBut as the good ones started to retire, their positions started to be filed by the stupid engineers that Idiots were hiring in the past - and then we have bad engineering happening on the lower layers of the Software Stack - and when this happens, there\u0027s no point on hiring excellent engineers to work on the higher layers, because they will be forever sabotaged by the stupidities on the lower ones.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, in essence, the problem is not being \u0022good enough\u0022, but \u003Cstrong\u003E\u003Cu\u003EIDIOTS DECIDING WHAT\u0027S GOOD ENOUGH\u003C/u\u003E.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n--- -- - POST EDIT - -- ---\n\u003C/p\u003E\n\u003Cp\u003E\nAnyone willing to bite this bait \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E \u003C/span\u003E, we moved the discussion to this:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022187168\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed3004083812\u0022 src=\u0022https://forum.kerbalspaceprogram.com/topic/225337-off-topic-a-thread-to-digress/?do=embed\u0026amp;comment=4404583\u0026amp;embedComment=4404583\u0026amp;embedDo=findComment#comment-4404583\u0022 style=\u0022height:264px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-05T00:13:34Z\u0022 title=\u002207/05/2024 12:13  AM\u0022 data-short=\u0022Jul 5\u0022\u003EJuly 5\u003C/time\u003E by Lisias\u003C/strong\u003E\n\u003Cbr\u003EPOST EDIT\n\u003C/span\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2024-07-04T23:18:48Z","Content":"\n\u003Cp\u003E\nI\u0027ve had nuclear anxiety for almost half my life. It\u0027s on and off.\n\u003C/p\u003E\n\u003Cp\u003E\nI sometimes find myself having otherwise gone about my day just fine, only to frown because something triggered me and I realize the world is careening towards a disaster that will kill billions. I look at people on the street and (living in a well off part of the US) marvel at how happy and oblivious they are, and then am overcome by thoughts of the suffering they may have in store for them in the future. It makes me so upset at the people in charge and the wider population who don\u0027t speak up over the direction the world is taking.\n\u003C/p\u003E\n\u003Cp\u003E\nSometimes I have a thought that it would be better not to think about it if I can\u0027t have an impact anyways, but that\u0027s the kind of thing that lets the problem drag on.\n\u003C/p\u003E\n\u003Cp\u003E\nSo instead I end up... embracing it?\n\u003C/p\u003E\n\u003Cp\u003E\nOne coping mechanism is to read Fallout lore and listen to a little playlist of 40s and 50s music I have on my phone. I just drop concern for the individual livelihoods of other human beings (which really isn\u0027t my business anyways. I\u0027d hate to have someone telling \u003Cem\u003Eme\u003C/em\u003E how to \u0022live long and prosper\u0022) and instead treat it like a... historical research project? Living in a movie? Living in some sort of Fallout game set in the pre-war era? I don\u0027t go crying and fretting over every homeless person in the city so why would I do so in the event of nuclear catastrophe?\n\u003C/p\u003E\n\u003Cp\u003E\nI see Fallout and all the hubris that destroyed that world, and see it here too. There\u0027s even the enthusiasm for science and tech without limits too.\n\u003C/p\u003E\n\u003Cp\u003E\nI guess my subconscious thinking then goes like this: Fallout = kinda like real life*, Fallout = cool, so real life = cool? And then I just listen to that music and enjoy reading news about political developments or new advances in science, awaiting for it to all (possibly) end in some pretty explosions. Yes, pretty. Because if people find storms beautiful in art, and tsunamis and typhoons inspire awe and respect for nature, I don\u0027t see why nuclear war wouldn\u0027t inspire awe and respect for the power of humankind. Even if it is destructive towards people, just as storms are destructive towards other living things.\n\u003C/p\u003E\n\u003Cp\u003E\n*IMO of course.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSidebar: The opening scene of the Fallout series was incredibly well done. Not only if you look at a map, you realize one of the places to get nuked in the distance was Hollywood, but having a kid\u0027s birthday party ruined by nuclear war was a great way to set the tone. Whether that\u0027s super dark and horrible or just really good black humor is up to the individual.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIdk. Sometimes the way to deal with a feeling of nigh-divine, near-natural-disaster-like doom is to embrace what causes it. Granted, I am spiritual and probably don\u0027t worry as much about ensuring my own physical existence than the average person. So from a certain point of view, I can joke and trivialize disaster without feeling like I\u0027m allowing myself to fall into danger, because I feel I never truly am in danger. And as for other people? That\u0027s their problem, and rightly so. I for one would not want someone constantly instructing me on how I \u0022need\u0022 to ensure my own safety and happiness, at least when it comes to big, abstract concepts of security (\u0022world peace\u0022, etc.) that don\u0027t pertain to \u003Cem\u003Eimmediate\u003C/em\u003E physical safety.\n\u003C/p\u003E\n\u003Cp\u003E\nI could go on but I\u0027d be rambling more than I already have. I hope this isn\u0027t political, I didn\u0027t think it was after reading it over.\n\u003C/p\u003E\n"},{"CreatedByName":"boriz","CreatedById":219053,"CreatedDateTime":"2024-07-05T00:29:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224404587\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720135128\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve had nuclear anxiety for almost half my life.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s not all bad news. If you survive the blast, most of the dangerous radioactivity fades significantly after about two weeks. If you can remain uncontaminated for, say one month, your prognosis is good.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2024-07-05T01:30:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224403846\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221719991535\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/3/2024 at 3:25 AM, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThey have decided to cease all physical media sales other than video games as of the start of this year. I am sorry but what?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFirst Netflix, then Redbox (Still around but dying fast), now Best Buy, soon probably even places like Wal Mart will toss the DVD bin.\n\u003C/p\u003E\n\u003Cp\u003E\nI agree it\u0027s sad. I don\u0027t want to pay $8 to \u0022rent\u0022 the ability to watch some obscure flick I just remembered. I want to *BUY* it for $3 from a bin.\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2024-07-05T01:32:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224404503\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720118850\u0022 data-ipsquote-userid=\u0022208897\u0022 data-ipsquote-username=\u0022LHACK4142\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, LHACK4142 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m trying to learn Haydn\u0027s cello concerto in C, but impatience and frustration is getting to me.  It feels like there\u0027s an indefinite amount of slow practice I have to do over and over again, and that I\u0027ll never be able to actually play the piece.  I wanna play the piece, dangit!!  So, I end up rushing through it just to \u0022play\u0022 it, then I miss all the notes, and get frustrated.  This \u003Cem\u003Every\u003C/em\u003E delayed gratification is a good thing to learn, especially in this internet/instant gratification era, but man is it hard.\n\u003C/p\u003E\n\u003Cp\u003E\nI also don\u0027t know what to think while practicing.  Often I\u0027m just practicing, and some random thought comes through and I screw up.  UGH!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nits like that one riff in ironman i still cant play. if i cant learn some iommi licks how can i call myself a metalhead.\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2024-07-05T01:47:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224404587\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720135128\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve had nuclear anxiety for almost half my life. It\u0027s on and off.\n\u003C/p\u003E\n\u003Cp\u003E\nI sometimes find myself having otherwise gone about my day just fine, only to frown because something triggered me and I realize the world is careening towards a disaster that will kill billions. I look at people on the street and (living in a well off part of the US) marvel at how happy and oblivious they are, and then am overcome by thoughts of the suffering they may have in store for them in the future. It makes me so upset at the people in charge and the wider population who don\u0027t speak up over the direction the world is taking.\n\u003C/p\u003E\n\u003Cp\u003E\nSometimes I have a thought that it would be better not to think about it if I can\u0027t have an impact anyways, but that\u0027s the kind of thing that lets the problem drag on.\n\u003C/p\u003E\n\u003Cp\u003E\nSo instead I end up... embracing it?\n\u003C/p\u003E\n\u003Cp\u003E\nOne coping mechanism is to read Fallout lore and listen to a little playlist of 40s and 50s music I have on my phone. I just drop concern for the individual livelihoods of other human beings (which really isn\u0027t my business anyways. I\u0027d hate to have someone telling \u003Cem\u003Eme\u003C/em\u003E how to \u0022live long and prosper\u0022) and instead treat it like a... historical research project? Living in a movie? Living in some sort of Fallout game set in the pre-war era? I don\u0027t go crying and fretting over every homeless person in the city so why would I do so in the event of nuclear catastrophe?\n\u003C/p\u003E\n\u003Cp\u003E\nI see Fallout and all the hubris that destroyed that world, and see it here too. There\u0027s even the enthusiasm for science and tech without limits too.\n\u003C/p\u003E\n\u003Cp\u003E\nI guess my subconscious thinking then goes like this: Fallout = kinda like real life*, Fallout = cool, so real life = cool? And then I just listen to that music and enjoy reading news about political developments or new advances in science, awaiting for it to all (possibly) end in some pretty explosions. Yes, pretty. Because if people find storms beautiful in art, and tsunamis and typhoons inspire awe and respect for nature, I don\u0027t see why nuclear war wouldn\u0027t inspire awe and respect for the power of humankind. Even if it is destructive towards people, just as storms are destructive towards other living things.\n\u003C/p\u003E\n\u003Cp\u003E\n*IMO of course.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSidebar: The opening scene of the Fallout series was incredibly well done. Not only if you look at a map, you realize one of the places to get nuked in the distance was Hollywood, but having a kid\u0027s birthday party ruined by nuclear war was a great way to set the tone. Whether that\u0027s super dark and horrible or just really good black humor is up to the individual.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIdk. Sometimes the way to deal with a feeling of nigh-divine, near-natural-disaster-like doom is to embrace what causes it. Granted, I am spiritual and probably don\u0027t worry as much about ensuring my own physical existence than the average person. So from a certain point of view, I can joke and trivialize disaster without feeling like I\u0027m allowing myself to fall into danger, because I feel I never truly am in danger. And as for other people? That\u0027s their problem, and rightly so. I for one would not want someone constantly instructing me on how I \u0022need\u0022 to ensure my own safety and happiness, at least when it comes to big, abstract concepts of security (\u0022world peace\u0022, etc.) that don\u0027t pertain to \u003Cem\u003Eimmediate\u003C/em\u003E physical safety.\n\u003C/p\u003E\n\u003Cp\u003E\nI could go on but I\u0027d be rambling more than I already have. I hope this isn\u0027t political, I didn\u0027t think it was after reading it over.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nsometimes i think im not suited to a well ordered world where all problems have readily available solutions. im more suited to the wastelands. i can turn my empathy off in a heartbeat and am paranoid in all things. good traits to have in a wasteland. i would probibly die, but not before a lot of other people. i just had two panic attacks trying to acquire a couple vietnamese chicken sandwiches on the 4th (thousands of vietnam war veterans are turning in their graves). its always the small stuff that gets me. as for the apocalypse, bring it.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2024-07-05T02:01:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224404616\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720144037\u0022 data-ipsquote-userid=\u002210883\u0022 data-ipsquote-username=\u0022Nuke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, Nuke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ntrying to acquire a couple vietnamese chicken sandwiches on the 4th (thousands of vietnam war veterans are turning in their graves).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNaw they\u0027d be cool with it. At least the reasonable ones.\n\u003C/p\u003E\n\u003Cp\u003E\nMe, I had tacos today and didn\u0027t feel the least bit bad.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2024-07-05T02:42:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224404613\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720143004\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFirst Netflix, then Redbox (Still around but dying fast), now Best Buy, soon probably even places like Wal Mart will toss the DVD bin.\n\u003C/p\u003E\n\u003Cp\u003E\nI agree it\u0027s sad. I don\u0027t want to pay $8 to \u0022rent\u0022 the ability to watch some obscure flick I just remembered. I want to *BUY* it for $3 from a bin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhen you “buy” a song on the itunes store or “buy” a digital copy of a movie or game you did NOT buy it. You agreed to a long term RENTAL. Subject to the whims of the company you entered into that rental with. Lets say you got a digital copy of a movie and it was pg-13 to maybe R rated but as filmed was so violent, so gory it would have earned an NC-17 or stricter rating. What happens if you have children and because you only allow up to R rated movies your digital collection is basically safe for kids with proper supervision. Well that movie described above got an unrated directors cut rerelease to replace, REPLACE that movies first release but you dont know it happened. You decide to reward your child with their first unsupervised R rated movie. They choose this movie. Its unrated now and would make michael myers cringe. Your child got exposed to that because you had lost access to the R version because you did not have physical media.\n\u003C/p\u003E\n\u003Cp\u003E\nam i being hyperbolic? I hope so, but given our world today? Sadly i dont think im guessing wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nmy opinion and fear only, yours may differ. Heres a bowl of salt on my right, torches, and pitch forks to my left.\n\u003C/p\u003E\n\u003Cp\u003E\n214107042024\n\u003C/p\u003E\n"},{"CreatedByName":"boriz","CreatedById":219053,"CreatedDateTime":"2024-07-05T06:58:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224404613\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720143004\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u0022Superfluous J\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Superfluous J said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t want to pay $8 to \u0022rent\u0022 the ability to watch some obscure flick\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSame reason I hate Steam. I wouldn\u0027t touch it with a shi**y stick. Or anything else that promotes \u0027games as a service\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Bonx50j.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022106.67\u0022 height=\u0022736\u0022 width=\u0022690\u0022 src=\u0022https://i.imgur.com/Bonx50j.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: To be clear, I don\u0027t condone piracy. Indeed I \u003Cem\u003Eown\u003C/em\u003E hundreds of games, including KSP, all paid for fair and square. However, if I find something I\u0027d like to try, but it seems to be exclusive to Steam, I\u0027ll try to contact the Dev directly and offer to pay them the full un-discounted price. If they don\u0027t answer or if they turn me down, I figure I\u0027ve done my due diligence.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-05T07:52:20Z\u0022 title=\u002207/05/2024 07:52  AM\u0022 data-short=\u0022Jul 5\u0022\u003EJuly 5\u003C/time\u003E by boriz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2024-07-05T10:32:57Z","Content":"\n\u003Cp\u003E\nid hate steam and others less if i could transfer games between stores or even play classic games ive previously purchased on disc for free or even a small fee for the transfer. instead i think im going to archive ccd images of those games for long term bulk storage on my nas. there are a few on there already, you can pull the images off the internet but no way to determine if they are clean or not. some of them games have been in my cd case for well over 20 years and may not even work. so the clock is kind of ticking. i did find out the cd drive in mom\u0027s comp still works with only the loading mechanism being toast (its either a broken belt or sticky lube, so easy to fix).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-05T10:34:48Z\u0022 title=\u002207/05/2024 10:34  AM\u0022 data-short=\u0022Jul 5\u0022\u003EJuly 5\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"boriz","CreatedById":219053,"CreatedDateTime":"2024-07-05T12:35:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224404666\u0022 data-ipsquote-contentid=\u0022183614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720175577\u0022 data-ipsquote-userid=\u002210883\u0022 data-ipsquote-username=\u0022Nuke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Nuke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nid hate steam and others less if i could transfer games between stores or even play classic games ive previously purchased on disc for free or even a small fee for the transfer.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWon\u0027t happen. It defies their \u0027squeeze them every which way you can\u0027 business model. They want to force gamers to pay continuously for their \u0027service\u0027, while being advertised at and stealing PC resources, clock cycles, memory, bandwidth and personal data. (You did read the non-privacy agreement before agreeing to it, right?). Oh, and if they choose for whatever reason, to suspend your account, you \u003Cem\u003Elose all the games you paid for\u003C/em\u003E. So, you probably shouldn\u0027t type on the forum something outrageously offensive, like...\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nWomen don\u0027t have pen*ses. Or Trump should be in prison.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n... for example.\n\u003C/p\u003E\n\u003Cp\u003E\nThis has made Steam a huge pile of money, despite not actually producing anything. Enough to become a controlling factor in the gaming industry. Enough to slowly take over, make gamers their bitc*es, artificially inflate prices, and stymie competition by making it increasingly difficult for new games to be published successfully on other platforms. It even fails provide one of it\u0027s \u0027core\u0027 services which is to prevent cheating in multiplayer. It does nothing but rip gamers \u003Cem\u003Eand \u003C/em\u003Edevelopers off. It contributes nothing but inconvenience and misery, and takes 20%.\n\u003C/p\u003E\n\u003Cp\u003E\nYeah. I really don\u0027t like Steam.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-05T12:39:29Z\u0022 title=\u002207/05/2024 12:39  PM\u0022 data-short=\u0022Jul 5\u0022\u003EJuly 5\u003C/time\u003E by boriz\u003C/strong\u003E\n\u003C/span\u003E\n"}]}