{"TopicId":184590,"ForumId":18,"TopicTitle":"FTL drive creation follows purpose of starship","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-05-19T08:27:19Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-05-19T08:27:19Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFTL drives in fiction I think should be in harmony with what specific purpose the user has in mind for his ship. Namely what he is actually doing with his ship in space.\n\u003C/p\u003E\n\u003Cp\u003E\nSo here is your opportunity to make an FTL drive and post it and be creative.\n\u003C/p\u003E\n\u003Cp\u003E\nIt must be designed for only ONE of these purposes broadly.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Trade.\n\u003C/p\u003E\n\u003Cp\u003E\n2. War.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Exploration\n\u003C/p\u003E\n\u003Cp\u003E\nI think that covers the bases.\n\u003C/p\u003E\n\u003Cp\u003E\nEach FTL drive is tailor made for its purpose with drawbacks that make it a poor choice for applications it was not intended for (like you could use a jet nozzle\u0027s exhaust plume as a plasma torch to cut a metal pipe, but it would be incredibly inefficient and would likely do more than you intended).\n\u003C/p\u003E\n\u003Cp\u003E\nHere is mine for example, based on Trader.\n\u003C/p\u003E\n\u003Cp\u003E\nSpace Trader FTL drive: It is a jump drive designed specifically for finding and locating both other spaceships and asteroids. It works by sending out an FTL ping signal that reflects back to your vessel the distance and location of only objects that have as much mass as your spaceship or less. The smallest mass it can detect is a kilogram. The FTL ping travels a light year per minute, and takes equally long on the return ping reflected back to you. So for Alpha Centauri, supposing you pinged the various multitude of asteroids over there which would take about four minutes, you could get a return ping in about eight minutes.\n\u003C/p\u003E\n\u003Cp\u003E\nJumping radius: A ship can only jump near an object at a 30 kliometer radius. Likewise to jump out a ship must be past the 30 kilometer radius of only objects that have the same mass or less down to a kilogram.\n\u003C/p\u003E\n\u003Cp\u003E\nNavigation: It is wise to ping at least twice, as that gives some indication of whether or not the object you are juming toward has a predictable orbit as well as it\u0027s velocity, which can be ascertained by the distance traveled between pings. That way when you do jump you won\u0027t have the object crashing into you at orbital speeds, as you can adjust your heading before you jump.\n\u003C/p\u003E\n\u003Cp\u003E\nAdvantages: Great at detecting objects in space, has a max range of 7 LY.\n\u003C/p\u003E\n\u003Cp\u003E\nDisadvantages: You only know the mass, distance, and travel heading of a detected object, you have no way knowing what it is until you jump. Only that it has either the exact mass of your vessel or lower down to a kilogram. It also cannot detect planets or stars (unless you really do have a ship that massive LOL). Yet a planet might be inferred by a lot of orbting objects relatively close to one another. So you could jump and look. Especially with planets like Earth with a lot of orbital junk. Or Saturn, which has MUCH more.\n\u003C/p\u003E\n\u003Cp\u003E\nNow your turn! You can make an FTL drive made with the specific purpose of either trade, war, or exploration.\n\u003C/p\u003E\n\u003Cp\u003E\nHave fun!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Universe-Live-Wallpaper-For-Pc-9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://www.wallpapers4k.org/wp-content/uploads/2018/10/Universe-Live-Wallpaper-For-Pc-9.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-19T08:28:44Z\u0022 title=\u002205/19/2019 08:28  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 19, 2019\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2019-05-19T09:45:55Z","Content":"\n\u003Cp\u003E\nConvoluted and oddly specific arbitrary limitations.\n\u003C/p\u003E\n\u003Cp\u003E\nFTL drive should not be designed around the role of the vessel. It should be technology driven and the type of vessel that employs it should work with what is available or it just doesn\u0027t work.\n\u003C/p\u003E\n\u003Cp\u003E\nThe parameters of the FTL travel should be defined by story - offer the capability needed for the story, but include some limitations, again for the reasons of story telling.\n\u003C/p\u003E\n\u003Cp\u003E\nOptions are:\u003Cbr\u003E\nInstant travel, but spool up/cool down time (Battlestar Galactica)\u003Cbr\u003E\nInstant start of the drive but finite speed (Star Trek)\u003Cbr\u003E\nSpecial training for piloting or similar limitation that makes it not available to everybody (Dune)\u003Cbr\u003E\nNatural wormholes or subspace lanes that put limitations on paths the ships can take (Andromeda).\n\u003C/p\u003E\n\u003Cp\u003E\nThese options are usually well balances, yet flexible enough to give the author some flexibility for future ideas.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-19T09:46:09Z\u0022 title=\u002205/19/2019 09:46  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 19, 2019\u003C/time\u003E by Shpaget\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2019-05-19T10:08:00Z","Content":"\n\u003Cp\u003E\nHello \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197504\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0022 rel=\u0022\u0022\u003E@Spacescifi\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve moved your thread to the lounge as it is more a creative discussion about the implications of far future technology.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2019-05-19T11:03:45Z","Content":"\n\u003Cp\u003E\nHmmm. It seems a bit odd that your Trader drive can detect small masses but not large ones when intuitively you would think small ones are harder to detect. More hand waving required.\n\u003C/p\u003E\n\u003Cp\u003E\nI’m also thinking that, as written, your drive would be rather useful for piracy. Lurk in the Oort cloud, ping for targets in-system of a suitable mass range, jump in to within 30km and take out your target. For battle tactics, it would allow for some very nasty ambushes using autonomous  FTL drones equipped with adequately large nukes. Sure, you’ve just lost an expensive FTL drive but your enemy is also down one drive plus the even more expensive warship wrapped around it.\n\u003C/p\u003E\n\u003Cp\u003E\nIt’s a nice idea but I think it would be quite difficult to design a drive for a specific role, whilst excluding others.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit. And from a writing perspective, I’d personally find it easier to start with a given drive technology and then figure out how trading, exploration and (if necessary) combat would work given the limitations of that technology. So - what \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/45577-shpaget/\u0026amp;do=hovercard\u0022 data-mentionid=\u002245577\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/45577-shpaget/\u0022 rel=\u0022\u0022\u003E@Shpaget\u003C/a\u003E said, effectively.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that’s just me - there are as many ways to write as there are writers, so I can imagine your way around working for others.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-19T11:11:25Z\u0022 title=\u002205/19/2019 11:11  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 19, 2019\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-05-19T13:42:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223601556\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558260480\u0022 data-ipsquote-userid=\u0022160462\u0022 data-ipsquote-username=\u0022James Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, James Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHello \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197504\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0022 rel=\u0022\u0022\u003E@Spacescifi\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve moved your thread to the lounge as it is more a creative discussion about the implications of far future technology.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSorry my apologies, I will be sure to only mention creative scifi stuff that does not relate to known spaceflight here.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nActually regarding the trader drive, there are ways to make it not so effective for war. Some require no modifications to the story but others do.\n\u003C/p\u003E\n\u003Cp\u003E\nNo modifications: A small bomb equipped drone can never jump within a 30 kilometer radius of a much larger warship because trader drives require the same mass level as the jumper or less down to a kilogram. A drone will never ping a more massive ship, so it could not jump near one. Yes your trader ship if the mass was less (likely) you could detect it, yet you could only jump your entire ship into the combat zone, so FTL drone sniping is only possible on low mass stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nChanges with mods: Allow some warships to have antigravity field equipment that deflects pinging so they cannot be detected. Also allow devices that let ships know know they are being pinged. And allow 60 seconds for the trader drive to spool up after pinging, that way a ship that can detect pings has at least 60 seconds to alter their heading if the ping is inside a solar system.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-19T14:38:23Z\u0022 title=\u002205/19/2019 02:38  PM\u0022 data-short=\u00225 yr\u0022\u003EMay 19, 2019\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003Cbr\u003EFix\n\u003C/span\u003E\n"},{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2019-05-20T01:05:57Z","Content":"\n\u003Cp\u003E\nI\u0027m seconding KSK on this one, and some of the old masters agree. Not to say some haven\u0027t done it the other way around, \u0022The Void Captain\u0027s Tale\u0022 springs to mind. I think the drive in that one came after the plot. The danger of allowing multiple drive physics with only societal constraints is that they can and will be violated. I\u0027ve only read it once, Brin\u0027s \u0022Uplift\u0022 \u0027verse. There things were handwaved a fair bit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0027Building \u0022The Mote in God\u0027s Eye\u0022 \u0027discusses the process of building such technology.\n\u003C/p\u003E\n\u003Cp\u003E\nNow for my answer:\n\u003C/p\u003E\n\u003Cp\u003E\nThe drive is Phlebotinum based. It generates a field that reduces the effects of general relativity. The field size is relative to the cube root of the mass of the phlebotinum. The strength of the effect is inversely related to the square of the curvature of space, logarithmic to the amount of power applied, and linear to the mass. Generally larger ships increase the mass of phlebotinum. It is possible to synchronize multiple fields to allow for larger ships. However, the equipment required generally move expensive than just increasing the amount of phlebotinum. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat this means is that a ship can go as fast as it wants as long as it has power available to pump into the field. The speed though is limited as well by how deep it is in a gravity well. Apply more power and you can hold a given speed deeper, but the amount of power goes up quickly the deeper you go. Generally commercial and civilian ships take the hit on speed rather than increase the mass or devote uneconomic amounts of volume to power generation. Of course military, certain policing, and some of questionable ethics vessels don\u0027t have to worry about such constraints.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-21T10:52:37Z\u0022 title=\u002205/21/2019 10:52  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 21, 2019\u003C/time\u003E by steuben\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2019-05-20T11:38:35Z","Content":"\n\u003Cp\u003E\nFollowing on from \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77368-steuben/\u0026amp;do=hovercard\u0022 data-mentionid=\u002277368\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77368-steuben/\u0022 rel=\u0022\u0022\u003E@steuben\u003C/a\u003E‘s post, without knowing anything else about his worldbuilding (so this might be completely wrong), it looks like his drive would be pretty good for an interstellar trader, or an exploration vessel but probably less good for a combat vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, it’ll work well for any application where you’re either not spending a high percentage of your flight time in a substantial gravity well, or if the stuff you’re doing in that gravity well isn’t time critical.\n\u003C/p\u003E\n\u003Cp\u003E\nA trading vessel might be slower than molasses near a planet but most of its time is spent in interstellar space where its speed is far less restricted. Likewise for an explorer - depending on their sensor tech, they might be able to do most of their exploring at an acceptable range from the system star, only heading in-system (and taking the speed hit) if they find a particularly notable planet. Even then, slower in-system travel isn’t necessarily a problem if you can be gathering data on the way in and out.\n\u003C/p\u003E\n\u003Cp\u003E\nWhereas the drive might not be as useful for combat vessels, if those vessels spend most of their time in-system, in relatively deep gravity wells.\n\u003C/p\u003E\n\u003Cp\u003E\nTrying to outright prevent a particular drive from being used for particular role is difficult, without tying yourself in increasingly complex knots. Making a drive a sufficiently poor fit for a particular role that other factors (such as economics) mostly prevent it from being used is far easier and less prone to introducing plot loopholes.\n\u003C/p\u003E\n\u003Cp\u003E\nEven better, the workarounds needed to compensate for an imperfect FTL system can drive a lot of plot. Battletech is an excellent example - it’s FTL drive basically doesn’t work at all unless it’s in locally flat space and worse - doesn’t play well with standard fusion drives. Net result - extensive use of dropships to ferry stuff to and from the FTL vessels and pretty severe limits on transit time (even though this is a point-to-point instantaneous jump drive) due to the need to recharge the drive core using solar arrays after each jump.\n\u003C/p\u003E\n\u003Cp\u003E\nIncidentally, my slightly snarky response to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197504\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0022 rel=\u0022\u0022\u003E@Spacescifi\u003C/a\u003E‘s reply to my post is ‘stuff the drones with concrete’. Bulk up their mass to the point where they can be used against larger ships. Heck, if you want a relatively compact drone, stuff it with tungsten rods and make your primary weapon even nastier.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I’m sure you could find a reason for that not to work either but I’m also fairly sure I could figure out a counter to those reasons too. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\u003Cspan\u003EI’m not trying to be mean to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197504\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0022 rel=\u0022\u0022\u003E@Spacescifi\u003C/a\u003E - just pointing out the problem with trying to have a single purpose FTL drive.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2019-05-20T21:50:36Z","Content":"\n\u003Cp\u003E\nThese ones.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022three_coloured_rockets_hoodie-r3c27e81f2\u0022 class=\u0022ipsImage\u0022 height=\u0022307\u0022 src=\u0022https://rlv.zcache.com/three_coloured_rockets_hoodie-r3c27e81f281948079a8b9d49d54bef29_jg92o_307.jpg?rvtype=content\u0022 width=\u0022307\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe red is for war, the blue is for trade, the green is for exploration. Please, don\u0027t confuse them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-05-21T02:20:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223601995\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558352315\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFollowing on from \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77368-steuben/\u0026amp;do=hovercard\u0022 data-mentionid=\u002277368\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77368-steuben/\u0022 rel=\u0022\u0022\u003E@steuben\u003C/a\u003E‘s post, without knowing anything else about his worldbuilding (so this might be completely wrong), it looks like his drive would be pretty good for an interstellar trader, or an exploration vessel but probably less good for a combat vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, it’ll work well for any application where you’re either not spending a high percentage of your flight time in a substantial gravity well, or if the stuff you’re doing in that gravity well isn’t time critical.\n\u003C/p\u003E\n\u003Cp\u003E\nA trading vessel might be slower than molasses near a planet but most of its time is spent in interstellar space where its speed is far less restricted. Likewise for an explorer - depending on their sensor tech, they might be able to do most of their exploring at an acceptable range from the system star, only heading in-system (and taking the speed hit) if they find a particularly notable planet. Even then, slower in-system travel isn’t necessarily a problem if you can be gathering data on the way in and out.\n\u003C/p\u003E\n\u003Cp\u003E\nWhereas the drive might not be as useful for combat vessels, if those vessels spend most of their time in-system, in relatively deep gravity wells.\n\u003C/p\u003E\n\u003Cp\u003E\nTrying to outright prevent a particular drive from being used for particular role is difficult, without tying yourself in increasingly complex knots. Making a drive a sufficiently poor fit for a particular role that other factors (such as economics) mostly prevent it from being used is far easier and less prone to introducing plot loopholes.\n\u003C/p\u003E\n\u003Cp\u003E\nEven better, the workarounds needed to compensate for an imperfect FTL system can drive a lot of plot. Battletech is an excellent example - it’s FTL drive basically doesn’t work at all unless it’s in locally flat space and worse - doesn’t play well with standard fusion drives. Net result - extensive use of dropships to ferry stuff to and from the FTL vessels and pretty severe limits on transit time (even though this is a point-to-point instantaneous jump drive) due to the need to recharge the drive core using solar arrays after each jump.\n\u003C/p\u003E\n\u003Cp\u003E\nIncidentally, my slightly snarky response to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197504\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0022 rel=\u0022\u0022\u003E@Spacescifi\u003C/a\u003E‘s reply to my post is ‘stuff the drones with concrete’. Bulk up their mass to the point where they can be used against larger ships. Heck, if you want a relatively compact drone, stuff it with tungsten rods and make your primary weapon even nastier.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I’m sure you could find a reason for that not to work either but I’m also fairly sure I could figure out a counter to those reasons too. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\u003Cspan\u003EI’m not trying to be mean to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197504\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0022 rel=\u0022\u0022\u003E@Spacescifi\u003C/a\u003E - just pointing out the problem with trying to have a single purpose FTL drive.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo offense taken. I am not one that needs to be right about everything so if you can beat my fictional tech by being clever more power to you. It only gives me more writing fodder.\n\u003C/p\u003E\n\u003Cp\u003E\nYet it does not address the various modification counters I already added to the drive, and I have no intention of adding more. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I did not mention this originally but spaceships in my verse will use sublight drives that allow constant acceleration at 1g for an hour before needing to be recharged at a charging station. You can get greater accelerations at the expense of reduced usage time and risking crew comfort or life. Or you could get longer than an hour accelerations if you did below 1g.\n\u003C/p\u003E\n\u003Cp\u003E\nTo reach earth orbit you could do 3g acceleration but that only can be kept up for 20 min (fortunately it only takes about 8 min to teach orbit). You can also do ridiculous accellerations like 20 g for about a min, but that would surely kill your crew. No inertial dampers here. Would work for a missile though. Yet it is also worth noting that the really massive vessels take longer to get up to speed unless your engine nozzle is scaled up to match it.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223601875\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558314357\u0022 data-ipsquote-userid=\u002277368\u0022 data-ipsquote-username=\u0022steuben\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/19/2019 at 6:05 PM, steuben said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m seconding KSK on this one, and some of the old masters agree. Not to say some haven\u0027t done it the other way around, \u0022The Void Captain\u0027s Tale\u0022 springs to mind. I think the drive in that one came after the plot. The danger of allowing multiple drive physics with only societal constraints is that they can and will be violated. I\u0027ve only read it once, Brin\u0027s \u0022Uplift\u0022 \u0027verse. There things were handwaved a fair bit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0027\u003Cspan style=\u0022background-color:#ffffff;color:#222222;font-size:16px;text-align:left;\u0022\u003EBuilding \u0022The Mote in God\u0027s \u003C/span\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#222222;font-size:16px;text-align:left;\u0022\u003EEye\u0022\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u0027 discusses the process of building such technology.\n\u003C/p\u003E\n\u003Cp\u003E\nNow for my answer:\n\u003C/p\u003E\n\u003Cp\u003E\nThe drive is Phlebotinum based. It generates a field that reduces the effects of general relativity. The field size is relative to the cube root of the mass of the phlebotinum. The strength of the effect is inversely related to the square of the curvature of space, logarithmic to the amount of power applied, and linear to the mass. Generally larger ships increase the mass of phlebotinum. It is possible to synchronize multiple fields to allow for larger ships. However, the equipment required generally move expensive than just increasing the amount of phlebotinum. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat this means is that a ship can go as fast as it wants as long as it has power available to pump into the field. The speed though is limited as well by how deep it is in a gravity well. Apply more power and you can hold a given speed deeper, but the amount of power goes up quickly the deeper you go. Generally commercial and civilian ships take the hit on speed rather than increase the mass or devote uneconomic amounts of volume to power generation. Of course military, certain policing, and some of questionable ethics vessels don\u0027t have to worry about such constraints.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n?????? Is this drive more for war, trade, or exploration? \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, could you explain it in plain, simple english, so anyone and everyone can grasp plainly what your drive can and cannot do?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-21T07:55:10Z\u0022 title=\u002205/21/2019 07:55  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 21, 2019\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003Cbr\u003EFix\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2019-05-21T03:46:42Z","Content":"\n\u003Cp\u003E\nIf this is about a sci-fi settings, just use the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Aether_(classical_element)\u0022 rel=\u0022external nofollow\u0022\u003EAether\u003C/a\u003E. They usually do it in sci-fi, just don\u0027t call it by its name.\n\u003C/p\u003E\n\u003Cp\u003E\nLet them discover some kind of field (or use the existing one), or let the Dark Matter be it.\u003Cbr\u003E\nThen you can define any reason of your ships behaviour. Say, the cross-section area of the ship limits available acceleration due to the field drag.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-05-21T05:26:27Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223602343\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558410402\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf this is about a sci-fi settings, just use the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Aether_(classical_element)\u0022 rel=\u0022external nofollow\u0022\u003EAether\u003C/a\u003E. They usually do it in sci-fi, just don\u0027t call it by its name.\n\u003C/p\u003E\n\u003Cp\u003E\nLet them discover some kind of field (or use the existing one), or let the Dark Matter be it.\u003Cbr\u003E\nThen you can define any reason of your ships behaviour. Say, the cross-section area of the ship limits available acceleration due to the field drag.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI create. Why imitate when I can create?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223601995\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558352315\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFollowing on from \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77368-steuben/\u0026amp;do=hovercard\u0022 data-mentionid=\u002277368\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77368-steuben/\u0022 rel=\u0022\u0022\u003E@steuben\u003C/a\u003E‘s post, without knowing anything else about his worldbuilding (so this might be completely wrong), it looks like his drive would be pretty good for an interstellar trader, or an exploration vessel but probably less good for a combat vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, it’ll work well for any application where you’re either not spending a high percentage of your flight time in a substantial gravity well, or if the stuff you’re doing in that gravity well isn’t time critical.\n\u003C/p\u003E\n\u003Cp\u003E\nA trading vessel might be slower than molasses near a planet but most of its time is spent in interstellar space where its speed is far less restricted. Likewise for an explorer - depending on their sensor tech, they might be able to do most of their exploring at an acceptable range from the system star, only heading in-system (and taking the speed hit) if they find a particularly notable planet. Even then, slower in-system travel isn’t necessarily a problem if you can be gathering data on the way in and out.\n\u003C/p\u003E\n\u003Cp\u003E\nWhereas the drive might not be as useful for combat vessels, if those vessels spend most of their time in-system, in relatively deep gravity wells.\n\u003C/p\u003E\n\u003Cp\u003E\nTrying to outright prevent a particular drive from being used for particular role is difficult, without tying yourself in increasingly complex knots. Making a drive a sufficiently poor fit for a particular role that other factors (such as economics) mostly prevent it from being used is far easier and less prone to introducing plot loopholes.\n\u003C/p\u003E\n\u003Cp\u003E\nEven better, the workarounds needed to compensate for an imperfect FTL system can drive a lot of plot. Battletech is an excellent example - it’s FTL drive basically doesn’t work at all unless it’s in locally flat space and worse - doesn’t play well with standard fusion drives. Net result - extensive use of dropships to ferry stuff to and from the FTL vessels and pretty severe limits on transit time (even though this is a point-to-point instantaneous jump drive) due to the need to recharge the drive core using solar arrays after each jump.\n\u003C/p\u003E\n\u003Cp\u003E\nIncidentally, my slightly snarky response to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197504\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0022 rel=\u0022\u0022\u003E@Spacescifi\u003C/a\u003E‘s reply to my post is ‘stuff the drones with concrete’. Bulk up their mass to the point where they can be used against larger ships. Heck, if you want a relatively compact drone, stuff it with tungsten rods and make your primary weapon even nastier.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I’m sure you could find a reason for that not to work either but I’m also fairly sure I could figure out a counter to those reasons too. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\u003Cspan\u003EI’m not trying to be mean to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197504\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197504-spacescifi/\u0022 rel=\u0022\u0022\u003E@Spacescifi\u003C/a\u003E - just pointing out the problem with trying to have a single purpose FTL drive.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne more thing I just realized. Any race able to build a trader jump drive is able to make well traveled areas quite reachable, even planets. The first ship out to a new solar system will have a long haul, unless it comes across a near planetary astetoid to jump near.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, all a ship has to do is drop out small satelites like breadcrumbs wherever the ship coasts to, preferably in orbit of somewhere of interest like a habital world.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom there your computer only needs to log and calculate their predictable orbits and you will always know and have places to jump to that are near places of interest.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce that work is done, all it has to do is upload the data to fleet HQ on the homeworld. Periodically every ship should return for a fresh upload of jump satelites to jump to.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, it is a decent exploratory FTL drive, but I could easily make a drive that was better suited to explore anywhere... including the interstellar meduim, which a trader drive could never jump to unless it found something a kilogram or greater in mass up to the ship\u0027s actual mass.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-21T05:28:31Z\u0022 title=\u002205/21/2019 05:28  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 21, 2019\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2019-05-21T17:52:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223602321\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558405204\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n?????? Is this drive more for war, trade, or exploration? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes. Or to swap out the item in question for a different one, Is the steam engine used more for war, trade, or exploration? The drive is just how it gets there. What it takes and what it does when it gets there is arbitrary... and the point of the story, almost. The thing to remember, it has to be \u003Ca href=\u0022https://tvtropes.org/pmwiki/pmwiki.php/Main/MagicAIsMagicA\u0022 rel=\u0022external nofollow\u0022\u003Einternally consistent\u003C/a\u003E within the story. It\u0027s all \u003Ca href=\u0022https://tvtropes.org/pmwiki/pmwiki.php/Main/MinovskyPhysics\u0022 rel=\u0022external nofollow\u0022\u003EMinovsky Physics\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso, could you explain it in plain, simple english, so anyone and everyone can grasp plainly what your drive can and cannot do?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat it can\u0027t do... make a decent espresso, though the cappuccinos are pretty good. Oh, and  julienne potatoes, it can\u0027t do that, oddly it can julienne onions. And while it can make them, its \u003Ca href=\u0022https://en.wikipedia.org/wiki/Manhattan_(cocktail)\u0022 rel=\u0022external nofollow\u0022\u003EManhattans\u003C/a\u003E are flat and flavourless. It\u0027s no interocitor.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022rules\u0022:\n\u003C/p\u003E\n\u003Cp\u003E\n1. More Phlebotinum means more volume can be carried.\n\u003C/p\u003E\n\u003Cp\u003E\n2. More Phlebotinum means it can move \u0026lt;Daft Punk riff\u0026gt; faster, longer, deeper\u0026lt;/Daft Punk riff\u0026gt; in a gravity well.\n\u003C/p\u003E\n\u003Cp\u003E\n3. More power into the Phlebotinum means it can move \u0026lt;Daft Punk riff\u0026gt; faster, longer, deeper\u0026lt;/Daft Punk riff\u0026gt; in a gravity well.\n\u003C/p\u003E\n\u003Cp\u003E\n4. You can use multiple Phlebotinum units instead of more Phlebotinum. But, as one designer involved said it\u0027s like driving a wagon with a team of four horses... except the traces are cut, you\u0027re blindfolded, and you aren\u0027t sure you have all the reins.\n\u003C/p\u003E\n\u003Cp\u003E\nSince the unit only plays with relativistic effects you still need a \u0022conventional\u0022  drive of some sort to actually get some where. Though as KSK has noted in the flatter space of the interstellar voids it does have nice a Highway L/100ly. As always it is the City driving that eats your gas.\n\u003C/p\u003E\n\u003Cp\u003E\nSome theorists researching the physics behind it figure there maybe a reactionless drive buried somewhere in the math. However, they say \u0022it\u0027s a ball of wibbly-wobbly... mathy-wathy...  stuff...\u0022 Apparently the analogy got away from him. I can\u0027t say I followed  much of it but it did involve trying to cancel out three different sizes of infinity and getting negative numbers when calculating the absolute value. Though, some of the equations are similar to when you are trying to operate it at or near the bottom of a black hole.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n[The] spaceships in my verse will use sublight drives that allow constant acceleration at 1g for an hour before needing to be recharged at a charging station.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNow to delve, and yes this can be a pretty deep rabbit hole, into some of the Minovsky Physics of your sublight drive. This will help with developing your FTL drive.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy a limit 3600 gs? (hmm... that translates to velocity. Let\u0027s call, for the sake of ease of typing, the unit of measurement a mino: one g of acceleration for one second). Is it a power/fuel thing? So why not just double the amount of fuel and get 7.2 kilo-minos. Or maybe a diminishing returns kind of thing, double the about of fuel and you only get forty percent (roughly the square root of two) more minos, so only 5.04 kilo-minos for... \u0026lt;hand wave\u0026gt;reasons\u0026lt;/hand wave\u0026gt;.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternately you could keep the drive the same size, and cut the mass of the ship in half and still get 7.2 kilo-minos, since you\u0027re pushing around half as much stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other thing to keep at the top left of your keyboard, or top right if you use the mouse of the left side, is space is \u003Ca href=\u0022https://tvtropes.org/pmwiki/pmwiki.php/Main/ScifiWritersHaveNoSenseOfScale\u0022 rel=\u0022external nofollow\u0022\u003E eldritchly big\u003C/a\u003E. You can only burn for thirty minutes. Aero-lithobraking at 35 km/s tends to be bit hard on ships. It would take roughly six hours to go from the earth to the moon. Not too bad. Now let\u0027s take one of the favoured golden age planetary destinations, Venus. That\u0027s roughly 27 days. And the ringed jewel Saturn... my math might be a bit off, 2 years and 3 months.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI create. Why imitate when I can create?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTo create like the masters first you must first imitate them. Then you must copy from them. Then you will be able to create like them.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-05-21T22:34:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223602605\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558461160\u0022 data-ipsquote-userid=\u002277368\u0022 data-ipsquote-username=\u0022steuben\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, steuben said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes. Or to swap out the item in question for a different one, Is the steam engine used more for war, trade, or exploration? The drive is just how it gets there. What it takes and what it does when it gets there is arbitrary... and the point of the story, almost. The thing to remember, it has to be \u003Ca href=\u0022https://tvtropes.org/pmwiki/pmwiki.php/Main/MagicAIsMagicA\u0022 rel=\u0022external nofollow\u0022\u003Einternally consistent\u003C/a\u003E within the story. It\u0027s all \u003Ca href=\u0022https://tvtropes.org/pmwiki/pmwiki.php/Main/MinovskyPhysics\u0022 rel=\u0022external nofollow\u0022\u003EMinovsky Physics\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat it can\u0027t do... make a decent espresso, though the cappuccinos are pretty good. Oh, and  julienne potatoes, it can\u0027t do that, oddly it can julienne onions. And while it can make them, its \u003Ca href=\u0022https://en.wikipedia.org/wiki/Manhattan_(cocktail)\u0022 rel=\u0022external nofollow\u0022\u003EManhattans\u003C/a\u003E are flat and flavourless. It\u0027s no interocitor.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022rules\u0022:\n\u003C/p\u003E\n\u003Cp\u003E\n1. More Phlebotinum means more volume can be carried.\n\u003C/p\u003E\n\u003Cp\u003E\n2. More Phlebotinum means it can move \u0026lt;Daft Punk riff\u0026gt; faster, longer, deeper\u0026lt;/Daft Punk riff\u0026gt; in a gravity well.\n\u003C/p\u003E\n\u003Cp\u003E\n3. More power into the Phlebotinum means it can move \u0026lt;Daft Punk riff\u0026gt; faster, longer, deeper\u0026lt;/Daft Punk riff\u0026gt; in a gravity well.\n\u003C/p\u003E\n\u003Cp\u003E\n4. You can use multiple Phlebotinum units instead of more Phlebotinum. But, as one designer involved said it\u0027s like driving a wagon with a team of four horses... except the traces are cut, you\u0027re blindfolded, and you aren\u0027t sure you have all the reins.\n\u003C/p\u003E\n\u003Cp\u003E\nSince the unit only plays with relativistic effects you still need a \u0022conventional\u0022  drive of some sort to actually get some where. Though as KSK has noted in the flatter space of the interstellar voids it does have nice a Highway L/100ly. As always it is the City driving that eats your gas.\n\u003C/p\u003E\n\u003Cp\u003E\nSome theorists researching the physics behind it figure there maybe a reactionless drive buried somewhere in the math. However, they say \u0022it\u0027s a ball of wibbly-wobbly... mathy-wathy...  stuff...\u0022 Apparently the analogy got away from him. I can\u0027t say I followed  much of it but it did involve trying to cancel out three different sizes of infinity and getting negative numbers when calculating the absolute value. Though, some of the equations are similar to when you are trying to operate it at or near the bottom of a black hole.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow to delve, and yes this can be a pretty deep rabbit hole, into some of the Minovsky Physics of your sublight drive. This will help with developing your FTL drive.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy a limit 3600 gs? (hmm... that translates to velocity. Let\u0027s call, for the sake of ease of typing, the unit of measurement a mino: one g of acceleration for one second). Is it a power/fuel thing? So why not just double the amount of fuel and get 7.2 kilo-minos. Or maybe a diminishing returns kind of thing, double the about of fuel and you only get forty percent (roughly the square root of two) more minos, so only 5.04 kilo-minos for... \u0026lt;hand wave\u0026gt;reasons\u0026lt;/hand wave\u0026gt;.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternately you could keep the drive the same size, and cut the mass of the ship in half and still get 7.2 kilo-minos, since you\u0027re pushing around half as much stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other thing to keep at the top left of your keyboard, or top right if you use the mouse of the left side, is space is \u003Ca href=\u0022https://tvtropes.org/pmwiki/pmwiki.php/Main/ScifiWritersHaveNoSenseOfScale\u0022 rel=\u0022external nofollow\u0022\u003E eldritchly big\u003C/a\u003E. You can only burn for thirty minutes. Aero-lithobraking at 35 km/s tends to be bit hard on ships. It would take roughly six hours to go from the earth to the moon. Not too bad. Now let\u0027s take one of the favoured golden age planetary destinations, Venus. That\u0027s roughly 27 days. And the ringed jewel Saturn... my math might be a bit off, 2 years and 3 months.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo create like the masters first you must first imitate them. Then you must copy from them. Then you will be able to create like them.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI mentioned once before, but you can do lower accelerations with my sublight drive and therefore get longer travel time out of it.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, moon gravity is 17% of 1g.so using only moon acceleration you get 352 minutes of acceleration.\n\u003C/p\u003E\n\u003Cp\u003E\nNot bad. Not to say you need to do a constant burn anyway.\n\u003C/p\u003E\n"},{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2019-05-22T01:45:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223602731\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558478094\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI mentioned once before, but you can do lower accelerations with my sublight drive and therefore get longer travel time out of it.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, moon gravity is 17% of 1g.so using only moon acceleration you get 352 minutes of acceleration.\n\u003C/p\u003E\n\u003Cp\u003E\nNot bad. Not to say you need to do a constant burn anyway.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n*winces* Delta-v is the  currency of space not acceleration. (Heard that somewhere... not sure where.) Sure you can burn half as hard for twice as long but you still end up going the same speed. You\u0027ll have read through projectrho.com . It will cover a lot of what you\u0027re working with.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-05-22T02:20:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223602813\u0022 data-ipsquote-contentid=\u0022184590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221558489517\u0022 data-ipsquote-userid=\u002277368\u0022 data-ipsquote-username=\u0022steuben\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n38 minutes ago, steuben said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n*winces* Delta-v is the  currency of space not acceleration. (Heard that somewhere... not sure where.) Sure you can burn half as hard for twice as long but you still end up going the same speed. You\u0027ll have read through projectrho.com . It will cover a lot of what you\u0027re working with.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYes I know, I am aware of Winchell Chung. But I tend to like Scott Manley much more since he does not come off as arrogant, making assiming a lot about his viewers and readers like Winchell or whoever writes the text on his website does.\n\u003C/p\u003E\n\u003Cp\u003E\nSpeed is not too important. Usually.\n\u003C/p\u003E\n\u003Cp\u003E\nI mean, the logical thing to do for an exploratory mission is to send a scout ship and lay out some satelites to serve as jump points later.\n\u003C/p\u003E\n\u003Cp\u003E\nYou do not send a crewed ship to unexplored regions, it just makes no sense. First you send the scout, seed the solar system at strategic orbits of interest, THEN send a trader drive ship to jump in and explore.\n\u003C/p\u003E\n\u003Cp\u003E\nSince sublight engines have limited delta v, this would conserve it. Before jumping back home or near a jump recharging station, a ship will auto calculate how much charge it needs to reach the nearest recharging station in a reasonable amount (hours or less) of time.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ship will request to jump back before it crosses into the red (the charge it needs to reach the nearest recharging station).\n\u003C/p\u003E\n\u003Cp\u003E\nSo ship captains have to be judicious about how they thrust, even though fuel us unlimited so long they recharge at a station. Stations get their power from the sun, but they use exotic matter fields on the charge given to ship engines.\n\u003C/p\u003E\n\u003Cp\u003E\nAt any rate, stations have a breaking in period of 300 earth days before the exotic matter fields finish properly synching with the solar converters.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce turned on it can not be turned off, only destroyed, and the 300 day wait is a given.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-22T02:24:29Z\u0022 title=\u002205/22/2019 02:24  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 22, 2019\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}