{"TopicId":188479,"ForumId":18,"TopicTitle":"2019 Goes Differently....","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-09-25T02:16:01Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2019-09-25T02:16:01Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo this is an interesting what if scenario... mainly for fiction anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nI will describe the changes I think would happen and you may add upon it.\n\u003C/p\u003E\n\u003Cp\u003E\n2019: Every human alive retains fear, joy, love, disgust, and surprise. But they all lose the the emotions of anger and sadness. After 2020 everything will revert back to normal.\n\u003C/p\u003E\n\u003Cp\u003E\nHow crime is effected: Certain rates go down while others go up. Namely crimes of passion/murders by scorned lovers go waaay down. Strangely, some hate crimes continue, since often at their core such ones feel threatened and are motivated by fear mostly, not hate. As does gang violence for the same reason. Also the suicide rate drops dramatically. \n\u003C/p\u003E\n\u003Cp\u003E\nEconomics: There is a spike in productivity across many economic sectors as no one comes to work distracted by sadness nor anger.\n\u003C/p\u003E\n\u003Cp\u003E\nHow politics are effected: The USA and world politics will be different, with opposing sides playing on the public\u0027s potential fears more than anything. Less insults in the media everywhere, including the internet, since they no longer tick anyone off. Instead people start making threats and thus start getting arrested.\n\u003C/p\u003E\n\u003Cp\u003E\nDeath: People no longer mourn at funerals, instead it is a joyous occasion celebrating the life of the deceased.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDid I miss anything? What else would happen/change in 2019?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-09-25T02:17:36Z\u0022 title=\u002209/25/2019 02:17  AM\u0022 data-short=\u00224 yr\u0022\u003ESeptember 25, 2019\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2019-09-26T09:16:41Z","Content":"\n\u003Cp\u003E\nIdk about 2019, but the 1st thing to happen in 2020 is that we realize the difference between this thread and that one.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022197504\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed1079362451\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/188332-almost-human-behavior-analysis-request/\u0026amp;do=embed\u0022 style=\u0022height:210px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}