{"TopicId":202521,"ForumId":18,"TopicTitle":"What monsters do you want to see in Legendary\u0026#039;s \u0026quot;Monsterverse?\u0026quot;","CreatedByName":"JMBuilder","CreatedById":30493,"CreatedDateTime":"2021-05-20T03:42:01Z","PageNum":1,"Articles":[{"CreatedByName":"JMBuilder","CreatedById":30493,"CreatedDateTime":"2021-05-20T03:42:01Z","Content":"\n\u003Cp\u003E\nPretty self-explanatory title for my fellow kaiju fanatics. Having recently binge-watched a lot of older monster movies, I figured I\u0027d brainstorm and open it up for discussion, because why not?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll start with my big three:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cem\u003E\u003Cstrong\u003ERhedosaurus\u003C/strong\u003E\u003C/em\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe very first of the giant city-smashing reptiles. The fictional dinosaur Rhedosaurus, more commonly referred to as \u0022\u003Cem\u003EThe Beast from 20,000 Fathoms\u003C/em\u003E\u0022 (hence the title of the movie it\u0027s in), debuted in 1953, serving as a direct inspiration for Japan\u0027s own Godzilla a little over a year later. Although originally intended to have his own \u0022atomic breath\u0022 from the nuke test that revived him, this concept was ultimately scrapped, and the beast was simply made a large prehistoric survivor relying on his powerful biting and stomping.\n\u003C/p\u003E\n\u003Cp\u003E\nSimple, yet original. The film is great, and the monster is a must-have in the ever-growing cinematic universe of iconic monsters.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Rhedosaurus_\u0026amp;_the_lighthouse.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002279.42\u0022 height=\u0022796\u0022 width=\u00221200\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/7/70/Rhedosaurus_\u0026amp;_the_lighthouse.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cem\u003E\u003Cstrong\u003EBehemoth\u003C/strong\u003E\u003C/em\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNow, we already have a \u0022Titanus Behemoth\u0022 in the Monsterverse, so there would need to be a name-change in order to shoehorn in \u0022Britain\u0027s Godzilla.\u0022 I suspect, however, that this has already been done in the form of \u0022Titanus Leviathan,\u0022 who just so happens to be the Loch Ness Monster (and the name is more fitting for the original monster since, biblically speaking, Behemoth refers to a land creature and Leviathan to a sea creature).\n\u003C/p\u003E\n\u003Cp\u003E\nBehemoth was a severely irradiated paleosaurus capable of channeling the energy from his decaying body in blinding and lethal pulses of extreme radiation. The film was surprisingly graphic for its time, not afraid to show people (even children) dying from horrible radiation burns and poisoning, something that most kaiju films understandably shy away from for the sake of their audiences. It made the monster over-the-top murderous and disturbing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gb2.jpg?w=720\u0026amp;h=400\u0026amp;crop=1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.56\u0022 height=\u0022400\u0022 width=\u0022720\u0022 src=\u0022https://themotionpictures.files.wordpress.com/2016/09/gb2.jpg?w=720\u0026amp;h=400\u0026amp;crop=1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cem\u003E\u003Cstrong\u003EVaran\u003C/strong\u003E\u003C/em\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA standalone kaiju from Toho\u0027s other iconic franchises, Varan was similar to the Rhedosaurus in the sense that he was a prehistoric survivor, not necessarily \u0022mutated\u0022 in any way; simply a bog-standard dinosaur, with the exception of patagium that allowed him to glide great distances. The film, \u003Cem\u003EVaran the Unbelievable\u003C/em\u003E, is a surprisingly obscure and underrated film.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a Monsterverse Titan, Varan could be a cousin species to the Rhedosaurus given their pretty obvious similarities.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Varan_the_Unbelievable.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002257.14\u0022 height=\u0022192\u0022 width=\u0022336\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/en/7/75/Varan_the_Unbelievable.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThose are my top picks. Who wants to join in the brainstorm?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-05-20T03:54:39Z\u0022 title=\u002205/20/2021 03:54  AM\u0022 data-short=\u00223 yr\u0022\u003EMay 20, 2021\u003C/time\u003E by JMBuilder\u003C/strong\u003E\n\u003C/span\u003E\n"}]}