{"TopicId":204422,"ForumId":18,"TopicTitle":"Planet Fitness Versus In-shape","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-08-20T00:12:17Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-08-20T00:12:17Z","Content":"\n\u003Cp\u003E\nBoth are public USA gyms.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI am considering joining one or the other since:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n1. A toxic person (to me) is coming to stay for a few weeks. Gym would give me some place other than home to be after work.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n2. I would not mind, and would enjoy the weight lifting and running.\n\u003C/p\u003E\n\u003Cp\u003E\n3. I am not rich but I could afford either. Cheaper is great, but I still want to know which gym is best for me.\n\u003C/p\u003E\n\u003Cp\u003E\n4. My body type is mesomorph, and I am not fat, so my goal for the gym is mainly for upgrading my strength and speed. To push myself to feel alive and what not...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThoughts?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn-shape gym VERSUS Planet Fitness!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-08-20T00:13:07Z\u0022 title=\u002208/20/2021 12:13  AM\u0022 data-short=\u00222 yr\u0022\u003EAugust 20, 2021\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2021-09-06T21:55:41Z","Content":"\n\u003Cp\u003E\nI haven\u0027t used either gym, but in general be wary of the fine print in gym contracts. Read carefully before signing anything. The gym industry makes a lot of money off of people who are stuck in bad contracts.\n\u003C/p\u003E\n\u003Cp\u003E\nA reputable gym should let you in short-term before committing to a multiyear contract. Pay for one gym for a month with a non-renewing contract. If you like the place, renew for longer, and if you don\u0027t like it (broken equipment, other customers are jerks, dirty showers, etc.) you can try the other gym for a month.\n\u003C/p\u003E\n"}]}