{"TopicId":208022,"ForumId":18,"TopicTitle":"the Seyllin Incident (A very long essay)","CreatedByName":"Akagi","CreatedById":218751,"CreatedDateTime":"2022-05-02T17:51:49Z","PageNum":1,"Articles":[{"CreatedByName":"Akagi","CreatedById":218751,"CreatedDateTime":"2022-05-02T17:51:49Z","Content":"\n\u003Cp\u003E\nTo anyone else out there who plays \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E Online, here\u0027s a bit of lore that\u0027s kinda interesting in my opinion: There\u0027s a star in Gallente space with a shattered planet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe star Seyllin (Gallente, 0.4, Essence, relatively quiet)\u0027s first rocky planet is shattered. After the Seyllin Incident, a coronal mass ejection destroyed Seyllin 1, killing 500 million people in-universe. \u003Ca href=\u0022https://eve-files.com/media/1003/the_seyllin_report_yc112.pdf\u0022 rel=\u0022external nofollow\u0022\u003EThis report\u003C/a\u003E details what happened. \n\u003C/p\u003E\n\u003Cp\u003E\n(Note: all times are in \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E Standard Time)\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 0843 – At approximately this time, the Scope reports travel delays in and around the Seyllin system. The cause of these delays is a gate lockout due to a malfunction in the state of the art “Cassandra” satellite network designed to monitor Seyllin’s solar output and stability, which occurred shortly after 0840. The monitoring facility on Seyllin I initially attributed the cause of the error to a “communications glitch” and state that service will be resumed shortly. In fact, backup copies of telemetry from the network revealed that a significant energy blast had been detected halfway between Seyllin I and the Type-O blue giant it orbits, spiking to impossibly high levels in all fields, including subspace, gravimetric and electromagnetic. According to the data, Cassandra’s last recorded transmission was that the star’s entire magnetic field had realigned towards the explosion. We now know that the Cassandra probes were destroyed by the vast waves of charged particles and EM radiation released from the star. The fact that Cassandra was able to roughly triangulate the location of the energy blast before being destroyed has been the greatest help of all during this investigation, as without Cassandra’s telemetry, it would have proven impossible to determine the cause of the main sequence anomalies.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBased on this, it seems that some sort of CME occured. However, I doubt this would be powerful enough to LITERALLY BREAK A PLANET INTO PIECES.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 0855 – ORE officially announces that their headquarters in Heart constellation have lost all contact with a mining outpost located in 3HQC-6 following reports of an emergency there. The expedition was believed to have been performing a deep core survey on the planet’s interior when the incident occurred. ORE believe the loss of communications and the declaration of emergency is due to a surveying accident, and dispatch a task force to the Sword constellation to investigate.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow!? Are multiple stars popping off?!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 0901 – Federal Administration in Luminaire report that all contact has been lost with Seyllin I. Initial details are sketchy at best, but it is revealed that a Federation Navy task force has been diverted away from border duty to investigate, and CONCORD have become involved, offering the “full scope and breadth of its capabilities” to assist with the matter.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLooks like communications (satellites? stations? FTL magic?) is down, that isn\u0027t good. It\u0027s been 18 minutes since Cassandra went down and now another planet is (presumably) dead and stuff is going downhill. I\u0027m actually kinda worried for the FNT (Federation Navy taskforce for non-\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E players).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 0909 – Fluid Router engineers familiar with Seyllin’s FTL Communications network reveal that the hubs are located in hardened facilities many kilometres below the planets surface, making it unlikely that anything but a deliberate effort to disrupt communications could disable them. This report heightens people’s anxieties about the situation on the planet, and begins to stir up fears of a large-scale Caldari assault similar to the one on Caldari Prime, especially due to the Thoulde constellation’s proximity to the border zone.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh. Crap. This isn\u0027t good. Sabotage?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, why did it take them 8 minutes to find this if they\u0027re engineers?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 0912 – Federation President Foiritan orders the immediate mobilisation of the “Tripwire” defences along the Caldari border, in response to fears of a Caldari communications blackout in preparation for an attack on Seyllin. The Caldari Navy mobilise their own defences, leading to an intense standoff along the border zone that could rapidly ignite into all-out war between the rival nations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWelp. That isn\u0027t good. As far as I\u0027m aware, this is going downhill fast. Can we please learn what\u0027s going on at Seyllin 1?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 0936 – Communications with Seyllin I are restored, and almost fail immediately afterwards due to the volume of distress calls being transmitted from all four of the planet’s primary cities. The fluid router logs were also updated at this time, and it was revealed that the hubs had shut themselves down to protect themselves from some external threat, after which they had autonomously rebooted. CONCORD and Federation vessels are scrambled and ordered to the planet as pleas for evacuation come flooding through. Due to the complete disarray of the planet’s government and emergency services, information is piecemeal, and makes little sense. The Federation still believes some kind of Caldari super weapon, such as a doomsday device, was used in low planetary orbit and is responsible for the disaster, and maintains the high-alert Tripwire state.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n35 minutes since the comms are down, they go back up and almost fail. Oop. That auto-shutdown thing might be a bad thing. Eh, CONCORD is on the case!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 0944 – Panic begins to spread throughout the Federation after the Scope reports that an automated warning system on Seyllin I was activated. The system was designed to withstand a concentrated nuclear attack, and to launch a communications probe in the event that one was detected, warning the Federation military that a potential planetary bombardment was underway. The Federation military officially states that there could have been any number of environmental effects, any one of which could have been mistaken for a nuclear attack, and that the distress call alone did not confirm it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis isn\u0027t too significant.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 0952 – A Thukker caravan is reported missing in the Great Wildlands. In a closed meeting with Sanmatar Shakor, tribe leaders state that its last known checkpoint was a waypoint located in the SL-YBS system, and request Republic assistance in searching for the missing fleet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep, more stars seem to be going off. \n\u003C/p\u003E\n\u003Cp\u003E\nHold up. This star is 23 jumps away, across 6 regions. Something isn\u0027t right.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1002 – Panic in the Federation has reached astronomical levels, leading to a deadly stampede in the commercial docking bays aboard the Federation Navy Testing Facilities at Oursulaert III. The stampede was caused when panicked passengers waiting in the commercial transportation terminal attempted to storm a waiting ship in order to secure passage deeper into the Federation. The vessel was secured, but the mob refused to disperse peacefully and riots ensued.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOursulaert is 5 jumps away. Their concern has a point.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1003 – An emergency conference of scientists that had been called in the Bourynes system by the University of Caille gives an emergency press statement after hearing about the stampede in Oursulaert. They clearly and categorically state that no known nation has a weapon capable of unleashing the kind of devastation seen in the Seyllin system in such a short space of time. They instead attribute the cause of the destruction to a “solar radiological pulse” originating from the Type-O blue star. They also point out that this kind of event is unprecedented, and the possibility of an impending further collapse and supernova cannot be ruled out, despite the previous assumption that Seyllin would not do so for another million or so years. The identified effects on Seyllin I were consistent with a post-main sequence event (initial solar collapse), as the planet was subjected to high level bursts of ultraviolet, gamma and x-ray radiation. They also confirmed that those on the daylight side of the planet’s surface would have a 0% probability of survival, whilst those on the night side and underground may stand a chance of surviving the thermal effects, but would still be exposed to lethal or near-lethal levels of ionising radiation.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo one\u0027s going to survive? Uh-oh.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, what the heck\u0027s going on to the star?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1007 – ORE issue a press release from their headquarters in 4C-B7X in the Heart constellation, confirming the loss of their mining operation on the planet 3HQC-6 I in the Sword constellation. All rescue efforts were suspended after the deep core surveying team reinitiated contact for long enough to confirm the use of some form of massive nuclear strike or radiological pulse weapon above their location, and to warn the rescuers not to come near the planet. The communications are then turned off for good. The task force were able to confirm that the planet was “shimmering with radioactivity” and that the daytime surface temperature of the world was “several times hotter than usual”. ORE officials also acknowledge the similarity of the events in Sword constellation to those on Seyllin I, and state that they are sharing their data with the scientist consortium in Bourynes and are in contact with the Gallente Federation.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOK, so it looks like the deep-core surveying team has decided to do some sort of heroic sacrifice. Apparently, the \u003Cem\u003Eexact same thing\u003C/em\u003E is happening in multiple regions of New Eden. Not good.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1008 – The Federation Navy, along with CONCORD support, arrive at Seyllin I. CONCORD confirmed that “a natural disaster of unprecedented scale and consequence has occurred”, and announce a joint press conference with President Foiritan is to be held shortly. Plans for the evacuation effort are released, to be executed by the hundreds of dreadnoughts, carriers and freighters that arrived on the scene.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHere comes the calvary! But, if nukes are being detonated above planets, shouldn\u0027t they stay away?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1014 – The joint President/CONCORD press conference ends, and transcripts are made public. President Foiritan is recorded stating “We do not anticipate any subsequent bursts at this time”. It would later become known that the President already knew at this point about the massive plasma wave en route to Seyllin I, and that it would completely annihilate the planet and all remaining un-evacuated people.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat was an 8-minute press conference. Huh.\n\u003C/p\u003E\n\u003Cp\u003E\nThat plasma wave sounds really scary. So that\u0027s what\u0027s going on: plasma waves.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1022 – The panic in the Federation spreads to the financial sector, as Federal mining stocks across the cluster begin to tumble uncontrollably. Garoun Investment Bank release the following statement: \u0022Seyllin is a very important system for the Gallente industry. It is clear that some sort of crisis situation is rapidly developing there. Although we cannot yet estimate its severity, we expect the volatility to spread across other market sectors in the Federation\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is starting to look apocalyptic. The market crash is alarming, but I\u0027m more focused on the GIANT PLASMA WAVE.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1030 – Rescue operations for the millions of people stranded on the surface of Seyllin I are underway, with the converted freighters acting as orbital triage centres receiving and treating the sick and wounded. Overwhelming numbers of burns and trauma victims are reported, mostly due to secondary “splash-effect” damage from structures and equipment that was nearby at the time of the initial blast. However, access problems due to the planet’s poor surface infrastructure soon become apparent. Only the night-side cities of Southern Cross and Valimor can be accessed by dropships due to severe temperatures and radioactivity on the daytime side. Access to these cities is further restricted to just 37 operational spaceports, each able to accommodate up to 20 dropships at once. The largest dropships can only carry 500 people in one run, and it can take up to 20 minutes to load them fully. This resulted in a cap of about 18,500 people per minute being evacuated, whilst the total number of evacuees came to almost 200 million, meaning it would take over a week to evacuate everyone. Regrettably, this would not be possible.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027d have to be really lucky to get on a dropship. The other cities, based on the looks of things, hold most of the population. Likely causes for death are radiation, vaporization by plasma wave, and being crushed by collapsing buildings, in that order.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1035 – The Scope reports that the Federation, after a minor confrontation, had given permission to a large fleet of Serpentis Corporation vessels to approach Seyllin I and aid the rescue process. Serpentis had brought large amounts of medical equipment and personnel, as well as large amounts of specialised excavation equipment provided by ORE, who when questioned, had simply stated to the press that “using Serpentis to dispatch the equipment was the fastest way to get it to Seyllin, and that the loss of their survey team in Outer Ring makes their own participation in the Seyllin rescue effort deeply personal to them.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s been 1 hour and 52 minutes since the loss of Cassandra and things are sort of looking up? Serpentis, a drug-making corporation that is the long-standing enemy of the Gallente, is being authorized to help, which is a good thing, but the fact that \u003Cem\u003Ethe Gallente willingly let the Serpentis enter a Federation system\u003C/em\u003E is showing that things are worse then they seem.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 1040 – The Scope reports on a dropship collision at an evacuation point killing an estimated 4000 people. The collision occurred when an overloaded dropship that was having difficulty breaking orbit was caught on the same flight path as an incoming dropship whose pilot refused to obey his superior’s commands to wave off. The situation on Seyllin is beginning to deteriorate and officials are losing control of the situation\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is like if an earthquake struck, everyone tried to evacuate, and cars started colliding. Try not to hit each other, OK?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n10-03-111 – At approximately 1100 (records of the bulletin are now seized or destroyed), the worst disaster of the day occurred. Scope Chief Editor Lars Kiormen releases an emergency bulletin to the public, warning of an impending plasma wave en route to Seyllin I, that will completely annihilate the planet. The bulletin itself stated that this would happen within the next hour, and concluded with a heartfelt goodbye to the Scope employees still trapped on the planet, this was then followed by a Scope commentary questioning the legality of the Federal detainment of their employees. The bulletin was almost immediately decried by CONCORD, who denied the existence of any countdowns, but they were too late to prevent the outbreak of mass panic on Seyllin I, as riots and stampedes broke out as soon as the story broke.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat... was not wise. Sometimes, it\u0027s better for people to NOT be \u0027in the know\u0027! Now is one of those times.\n\u003C/p\u003E\n\u003Cp\u003E\nI just realized the scope of this (no pun intended). The wave is big enough to engulf the ENTIRE PLANET and destroy it. Rest in peace, 500 million people.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNews after this point is no longer time-stamped, so I shall simply have to do the best I can with the records. It appears that shortly after this point, a prison outbreak occurred, which forced the Navy to re-task valuable dropships to prevent a mass-breakout of high-security convicts. Panicked citizens were outraged at this news, sparking a fresh wave of riots. Crowd control methods are failing by this point, and armed troops have been posted at most dropship gangways to prevent terrified civilians from overfilling the ships. News is also received from the Intaki Syndicate, of yet another main sequence anomaly nearly destroying a station. At this point, the University of Caille, realising that the plasma wave’s cover was blown, decided to issue a direct appeal via the newsfeeds for anyone in the position to send them useful data to do so. This decision, whilst opposed by the Federal government and by CONCORD, has proven invaluable since, especially the CreoDron magnetic field data, which was vital to developing a working explanation of what happened at Seyllin. This was further reinforced by Sanmatar Shakor’s announcement that the Thukker Caravan which was reported missing earlier had been completely destroyed by another similar main sequence event, bringing the total up to four recorded events. The disaster came to a head shortly afterwards, with the navy pulling out shortly before the final destruction of Seyllin I by the massive plasma wave, which occurred at midday. The initial reports indicated no survivors, backed up by the complete lack of any fluid router contact with the planet. This was later corroborated when, before the CONCORD/Federation Navy blockade was lifted, a Serpentis vessel that had been stranded inside the system during the final evacuation reported from the former location of Seyllin I that the planet was completely destroyed, before contact was permanently lost. It has since been assumed that the unfortunate vessel was caught up in the debris field that was present shortly before the remains of Seyllin I coalesced back into planetoid shape. It was also at this point that the Sisters of \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E issued their now infamous prediction that a series of topological defects would shortly begin to manifest themselves throughout the cluster, successfully predicting the first natural wormhole formations since the collapse of \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E itself.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, apparently stuff just went downhill after the announcement. Dropships were re-directed away from the disaster to the prison riot, meaning that less people could be evacuated in the end. Armed troops have to prevent overfilling of the dropships. The University of Caille asked anyone that could give them information about the disaster to send it to the university.  Everybody pulled  their ships out shortly before the noon destruction of Seyllin 1. The CreoDron (drone manufacturing company) data ended up being quite valuable to finding out what happened. A Serpentis Corporation vessel reported that Seyllin 1 had been destroyed (the wreckage was likely crushed as Seyllin 1 reformed into a planetoid). The Sisters of \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E religious organization predicted the formation of the first wormholes since \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E, the wormhole that brought humanity to New Eden, collapsed. It had been 3 hours and 17 minutes since Cassandra went offline.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003EWhat the Heck Happened?\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn short: isogen-5 detonations.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want more data, see \u003Ca href=\u0022https://eve-files.com/media/1003/the_seyllin_report_yc112.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ethis report\u003C/a\u003E (also linked above)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTL;DR: A star made a planet shatter and killed a bunch of people.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-05-02T17:54:12Z\u0022 title=\u002205/02/2022 05:54  PM\u0022 data-short=\u00222 yr\u0022\u003EMay 2, 2022\u003C/time\u003E by Akagi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2022-05-02T18:02:31Z","Content":"\n\u003Cp\u003E\nMoved to the Lounge.\n\u003C/p\u003E\n"},{"CreatedByName":"Akagi","CreatedById":218751,"CreatedDateTime":"2022-05-02T18:13:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224125684\u0022 data-ipsquote-contentid=\u0022208022\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221651514551\u0022 data-ipsquote-userid=\u0022123837\u0022 data-ipsquote-username=\u0022Dman979\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Dman979 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMoved to the Lounge.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Akagi","CreatedById":218751,"CreatedDateTime":"2022-05-03T21:21:46Z","Content":"\n\u003Cp\u003E\n*bumps*\n\u003C/p\u003E\n"}]}