{"TopicId":29245,"ForumId":18,"TopicTitle":"Warthunder - WWII Vehicular Combat Sim","CreatedByName":"chobit-389","CreatedById":40105,"CreatedDateTime":"2013-05-26T06:46:25Z","PageNum":17,"Articles":[{"CreatedByName":"satcharna","CreatedById":61549,"CreatedDateTime":"2013-07-22T10:36:09Z","Content":"\n\u003Cp\u003EWar planes are impressive, no doubt. Once saw a Sturmovik and a Ju-87 Stuka, as well as some assorted fighters, at an airshow and was stunned by how massive they were. You really don\u0027t get the proper feel of scale from images and clips.\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-08-18T20:33:46Z","Content":"\n\u003Cp\u003EI would like to bump this in an attempt to get some questions answered.\u003C/p\u003E\u003Cp\u003E1. why do all the planes fly like normal...doing 360s?\u003C/p\u003E\u003Cp\u003E2. why is my FPS so unbearably low when I see any part of the ground?\u003C/p\u003E\u003Cp\u003E3. why can\u0027t I aim very well???\u003C/p\u003E\n"},{"CreatedByName":"satcharna","CreatedById":61549,"CreatedDateTime":"2013-08-18T20:55:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galacticruler\u0022 data-cite=\u0022Galacticruler\u0022\u003E\u003Cdiv\u003E1. why do all the planes fly like normal...doing 360s?\u003C/div\u003E\u003C/blockquote\u003EYou\u0027re most likely flying Arcade mode. In Arcade, all planes maneuver a lot easier, and without much realism at all. Try playing Historic or Real instead, you\u0027ll find the planes behave a lot better.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galacticruler\u0022 data-cite=\u0022Galacticruler\u0022\u003E\u003Cdiv\u003E2. why is my FPS so unbearably low when I see any part of the ground?\u003C/div\u003E\u003C/blockquote\u003ELower your terrain resolution, tree range, and grass. Disable water reflections, object shadows, advanced shore and terrain far details.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galacticruler\u0022 data-cite=\u0022Galacticruler\u0022\u003E\u003Cdiv\u003E3. why can\u0027t I aim very well???\u003C/div\u003E\u003C/blockquote\u003EAre you leading your shots properly? In Arcade mode, you should get a little indicator ahead of the other plane, which is where you should aim. In Historic and Real battles, you need to do this on your own. Also, try holding your fire until you\u0027re flying straight behind the hostile plane. It\u0027s also a good idea to aim a little ahead of the lead indicator in the first place, as it shows the centre of the plane\u0027s mass, while you want to be aiming at the cockpit.\n"},{"CreatedByName":"Manifest","CreatedById":53633,"CreatedDateTime":"2013-08-19T00:40:58Z","Content":"\n\u003Cp\u003ETo add on to what satcharna said about the little indicator in arcade; it isn\u0027t always accurate, try aiming around it when your shots don\u0027t hit.\u003C/p\u003E\n"}]}