{"TopicId":29776,"ForumId":18,"TopicTitle":"How to calm yourself down?","CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2013-05-28T14:53:54Z","PageNum":1,"Articles":[{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2013-05-28T14:53:54Z","Content":"\n\u003Cp\u003EOk guys, i\u0027m really mad after bollocking a docking manoevre, so I need some ways to calm down. Deep breathing isn\u0027t cutting it.\u003C/p\u003E\n"},{"CreatedByName":"LeonG17","CreatedById":65024,"CreatedDateTime":"2013-05-28T14:55:23Z","Content":"\n\u003Cp\u003EYou have the options:release the stress somehow like punching a pillow or through suppressing it.\u003C/p\u003E\n"},{"CreatedByName":"Grove","CreatedById":5188,"CreatedDateTime":"2013-05-28T14:56:39Z","Content":"\n\u003Cp\u003EDon\u0027t be angry, you can try again.\u003C/p\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-05-28T14:57:00Z","Content":"\n\u003Cp\u003E1. Quit KSP.\u003C/p\u003E\u003Cp\u003E2. Go to insane thread.\u003C/p\u003E\u003Cp\u003E3. ???\u003C/p\u003E\u003Cp\u003E4. Stress relief!\u003C/p\u003E\n"},{"CreatedByName":"Jokurr","CreatedById":57496,"CreatedDateTime":"2013-05-28T15:13:08Z","Content":"\n\u003Cp\u003EI\u0027ve definitely become more angry than I\u0027d like to admit after botching a docking, best thing to do I\u0027ve found is to stop playing for a bit, come back later.\u003C/p\u003E\n"},{"CreatedByName":"Grove","CreatedById":5188,"CreatedDateTime":"2013-05-28T15:17:21Z","Content":"\n\u003Cp\u003ERemember why you are playing the game, because it\u0027s fun, why do you want to have fun? Because you don\u0027t want to be stressed when important things come by. If it is too much, take a break, do something else.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-05-28T16:03:05Z","Content":"\n\u003Cp\u003EGo for a walk in the park. Or run. Run around the park and do some jumps and maybe some rolls if you\u0027re feeling up to it. It will let you physically release your anger in a healthy way, keep you away from the thing causing your anger and while you might get tired at the end of it and people might look at you, at least you\u0027ll have forgotten what you were angry about.\u003C/p\u003E\u003Cp\u003EKinda like this.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=XMjgSkfQPSY\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=XMjgSkfQPSY\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2013-05-28T16:19:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbface\u0022 data-cite=\u0022Kerbface\u0022\u003E\u003Cdiv\u003EGo for a walk in the park. Or run. Run around the park and do some jumps and maybe some rolls if you\u0027re feeling up to it. It will let you physically release your anger in a healthy way, keep you away from the thing causing your anger and while you might get tired at the end of it and people might look at you, at least you\u0027ll have forgotten what you were angry about.\u003Cp\u003EKinda like this.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=XMjgSkfQPSY\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=XMjgSkfQPSY\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just did my own little \u0022angry dance\u0022, and I haven\u0027t felt this calm in a long time.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-05-28T16:37:06Z","Content":"\n\u003Cp\u003EIf you can\u0027t do something after trying multiple times, best thing you can do (assuming you still had some free time) is close the game, computer and go Outside - go to grocery store, throw the trashes or check the mail (NOT e-mail !)... going for a walk can be even better.\u003C/p\u003E\u003Cp\u003EPlaying games maybe are fun but you can\u0027t truly rest by using computer.\u003C/p\u003E\u003Cp\u003EAlso if you failing terribly and it\u0027s late (and had no work to do) already you can consider go to bed earlier, so You will had more energy next day. \u003C/p\u003E\u003Cp\u003EAfter this you can try again and again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EEDIT_1: \u003C/p\u003E\u003Cp\u003EAlso always in docking mode I use throttle keys for Forward/Reverse movement (both translation \u0026amp; rotation - \u0022Any\u0022 setting in key binding) and W/S keys control Up/Down movement in translation mode... This small change made docking mode much more easier and intuitive for me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T16:45:54Z\u0022 title=\u002205/28/2013 04:45  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rockcoole","CreatedById":47139,"CreatedDateTime":"2013-05-28T16:37:15Z","Content":"\n\u003Cp\u003EI am far to melancholy to get mad over most things. The Star Wars Holiday Special is that rare time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-28T16:39:35Z\u0022 title=\u002205/28/2013 04:39  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 28, 2013\u003C/time\u003E by Rockcoole\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-05-28T16:49:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flymetothemun\u0022 data-cite=\u0022Flymetothemun\u0022\u003E\u003Cdiv\u003EI just did my own little \u0022angry dance\u0022, and I haven\u0027t felt this calm in a long time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey, I helped someone. That made me feel good.\u003C/p\u003E\n"},{"CreatedByName":"Noticeably FAT","CreatedById":43401,"CreatedDateTime":"2013-05-28T22:34:23Z","Content":"\n\u003Cp\u003EBreath in steadily (yes, a breathing exercise. Just hang with me for a minute here) for a four count. It doesn\u0027t have to be four seconds, but it should be close. Don\u0027t air gauge this, COUNT. Out loud, in your head, whatever, but say the numbers. One, two, three, four. Hold it for a second or so. Now release, one, two, three, four. If you go to fast, get a hitch in your breathing, whatever, just let it out and start over. One, two, three, four, hold... one, two, three, four. Don\u0027t try to calm yourself down, don\u0027t try to think about how this mumbo jumbo can\u0027t work, don\u0027t go for a bunch of rapid deep breaths, just focus on counting it out.\u003C/p\u003E\u003Cp\u003EThis isn\u0027t some sort of ancient Chinese secret or some new-age healer snake oil, it\u0027s just a neat physiological trick to slow your pulse and lower your blood pressure (albeit briefly). After you\u0027ve tried it once or twice take your pulse at your neck, you can actually feel it happening, it\u0027s pretty neat. Now, that\u0027s just the physical part. The sweet thing that happens when you rapidly lower your pulse and blood pressure is you get this nice little calm going. Even if it\u0027s just a couple seconds, that\u0027s more than enough to do what you have to do to talk yourself out of being pissed. That part\u0027s on you.\u003C/p\u003E\u003Cp\u003EBy the way, this works beyond anger. I do it all the time while riding my motorcycle, nearly getting run over is an excellent way to get your heart rate up, and being all adrenalized and twitchy is an excellent way to get hurt in traffic. So, someone cuts me off one two three four pause one two three four and I\u0027m right back to making good decisions. Well, good relative to thinking that piloting a few hundred pounds of motor in the midst of tons of inattentive roll cages was a good decision in the first place.\u003C/p\u003E\n"}]}