{"TopicId":37200,"ForumId":18,"TopicTitle":"Starting A Youtube Channel, Help!","CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-07-15T17:28:47Z","PageNum":1,"Articles":[{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-07-15T17:28:47Z","Content":"\n\u003Cp\u003EOK, I\u0027m going to be starting a YouTube for let\u0027s plays (including KSP!) and I need some advice. First, I\u0027d like someone to tell me if this is a good schedule starting out:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMonday:\u003C/strong\u003E Main Series\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETuesday:\u003C/strong\u003E Off Day\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWednesday:\u003C/strong\u003ESide Series\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThursday:\u003C/strong\u003E Off Day\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFriday:\u003C/strong\u003E Game of the Week\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESaturday:\u003C/strong\u003E Kerbal Space Program\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESunday:\u003C/strong\u003E Off Day\u003C/p\u003E\u003Cp\u003ESecond, I have a bit of a problem. I was going to start a series for Civilization 4: Colonization. It was going to be awesome. It was going to be amazing. I started the recording.\u003C/p\u003E\u003Cp\u003E\u0022Hello, I\u0027m the Jedi Master, and this is Civilization 4: Colonization! Now this is my first real Let\u0027s Play so... uh... um...\u0022\u003C/p\u003E\u003Cp\u003EI RAN OUT OF THINGS TO SAY. ON THE FLIPPING TITLE SCREEN.\u003C/p\u003E\u003Cp\u003EThen I tried doing it with my brother, and it was actually going well until a technical issue got in the way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But I\u0027m not going to be able to have him next to me all the time, especially since he isn\u0027t as into KSP as I am, so I would like some advice on not running out of things to say so quickly.\u003C/p\u003E\u003Cp\u003EAnyone willing to help? Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-15T17:41:21Z","Content":"\n\u003Cp\u003EI have some advice.\u003C/p\u003E\u003Cp\u003E1. Don\u0027t expect many views. It can take literally take a couple years before you are even noticed. This is unless of course you some how get noticed by another youtuber and they link to your channel.\u003C/p\u003E\u003Cp\u003E2. Don\u0027t TRY and get noticed. The more you try and put your channel on forums, or on someone elses Channel, the more you tend to get unnoticed. People will notice you if you are good, just keep at it.\u003C/p\u003E\u003Cp\u003E3. Talking to yourself is really hard to do at first, and you tend to forget what you will say and it just takes time to get used to. Chances are you will not like the way you sound either. This is normal. You will listen to yourself so much by doing videos, you will begin to change the way you talk. Again it really just takes time to get used to it all, and to become good at speaking properly.\u003C/p\u003E\u003Cp\u003E4. Make sure you have a somewhat decent mic. I also suggest you use Audacity to make a cheap mic sound more professional and remove any background noise.\u003C/p\u003E\u003Cp\u003E5. Keep things simple and to the point, and cut out parts that are boring.\u003C/p\u003E\u003Cp\u003E6. Just be yourself. :3 Sometimes it\u0027s good to even plan for specific topics to talk about just in case you do not have anything to talk about. Write the topics down. If you find you are being to silent, pick a topic to talk about during the down time, or just cut it if you are able to.\u003C/p\u003E\u003Cp\u003EThat\u0027s really all the advice i can offer. I think really the best advice I can give is to do it for fun, and that is all. If you are enjoying yourself, others will likely enjoy you as well. Don\u0027t do it to become popular, or to make money. You will be very disappointed if that is your main goal.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-07-15T17:55:25Z","Content":"\n\u003Cp\u003EThanks for the really detailed response, Brabbit! I\u0027m not trying to get too many views (though it certainly would be nice), I\u0027m mostly doing it as my own project. I never liked the sound of my own voice, either, nice to know that it\u0027s normal. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-15T18:00:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EThanks for the really detailed response, Brabbit! I\u0027m not trying to get too many views (though it certainly would be nice), I\u0027m mostly doing it as my own project. I never liked the sound of my own voice, either, nice to know that it\u0027s normal. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Elol yes, there is actually some scientific reason as to why people do not like the sound of their own voice when recorded. Though I couldn\u0027t tell you the specifics.\u003C/p\u003E\u003Cp\u003EAlso no problem. :3 I hope that helps though. I am rather new to youtube as well, so that is the best i could come up with lol.\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-07-15T18:32:56Z","Content":"\n\u003Cp\u003EBrabbit, you forgot one more thing, Do NOT make promises you can\u0027t keep!\u003C/p\u003E\u003Cp\u003EAlso, the \u0022Recorded\u0022 voice is your voice people around you hear you as, it sounds different when talking because it vibrates the bones in your body\u003C/p\u003E\n"},{"CreatedByName":"SolarLiner","CreatedById":41047,"CreatedDateTime":"2013-07-15T18:33:46Z","Content":"\n\u003Cp\u003EI also have a youtube channel that I started in January, and I completely agree with what Brabbit1987 said. Although I tried to get noticed on the first videos, now the ones who are following me still get notifications from my new videos, the others, well, I don\u0027t mind, one day they ill maybe check my channel and subscribe. Or they will periodically check and watch some videos. who knows ?\u003C/p\u003E\u003Cp\u003ETry to be as original as possible. If you watch some youtubers doing one thing, think or the opposite. They do it all seriously and in a roleplay manner ? Do it crazy, with all explosions and stuff. Feel free to cut unwanted parts that are too boring if necessary (more like in a NerdCubed manner), because I can tell you that almost every watcher who follows KSP stuff knows how to make an orbit. So try to distract them or accelerate the video, or completely remove the launch part.\u003C/p\u003E\u003Cp\u003EAlthough KSP is a good start, if you want a bit more viewers, try to do other let\u0027s plays, and maybe on other games, better if the game is original and non-too-much-played-because-of-its-awesomeness.\u003C/p\u003E\u003Cp\u003EGood luck with your channel, do not spam us and other forums but you can sure drop a link somewhere.\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-15T18:33:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCanadianVendingMachine\u0022 data-cite=\u0022TheCanadianVendingMachine\u0022\u003E\u003Cdiv\u003EBrabbit, you forgot one more thing, Do NOT make promises you can\u0027t keep!\u003Cp\u003EAlso, the \u0022Recorded\u0022 voice is your voice people around you hear you as, it sounds different when talking because it vibrates the bones in your body\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Epromises? Kinda confused on that part. What promises would someone not keep exactly?\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-07-15T18:57:41Z","Content":"\n\u003Cp\u003EUpload schedules, what you will play, etc etc.\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-15T19:02:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCanadianVendingMachine\u0022 data-cite=\u0022TheCanadianVendingMachine\u0022\u003E\u003Cdiv\u003EUpload schedules, what you will play, etc etc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh ya! You are right, I did forget that. I do not make promises ever, I just release videos when I can, so never really thought about it. If you ever think you are going to upload a video and talk about it, make sure to always say might, or maybe. Never make it a definite thing, because people will hold you too it. I find sometimes I am not in the mood, and a promise can make it difficult on you and make you feel like you NEED to do it. Which sucks, and you tend to make the video crap because you do not want to do it either.\u003C/p\u003E\u003Cp\u003EBut ya, long winded response sorry about that XD.\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-07-15T19:04:01Z","Content":"\n\u003Cp\u003EYeah don\u0027t set a strict schedule you will just hurt your self in the long run when your fans get mad if you can\u0027t keep to it. Also as said above... Don\u0027t expect a lot of views, I\u0027m a youtube gamer myself and after a year and ahalf I think I only have 23 subs... Just be patient and record games you like to play and says things that make sense with what is going on the screen haha! If you pm me a link to your channel I\u0027ll see what you got! I am kinda interested now.\u003C/p\u003E\n"},{"CreatedByName":"Xiphos","CreatedById":60680,"CreatedDateTime":"2013-07-15T19:07:56Z","Content":"\n\u003Cp\u003EI will agree with what brabbit said especially the one about writing down topics. You can also write down events in order that should happen throughout your video. Also, if you think something isn\u0027t going so good (a KSP mission perhaps) just keep going, because something good may come out of the failure, or you look back on it at the end and realize that was a good thing for people to see. In the videos I have made, I just thought about general topics as I went along. Sure there are some spots with no talking but that doesn\u0027t really worry me. I\u0027m not perfect, neither are my videos. Be sure to give us a link to your youtube page, I\u0027ll subscribe for sure! Above all have fun!\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2013-07-15T19:09:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brabbit1987\u0022 data-cite=\u0022Brabbit1987\u0022\u003E\u003Cdiv\u003Elol yes, there is actually some scientific reason as to why people do not like the sound of their own voice when recorded. Though I couldn\u0027t tell you the specifics.\u003Cp\u003EAlso no problem. :3 I hope that helps though. I am rather new to youtube as well, so that is the best i could come up with lol.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow, glad it\u0027s not just me. One thing to remember, is that a delayed sound of your own voice is actually confusing. As you think you said something already, so don\u0027t say the next thing (like an echo). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor my tutorial videos I do lots of practice. That\u0027s not quite possible for live gameplay.\u003C/p\u003E\u003Cp\u003EI\u0027m going to test doing a voice over after the recording, to see if that helps (and know Scott does that too sometimes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ).\u003C/p\u003E\u003Cp\u003EThanks for the advice Brabbit!\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-07-15T19:12:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00227499275\u0022 data-cite=\u00227499275\u0022\u003E\u003Cdiv\u003EYeah don\u0027t set a strict schedule you will just hurt your self in the long run when your fans get mad if you can\u0027t keep to it. Also as said above... Don\u0027t expect a lot of views, I\u0027m a youtube gamer myself and after a year and ahalf I think I only have 23 subs... Just be patient and record games you like to play and says things that make sense with what is going on the screen haha! If you pm me a link to your channel I\u0027ll see what you got! I am kinda interested now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, right now it\u0027s just one lame video that isn\u0027t even a Let\u0027s Play, but I\u0027ll be sure to link you once I get a video up!\u003C/p\u003E\u003Cp\u003EAs a quick update, I think I\u0027m being a bit OCD about this...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-15T19:17:56Z\u0022 title=\u002207/15/2013 07:17  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 15, 2013\u003C/time\u003E by The Jedi Master\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-07-15T19:22:19Z","Content":"\n\u003Cp\u003EAlright man, can\u0027t wait! And also... Don\u0027t feel alone about not liking the sound of your own voice when recording, I am the same way lol!\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-15T19:27:39Z","Content":"\n\u003Cp\u003EI am glad I could be of help to you all who needed it. I would link my Channel but I am afraid I am trying to keep that private for various reasons sadly =^.^;=\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2013-07-15T20:41:54Z","Content":"\n\u003Cp\u003EI don\u0060t like my voice so I just have captions.\u003C/p\u003E\n"},{"CreatedByName":"Brabbit1987","CreatedById":65801,"CreatedDateTime":"2013-07-15T20:47:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spartwo\u0022 data-cite=\u0022Spartwo\u0022\u003E\u003Cdiv\u003EI don\u0060t like my voice so I just have captions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was thinking about doing the same when I first started. I decided not to in the end, and later learned that just about everyone who starts does not like the sound of their own voice. Knowing this actually helped me tons to relax.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-07-15T20:57:06Z","Content":"\n\u003Cp\u003EHmmmm\u003C/p\u003E\u003Cp\u003E1: Put your best video in your signature. Somehow I did this and my best movie got 4100 views. So happy.\u003C/p\u003E\u003Cp\u003E2: Like brabbit said, if you make good quality things, it\u0027s gonna get noticed.\u003C/p\u003E\u003Cp\u003E3: Try editing, or just skipping over slow parts. For me, if a video comes to a slow part, it gets boring-er and I may not want to watch it. Eg: Trasnfering from kerbin to Jool. Do I need to spend 5 minutes watching you time warp to Jool? Unless you have some pretty good stuff to talk about.\u003C/p\u003E\n"}]}