{"TopicId":50499,"ForumId":18,"TopicTitle":"[Cosmology] Dark Matter, Gravity and Anti-matter - a hypothesis","CreatedByName":"Papa_Joe","CreatedById":10788,"CreatedDateTime":"2013-10-25T04:43:17Z","PageNum":1,"Articles":[{"CreatedByName":"Papa_Joe","CreatedById":10788,"CreatedDateTime":"2013-10-25T04:43:17Z","Content":"\n\u003Cp\u003EI just finished reading an article on the interwebz here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.charpan.com/gravity-in-relation-to-dark-matter-a-brief-discussion\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.charpan.com/gravity-in-relation-to-dark-matter-a-brief-discussion\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt it the author discussed an alternative view of gravity and dark matter.\u003C/p\u003E\u003Cp\u003EIn my soul it feels right. I would propose that it goes further.\u003C/p\u003E\u003Cp\u003EIirc, The current thinking is that the big bang came with equal parts matter and antimatter. Immediately after this event, most to all of the existing antimatter \u0022disappeared\u0022 and is assumed to be annihilated in the event and post. \u003C/p\u003E\u003Cp\u003ELets turn that on its ear for a moment. What if antimatter never disappeared at all? \u003C/p\u003E\u003Cp\u003EWhat if antimatter had a previously unknown property of repulsion to matter? It is well known what happens to matter when it comes into contact with antimatter. However, all our testing has been at energies high enough to create antimatter so we can observe it.... if that is true, then we are only looking at it\u0027s behaviour at extreme conditions, just as we are looking at matter at extreme conditions.\u003C/p\u003E\u003Cp\u003EAt ambient conditions, its behavior would likely be much like matter, only in repulsion to matter. So, here is the source of dark matter, and the source of gravity... the natural repulsion of antimatter, aka \u0022Dark matter\u0022 \u003C/p\u003E\u003Cp\u003EIn other words, gravity is antimatter pressure.\u003C/p\u003E\u003Cp\u003EThoughts?\u003C/p\u003E\u003Cp\u003EEdit: I found another article that supports my theory, and efforts are ongoing to prove whether matter and antimatter are repulsive. they will be using anti hydrogen in the testing.\u003C/p\u003E\u003Cp\u003ELink: \u003Ca href=\u0022http://news.nationalgeographic.com/news/2011/08/110831-dark-matter-proof-gravity-quantum-theory-cern-space-science\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://news.nationalgeographic.com/news/2011/08/110831-dark-matter-proof-gravity-quantum-theory-cern-space-science\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-25T17:31:24Z\u0022 title=\u002210/25/2013 05:31  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 25, 2013\u003C/time\u003E by Papa_Joe\u003C/strong\u003E\n\u003Cbr\u003EAdditional data\n\u003C/span\u003E\n"}]}