{"TopicId":51583,"ForumId":18,"TopicTitle":"Is this a good plotline?","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-11-02T18:07:16Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-11-02T18:07:16Z","Content":"\n\u003Cp\u003EI need someone to tell me about this plotline in KSP and if it can happen, and if it is achievable, along with a comment on the plot editing.\u003C/p\u003E\u003Cp\u003EHere goes;\u003C/p\u003E\u003Cp\u003EIn 2057, Kerbalkind has expanded to Joolian moons, and is slowly becoming a spacefaring race. Bill Kerman is launched as the new base commander for Duna Base One, a small research colony run by the United Provincal government. The journey is routine and uneventful- as Kerbalkind as already sent more than a dozen expeditions to Duna and most of the press has lost interest.\u003C/p\u003E\u003Cp\u003EAfter his spacecraft lands, Mission Control celebrates, while a Administrator in the space agency voices his concerns over the buildup of military power and quickly deteriorating relations between the United Proviences and an another superpower, both which are nuclear capable.\u003C/p\u003E\u003Cp\u003EHowever, as the previous base commander, Scott Kerman, prepares to return home, tumultuous events break out on Kerbin and the director of the space agency orders all return flights suspended in one last radio message to Duna and Laythe outposts, before losing contact.\u003C/p\u003E\u003Cp\u003ESensing all is lost, Nedfred Kerman, the head scientist leaves the base and never returns (In an final act of suicide), while Tom, the a technican at Laythe Station, injects himself with cyanide, killing himself instantly, while the commander at Ike station kills his crew by shutting down all the life support systems, before going on an on and spacewalk, where he disconnects his oxygen tank.\u003C/p\u003E\u003Cp\u003EJebediah Kerman, the mission commander of Jool-7 aborts his mission to Tylo upon hearing of the events and goes to Laythe Station instead. At Laythe station, he meets Adam Kerman, the only kerbolnaut left onboard since Tom Kerman has committed suicide. They decide to head back to Duna to pick up survivors, and Jebediah takes him onboard despite the protests of his crew. They scavenge Laythe Station for parts and refuel and restock, before Jebediah fires the engine. \u003C/p\u003E\u003Cp\u003EThey rendezvous with Ike station, finding the crew dead and most functions offline. Jebediah manages to get into the craft with a EVA suit, and restores power to the station. \u003C/p\u003E\u003Cp\u003EMeanwhile on Duna, one of the crew hijacks an Kerbin-return vehicle-but the engine fails, causing him to be killed after the craft crashes back onto Duna. Now down to three return vehicles, Bill puts the base into lockdown, and informs the crewmembers they will stay on Duna. Three crewmembers mutiny, and Bill replies by shooting at them with a pistol, killing one of them, which makes the rest put off their plans. The crew of Duna Station decide to land on Duna, using the only lander docked to the station, whih crashes into the Dunaian desert after a parachute fails to open.\u003C/p\u003E\u003Cp\u003EJebediah contacts Duna Base One, and is relieved to hear that the crew is alive and well. He leaves one of his crew to manage Ike Station, and rendezvouses with abandoned Duna Station, and tries to persuade Bill to meet them there with a return vehicle.\u003C/p\u003E\u003Cp\u003EBill does so, and carries two crew members with them. Jebediah changes Bills mind, and they both decide to return to Kerbin. The both of them then transmit their orders to Duna Base One. The crew eagerly abandons the base, and all but two lift off from Duna (The two who decide to man the base until further notice).\u003C/p\u003E\u003Cp\u003EJeb uses his vessel to return to Ike, where he finds out that the crewmembers he left behind has already used the craft to return to Kerbin.\u003C/p\u003E\u003Cp\u003EThe craft refuels, and uses the thrusters on the station as a \u0022booster\u0022 strapping itself to the station and firing the thrusters mean\u0027t to maintain its orbit. He then fires his own engine, and returns to Kerbin orbit five months later. Since more Kerbals are in his ship than he can take down, Jebediah rendezvouses with an United Provincal station. The station commander refuses to let him dock, and attacks the Jool-7, disabling its engines. Jebediah rams his vessel into the station with use of thrusters, and hacks the station computer to open the airlocks.\u003C/p\u003E\u003Cp\u003EWhen the airlocks are open, Jebediah boards the station, and kills the commander. Meh than takes the craft docked to the station, and deorbits it, but not before separating the modules and having his crew split up into two crafts.\u003C/p\u003E\u003Cp\u003EHis capsule renters Kerbin, and the parachutes deploy for a landing at the Kerbin highlands.\u003C/p\u003E\u003Cp\u003EThe story ends with Jebediah and his crew walking into the distance toward the ruins of a smoking city, while Bill\u0027s voice is heard over the radio.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T18:29:04Z\u0022 title=\u002211/02/2013 06:29  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"}]}