{"TopicId":5338,"ForumId":18,"TopicTitle":"Your Zombie Plan?","CreatedByName":"Altair1371","CreatedById":6754,"CreatedDateTime":"2012-01-11T07:46:05Z","PageNum":5,"Articles":[{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2014-10-19T16:59:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022megatiger78\u0022 data-cite=\u0022megatiger78\u0022\u003E\u003Cdiv\u003Eactually my real plan is:\u003Cp\u003E1. buy wildstar and loads of the game time card things.\u003C/p\u003E\u003Cp\u003E2. board up house after finding stuff to eat.\u003C/p\u003E\u003Cp\u003E3.play wildstar. and star citizen\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou will die. Both of these games are useless without any other players. Plus, star citizen is very boring in its current state.\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2014-10-19T17:03:33Z","Content":"\n\u003Cp\u003ECaves, get my old caving gear, try finding me at the bottom of a 200 foot pitch ya smelly brain munching b***ers\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2014-10-19T18:17:24Z","Content":"\n\u003Cp\u003Erealistic-ish zombie plan and my actual plan if i don\u0027t die\u003C/p\u003E\u003Cp\u003E1. pack up what i need plus my laptop and a portable generator\u003C/p\u003E\u003Cp\u003E2. board up my house for the first month after filling my bathtub with as much water i can as soon as the power goes out\u003C/p\u003E\u003Cp\u003E3. when supplies run low, go out and locate nearby friends/relatives if alive and not willing to kill me\u003C/p\u003E\u003Cp\u003E4. set up new outpost/base camp at nearby armored store that has been left alone after the initial chaos\u003C/p\u003E\u003Cp\u003E5. board up along side relatives/friends while still doing scout missions in search for food and weapons\u003C/p\u003E\u003Cp\u003E6. after locating sufficient materials, begin cleansing operation of nearby zombies in the area\u003C/p\u003E\u003Cp\u003E7. locate bookstore that has World War and the zombie survival guide\u003C/p\u003E\u003Cp\u003E8. confirm what has been done properly and has not based on knowledge in books\u003C/p\u003E\u003Cp\u003E9. reclaim store and homes slowly and progressively as i bring in more survivors\u003C/p\u003E\u003Cp\u003E10. create/re-discover new manufacturing techniques through the help of new survivors and available resources in order to stay stocked on munitions and guns\u003C/p\u003E\u003Cp\u003E11. begin farming new food using available lots and wilderness\u003C/p\u003E\u003Cp\u003E12. update defensive to include defensive walls and watchtowers to clean out remaining zombies\u003C/p\u003E\u003Cp\u003E13. set up new ways to signal survivors via radio and other methods\u003C/p\u003E\u003Cp\u003E14. defend self and settlement from incoming zombies and crazed survivors\u003C/p\u003E\u003Cp\u003E15. create a new community within the walls of the settlement\u003C/p\u003E\u003Cp\u003E16. train next generation to survive the new world as well as explore and know when not to trust people\u003C/p\u003E\u003Cp\u003E17. rebuild civilization from scratch with a new found trust in humanity and that technology and science should never be feared no matter how it is misused\u003C/p\u003E\u003Cp\u003E18. come into contact with other settlements and overthrow dictatorships and homicidal cults that have sprung up\u003C/p\u003E\u003Cp\u003E19. bask in the realization that humanity survived because of my actions but hope that it isn\u0027t short-lived\u003C/p\u003E\u003Cp\u003E20 now you have survived good luck\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-10-20T00:00:54Z","Content":"\n\u003Cp\u003E1. Pick up my boat and load with food\u003C/p\u003E\u003Cp\u003E2. Drive to Loch Lomond\u003C/p\u003E\u003Cp\u003E3. Sail to Island\u003C/p\u003E\u003Cp\u003E4. Wait for a month or so\u003C/p\u003E\u003Cp\u003E5. Sail back to shore and resume life\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2014-10-20T07:24:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PenguinsMeep\u0022 data-cite=\u0022PenguinsMeep\u0022\u003E\u003Cdiv\u003EYou will die. Both of these games are useless without any other players. Plus, star citizen is very boring in its current state.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewait how many people are likely to survive? might as well add more people to that plan....\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2014-10-22T02:34:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DisarmingBaton5\u0022 data-cite=\u0022DisarmingBaton5\u0022\u003E\u003Cdiv\u003EFind an aircraft carrier and a lot of food?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis needs refinement.\u003C/p\u003E\u003Cp\u003E1)Find airplane\u003C/p\u003E\u003Cp\u003E2)Find aircraft carrier\u003C/p\u003E\u003Cp\u003E3)Realize you forgot food\u003C/p\u003E\u003Cp\u003E4)Get food\u003C/p\u003E\u003Cp\u003E5)Return to carrier\u003C/p\u003E\u003Cp\u003E6)Land upon carrier\u003C/p\u003E\u003Cp\u003E7)Live! Also play lots of KSP because what else do you do on an empty aircraft carrier\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2014-10-22T06:14:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DisarmingBaton5\u0022 data-cite=\u0022DisarmingBaton5\u0022\u003E\u003Cdiv\u003EThis needs refinement.\u003Cp\u003E1)Find airplane\u003C/p\u003E\u003Cp\u003E2)Find aircraft carrier\u003C/p\u003E\u003Cp\u003E3)Realize you forgot food\u003C/p\u003E\u003Cp\u003E4)Get food\u003C/p\u003E\u003Cp\u003E5)Return to carrier\u003C/p\u003E\u003Cp\u003E6)Land upon carrier\u003C/p\u003E\u003Cp\u003E7)Live! Also play lots of KSP because what else do you do on an empty aircraft carrier\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eplay anything really.\u003C/p\u003E\n"},{"CreatedByName":"Apature rocket science","CreatedById":77886,"CreatedDateTime":"2015-03-13T03:48:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Helix935\u0022 data-cite=\u0022Helix935\u0022\u003E\u003Cdiv\u003Erealistic-ish zombie plan and my actual plan if i don\u0027t die\u003Cp\u003E1. pack up what i need plus my laptop and a portable generator\u003C/p\u003E\u003Cp\u003E2. board up my house for the first month after filling my bathtub with as much water i can as soon as the power goes out\u003C/p\u003E\u003Cp\u003E3. when supplies run low, go out and locate nearby friends/relatives if alive and not willing to kill me\u003C/p\u003E\u003Cp\u003E4. set up new outpost/base camp at nearby armored store that has been left alone after the initial chaos\u003C/p\u003E\u003Cp\u003E5. board up along side relatives/friends while still doing scout missions in search for food and weapons\u003C/p\u003E\u003Cp\u003E6. after locating sufficient materials, begin cleansing operation of nearby zombies in the area\u003C/p\u003E\u003Cp\u003E7. locate bookstore that has World War and the zombie survival guide\u003C/p\u003E\u003Cp\u003E8. confirm what has been done properly and has not based on knowledge in books\u003C/p\u003E\u003Cp\u003E9. reclaim store and homes slowly and progressively as i bring in more survivors\u003C/p\u003E\u003Cp\u003E10. create/re-discover new manufacturing techniques through the help of new survivors and available resources in order to stay stocked on munitions and guns\u003C/p\u003E\u003Cp\u003E11. begin farming new food using available lots and wilderness\u003C/p\u003E\u003Cp\u003E12. update defensive to include defensive walls and watchtowers to clean out remaining zombies\u003C/p\u003E\u003Cp\u003E13. set up new ways to signal survivors via radio and other methods\u003C/p\u003E\u003Cp\u003E14. defend self and settlement from incoming zombies and crazed survivors\u003C/p\u003E\u003Cp\u003E15. create a new community within the walls of the settlement\u003C/p\u003E\u003Cp\u003E16. train next generation to survive the new world as well as explore and know when not to trust people\u003C/p\u003E\u003Cp\u003E17. rebuild civilization from scratch with a new found trust in humanity and that technology and science should never be feared no matter how it is misused\u003C/p\u003E\u003Cp\u003E18. come into contact with other settlements and overthrow dictatorships and homicidal cults that have sprung up\u003C/p\u003E\u003Cp\u003E19. bask in the realization that humanity survived because of my actions but hope that it isn\u0027t short-lived\u003C/p\u003E\u003Cp\u003E20 now you have survived good luck\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis just sounds like you played the game rebuild a lot\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-03-13T04:14:54Z","Content":"\n\u003Cp\u003EI just plan to eat brains!!! MMMMmmmm (\u0026lt;- Keepin it simple!)\u003C/p\u003E\u003Cp\u003EEdit: Wasn\u0027t this thread just in the forum games section?\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-03-13T04:31:44Z","Content":"\n\u003Cp\u003Esimple, take a gun to my temple and pull the trigger\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-03-13T04:35:02Z","Content":"\n\u003Cp\u003EStay away from zombies.\u003C/p\u003E\u003Cp\u003ELook for food. Maybe make a greenhouse and fertilizer and stuff so I can grow some crops to help me out. Maybe potatoes, or some other good crops.\u003C/p\u003E\u003Cp\u003EPerhaps build up a community. Safety in numbers, you know.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-03-13T10:49:18Z","Content":"\n\u003Cp\u003EI have a general idea zombie plan that can be adapted at certain points depending on the nature of the zombie apocalypse (does it happen sudden, or more gradual? What is the nature of said zombies? etc.)\u003C/p\u003E\u003Cp\u003EIn general tough:\u003C/p\u003E\u003Cp\u003EFind a backpack or anything similar and fill it with whatever supplies you can find within one minute. Make sure you have some sort of melee weapon. I live in Europ where we have a serious gun restriction, so a reachable firearm or other ranged weapon is highly unlikely to be near, don\u0027t waste time looking for one. Speed is key, get your ass to the nearest shops or other supply point, get as much unspoilable foods as possible. Forget anything that will spoil easily or requires a lot of preparation.\u003C/p\u003E\u003Cp\u003ERoads are a killer. In case of zombie apocalyps, EVERYONE will be trying to GTFO so roads are likle to be completely gridlocked. Get out, but don\u0027t use a car unless it can offroad (and even then, getting out of any city is gonna be mureder). Motorcycles are ideal because they can reach high speeds and maneuvre between obstacles/ traffic jams, but if you can\u0027t get your hands on one of those, even a bicycle might be preferrable to a car in case of a total traffic gridlock.\u003C/p\u003E\u003Cp\u003EGuns are often a thing people will actively look for, but that might actually be a terrible idea. Simple reason being that almost every gun out there has an owner which knows where said firearm is being held. And when the apocalyps hits, all those owners will very quickly go for their firearms and be very unwilling to give them up. In fact, they might decide that that\u0027s a very nice backpack with supplies you have there, why don\u0027t you leave that with me here before someone gets shot? Zombies are (usually) rather slow. Melee weapons should be just fine if you play things smart and safe.\u003C/p\u003E\u003Cp\u003EGo North (or south if you live in the souther hemisphere). Head to cold climates. Pretty much all zombies have one thing in common: they\u0027re dead. That means no body heat, and no defense angainst becoming frozen solid in sub-zero climates.\u003C/p\u003E\u003Cp\u003ETry to survive out in the colder climates until the whole thing blows over, adapt as situations occur. Always make sure you have water, heat, shelter and camp at a vantage point.\u003C/p\u003E\u003Cp\u003EEDIT: damn, didn\u0027t notice the necro...\u003C/p\u003E\n"},{"CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2015-03-13T11:17:48Z","Content":"\n\u003Cp\u003E1: Die horribly.\u003C/p\u003E\u003Cp\u003E2: Be disappointed.\u003C/p\u003E\u003Cp\u003E3: Regret nothing.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-03-13T11:28:06Z","Content":"\n\u003Cp\u003EStep 1: Build a suit of power armour\u003C/p\u003E\u003Cp\u003EStep 2: Recruit followers\u003C/p\u003E\u003Cp\u003EStep 3: Lead a crusade to purge the undead.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-13T11:31:40Z","Content":"\n\u003Cp\u003EI wonder if it is ironic or appropriate that a thread about surviving zombie got revived from the dead.\u003C/p\u003E\u003Cp\u003EAnyway, since I do have experience in archery and have a brother who is a survival nut, I think I will just stick with him and make it to a forest somewhere and live on the trees.\u003C/p\u003E\n"},{"CreatedByName":"TonyC","CreatedById":95836,"CreatedDateTime":"2015-03-13T11:40:24Z","Content":"\n\u003Cp\u003EMy plan :\u003C/p\u003E\u003Cp\u003EIf zombies are really like in The Walking Dead, there is only one thing to do :\u003C/p\u003E\u003Cp\u003EDay \u0026lt;0 (before zombies) :\u003C/p\u003E\u003Cp\u003EGet 3 weeks worth of supplies, a few things not to get too bored, prepare barricades.\u003C/p\u003E\u003Cp\u003EDay 1 :\u003C/p\u003E\u003Cp\u003EInstall barricades, wait for a few weeks for the zombies to decompose enough not to be not a threat anymore.\u003C/p\u003E\u003Cp\u003EDay 20 : Come out, move to the countryside, if not already, and start cultivating soil. Maybe go to cities to gather some stuff. Try not to get killed by other scavengers.\u003C/p\u003E\n"},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-03-13T14:28:23Z","Content":"\n\u003Cp\u003EMine unfortunately would be kill everything that moves steal thing then commit suicide \u003C/p\u003E\u003Cp\u003E(I took a test) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-03-13T15:10:30Z","Content":"\n\u003Cp\u003EWake up.\u003C/p\u003E\n"},{"CreatedByName":"Apature rocket science","CreatedById":77886,"CreatedDateTime":"2015-03-15T05:33:33Z","Content":"\n\u003Cp\u003EOk for all you idiots out ther heading north dosn\u0027t work when every one dose it, there is very limited amount of food up north, for a reason the conditions are harsh, there is practically no food up north because there is little sunlight, the Benifit of no zombies dose not outweigh the harsh conditions the lack of food and worse of all the people, read world war z, heading north is the dumbest idea I have ever heard and if one more person says lets head north I will make it my plan to infect you, and then kill you because that\u0027s what\u0027s going to happen to you regardless how Mutch you plan.\u003C/p\u003E\u003Cp\u003EOk if you are in America, head to the Rocky Mountains, walk along the jhon meuer track, and live along there, there\u0027s plenty of fresh water, take a crossbow to hunt deer and because it is very mountainous you won\u0027t find any zombies also to your East side there is desert and to your west side there is California, you could possibly venture out once every 6. Months to get some gear and go back, also the track runs north south along america so you could travel it to the cold zombie less north if you want. I have tested this idea, there are tons of lakes along the track and there is lots of fish in them as long as you kept on the move and did not over fish every spot and went a rotation of spots you would not over fish or pillage the area so you could survive for ever in a group no more then 3 people, this plan is for those hikers and hunters out there who can hunt hike and know how to navagate.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis isn\u0027t fallout, you can\u0027t make power armour and if you read max brooks zombie survival guide you will be overwear ex in your armour and be crushed to death, suits of armour don\u0027t work because 1 you will be very slow 2 you will over heat or get too cold 3 armour breaks and rusts 4 you will run out of power for your \u0022power armour\u0022 5 because you are slow and clumbersome you will not die but a hord will sorting you and you will be crushed to death\u003C/p\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-03-15T05:51:34Z","Content":"\n\u003Cp\u003E1) Predict zombie apocalypse before it happens\u003C/p\u003E\u003Cp\u003E2) Get hired by NASA\u003C/p\u003E\u003Cp\u003E3) Get assigned to the ISS\u003C/p\u003E\u003Cp\u003E4) \u003Cem\u003EWhen apocalypse happens, laugh at Earth\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIf zombies have no brains, I don\u0027t think they\u0027ll be smart enough to make their own space program. And besides, they can\u0027t threaten us in space! Don\u0027t they know that the UN banned space weaponry?\u003C/p\u003E\u003Cp\u003ESilly zombies. This is a good plan.\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-03-16T01:06:03Z","Content":"\n\u003Cp\u003EDay one\u003C/p\u003E\u003Cp\u003E Hour 1\u003C/p\u003E\u003Cp\u003E Think I am dreaming\u003C/p\u003E\u003Cp\u003E Hour 2\u003C/p\u003E\u003Cp\u003E Think I went crazy(er)\u003C/p\u003E\u003Cp\u003E Hour 3\u003C/p\u003E\u003Cp\u003E Think of plan\u003C/p\u003E\u003Cp\u003E Hour 4-running out of food\u003C/p\u003E\u003Cp\u003E Hook up generator and stay inside until I run out of food\u003C/p\u003E\u003Cp\u003EAfter running out of food\u003C/p\u003E\u003Cp\u003E Hour one-week later\u003C/p\u003E\u003Cp\u003E See if zombies go away after a week\u003C/p\u003E\u003Cp\u003EWeek after running out of food\u003C/p\u003E\u003Cp\u003E Day one \u003C/p\u003E\u003Cp\u003E Hour one-eight\u003C/p\u003E\u003Cp\u003E To to basement and grab sledgehammer, break through wall and tunnel to neighbour who had a greenhouse but got arrested, leaving the house and greenhouse\u003C/p\u003E\u003Cp\u003E Day two\u003C/p\u003E\u003Cp\u003E Hour one-three\u003C/p\u003E\u003Cp\u003E Look for the seeds in the freezer\u003C/p\u003E\u003Cp\u003E Hour four\u003C/p\u003E\u003Cp\u003E Plant seeds and look for the numbing supplies left in neighbour\u0027s underground greenhouse\u003C/p\u003E\u003Cp\u003E Day three-ten\u003C/p\u003E\u003Cp\u003E Hour one\u003C/p\u003E\u003Cp\u003E Eat any seeds I cannot plant, making ration small enough to last a month\u003C/p\u003E\u003Cp\u003E Hour two - 70 (decimal hours)\u003C/p\u003E\u003Cp\u003E Sleep and tend plants, hope I do not get hurt\u003C/p\u003E\u003Cp\u003E Day 11-30\u003C/p\u003E\u003Cp\u003E Hour one\u003C/p\u003E\u003Cp\u003E Get hurt, use the leftover numbing substance to get numb, while trying to not inhale it\u003C/p\u003E\u003Cp\u003E Hour two-289 (decimal hours again)\u003C/p\u003E\u003Cp\u003E Sleep and tend crops, while planting the ration for that day every third day\u003C/p\u003E\u003Cp\u003E Hour 290\u003C/p\u003E\u003Cp\u003E Harvest crops, have a feast\u003C/p\u003E\u003Cp\u003E Day 31\u003C/p\u003E\u003Cp\u003E Hour 1 - 5\u003C/p\u003E\u003Cp\u003E Tunnel to neighbour\u0027s that have bamboo, eat bamboo or try to\u003C/p\u003E\u003Cp\u003E Hour 6\u003C/p\u003E\u003Cp\u003E Notice zombies at surface\u003C/p\u003E\u003Cp\u003E Run back to tunnel, take some bamboo\u003C/p\u003E\u003Cp\u003E Hour 7\u003C/p\u003E\u003Cp\u003E Block up tunnel with larger bamboo\u003C/p\u003E\u003Cp\u003E Hour 8\u003C/p\u003E\u003Cp\u003E Make bamboo spears, but never intend to use it, just to not get cabin fever and to scare zombies\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-03-16T01:08:52Z","Content":"\n\u003Cp\u003EDay One:\u003C/p\u003E\u003Cp\u003EScream and run.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2015-03-16T04:46:58Z","Content":"\n\u003Cp\u003EAllow me to borrow from Susan, a character from \u003Ca href=\u0022http://www.egscomics.com/egsnp.php?id=260\u0022 rel=\u0022external nofollow\u0022\u003EEGS\u003C/a\u003E, whose zombie plan is the most sensible one I\u0027ve ever heard:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.egscomics.com/comics/1423025849-NP-150204-01_zombiepit.png\u0022 alt=\u00221423025849-NP-150204-01_zombiepit.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-16T16:15:41Z\u0022 title=\u002203/16/2015 04:15  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 16, 2015\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2015-03-16T14:04:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003EAllow me to borrow from Susan, a character from \u003Ca href=\u0022http://www.egscomics.com/egsnp.php?id=260\u0022 rel=\u0022external nofollow\u0022\u003EEGS\u003C/a\u003E, who\u0027s zombie plan is the most sensible one I\u0027ve ever heard:\u003Cp\u003E\u003Ca href=\u0022http://www.egscomics.com/comics/1423025849-NP-150204-01_zombiepit.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.egscomics.com/comics/1423025849-NP-150204-01_zombiepit.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003ESo how do you get around the whole filling in trench with their own bodies thing?\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-16T14:49:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brethern\u0022 data-cite=\u0022Brethern\u0022\u003E\u003Cdiv\u003ESo how do you get around the whole filling in trench with their own bodies thing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E3rd panel. The character said \u0022Well, naturally, there\u0027d be cleanup involved.\u0022\u003C/p\u003E\n"}]}