{"TopicId":55322,"ForumId":18,"TopicTitle":"Nelson Mandala\u0026#039;s Death","CreatedByName":"rasheed","CreatedById":29903,"CreatedDateTime":"2013-12-05T22:13:21Z","PageNum":1,"Articles":[{"CreatedByName":"rasheed","CreatedById":29903,"CreatedDateTime":"2013-12-05T22:13:21Z","Content":"\n\u003Cp\u003ELet us mourn for the loss of a great leader, Nelson Mandala, Former South African President. He passed away today at an age of 95 at his home. Let us give a moment of silence \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Mmmmyum","CreatedById":85231,"CreatedDateTime":"2013-12-05T22:34:22Z","Content":"\n\u003Cp\u003EI think the worst part about it is that the ANC will find some way to use it to help them in the elections... Inhumane *******s\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-05T22:43:18Z","Content":"\n\u003Cp\u003EThe world has lost a great man today. At least he lived to see his one wish come true.\u003C/p\u003E\n"},{"CreatedByName":"Needles_10","CreatedById":59554,"CreatedDateTime":"2013-12-05T23:21:43Z","Content":"\n\u003Cp\u003EHe will forever be missed, and forever remembered for his ability to move people\u0027s hearts with his lifelong passion for freedom.\u003C/p\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-12-05T23:24:59Z","Content":"\n\u003Cp\u003EHumanity will forever remember this man that stood up to racial oppression, and if anything, ended all of it.\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-12-05T23:26:05Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027lucida grande\u0027;\u0022\u003E\u003Cspan style=\u0022color:#37404E;\u0022\u003ENelson Mandela was one of the greatest men of our time. He stood up against an oppressive racial regime, which was backed by even the United States. He and a handful of brave people took charge and brought Apartheid down, and gave rise to democracy in South Africa. He will be missed.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027lucida grande\u0027;\u0022\u003E\u003Cspan style=\u0022color:#37404E;\u0022\u003E-zekes\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-12-05T23:36:26Z","Content":"\n\u003Cp\u003ESorry, but what did he do?\u003C/p\u003E\n"},{"CreatedByName":"Needles_10","CreatedById":59554,"CreatedDateTime":"2013-12-05T23:51:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCanadianVendingMachine\u0022 data-cite=\u0022TheCanadianVendingMachine\u0022\u003E\u003Cdiv\u003ESorry, but what did he do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe ended Apartheid.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-06T00:31:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCanadianVendingMachine\u0022 data-cite=\u0022TheCanadianVendingMachine\u0022\u003E\u003Cdiv\u003ESorry, but what did he do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMight want to brush up on your history...\u003C/p\u003E\u003Cp\u003EEssentially, he ended the genocide of blacks in South Africa, also known as Apartheid. He also made the country a democracy, and was generally a great man.\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-12-06T01:37:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EMight want to brush up on your history...\u003Cp\u003EEssentially, he ended the genocide of blacks in South Africa, also known as Apartheid. He also made the country a democracy, and was generally a great man.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGenocide? Maybe I\u0027m not remembering my history, but I thought apartheid was pretty much segregation like what we had here in the states, only much worse.\u003C/p\u003E\u003Cp\u003EIn other words, I guess his \u0022long walk to freedom\u0022 has finally ended.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-06T05:29:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EMight want to brush up on your history...\u003Cp\u003EEssentially, he ended the genocide of blacks in South Africa, also known as Apartheid. He also made the country a democracy, and was generally a great man.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, it looks like South Afrika is swinging the other way a bit too far. The country should be careful not to repeat its history with only the skin colours reversed.\u003C/p\u003E\n"},{"CreatedByName":"Mmmmyum","CreatedById":85231,"CreatedDateTime":"2013-12-06T06:10:22Z","Content":"\n\u003Cp\u003ELet\u0027s not get into politics and interracial discussions... It wasn\u0027t a genocide. It was stupidly unfair, yes. Think black people weren\u0027t allowed to use the same beaches, resturants, jobs, education, toilets, parks, anything really as white people. They had almost no rights, and were treated like animals.\u003C/p\u003E\u003Cp\u003ENow there are a few racist black politicians, google Julius Malema for one, with his \u0022shoot the boer\u0022 song (boer being a term for an afrikaaner, or someone who is Afrikaans). What aggravates it a bit more is there are two main parties, the ANC (African National Congress, which is the party \u0022that brought freedom to the people\u0022 who have not lost an election since 1994, who are mostly corrupt and have the support of the uneducated (and the education department is a joke, which is why I\u0027m in a private school and also leads to them getting more votes because people trust them blindly). To win an election the ANC basically reminds everyone of 1994 and promises the poor service delivery and housing that never happens.\u003C/p\u003E\u003Cp\u003EThen you get the DA, they are the \u0022white\u0022 party. They are run by a white woman called Helen Ziller (now that\u0027s already a problem with 99% black population). The DA always win the vote in Cape Town (which is the best city imo). They get all the white votes (that\u0027s an approximation) and quite a lot of votes from educated black people who see past the ANC\u0027s promises.\u003C/p\u003E\u003Cp\u003EEventually it turns into some sort of sick joke where the ANC promises the poor houses while they drive around in expensive cars (think a few multi-million Rand cars a year like a BMW M6, Mercedes C55 AMG, that sort of thing) paid for from tax payers money. And the because only around 3 million people pay tax out of the 51 million who live here. And you can guess who makes up the majority of the tax payers... (white people)\u003C/p\u003E\u003Cp\u003ESo that was a slightly biased explanation of how current politics works in South Africa, mostly because some people don\u0027t know the first thing about how it works\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-06T07:30:25Z","Content":"\n\u003Cp\u003EPlease, let\u0027s not get caught up in comparing degrees and types of injustice in this forum. Those who respect Mandela may leave notes consoling each other, while those who do not can just skip to the next thread.\u003C/p\u003E\n"}]}