{"TopicId":55675,"ForumId":18,"TopicTitle":"Really Weird Dreams","CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-09T22:50:06Z","PageNum":1,"Articles":[{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-09T22:50:06Z","Content":"\n\u003Cp\u003ESometimes we have awesome dreams. Sometimes we have dreams that mean something in our lives. Sometimes we have nightmares.\u003C/p\u003E\u003Cp\u003EAnd sometimes, our brains just pull [sTUFF] out of its [HAT].\u003C/p\u003E\u003Cp\u003EI had a dream last night that really makes no real sense. I think it had something to do with KSP. Map mode showed the Mun, but regular view showed an island, a mansion, palm trees, etc. The lander happened to be a jar of peanut butter. (I swear this is not drug induced...) Mater from \u003Cem\u003ECars\u003C/em\u003E drove over to the landed peanut butter jar. Six LEGO minifigs came out. I don\u0027t remember much after that.\u003C/p\u003E\u003Cp\u003EWhat is this? Is someone in town smoking something (it sure isn\u0027t me)? Is this a future update after Squad got really drunk? Whatever it is, I know that I\u0027ve started to record my dreams for lucid dreaming purposes, so I was asking for it.\u003C/p\u003E\u003Cp\u003ESo, what have been your weirdest dreams?\u003C/p\u003E\n"},{"CreatedByName":"fatfluffycat","CreatedById":73913,"CreatedDateTime":"2013-12-09T23:04:11Z","Content":"\n\u003Cp\u003EI hate dreams where your running from somebody or something, you feel like a drunk, keep falling over and stuff, then you try to close a door, your to weak to close it, they come rushing in, then you wake up.\u003C/p\u003E\u003Cp\u003EAnd then there are the dreams about snakes......there will be snakes everywhere you look.\u003C/p\u003E\u003Cp\u003Eother dreams are just too naughty/weird/gross to talk about\u003C/p\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2013-12-10T00:45:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fatfluffycat\u0022 data-cite=\u0022fatfluffycat\u0022\u003E\u003Cdiv\u003EI hate dreams where your running from somebody or something\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI feel ya. That sense of being chased and helpless against what\u0027s chasing you is horrible.\u003C/p\u003E\u003Cp\u003EOn the other hand, naughty dreams are nice to have \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dudester28","CreatedById":61717,"CreatedDateTime":"2013-12-10T01:12:41Z","Content":"\n\u003Cp\u003EOn the other hand, there are dreams where you get REALLY disappointed that you had to wake up.\u003C/p\u003E\n"},{"CreatedByName":"swiftgates24","CreatedById":22280,"CreatedDateTime":"2013-12-10T01:47:49Z","Content":"\n\u003Cp\u003EThe one where everyone is trying to kill me...because I ate the fish in the sock...wait what. It is a series of sorts. I had the first dream a month ago, now I\u0027m on the third where I am disguised into the crowd trying to kill me \u0026gt;.\u0026lt;\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-12-10T02:12:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fatfluffycat\u0022 data-cite=\u0022fatfluffycat\u0022\u003E\u003Cdiv\u003EAnd then there are the dreams about snakes......there will be snakes everywhere you look.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot for me. I have no problem with snakes.\u003C/p\u003E\u003Cp\u003EAnyway, I had on of those dreams last night (this morning, I didn\u0027t got to bed till 3AM.) I launched a mission to some gas giant and dropped probes into it in such a way that I rendezvous with them with no outside intervention. The next thing I know, I attending some elementary school again (and I\u0027m a freshman in college.) Then I left and felt a snake climbing up my leg (no joke, I actually saw one.) Just one though. I then went back to my \u0022gas giant mission\u0022 and woke up a few hours latter at 11AM (schools were closed due to winter weather.) That is the best I can describe it to you. Is my subconscious mind completely f---ed up or something?\u003C/p\u003E\n"},{"CreatedByName":"YarTheBug","CreatedById":72310,"CreatedDateTime":"2013-12-10T02:49:49Z","Content":"\n\u003Cp\u003E\u0026gt; Watch all of season 3 of Walking Dead on netflix\u003C/p\u003E\u003Cp\u003E \u0026gt; Go to sleep Sunday night\u003C/p\u003E\u003Cp\u003E \u0026gt; Have a dream where I\u0027m apartment hunting.\u003C/p\u003E\u003Cp\u003E \u0026gt; Move into apartment in old industrial complex\u003C/p\u003E\u003Cp\u003E \u0026gt; Old military-industrial complex\u003C/p\u003E\u003Cp\u003E \u0026gt; \u0022Up and coming neighborhood, newly renovated\u0022\u003C/p\u003E\u003Cp\u003E \u0026gt; Place still looks like a bunker from the outside.\u003C/p\u003E\u003Cp\u003E \u0026gt; Months pass...\u003C/p\u003E\u003Cp\u003E \u0026gt; When suddenly, ZOMBIES!!\u003C/p\u003E\u003Cp\u003E \u0026gt; Have to go outside for reasons \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003E \u0026gt; But it\u0027s OK cause I\u0027m fast \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E \u0026gt; I can outrun the Zombies, outsmart the Zombies, outmaneuver the Zombies!\u003C/p\u003E\u003Cp\u003E \u0026gt; Go back out and run a lap around the building for fun. LIEK A BAUS!!\u003C/p\u003E\u003Cp\u003E \u0026gt; Zombies can\u0027t touch me; I\u0027m just two good.\u003C/p\u003E\u003Cp\u003E \u0026gt; Run another lap.. Still invinceble..\u003C/p\u003E\u003Cp\u003E \u0026gt; Decide to show off yet again.\u003C/p\u003E\u003Cp\u003E \u0026gt; Run another lap.\u003C/p\u003E\u003Cp\u003E \u0026gt; Come back inside.\u003C/p\u003E\u003Cp\u003E \u0026gt; Family all turned to Zombies.\u003C/p\u003E\u003Cp\u003E \u0026gt; Run outside\u003C/p\u003E\u003Cp\u003E \u0026gt; Zombies waiting.\u003C/p\u003E\u003Cp\u003E \u0026gt; Eaten by Zombies. I have become dead.\u003C/p\u003E\u003Cp\u003E \u0026gt; Die thinking, I ran 3 laps\u003C/p\u003E\u003Cp\u003E \u0026gt; Halflife 3 confirmed.\u003C/p\u003E\u003Cp\u003ETrue story\u003C/p\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2013-12-10T05:04:17Z","Content":"\n\u003Cp\u003EI always remember a map of my dreams... on my dreams, i mean that ALMOST every \u0022big dream\u0022 i have is inside that map, 2-4 weeks ago a new part of that world appeared i remenber i was walking around the street then i suddenly stopped on a nice rustic house i appeared inside it and i walked to the backyard and there was an small pond full of teal-colored water (i think it was not suitable for drinking \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) after around 3 seconds there a cocodrile jumped directly to me and i started to punch it whit a spoon (Mom i told you i wanted a knife not a spoon!) and there ends the dream. last week i was there again but this time everything was shorter (because i wake up) i was on the backyard but i jumped inside and.... well i could continue but i dont remember what happend after that.\u003C/p\u003E\u003Cp\u003ENow i tell you some of the most important locations on \u0022The map\u0022 in order of first to last dream i could remember:\u003C/p\u003E\u003Cp\u003E1-A old pool (2 dreams first one was in the night i was inside a robot doing nothing, and in the other there was people there and me it was a party \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\u003Cp\u003E2-A creepy swamp (3 dreams all of them were much the same it was really polluted its still creepy to me because i always have been afraid of swamps for no reasons i was on a boat on all of the dreams and there were dead trees coming from the water)\u003C/p\u003E\u003Cp\u003E3-A big abandoned house complex (it was really dark on the only dream i had there, i was walking on the night Ã‚Â¡NO MOON! it was really dark then suddenly and for my luck my mom appeared, really im not kidding it really happend and there ended that dream)\u003C/p\u003E\u003Cp\u003E4-I was skating around a long street (It was an only dream too, really shortbut really interesting when i analyzed it because that dream started to make me think about \u0022the possible map\u0022, FYI me \u002B skateboard = DOOM)\u003C/p\u003E\u003Cp\u003E5-The higway and the small town (This dream started weird, i was driving and then i stopped on a weird town there was a guy giving away free pyrotechnic rockets and i took all i could then started them all at same time, i was happy at the end)\u003C/p\u003E\u003Cp\u003E6-A segment of a school [includes Roblox content] (This dream was scary i remember i waked up cutting part of it but well, I was walking upstair on the night to then i had 2 ways one was dark and the other was a walkway really long but a door was opened and there was light coming from it at the bottom of it there was an opened door and the light of the moon, i heard a terrible scream and i started to move [Roblox incoming] i entered the room whit lights on, it was the bathroom but it was made of resized Roblox parts i heard steps coming closer then i waked up at the night i was scared to continue sleeping. FYI i used to be an active Roblox player but after the last updates i left it again).\u003C/p\u003E\u003Cp\u003E7-The Farm-School thing (i still dont get this dream but this was before vacations ended, everything passed on a night there was a lot of persons and there was a part of the complex were i couldnot get inside but i did it there anyway, it was a barn \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003E8-A) Another school (This one is one month old, the first time there was a lot of students i didnt see someone known except of some friends i dont talk very much (a girl i like but i just seen her passing around while i was walking around the dream)\u003C/p\u003E\u003Cp\u003E8-\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E The canyon way and back to the place of the 8-A (This dream was really complex to say so i had to resume it: I was walking in middle of the road i had a friend [That was an character i drawn loooong time ago his name is Thokova] we started to run straight then a group of persons shoot us, Thokova grabbed a rifle then started to shoot againist them... RANDOM ALTERATION TO THE DREAM COMING FROM NOWHERE! I appeared on a group of students [from my actual class room but whitout the ones i hate... Too many dreams of school... Y U NO KSP!?!?] i left it and outside it was raining, and then, guess what? another alteration! this one was smaller but its something personal [it has something to do whit a girl i mentioned before im just going to say that i was doing i have not been able for weeks, because im a little shy, but dont think o dont talk her, oh heck no! i made cards for her]\u003C/p\u003E\u003Cp\u003E9-The new part of my dream at top, i called it \u0022Home?\u0022\u003C/p\u003E\u003Cp\u003EIf something new appear im gonna put it here but on a new post.\u003C/p\u003E\u003Cp\u003EHave nice dreams! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-12-10T16:48:42Z","Content":"\n\u003Cp\u003EI had a scary dream last night, I was sitting on a couch in the living room of my house, my brother was sitting in a chair nearby, and my mom was sitting on the other couch, we were watching tv, and this was supposed to be a school day. sudenly the bus rolls by and I\u0027m like \u0022is that the bus?\u0022 Sudenly getting worried, and my mom says \u0022yeah\u0022 like it was no big deal, even though I wasn\u0027t ready or anything, then everyone starts freaking out. I\u0027m sudenly getting half my stuff on at once even though the bus is long gone, and then I\u0027m sitting at the couch again, when my brothers knee cap explodes and tentacles start flying everywhere coming from his knee, and one grabs me around the neck and pulls me into the mouth of a kraken like squid which had just emerged. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen it did that there was a freaky scream type sound, and then everything was black for a moment before I opened my eyes to find my mom was waking me up to get ready for school.\u003C/p\u003E\u003Cp\u003EAs if i already wasn\u0027t worried about my brothers knee surgery tomorrow, and I had spent most of the day playing ksp after school. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI made sure to sit on the other couch this morning... Just in case...\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 alt=\u0022:sealed:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-12-10T16:54:03Z","Content":"\n\u003Cp\u003EAll the dreams i remember i get killed in. Whether it\u0027s Final destination style, or something like a fall down the stairs.\u003C/p\u003E\n"},{"CreatedByName":"Somejob","CreatedById":82773,"CreatedDateTime":"2013-12-10T22:38:35Z","Content":"\n\u003Cp\u003EI used to have this weird dream as a small child. It was set in black and white deserted 1940\u0027s New York. I was running from something, always a block behind me or just behind the last corner. It sounds like a nightmare, but I actually loved the dream. I must\u0027ve had it 20 times as a kid and maybe 3 times more recently.\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-12-11T00:22:12Z","Content":"\n\u003Cp\u003EI recently had a dream in which I was randomly gifted a copy of GTA V. Woke up disappointed.\u003C/p\u003E\u003Cp\u003EOn a more bizarre note, I had multiple dreams when I was very little in which I was on a planetoid (mario galaxy style) and was being chased by a very large robotic thing. I always was killed ultimately.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-11T00:27:16Z\u0022 title=\u002212/11/2013 12:27  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 11, 2013\u003C/time\u003E by DisarmingBaton5\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2013-12-11T01:54:34Z","Content":"\n\u003Cp\u003EI remember dreaming several dreams that involved meteors impacting the Earth. I got scared since I was terrified of it happening in real life, which it did a few weeks later (Chelyabinsk)\u003C/p\u003E\n"},{"CreatedByName":"Chrisd857","CreatedById":57291,"CreatedDateTime":"2013-12-11T02:06:24Z","Content":"\n\u003Cp\u003ENever had any totally-off-the-wall dreams, but here goes some weirder ones:\u003C/p\u003E\u003Cp\u003E-Riding in car, being chased by glowing aliens, go down a cul-de-sac, get car stuck in gutter/drain, aliens come closer, dream ends (had this dream at least twice, not consecutively)\u003C/p\u003E\u003Cp\u003E-I\u0027m on some platform in the cloudy sky in a van, then it drives forward off the platform and the clouds rush past. This resets, and I loop like this several times in a row.\u003C/p\u003E\u003Cp\u003E-Similar to previous one, only we\u0027re driving off a hill and \u0027rolling\u0027 the van (though in a pitching direction [and no yaw])\u003C/p\u003E\u003Cp\u003E-Annoying recent one: got a robot stolen, but found a stash with some of our also-stolen stuff, and other robots\u003C/p\u003E\u003Cp\u003E-Any dream with two copies of a person freaks me out\u003C/p\u003E\u003Cp\u003E-And then the getting bitten by a snake and having an allergic reaction in a vehicle, being chased by bees, becoming weak when pushing hard, becoming slow when trying to run fast, and being silent when trying to yell\u003C/p\u003E\n"},{"CreatedByName":"panfish5","CreatedById":74937,"CreatedDateTime":"2013-12-11T02:08:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fatfluffycat\u0022 data-cite=\u0022fatfluffycat\u0022\u003E\u003Cdiv\u003EI hate dreams where your running from somebody or something, you feel like a drunk, keep falling over and stuff, then you try to close a door, your to weak to close it, they come rushing in, then you wake up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeing chased usually means that you are avoiding something in your life or refusing to deal with problems.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/-GH-inRcedU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Lordherrmann","CreatedById":9345,"CreatedDateTime":"2013-12-11T13:12:10Z","Content":"\n\u003Cp\u003EUnfortunately I forget my dreams. I tried to write a dream diary, but I often didn\u0027t have the time to write into it after waking up. I will probably try again during christmas break.\u003C/p\u003E\u003Cp\u003EHowever if I remember my dreams they are often space related. The other day I somehow had acquired an Apollo spacesuit. It was one of the best dreams I ever had.\u003C/p\u003E\u003Cp\u003EIn another dream I was given the opportunity to fly with the vomit comet. Sometimes I dream really weird stuff. One of the strangest dreams was about a jellyfish invasion. They had learned to float in thin air and were just coming in thousands.\u003C/p\u003E\u003Cp\u003EThat\u0027s the stuff I dream about. If I happen to be successful with my dream diary you\u0027ll hear from me.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-12-11T14:24:37Z","Content":"\n\u003Cp\u003ESome dreams of mine.\u003C/p\u003E\u003Cp\u003E-I once had a dream that the crust strted cracking and falling apart, and then I boarded this big NASA rocket that would take us to space with a bunch of people. The rocket launches to go to this earthlike planet called Alpha C with me and around several thousand people. I then decide to go to the pilot deck of the rocket, and board a elevator. Inside the elevator with some friends, the rocket suddenly blows up and ejects the elevator into space. The elevator was roomy, and had enough emergency supplies for a year. Then out of nowhere, the elevator hits Alpha C, and apparently, I landed outside my house. Dream end.\u003C/p\u003E\u003Cp\u003E- I recall this dream about the invasion of mutant zombie bugs and tripods with heatrays. The zombie bugs wouldst lurk in the dark, and kill and mutated any unsuspecting nearby human. And then me and a bunch of soldiers where attacking them, and shooting them and hacking them with knives. The bugs could be killed with a hard punch to the chest, and we killled a whole bunch of them. Then two martian tripods from the War of the World come and get.wrecked by a tank. And then, mt crush takes a interest in me and dates me. Dream end.\u003C/p\u003E\u003Cp\u003E- I\u0027m the Mission Commander for a mission to Mars. I open the airlock once we land, walk out, say something awesome, then trip on the wrecked remains of the Mars Polar Lander, fall flat on my face, and crack my helmet. I then die from depressurization. Dream end.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-12-11T14:37:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panfish5\u0022 data-cite=\u0022panfish5\u0022\u003E\u003Cdiv\u003EBeing chased usually means that you are avoiding something in your life or refusing to deal with problems.\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/-GH-inRcedU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure if dreams actually correlate to anything but that would seem pretty accurate. I\u0027ve had dreams of being chased most nights for 21 years!\u003C/p\u003E\u003Cp\u003EAlso when I was little I had a dream where my dads walking boots ate me!\u003C/p\u003E\n"},{"CreatedByName":"SunJumper","CreatedById":27062,"CreatedDateTime":"2013-12-11T14:48:23Z","Content":"\n\u003Cp\u003EIt is not uncommon for me to dream about swimming in air. Not flying, \u003Cem\u003Eswimming\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EUncommom relative to the population, that is.\u003C/p\u003E\u003Cp\u003EIf I remember tonight\u0027s dream, I\u0027ll let you know.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-12-11T18:09:00Z","Content":"\n\u003Cp\u003EWell here\u0027s a weird one. In a pool, training. The pool is 1 3rd empty and it dosen\u0027t look like anything I\u0027ve seen. A mob comes in with guns and starts shooting, and I beg for my life, one looks at me and shoots. 0_o\u003C/p\u003E\u003Cp\u003EYou know, shooting is like getting punched in the chest hard.... never experienced it though. It\u0027s weird that my brain simulates gun fire 0_o....\u003C/p\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2013-12-11T21:02:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Destroyer\u0022 data-cite=\u0022The Destroyer\u0022\u003E\u003Cdiv\u003EWell here\u0027s a weird one. In a pool, training. The pool is 1 3rd empty and it dosen\u0027t look like anything I\u0027ve seen. A mob comes in with guns and starts shooting, and I beg for my life, one looks at me and shoots. 0_o\u003Cp\u003EYou know, shooting is like getting punched in the chest hard.... never experienced it though. It\u0027s weird that my brain simulates gun fire 0_o....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know that feeling too, I remeber having a dream were a happy granny noticed me then took a pistol from his bag and started shooting me... the weird part was that it was a hostage situation and i was trying to escape but every time i failed she shoot me and everything started again from the part i have to escape then at third try i got from nowhere a MP7 from Half Life 2 (AKA the SMG whit grenade launcher) and killed her whit the grenade and there ends.\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-12-11T23:34:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zaryulenko\u0022 data-cite=\u0022Zaryulenko\u0022\u003E\u003Cdiv\u003EI know that feeling too, I remeber having a dream were a happy granny noticed me then took a pistol from his bag and started shooting me... the weird part was that it was a hostage situation and i was trying to escape but every time i failed she shoot me and everything started again from the part i have to escape then at third try i got from nowhere a MP7 from Half Life 2 (AKA the SMG whit grenade launcher) and killed her whit the grenade and there ends.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei once had a dream like that except i was at school being attacked by random guys carrying modified RPGs while had only a pistol although whether or not i made it out alive is unknown for i just remember, at the end, ducking behind a table as missiles flew by and a wall falling on me.....\u003C/p\u003E\u003Cp\u003Ethen gain i probably died in that dream although that isn\u0027t the first time i have died in a dream....\u003C/p\u003E\n"},{"CreatedByName":"TheBadAstronomer","CreatedById":89508,"CreatedDateTime":"2013-12-13T00:54:54Z","Content":"\n\u003Cp\u003EMy most recent recurring dream is about falling from a rocket.\u003C/p\u003E\u003Cp\u003EIn this dream, I am strapped to a rocket on the top. Suddenly, the rocket roars to life( with me still on it), and I am thrown violently into the air. After about 3 seconds, the sensation of weightlessness hits me( which is rather cool), and I wake up right before I hit the ground. Although I wake up really surprised, this is my favorite dream yet!\u003C/p\u003E\u003Cp\u003EAlso: I had a dream where I was shot in the head while looking at a mirror. Before I woke up, I could see straight through my head!\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-12-13T02:14:44Z","Content":"\n\u003Cp\u003ELast dream I was in a giant labyrinthian library searching for a book that would tell me what temperature lignin denatures at. Every time I tried to put down my stuff someone would attempt to steal it.\u003C/p\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2013-12-15T17:18:10Z","Content":"\n\u003Cp\u003EWell this is new, Today i had a funny dream, i was on a field whit a lake around it then 2 guys on bycicle a fat one and a slim one were going againist me then the fat guy pass aside from me but fall from the small field and ended on the water (it was like 2meters deep) it was fun then the other one was going to pass over me, i run and throw him a rock to the front wheel and hit him making him fall i took him and throw him to the water too last when i was going away i found two guys getting out from the lake but one of them had a handwatch that started to ring and the other one (Out of the water) was yelling him to make him get off but the guy on the water didnt care and started to eat a sandwich Ã‚Â¡UNDERWATER! I awoke laughtin of that but i couldnt continue dreaming due to the Lavander Town theme (That i heard before getting to bed).\u003C/p\u003E\n"}]}