{"TopicId":55870,"ForumId":18,"TopicTitle":"The Magic of Video Games","CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2013-12-12T03:58:40Z","PageNum":1,"Articles":[{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2013-12-12T03:58:40Z","Content":"\n\u003Cp\u003EThis is a topic I started on the Vsauce forums. I felt the need to share it with you guys, because it\u0027s something dear to me.\u003C/p\u003E\u003Cp\u003EI\u0027ve heard much talk, some from non-gamers, some from adults or seniors who can\u0027t fathom why us younger generation is so into video gaming, so I want to say here, surrounded by fellow Kerbonauts, my beliefs.\u003C/p\u003E\u003Cp\u003EVideo games are a magical invention. We have become like like artists, like gods, in creating worlds for our amusement. Playing video games is like reading a book. You immerse yourself in this fictional place that is as every bit as real as you devote yourself to believing its real. For those who say that video games are pointless and don\u0027t accomplish anything... well, I have some news for them. Never in the real world could I have toppled a pacific island dictatorship (Just Cause 2), rescued my friends from insane pirates (Far Cry 3), brought the gift of clean water to an atomic wasteland (Fallout 3), mine for diamonds deep underground (Minecraft), built rockets and fly them to other worlds (Kerbal Space Program), and so much more. Video games unleash a completely new side of people. Instead of being the school know-it-all, I\u0027m a wild west outlaw (Red Dead Redemption), street gang kingpin (Saints Row series), brain surgeon! (Surgeon Simulator 2013) and a PhD certified freedom fighter (Half-Life series)!\u003C/p\u003E\u003Cp\u003EThe only one who can know all of this, however, is just myself, who these non-believers can never understand. Video games are an escape, a blank canvas, a shooting range, stress ball, pretty much the ultimate tool of creation and destruction. We become gods while sitting in our little swivel chairs, sipping on Mountain Dew.\u003C/p\u003E\u003Cp\u003EWhew. Any thoughts on this? Who\u0027s with me?\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-12-12T04:02:41Z","Content":"\n\u003Cp\u003EI agree, but some people won\u0027t allow JC2 for shooting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-12-12T05:14:54Z","Content":"\n\u003Cp\u003EI hiked the amusement park admission price up to $60! Oh, the power of a monopoly...\u003C/p\u003E\u003Cp\u003E(In Rollercoaster Tycoon, most guests spawn with $60 in the wallet)\u003C/p\u003E\u003Cp\u003EAnd, you know, took over Earth. Many, many times. (Civ4)\u003C/p\u003E\n"}]}