{"TopicId":59328,"ForumId":18,"TopicTitle":"Who rules United Federation of Planets from Star Trek?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-01-08T19:43:44Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-01-08T19:43:44Z","Content":"\n\u003Cp\u003EI watched all Star Trek series except TOS, i noticed that Federation is dominated by Mankind and capital of the Federation not on Vulcan or Andoria, so mankind rules \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"relin","CreatedById":89684,"CreatedDateTime":"2014-01-08T19:47:34Z","Content":"\n\u003Cp\u003EThe Federation is most certainly not dominated by humans. Through most of the series, a non-human was President.\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2014-01-08T23:04:45Z","Content":"\n\u003Cp\u003EHumanity lead the way in establishing the Federation, with quite a significant role being played by the Enterprise NX-01, as you may well know already. The Federation was founded on Earth, too, so it makes sense for Earth to be the capital. However, there have definitely been non-human presidents of the Federation; in fact, there was an episode of DS9 I half-watched that had a non-human president (I can\u0027t remember the species, but it was the episode were Sisko was pushing for stricter security because it was thought that Changelings were infiltrating the Federation).\u003C/p\u003E\u003Cp\u003EI think the reason you see so many Humans is because we\u0027re looking at galactic affairs through the perspective of Starfleet, a predominantly Human spaceflight organisation, with Human-designed starships and technology. Sure, you have Vulcans, Andorians, and members of many other species serving on Starfleet vessels, but those species have their own spaceflight organisations.\u003C/p\u003E\u003Cp\u003ETo cut it short, every member species of the Federation has equal rights and voice.\u003C/p\u003E\n"},{"CreatedByName":"Captain Archer","CreatedById":100420,"CreatedDateTime":"2014-01-08T23:07:38Z","Content":"\n\u003Cp\u003EI don\u0027t actually remember ever seeing a Human president of the Federation. Hmm\u003C/p\u003E\n"},{"CreatedByName":"crazyewok","CreatedById":97592,"CreatedDateTime":"2014-01-09T16:25:13Z","Content":"\n\u003Cp\u003EIts ruled by a presdient and council made up of all member states.\u003C/p\u003E\u003Cp\u003EPretty basic.\u003C/p\u003E\u003Cp\u003EThe intresing queation is what economic system it has.....\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-01-09T16:55:04Z","Content":"\n\u003Cp\u003EI remember there was a council with members of all species.\u003C/p\u003E\u003Cp\u003EI think the whole system is some advanced version of socialism, possibly actual functional type communism not tainted with cult of personality, shallow propaganda, inability to have private property, etc. Maybe with some anarchism to it.\u003C/p\u003E\u003Cp\u003EThey have no money because they have no need for it. The only thing they need is energy, something which they have in abundance so it is not a scarcity.\u003C/p\u003E\u003Cp\u003EFood is taken care of by replicators, medical help is amazing. People\u0027s preoccupation is developing themselves. Individualism and altruism govern their society.\u003C/p\u003E\u003Cp\u003EAll that is possible just because they don\u0027t have to care about their basic needs anymore. That removes the need to defend, to fight. Their society is extremely evolved compared even with the most advanced systems we know today (Norway and alike).\u003C/p\u003E\n"}]}