{"TopicId":70658,"ForumId":18,"TopicTitle":"Conventions","CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2014-04-26T22:55:02Z","PageNum":1,"Articles":[{"CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2014-04-26T22:55:02Z","Content":"\n\u003Cp\u003ESo... Conventions?\u003C/p\u003E\u003Cp\u003EI\u0027ve heard of Comic-Con, A-Kon, and a couple other of cons, and I\u0027m pretty sure a lot of other people have too.\u003C/p\u003E\u003Cp\u003EI went to my first convention today and yesterday, and it completely blew me away.\u003C/p\u003E\u003Cp\u003EThe conventions name was \u003Ca href=\u0022http://www.zenkaikon.com/\u0022 rel=\u0022external nofollow\u0022\u003EZenkaikon\u003C/a\u003E, which happens annually in Lancaster Pennsylvania. \u003Cspan style=\u0022font-size:8px;\u0022\u003E(Had to travel halfway across the nation to get here)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI knew about nothing going into this... so I was bit overwhelmed going in to this and seeing, over 9,000 people within two days. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(No that\u0027s not intended to be a joke, I actual number I know of was around 11,000)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESince I had only seen stuff like this on the internet, it was so fun to see in person.\u003C/p\u003E\u003Cp\u003EIt was really interesting to see people in costume too, even if I didn\u0027t know two thirds of any of the characters people dress up as.\u003C/p\u003E\u003Cp\u003EHave any other people in this community gone to anime or gaming conventions? And if you have how was it like?\u003C/p\u003E\u003Cp\u003EAlso, if you do decide to wear a costume to a convention, make sure you don\u0027t make a costume that will make you sweat out half of all the water in your body.\u003C/p\u003E\n"},{"CreatedByName":"Pluto100","CreatedById":26442,"CreatedDateTime":"2014-04-26T23:46:09Z","Content":"\n\u003Cp\u003EConventions are fun! I went to Zenkaikon, and I was happy to see you there. I hope to go to something else like MAGFest or something in the future. Conventions are super fun. I\u0027ve gone to Comicon, and that was a doozy. I honestly can\u0027t wait to go to another convention. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E (Especially if they have more Pokemon hats...) \u003C/span\u003E\u003C/p\u003E\n"}]}