{"TopicId":70967,"ForumId":18,"TopicTitle":"What video game do you like? mine is KSP and Total War Series","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-04-29T20:11:19Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-04-29T20:11:19Z","Content":"\n\u003Cp\u003EI very love gaming but now i have very little time for my passion because i must work on my MA Thesis on library science:(\u003C/p\u003E\u003Cp\u003EI hope i got more time on vacation.\u003C/p\u003E\u003Cp\u003EWhat is you favorite game?\u003C/p\u003E\u003Cp\u003EMine is KSP of course, than Total War series and The Sims.\u003C/p\u003E\u003Cp\u003EAs for Total War series i wonder when they make Total War: World War II or at lest World War I\u003C/p\u003E\u003Cp\u003EI have Medieval II Total War, Empire Total War, Napoleon Total War, Total War: Shogun 2 with \u0022Fall of Samurai expansion pack\u0022 and Total War: Rome 2.\u003C/p\u003E\u003Cp\u003EI wonder when The Creative Assembly, made Total War game about modern combat, for now the Total War: Shogun 2 expansion pack \u0022Fall of Samurai\u0022 was the most modern in term of combat model, because it was about war between Shogunate and Emperor Meiji fraction in XIX century, and player had Gatling gun on disposal, i love the Gatling \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt really cool when shogun and his brave samurai charge one you to preserve samurai way of life and meet brand new Imperial Army Gatling Gun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-30T03:11:45Z","Content":"\n\u003Cp\u003EDangnabbit, this is about the third thread about the same thing I\u0027ve seen in a week! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell, I play (besides KSP, because, DUH) a li\u0027l bit of Minecraft, AoM, AoE, Fallout 3 (not really into NV), Skyrim, and a big one is Rust.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-30T03:21:07Z","Content":"\n\u003Cp\u003ERecently it\u0027s mostly KSP on the laptop and Pixel Dungeon on the phone. I tried out the new Thief game because it\u0027s my favorite franchise, but I was pretty disappointed (~black eyeliner~). Oh, and Goat Simulator goes great with the Friday night growler after the kiddo\u0027s gone to sleep.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-04-30T03:25:04Z","Content":"\n\u003Cp\u003EAs mentioned above; here\u0027s one thread you might like:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/74198-Which-games-do-you-play\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/74198-Which-games-do-you-play\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"iDan122","CreatedById":24439,"CreatedDateTime":"2014-04-30T20:21:24Z","Content":"\n\u003Cp\u003EStuff I play:\u003C/p\u003E\u003Cp\u003EKSP,\u003C/p\u003E\u003Cp\u003ERust, Tomb raider, Far cry 3, Battlefield 4(premium), Space Engineers, MBA, The Whitcher 2, CS, Skyrim, Garry\u0027s mod, Portal 2, Just Cause 2 and so on...\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2014-04-30T20:32:52Z","Content":"\n\u003Cp\u003EMe too, love the Total War games (I think Rome 2 fell a bit short of the mark)\u003C/p\u003E\u003Cp\u003Eoccasionally Modded Civ 4 but really just waiting for a few releases at the moment.\u003C/p\u003E\u003Cp\u003EEspecially the Forest, open alpha begins in a few weeks and it already looks stunning and I love survival horror\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/o9mr4k9X6c8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2014-04-30T20:35:20Z","Content":"\n\u003Cp\u003Efor me its...\u003C/p\u003E\u003Cp\u003EPortal 1 and 2, skyrim, Fallout 3 (also not really into NV and i rage a lot in this anyway), all three bioshock games, some of minecraft (mostly stuff in creative), occasionally mari0, Half-Life 2 (including EP1 and 2), and Command and Conquer (mostly Zero Hour and Tiberium Wars)\u003C/p\u003E\u003Cp\u003Ealthough my favorite is KSP over all of these\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-04-30T22:18:00Z","Content":"\n\u003Cp\u003EI like a lot of games ... the Civ-Series, Total War, Games like Elite/Frontier, Skyrim and the videogames for the DSA RPG system, realistic military simulators (like the DCS series, ArmA II, Red Orchestra 2/Rising Storm) but also Dwarf Fortress and Aurora to name just a few\u003C/p\u003E\n"},{"CreatedByName":"air805ronin","CreatedById":40948,"CreatedDateTime":"2014-05-01T21:59:38Z","Content":"\n\u003Cp\u003EKSP, Dwarf fortress, Minecraft, and Prison Architect are my current GoTo games.\u003C/p\u003E\u003Cp\u003EI also love car racing, so I played Gran Turismo 1 through 4 religiously. 4 burned me a lot though so I swapped out to Forza. I have been firing up Forza 5 A LOT lately.\u003C/p\u003E\u003Cp\u003EI have played through Fallout 3, New vegas, Oblivion, and Skyrim roughly twice a year each.\u003C/p\u003E\u003Cp\u003EI also regularly replay Red Dead Redemption.\u003C/p\u003E\u003Cp\u003EIf I could, I would play Dragon Age Origins over and over but my wife plays it through 5-6 times a year so I just sit back and enjoy the bloodshed.\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-05-01T22:03:55Z","Content":"\n\u003Cp\u003EKSP, the Halo franchise, and anything else is just dust in the wind that comes and goes for me.\u003C/p\u003E\n"},{"CreatedByName":"mordin86","CreatedById":29223,"CreatedDateTime":"2014-05-02T19:28:46Z","Content":"\n\u003Cp\u003ERecently i\u0027m totally consumed by Dark Souls but I think I need to take a break coz this game has seriously bad influence on the players psyche.\u003C/p\u003E\n"}]}