{"TopicId":71197,"ForumId":18,"TopicTitle":"Is this a bad place to post a tabletop RPG setting idea?","CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-05-02T04:41:28Z","PageNum":1,"Articles":[{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-05-02T04:41:28Z","Content":"\n\u003Cp\u003EI have a sci-fi setting bouncing around in my noggin, and don\u0027t feel like starting a /tg account. Should I do so anyway?\u003C/p\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2014-05-02T05:04:22Z","Content":"\n\u003Cp\u003Etell me \u003Cstrong\u003Eeverything\u003C/strong\u003E please\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-05-02T10:06:03Z","Content":"\n\u003Cp\u003EI don\u0027t have a whole lot, but if you insist...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003ESo there used to be this great (human) interstellar empire occupying the outer half of the Orion Arm, around 3256 CE or 5 Before War(BW). It wasn\u0027t a complicated empire, for it\u0027s size, having only two main rules: send a (somewhat large) tithe of various metals, fuel, volatiles and such to the Central Systems(Sol, Proxima Centuari, and Tau Centi) and receive scientific research data from the Solar Universities as well as aid should your sector fall on hard times, and Don\u0027t Make the United Nations Space Control Force(UNSCF) Come Over There. Other than that, it had been pretty hands-off, lasssez-faire business.\u003C/p\u003E\u003Cp\u003EWhich had been an alright arrangement, until the Central Systems(here thereafter labeled the CS) started jacking up the tithe requirements for some sort of high-cost project (we\u0027re not sure what, but the likely candidate, judging from the figures of recovered public documents, suggests Dyson Sphere projects.\u003Csup\u003E1\u003C/sup\u003E) In what had been the Central System\u0027s first, and last, major blunder, they impoverished or threatened to impoverish large swathes of the Empire\u0027s frontier territories, whilst depleting what would normally be reserved aid material. A lot of people weren\u0027t happy about that. A lot of those people formed the Representation Committee( here thereafter the RC), first a movement for at least nominal representation of the frontier sectors in the CS governing bodies, then a general mutiny five Terran years later as the CS increased the tithe further in apparent ignorance of the general frontier\u0027s plight\u003Csup\u003E2\u003C/sup\u003E. Naturally, task forces of the UNSCF Came Over There, expecting a relatively short drubbing of the RC\u0027s leading members. What they got was the War.\u003C/p\u003E\u003Cp\u003ESomehow the RC had secretly acquired not only wider support among the middle sectors but also outside assistance of a mysterious source\u003Csup\u003E3\u003C/sup\u003E. What should have been devastating strikes on the RC\u0027s flagship members were first blunted by unexpectedly effective defensive fleets, and then forced to retreat as their supply lines were cut off by guerrilla forces raised from rebellious middle sectors. As the constellations of warcraft retreated, RC sent an envoy, hoping to use the recent defeats as leverage to gain representation. The CS, however, refused to negotiate and went to a war footing, to the surprise of almost all involved\u003Csup\u003E4\u003C/sup\u003E. \u003C/p\u003E\u003Cp\u003EThe War raged for ten straight years, and did not so much end as run out of targets. Only a very few inhabited planets, fewer than 20 that we know of, fully escaped the raving constellations of warships and autowars, or the resource crashes and terraforming failures as trade routes were cut off by area denial weapons, active fighting or sometimes simple debris. We were plunged into a dark age as the Empire tore itself apart.\u003C/p\u003E\u003Cp\u003EOur Easter Egg star nation is the descendant of one of the luckier ones. As a system lying on the leading edge of the Orion Arm, it was strategically unimportant and missed much of the fighting. As a super-Earth orbiting a super-Jovian gas giant it was resource-rich enough not only to support itself but also a small shell of five star systems around it. Even so, it would be another 50 years before the descendants of the traumatized War generation would make their first tentative steps outside the Egg\u0027s sphere of influence, meeting first the Black Foresters in 55 AW and then the Beamsailers in 62 AW.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBeginning excerpt from the \u003C/em\u003E\u003Cstrong\u003E\u003Cem\u003EYears of the Dead; A Summary and Analysis of the War, Edition 152 AW \u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Csup\u003E1\u003C/sup\u003E Whilst not a bad conclusion with the data available, this is completely false. Resources were being stockpiled after the suppressed discovery of another, alien civilization; one in death throes, induced by a memetic Weapon of unknown origin and motivation.\u003C/p\u003E\u003Cp\u003E\u003Csup\u003E2\u003C/sup\u003E On the contrary, the governing bodies were perfectly aware, and viewed it as regrettably necessary for the survival of human civilization.\u003C/p\u003E\u003Cp\u003E\u003Csup\u003E3\u003C/sup\u003E While the support of certain middle sectors was legitimately acquired, technological and strategical assistance was rendered by the Weapon, in an apparent-and successful-attempt to destabilize the Empire.\u003C/p\u003E\u003Cp\u003E\u003Csup\u003E4\u003C/sup\u003E The switch to a war footing started just after the CS realized that the RC had been subverted by the Weapon. Otherwise, the CS would have been more open to terms.\u003C/p\u003E\u003Cp\u003EIt should also be noted that the Weapon, as a purely memetic weapon, behaves like a subtle computer virus, and can transmit itself via any form of communication, although it prefers visual and digital communication. Biological beings with a central brain can be infected and manipulated, however, often without the knowledge of the victim. As the Weapon is essentially weaponized data, it can survive as long as the computing devices it has access to lasts, meaning that samples of the Weapon have most likely survived the War.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EWith the development of effective nanoassemblers by MiniMax in 67 AW, the space construction industry underwent much the same revolution as 3d fabrication technology inflicted onto the consumer market in 2053 CE/1207 BW. A 10-ton container of assemblers could turn a sizable nickel-iron asteroid plus some additives into a fully functional, if unfueled and unprogrammed, starship or some other space construction, relatively cheaply and quickly. Amongst the young star nations, this was a godsend; the remnants of the War made even trade with star nations in relatively close proximity a dangerous and costly proposition, and the vast reduction in cost meant that not only could the merchant marine losses be replaced, but the space control forces of said star nations could be expanded to speed up cleanup operations.\u003C/p\u003E\u003Cp\u003EThe vastly reduced cost of starships, however, and the resulting dissemination of said starships to the general public(previously having been restricted to the rich) also spawned a new breed of explorer-***-mercenaries. Calling themselves Adventures, these outcasts of society usually form a five to ten men size crew, buy or create a reasonably tough and sturdy vessel, and sail off into Wartorn space, looking to make their fortunes off of artifacts or undiscovered colonies hidden within these vast reaches of highly dangerous territories. Predictably, only a very lucky or seasoned few make it back. Also predictably, and annoying so in my humble opinion, most of those that do make it usually do achieve both riches and celebrity status, as not only do they bring back highly valuable(and dangerous) pieces of pre-War technology, but also stories of adventure and excitement, making them easily romanticized. To be fair, it does make for a romantic image; motley crews of misfits, delving amongst the stars seeking their fortune. However, this imagery surrounding Adventures tempts many otherwise good and wise Students into throwing the teachings of the Star Above to the stellar winds and risk their lives and souls needlessly.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBrief excerpt from the sermon by Chaplain Aghanashini Aalim of the BeamSailer \u003C/em\u003E\u003Cstrong\u003E\u003Cem\u003EArk Mecca\u003C/em\u003E\u003C/strong\u003E\u003Cem\u003E in 143 AW, regarding a recent incident involving a Student running away to join a Egger Adventurer crew during that crew\u0027s refuelling stop at the Ark.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EAnd that\u0027s what I\u0027ve thought up for the setting thus far. Suggestions, feedback and additions are all welcome!\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-05-02T10:09:30Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Traveller_%28role-playing_game%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Traveller_%28role-playing_game%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI take it you are already familiar with this?\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-05-02T18:57:53Z","Content":"\n\u003Cp\u003ESomewhat; I\u0027ve heard about it, but never played it.\u003C/p\u003E\u003Cp\u003EIs this setting sounding somewhat generic or something?\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2014-05-02T19:24:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Traveller_%28role-playing_game%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Traveller_%28role-playing_game%29\u003C/a\u003E\u003Cp\u003EI take it you are already familiar with this?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly what I thought while I was reading it. It sounds a lot like the setting for Traveller: The New Era. Which isn\u0027t a bad thing. You shouldn\u0027t worry about coming up with an original setting, they\u0027ve all been done before. Instead focus on bringing your own stories, characters, and perspective to the setting, that\u0027s what really makes it your own. \u003C/p\u003E\u003Cp\u003EJust out of curiosity, what rule system are you using?\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-05-02T19:31:59Z","Content":"\n\u003Cp\u003EHuh. Never heard of the Traveller: The New Era setting.\u003C/p\u003E\u003Cp\u003EI\u0027ve not decided on a system yet; I wanted to get some more detailed fluff in first.\u003C/p\u003E\u003Cp\u003EEdit: Just looked up TNE on wikipedia. You\u0027re right, my setting does sound like a rehash of the concept.\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2014-05-02T19:52:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meve12\u0022 data-cite=\u0022meve12\u0022\u003E\u003Cdiv\u003EHuh. Never heard of the Traveller: The New Era setting.\u003Cp\u003EI\u0027ve not decided on a system yet; I wanted to get some more detailed fluff in first.\u003C/p\u003E\u003Cp\u003EEdit: Just looked up TNE on wikipedia. You\u0027re right, my setting does sound like a rehash of the concept.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does, but seriously, don\u0027t let that deter you. All of the RPG campaigns I\u0027ve run have been rehashes of one thing or another. One I based completely on a Tim Powers novel, characters and all. And every group I\u0027ve run them for has told me that I was a great GM, and we all had a good time. I have two SF campaigns in my head that I hope to run someday. One is a rehash of Battlestar Galactica set against an interstellar backdrop with my own little tweaks added. The other one I stole the central concept whole cloth from an article in the Journal of the Traveller\u0027s Aid Society, I just yanked it out of the Traveller setting and dropped it into my own hard-SF background. Forge ahead, take the basic idea and make it your own. \u003C/p\u003E\u003Cp\u003EI was an avid D\u0026amp;D and Traveller fan until I discovered GURPS. Every other system pales in comparison, IMHO. Although I\u0027m not crazy about GURPS 4e, I think they \u0022fixed\u0022 a lot of things that weren\u0027t broken. My brother and I were actually collaborating on an extensive set of house rules to update GURPS 3e before I got married, had kids, moved to another state, etc. Haven\u0027t had much time to RPG since then. Maybe when my kids get older they\u0027ll be into gaming and let their dad run a couple campaigns for them.\u003C/p\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2014-05-02T19:58:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheSaint\u0022 data-cite=\u0022TheSaint\u0022\u003E\u003Cdiv\u003EExactly what I thought while I was reading it. It sounds a lot like the setting for Traveller: The New Era. Which isn\u0027t a bad thing. You shouldn\u0027t worry about coming up with an original setting, \u003Cstrong\u003Ethey\u0027ve all been done before.\u003C/strong\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei can\u0027t agree with this. everything has precedents in general concept, but that doesn\u0027t mean there\u0027s nothing unique left to be made. if that wasn\u0027t the case, there would never be new genres.\u003C/p\u003E\u003Cp\u003Eshouldn\u0027t worry indeed, but please stop with this \u0022it\u0027s all been done before, everyone\u0027s already seen everything you\u0027ll ever make, etc\u0022.\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-05-02T21:29:59Z","Content":"\n\u003Cp\u003ESome more fluff I came up with:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EThe expedition warped in 25 AU outside the 2nd star on our list, Hearth and only six hours later we saw five immense-and immensely dirty, almost fission bomb like- drive wakes coming to intercept us from the Mars-Type planet in-system. This was something that took us back for many reasons, not the least of which was the fact that according to the timing, they detected us and launched the instant the information could have reached them, despite the relatively small size and stealthiness of our ships. Another was that they were accelerating at around 15 Earth Gravities to our maximum of 3, and showed no signs of stopping even for fuel concerns.\u003C/p\u003E\u003Cp\u003EFaced with this surprise, and the fact that they would intercept us in three days assuming a brachistochrone trajectory, Commander Ryan StillLife decided to split our forces. While four of our five survey ships took a more circumstantial route to survey the system proper without intercepting the new contacts, and my courier ship the \u003Cem\u003ENow You See Me\u003C/em\u003E stood off at the warp limit to act as an observer, StillLife\u0027s survey flagship and all our escorts burned to intercept the contacts and attempt communication.\u003C/p\u003E\u003Cp\u003ETwo days passed without incident, although tension rose as the contacts repeatedly ignored or refused StillLife\u0027s attempts to communicate. The contacts were also late for their turnover burn, meaning they would pass Stone\u0027s constellation at half an AU should StillLife hold her course, which she did.\u003C/p\u003E\u003Cp\u003EOn the third and terrible day, at 0840 Hours(Forester), the two constellations reached an AU of separation, and despite all the aroused suspicions, everyone was caught off guard when the escort closest to the contacts reported X-ray Laser fire just before she exploded as her fusion plant was evidently breached. In the engagement that followed, the contacts split their fire among five targets at a time and invariably destroyed those targets within seconds of acquisition, while StillLife\u0027s constellation, between the shock and rate of ships destroyed, only managed to moderately damage one contact before the last ship was destroyed two minutes later.\u003C/p\u003E\u003Cp\u003EThe survey constellation, seeing this and being locked on a course in-system, evidently decided to run to the warp limit on the other side, as they powered up to full throttle and began to angle in for a close flyby of the primary. The contacts swung almost casually around the system in apparent pursuit, whilst launching very fast missiles upon the survey ships. Why they had reserved the missiles I do not know, but they accelerated at 30 Gees and were around halfway to the ships by the time they swung within an AU of the \u003Cem\u003ENow You See Me\u003C/em\u003E and I was forced to warp my command away or be destroyed.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EPersonal Notes and Analysis:\u003C/p\u003E\u003Cp\u003EAs the contacts suffered no apparent ill effects from continuous 15 Gee acceleration, we can assume these craft are automated. This is supported by observation of the contact\u0027s behavior; while it behaved somewhat erratically(apparently forgetting it had missiles until after the initial engagement), it\u0027s strategy was simplistic yet effective: Close to an AU and focus fire on the closest target first.\u003C/p\u003E\u003Cp\u003EWhile my expertise in drive analysis is only average, it does seem clear in retrospect that the contacts were using a pulse detonation drive, with what seems to be shaped antimatter-catalyzed thermonuclear charges. This matches what little we know about Representation Committee ship design, as they had preferred pulse detonation drives for warships. The contacts are also the right size and shape for observed RC defensive spaceships, being spherical with cavities for equipment and standing at a kilometer in diameter.\u003C/p\u003E\u003Cp\u003EHaving read Analyst George Rommel\u0027s analysis regarding the high concentration of spaceborne debris and the lack of intact mega-structures observed in our neighboring star systems, I must conclude that we live in what had been a hotly contested sector during the war, and it is likely that not only are there more of these craft around but also bigger and more dangerous weaponry. We must as a nation exercise extreme caution as we expand back into our sector.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EExcerpts from Captain Ronald Smith\u0027s After Action Report concerning the Hearth Incident of 46 AW and the sole survivor, the Black Forest Congressional Force Vessel(BFCFV) Now You See Me. \u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-02T21:57:15Z\u0022 title=\u002205/02/2014 09:57  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 2, 2014\u003C/time\u003E by meve12\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-05-02T22:12:51Z","Content":"\n\u003Cp\u003ETook another look at Traveler online. The system does dovetail with what I\u0027m trying to go for.\u003C/p\u003E\u003Cp\u003ENow if only I was any good at crunch.\u003C/p\u003E\n"}]}