{"TopicId":84360,"ForumId":18,"TopicTitle":"Ford Mykey spped limit dumbest idea ever made","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-11T15:41:56Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-11T15:41:56Z","Content":"\n\u003Cp\u003EI love plane but i\u0027m interested in cars to, even haven\u0027t driver license.\u003C/p\u003E\u003Cp\u003EOut of curiosity, I started to read how much a new car, even though I know I can not afford even a used car \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy brother once bought a slightly used Ford, and is very happy with this purchase.\u003C/p\u003E\u003Cp\u003ERecently I read that recently there were several accidents involving Fords.\u003C/p\u003E\u003Cp\u003ECaused MyKey technology, and more specifically its component in limiting the maximum speed, this technology was intended primarily for parents and employers to share their vehicles with your children or employees.\u003C/p\u003E\u003Cp\u003EUnfortunately, the reduction in speed can sometimes be deadly (quite literally) the consequences, such as limiter comes on when overtaking.\u003C/p\u003E\u003Cp\u003EI have heard that our Polish Ministry of Transport wanted to refuse approval Ford that uses, MyKey technology, because it can cause danger on the road while overtaking, but eventually agreed, reportedly they got the money from lobbyists Ford corporation:-)\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-09-11T16:10:37Z","Content":"\n\u003Cp\u003EDepend a bit on how its done, if they car start to reduce effect then you getting up to the limit would feel natural, like the engine is unable to push the car faster. \u003C/p\u003E\u003Cp\u003EHowever my car who have manual gearbox has an system who protect you from running the engine on too high RPM (7000) and it pretty much kill effect if you pass it. \u003C/p\u003E\u003Cp\u003EDealing with maximum speed the same way by cutting effect would be dangerous, you natural response would be to floor the pedal and making things worse, you would loosing speed then you expect it to increase. \u003C/p\u003E\u003Cp\u003EPurpose of this system would be to prevent speeding not ensure that the car never pass an maximum speed.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-09-11T16:11:31Z","Content":"\n\u003Cp\u003ENote that the speed limiting ability is optional, and can be configured by the user. Nobody has to use it.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-09-11T16:37:24Z","Content":"\n\u003Cp\u003EYou shouldn\u0027t be breaking the speed limit to overtake, it\u0027s there for a reason. If people weren\u0027t such muppets in the first place there\u0027d be no need for this technology.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-11T16:45:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EYou shouldn\u0027t be breaking the speed limit to overtake, it\u0027s there for a reason. If people weren\u0027t such muppets in the first place there\u0027d be no need for this technology.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes you right, but i think car need overrode button, than can overide car nanny for short time, like abort handle in apollo capsule.\u003C/p\u003E\u003Cp\u003EBut i think each use should be put in logbook by onboard computer, that car owner can see latter on, so they speeding kids or employees can have hard time dealing with their annoyed parents/employers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-11T17:07:59Z","Content":"\n\u003Cp\u003ENot a new idea, either; the Mazda RX-8 had a similar trick, as did a few Japanese sportsbikes (Honda NSR250, Suzuki RGV250...all the little two-stroke GP replicas). Two keys; one for \u0022daily driver\u0022 mode, one for \u0022sports\u0022 mode.\u003C/p\u003E\u003Cp\u003EWith the car, the intention was for it to be used when you needed to loan your flashy sportscar to your daft teenage sons.\u003C/p\u003E\u003Cp\u003EWith the bikes, it was a result of restrictive Japanese power-to-weight laws on small sportsbikes. To make the bikes street legal, you had to reduce the power; the \u0022fast\u0022 key was officially for use on racetracks only. The headlight was hard-wired on in \u0022street\u0022 mode, hard-wired off in \u0022race\u0022 mode. Of course, pretty much every owner hacked the system to get full power with the lights on within days of getting the bike.\u003C/p\u003E\u003Cp\u003EThe low-tech version of this has been around for decades; in Australia, learner riders used to be restricted to 250cc or less, so it was a standard tactic to do things like graft an RD350LC head onto an RD250LC base. Hefty power boost, but the coppers can\u0027t tell unless they tear the engine apart.\u003C/p\u003E\n"},{"CreatedByName":"Capt.Joseph Kerbertson","CreatedById":57354,"CreatedDateTime":"2014-09-11T17:25:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003EI love plane but i\u0027m interested in cars to, even haven\u0027t driver license.\u003Cp\u003EOut of curiosity, I started to read how much a new car, even though I know I can not afford even a used car \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy brother once bought a slightly used Ford, and is very happy with this purchase.\u003C/p\u003E\u003Cp\u003ERecently I read that recently there were several accidents involving Fords.\u003C/p\u003E\u003Cp\u003ECaused MyKey technology, and more specifically its component in limiting the maximum speed, this technology was intended primarily for parents and employers to share their vehicles with your children or employees.\u003C/p\u003E\u003Cp\u003EUnfortunately, the reduction in speed can sometimes be deadly (quite literally) the consequences, such as limiter comes on when overtaking.\u003C/p\u003E\u003Cp\u003EI have heard that our Polish Ministry of Transport wanted to refuse approval Ford that uses, MyKey technology, because it can cause danger on the road while overtaking, but eventually agreed, reportedly they got the money from lobbyists Ford corporation:-)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot all fords have the MyKey tech. Honestly, never seen it outside of a few gimmicky cars. If you are interested in buying a used car, I can almost guarantee that they will not come with mykey, especially if you are talking about a 3 or 4 year old car.\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2014-09-11T17:48:21Z","Content":"\n\u003Cp\u003ESpeed limiters should be the last thing on your mind as they can be easily removed or adjusted. Bigger dilemmas such as which turbo to buy, it which fuel controller or pistons to buy. These are far more important than some gimmicky speed limiter\u003C/p\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2014-09-11T20:28:22Z","Content":"\n\u003Cp\u003EMy parents used to have a car with a limiter, but the speed limit was set at 180 km/h, so not typically really a concern. I think the limit was there because by the time you hit that speed, you\u0027re really pushing the handling of most vehicles (this one included) to the limit, and driving in anything but a strait line is really taking your life into your own hands for most people at that speed. If you were to try to drive really fast, you\u0027d probably find that many cars do have speed governors, they\u0027re just set at speeds no sane person who isn\u0027t trying to figure out if they have a governor would drive at. Once you get into the spots cars, those probably disappear altogether, but these cars are also made to be able to do 200 km/h without flying off the road.\u003C/p\u003E\u003Cp\u003EOr maybe they stopped putting in the speed governors. I don\u0027t really know.\u003C/p\u003E\n"},{"CreatedByName":"Samniss Arandeen","CreatedById":120179,"CreatedDateTime":"2014-09-12T08:59:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vetrox\u0022 data-cite=\u0022vetrox\u0022\u003E\u003Cdiv\u003ESpeed limiters should be the last thing on your mind as they can be easily removed or adjusted. Bigger dilemmas such as which turbo to buy, it which fuel controller or pistons to buy. These are far more important than some gimmicky speed limiter\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. \u002Brep to you, good sir.\u003C/p\u003E\u003Cp\u003EFcuking electronic limiters are $h!t for the fcuking birds. I\u0027d rather have people know how to drive fast safely than be slowed down arbitrarily. And get out of the left lane ffs.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-12T09:12:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Samniss Arandeen\u0022 data-cite=\u0022Samniss Arandeen\u0022\u003E\u003Cdiv\u003EThis. \u002Brep to you, good sir.\u003Cp\u003EFcuking electronic limiters are $h!t for the fcuking birds. I\u0027d rather have people know how to drive fast safely than be slowed down arbitrarily. And get out of the left lane ffs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMeh. Make it compulsory to hold a motorcycle licence for a few years before they let you drive a car. Let Darwin take care of the careless.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-12T09:17:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Samniss Arandeen\u0022 data-cite=\u0022Samniss Arandeen\u0022\u003E\u003Cdiv\u003EThis. \u002Brep to you, good sir.\u003Cp\u003EFcuking electronic limiters are $h!t for the fcuking birds. I\u0027d rather have people know how to drive fast safely than be slowed down arbitrarily. And get out of the left lane ffs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut these limiters can be turned off, even as the manufacturer does not offer such a possibility, you only need to find a good mechanic and hacker who know his job:D\u003C/p\u003E\n"},{"CreatedByName":"Samniss Arandeen","CreatedById":120179,"CreatedDateTime":"2014-09-12T09:22:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003EBut these limiters can be turned off, even as the manufacturer does not offer such a possibility, you only need to find a good mechanic and hacker who know his job:D\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny tuner worth his salt, or chip programmer of any use, can bin the damn limiters.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EMeh. Make it compulsory to hold a motorcycle licence for a few years before they let you drive a car. Let Darwin take care of the careless.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYES. I\u0027ve had that idea for quite awhile. Finally someone agrees with me. Either motorcycles for a certain mileage or stick shift only for four years.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-12T09:37:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Samniss Arandeen\u0022 data-cite=\u0022Samniss Arandeen\u0022\u003E\u003Cdiv\u003EAny tuner worth his salt, or chip programmer of any use, can bin the damn limiters.\u003Cp\u003EYES. I\u0027ve had that idea for quite awhile. Finally someone agrees with me. Either motorcycles for a certain mileage or stick shift only for four years.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just wonder does in America did you must posses driver license for bike? (it\u0027s not issue for me because i do not know even how to drive damn bike:-)\u003C/p\u003E\u003Cp\u003EIn Poland you must have have so called A driving \u0022for motor bike\u0022 category B is for regular car, C and E is for 18 wheeler and D is for bus.\u003C/p\u003E\n"},{"CreatedByName":"Samniss Arandeen","CreatedById":120179,"CreatedDateTime":"2014-09-12T11:01:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003EI just wonder does in America did you must posses driver license for bike? (it\u0027s not issue for me because i do not know even how to drive damn bike:-)\u003Cp\u003EIn Poland you must have have so called A driving \u0022for motor bike\u0022 category B is for regular car, C and E is for 18 wheeler and D is for bus.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt varies from state to state, but here in Kansas it\u0027s pretty much the same process as getting a car license, just riding instead of driving.\u003C/p\u003E\u003Cp\u003EYou go to the \u003Cstrong\u003ED\u003C/strong\u003Eepartment of \u003Cstrong\u003EM\u003C/strong\u003Eotor \u003Cstrong\u003EV\u003C/strong\u003Eehicles (Insert \u0022bad customer service\u0022 joke here), take a written test, and gain your \u0022Learner\u0027s Permit\u0022 which allows you heavily restricted riding/driving priveliges. Then:\u003C/p\u003E\u003Cp\u003EA.) You drive/ride a certain length of time that you write down in a logbook. If you\u0027re a driver, you must have a licensed adult riding shotgun to observe and guide. If it\u0027s a bike, the licensed adult either rides tandem or on another bike in close proximity. Or,\u003C/p\u003E\u003Cp\u003EB.) Take and pass an accredited drivers\u0027 ed/motorcycle riding course.\u003C/p\u003E\u003Cp\u003EOption B puts you on a \u0022Restricted License\u0022 for a year where you can only drive/ride between or in connection with school, work and home. After this year, or if you took Option A, you\u0027re fully licensed. I don\u0027t know what the current minimum ages are anymore. They raised \u0027em awhile back. But I was 14 when I got my permit and 16 when I got my Big Cheese.\u003C/p\u003E\u003Cp\u003EAlso, you can have a combined license for both cars and bikes. Another footnote and, personally, a pet peeve of mine: The same license you got in a Nissan Micra or a Smart Fortwo lets you legally drive any RV or truck or any other vehicle less than 26 (U.S.) tons. Or any number of fast and loud sports cars. Or even tow trailers, again with the 26-ton cap. As for bikes, the same license you got on a scooter legally allows you road use of 1000cc monstrosities such as a \u0027Busa or R1.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-09-12T13:54:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EYou shouldn\u0027t be breaking the speed limit to overtake, it\u0027s there for a reason.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI mostly drive like an old woman, but even I wouldn\u0027t go that far. If someone is tootling along slow enough to be annoying, but fast enough that you need to break the speed limit to overtake in a safe distance and time then you should break the limit then slow back down when you\u0027ve completed the manoeuvre.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-09-12T14:21:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EYou shouldn\u0027t be breaking the speed limit to overtake, it\u0027s there for a reason.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is there for a reason. However, that reason is not applicable in all cases and sometimes other reasons have precedence. This is, pretty much, the difference between following the letter of the law or the spirit. The former is needed for clarity, the latter is needed for sanity.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-12T14:59:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EIt is there for a reason. However, that reason is not applicable in all cases and sometimes other reasons have precedence. This is, pretty much, the difference between following the letter of the law or the spirit. The former is needed for clarity, the latter is needed for sanity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo such speed limiter should have safety override to allow you to temporary disable it for short time,\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-09-12T15:07:31Z","Content":"\n\u003Cp\u003EOkay, those are fair enough points, but I\u0027d contend that the majority of speeding isn\u0027t people who need the extra power for a few seconds to overtake safely, it\u0027s people who think their journey is so important, and their driving skills so impeccable, that the law shouldn\u0027t apply to them.\u003C/p\u003E\u003Cp\u003EThe perfect example is \u0022let Darwin sort out the careless\u0022. It\u0027s not just the speeder who gets killed. A large proportion of the people killed aren\u0027t even in cars.\u003C/p\u003E\u003Cp\u003EAnd even if somebody is right, and they are a fantastic driver who can keep control of their car with no extra risk at 20% over the speed limit, they still have to take into account the actions of other road users. That video that came out recently of the motorcyclist hitting the oncoming car? Of course the car was in the wrong for turning across traffic without looking, but if the motorcyclist hadn\u0027t been doing 96 in a 60 zone, they would have been far better placed to avoid an accident.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-09-12T16:03:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003Ewith no extra risk\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe example you give was obviously with a significant amount of extra risk \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Speed limits are not just for vehicles getting out of control, they are (I would say mostly) meant to give everyone more time to react. Additionally they reduce the energies involved when things do go wrong.\u003C/p\u003E\u003Cp\u003EI feel speed limiters are a horrible way of enforcing driver safety. People that do not understand the importance of adhering to speed limits will find other risky modes or behaviour to endanger their lives and that of others. They should be educated or removed, but just limiting them in one way is not going to solve a lot of problems. \u003C/p\u003E\u003Cp\u003EAs a former pilot I have always felt that people are disproportionally irresponsible when it comes to driving. They just do not seem to take it and the associated dangers seriously. Every time you get behind the wheel you need to ask yourself whether you are capable of operating heavy equipment safely. If the answer is no, you should not drive. Yet angry, tired, distracted or drunk people are driving around everywhere. It always struck me as odd that pilots are much more acutely aware of their own skills and limitations, even when the potential danger is much smaller when flying small aircraft. To kill someone (besides yourself) is a lot harder when you are flying. The same goes for licences - in flying you constantly need to prove you are still worthy of operating an aircraft. A driver\u0027s license, on the other hand, is typically something you obtain once and keep for the rest of your life as long as you do not do anything really stupid. No updates, checks, physicals, nothing.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-09-12T16:29:22Z","Content":"\n\u003Cp\u003EEven taking the legal speed limit into account, preventing a car from going higher just isn\u0027t a good idea. There are circumstances where speeding is necessary for safety. Just imagine driving along a mountain pass in a 25mph zone, all of a sudden you see a landslide coming at you. What\u0027s your bigger concern at that point? Getting a ticket, or getting buried?\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-09-12T18:46:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EOkay, those are fair enough points, but I\u0027d contend that the majority of speeding isn\u0027t people who need the extra power for a few seconds to overtake safely, it\u0027s people who think their journey is so important, and their driving skills so impeccable, that the law shouldn\u0027t apply to them.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECompletely agree with this. Generally speaking, you\u0027ve got no need or right to cruise above the speed limit. If you do get caught doing so, just take your lumps. I\u0027ve got absolutely zero sympathy for people who rail against speed cameras.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-09-13T02:14:01Z","Content":"\n\u003Cp\u003EI noticed a couple of times that when you treat people like monkeys, they are going to act like them. The more you fence something off without telling them how and why, the more idiotic they will behave. Like I stated before, educating or removing them is the only real solution. Just hampering them without making (even more) clear why is only going to cause more erratic driving.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-09-13T02:36:23Z","Content":"\n\u003Cp\u003EMy 0.02 roots worth:\u003C/p\u003E\u003Cp\u003ESpeed limiters (that have high cutoff speeds, over 100mph) are generally to keep the vehicle from exceeding the speed rating of the tires. The faster you go, the the more heat the tire generates. Too hot under driving stress and the tire will have a RUD.\u003C/p\u003E\u003Cp\u003EI remember when the Al-block, 32-valve LT-5 Corvette motor came out. The secondary intake runner had a valve to restrict the airflow at low engine speeds, for better low-RPM performance, and opened at high RPMs to unleash all available horses. The valet mode (key-lock switch) would lock that secondary valve closed to restrict the power.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-13T03:41:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003ECompletely agree with this. Generally speaking, you\u0027ve got no need or right to cruise above the speed limit. If you do get caught doing so, just take your lumps. I\u0027ve got absolutely zero sympathy for people who rail against speed cameras.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed, but for probably somewhat different reasons.\u003C/p\u003E\u003Cp\u003EI\u0027ve been riding motorcycles daily for twenty years, and I habitually travel about 20% above the legal limit (when I judge it safe to do so; at other times, I\u0027ll be travelling substantially below the limit). I ride according to the conditions, not the regulations. I haven\u0027t paid a speeding fine or any other traffic violation in that time. Haven\u0027t broken a bone or shed a drop of blood, either.\u003C/p\u003E\u003Cp\u003EThe cops and cameras aren\u0027t hard to spot; if you can\u0027t see them in time, you\u0027re not paying sufficient attention for the speed you\u0027re doing.\u003C/p\u003E\n"}]}