{"TopicId":84567,"ForumId":18,"TopicTitle":"Help with Finnish folklore?","CreatedByName":"Wampa842","CreatedById":85841,"CreatedDateTime":"2014-09-14T08:51:55Z","PageNum":1,"Articles":[{"CreatedByName":"Wampa842","CreatedById":85841,"CreatedDateTime":"2014-09-14T08:51:55Z","Content":"\n\u003Cp\u003ECurrently I am collaborating with some people to write a graphic novel that is partly set in Finland. I\u0027d like some recommendations to sources I can learn about Finnish folklore from. Traditions, celebrations, arts, architecture, decoration; anything and everything.\u003C/p\u003E\n"},{"CreatedByName":"ajshell1","CreatedById":24132,"CreatedDateTime":"2014-09-14T17:45:33Z","Content":"\n\u003Cp\u003EI\u0027m not Finnish, but I\u0027d suggest reading the Kalevala.\u003C/p\u003E\u003Cp\u003EIt\u0027s Finland\u0027s national epic poem. I\u0027m sure you\u0027ll find something in it.\u003C/p\u003E\n"},{"CreatedByName":"Wampa842","CreatedById":85841,"CreatedDateTime":"2014-09-14T21:24:10Z","Content":"\n\u003Cp\u003EI\u0027m reading it as I am writing. I\u0027m at the second LemminkÃƒÂ¤inen cycle, I think it\u0027s a great read, even if a bit monotone.\u003C/p\u003E\u003Cp\u003EBut what I want to know is how the people of Finland actually lived in the 19th century. The Kalevala has a lot of useful info about Finnish paganism and mythology, but not a lot of specific descriptions.\u003C/p\u003E\n"},{"CreatedByName":"Las-pen","CreatedById":121174,"CreatedDateTime":"2014-09-15T13:40:51Z","Content":"\n\u003Cp\u003EI\u0027m a Finn. What do you want to know?\u003C/p\u003E\u003Cp\u003EHere\u0027s few terms that come to my mind. Try googling some of them.\u003C/p\u003E\u003Cp\u003EFrom folklore all I can think is \u003Cstrong\u003EThe Groke\u003C/strong\u003E from \u003Cstrong\u003Ethe Moomins. \u003C/strong\u003EAlso \u003Cstrong\u003ESanta Claus \u003C/strong\u003Eis Finnish\u003C/p\u003E\u003Cp\u003ETraditions: \u003Cstrong\u003ESauna\u003C/strong\u003E is something very Finnish. A place to wash your body and mind. \u003Cstrong\u003EJuhannus\u003C/strong\u003E (Midsummer / St. John\u0027s Day in English) is one highpoint of a year. \u003Cstrong\u003EDrinking\u003C/strong\u003E is always close when it comes to holidays. Be it Christmas, Easter, Midsummer, 1st of May, Finns get drunk. Bonfires are traditionally lit on Easter and Midsummer\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EFoods:\u003C/em\u003E\u003Cstrong\u003EMÃƒÂ¤mmi\u003C/strong\u003E is a traditional food we eat on Easter. \u003Cstrong\u003ESalmiak\u003C/strong\u003E is a \u0022sweet\u0022. \u003Cstrong\u003EPotato\u003C/strong\u003E is pretty much basis to every food we eat.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EDrinks:\u003C/em\u003E well... beer, booze, anything with alcohol. That and coffee.(Me? I drink neither. Just to be clear.)\u003Cem\u003EArchitecture\u003C/em\u003E\u003Cem\u003E\u003Cstrong\u003E:\u003C/strong\u003E\u003C/em\u003E\u003Cstrong\u003E Alvar Aalto\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ELiterature:\u003C/em\u003E \u003Cstrong\u003ETove Jansson (The Moomins), Aleksis Kivi (Seven Brothers), Mika Waltari (Sinuhe, The Egyptian), Elias LÃƒÂ¶nnrot (Kalevala)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMusic:\u003C/em\u003E\u003Cstrong\u003E Jean Sibelius\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFinns are very quiet and a pretty depressed people who like to drink very, very much. Suicide is a common.\u003C/p\u003E\u003Cp\u003EDid I mention we like to drink?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EAbout Finnish paganism.\u003C/p\u003E\u003Cp\u003ESome gods\u003C/p\u003E\u003Cp\u003EUkko: The high-god. God of sky and weather and harvest. The Finnish term Ukkonen (= Thunder) is derived from him\u003C/p\u003E\u003Cp\u003EAhti: The God of Waters. The one fishermen prayed for good catch.\u003C/p\u003E\u003Cp\u003ETapio: The King of Forest. The one hunters prayed for good prey.\u003C/p\u003E\u003Cp\u003EFinns are very agricultural people and Finland is mostly composed from Forests and Lakes, so those are perhaps the most important (at least the most famous) gods.\u003C/p\u003E\u003Cp\u003EI would suggest you try Crusader Kings 2 with Old Gods DLC.\u003C/p\u003E\u003Cp\u003EAlso Karelian mythology is close to Finnish mythology.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-15T15:54:26Z\u0022 title=\u002209/15/2014 03:54  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 15, 2014\u003C/time\u003E by diomedea\u003C/strong\u003E\n\u003Cbr\u003Emerged consecutive posts\n\u003C/span\u003E\n"}]}