{"TopicId":84750,"ForumId":18,"TopicTitle":"Video game crash","CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-09-16T16:14:16Z","PageNum":1,"Articles":[{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-09-16T16:14:16Z","Content":"\n\u003Cp\u003EDo you think it could happen again?\u003C/p\u003E\u003Cp\u003EWatch this video first.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/UDTg8gADBHU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EI kind of agree with him, but he forgot that back in the 80s there was no World Wide Web in existence. At best, people could\u0027ve comment the games between themselves in stores, in letters to game magazines. We live in an entirely different society now. Communication is plentiful, and thus the speed of spreading info on what\u0027s great and what\u0027s not is huge. YouTube offers us to see the gameplay.\u003C/p\u003E\u003Cp\u003EDiscuss.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-09-17T13:22:05Z","Content":"\n\u003Cp\u003ENobody has anything to say about this topic which is \u0022kind of\u0022 vital for this forum?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-09-17T13:38:36Z","Content":"\n\u003Cp\u003EThere is nothing to discuss. He explains in perfect detail why the same cannot happen again - internet communities, communication and maybe indie games. At the same time the big companies are making crazy amounts of money even when people know exactly what they are getting, so nothing is happening there either.\u003C/p\u003E\u003Cp\u003EIn short, it is just a random dude on the internet proclaiming something. Move along, nothing to see. I want my 8 minutes back.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-09-17T15:17:35Z","Content":"\n\u003Cp\u003EIn contrary, he did not explain why the same can not happen again. In fact, he\u0027s pretty sure it will happen again. I\u0027m trying to see the various opinions on this forum.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-09-17T17:00:04Z","Content":"\n\u003Cp\u003EWell at first i was sceptical. I mean come on, a hilarious guy talking about video games? But if you make it to the end, that hilarious guys has an point, a very good one. Yes the gaming industry is shoveling their own grave by releasing a bunch of dung onto the customers which even have to pay for that.\u003C/p\u003E\u003Cp\u003EIn my opinion every game on steam should be testable by the consumer for one day or so but they won\u0027t do it cause they are too greedy.\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2014-09-17T19:41:04Z","Content":"\n\u003Cp\u003EHorse race, National lotery, Euromillion (\u0026amp; similar), and now U tube funny video advertising reward. What\u0027s next popular bet around the rock ? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*yawn* sure fact is: people instinct to like some kind of things and process never/rarely change in the background even if it change in the front scene ... as always * shrug*\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u0022Geographically, esports competitions have their roots in developed countries. South Korea has the best established esports organizations, officially licensing pro-gamers since the year 2000.[5] Official recognition of esports competitions outside South Korea has come somewhat slower.\u0022 source: \u003C/span\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Electronic_sports\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ehttp://en.wikipedia.org/wiki/Electronic_sports\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EQuestion as clue:\u003C/span\u003E\u003C/span\u003E who massively invested in the evening/else tv show ? you get it ... a fresh new coliseum so cool to focus attention upon\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2014-09-17T22:22:55Z","Content":"\n\u003Cp\u003EI don\u0027t find his argument particularly convincing.\u003C/p\u003E\u003Cp\u003EIf EA goes under tomorrow, computer gaming will still exist. Same goes for Valve or whoever else he references.\u003C/p\u003E\u003Cp\u003EBad games coming out now, do not un-create the many many good games that have already been created.\u003C/p\u003E\u003Cp\u003EPeople will not stop gaming because Operation Headshot turns out to be bad.\u003C/p\u003E\u003Cp\u003ESeriously, how bad would a game have to be to invalidate all the years of enjoyment I\u0027ve had playing many games, across multiple platforms? It\u0027s just not going to happen.\u003C/p\u003E\u003Cp\u003EAnyway, the crash in the 80\u0027s happened, and gaming is still here. For this simple reason alone, I\u0027m not that worried.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-09-17T23:00:41Z","Content":"\n\u003Cp\u003EThe crash didn\u0027t mean the end of gaming as a concept. It was just a crash of the market. The whole point is that there was a surplus of stupid games, so the gaming community got tired of buying stuff. Then NES came after a while.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-09-17T23:07:30Z","Content":"\n\u003Cp\u003EI don\u0027t think it could happen the same way because games nowadays are distributed on cheap-to-produce optical discs and even-cheaper-to-offer digital downloads, not costly cartridges. (The 3DS still uses cartridges, but I bet they\u0027re much cheaper in real terms than the carts of the crash-era consoles.) Online retailing also means publishers aren\u0027t beholden to non-specialist shops to carry games; even if every bricks-and-mortar store stopped giving them shelf space they could still sell and market games widely.\u003C/p\u003E\u003Cp\u003ETechnology\u0027s advanced too, to the point that most platforms are capable of producing visually and auditorially acceptable games. The advancement has also lead to diversification. Nowadays a decline in one type of game, eg big-budget \u0022Triple-A\u0022 PS4/XBox One/PC games, need not be matched by a decline in other types of game such as mobile titles or the 3DS.\u003C/p\u003E\u003Cp\u003EThat\u0027s not to say an overall industry recession is impossible, but outside of a wider catastrophe we\u0027re not going to see game sales suddenly drop by 90-something percent.\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2014-09-17T23:34:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EThe crash didn\u0027t mean the end of gaming as a concept. It was just a crash of the market. The whole point is that there was a surplus of stupid games, so the gaming community got tired of buying stuff. Then NES came after a while.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m still not getting why I should worry. The market back then was tiny, they were essentially selling a niche product. And most of what was available were clones of what else was available.\u003C/p\u003E\u003Cp\u003EIt wasn\u0027t just the NES though, there was the small matter of the home-computer boom that happened in the UK. Sinclair, Amstrad, and Commodore all came to prominence in this period, and that\u0027s just what was going on in the UK in the 80\u0027s, while simultaneously Atari were burying cartridges.\u003C/p\u003E\u003Cp\u003EEven during the crash there were innovative games that sold in large volumes.\u003C/p\u003E\u003Cp\u003EThe market is huge now. It\u0027s mainstream now, in a way it never was in the 80\u0027s. Good games will continue to sell. If people aren\u0027t buying bad games, well... should we be surprised by that? Should we be concerned by that?\u003C/p\u003E\u003Cp\u003EI\u0027m perfectly happy with companies that produce bad games going under. That seems like the natural order of things to me. Just because you made a game, does not mean I have to want to buy it.\u003C/p\u003E\u003Cp\u003EI\u0027m not going to tire of buying games because a certain percentage of the available options are uninspired. That\u0027s a ridiculous notion. I will still buy the games I want to buy.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-09-18T16:04:09Z","Content":"\n\u003Cp\u003EI seriously fail to see any conversational value in this. There are some non-substantiated and badly argued claims made by some random dude on Youtube. There is nothing to discuss, or we would have a lot of discussing to do on many other random Youtube clips.\u003C/p\u003E\n"},{"CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2014-09-18T19:43:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EWell at first i was sceptical. I mean come on, a hilarious guy talking about video games? But if you make it to the end, that hilarious guys has an point, a very good one. Yes the gaming industry is shoveling their own grave by releasing a bunch of dung onto the customers which even have to pay for that.\u003Cp\u003EIn my opinion every game on steam should be testable by the consumer for one day or so but they won\u0027t do it cause they are too greedy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndie Games exist. I\u0027ll be perfectly happy if they become the sole method of good gaming.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-09-18T23:04:26Z","Content":"\n\u003Cp\u003EI doubt there will be video game crash of any sort, movies have never had it, or sports; and video games are a form of entertainment just like them.\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2014-09-19T14:22:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Airbornem4\u0022 data-cite=\u0022Airbornem4\u0022\u003E\u003Cdiv\u003EI doubt there will be video game crash of any sort, movies have never had it, or sports; and video games are a form of entertainment just like them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame, it\u0027s would be like saying: \u0022E.A. core E-sports slogan, \u003Cem\u003Eit\u0027s in the game\u003C/em\u003E, is in Korea\u0022\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-09-20T00:38:02Z","Content":"\n\u003Cp\u003Eway i see it, no demo, no sale.\u003C/p\u003E\n"},{"CreatedByName":"Las-pen","CreatedById":121174,"CreatedDateTime":"2014-09-20T08:22:21Z","Content":"\n\u003Cp\u003EI think it is coming sooner or later, like everything else. Steam and the whole industry is getting cluttered by \u0022unique\u0022 indie games with 8-bit graphics while big companies just release the same games over and over again. There\u0027s too much from where to choose and most of it is pretty much the same anyways\u003C/p\u003E\n"}]}