{"TopicId":84945,"ForumId":18,"TopicTitle":"Asperger Syndrome and driving","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-19T03:40:02Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-19T03:40:02Z","Content":"\n\u003Cp\u003EDo you think that a person with Asperger\u0027s may be a good driver?\u003C/p\u003E\u003Cp\u003EI wonder if you ever do not enroll in a driving course. The only problem is that I have Asperger\u0027s, my mom has mixed feelings on this, but I\u0027m an adult and she has little to say:-) \u003C/p\u003E\u003Cp\u003EI saw some old folks behind the wheel, they often did their driving courses when my country was under communism, now diapers for adults because the defecate without knowing it, yet they still have their license, \u003C/p\u003E\u003Cp\u003EI\u0027m Aspie but i\u0027m young i would certainly be better driver than those folks:-) \u003C/p\u003E\u003Cp\u003EMy only problem is that I can not afford driving course, and my mother certainly did not give money for it, I can put aside some money from my social scholarship.\u003C/p\u003E\u003Cp\u003EI just wonder why someone in Europe and America have problems with aspies driving cars?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-09-19T03:47:10Z","Content":"\n\u003Cp\u003EOld folks are quite unsafe when driving sometimes. That is the big question: can you control a vehicle in such a manner that you are safe, and maybe even more important, that all others are safe? Number one priority with any vehicle is safety. If you cannot do it properly, please do not do it at all. That some folks are also doing things they should not do does not change anything.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-09-19T04:06:00Z","Content":"\n\u003Cp\u003EDepends. Everyone i know that has Aspergers can drive.\u003C/p\u003E\u003Cp\u003EMy older brother is autistic, although he can make a normal conversation and hold a job; He can\u0027t drive a car because of his slow reaction time. I suppose a doctor or driving instructor is best qualified to tell you if you can drive or not.\u003C/p\u003E\n"},{"CreatedByName":"Rainbowtrout","CreatedById":60253,"CreatedDateTime":"2014-09-19T06:05:20Z","Content":"\n\u003Cp\u003EChances are, you\u0027ll be okay. I\u0027m not familiar with Poland\u0027s legal system, but not allowing someone to drive due to Autism isn\u0027t right, in my opinion. Maybe ask around?\u003C/p\u003E\n"}]}