{"TopicId":87525,"ForumId":18,"TopicTitle":"Some questions regarding rockets and material","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-10-16T13:39:12Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-10-16T13:39:12Z","Content":"\n\u003Cp\u003ELet\u0027s say you have to build a custom metal rocket nozzle, or a rocket tank. Do you know if you could place a order with a small model and specifications, and have the metal shop construct it? \u003C/p\u003E\u003Cp\u003EAlso, any ideas about how PVC piping behaves in supersonic flight, and estimates on how far a cluster of extended G80 motors will take. Also, could you \u0022stack\u0022 rocket motors by cutting off their top and affixing another motor with a cut off bottom for a greater burn time?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Eif you are the FAA or FBI please look away and forget this.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-10-16T14:10:43Z","Content":"\n\u003Cp\u003EYes, you can order it. Metal shops can use a lathe to make you a nozzle out of most construction metals. Maybe not every shop, but in general they do it. I\u0027m not sure about the prices, though. It\u0027s probably not cheap unless you find a really good deal, simply because that\u0027s one order instead of series of orders.\u003C/p\u003E\u003Cp\u003ECustom made nozzle is for advanced rockets where de Laval shape actually means something. If you\u0027re building anything less sophisticated than those things people launch in Nevada, you can go with approximations or even regular holes.\u003C/p\u003E\u003Cp\u003EUse high pressure PVC pipes for engine blocks, and mount them in rocket body made of lighter, thinner, more rigid polymers. You can make engine blocks out of rcandy for fuel, gypsum for nozzle and hot glue for sealing the top. Keep them in small, tightly closed containers because they\u0027re hygroscopic. It\u0027s almost an art to get the best results.\u003C/p\u003E\u003Cp\u003ENo, you can\u0027t do that with engines. The point of contact will become the point of violent breakup. Don\u0027t do that unless you want CATO.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-10-16T14:18:20Z","Content":"\n\u003Cp\u003EAlso, would R-candy be useful for a suborbital rocket launch, or will we need a better fuel?\u003C/p\u003E\u003Cp\u003EI have qualms about its low ISP. I need a rocket fuel that can provide me with a good ISP and can be built with off the shelf matierals, or perhaps a cluster of motors that can get me to suborbit. Once again, FAA, pay no attention.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-16T14:26:06Z\u0022 title=\u002210/16/2014 02:26  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 16, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"}]}