{"TopicId":87535,"ForumId":18,"TopicTitle":"Why Apple sucks.","CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2014-10-16T15:57:04Z","PageNum":1,"Articles":[{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2014-10-16T15:57:04Z","Content":"\n\u003Cp\u003ESo my mom bought a second hand iPad for Ã‚Â£100 not understanding the possibility of there being an iPad 1 or 2 or whatever.\u003C/p\u003E\u003Cp\u003EShe only really wants to play her bingo on it, which requires an app that requires IOS 6. Which the iPad 1 doesn\u0027t support. Leads to me spending the last 5 hours jailbraking her iPad and searching for ways to update it to iOS 6 or android. This is exactly why I don\u0027t buy apple products, because the one thing you probably want to do, Apple will be like [snip] No accessability for you person who has even small knowledge of what an .apk is or does and who prefers Android because of it\u0027s flexibility. HAHA We\u0027ve locked everything down to our underpowered devices.\u003C/p\u003E\u003Cp\u003EI would have been playing KSP for the last 5 hours but this happened instead.\u003C/p\u003E\u003Cp\u003EAnyone by chance know how do it? lol.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-16T17:35:06Z\u0022 title=\u002210/16/2014 05:35  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 16, 2014\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003ELanguage.\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-10-16T16:03:44Z","Content":"\n\u003Cp\u003EThe best you can do is upgrade iOS via jaibreaking. \u003Ca href=\u0022http://www.geeknaut.com/can-i-upgrade-ipad-1-to-ios-6-221911448.html\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s\u003C/a\u003E a handy how-to. Ignore the stuff about illegality and warranty voiding, neither apply here or anywhere else in the EU.\u003C/p\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2014-10-16T16:21:23Z","Content":"\n\u003Cp\u003ELike all the other things I\u0027ve found, that\u0027s a Theme related update, it only makes your IOS look like IOS 6, it doesn\u0027t actually run IOS 6\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-10-16T16:30:03Z","Content":"\n\u003Cp\u003EYep, sorry. Should have checked a bit closer. I don\u0027t think you\u0027e going to be able to do this, unless somebody\u0027s properly cracked iOS 6, the rest of the guides all seem to be pretty much the same thing.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-10-16T23:47:34Z","Content":"\n\u003Cp\u003EIve managed to use a Macintosh for the past 8 years, I\u0027m thinking of upgrading to a Hackintosh\u003C/p\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2014-10-17T06:35:30Z","Content":"\n\u003Cp\u003EApple never does big upgrades for their mobile devices because it\u0027s a waste of money. They only slowly add tiny upgrades, and force you to buy new devices.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-17T12:30:24Z","Content":"\n\u003Cp\u003EI fail to see how any of the OP\u0027s troubles are Apple\u0027s fault. Do some basic research before buying old used hardware.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-10-17T12:48:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI fail to see how any of the OP\u0027s troubles are Apple\u0027s fault. Do some basic research before buying old used hardware.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis.\u003C/p\u003E\u003Cp\u003EI have my own reasons to dislike Apple, but you have to admit tjat this is your fault\u003C/p\u003E\u003Cp\u003E If you knew it required iOS6 to run, you should have done some research before buying an old, outdated device.\u003C/p\u003E\u003Cp\u003EYou know that Apple are a bunch of \u0022very silly people\u0022 and they reserve every update for new devices, so you should have taken that into account.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-17T17:36:07Z\u0022 title=\u002210/17/2014 05:36  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 17, 2014\u003C/time\u003E by Rainbowtrout\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-10-17T14:25:02Z","Content":"\n\u003Cp\u003ENowadays reading is a hard task, especially not reading the OP\u0027s and blindly replying to something.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-10-17T15:32:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI fail to see how any of the OP\u0027s troubles are Apple\u0027s fault. Do some basic research before buying old used hardware.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E While it may not be Apple\u0027s *fault* exactly, it is a direct result of how Apple products are designed. \u003C/p\u003E\u003Cp\u003E The OP is looking for guidance on how to jailbreak it (which seems reasonable to me) and if nothing else it provides a useful cautionary tale; don\u0027t buy old Apple stuff expecting to update it.\u003C/p\u003E\u003Cp\u003E Besides... I really wouldn\u0027t expect someone who just wants to play bingo to be tech-savvy enough to expect sw/os conflicts for such a simple game.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-17T15:39:59Z\u0022 title=\u002210/17/2014 03:39  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 17, 2014\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheFlyingPigs","CreatedById":122671,"CreatedDateTime":"2014-10-17T15:37:04Z","Content":"\n\u003Cp\u003EHere comes the flame war...\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-17T15:40:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EWhile it may not be Apple\u0027s *fault* exactly, it is a direct result of how Apple products are designed. \u003Cp\u003E The OP is looking for guidance on how to jailbreak it (which seems reasonable to me) and if nothing else it provides a useful cautionary tale; don\u0027t buy old Apple stuff expecting to update it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame can be said of any manufacturer\u0027s hardware. Apple is actually quite good at permitting older devices to update, much better than most Android manufacturers IME. I\u0027m an Android person, but I\u0027m envious of Apple\u0027s better software updating. This chart is illuminating (phones rather than tablets and a bit old, but the point is the same): \u003Ca href=\u0022http://www.fidlee.com/wp-content/uploads/2013/12/AndroidHistoryOfSupport1.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.fidlee.com/wp-content/uploads/2013/12/AndroidHistoryOfSupport1.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOf course, one can root and get a third party firmware, but that\u0027s equivalent to what the OP is attempting.\u003C/p\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2014-10-17T15:42:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI fail to see how any of the OP\u0027s troubles are Apple\u0027s fault. Do some basic research before buying old used hardware.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd I fail to figure out how someone got so much reputation without bothering to read an OP.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-17T15:47:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022glen.mack\u0022 data-cite=\u0022glen.mack\u0022\u003E\u003Cdiv\u003EAnd I fail to figure out how someone got so much reputation without bothering to read an OP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot starting threads with misleading flamebait titles is a part of it. I read your OP, it\u0027s 80% anti-Apple rant and 20% actual question (though I didn\u0027t see it before it got mod edited). Forgive me for addressing the title and bulk of your OP rather than the lesser part.\u003C/p\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2014-10-17T16:10:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ENot starting threads with misleading flamebait titles is a part of it. I read your OP, it\u0027s 80% anti-Apple rant and 20% actual question (though I didn\u0027t see it before it got mod edited). Forgive me for addressing the title and bulk of your OP rather than the lesser part.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure how explaining the exact context of my issue is an anti-apple rant, it\u0027s a rant but one perfectly justified. I had nothing to do with the purchase of said product, I was presented with a problem that an average middle aged woman with very little knowledge of computers or forums or what an OS is has extreme difficulty in comprehending. As Apple tries to become ubiquitous with life and pervade into every aspect of your day to day living, they do so in full knowledge that *SOME\u0022 of their user base is going to be people that have very little understanding of technology. That said part of user base is going to be alienated and confused as to why things don\u0027t work when they did exactly what they were told.\u003C/p\u003E\u003Cp\u003EYou want to do X go buy an iPad. iPad was bought, you bought the wrong iPad.\u003C/p\u003E\u003Cp\u003EThey market themselves as the SIMPLE, CLEAN, EASY choice. And while their design, marketing and interface may be simple clean and easy. Their Hardware is not. Their hardware is clunky, often underpowered compared to what else is on the market, and in some cases some of the most complex to use I\u0027ve ever come across.\u003C/p\u003E\u003Cp\u003EThat, is why apple sucks.\u003C/p\u003E\u003Cp\u003EIs that clear enough now?\u003C/p\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2014-10-17T16:14:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheFlyingPigs\u0022 data-cite=\u0022TheFlyingPigs\u0022\u003E\u003Cdiv\u003EHere comes the flame war...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAye, every time I see this crop up in the new posts listings, I wonder a bit more why it hasn\u0027t been locked yet. All this is going to lead to is anger. \u003C/p\u003E\u003Cp\u003EAs for the OP, you can be frustrated with a problem without having a flamebaiting rant about said problem while then asking out of the corner of your mouth about the actual problem. \u003C/p\u003E\u003Cp\u003EI\u0027ve run OSX for years and you don\u0027t see me flailing my arms about and screaming when I\u0027ve got to try to fix things on my SO\u0027s Windows 8 rig.\u003C/p\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2014-10-17T16:34:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boomerang\u0022 data-cite=\u0022Boomerang\u0022\u003E\u003Cdiv\u003EAye, every time I see this crop up in the new posts listings, I wonder a bit more why it hasn\u0027t been locked yet. All this is going to lead to is anger. \u003Cp\u003EAs for the OP, you can be frustrated with a problem without having a flamebaiting rant about said problem while then asking out of the corner of your mouth about the actual problem. \u003C/p\u003E\u003Cp\u003EI\u0027ve run OSX for years and you don\u0027t see me flailing my arms about and screaming when I\u0027ve got to try to fix things on my SO\u0027s Windows 8 rig.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHas there every been a problem you couldn\u0027t fix because Windows deliberately made it so it was impossible to do?\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-10-17T16:36:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boomerang\u0022 data-cite=\u0022Boomerang\u0022\u003E\u003Cdiv\u003EAye, every time I see this crop up in the new posts listings, I wonder a bit more why it hasn\u0027t been locked yet. All this is going to lead to is anger. \u003Cp\u003EAs for the OP, you can be frustrated with a problem without having a flamebaiting rant about said problem while then asking out of the corner of your mouth about the actual problem. \u003C/p\u003E\u003Cp\u003EI\u0027ve run OSX for years and you don\u0027t see me flailing my arms about and screaming when I\u0027ve got to try to fix things on my SO\u0027s Windows 8 rig.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Probably a waste of typing on my part, but ranting \u0022Apple sucks!!\u0022 out of frustration really \u003Cem\u003Eshouldn\u0027t\u003C/em\u003E be \u0022flamebait\u0022.\u003C/p\u003E\u003Cp\u003E It\u0027s not personally directed at anyone, political, religious, or singling out any subset of people. Nevertheless, people do have an odd affinity for aligning themselves with brand names and some will take slights against their brand personally *shrug*...\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-10-17T16:37:04Z","Content":"\n\u003Cp\u003EThe point is Apple doesn\u0027t want you to use your old hardware, i am sure there is no technical reason why the bingo app shouldn\u0027t run on an ipad1. The only reason is Apple doesn\u0027t want you to, cause they want you to buy a new ipad. Because of that i see it was legitimate from the OP to say Apple sucks. (I am an Apple user too btw, have an iphone5s and ipad gen3)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-17T19:14:02Z\u0022 title=\u002210/17/2014 07:14  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 17, 2014\u003C/time\u003E by gpisic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-10-17T17:48:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI fail to see how any of the OP\u0027s troubles are Apple\u0027s fault. Do some basic research before buying old used hardware.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow is it \u0027not Apple\u0027s fault\u0027 that it\u0027s physically impossible to run new software on older hardware, even when it would be able to run?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-10-17T20:36:06Z","Content":"\n\u003Cp\u003Ethis is why i dont use portable devices. you pretty much get locked in to what software you end up using. on a pc if i dont like the new version of windows, there are a lot of other operating systems i can replace it with. portables on the other hand are locked down with software licenses and easily voided warranties. then on top of that you are locked into app stores. i didn\u0027t like ios any more than i liked android. the only os i have actually liked on portable devices is linux actual (not droid), and i really dont like linux.\u003C/p\u003E\n"},{"CreatedByName":"jfx","CreatedById":37282,"CreatedDateTime":"2014-10-17T21:21:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EHow is it \u0027not Apple\u0027s fault\u0027 that it\u0027s physically impossible to run new software on older hardware, even when it would be able to run?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt one point it is no longer feasible to support legacy hardware.\u003C/p\u003E\u003Cp\u003EYou may be able to install new-ish apps on an android device from 2010. But you really don\u0027t want to use them anyways. 320p (~ 400p if you are lucky) screens, \u0026lt; 500mb RAM, Gingerbread and slow-poke CPUs you\u0027d rather read a book than do anything on them, including bingo.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-17T21:30:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Eportables on the other hand are locked down with software licenses and easily voided warranties. then on top of that you are locked into app stores.\u003C/div\u003E\u003C/blockquote\u003EDepends on the device in question. I\u0027ve already installed apps from F-Droid on my Moto G, and I think I can root it if I want and even change the OS to something like CyanogenMod.\u003Cp\u003EiDevices, though, are universally locked-down. It is indeed one of the reasons I\u0027m unlikely to ever buy one.\u003C/p\u003E\u003Cp\u003EIncidentally, I\u0027m been in a similar situation to the OP. My boss came to me asking if I could install WhatsApp on his son\u0027s iPod Touch. Several hours of mucking about later, yes it was possible, but in future I think the answer will be \u0022No, it\u0027s not compatible.\u0022\u003C/p\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2014-10-17T22:17:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jfx\u0022 data-cite=\u0022jfx\u0022\u003E\u003Cdiv\u003EAt one point it is no longer feasible to support legacy hardware.\u003Cp\u003EYou may be able to install new-ish apps on an android device from 2010. But you really don\u0027t want to use them anyways. 320p (~ 400p if you are lucky) screens, \u0026lt; 500mb RAM, Gingerbread and slow-poke CPUs you\u0027d rather read a book than do anything on them, including bingo.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem with saying this is that you haven\u0027t done any reading or know anything about the situation, you\u0027re throwing generics out.\u003C/p\u003E\u003Cp\u003EIOS 6.0 runs on The iPhone 3GS which has the same specs as the original iPad but a smaller screen. The difference is they stripped out IOS 6.0 to put on the 3GS because it was still a popular seller in less developed countries. the iPad despite being practically identical from a hardware perspective did not. Why didn\u0027t it get IOS6? Because it couldn\u0027t, or wouldn\u0027t run? Nope. It was because iPad 2 was out.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-10-18T01:15:15Z","Content":"\n\u003Cp\u003EA little OT, but I play KSP on my 6 year old computer (with a whopping 2 GB of RAM) with good results. I just upgraded to OS X Yosemite, and it seems to run well. My point is, I consider my hardware to be legacy, but it works well for me and I expect to be using it until I yield to the temptation of buying the 27\u0022 iMac with Retina display (which means that instead of being able to run 4K cinema, it will run 5K, in that sense). But for now I\u0027ll hang in there with my current investment.\u003C/p\u003E\n"}]}