{"TopicId":946,"ForumId":18,"TopicTitle":"Anime: Wings of Honneamise","CreatedByName":"Andras","CreatedById":3716,"CreatedDateTime":"2011-07-23T20:24:23Z","PageNum":1,"Articles":[{"CreatedByName":"Andras","CreatedById":3716,"CreatedDateTime":"2011-07-23T20:24:23Z","Content":"\n\u003Cp\u003EThe KSP game reminded me of the anime Royal Space Force: Wings of Honneamise, which is the story of a nation\u0027s first steps into space. It\u0027s sort of a combination of The Right Stuff and Jules Verne.\u003C/p\u003E\u003Cp\u003EIt\u0027s quite well done and the launch sequence at the end of the movie is pretty intense beacuse a rival nation invades to destroy the launch site.\u003C/p\u003E\u003Cp\u003ELaunch and orbit in Japanese\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/xyIU_qExIbc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EFighting and Launch in English\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/3l3yEGblTj8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Urist McUseless","CreatedById":1258,"CreatedDateTime":"2011-07-24T07:52:47Z","Content":"\n\u003Cp\u003EThat was pretty awesome. Isn\u0027t there another anime about a rocket launch into space? I remember watching it on teletoon when I was small, but what I can remember of it was that it was centred on the astronaut, it had something to do with him finding some religion or something mid way through for some reason.\u003C/p\u003E\n"},{"CreatedByName":"Andras","CreatedById":3716,"CreatedDateTime":"2011-07-24T10:00:08Z","Content":"\n\u003Cp\u003EThat\u0027s the same one.\u003C/p\u003E\n"},{"CreatedByName":"kurohone","CreatedById":4048,"CreatedDateTime":"2011-07-26T13:23:38Z","Content":"\n\u003Cp\u003EThe thing I really loved about WoH is that is really showed the sheer gall of the early space programs on Earth, and it\u0027s reflected in their world. This was a time when placing a \u003Cem\u003Elong-distance telephone call\u003C/em\u003E was an iffy proposition, with as many hits as misses, when computer was still used as an adjective much mroe often than a noun....and yet they thought they could just send someone up into the single most hostile environment that can be imagined. Only they weren\u0027t actually sure how hostile it might be, cause they barely could get robots and probes up there to check!\u003C/p\u003E\u003Cp\u003EIn a day of focus groups and risk-assessment on EVERYTHING, it\u0027s hard to really imagine a place like that existed, here, not very long ago.\u003C/p\u003E\u003Cp\u003EThe other thing about WoH that I remember is that I was left feeling a bit uneasy at the ending....it occured to me as he gave his broadcast that throughout the whole show they had focused so much on the job of getting him UP that there hadn\u0027t ever really been a discussion of bringing him DOWN...\u003C/p\u003E\n"},{"CreatedByName":"Urist McUseless","CreatedById":1258,"CreatedDateTime":"2011-07-26T15:31:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Andras\u0022 data-cite=\u0022Andras\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat\u0027s the same one.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHoly crap! I guess I\u0027ll have to watch it again after all these years.\u003C/p\u003E\n"},{"CreatedByName":"cray","CreatedById":3499,"CreatedDateTime":"2011-07-27T02:57:47Z","Content":"\n\u003Cp\u003EExcellent movie. Own it.\u003C/p\u003E\u003Cp\u003EI like the attention to detail in this alternate world: the uniforms, the currency, the religion, the politics. Every time I watch it, there\u0027s something new to find there - and the utterly awesome launch scene in the middle of a battlefield.\u003C/p\u003E\n"}]}