{"TopicId":95662,"ForumId":18,"TopicTitle":"I wonder why so many people consider fighter pilot and despite bomber pilot","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-01-04T19:33:52Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-01-04T19:33:52Z","Content":"\n\u003Cp\u003EI wonder why so many showing fighter pilot as brave and hero, while in the same think about bomber pilot as evil ones?\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-01-04T19:48:04Z","Content":"\n\u003Cp\u003EWhere did you get that? ln my country pilots (no matter what they fly) are perceived as over-paid experts.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2015-01-04T19:56:31Z","Content":"\n\u003Cp\u003EWhat about fighter-bomber pilots?\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2015-01-04T20:11:17Z","Content":"\n\u003Cp\u003EMaybe in Poland but i never heard about that where i live. Makes limited sense though if you think about in a historical sense. Fighter pilots usually defended Bombers or their country and usually fought other fighters with similar conditions and chances. And the outcome was (or is) very dependant on the skill of the pilot. Almost like knights out of Fairy tale. While bombers drop bombs from high altitude sometimes even on civilian targets.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-01-04T20:47:51Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027;\u0022\u003E\u0022Fighter pilots make movies, bomber pilots make history.\u0022\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.imdb.com/title/tt0099587/\u0022 rel=\u0022external nofollow\u0022\u003EFlight of the Intruder\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-01-04T20:51:18Z","Content":"\n\u003Cp\u003EOne defends one attacks.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-01-06T13:09:40Z","Content":"\n\u003Cp\u003EMemphis Belle certainly didn\u0027t portray the bomber crew as evil.\u003C/p\u003E\u003Cp\u003EFighter pilots are the only one in command of their craft, so there\u0027s the \u0022solo\u0022 aspect.\u003C/p\u003E\u003Cp\u003EThey seek out air combat; whereas a bomber pilot wishes to avoid it, and unleas bombs on a defenseless target below.\u003C/p\u003E\u003Cp\u003EEspecially in WWII, the bomber crews were much more numerous than the fighter pilots, and not as well trained.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-01-06T13:36:06Z","Content":"\n\u003Cp\u003EBomber crews had to EXPECT to be shot down. Theg went in knowing they were easily screwed, but they did it anyways. That, my fellow Kerbals, is bravery.\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2015-01-06T14:31:13Z","Content":"\n\u003Cp\u003ENever heard of that. But if I have to guess, I\u0027d say because fighters go against other combatants (whether fighters or bombers or whatever, but military anyways) while bombers in many occasions had to drop bombs on cities full of civilians. So for fighters it\u0027s a \u0022duel\u0022 kind of business while for bombers it\u0027s dropping bombs on innocents.\u003C/p\u003E\u003Cp\u003EI know that\u0027s not entirely true, just saying that might be the perception.\u003C/p\u003E\u003Cp\u003EAlso bombing is a boring you perform seated comfortably while dogfighting is cool stuff with high Gs and sweating. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-01-06T17:14:24Z","Content":"\n\u003Cp\u003Eno body cares about tankbuster pilots. that is why there are not enough A-10s\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-01-06T20:22:31Z","Content":"\n\u003Cp\u003Ewar is nasty. a good fighter pilot is a wolf. you pick out the weak (in terms of position, available support, etc) for your targets and take them out first. its a lot like any animal planet special on any predatory species where they kill stragglers, the old, the injured, the babys. its just the mind set you have to have. thats how the red baron managed 80 something kills. dogfights, the closest thing to a fair dual a fighter pilot ever engages in, is something one tends to avoid at all costs in favor of easy kills. this might not be as true as it used to be, with radar in everything, and beyond visual range engagements, but its still in the manual. you want the most gain for the least risk.\u003C/p\u003E\u003Cp\u003Ebomber pilots on the other hand flew straight to their targets, getting shot with all kinds of nasty things on the way there and back, then get all the hate because their missions often involved collateral damage. its the dirty job that needs doing. and if i was a pilot i think i would feel safer in the fighter than in the bomber. these days its all about precision bombing with stealth aircraft and as a result its a much safer and cleaner job than it was in ww2 or vietnam. but it still takes nerves of steel. \u003C/p\u003E\u003Cp\u003Eanyone who goes into battle has a pair of brass ones, and i dont think its really fair to give one more praise than the other. they both have their missions and they both do them well. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022megatiger78\u0022 data-cite=\u0022megatiger78\u0022\u003E\u003Cdiv\u003Eno body cares about tankbuster pilots. that is why there are not enough A-10s\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eexcept of course the ground pounders who need air support. a-10s are their angels.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-06T20:45:36Z\u0022 title=\u002201/06/2015 08:45  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 6, 2015\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"}]}