{"TopicId":98408,"ForumId":18,"TopicTitle":"Dual Boot Laptop Recommendations?","CreatedByName":"pearldrumbum","CreatedById":133163,"CreatedDateTime":"2015-01-31T22:22:34Z","PageNum":1,"Articles":[{"CreatedByName":"pearldrumbum","CreatedById":133163,"CreatedDateTime":"2015-01-31T22:22:34Z","Content":"\n\u003Cp\u003EI don\u0027t post here a lot, but I figured I\u0027d ask here since KSP is pretty much the only game I play seriously (not a big gamer in general)\u003C/p\u003E\u003Cp\u003ETime has come for my work to buy me a laptop upgrade and I get to pick it, there are just a few requirements they give me:\u003C/p\u003E\u003Cp\u003E1. Must run AutoCAD 2015 and run it well. Unfortunately (for gaming purposes), though this means I need a good graphics card, it needs more of a \u0027work station\u0027 g-card than a \u0027gaming\u0027 g-card.\u003C/p\u003E\u003Cp\u003E2. Implied from \u00271\u0027, but it must also run Windows 7 or 8. I personally prefer 7, my work encourages 8 which makes sense in a way. I won\u0027t get another upgrade for 2 1/2 years, and it\u0027s hard to know how well 7 will be supported by then.\u003C/p\u003E\u003Cp\u003E3. Must have an HDMI, Display Port, and/or Thunderbolt port.\u003C/p\u003E\u003Cp\u003E4. At least one USB3.0 port.\u003C/p\u003E\u003Cp\u003E5. $1500 limit\u003C/p\u003E\u003Cp\u003EMy own requirements:\u003C/p\u003E\u003Cp\u003E1. Be able to easily install either Mint or Fedora alongside Windows for dual-boot. Luckily my job is cool with this. We travel a lot for work so they understand that it will inevitably become a personal laptop too. I prefer Linux and that environment will be for my personal projects, gaming, and media.\u003C/p\u003E\u003Cp\u003E2. Run games like KSP well (in Linux). Especially with a heavy amount of mods.\u003C/p\u003E\u003Cp\u003E3. Must NOT have a touchscreen (gross)\u003C/p\u003E\u003Cp\u003E4. Minimum 17\u0022 screen, but I prefer 19\u0022. I use AutoCAD a lot in the field, away from my big desktop monitor, and CAD on a small screen SUCKS.\u003C/p\u003E\u003Cp\u003E5. Be able to output 4k resolution on the HDMI/DP.\u003C/p\u003E\u003Cp\u003E6. Have a full number pad on the keyboard.\u003C/p\u003E\u003Cp\u003ELet me know what laptops you either own or know about that meet/come close to these requirements. Anybody else forced to work with a workstation graphics card and still play games on it? How has that worked out for you?\u003C/p\u003E\n"},{"CreatedByName":"astecarmyman","CreatedById":65422,"CreatedDateTime":"2015-02-01T04:18:19Z","Content":"\n\u003Cp\u003EIf you have a 1500$ budget, you can most definitely pick up a good desktop (or laptop but they are slightly more expensive) that has at least 16gb RAM i7 cpu and a decent gpu. I\u0027m not sure about your software problems, but for that price you can get a gaming gpu that works wonders\u003C/p\u003E\n"},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-02-01T05:13:18Z","Content":"\n\u003Cp\u003EI have found some good reviews of the \u003Ca href=\u0022http://www.dell.com/us/p/alienware-17-r2/pd\u0022 rel=\u0022external nofollow\u0022\u003EAlien-ware 17\u003C/a\u003E, which is on the upper end of your price range, but seems to have good specs. They are made for gaming, but people in the Autocad forums seemed to like them, too. \u003C/p\u003E\u003Cp\u003EAs far as adding the Linux OS, I am not really sure of whether this is a \u0027good\u0027 laptop for it, but I cannot see why it should not be.\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2015-02-01T17:38:40Z","Content":"\n\u003Cp\u003EHere is a page of 17\u0022 laptops that aren\u0027t Dell/HP/Lenovo (but tend to be reasonably well known for PC parts). The \u0026gt;18\u0022 are budget breakers, and the 17\u0022 have a reasonably wide selection of GPUs (I\u0027d tend toward the Maxwell jobs, if only for heat/power consumption). Warning: nvidia has no plans for wayland, so it might not be a good long term choice for Linux.\u003Ca href=\u0022http://www.xoticpc.com/custom-gaming-laptops-notebooks-laptops-ct-95_51_150.htmlNo\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.xoticpc.com/custom-gaming-laptops-notebooks-laptops-ct-95_51_150.htmlNo\u003C/a\u003E idea how to find a good Linux laptop. With desktops it seams you just buy the desktop and it works (I\u0027ve had more things not work with windows than not work with Linux). Best answer is to find someone who has installed (and used) Linux on the laptop. Second best method is to google drivers for each part. I\u0027m guessing the wifi chipset is the only real issue.\u003C/p\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2015-02-02T18:49:37Z","Content":"\n\u003Cp\u003EDual boot, if native, is not demanding, you just need to have a big hard drive and standard or better components. But having good performance during heavy usage is a different story.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-02-02T19:56:49Z","Content":"\n\u003Cp\u003EI normally recommend Thinkpads for professional grade notebooks, but I don\u0027t think they make a 17\u0022 model.\u003C/p\u003E\u003Cp\u003EHave a look at HP\u0027s Z-book line, it is available with a 17\u0022 display and professional GPU, plus it can be ordered with Linux so you know the driver support is there. I suspect $1500 is not oging to be enough for more than a base model, though.\u003C/p\u003E\n"},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-02-03T02:55:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI normally recommend Thinkpads for professional grade notebooks, but I don\u0027t think they make a 17\u0022 model.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey do have \u003Ca href=\u0022http://shop.lenovo.com/us/en/laptops/thinkpad/w-series/w540/\u0022 rel=\u0022external nofollow\u0022\u003E15.5\u0022\u003C/a\u003E ones, though.\u003C/p\u003E\u003Cp\u003EAnd they formerly had 17\u0022 ones, but that was several years ago, and they appear to have been discontinued.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-03T04:02:56Z\u0022 title=\u002202/03/2015 04:02  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 3, 2015\u003C/time\u003E by Newt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"atwood","CreatedById":137859,"CreatedDateTime":"2015-02-17T09:56:51Z","Content":"\n\u003Cp\u003EOn that budget, you should definitely check the Asus Rog G751JT-CH71, you won\u0027t be disappointed with it, \u003Cspan style=\u0022font-family:Arial;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIts 16GB ram is big enough, the GTX 970M is fast enough to run all the current, \u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E most demanding games\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-17T13:08:02Z\u0022 title=\u002202/17/2015 01:08  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 17, 2015\u003C/time\u003E by atwood\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"atwood","CreatedById":137859,"CreatedDateTime":"2015-02-17T13:09:46Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EThe Lenovo Y50 is very good as well as Asus ROG. \u003C/span\u003E\u003Ca href=\u0022http://gaminglaptopunder1000.org/best-gaming-laptop-under-1500-dollars/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gaminglaptopunder1000.org/best-gaming-laptop-under-1500-dollars/\u003C/a\u003E\u003C/p\u003E\n"}]}