{"TopicId":9861,"ForumId":18,"TopicTitle":"We will remember them . . .","CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2012-04-24T12:33:51Z","PageNum":1,"Articles":[{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2012-04-24T12:33:51Z","Content":"\n\u003Cp\u003E(Note for anyone who\\\u0027s not an Aussie, a Kiwi or a Turk: tomorrow is ANZAC day - one of the most solemn days in the calendar of the abovenamed countries, when we remember those who died during the Gallipoli attack in 1915; and by extension [in Australia and New Zealand at least] all those who have died in subsequent wars.)\u003C/p\u003E\u003Cp\u003EAs a young person, I was always fascinated by war. I found wars and weapons to be one of the things I could spend hours reading about. \u003C/p\u003E\u003Cp\u003EAs I\\\u0027ve got older, however, things have changed. \u003C/p\u003E\u003Cp\u003EI\\\u0027m not a pacifist, in that I still think that there are problems (regrettably) that war is the only option to solve. I also believe that in an imperfect world, every country unfortunately needs an army (and they need to be kept well-trained). But for all that, I have realised more and more that war is far from the great adventure I once thought it to be. It is a horror, and it is something we would be better off avoiding.\u003C/p\u003E\u003Cp\u003EOne thing that I have only truly realised recently is this - soldiers ESPECIALLY hate war. They are trained for it and know how to fight in it minimising the risk, but perhaps more than anyone else a soldier wishes that the world was a peaceful place.\u003C/p\u003E\u003Cp\u003EWhen I was in my early 20s I had the privilege of visiting ANZAC Cove at Gallipoli. There I saw the plaque that was erected on the instructions of Mustapha Kemal Ataturk. It says the following:\u003C/p\u003E\u003Cp\u003EThose heroes that shed their blood And lost their lives...\u003C/p\u003E\u003Cp\u003EYou are now lying in the soil of a friendly country.\u003C/p\u003E\u003Cp\u003ETherefore, rest in peace.\u003C/p\u003E\u003Cp\u003EThere is no difference between the Johnnies\u003C/p\u003E\u003Cp\u003EAnd the Mehmets to us where they lie side by side,\u003C/p\u003E\u003Cp\u003EHere in this country of ours.\u003C/p\u003E\u003Cp\u003EYou, the mothers, who sent their sons from far away countries...\u003C/p\u003E\u003Cp\u003EWipe away your tears.\u003C/p\u003E\u003Cp\u003EYour sons are now lying in our bosom And are in peace.\u003C/p\u003E\u003Cp\u003EAfter having lost their lives on this land, they have\u003C/p\u003E\u003Cp\u003EBecome our sons as well.\u003C/p\u003E\u003Cp\u003EIt strikes me that this is the finest epitaph that a soldier could ever receive. For your courage to be praised is good. For your courage to be praised by your foe is better. For your courage to be praised by a FORMER foe who now regards your countrymen as friends is the greatest of all.\u003C/p\u003E\u003Cp\u003EOn this ANZAC day, I thought this was a fitting tribute to Australian service men and women of the past and the present. But I also thought it was fitting to also tribute those who were once our enemies but are now our friends - in some way, the suffering was not in vain.\u003C/p\u003E\n"},{"CreatedByName":"Ascensiam","CreatedById":12621,"CreatedDateTime":"2012-04-24T13:27:55Z","Content":"\n\u003Cp\u003EWow, i just read up on it, that\\\u0027s half a million men. That just goes to show us it truly was \\\u0027\\\u0027The Great War\\\u0027\\\u0027\u003C/p\u003E\n"},{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2012-04-24T13:45:48Z","Content":"\n\u003Cp\u003EYeah.\u003C/p\u003E\u003Cp\u003EOur contingent in that little battle (Gallipoli) lost 8,709 people. Throughout the Great War we lost 61,522 lives. \u003C/p\u003E\u003Cp\u003EFrom a population of 4 million, that\\\u0027s a hefty hit.\u003C/p\u003E\n"},{"CreatedByName":"Ascensiam","CreatedById":12621,"CreatedDateTime":"2012-04-24T13:50:28Z","Content":"\n\u003Cp\u003EAnd neither side really got anything out of it in the end, the Ottomans lost the war and the British never took Constantinople, it\\\u0027s just millions of families left without their members to some pointless conflict between powerful men.\u003C/p\u003E\u003Cp\u003EWe have had several losses from wars where Germany has had sudden outbreaks of irredentism, so we know what such a thing is like.\u003C/p\u003E\n"},{"CreatedByName":"Quontex","CreatedById":20139,"CreatedDateTime":"2012-04-24T13:55:18Z","Content":"\n\u003Cp\u003Eas an aussie I will honor our lost heroes, and wherever i am what ever i am doing i will stop and stand for that one Minute of silence. \u003C/p\u003E\n"},{"CreatedByName":"Altair1371","CreatedById":6754,"CreatedDateTime":"2012-04-24T15:43:13Z","Content":"\n\u003Cp\u003EI agree. In the world we live in, you need forces to protect yourself from those who wish to harm, abuse, and exploit. And I totally agree, war is hated most by those who participate. It\\\u0027s getting harder for me to play war games, because everytime I do I start imagining what TRUE battlefield conversations would be. (note: I am not, nor have I ever been in the military) Here\\\u0027s what BF3 gives us:\u003C/p\u003E\u003Cp\u003E\u0027HOLY F**K I\\\u0027M PINNED DOWN!\u0027\u003C/p\u003E\u003Cp\u003EAnd here\\\u0027s what I imagine:\u003C/p\u003E\u003Cp\u003E*screams*\u003C/p\u003E\u003Cp\u003E\u0027I\\\u0027M PINNED DO-\u0027\u003C/p\u003E\u003Cp\u003E*more screams after being shot in the leg*\u003C/p\u003E\u003Cp\u003EIt\\\u0027s a scary place. I\\\u0027m sure it is. I don\\\u0027t think soldiers need a salute, or a thank you when they come home. I think they need a teddy bear, a hug, something to comfort them. War can turn a man insane if he\\\u0027s not careful.\u003C/p\u003E\n"},{"CreatedByName":"Kreuzung","CreatedById":21035,"CreatedDateTime":"2012-04-24T16:53:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWar can turn a man insane if he\\\u0027s not careful.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWar can turn anyone insane. See the GIs who went to war for fighting for good ideals and came back after they enjoyed the deaths of innocent men, women and children. See the young people who enjoyed their life years ago and joined groups like the Taliban because they couldn\\\u0027t believe in a peaceful future again.\u003C/p\u003E\u003Cp\u003EI seriously can\\\u0027t imagine why normal people believe in RL war games (other universe is fine for me, so-called serious games also) and talk about it like \u0027I GOT MOAR KILLS IN TERMINAL MISSION THAN U\u0027. I can\\\u0027t imagine why someone can play as a Nazi in games that \\\u0027gives you real WW2 experience\\\u0027. I also don\\\u0027t know why my father talks about his electronics company inventing parts for the TIGER (he sometimes calls it heli and sometimes tank, I believe it\\\u0027s the Eurocopter gunship) or about buying resources from the Taliban (\u0027\\\u0027cause you can\\\u0027t really get \\\u0027em in other ways, every company does that\u0027) like about everything else. I don\\\u0027t get why the Formula 1 does not care at all about being in the center of a massacre.\u003C/p\u003E\u003Cp\u003EI really hope for the day a new CoD comes out and almost nobody buys it BECAUSE IT IS WAR. I hope for the day a new product comes out and nobody buys it BECAUSE WARLORDS MAKE MONEY WITH IT.\u003C/p\u003E\u003Cp\u003EBut I know this will never happen...\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-04-24T20:36:54Z","Content":"\n\u003Cp\u003EAs has been my tradition on the forums I am on. For anzac day, it will say this:\u003C/p\u003E\u003Cp\u003EIn Flanders fields the poppies blow\u003C/p\u003E\u003Cp\u003EBetween the crosses, row on row,\u003C/p\u003E\u003Cp\u003EThat mark our place; and in the sky\u003C/p\u003E\u003Cp\u003EThe larks, still bravely singing, fly\u003C/p\u003E\u003Cp\u003EScarce heard amid the guns below.\u003C/p\u003E\u003Cp\u003EWe are the Dead. Short days ago\u003C/p\u003E\u003Cp\u003EWe lived, felt dawn, saw sunset glow,\u003C/p\u003E\u003Cp\u003ELoved and were loved, and now we lie,\u003C/p\u003E\u003Cp\u003EIn Flanders fields.\u003C/p\u003E\u003Cp\u003ETake up our quarrel with the foe:\u003C/p\u003E\u003Cp\u003ETo you from failing hands we throw\u003C/p\u003E\u003Cp\u003EThe torch; be yours to hold it high.\u003C/p\u003E\u003Cp\u003EIf ye break faith with us who die\u003C/p\u003E\u003Cp\u003EWe shall not sleep, though poppies grow\u003C/p\u003E\u003Cp\u003EIn Flanders fields.\u003C/p\u003E\u003Cp\u003EThank you for remembering them.\u003C/p\u003E\n"},{"CreatedByName":"Polecat Industries","CreatedById":11224,"CreatedDateTime":"2012-04-24T22:41:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Radsoc\u0022 data-cite=\u0022Radsoc\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhy are they heroes? They killed a lot of people because they were told to by the kings, queens, kaisers, capitalists and other rulers. They are nothing more than murderers. Real heroes were those who turned their guns on their rulers instead of turning them against their brothers in other countries. They were tools, they didn\\\u0027t fight for Australia, and are a disgrace to humanity, nothing more.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcuse me? I\\\u0027d like you to say that in person to someone\\\u0027s family, with members who died in that great war. It may have been their great great uncle that died, or even a great grandparent. Either way, that is insulting to them.\u003C/p\u003E\n"},{"CreatedByName":"Altair1371","CreatedById":6754,"CreatedDateTime":"2012-04-25T00:36:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EExcuse me? I\\\u0027d like you to say that in person to someone\\\u0027s family, with members who died in that great war. It may have been their great great uncle that died, or even a great grandparent. Either way, that is insulting to them.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree. Though war is atrocious, I can not say so for the people who fight them. In fact, I\\\u0027d say that the survivors are the true casualties of war. They are now forever scarred, knowing that they willingly killed other human beings.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-04-25T02:01:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Radsoc\u0022 data-cite=\u0022Radsoc\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhy are they heroes? They killed a lot of people because they were told to by the kings, queens, kaisers, capitalists and other rulers. They are nothing more than murderers. Real heroes were those who turned their guns on their rulers instead of turning them against their brothers in other countries. They were tools, they didn\\\u0027t fight for Australia, and are a disgrace to humanity, nothing more.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for displaying the reason that people hate anarchist (literally, thats what some anarchist think). Please, don\\\u0027t let the door hit you on the way out, the door is worth more (note, while this is your opinion, and I do know that people have differing opinions, it doesn\\\u0027t mean you should say it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ping111\u0022 data-cite=\u0022ping111\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWe must also remember the 13 million people who died in the 4 years of terror that were the Holocaust. If my grandparents had not escaped Hungary mere days before the Germans arrived, I would never have existed. LIZCOR VELO LISHCOAKH.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd those 2-4 million jews who died after the russian invasion of Austria-Hungary, after a similer thing happened.\u003C/p\u003E\u003Cp\u003E[gmod]Stay on topic.[/gmod]\u003C/p\u003E\n"},{"CreatedByName":"hebdomad","CreatedById":16474,"CreatedDateTime":"2012-04-25T04:45:37Z","Content":"\n\u003Cp\u003EThe one thing I hope people remember this day, is that there is no glory in war. Only death and destruction.\u003C/p\u003E\u003Cp\u003ELest we forget those who died defending their home lands on all sides of conflict. Whether it was at home or abroad. Such is the insanity of war.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-04-25T07:20:41Z","Content":"\n\u003Cp\u003EThey shall grow not old, as we that are left grow old:\u003C/p\u003E\u003Cp\u003EAge shall not weary them, nor the years condemn.\u003C/p\u003E\u003Cp\u003EAt the going down of the sun and in the morning,\u003C/p\u003E\u003Cp\u003EWe will remember them.\u003C/p\u003E\u003Cp\u003EAmen\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2012-04-25T07:34:37Z","Content":"\n\u003Cp\u003E[mod]A senior moderator will be by to review the content in this post, so take care that what you have said is within the rules of the forums and plain old human decency.\nAnd I will remind everyone that hate speech of ANY kind will not be tolerated, nor will verbally assaulting other users. Keep it cool in there, please.[/mod]\u003C/p\u003E\n"},{"CreatedByName":"RayneCloud","CreatedById":11227,"CreatedDateTime":"2012-04-25T14:24:02Z","Content":"\n\u003Cp\u003E[gmod]As noted, please remain on topic and remain respectful at all times. Content in this thread has been removed that does not meet these requirements. -DR[/gmod]\u003C/p\u003E\n"}]}