{"TopicId":99973,"ForumId":18,"TopicTitle":"Massive psychological experiment in the KSP forums.","CreatedByName":"gmpd2000","CreatedById":37101,"CreatedDateTime":"2015-02-17T22:57:03Z","PageNum":5,"Articles":[{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-23T14:52:15Z","Content":"\n\u003Cp\u003EOkay. Fine. If we kill one person we have more people. That\u0027s an advantage. Not to save them per se, but so the population and humanity as a whole has a greater potential for benefit.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EI would not pull the lever, I wouldn\u0027t kill one person to \u0022save\u0022 other people\u0022, none of the deaths are on my hands.\u003Cp\u003EHuman lives are not directly equatable to numeric plot devices.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis is NOT what is happening however, you have no responsibility in the deaths of those four people, and legally you would NOT be accused of \u0022killing by inaction\u0022, there is no precedent anywhere for such an idea.\u003C/p\u003E\u003Cp\u003EWith one decision you are merely an observer, with the other, a murderer.\u003C/p\u003E\u003Cp\u003EAnd we would all be better off if there were less people willing to pull the lever.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll I\u0027m saying is that either way you\u0027re to blame. Beyond that it\u0027s the preference of the chooser which person survives.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-02-23T19:24:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gmpd2000\u0022 data-cite=\u0022gmpd2000\u0022\u003E\u003Cdiv\u003EThe problem:\u003Cp\u003EThere are 4 workers in a train line, there is a train coming, the workers can\u0027t see the train nor they can be warned about it.\u003C/p\u003E\u003Cp\u003EHowever, there is a lever that if pulled, it will put the train on an alternate train line where is only 1 worker on it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe a little more background would be interesting. Questions like these (and probably literally this one) are part of what are called \u003Ca href=\u0022https://en.wikipedia.org/wiki/Trolley_problem\u0022 rel=\u0022external nofollow\u0022\u003Etrolley problems\u003C/a\u003E, pioneered by Philippa Foot. The idea is to ask people to respond to ever more complicated scenario\u0027s, from ones with obvious solutions to ones that really have no right outcome. \u003C/p\u003E\u003Cp\u003EThey are actually rather connected to current developments and technology, as people creating self driving cars will need to implement some kind of artificial morality, so that a truck knows whether to take out that grandma or school bus full of children when push comes to shove. \u003C/p\u003E\u003Cp\u003EIf anything, they are an interesting way of exploring the morality people always think they have and should be so obviously clear, but often is not.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2015-02-24T03:02:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EOkay. Fine. If we kill one person we have more people. That\u0027s an advantage. Not to save them per se, but so the population and humanity as a whole has a greater potential for benefit.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAll I\u0027m saying is that either way you\u0027re to blame. Beyond that it\u0027s the preference of the chooser which person survives.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut that\u0027s not true, you are not \u0022to blame either way\u0022, if you don\u0027t pull the lever you are guilty of nothing aside from seeing a horrible thing happen, if you do pull the lever, you have killed someone.\u003C/p\u003E\u003Cp\u003EAnd again, the idea that \u0022well four people is better than one person\u0022 is a misguided assumption at best.\u003C/p\u003E\u003Cp\u003ELets propose this, the single person standing by themselves is a very talented doctor, responsible for saving dozens of people\u0027s lives, one of the four you could \u0022save\u0022 is a serial ....../murderer...you don\u0027t know any of this...but, you decide to save the four anyway.\u003C/p\u003E\u003Cp\u003EThe doctor is killed, the ....../murderer go free..hundreds of people are negatively affected/die by your decision.\u003C/p\u003E\u003Cp\u003EIt\u0027s on par with religious zealotry if you ask me, the assumption that ones\u0027 own beliefs\u0027, in this case the belief that four people are worth more than one, are infallibly correct and should be acted upon regardless.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-24T03:14:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EBut that\u0027s not true, you are not \u0022to blame either way\u0022, if you don\u0027t pull the lever you are guilty of nothing aside from seeing a horrible thing happen, if you do pull the lever, you have killed someone.\u003Cp\u003EAnd again, the idea that \u0022well four people is better than one person\u0022 is a misguided assumption at best.\u003C/p\u003E\u003Cp\u003ELets propose this, the single person standing by themselves is a very talented doctor, responsible for saving dozens of people\u0027s lives, one of the four you could \u0022save\u0022 is a serial ....../murderer...you don\u0027t know any of this...but, you decide to save the four anyway.\u003C/p\u003E\u003Cp\u003EThe doctor is killed, the ....../murderer go free..hundreds of people are negatively affected/die by your decision.\u003C/p\u003E\u003Cp\u003EIt\u0027s on par with religious zealotry if you ask me, the assumption that ones\u0027 own beliefs\u0027, in this case the belief that four people are worth more than one, are infallibly correct and should be acted upon regardless.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s no right answer in this situation. \u003C/p\u003E\u003Cp\u003EAll of their lives are in your hands. You don\u0027t pull the lever. You could have. But you didn\u0027t. You caused their deaths by not pulling the lever. You\u0027re not a bystander, you\u0027re right therein the middle.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-24T04:52:27Z","Content":"\n\u003Cp\u003EPull the lever and then tell everybody you froze and didn\u0027t know what to do.\u003C/p\u003E\u003Cp\u003EOr if there is some log of when the lever is pulled, pull it, and then say you did so before noticing the train and then froze.\u003C/p\u003E\u003Cp\u003EPulling it back would have made things worse so nobody can blame you for not acting, and the family of the person who died will blame whoever caused the thing in the first place.\u003C/p\u003E\u003Cp\u003Ei.e., when in doubt, do the right thing and then lie to keep the lawyers away.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-24T05:04:03Z","Content":"\n\u003Cp\u003ECome to think of it...\u003C/p\u003E\u003Cp\u003EIs the switch between two or three tracks? If three, I just switch the train to the third. Unless there was something on it...\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2015-02-24T07:04:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EThere\u0027s no right answer in this situation. \u003Cp\u003EAll of their lives are in your hands. You don\u0027t pull the lever. You could have. But you didn\u0027t. You caused their deaths by not pulling the lever. You\u0027re not a bystander, you\u0027re right therein the middle.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, objectively speaking this is wrong, you didn\u0027t cause the death of anyone by doing nothing.\u003C/p\u003E\u003Cp\u003EThis is a glaring flaw in this \u0022experiment\u0022, the assumption that inactivity is in fact activity and that you are responsible for deaths that you merely observed, or rather not a flaw, but rather a forced contrivance.\u003C/p\u003E\u003Cp\u003EObjectively speaking it is the wrong thing to do to kill someone, and no wrong is done by observing a thing and choosing not to kill.\u003C/p\u003E\u003Cp\u003ESo, I disagree completely, the wrong thing to do is to pull the lever and \u0022play god\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-24T13:31:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EActually, objectively speaking this is wrong, you didn\u0027t cause the death of anyone by doing nothing.\u003Cp\u003EThis is a glaring flaw in this \u0022experiment\u0022, the assumption that inactivity is in fact activity and that you are responsible for deaths that you merely observed, or rather not a flaw, but rather a forced contrivance.\u003C/p\u003E\u003Cp\u003EObjectively speaking it is the wrong thing to do to kill someone, and no wrong is done by observing a thing and choosing not to kill.\u003C/p\u003E\u003Cp\u003ESo, I disagree completely, the wrong thing to do is to pull the lever and \u0022play god\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut you\u0027re not just observing. That\u0027s not even close. Their lives are in your hands. You are responsible for their deaths. You have the ability to save them, which makes you much more than a bystander observing someone\u0027s untimely death. You\u0027re the one who chose to let four people die. That makes you responsible for their deaths.\u003C/p\u003E\u003Cp\u003ESo, do you know what the responsible party is?\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2015-02-24T22:54:09Z","Content":"\n\u003Cp\u003EUnwillingness to act in this situation is as bad as killing those men...\u003C/p\u003E\n"},{"CreatedByName":"jake9039","CreatedById":122602,"CreatedDateTime":"2015-02-25T20:30:20Z","Content":"\n\u003Cp\u003EI pull the one lever, than pull another that puts the train on an oval route \u003Cem\u003Earound\u003C/em\u003E the 4 workers but also extended past the other workeer, kiling only the pigeon.\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2015-02-26T01:14:26Z","Content":"\n\u003Cp\u003EI stand there recording video as the accident unfolds. Later I\u0027ll offer the video to the families of the deceased to use in their lawsuit against the railroad. They had a responsibility not to let people work on active tracks without a warning system.\u003C/p\u003E\u003Cp\u003EAs for the lever? I\u0027m not a rail worker and don\u0027t know what that lever does. What if it diverts the train into a nearby elementary school? What if diverting the train causes a derailment that kills a dozen passengers? It\u0027s not like the lever\u0027s positions are labelled, \u0022Kill 5 people\u0022, \u0022Kill 1 person\u0022. If they were, I still wouldn\u0027t touch it, but would be sure to get video of it so the railroad\u0027ll get charged with murder since it was obviously planned. Plus it\u0027s evidence to use in my own mental anguish lawsuit against them.\u003C/p\u003E\u003Cp\u003EI get the theory behind the scenario. In an idealized fantasy world, sure I\u0027d pull the lever and choose 1 death over 5. But in the world where I actually live, people get sued for any sort of \u0022helpful\u0022 interference. For example, in New Jersey in 2009, a car in the right lane stopped to let a motorcycle pull out. Motorcyclist pulled past the car and proceeded into the left lane, where he got hit. So the cyclist sues the guy who waved him out, because supposedly it was HIS job to check that all lanes were clear. \u003Ca href=\u0022http://yournjlawyer.com/index.php/2009/04/waving-a-car-into-traffic-prior-to-crash-results-in-liability/\u0022 rel=\u0022external nofollow\u0022\u003EMotorcyclist won, to the tune of $1.5 million\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EScrew that stuff!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-26T01:16:01Z\u0022 title=\u002202/26/2015 01:16  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 26, 2015\u003C/time\u003E by Beowolf\u003C/strong\u003E\n\u003Cbr\u003Eadded link to lawsuit story\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-26T01:42:16Z","Content":"\n\u003Cp\u003EThat motorcycle thing sounds dumb. My question is, did the cyclist have the right-of-way? If so, blame the laws for right-of-way stuff.\u003C/p\u003E\n"}]}