{"TopicId":102129,"ForumId":39,"TopicTitle":"The Wait (OR a newbie\u0027s adventures in Hard mode)","CreatedByName":"TheHolyChicken","CreatedById":139582,"CreatedDateTime":"2015-03-17T11:19:01Z","PageNum":1,"Articles":[{"CreatedByName":"TheHolyChicken","CreatedById":139582,"CreatedDateTime":"2015-03-17T11:19:01Z","Content":"Reddit thread here: [http://www.reddit.com/r/KerbalSpaceProgram/comments/2zc4ee/short_story_the_wait_or_a_newbies_adventures_in/](http://www.reddit.com/r/KerbalSpaceProgram/comments/2zc4ee/short_story_the_wait_or_a_newbies_adventures_in/)\n\n-----------------------------------------------------------------------------------------\n\n![AhVrfbj.jpg](http://i.imgur.com/AhVrfbj.jpg)\n\nSean waited, alone, in space.\n\nPerhaps it was bravery, or perhaps he didn\u0027t understand the question, but Jebediah didn\u0027t hesitate to accept their most important mission so far - to save the stranded Kerbal, Seanemone, from (inexplicable) orbit. His family\u0027s eyes and hopes were on us. Our organisation - with its dodgy facilities and well-meaning (albeit stupid) employees - had barely skimmed the surface of space; this would be our greatest challenge yet.\n\nTop scientists and engineers collaborated to construct our flagship craft: *\u0027RESCUE 1\u0027*. Courageous Jeb was catapaulted into orbit, [assuring everyone that he \u0022got this\u0022 and that he \u0022knew what he was doing\u0022](http://i.imgur.com/Dq5aBCS.jpg). Alas it was all bravado, and, after failing to rendezvous, Jeb was forced to re-enter amidst much embarrassment and shame.\n\nSean waited, alone, in space.\n\n*\u0027RESCUE 2\u0027*. After a near-disastrous launch (thanks to the engineers\u0027 \u0022great tweaks\u0022) Jeb once again found himself in orbit, battling gravity and his limited understanding of orbital mechanics. His bravado muted, this time he directed his attention fully to the task of saving Sean. So fully, unfortunately, that he wasn\u0027t paying attention to where his elbows were, and - ***BOOM!*** - he accidentally progressed to the rocket\u0027s next stage. The stage where the command pod separated from the engines. *\u0022Uh Oh\u0022*. [He was adrift.](http://i.imgur.com/cJKq2Di.jpg)\n\nSean waited, alone, in space. Jeb understood how he felt.\n\nBack at home, the stricken engineers clamoured to construct *\u0027RESCUE 3\u0027*, and there were no shortage of volunteers - none remaining even knew how to fly a rocket but they\u0027d be damned if that would stop them. Yet doubts grew - are we insane? Is it right to send more Kerbals to their potential doom? Is this moral?\n\n[Sean gazed into the increasingly familiar black. A speck was taunting him again, trying to tease hope into consciousness](http://i.imgur.com/1jLCRgh.jpg). He wouldn\u0027t let it. It weaved back and forth, here and there, smaller and greater; like a stalking mosquito. He wished he could hear its buzz - he would let it come close and drink if only to break the damnable silence. This one\u0027s persistence began to frustrate him - how far had dehydration gone?\n\nThe speck grew closer. Could it be? Surely not. It grew closer still. He blinked in disbelief, and fired up the jetpack with trepidation - his training hadn\u0027t covered this. If he ran out of fuel... it didn\u0027t bear thinking about. Fumbling with the controls, Sean zig-zagged erratically towards the speck [until, miraculously, he was alongside the craft](http://i.imgur.com/xwyAnC3.jpg). With bated breath - still distrusting his senses - he opened the hatch and clamboured in.\n\nCheers erupted from the command centre, and then from all the Kerbals watching at home. He was aboard! Seanemone was aboard! They had done it! *\u0027RESCUE 3\u0027*, despite the pilot\u0027s inexperience, [had found the lost kerbal and was heading home](http://i.imgur.com/pFEVIkv.jpg). But, for all the celebrations, it was a hollow victory... we had left someone behind.\n\n[Jeb waited, alone, in space](http://i.imgur.com/bcOSPNR.jpg). Sean understood how he felt.\n\n*\u0022Get me back UP THERE!\u0022* he yelled at [Mortimer, the head of Finance; and Linus, the Science boffin](http://i.imgur.com/UDDGfNI.jpg); but it was no good. Even Sean had to concede that they were right - a rescue mission just wasn\u0027t feasible. They were broke. Almost bankrupt, in fact - the rescue attempts had bled them dry. Worse still, they didn\u0027t have the technology to get Jebediah home; to even attempt a rescue would first require a huge investment in their facilities. Where would the money come from?\n\nA radical new idea was proposed - what if the craft didn\u0027t explode every time? What if we made a plane that could land *without* exploding? No-one much liked the sound of that, but desperate times call for desperate measures. The road was rough; we flirted with bankruptcy for weeks as prototype after prototype crashed into the ground - it quickly became clear that no-one knew anything about planes. Sean piloted every test flight they would let him, nearly costing him his life on multiple occasions, but nothing could break his resolve. He had to believe they would get it right eventually - they just had to.\n\nPerseverance paid off: [the plane *\u0027BRAVERY\u0027* was born](http://i.imgur.com/rump6qS.jpg). We entered a time of prosperity - dozens of contracts were completed in record time, and none of the accidents were even fatal! New facilities gleamed proudly in the morning sun. Scientists did sciencey stuff. Finally, at long last, work began in earnest on a brand new space craft. Eyes started to look to the sky again... was he still alive?\n\nJeb waited, alone, in space. Sean gripped the seatbelts. He felt the familiar rumble of the engines. It was time.\n\n**Edited \u003Ctime datetime=\u00222015-03-17T12:49:49Z\u0022 title=\u002203/17/2015 12:49  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 17, 2015\u003C/time\u003E by TheHolyChicken**"},{"CreatedByName":"TheHolyChicken","CreatedById":139582,"CreatedDateTime":"2015-03-17T12:00:45Z","Content":"These were my genuine experiences with KSP\u0027s career mode so far, expanded and fleshed out into something I hope you enjoyed reading. There is also an alternative version of these events, though - one where we had saves available to us:\n\n*\u0022Woops I screwed up lol, F9\u0022*.\n\nNone of it would have happened. The failure of the first craft, the disaster of the second craft, the abandonment of Jeb in orbit, the rescue and near-bankruptcy, the subsequent march into aerospace and financial turnaround. All blinked out of existence by a revert launch, or a quickload. If you\u0027re playing KSP\u0027s career mode with saves, I\u0027d urge you to try without!\n\nI\u0027m gonna go and see if Sean and I can go rescue Jeb from his plight now, and then perhaps we\u0027ll try to get to the Mun? Happy kerbaling everyone, and GL for your future endeavours ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n**Edited \u003Ctime datetime=\u00222015-03-17T12:52:37Z\u0022 title=\u002203/17/2015 12:52  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 17, 2015\u003C/time\u003E by TheHolyChicken**"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2015-03-17T12:20:00Z","Content":"Congratulations on losing Jeb ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif) I\u0027m sure he\u0027ll find his way back somehow. Yes, playing with things for keeps is more... interesting. It certainly makes things last longer... in a way. Well, the ships don\u0027t, but the game does ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nNicely done on the scripting, but you know you can insert imgur pics directly into the post even without those \u0027tiled\u0027 pages? Go to the album page, hit the \u0027edit descriptions\u0027 tag, then on the pic you want you can left click to enlarge, then right click to copy the URL. Then it\u0027s just ![... http etc...](...%20http%20etc...) and it\u0027s in the post. Just in case you weren\u0027t already aware of that and were doing what you had above to avoid spoiling the flow of your writing ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"TheHolyChicken","CreatedById":139582,"CreatedDateTime":"2015-03-17T12:48:38Z","Content":"\u003E \n\u003E Just in case you weren\u0027t already aware of that and were doing what you had above to avoid spoiling the flow of your writing ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThanks for the friendly help. I was indeed using hyperlinks instead of embedded images to avoid spoiling the flow of the writing - I wrote the story first, then embellished it using the screenshots I had taken along the way. I was happy with the text and didn\u0027t really want big images intruding mid-sentence, which would kind of require re-writing a bunch of it. Unfortunately, I suppose this way means it\u0027s less visually interesting, and I\u0027m forcing people to click a bunch of links instead of being able to just passively read/look. Let\u0027s change one to an image to grab some attention! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2015-03-17T21:01:25Z","Content":"I think that is a good touch. The only other way would be to do tiny little thumbnails... which probably would also spoil the flow a bit, and also be awkward to work out anyway. \\*shrugs\\*\n\nAll I can say is I like the style and leave it at that ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"}]}