{"TopicId":113974,"ForumId":39,"TopicTitle":"Whispers of the Kraken (Epilogue: Revelations of the Kraken)","CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-06-24T11:23:33Z","PageNum":32,"Articles":[{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2017-01-22T21:22:57Z","Content":"\u003E \n\u003E \n\u003E On Saturday, January 21, 2017 at 7:56 PM, vsully said:\n\u003E \n\u003E \n\u003E Ew, a tooth-monster. Is that a reference to Resident Evil? Also, were any of the songs references? If so, I missed them all ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022) References aside, great chapter, as always!\n\u003E \n\nSounded like something straigh outta dungeon dimensions. Except those teeth were good for hurting the victim more than their owner."},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2017-01-25T07:07:28Z","Content":"So, subject to change without notice, I present the Official Unofficial Nonmotion-Literature Soundtrack ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)\n\nRunning time: flarp if I know anymore, I added to it. ![\u003C_\u003C](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_dry.png \u0022\u003C_\u003C\u0022)\n\n1. National Anthem of the Ussari Union  \n(National Anthem of the USSR)\n\n2. Traditional Ussari Naval Hymn  \n(Hymn to Red October - Basil Poledouris)\n\n3. Winds of Change - Solpugids   \n(Scorpions)\n\n4. Traditional Patriotic March (doubletime extended version)  \n(John Williams - does this *really* need an explanation??)\n\n5. Why Don\u0027t You Do Right? - Lolli Kerman  \n(Jaclyn Haydamacha)\n\n6. Ballrom Blitz - The Sweet\n\n7. Do You Wanna Build A - *\\*thump\\* \\*thud\\** NO!  \n(Kristen Anderson-Lopez/Robert Lopez)\n\n8. Rock You Like a Hurricane - Burdous Kerman  \n(Scorpions)\n\n9. Bouncy Modern Pop Song Based on Inscription Found On Old Statue Plinth - Unknown Foreign Boy Band  \n(Dragostea Din Tei - O-Zone [The Numa Numa song])\n\n10. Hello Mah Baby - Random Frog  \n(Walk quickly, protect face)\n\n11. Valentina\u0027s Pulse  \n(Stayin\u0027 Alive - Three Guys Just Kicked in the Jimmies)\n\n12. I\u0027d Do Anything for Love (But I Won\u0027t Do That) - Random Technician/Lolli Kerman  \n(Eddie)\n\n13. I Will Survive - Jerdous Kerman  \n(Gloria Gaynor)\n\n14. Gimmie Some Lovin\u0027 - Spencer Davis Group\n\n15. Iron Eagle (Never Say Die) - King Kobra\n\n16. Winds of Change (Reprise) - Valentina Kerman  \n(Scorpions in *really* bad Russian)\n\n17. Random Triumphant Anthem from out of Nowhere  \n(Top Gun Anthem - Harold Faltermeyer)\n\n18. Anna\u0027s Lullaby - Instrumental Extended  \n(Far Over the Misty Mountains Cold - Heather Scott/STL Ocarina)\n\n19. Paint it, Black - The Rolling Stones\n\n20. Fortunate Son - Creedence Clearwater Revival\n\n21. War - Edwin Starr\n\n22. Ring of Fire - Johnny Cash\n\n23. Sympathy for the Devil - The Rolling Stones\n\n24. We Gotta Get Out of this Place - The Animals\n\n25: Don\u0027t Fear the Reaper - Blue Oyster Cult\n\n26: The Sound of Silence - Disturbed  \n(Originally Simon \u0026 Garfunkel)\n\n27: Magic Carpet Ride - Steppenwolf\n\n28: Imperial Requiem  \n\n(Nasicaä Reqium - Joe Hisaishi/Kaze no Tani no Nausicaä)\n\n... And now to await the chorus of, \u0022wait, where was *that??*\u0022 ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)\n\nQuite the list here, including possibly the *best* music video ever, *and* probably the *worst* music video ever. Probably missed a couple too. Presented below in a convenient YouTube playlist.\n\nNow, if only I could get John Williams to compose a fittingly somber closing theme... \n\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLwNfxFdjMWEgSLgdJ1JOgnRGlInsfwCJd\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\n**Edited \u003Ctime datetime=\u00222017-05-12T04:08:08Z\u0022 title=\u002205/12/2017 04:08  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 12, 2017\u003C/time\u003E by CatastrophicFailure**"},{"CreatedByName":"lodger","CreatedById":126565,"CreatedDateTime":"2017-01-25T07:53:41Z","Content":"\u003E \n\u003E \n\u003E 45 minutes ago, CatastrophicFailure said:\n\u003E \n\u003E \n\u003E 9. Bouncy Modern Pop Song Based on Inscription Found On Old Statue Plinth - Unknown Foreign Boy Band  \n\u003E (**Dragostea Din Tei - O-Zone [The Numa Numa song]**)\n\u003E \n\nOuch! That one hurt!!"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-01-25T13:03:48Z","Content":"What a great idea! Managed to match *most* of them up to a point in the story (even No. 6 ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) ) - which just gives me an excuse to re-read it all and do a more thorough job!\n\nSeriously tempted to do something similar for *First Flight -* but not until the next chapter is finished. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2017-01-26T07:24:19Z","Content":"\u003E \n\u003E \n\u003E 18 hours ago, KSK said:\n\u003E \n\u003E \n\u003E What a great idea! Managed to match *most* of them up to a point in the story (even No. 6 ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) ) - which just gives me an excuse to re-read it all and do a more thorough job!\n\u003E \n\nPlz excuse all the cringe-worthy typos I\u0027ve missed, of the ones I\u0027ve found are any indication. ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif \u0022:blush:\u0022)\n\n\u003E \n\u003E \n\u003E 18 hours ago, KSK said:\n\u003E \n\u003E \n\u003E Seriously tempted to do something similar for *First Flight -* but not until the next chapter is finished. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\nYou should definitely do that. There\u0027s something very meta about the written word having a soundtrack of videos. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)"},{"CreatedByName":"vsully","CreatedById":129549,"CreatedDateTime":"2017-01-26T09:53:37Z","Content":"Aaaaaaand the only song I recognized out of the list was Paint It Black. And the Star Wars music. Still, a cool list. But just where in the story does the Frozen music go?\n\n![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif \u0022:huh:\u0022)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2017-01-28T06:23:22Z","Content":"**Chapter 94: Down the Smeerp Hole**\n\nThe jungle just seemed to drop away. Two, maybe three hundred meters *straight down*. The Converter seemed to drop, too, hitting an eddy of turbulence no doubt kicked up by the sheer face of the cliff wall. Below, stunted trees and other vegetation sprouted from between enormous, ragged boulders. The far edge of the depression, rising back up in a wall of pale stone, looked several kilometers away. Overhead, an enormous cloud lingered, despite the otherwise clear day. The formation turned parallel to the cliff face, descending slowly. \n\nValentina stared in awe for a long time, and had to will her mouth into motion, \u0022this... this is volcanic caldera, yes?\u0022\n\nReginald grinned... and wiped, \u0022close, you\u0027re on the right track, really. Welcome to the site of the largest prompt-critical excursion the world has ever seen.\u0022\n\nShe gaped at him, *\u0022a nuclear explosion?!\u0022*\n\n\u0022Impressive, isn\u0027t it?\u0022\n\n\u0022How... how does no one know of this? How can this even *be?*\u0022 she said, turning back to the open doorway. \n\n\u0022Well, it happened in Cerima, for one. And it was a very long time ago. The world had... other concerns.\u0022\n\n\u0022How long?\u0022\n\n\u0022A few hundred years. I\u0027m afraid that\u0027s as precise as our researchers can date it. The rock strata are badly pulverized and even the carbon signatures have been metamorphosed by the radiation. The best we can place it is somewhere around the time of the Ceriman Crisis that heralded the fall of the Ussari Empire.\u0022\n\nValentina shook her head, trying to make sense of it all, \u0022that is...  not possible. The technology...\u0022\n\n\u0022Still doesn\u0027t exist,\u0022 Reginald\u0027s grin grew wider, and he\u0027d even forgotten to wipe, \u0022This was a *natural* event.\u0022 He turned back toward the doorway, speaking with the same fervor she\u0027d seen not long ago, \u0022the geology in this area is absolutely unique. There was a massive blutonium deposit a few kilometers down. Exceptionally concentrated to begin with. Much of it is still there, it\u0027s provided a handy fuel source for us. Below that was an even bigger deposit of heavy hydrocarbons, ancient asphalt and the like, all capped off by a thick layer sandstone.\u0022\n\nThe Converter leveled off, still flying a slowly circling course next to the wall of the depression, \u0022that allowed water to percolate down from the surface and infiltrate the blutonium ore. Once there was enough, the water began to act as a neutron modulator, reflecting free neutrons from naturally decaying blutonium^486^ back into the mass and starting more fission events, essentially creating a natural atomic chain-reaction. Didn\u0027t get very hot, only a few hundred degrees, but enough to boil the water away until the reaction ceased. The material cooled, the water eventually returned, and cycle began all over again on the order of every few hours. \n\n\u0022Now as I\u0027m sure you know, what with your engineering background, that blutonium oxide becomes highly soluble when exposed to high pressure steam. This caused a large portion of the vein to slowly dissolve, leaving behind the heavier fission products —uranium, plutonium, kleptogartium, etc— while the blutonium migrated upwards until it deposited and crystallized. This all went on for millennia, forming a lens-shaped chamber alternately filled with water and steam, and lined with nearly pure blutonium on the \u0027roof\u0027 and all sorts of fissile materials on the \u0027floor.\u0027 Eventually the water table changed, and it all drained away, leaving the cavern unsupported. It was only a matter of time until it collapsed.\u0022\n\nIt took Valentina a few blank-faced moments to truly appreciate the implications. \n\nReginald didn\u0027t wait, \u0022several tons of mildly enriched blutonium, backed by several *thousand* tons of rock, slammed into several *more* tons of fissile material, all sitting on a bed of extremely dense hydrocarbons. Hydrocarbons are *also* an effective neutron modulator, I\u0027m sure you know. What followed was a very interestingly non-linear feedback loop. Our scientists estimate the blast was on the order of several gigatons.\u0022\n\n\u0022How... how big...\u0022 she managed, pointing off towards the far rim.\n\n\u0022Two point eight kilometers, on average. It\u0027s not quite a perfect circle. The reaction was *almost* entirely contained. It vaporized several cubic kilometers of rock instantly, leaving a large steam-filled void below ground that collapsed into this subsidence crater. \n\n\u0022The surrounding wall is absolutely sheer and unbroken, and this incredible microcosm is the result. Plants can get down here easily enough, even if they don\u0027t grow well since the soil has yet to reestablish itself. Birds, of course, flying things, even small creatures can survive the trip down, though those can never leave. The larger fauna, however...\u0022\n\nHe didn\u0027t need to expound. As they flew low over the scrub-jungle, just beyond the wide piles of scree at the base of the wall cliffs, she could see the scattered, bleached bones of enormous things, again with more determination than brainpower. Even all those teeth couldn\u0027t help them. \n\n\u0022The locals won\u0027t come within 50 kilometers of the place,\u0022 Reginald went on, his face gleaming with more than just sweat, \u0022they think it\u0027s cursed. Or haunted. Or that anyone who *does* come never returns. We do our best to maintain these fallacies, of course.\u0022 He pointed up to the roiling cloud above, \u0022the unique topography creates this eternal cloud. The sun breaks through, occasionally, but satellites can\u0027t see what\u0027s here. The residual radiation scrambles infrared sensors, too. And *no one* would be foolish enough to try to come on foot. It\u0027s the perfect location, a great big hole on the map that no one really cares to fill in.\u0022\n\nAbout this time, the radio flashed with static, and a voice with just a slight Krünian accent came on, \u0022victor one-niner, ident complete, you are cleared inbound for landing on pad three.\u0022 There was no acknowledgement, the pilot simply turned away from the rim, toward the center of the crater. As the wing dipped, Valentina caught a slight glint of metal, buried down in the undergrowth. She came to the cold realization that this odd little flight pattern hadn\u0027t been a sightseeing circuit at all. She knew she couldn\u0027t see them, radar receivers, infrared detectors, laser designators... not with all this cover. Or the batteries themselves. She didn\u0027t want to think about the details, but suspected any aircraft blundering into the area might suddenly \u0022disappear\u0022 at the hands of \u0022Cerimans.\u0022\n\nThe Converter skimmed out over the trees to the middle of the crater, and then... just sort of... stopped. It hovered there for a moment before descending straight down.\n\n\u0022Are... are we going to land in the jungle?\u0022 Valentina asked with apprehension. Below, she could see nothing but intertwined greenery, certainly no space for an aircraft. \n\n\u0022Just watch,\u0022 Reginald was practically as giddy as a schoolboy, now. A very large, very round schoolboy... or perhaps several schoolboys in an ill fitting suit. And a small horse.\n\nRight as the wheels were about to disappear into the brush, it seemed to fall away. Not like their original drop over the wall, now the ground was *actually moving*, swinging down and away as they descended into it. As they passed the point where the ground *should* have been, Valentina saw that it wasn\u0027t ground at all, the network of vines and twisted trees was supported from below by an airy metal truss-work. No, not the ground, but an enormous *door*. A pair of doors. \n\nThe Converter continued alone into a darkness deeper than anything Valentina had seen before. At least on this planet. The changing pitch of the engines announced they had entered some sort of cavern; there were floodlights on the trusses overhead as the doors swung closed, but it was as if something swallowing the light, consuming it. \n\nAcross the cabin, Reginald looked near to bursting, sweat running off his face unheeded, \u0022unsettling, isn\u0027t it?\u0022\n\nAll Valentina could manage was a nod.\n\n\u0022Always is, the first time seeing it. The walls are solid obsidian, covered in a layer of carbon graphene. It\u0027s *incredibly* strong. Took us a couple of years just to figure out how to tunnel through it. Easily shrugs off repeated rocket launches, with proper exhaust venting.\u0022\n\nShe wasn\u0027t sure when the headache had come back, or indeed if it had ever left. The fat, sweaty Kerb was practically beside himself with glee. He must enjoy seeing the shock on every new face he brought in like this. \n\nHe continued without slowing, \u0022as I said, the initial blast was *almost* entirely contained. There was a high-pressure vent of condensing rock through this space, like the rebounding jet of fluid when you drop a big rock into water. The sudden release of pressure caused molten rock to solidify nearly instantly, leaving this half-kilometer wide channel, and...\u0022\n\nHis voice drained away. Valentina had felt the Converter shift, going into a slow, sinking spiral. Now, she could see what was below, lit up by a legion of floodlights. It was an odd sort of dichotomy; her brain put the pieces together at once, yet at the same time refused to accept any of it. This... this was a missile silo.\n\nThe launch towers were in the center. Not one, but *three*, arranged back-to-back in a triangle surrounding a pillar of concrete. As their craft neared, circling, she could see one tower covered in dirt and soot from a recent launch. The next held an unmistakable rocket — a KSA Colossus-class lifter. The third was empty, too, but she recognized the hardware. Only one launch vehicle used that odd arrangement of clamps and umbilicals. This pad was designed to support the enormous, asymmetrical *Urugan*.\n\nShe didn\u0027t need Reginald\u0027s constant droning to put together the rest of the details. Rockets were assembled horizontally in yawning bunkers drilled into the walls. She could see one just there, half hidden by partially closed blast doors. Beyond those bunkers must be a warren of tunnels and support stations. Once assembled, the vehicles were rolled out on rails and erected on the pads. Giant concrete shields that looked like protruding teeth could then slid in from side tracks, covering each pad by itself and protecting it while another launched. \n\nIt was incredible... the whole place felt surreal... then she remembered the hidden weapons in the jungle above, and it felt all *too* real. A facility like this could support a launch every few days, maybe every few *hours*. \n\nBut... to do that, there should be a flurry of activity down here. Where *was* everyone?\n\nShe turned to Reginald to ask, only to realize that at some point, he\u0027d stopped talking. He\u0027d gone deathly pale again. She followed his eyes toward the pad they were descending to, and *here* there were people. *Armed* people. Valentina felt herself lighten a few shades as well. \n\nDid... did they know? Had she been compromised? Or had this whole thing been a setup from the start? Looking to the others in the plane, they seemed as confused as she, yet the pilot never deviated from his course. The Converter set down with a slight *thump*, the engines immediately spooling down. \n\nWell, whatever is coming, better to face it head on. Valentina hopped out of the aircraft. A prudent distance away was a group of uniformed Kerbals. There were no torn shirts or big silly rifles here. No, these were *very* serious-looking Kerbs with *very* serious-looking rifles. A tall one with high-and-tight cropped grey hair and a face that looked chiseled from stone stalked up to her... and gave her the most precise salute she had ever seen. \n\n\u0022Captain Kermanova, I presume?\u0022 he spoke with a frenetic Kleptogarti accent that made it sound like he was shouting even when he wasn\u0027t. Caught more than a little off guard, Valentina returned the salute but couldn\u0027t quite get a response out. He didn\u0027t seem to notice.\n\n\u0022Welcome to the Hole, ma\u0027am,\u0022 he said with *exactly* the proper amount of respect for addressing an officer of equal rank from another service, \u0022Colonel Miles Keritch, Chief of Security. This operation is greatly in need of just the kind of discipline and professionalism I am *sure* you will bring.\u0022 Then he rounded on Reginald, who had waddled over at some point and just opened his mouth to speak, \u0022and *you*... the *Boss* wants to see you.\u0022 Reginald closed his mouth very quickly. *Then* the Colonel turned to Igor, who had also wandered over, \u0022and *you*...\u0022 confusion bloomed on his face, the kind of confusion that comes when one is not accustomed to being confused, \u0022I wasn\u0027t expecting you. I am not sure what to do with you yet, but I *will* get back to you on that shortly.\u0022\n\nIgor rumbled. \n\n\u0022Colonel, what is the meaning of this?\u0022 Reginald broke in, \u0022where *is* everyone?\u0022\n\n\u0022This facility was placed on a Level-2 *Priority* lockdown as of fourteen hundred hours this afternoon,\u0022 he snapped back.\n\nReginald\u0027s color drained away once more, \u0022oh... oh my... did... did something get *in?*\u0022 He gasped, clapping a hand to his mouth. His voice went up several octaves, \u0022did... did something get... ***out?!\u0022***\n\n\u0022I am not at liberty to say,\u0022 the Colonel boomed, then leaned in close, \u0022I have already registered my reservations on the situation. This is *exactly* the kind of out-*standing* clusterplotz you will get from trying to weaponize RatSquirrelFish.\u0022 \n\nReginald Montgomery Keswick Kerman the Third rapidly turned a whiter shade of pale.\n\nThe Colonel left him to drip and turned the group of Cerimans. Underwear had just removed the rattling bin from the plane and was approaching with a hopeful look. Keritch shook his head, and addressed Bill, who made that little gesture on his forehead again, \u0022I\u0027m afraid that will have to wait, Sergeant. I want this aircraft wheels-up in five minutes, and get your butts back to the IP,\u0022 he glanced to the pilot, \u0022pass it on.\u0022\n\nBill didn\u0027t have to. Again to his credit, the pilot hopped right back in his seat and began throwing switches. Bill barked some orders and herded the other two back into the Converter. Underwear looked truly crestfallen. \n\n\u0022Is... there a problem, Colonel?\u0022 Valentina asked. \n\n\u0022Not at all ma\u0027am, I assure you I have the situation well under control. But right now the safest place for you to be is in your quarters. Corporal!\u0022 One of the other very serious-looking Kerbals strode forward and saluted, \u0022Corporal Hickey, here, will escort you through the lower utility tunnels and warehouse to the dormitories.\u0022\n\nIgor moved closer, and rumbled. Did... it seem like his vocal prowess had gotten even *worse*, lately?\n\nThe Colonel looked him up and down for a moment, \u0022now, son, you look like a Kerb who is trained and experienced at extracting high-value targets from unsat situations, am I right?\u0022 Igor\u0027s eye... bulges went up. \u0022Out-*standing*. You are *exactly* the kind of heavy support I need to get this dripping waste of chow up to the command deck,\u0022 he stuck a thumb at Reginald. \n\nIgor rumbled again, and stepped closer to Valentina. \n\nKeritch\u0027s eyes narrowed just slightly, \u0022now, soldier, I understand you probably have orders, and so do I. Right now I am the ranking officer at this facility and there is a certain martial precedent in play, here.\u0022\n\n*Not this again...* Valentina placed a hand on Igor\u0027s trunk-like arm, \u0022I will be fine. Best to do as he says,\u0022 her eyes flicked to the Colonel, \u0022we *are* all on the same team, after all.\u0022\n\nHe grinned a perfect set of teeth, \u0022out-*standing*. Now, I am not a Kerb opposed to compromise,\u0022 then he unclipped a huge holstered pistol from his belt and handed it to her, \u0022I trust you are familiar with one of these?\u0022\n\n*Um...*\n\nWell... teeeeeechnically. She qualified on the range when she *had* to, they always used to keep one in the survival kit in the capsule, but...\n\n\u0022No, I can see that you are *not*,\u0022 his eyes twitched in what must pass for a roll, and unholstered the monstrous thing to demonstrate, \u0022grip safety... trigger safety... point-and-click! You\u0027ve got ten on deck and one in the pipe, and for flarp\u0027s sake *keep your booger hook **off** the bang switch* until you see the whites of their beady little eyes!\u0022\n\nValentina took the thing gingerly, afraid it might bite.\n\n\u0022Out-standing!\u0022 the Colonel swung around to his squad, \u0022detail! Escort formation!\u0022\n\n\u0022**YES, SIR!** huphuphuphuphuphuphuphuphuphup\u0022\n\n\u0022Let\u0027s get this fat tub of lard up to Command, I want to be done in time for supper!\u0022\n\n**\u0022YES, SIR!\u0022**\n\nThe group clomped off through an open blast door, with Reginald in the center. For a highly respected liaison, he seemed more like a... prisoner. Or worse.\n\nCorporal Hickey saluted, and nodded down a different corridor, \u0022after you, ma\u0027am,\u0022 then shouldered his rifle.\n\nHmm. Reginald might not be the only one. Nothing to do for it now, but go forward. Her senses tight, Valentina walked on, followed by her guard. Just before they disappeared through another blast door, she heard one last track booming from the Converter as the engines came up...\n\n*All our times have come...Here, but now they\u0027re gone...*\n\n...while unseen in the shadows, a dark figure watched. \n\n**Edited \u003Ctime datetime=\u00222017-01-28T06:33:13Z\u0022 title=\u002201/28/2017 06:33  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 28, 2017\u003C/time\u003E by CatastrophicFailure**"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-01-28T07:00:35Z","Content":"Out-standing!\n\nNow that, good kerbals, is how you do a secret base! Complete with decorative lampshades:\n\n\u0022Now as I\u0027m sure you know, what with your engineering background...\u0022\n\nToo bad Val isn\u0027t a professor. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022) And why do I get the feeling that somebody is going to be mildly and humorously insubordinate to Keritch at some point and be invited to look into his eye...\n\nEdit. Oh - and 10/10 for the nuclear physics digression. I approve!\n\n**Edited \u003Ctime datetime=\u00222017-01-28T07:02:49Z\u0022 title=\u002201/28/2017 07:02  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 28, 2017\u003C/time\u003E by KSK**"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2017-01-28T07:31:27Z","Content":"\u003E \n\u003E \n\u003E On 1/26/2017 at 1:53 AM, vsully said:\n\u003E \n\u003E \n\u003E Aaaaaaand the only song I recognized out of the list was Paint It Black. And the Star Wars music. Still, a cool list. But just where in the story does the Frozen music go?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif \u0022:huh:\u0022)\n\u003E \n\n[It didn\u0027t last long](https://forum.kerbalspaceprogram.com/index.php?/topic/113974-whispers-of-the-kraken-chapter-94-down-the-smeerp-hole/\u0026do=findComment\u0026comment=2492966)... thankfully ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)\n\nI\u0027ve added two more to the Soundtrack post, and stuck it to the Contents page. Study hard, and you too will reach... laitinman ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022:wink:\u0022)\n\n\u003E \n\u003E \n\u003E 31 minutes ago, KSK said:\n\u003E \n\u003E \n\u003E Edit. Oh - and 10/10 for the nuclear physics digression. I approve!\n\u003E \n\n...so I was thinking, \u0022Now how the heck do I hide an entire spaceport in a maybe-almost-plausible manner?\u0022 Then I got to reading about [natural nuclear reactors](https://en.wikipedia.org/wiki/Natural_nuclear_fission_reactor), and just like splitting an atomic nucleus, one thing led to another... ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2017-01-28T12:53:50Z","Content":"\u003E \n\u003E \n\u003E 5 hours ago, CatastrophicFailure said:\n\u003E \n\u003E \n\u003E trying to weaponize RatSquirrelFish\n\u003E \n\n![scary_names.png](http://imgs.xkcd.com/comics/scary_names.png)\n\nThis thing is at the top right.\n\n**Edited \u003Ctime datetime=\u00222017-01-28T12:54:09Z\u0022 title=\u002201/28/2017 12:54  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 28, 2017\u003C/time\u003E by KAL 9000**"},{"CreatedByName":"vsully","CreatedById":129549,"CreatedDateTime":"2017-01-28T14:26:39Z","Content":"Dun dun, the dark figure in the shadows cliche. Out-standing! Off to wait for the next chapter! \u0022huphuphuphuphuphuphuphuphuphup\u0022"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2017-01-28T15:32:37Z","Content":"Wow, this is like \u0022Alien visits Tunguska\u0022  ![:0.0:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif \u0022:0.0:\u0022)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2017-01-31T04:21:57Z","Content":"\u003E \n\u003E \n\u003E On 1/28/2017 at 7:32 AM, Just Jim said:\n\u003E \n\u003E \n\u003E Wow, this is like \u0022Alien visits Tunguska\u0022  ![:0.0:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif \u0022:0.0:\u0022)\n\u003E \n\nGotta nuke the site from orbit, only way to be sure ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022:wink:\u0022)\n\nNext chapter flowed like buttuh, should be up later tonight. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2017-01-31T05:41:13Z","Content":"**Chapter 95: Hello Darkness, My Old Friend**\n\nDown they went. And down, and down, and down some more. Down, down, down, in a burning—\n\n*PЦTIЙ on these foreigners and their obnoxiously catchy music!*\n\nAnyway, they went down. In a disturbingly large freight elevator bigger than most flats in Kermangrad. The walls had passed from smooth obsidian to jumbled, congealed rocks, to something that was quite beyond Valentina\u0027s rather limited knowledge of geology. She was certain that at any moment she would start seeing sewer mutants, or dinosaurs, or maybe infernal hellfire. Jimmy Hoffa waved. \n\n\u0022How deep does this go?\u0022 she asked Corporal Hickey.\n\n\u0022I am not at liberty to say, ma\u0027am,\u0022 was the answer. \n\n\u0022I see.\u0022 They descended in silence a while longer, the only sound the subtle noise of the motors, \u0022is it much further to the dormitories?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n*Hmm*. She glanced at him. His face was as blank as a statue, \u0022you must be very good at poker.\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\nThe corners of her mouth curled into a frown. After another long stretch she tried again, \u0022so... Hickey... that is an unusual name, is it Dachlandish?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am,\u0022 but this time, the slightest hint of color touched his cheeks. \n\n*Oh, so that\u0027s how it is, is it?*\n\nThe elevator finally bumped to a halt, and the corporal slid the steel mesh door up, \u0022after you, ma\u0027am.\u0022\n\n\u0022Oh, so you *are* at liberty to say *that*?\u0022 Valentina walked on ahead into the expected maze of seemingly random corridors lined with pipes of all sizes, some blowing billowy clouds of steam. Typical. Would it really be so far over the budget to put in some sheetrock, cheap wood paneling, *anything?* The shadows waited in anticipation. \n\nShe put a hand to her face, \u0022is there anything else you *are* at liberty to say?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am,\u0022 his boots clopped along behind on the damp concrete floor. \n\nOh, PЦTIЙS ears! \u0022if I guessed something you *were* at liberty to say, would you say?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022Then what is the airspeed velocity of an unladen swallow?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022How about the ground speed?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022What is the meaning of life?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022How much wood would a woodchuck chuck?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022What *is* a woodchuck anyway, is it something like a groundhog?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022Did he see his shadow?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022If a train leaves Kermangrad traveling at one hundred kilometers per hour, and another leaves Kerbelsk traveling at eighty kilometers per hour in the opposite direction, how big of a bang will they make when they meet?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022You must be very fun at parties.\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022Who Let the Dogs Out?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022Do You Know the Way to San Jose?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022War (What is it Good For?)\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022Have You Ever Seen the Rain?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022Should I Stay or Should I Go?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022What\u0027s the Frequency, Kenneth?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\nShe rounded on him. He might have been an automaton, for all the feeling he showed, \u0022how about if I just gave you a big wet sloppy kiss, hmm!?\u0022\n\n\u0022I am not at liberty to say, ma\u0027am.\u0022\n\n\u0022Gah!\u0022 cried Valentina. She turned and started walking again, \u0022you really are quite impossible, do you know that?\u0022\n\nSilence.\n\n\u0022Well, *do* you?\u0022\n\nNothing. \n\n\u0022Oh for PЦTIЙS sake, is the idea of kissing me really *that* terrible?\u0022\n\nA distant dripping sound. \n\n\u0022What is the matter,\u0022 she turned, \u0022cat got your—?\u0022 and just caught sight of the corporal\u0027s boots disappearing as he was dragged into the shadows. She darted over, but was too late. The poor fellow was gone into the maze of tubing and ductwork. The patter of tiny feet on thin metal, and disturbing squishing noises drifted from within. \n\nEyes wide, Valentina backed away, all her senses on overdrive. She drew the pistol... then realized its ridiculousness. She *hated* these things! Sure, they had their uses, she supposed, but... growing up in the taiga, she much preferred a nice, pointy stick that *didn\u0027t*, when used, announce to everything within a couple of kilometers that dinner was served. With a scowl, she tossed the gun away. Now, to—\n\n***BANG!****PING!**PSSSSSSSSHHHHHHHHHHHHHHHH!*\n\nShe flailed helplessly as steam from a rupture line blasted her. The whole world disappeared into a shadowy white mist. When she finally found her way out of it, she was left panting and dripping up against a wall of pipes. She couldn\u0027t hear, could barely see. Had no idea which way was which, anymore. Cautiously, she crept along the metallic path, trying to look in every direction at once. She\u0027d heard about those things, they came at you from out of nowhere, when you least expect—\n\nA hand wrapped around her mouth and dragged Valentina back into the shadows. \n\nShe fought back, or tried to. This specter seemed to know her every move, her every counter. They struggled there in the darkness, thrashing this way and that. She couldn\u0027t even scream! She— \n\nA light clicked on. \n\nValentina threw her arms around her attacker and squeezed with all she had, *\u0022Tercella!\u0022*\n\n\u0022Shhhhhhhh!\u0022 shushed Tercella, \u0022what are you *doing* here!?\u0022 her eyes darted about with apprehension, \u0022this is not a good place...\u0022\n\nValentina planted her hands on her hips, \u0022I could ask you the same thing.\u0022\n\n\u0022I was *reassigned*,\u0022 Tercella said with an eye-roll, \u0022they gave me a simple choice: \u0027disappear\u0027 from the world, and come to a place where I could work with the best minds on the planet, with a virtually unlimited budget, and pursue the engine design theories I have always strived for with the goal of a real, working application.\u0022\n\n\u0022...or what?\u0022 Valentina asked. \n\n\u0022Or just disappear. As the foreigners say, it was offer I could not refuse. What about you?\u0022\n\nCould... could she *trust* Tercella?\n\n*...trust **no one**... especially not me...*\n\n\u0022Erm, more or less the same,\u0022 Valentina managed, \u0022but we have to get to safety, the place is on lockdown.\u0022\n\n\u0022I know, I started it.\u0022\n\n\u0022You... what?\u0022\n\n\u0022Debugging the security mainframe is one of my hobbies,\u0022 Tercella said matter-of-factly, \u0022it was a simple enough thing to initiate a lockdown so I could find you first, and by the time they figure out what has happened it will just look like Ivan\u0027s doing.\u0022\n\n\u0022Ivan?\u0022 Valentina shook her head, \u0022but... there are *things*...\u0022 she glanced to the shadows, \u0022loose...\u0022\n\nTercella rolled her eyes again and gave a little grunt, then counted off on her fingers, \u0022there are no weaponized RatSquirrelFishes here. Or venomous tribbles. Or roid-raging Wookiees. Or xenomorphs on Ritalin, or cyborg whales with lasers, or graboid tapeworms, or Daleks with halitosis,  or red herrings,\u0022 having run out of digits, she added, \u0022and the smeerp is mostly harmless as long as it is fed regularly and kept away from any questing knights errant.\u0022\n\nValentina just blinked.\n\n\u0022Look, this place thrives on misinformation,\u0022 Tercella smirked, \u0022we regularly give dumps of accurate info to the most well-known conspiracy theorists on the planet,\u0022 the smirk widened into a grin, \u0022and the louder they shout about it, the more everyone ignores them. It\u0027s quite brilliant really. *He\u0027s* quite brilliant,\u0022 the grin became a wistful smile.\n\n\u0022He? Who, he?\u0022 Valentina asked, confused.\n\nColor bloomed in the other Kerbelle\u0027s cheeks, \u0022he? Um, er, nothing! No one! Anyway, that\u0027s *how* we keep this place secret.\u0022 Then after a thought, she added, \u0022well, other than the hypersonic guided missiles, jungle full of giant hungry things, mildly psychotic indigenous population, and friendly benevolent dictator next door.\u0022 She smiled brightly. \n\n\u0022So I see,\u0022 Valentina said with a blank look.\n\n\u0022But still,\u0022 apprehension crept into Tercella\u0027s face, \u0022some people here are very strange. Like, *strange* strange, not just different. I am beginning to think something is very wrong here. You need to be careful.\u0022\n\n\u0022I know. It seems odd that they suddenly need a pilot, from what I have been told.\u0022\n\nA very... strange look washed over Tercella, \u0022er, yes. There have been some... irregularities... with the latest revision of the flight software. It is quite revolutionary, but the docking algorithms do not seem to work at all. We are reverting to an older version for the rest of the assembly flights, but the lifeboat is entirely experimental anyway, so the higher ups decided to use it as a testbed for that, too.\u0022\n\n\u0022The... lifeboat?\u0022 Valentina raised an eye... bulge.\n\n\u0022Yes, that\u0027s what you will be flying. Or tagging along with until you are needed,\u0022 Tercella smirked, \u0022there is a very... strange listing on the cargo manifest, but not even I know everything around here.\u0022\n\n\u0022But... the ship is nowhere near completion, yes? Why would it need a lifeboat already?\u0022\n\nTercella\u0027s eyes sparkled just a bit in the dim light, \u0022we are launching the engine components next. Once checked out, short shakedown flights to Minmus or even Duna could come in a few weeks. If all goes well, we will launch with a full crew to Jool before the end of the year. They want one lifeboat docked for a long-term checkout before then.\u0022\n\n*Duna?!* As was becoming tradition, questions stampeded through Valentina\u0027s mind. She was just about to ask one when—\n\n\u0022Attention all personnel, attention all personnel,\u0022 boomed a loudspeaker, \u0022standby to secure from lockdown. Secure will commence in thirty minutes. That is all.\u0022\n\nTercella looked around nervously, \u0022you had better go. I will find you later.\u0022\n\n*Um...*\n\n\u0022What about *him?*\u0022 Valentina jabbed a thumb at where Corporal Hickey was crumbled into a ball off to the side.\n\n\u0022Him? Oh, he will be fine. He will wake up with a *splitting* headache and no memory of me,\u0022 Tercella said brightly, then mumbled with a scowl, \u0022wouldn\u0027t be the *first* time, hmph...\u0022\n\n\u0022What?\u0022\n\n\u0022Nothing,\u0022 she grinned, \u0022I will see that he gets where he needs to be and gets a *new* nickname, too, grumble grumble.\u0022\n\n\u0022Wait, what was that last part?\u0022\n\n\u0022Nothing,\u0022 Tercella grinned, \u0022please take care of yourself, I meant it when I said this is not a good place. Keep your head down, your eyes open, and do not trust *anyone*.\u0022\n\n\u0022Um... how do I get...\u0022\n\n\u0022Go straight *that* way past the second blinky light, then go left. You cannot possibly miss the warehouse, the elevator to the main deck is at the far end. Good luck.\u0022\n\nThey hugged once more before Tercella unceremoniously hiked the unconscious corporal over her shoulder and headed off deeper into the shadows. \n\nValentina followed the corridor down past the second blinky light, then turned left as her friend had said. There certainly was no way to miss the warehouse, it was *enormous*. Possibly bigger than some countries. She walked past row after row of wooden crates stacked as far as she could see. It occurred to her that this would be an ideal place to hide something very important. A an ornate golden box, perhaps, or a maybe special cup, or even—\n\nAll the air was driven out of her lungs as a fist slammed into her guts. The elbow caught her cheek on the rebound, bone crunched, and she was swung around and up against a crate so hard that her head smacked into it with a sharp crack. Stars danced across her vision. \n\nNow an arm pressed up under her chin, choking her. A hand clamped across her mouth, grating her lips against her own teeth. Stars bloomed into blotches and shadows as her vision narrowed. She struggled to focus on a face... she didn\u0027t recognize. \n\n\u0022I\u0027ve been expecting you,\u0022 the face whispered, its lips parting into a horrible grin, \u0022he told me, to tell you, \u0027no more mister nice guy!\u0027\u0022\n\nValentina\u0027s knees gave out, she couldn\u0027t move... couldn\u0027t scream... all she could see was his horrid, merciless eyes...\n\n...his eyes...\n\n...his *eyes*...\n\nThey dissolved into empty pools of nothing.\n\nPanic took her, but her limbs felt rubbery and lifeless. All at once, she *felt it*... that creeping, invading sensation of something *other* slithering across her mind. She couldn\u0027t even thrash before it. It writhed, groped, sent its tendrils out and she knew, she *knew* that this time the madness would come. A tendril found an opening, a tiny, overlooked weakness, forced its way inside... and flooded into her mind... and soul. \n\n*Hello Darkness, my old friend...*\n\n**Edited \u003Ctime datetime=\u00222017-01-31T05:56:08Z\u0022 title=\u002201/31/2017 05:56  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 31, 2017\u003C/time\u003E by CatastrophicFailure**"},{"CreatedByName":"Alpha 360","CreatedById":166007,"CreatedDateTime":"2017-01-31T05:52:50Z","Content":"How long has it been since spaceflight begun? 5 years? 10? Kerbals must be advancing faster than human\u0027s did, because these kerbals are bulding the NERVA nuclear engine, possibly the Dawn, ion engine, probably the Rapier. \u003Cedit\u003E\n\u003C/edit\u003E\n\nOh sorry, they are building a Warp drive, the only thing that can get to Jool in a few weeks.\n\n**Edited \u003Ctime datetime=\u00222017-01-31T07:13:32Z\u0022 title=\u002201/31/2017 07:13  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 31, 2017\u003C/time\u003E by Alpha 360**\n  \n\u0022Kouston, we have several problems, but that doesn\u0027t matter so we want to continue on with the mission.\u0022"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2017-01-31T06:28:59Z","Content":"\u003E \n\u003E \n\u003E 29 minutes ago, Alpha 360 said:\n\u003E \n\u003E \n\u003E How long has it been since spaceflight begun? 5 years? 10? Kerbals must be advancing faster than human\u0027s did, because these kerbals are buling the NERVA nuclear engine, possiblely the Dawn, ion engine, probably the Rapier.\n\u003E \n\nI\u0027m deliberately very vague about time, otherwise the whole thing will rapidly fall apart (or slowly, depending on one\u0027s perception of time...![-_-](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png \u0022-_-\u0022)) I know from the game that started it all that it\u0027s a little over six years from the operational founding of the KSA to abandoning the Münbase... but... are these stock years? 6.4x years? Earth years? It all gets rapidly confusing so you\u0027ll just have to nod and take my word for it. \n\nIt\u0027s been... \u0022a while\u0022 ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)\n\nIn other news, I see that my trusted fake Cyrillic generator no longer exists.    ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif \u0022:mad:\u0022)\n\n*PЦTIЙ.*"},{"CreatedByName":"lodger","CreatedById":126565,"CreatedDateTime":"2017-01-31T10:04:37Z","Content":"\u003E \n\u003E \n\u003E 3 hours ago, CatastrophicFailure said:\n\u003E \n\u003E \n\u003E In other news, I see that my trusted fake Cyrillic generator no longer exists.    ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif \u0022:mad:\u0022)\n\u003E \n\u003E \n\u003E \n\u003E *PЦTIЙ.*\n\u003E \n\n***LANGUAGE!***\n\n**Edited \u003Ctime datetime=\u00222017-01-31T10:04:50Z\u0022 title=\u002201/31/2017 10:04  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 31, 2017\u003C/time\u003E by lodger**"},{"CreatedByName":"vsully","CreatedById":129549,"CreatedDateTime":"2017-01-31T12:01:38Z","Content":"Oh no, Val! But lifeboat... hmm. So maybe Val actually tagged along with Edgas and Chadvey on their flight to Jool. But I thought that already happened in the timeline. So maybe the evil Kraken-kerbs are trying to send another ship and undo what Edgas did? Maybe give The Kraken some band-aids and rubbing alcohol? A bottle of vodka too, for medical purposes?\n\n**Edited \u003Ctime datetime=\u00222017-01-31T12:01:49Z\u0022 title=\u002201/31/2017 12:01  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 31, 2017\u003C/time\u003E by vsully**"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2017-01-31T18:43:16Z","Content":"\u003E \n\u003E \n\u003E 12 hours ago, Alpha 360 said:\n\u003E \n\u003E \n\u003E Oh sorry, they are building a Warp drive, the only thing that can get to Jool in a few weeks.\n\u003E \n\n[http://www.projectrho.com/public_html/rocket/torchships.php](http://www.projectrho.com/public_html/rocket/torchships.php)"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2017-01-31T18:57:24Z","Content":"\u003E \n\u003E \n\u003E 13 hours ago, Alpha 360 said:\n\u003E \n\u003E \n\u003E the only thing that can get to Jool in a few weeks.\n\u003E \n\nWhoops,  missed this...\n\nThe engine is based on a [fission fragment rocket.](https://en.m.wikipedia.org/wiki/Fission-fragment_rocket) With a fusion afterburner. ![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif \u0022:cool:\u0022) There\u0027s some in-universe detail [Here.](https://forum.kerbalspaceprogram.com/index.php?/topic/99151-shadows-of-the-kraken-conclusion-a-memory-of-light/\u0026do=findComment\u0026comment=1795486)\n\n\u003E \n\u003E \n\u003E 8 hours ago, lodger said:\n\u003E \n\u003E \n\u003E ***LANGUAGE!***\n\u003E \n\nNot anymore, apparently. ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif \u0022:mad:\u0022)\n\n\u003E \n\u003E \n\u003E 6 hours ago, vsully said:\n\u003E \n\u003E \n\u003E But I thought that already happened in the timeline\n\u003E \n\nThis is all happening during the 3-year lull in *Shadows*, between abandoning the Münbase and Edgas getting that fateful phone call. \n\n**Edited \u003Ctime datetime=\u00222017-01-31T18:59:46Z\u0022 title=\u002201/31/2017 06:59  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 31, 2017\u003C/time\u003E by CatastrophicFailure**"},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2017-01-31T20:14:51Z","Content":"\u003E \n\u003E \n\u003E 14 hours ago, CatastrophicFailure said:\n\u003E \n\u003E \n\u003E She walked past row after row of wooden crates stacked as far as she could see. It occurred to her that this would be an ideal place to hide something very important. A an ornate golden box, perhaps, or a maybe special cup, or even—\n\u003E \n\nTax reports? I get it now. They think they are involved in or against a conspiracy to release The Kraken, but all that is just an intricate and overly elaborate plot to get a few trinkety artifacts from around the system to the Warehouse. By the Warehouse."},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-02-01T06:16:08Z","Content":"\u003E \n\u003E \n\u003E 9 hours ago, monophonic said:\n\u003E \n\u003E \n\u003E Tax reports? I get it now. They think they are involved in or against a conspiracy to release The Kraken, but all that is just an intricate and overly elaborate plot to get a few trinkety artifacts from around the system to the Warehouse. By the Warehouse.\n\u003E \n\nI was thinking more along the lines of a diadem, maybe a ring or a particularly revealing diary. Beware of the snake though. Never know what you can find pottering around in a warehouse. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2017-02-06T16:33:46Z","Content":"\u003E \n\u003E \n\u003E On 2/1/2017 at 1:16 AM, KSK said:\n\u003E \n\u003E \n\u003E I was thinking more along the lines of a diadem, maybe a ring or a particularly revealing diary. Beware of the snake though. Never know what you can find pottering around in a warehouse. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\n\u0022Snakes? I hate snakes!\u0022\n\nI\u0027m pretty sure it\u0027s a reference to the end of Raiders of the Lost Ark. But there are so many such trinkets to lose in there! I sometimes wonder if a certain learned medical practisioner might be wandering it\u0027s halls looking for a large blue box with a blinking light.\n\n\u0022I know I parked it somewhere near here?\u0022"},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2017-02-06T19:04:52Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, Patupi said:\n\u003E \n\u003E \n\u003E I\u0027m pretty sure it\u0027s a reference to the end of Raiders of the Lost Ark. But there are so many such trinkets to lose in there! I sometimes wonder if a certain learned medical practisioner might be wandering it\u0027s halls looking for a large blue box with a blinking light.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u0022I know I parked it somewhere near here?\u0022\n\u003E \n\nPeople often mistake him for that kind of doctor. It is always a little awkward when they do that.\n\nThe warehouse is definitely that one too. Did you know Syfy did a whole series on that premise alone? It may feel a bit silly at times but there\u0027s no point being grown-up if you can\u0027t be childish sometimes."},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2017-02-07T16:56:48Z","Content":"Citizens of the Ussari Union! You are being lied to! Valentina Kermanova did go to Mün! The explosion was a cover-up! Your government is an oppressive totalitarian regime! You must fight for your freed- \n\nOH, PЦҐЇЍ! THEY\u0027VE FOUND ME! SAVE YOURS- SҐДLЇЍ\u0027S SШЭДГҰ SФҪҠS! NOT THE RATSQUIRRELFISH! NOOO-"}]}