{"TopicId":115606,"ForumId":39,"TopicTitle":"Interstellar Travel Handbook of the Kerbal Cosmos","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-07-11T02:03:12Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-07-11T02:03:12Z","Content":"*My Fanon? Okay, sure, since you didn\u0027t ask.*\n\n**Kerbals of the planet Kerbin**\n\nThe first species you will meet on your travels will no doubt be the Kerbal. Kerbals are as intelligent as they are dumb. They very quickly built up their rocket program to a space program, but only at the great cost of safety hazards and general lack of attention to safety. Their visual style is similar to the rocket programs and space centers of the 1950s-1970s on Earth, but with exaggerated proportions and a slight bit more use of found parts. Make no mistake, Kerbals are not stupid. They are competent engineers, even brilliant at times. F\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/bqASqda0ylc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n. But they are not safety driven by any means.\nTheir Space Program\u0027s focus on generally cheaper supplies of premanufactured components rather than in-house constructed equipment means that R\u0026D is more efficient, and parts cost less.\n\nTheir planet is nice enough. Kerbin has 1 atmosphere of pressure, and 1 gee of gravity, but is only 0.1x the size of Earth. Indeed, the entire Kerbal Universe is 1/10 as big and 10x denser. Kerbin has two moons, great targets for a budding space program.\n\nThe Kerbal spoken language translates many proper nouns to English with lots of nice soft sounding words like Jool and Duna and Moho, not much sharpness. It also translates literally into English when written.\n\nThe eventual Kerbal interstellar drive is based upon spacewarp generators which translate ships directly through space. They must be paired to interact properly. A third spacewarp generator or a fifth or a seventh upsets the balance and the whole thing will likely shake itself to bits.\n\n**Veetues of the moon Siliciv.**\n\nAs you venture away from Kerbin, the Veetoobs are the nearest civilization. They are a machine-augmented race of logic. They have trouble interacting with the Kerbals or any other race of illogic. They resemble your classic sleek 1950s cyber/diesel/atompunk robot thing, just resized with more kerbal proportions. Because they are a machine race, they understand machines better somehow. They have a a killer R\u0026D team. They rely, however, on expensive manufacturing processes for their spacecraft, so they cost much more.\n\nTheir spacecrafts resemble classic 1950s science fiction, with sleek, seamless joint connections and huge fins. All ships are coated in a special heat-resistant shielding which allows them to withstand re-entries without heatshields. They are unique in that they use procedural fuel and propellant tanks and wings alongside modular parts like rocket engines. Their rocket engines are generally efficient and high-thrust.\n\nTheir planet is a moon of an Ice Giant orbiting a red giant. The moon has a thin atmosphere of 0.62 atm, and a decent gravity of 1.1 gees. Nice place for a robot.\n\nTheir interstellar drive is an FTL-jump drive, where the ship enters some other type of space, perhaps hyperspace or something. You don\u0027t get to pilot in-between, but it tends to be quite a bit faster than other forms of \u0022flythrough\u0022 FTL. It takes a few hours in space to calculate the huge amounts of data required to make the jump, and this becomes messed up the moment the orbit is changed by more than 1%. With a Jump Drive you still keep your relative velocity with the other star system. Jump Drive also can not be used when the gravity well is too great.\n\nThe name of their race is derived from Vacuum Tubes, though I just realized it could be interpreted as V-2, as in the missile.\n\n[Artists conception of their society. !\\[:P\\](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)](https://vimeo.com/112843553) Just imagine old aperture science innovators, back when it was new, with a lot more chrome and sleekness. (I guess a mix between old and new Aperture)\n\n**Vernians of the planet Sudric**\n\nThe Vernians are religious zealots. Their teachings suggest that the way to salvation is through exploration of the heavens. Going further than the last voman or woman or soman would allow you and your comrades to have a better afterlife. This religious extremism caused the space program of their species to begin with otherwise steampunk or victorian-level technology, and leading up to teslapunk electronics. They resemble tall cyan-skinned Kerbals with tattoos of religious icons or symbols. They are a trigendered species. They don\u0027t use gendered pronouns, so just use \u0022\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/46ehrFk-gLk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\u0022.\nTheir R\u0026D program is rather limited, and the mass ratios and specific impulses of their rockets are very poor. They can not use probes ever, as it would not fulfill the wish of the lord and savior, the Luna 3 Probe. Ironic, huh? However, the religious nature of their space program ensures that neither funding nor reputation will be an issue, unless something really bad or blasphemous happens.\n\nTheir astronauts can be any of the following skills: Explorer (analogous to pilot), Mechanic (analogous to engineer), and Philosopher (analogous to scientist.) They are philosophers so that they can be either priests or \u0022natural\u0022 philosophers, who we would now call scientists.\n\nInstead of a tracking station they have a natural philosophy museum, with an orrery inside with religion magic projecting the positions of spacecraft. Their home planet is Sudric, which is a 0.8g, 0.9atm planet with plenty of life to go around.\n\nTheir interstellar drive is a sort of a religious prayer that can only be done in a massive crew tank that might be described as a church or temple inside the spaceship. If the Philosopher Vernian of level 5 is inside and enough other Vernians are observing him, the chance of a prayer succeeding nears 90%. The ship then is able to increase its outside-perceived acceleration by a very big number (inside they feel the low acceleration that the ships engines normally would) so that it is able to accelerate faster than light. There is no speed limit in the Kerbal universe, so that is no problem. How esle are victorians supposed to go interstellar if not with help from a magical god, eh?\n\n**Edited \u003Ctime datetime=\u00222015-07-11T15:18:57Z\u0022 title=\u002207/11/2015 03:18  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 11, 2015\u003C/time\u003E by GregroxMun**"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T02:11:15Z","Content":"I want the human race and us interacting with Kerbals!"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-07-11T10:14:45Z","Content":"\u003E \n\u003E I want the human race and us interacting with Kerbals!\n\nDoesn\u0027t happen. Travel between universes is impossible. Kerbin obeys different physical laws than Earth does.\n\nHowever, if you want to ignore that and make kerbals and hyoomahns interact, check out my [Real Solar System fancanon](https://forum.kerbalspaceprogram.com/threads/128330-A-Kerbal-s-Guide-to-the-Earth-Sol-System)."},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T14:37:49Z","Content":"\u003E \n\u003E Doesn\u0027t happen. Travel between universes is impossible. Kerbin obeys different physical laws than Earth does.\n\u003E However, if you want to ignore that and make kerbals and hyoomahns interact, check out my [Real Solar System fancanon](https://forum.kerbalspaceprogram.com/threads/128330-A-Kerbal-s-Guide-to-the-Earth-Sol-System).\n\nWow that\u0027s good."},{"CreatedByName":"Dspan_000","CreatedById":144320,"CreatedDateTime":"2015-07-11T15:00:16Z","Content":"Lol that would be cool"}]}