{"TopicId":115613,"ForumId":39,"TopicTitle":"Quite an event","CreatedByName":"JeeF","CreatedById":143053,"CreatedDateTime":"2015-07-11T03:57:21Z","PageNum":1,"Articles":[{"CreatedByName":"JeeF","CreatedById":143053,"CreatedDateTime":"2015-07-11T03:57:21Z","Content":"This is RocketDyne F-1 Engine, quite a jaw-dropping description\n\n[http://s14.postimg.org/m9ut4ttrl/Untitled.jpg](http://s14.postimg.org/m9ut4ttrl/Untitled.jpg)\n\nThis is what I\u0027ve decided to put together after a lot of study and engineering.\n\n[http://s14.postimg.org/dsvatwp2p/Untitled2.jpg](http://s14.postimg.org/dsvatwp2p/Untitled2.jpg)\n\nIt\u0027s an array of 64 F-1 Engines, allowing me to put a payload of over 600 tons into orbit\n\nDuring launch, I realized that 3 engines failed, they just simply do not ignite.\n\n[http://s14.postimg.org/aw89tmj8x/untittled3.jpg](http://s14.postimg.org/aw89tmj8x/untittled3.jpg)\n\nI checked the gimbal, trajectory, angle, speed... it was still all good despite 3 engines failing to ignite, so I thought I\u0027d be ok\n\nHowever...\n\nAround 2 minutes after launch, I realized that the 3 engines that failed to ignite were causing an unbalanced distribution of fuel\n\nWhich meant some engines would run out of fuel before others\n\nAt 3 mins flight... all engines on the left side ran out of fuel. With only the right-side engines thrusting, it started heavily pushing the whole rocket offcourse\n\nThe stress in the fuselage made the second stage decoupler to fail, causing a part of the thrusting engine from the first stage to break away and accelerate 2x faster than the rocket, colliding with the second stage like a missile\n\nThat caused the second stage fuel tank to explode with over 5 million liters of fuel\n\nWhich caused a catastrophic explosion that divided the whole rocket into 5 or 6 smaller rockets which flew into different directions\n\n[http://s14.postimg.org/w4lyb1xpt/untittled4.jpg](http://s14.postimg.org/w4lyb1xpt/untittled4.jpg)\n\nOne of the loose rockets flew straight into the command module, killing all 3 astronauts onboard.\n\nThe fallout was over populated cities, killing hundreds.\n\n3.2 billion dollars disappeared in a fraction of a second.\n\n**Edited \u003Ctime datetime=\u00222015-07-11T04:00:38Z\u0022 title=\u002207/11/2015 04:00  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 11, 2015\u003C/time\u003E by JeeF**"}]}