{"TopicId":117082,"ForumId":39,"TopicTitle":"KSP Mission Journal: Ninjahgoblin","CreatedByName":"Ninjahgoblin","CreatedById":144438,"CreatedDateTime":"2015-07-28T17:03:48Z","PageNum":1,"Articles":[{"CreatedByName":"Ninjahgoblin","CreatedById":144438,"CreatedDateTime":"2015-07-28T17:03:48Z","Content":"*Hello everyone. I wanted to start a \u0022journal\u0022 to document my missions in a single area that I can manage.*\n\n*I will post photos and video eventually. Mainly this is to share my experience, my ideas and builds.* \n\n*Questions, comments and tips are welcome. Same with casual banter!*\n\n**Playstyle:** Heavily modified Career mode (Mechjeb, sandbox esq with contracts and tech tree): In essence I like Career mode as it gives the game reason. But I hated starting over, or having to crawl up the tech tree. So I adjusted the sliders in career mode and added a bunch of contract packs and part packs. Also adjusting the part files directly to make it so certain parts are available at start. \n\n**Mission Statement:** To establish a foothold in the Kerbin Sphere of influence and to expand out into the solar system. Creating a network of satellites, refueling depots and space stations. Eventually moving to building sustainable bases and mining operations (mining is something I can\u0027t even imagine right now)\n\n**Current progress:**\n\nI started out by placing a Space station/fuel depot hybrid into orbit of Kerbin. I then launched the exact same station core I designed to the Mun and Minmus. Currently working on sending fuel tanks and escape pods to each of those stations. \n\n- I just designed my first Heavy Lifter. Something I am rather proud of, being able to launch roughly 50 tones\n\n- I just landed a Mun base (a bonafide science lander) that has the capability of house 11 kerbals. Using the Taurus Command module and a Science processing lab.\n\n- I took a contract that had me totally evacuate my Mun Station and had to do an emergency landing on the Mun (with an escape pod with no landing features accept a chute). Setting my Mun base as the target landing zone. I came in on top of my Mun base, knocking out half of my Solar Arays. But resting snug next to it. In an upright position. I can even take off to Kerbin if need be. With either the Mun base or the the Escape pod.\n\n- I am now designing an escape pod module and refueling module for my stations\n\n- I am now designing a landing probe, satellite combo for Duna and or Eve."},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-07-28T17:09:18Z","Content":"If you would like to have the screenshots taken automatically for you, take a look at AutomatedScreenshots, a mod which I released yesterday.\n\nGet the URL from my sig below\n\nLGG"},{"CreatedByName":"Ninjahgoblin","CreatedById":144438,"CreatedDateTime":"2015-07-28T17:11:41Z","Content":"Thank you! I\u0027ll take a look at this. F1 is not real hard. But being able to time them or sequence them in a proper fashion would be nice.\n\n\u003E \n\u003E If you would like to have the screenshots taken automatically for you, take a look at AutomatedScreenshots, a mod which I released yesterday.\n\u003E Get the URL from my sig below\n\u003E \n\u003E LGG"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-07-29T15:05:14Z","Content":"There will be an update in the next few days, with a pre-crash detection mode, so that if you are about to land (crash), it will be able to take more frequent screenshots."},{"CreatedByName":"Ninjahgoblin","CreatedById":144438,"CreatedDateTime":"2015-07-31T17:04:58Z","Content":"Here are some images from my recent missions. \n\n-Heavy lifter, upto 50t into LKO and can do planetary transfers\n\n-Rescue mission to Minmus. I accidentally hit a stage to early on my lander. And had to send another one to pick them up.\n\n-Docking images\n\n-Mun base images\n\n-Mun escape pod landing images.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/S7xVJ)\n\n**Edited \u003Ctime datetime=\u00222015-07-31T17:12:05Z\u0022 title=\u002207/31/2015 05:12  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 31, 2015\u003C/time\u003E by Ninjahgoblin**\n  \nfix"}]}