{"TopicId":120207,"ForumId":39,"TopicTitle":"PAX Prime 2015 Tournament Re-enactment (9/6/2015 10:00AM PST)","CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2015-09-05T17:15:17Z","PageNum":1,"Articles":[{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2015-09-05T17:15:17Z","Content":"\n\u003Cp\u003EDid you know that the Penny Arcade Expo (PAX) has a Kerbal Space Program tournament? I didn\u0027t either. But since I started playing KSP a little more than a year ago, I\u0027ve attended three of these tournaments, and they\u0027re always a good time, if only to meet fellow Kerbonauts in person and chat about the game.\u003C/p\u003E\u003Cp\u003EThis year\u0027s objective was Colonization. The objective was kept secret right until the start of the tournament, to prevent practicing for the specific mission we\u0027d be doing. Players scored points for having kerbals on EVA on a variety of different planets and moons, and the person with the most points at the end of two hours won. The points went something like this (going from memory, so this may not be quite right)\u003C/p\u003E\u003Cp\u003EMun: 1x\u003C/p\u003E\u003Cp\u003EIke: 1.5x\u003C/p\u003E\u003Cp\u003EEve: 2x\u003C/p\u003E\u003Cp\u003EEeloo: 3x\u003C/p\u003E\u003Cp\u003ELaythe: 5x\u003C/p\u003E\u003Cp\u003ESomething like that. As with many of you, I imagine, the first thing I saw on there was the huge multiplier for landing on the relatively easy (compared to the other, airless bodies) Laythe, and so that became my objective! \u003C/p\u003E\u003Cp\u003EI\u0027ll be streaming tomorrow at 10am (Sunday, 9/6/2015) and basically re-enacting my mission profile, along with all the horrible mistakes and 360 no-scope rocket-flips I did. Spoiler: I won the tournament, with 88 kerbals bobbing happily in Laythe\u0027s ocean at the end of the 2-hour mark, so look forward to the Space Bus 9000 and Space Bus 9001 headed to the Jovian system!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/calendar.php?do=getinfo\u0026amp;eventid=212\u0022 rel=\u0022external nofollow\u0022\u003EKSP Forum Streaming Calendar Event\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/activkino\u0022 rel=\u0022external nofollow\u0022\u003EMy Twitch\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2015-09-06T16:50:15Z","Content":"\n\u003Cp\u003EFiring up the stream in 10 minutes!\u003C/p\u003E\n"}]}