{"TopicId":121055,"ForumId":39,"TopicTitle":"Ranger 8 - Lunar impactor - RSS","CreatedByName":"winged","CreatedById":143617,"CreatedDateTime":"2015-09-16T23:04:20Z","PageNum":1,"Articles":[{"CreatedByName":"winged","CreatedById":143617,"CreatedDateTime":"2015-09-16T23:04:20Z","Content":"\n\u003Cp\u003EMy attempt to recreate Ranger 8 mission in Real Solar System.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/8tGMjgpHZhY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ERanger was originally to be a program of five unmanned lunar crasher spacecraft, intended to quickly obtain information on the lunar surface. The scientific objective would be to acquire and transmit a number of images of the lunar surface prior to impact, and to obtain data from a survivable package incorporating a lunar seismometer. The resulting spacecraft was much too ambitious for its period. After five consecutive failures, a simpler, picture-return-only spacecraft made three successful flights (Ranger 7, 8, 9), returning the first closeup pictures of the lunar surface years behind schedule.\u003C/p\u003E\u003Cp\u003ERanger 8 took more than 7,000 high-resolution images of the moon before impacting the lunar surface on February 20, 1965.Ranger 8 impacted the moon only 24 kilometers from its target in the Sea of Tranquility, an area that was of particular interest to Apollo mission planners. Images from the mission, which detailed the kind of terrain and obstacles that a human explorer might encounter, paved the way for future human exploration of the moon.\u003C/p\u003E\u003Cp\u003EPictures, details: \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/SIbeb\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E***\u003C/p\u003E\u003Cp\u003EI\u0027m planning to make regular youtube video series with recreations of real missions, alternative history and some fictional ideas in RSS \u0026amp; RO.\u003C/p\u003E\u003Cp\u003EMy next plans:\u003C/p\u003E\u003Cp\u003EManned Venus Flyby\u003C/p\u003E\u003Cp\u003EVoyager 2\u003C/p\u003E\u003Cp\u003ECrewed Mars mission\u003C/p\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2015-09-17T11:46:59Z","Content":"\n\u003Cp\u003EI don\u0027t think Ranger\u0027s panels could rotate, but otherwise it seems like a perfect replica \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Nicely flown!\u003C/p\u003E\n"},{"CreatedByName":"BlueSubstance","CreatedById":40362,"CreatedDateTime":"2015-09-17T15:08:24Z","Content":"\n\u003Cp\u003EVery nice cinematic! I\u0027m looking forward to more videos like this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}