{"TopicId":121882,"ForumId":39,"TopicTitle":"Random musings on Kerbal biology and society","CreatedByName":"Haruspex","CreatedById":148736,"CreatedDateTime":"2015-09-28T11:20:54Z","PageNum":1,"Articles":[{"CreatedByName":"Haruspex","CreatedById":148736,"CreatedDateTime":"2015-09-28T11:20:54Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/TjOdzNh.jpg\u0022 alt=\u0022TjOdzNh.jpg\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBIOLOGY\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E The Kerbals are species noticeably different from humans when it comes to biology and anatomy. Like us, they are warm-blooded, breathe oxygen and consume proteins that come mostly from local plants and animals. But the most noticeable feature of Kerbals is the amount of control they routinely exhibit over their metabolism, being able to slow it down significantly for extended amount of time, and their ability to regenerate.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHibernation\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Kerbals can enter a state of hibernation at will; in this self-induced coma they can subsist on bare minimum of oxygen and food for years. Once a year or two a hibernating Kerbal might awake to have a snack, and then return to his dreamless sleep. This allows the Space Program to drastically reduce the resources allocated to life support aboard their vessels.\u003C/p\u003E\u003Cp\u003E One can send a Kerbal to a distant barren planet in a tiny pod and check on him several decades later, only to find him there unchanged and as stupidly cheerful as ever. The answer? He was sleeping most of that time. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERegeneration\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Kerbals have strong regeneration ability. They can regrow lost limbs, eyes and most of the internal organs in a matter of weeks, and are susprisingly resistant to minor wounds and hostile environments, except high temperatures. Like with trolls of human legends, the best ways to kill a Kerbal are extensive damage to the central nervous system and/or fire. Kerbals are very susceptible to overheating, and heat slows down or stops their regeneration altogether.\u003C/p\u003E\u003Cp\u003E Most Kerbal deaths that don\u0027t involve fire are results of the mechanical stress that leads to lethal brain damage, such as being crushed or falling from great height. \u003C/p\u003E\u003Cp\u003E Regeneration starts to slow with age, but generally, a young or middle-age Kerbal is either perfectly healthy and whole... or dead. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELongevity\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Kerbals are not immortal, and slowly age. But they have rather long lifespans, aided by regeneration, and if we take their ability to hibernate into account, these cute little humanoids can last a ridiculous amount of time - if nothing kills them. Especially interplanetary kerbonauts, who spent years and decades in hibernation, can live for many centuries.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProcreation\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Kerbals have two sexes, but they are not mammals, and the sexual dimorphism is minimal. The females of the species lack mammaries and possess the same size and physical strength as the males. They lay one or two leathery eggs per mating season. As the embryo develops inside the incubated egg, the egg somewhat grows in size.\u003C/p\u003E\u003Cp\u003E As the progeny hatches, they are cared for and raised by the whole collective. There are no families in human sense and no strong emotional attachment between the parent and the child. Instead, each member of the genetically related \u0022family group\u0022 (one can call it a \u0022clan\u0022, or a \u0022commune\u0022, or maybe even a \u0022flock\u0022) considers every child in the group as \u0022his\u0022 and protects them accordingly.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESOCIETY\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFamily\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E The Kerbal society consists of groups of blood-related individuals living together. Such an \u0022extended family group\u0022 can number from 15-20 and up to 300 Kerbals. There are no separate families within such a \u0022clan\u0022, though Kerbals can form pairs, either for one mating season or long-term; but those \u0022love pairs\u0022 do not raise their children separately from the rest of the \u0022clan\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EViolence\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Kerbals, as a species, have instinctive aversion to any kind of violence towards each other. They do not wage war, don\u0027t make weapons and don\u0027t murder each other... directly.\u003C/p\u003E\u003Cp\u003E Nothing forbids a smart Kerbal from setting up a chain of events that might lead his rival to an untimely end. Or, better yet, from arranging for the enemy a suicide by stupidity. Or from sending a particularly disliked underling to a deadly trip from which there is no return. Kerbal criminals can be devious, cruel and very inventive in creating misery for their victims.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDanger Rush\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Apparently, because in natural environment it is rather hard for a Kerbal to get killed, and if it even happens, the death is in most cases instantaneous, the nature equipped Kerbals (or at least some of them) with a curious mechanism of population control - the Danger Rush.\u003C/p\u003E\u003Cp\u003E The significant percentage of adult Kerbals can experience a extremely strong adrenaline rush when in life-threatening conditions. For those, it is an addictive joy, stronger even than the joy of mating. The Danger Rush and the social institutions built around it always were a most important part of the Kerbal culture.\u003C/p\u003E\u003Cp\u003E Recently, the Kerbal scientists claim to have found and isolated the gene that is responsible for this phenomenon. They have called it \u0022BadS\u0022. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECourage and Stupidity\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E As the Kerbals are so long-lived and their natural survival rates are good, there is a strong population pressure and high levels of competition within the society. Kerbal society constantly produces \u0022extra people\u0022, pushed to the fringes by the fierce, if mostly non-violent, competition. And because this competition is non-violent, it is the less intelligent who are always expendable. Those are relegated to the most dangerous tasks, often ignoring all safety, and die in droves. The Danger Rush also helps to motivate them. \u003C/p\u003E\u003Cp\u003E There is often another kind of fringe people: those, who are smart and ambitious, but lack the desire to participate in the never-ending influence games that plague Kerbal daily life. Driven by the Danger Rush, they become explorers and protectors of the Kerbalkind.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EReligion\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E As many other sentient species, the ancient Kerbals were no strangers to religion. They worshipped multiple gods - Kerbol, the All-Father; Eve, the Night Beauty; Jool, the Great Green One, and Laythe, his daughter-wife; and, of course, that which will not be named, the force of the world-devouring chaos, the primal chthonic monstrosity... the Kraken.\u003C/p\u003E\u003Cp\u003E According to the Kerbal legends, the Kraken was slain by Jool, and his monstrous body handed over to one of the Jool\u0027s children for safekeeping, lest he be resurrected and awakens again... \u003C/p\u003E\u003Cp\u003E In later ages, the Kerbals became monotheists, with Kerbol the Creator becoming the only worshipped God. For some time, the Kerbal society was ravaged by the religious upheaval as different sects and cults struggled against each other. Eventually, the single Kerbol faith prevailed and became the only one remaining.\u003C/p\u003E\u003Cp\u003E One of the central myths of this religion is the creation of the first kerbal, the forefather of the entire race; you may guess his name - it is, of course, Kerman.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe Order of the Source\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E Like on many other worlds, the Age of Faith was followed by the Age of Enlightement. The Kerbal society at that point was obsessed with science, struggling to understand how the universe works. But the religion still had influence on the scientists\u0027 and philosopers\u0027 minds, and the universe was seen as a divinely created clockwork mechanism, eternal and unchanging, and Kerbals as the only sentient species.\u003C/p\u003E\u003Cp\u003E In those days, a secret society of most prominent philosophers, astronomers and alchemists that called itself \u0022the Order of the Source\u0022 was born. Somewhat akin to the freemasons of Earth, but fixated on scientific knowledge for the sake of knowledge.\u003C/p\u003E\u003Cp\u003E The Order had a set of complex initiation rites. The recruit must shed all his old allegiances, his kin, his country, for the sake of SCIENCE. Like a first kerbal, humble and naked, he must stand before the eternal Creator at the beginning of time, single-minded and pure, carrying nothing from his worldly past.\u003C/p\u003E\u003Cp\u003E All initiated brothers and sisters of the Order, regardless of their origin, were given the new surname:\u003C/p\u003E\u003Cp\u003E Kerman.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-01T11:47:01Z\u0022 title=\u002210/01/2015 11:47  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 1, 2015\u003C/time\u003E by Haruspex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2015-09-28T14:32:20Z","Content":"\n\u003Cp\u003EWow... Just WOW... Great Canon!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-09-28T21:34:01Z","Content":"\n\u003Cp\u003EI like it. I really like it.\u003C/p\u003E\u003Cp\u003EMy favourite parts were the Danger Rush gene and the Order of the Source (great way of explaining the Kerman naming) but the rest of it hung together really well! Kerbals as egg-layers was a nice twist too.\u003C/p\u003E\u003Cp\u003EI would definitely read any stories set in your version of Kerbin if you ever felt moved to write them.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-09-29T02:41:31Z","Content":"\n\u003Cp\u003EKerbals may lack mammaries, but the must have SOMEthing that Squad felt the need to cover:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Xe3SMAK.jpg\u0022 alt=\u0022Xe3SMAK.jpg\u0022\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E... they also apparently have toenails.\u003C/p\u003E\n"},{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2015-09-29T03:00:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003EKerbals may lack mammaries, but the must have SOMEthing that Squad felt the need to cover:\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Ca href=\u0022http://i.imgur.com/Xe3SMAK.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Xe3SMAK.jpg\u003C/a\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E... they also apparently have toenails.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was just when they were trying to find a good hairstyle for the females.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-09-29T03:03:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003EKerbals may lack mammaries, but the must have SOMEthing that Squad felt the need to cover:\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Ca href=\u0022http://i.imgur.com/Xe3SMAK.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Xe3SMAK.jpg\u003C/a\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E... they also apparently have toenails.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey don\u0027t need covering, they just get cold. Female kerbals more so. Besides, I\u0027m sure \u003Cem\u003Esomeone, somewhere\u003C/em\u003E would have slapped SQUAD in the internet face for not giving the Kerbals clothes. Even if they have barbie/ken doll bodies.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-29T03:11:22Z\u0022 title=\u002209/29/2015 03:11  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 29, 2015\u003C/time\u003E by GregroxMun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Haruspex","CreatedById":148736,"CreatedDateTime":"2015-09-29T09:46:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003EKerbals may lack mammaries, but the must have SOMEthing that Squad felt the need to cover:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EKerbettes and their Tank Tops\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhen a female kerbal is carrying a fertilized egg (up to three months), due to the hormonal shifts in her body she feels cold, sometimes even shivers. The natural reaction is to add more clothing. As centuries passed, traditional and even ritual clothing evolved to signal that a) the female is vulnerable, needs warmth, comfort and protection of the family group, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E \u0022my mating season is over, you\u0027re late, sod off\u0022. Female kerbals dressed a certain way symbolized both fecundity and prudence. With the onset of mass and pop culture that simplified everything, the last remnant of that ritual clothing is... the Kerbette Tank Top. It\u0027s a cultural artifact that means that the wearer is \u0022a good girl\u0022, otherwise, does nothing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-01T21:30:11Z\u0022 title=\u002210/01/2015 09:30  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 1, 2015\u003C/time\u003E by Haruspex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Haruspex","CreatedById":148736,"CreatedDateTime":"2015-10-01T11:41:10Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EKerbals and Commerce\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E Being a peaceful, but competitive, race, Kerbals from the beginning of their civilization find great joy in trade, just as in inventing new stuff. The smartest always profits. If you can refurbish a piece of junk found at the side of the road into something useful and sell it to some hapless passer-by - do it and be praised for your cunning. Various merchant guilds and trading houses of the Age of Faith evolved into spawling business empires. The kerbal corporations are usually built around the founder\u0027s family group, with outsiders filling the lower ranks. \u0022Wage slavery\u0022 and lifetime employment contracts are common.\u003C/p\u003E\u003Cp\u003E By the Space Age, Kerbin has a globally accepted bitcoin-like virtual currency, first introduced about 20 years ago by the Kerbin Scientific and Exploration Society. Its sign is derived from a mathematical symbol after an ancient Kerbal saying: \u0022Money is the root of all.\u0022 \u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003EKerbin Scientific and Exploration Society\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E Founded over 150 years ago as a visible public branch of the legendary Order of the Source (that is considered extinct by now), Kerbin Scientific and Exploration Society functions as a charity organization, a school and university hub, a research institute and at the same time a huge business conglomerate with countless daughter corporations that deal with high-tech industry, pharmacy, aeronautics and spaceflight. It\u0027s a world in itself, with complex internal politics and layers upon layers of mystery and deceit surrounding its true goals and origins. It\u0027s Kerbals\u0027 Nobel Prize committee, Ivy League, NASA, Boeing, Microsoft and the hidden Illuminati world government in one. Its main assumed goal is technical and scientific advancement of the Kerbal race by any means necessary.\u003C/p\u003E\u003Cp\u003E The Space Program is one of the big projects of the Scientific and Exploraton Society.\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003EKerbals and War\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E In the ancient times, the primitive kerbals had to defend themselves from predatory animals, and thus, have no instinctive taboo on violence on other species. They can hunt to kill and eat, though this is considered extremely uncivlized. Sometimes, as it can happen with any sentient being, the instincts fail, and bloodthirsty madmen and maniacs appear; so there is still some negligible amount of kerbal-on-kerbal violence that is usually swiftly dealt with.\u003C/p\u003E\u003Cp\u003E The mass culture, of course, loves all kinds of horrors, so there\u0027s all kinds of fictional scenarios in the media that involve large-scale violence. For a Kerbal, \u0022war\u0022 means approximately the same as \u0022zombie apocalypse\u0022 to a human from Earth, and a \u0022hired killer\u0022 or a \u0022mass murderer\u0022 falls in the same category as \u0022vampire\u0022 or \u0022werewolf\u0022. Spaceships or aircraft armed with weapons of mass destruction are considered to be about as real as the Transformers or the Death Star.\u003C/p\u003E\u003Cp\u003E But never the less, \u0022war\u0022, and especially \u0022war with aliens\u0022, are scenarios that are present in the Kerbal mind, even if no-one is ready for this to become reality - just like your average american teenager is not ready for his neighbors and relatives to suddenly start murdering each other and eating brains. \u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003EKerbals and the Mystery Goo\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E About 50 years ago, an expedition of the Society found a large meteorite frozen in the glacier near the South Pole. The rock was laced with weird green, glowing substance that turned out to be the first alien life discovered by the Kerbalkind. It is a jello consisting of billions of tiny luminescent bacteria that exhibit most unusual properties: they can survive in vacuum and extreme temperatures of space, draw energy from the radiation that could easily kill weaker life forms, and eat through iron and silicate rocks. Luckily, high gravity and thick atmosphere of Kerbin that stops most of the radiation impedes the Goo\u0027s reproductive cycle, so if it is even released in the wild, it won\u0027t be able to consume the planet. \u003C/p\u003E\u003Cp\u003E Kerbal scientists are fascinated by the Goo\u0027s properties and wasted decades searching for its origins within the Kerbol system, but with little luck so far. There are rumors that the first expeditions to Duna and Ike saw a large asteroid that, like the polar meteorite, was covered with thriving Mystery Goo, but this asteroid - nicknamed the \u0022Magic Boulder\u0022 - so far eluded detection and proper study.\u003C/p\u003E\u003Cp\u003E Perhaps, the source of the Goo lies on one of the Joolian moons, or outside of the Kerbol system altogether?.. Who knows.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-01T21:26:16Z\u0022 title=\u002210/01/2015 09:26  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 1, 2015\u003C/time\u003E by Haruspex\u003C/strong\u003E\n\u003Cbr\u003ETypos.\n\u003C/span\u003E\n"},{"CreatedByName":"Kosmonaut","CreatedById":137785,"CreatedDateTime":"2016-09-21T12:43:29Z","Content":"\n\u003Cp\u003E\nI always thought of kerbals as plants, but... wow. (The reproductive cycle would be the spores that puff out when they die, like dandelions)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-21T12:44:19Z\u0022 title=\u002209/21/2016 12:44  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 21, 2016\u003C/time\u003E by Kosmonaut\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vestradeus","CreatedById":149000,"CreatedDateTime":"2016-10-21T14:52:49Z","Content":"\n\u003Cp\u003E\nLove this history. Thank you!\n\u003C/p\u003E\n"},{"CreatedByName":"MixelFan95","CreatedById":234098,"CreatedDateTime":"2024-07-11T19:43:26Z","Content":"\n\u003Cp\u003E\nThis Canon has Got to be One of My Favorites!\n\u003C/p\u003E\n"}]}