{"TopicId":12589,"ForumId":39,"TopicTitle":"[Writing] Outer Space Delivery Men","CreatedByName":"GabrielG.A.B.Fonseca","CreatedById":13436,"CreatedDateTime":"2012-06-12T20:59:26Z","PageNum":1,"Articles":[{"CreatedByName":"GabrielG.A.B.Fonseca","CreatedById":13436,"CreatedDateTime":"2012-06-12T20:59:26Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003EOuter Space Delivery Men\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7259/7107878709_055b5d75d0_b.jpg\u0022 alt=\u00227107878709_055b5d75d0_b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E The new rocket was standing in the launchpad, looking powerful, with it\\\u0027s Silver-tape hardened structure. This rocket, the Satellite Delivery Vehicle Mk 1 was caring the latest technology in satellite automation. It\\\u0027s crew: Geneden, Aldsin and Mike. They were heavily trained for this particular day. They would make a normal orbital flight at first, but after orbit was achieved, they would make something never done before.\u003C/p\u003E\u003Cp\u003E \u0027KSC, here is Aldsin, we\\\u0027re ready to liftoff.\u0027\u003C/p\u003E\u003Cp\u003E \u0027Roger that. Stand by. T- 30, 29...\u0027\u003C/p\u003E\u003Cp\u003E The 3 Kerbonauts started to check the \u0027Space Delivery for Dummies\u0027 drawings once more, before the countdown approached T-10.\u003C/p\u003E\u003Cp\u003E \u0027...10, 9, 8, 7, 6, 5, 4, 3...\u0027\u003C/p\u003E\u003Cp\u003E \u0027ROAAAAAAARRRRRR!\u0027\u003C/p\u003E\u003Cp\u003E \u0027... 2, 1, liftoff!\u0027\u003C/p\u003E\u003Cp\u003E The SDV started to accelerate, and a big trait of smoke was left behind it.\u003C/p\u003E\u003Cp\u003E* * *\u003C/p\u003E\u003Cp\u003E \u0027KSC, here is SDV 1, we\\\u0027re detaching the orbital burn stage now\u0027.\u003C/p\u003E\u003Cp\u003E The last stage of the rocket, that contained the RCS fuel and the satellite, made small RCS burns to go away from the orbital burn module. Now, from about 10 M from it, the real deal could start.\u003C/p\u003E\u003Cp\u003E \u0027Prepare the satellite decoupler, Geneden\u0027.\u003C/p\u003E\u003Cp\u003E \u0027Ready.\u0027\u003C/p\u003E\u003Cp\u003E \u0027Good. Mike, be ready to go away from the satellite when it is deployed.\u0027\u003C/p\u003E\u003Cp\u003E \u0027Roger\u0027\u003C/p\u003E\u003Cp\u003E Aldsin hesitated for a second, and then pressed the button. Geneden detached the satellite from the rocket, and Mike, controlling the RCS, made a small burn to go away from it. The satellite deployed it\\\u0027s Solar Panels, and the antenna pointed itself to Kerbin, with the logo of the company that made it printed on it\\\u0027s sides.\u003C/p\u003E\u003Cp\u003E \u0027We did it!\u0027\u003C/p\u003E\u003Cp\u003E Geneden and Aldsin started to celebrate, but Mike was focused on something else. He stared at the drawing in the \u0027Space Delivery for Dummies\u0027, looking for instructions to return home. Then, he finally realized that their rocket was just Command pod, parachute and basic RCS kit now. He looked in panic to the monitor displaying their orbit.\u003C/p\u003E\u003Cp\u003E \u0027Guys?\u0027\u003C/p\u003E\u003Cp\u003E* * *\u003C/p\u003E\u003Cp\u003E They were desperately trying to find a solution to go down, alone, because the KSC crew went to the bar at the other side of the road to cheer.\u003C/p\u003E\u003Cp\u003E \u0027Hey, Geneden, we still have some RCS fuel left... We can burn it to keep ourselves warm...\u0027\u003C/p\u003E\u003Cp\u003E -RCS fuel?- Mike thought.\u003C/p\u003E\u003Cp\u003E \u0027That\\\u0027s it! RCS! We can use it to decelerate the ship to a sub-orbital route!\u0027\u003C/p\u003E\u003Cp\u003E Geneden and Aldsin stared each other for a second.\u003C/p\u003E\u003Cp\u003E* * *\u003C/p\u003E\u003Cp\u003E The RCS fuel was almost finishing now, and they succeeded to make the de-orbital burn.\u003C/p\u003E\u003Cp\u003E \u0027We\\\u0027re going home!\u0027\u003C/p\u003E\u003Cp\u003E The ship leaved a trait of smoke, like it did at the launching, while it was crossing the atmosphere. The parachute opened and the rocket decelerated to around 100 m/s.\u003C/p\u003E\u003Cp\u003E \u0027Man, I\\\u0027m really angry with the KSC Crew. They left us alone in space, without telling us how to come back!\u0027\u003C/p\u003E\u003Cp\u003E At 500 M, the parachute fully opened. The capsule slowly felled until it landed next to the bar in front of KSC. When the kerbonauts leaved the capsule, the command crew was going back to KSC. They stopped. The KSC commander, with a happy face cheerfully asked:\u003C/p\u003E\u003Cp\u003E \u0027Did we missed something cool?\u0027\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003ESmall story I wrote in about 5-10 minutes. Nothing really great. Note:\u003C/p\u003E\u003Cp\u003E-BASED IN A REAL STORY- (The only difference is that the facts were totally changed =P)\u003C/p\u003E\n"},{"CreatedByName":"Joshmo","CreatedById":10280,"CreatedDateTime":"2012-06-12T22:45:06Z","Content":"\n\u003Cp\u003EI like how they landed at the bar.\u003C/p\u003E\n"},{"CreatedByName":"GabrielG.A.B.Fonseca","CreatedById":13436,"CreatedDateTime":"2012-07-23T22:27:06Z","Content":"\n\u003Cp\u003EAdded a photo from the mission that inspired me to make this.\u003C/p\u003E\n"}]}