{"TopicId":129734,"ForumId":39,"TopicTitle":"The United Kerbin Church of our Lord and Savior Scott Manley!","CreatedByName":"amankd","CreatedById":135588,"CreatedDateTime":"2016-01-12T01:20:59Z","PageNum":1,"Articles":[{"CreatedByName":"amankd","CreatedById":135588,"CreatedDateTime":"2016-01-12T01:20:59Z","Content":"\n\u003Cp\u003E\nthe newest (and biggest) of all ksp religions is here and like all religions one much have a holy book! and it is that for which we are penning!\n\u003C/p\u003E\n\u003Cp\u003E\nan extract is below (under spoilers) we home to get it published when we are finished, all done properly and all and we were wondering how many supporters there might be for such a thing? as it costs a fair bit to gert books published in small numbers, so if you would like to register your interest just post below! our religion can be found here: \u003Ca href=\u0022\u0022 rel=\u0022external\u0022\u003E \u003C/a\u003E\u003Ca href=\u0022https://www.facebook.com/groups/211157749226377/\u0022 rel=\u0022external nofollow\u0022\u003EThe United Kerbin Church of our Lord and Savior Scott Manley!\u003C/a\u003E p.s. scott is a member of our group!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/h9Qlg/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cdiv style=\u0022padding:12px 12px 0px;\u0022\u003E\n\u003Cdiv style=\u0022font-size:14px;font-weight:normal;line-height:1.38;\u0022\u003E\n\u003Cp style=\u0022margin:0px 0px 6px;\u0022\u003E\nThe Manleyscript.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nPassage 1.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nAlex 1:1\u003Cbr\u003E\nIn the beginning there was Unity. There had been 4 Unities, but only the 4th had satisfied the almighty Lord Scott Manley, and in it he built the Universe. To construct the Universe, the almighty Scott founded Squad and implanted in them the desire to create the Universe. At first it was flat, with corners and edges, but it did not satisfy his worshipfulness, so he decreed it must be spherical with moons and planets, to encourage its people to explore and discover, and to send worship unto him. The World was pure, and our Lord, Scott Manley saw its flawlessness, and it was good. Before long the kerbals were made. A cowardly cast who were nevertheless willing to venture into the Cosmos, in the name of their Lord. Life without death, light without darkness, hope without despair. Alas, deep within the fiber of creation, snippets of code were being corrupted. Chaos, disarray, turmoil started taking over as the mighty Kraken arose from the ghostly remains of old.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\n“Depart from us, o ye depraved! For I shall not suffer that My children should walk in darkness, but in unison.” Said our lord, as he cast the wicked from His presence, and called them bugs.The lord then issued a prophesy unto the young kerbals that one day a kerbal will spawn who shall fear no danger, he shall be called badass wherever he goes and his name shall be Jebediah. he shall be my prophet and you must have a space program ready for him so he may venture into the cosmos and conquer the almighty Kraken.\u003Cbr\u003E\nAnd the Lord, Manley spake, saying, You shall name your planet Kerbin, and a day shall be one revolution around its axis. The light on your sky you shall name Kerbol, for ’tis the star I created to give you plenty of solar power. A year shall be the orbital period of Kerbin.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nThen shalt thou count to three of these years, no more, no less. Three shalt be the number thou shalt count, and the number of the counting shalt be three. Four shalt thou not count, nor either count thou two, excepting that thou then proceed to three.\u003Cbr\u003E\nFive is right out.\u003Cbr\u003E\nOnce the number three, being the third number, be reached, then I shall decree my prophecy.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nAnd it came to pass in process of time, that a kerbal called Jebediah was spawned and the almighty Scott looked at his config and found that it read BADs = true, and He was pleased. The almighty Scott bestowed upon him the power of reincarnation, so that he may die bravely in the pursuit of space without fear of death. But the prophet Jebediah was not pleased with this. He confronted the almighty Scott and said unto him “I do not wish to be alone in this world, for I will not go to space knowing that only I may live again.” and thus the Lord sighed and said “Okay” and bestowed the power of reincarnation upon Jebediah’s 3 closest friends. Bill the engineer, who shall fix prophet Jeb’s spacecraft, Bob the scientist, who shall unlock more parts and allow the prophet Jeb to roam further into the Cosmos by the almighty Scott\u0027s decree, and Valentina who shall save the ship should Jebediah become incapacitated on snacks.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nPassage 2.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nAlex 1:2 And soon under the eye of the all powerful scott manley the kerbals did prosper but as the kerbals prospered so too did the kraken grow. The almighty scott did know of this creature’s existence for in his infinite wisdom he could detect all that might threaten his faithful but he did not warn the kerbals for they were innocent in their endeavors and would not consider anything to harm them and thus the kraken grew.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nthe kerbals at this time were developing fast, under the almighty guidance of the great scott manley they were creating many devine explosions as praise unto manley during this time the prophet jebediah was growing, with each explosion his dedication to be atop the fireball grew ever stronger until one day the almighty manley spake unto jebediah and said “hullo this is scott manley, now the time is upon you, go forth unto the recruitment center for ksc needs a pilot, and with you you must take bill, bob and val for they will\u003Cbr\u003E\nbe those who stand by you and fix your many mistakes” and thus spake the almighty scott, whose sentence finished with “fly safe”\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nand so the prophet jebediah moved unto the space center where upon he was first in line with his friends as the almighty manley had informed him so the faithful may enter first and thus they\u003Cbr\u003E\nbecame the orange suited kerbals the first few (they ran out of dye after that) who would forever be first into space but this came at a cost that would strain the almighties power as he and his friends were also always first in whatever craft the engineers in the VAB or SPH would contrive and so many of them, in those early years were condemned to failure and so the almighty manley decreed that whensoever the builders of the craft grew frustrated after failure after failure he would appear and provide guidance but the almighty youtube, the abode of his mightiness may only be opened in times of great need or extreme boredom but the teachings he makes must be dereed to all kerbal kind and for that task the almighty manley decreed that “the manleyscripts” be written as his one true word of all teachings that may allow kerbals to reach the depths of the cosmos that they were created to.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nPassage 3.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nAttila 1:1\u003Cbr\u003E\nNow it came to pass, that some among the children of our lord Manley did prosper exceedingly, even unto pride in themselves, for they had much funds and science and all manner of precious contracts, and reputation they had plenty.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nAnd boastfulness did enter into their midst, and lay hold on their hearts, insomuch that they did begin to forget the Manley. But Jebediah, a pilot of foolhardiness and reverence, would not suffer himself to be conquered by darkness, but kept himself firmly rooted in the ways of our lord Scott Manley. And he sought after the welfare of his people, that they might not dwindle in unbelief. But all who spoke with him grew angry with his words, for they said, “Who art thou? that thou shouldst condemn us for our great wealth? Are we not greater than all of Kerbin, and this because of our wisdom and skill?” Thus did they speak, and boast in themselves.\u003Cspan\u003E \u003C/span\u003E\u003Cbr\u003E\nAnd Jebediah feared lest lord Manley should judge them according to their wickedness, so he went up into the mountains over KSC to pray unto our lord Manley, and entered into the cavity of a rock, but there were no words to express his heart, and he knew not what he should say.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nBut behold, the light of the boosters, as Scott Manley came down from the heavens, and rested near him, even that it did fill the whole cave with the light of fire. And he did find the words to express his heart, and knew that our lord Scott Manley was there with him, therefore he did speak boldly, and as one kerbal speaketh unto another, concerning his kerbals.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nAnd when he had offered up the desires of his heart unto Manley, he returned again to the KSC. And the kerbals marveled, for the light of our lord, Scott Manley had wrought upon his countenance, that it was changed. Yea, he had been made green every whit by the power of his holiness, the great Scott Manley, our eternal lord and savior, and the people beheld him in silence. So Jebediah spoke unto them in great power; and the fire of the lord’s boosters again rested near him, and he said: Remember, my brethren, and never forget what great goodness Scott Manley has given us! For He is perfection, and all that we do enjoy, yea, all that we do know doth come from His goodness. And the light of Scott’s boosters did radiate from his countenance, even that it filled the whole biome with fire, yet none were burned. And thus was known he is the one true prophet of our lord, Scott Manley, for he spoke the word of Him; and many other things did Jebediah say unto the kerbals which cannot be written, so great was the glory thereof.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nPassage 4.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nAttila 1:2\u003Cbr\u003E\nNow it came to pass that the kerbals of the grasslands began to be tormented exceedingly, for there was in that land a great kraken. And it did visit the launch pad in the nighttime, that it was not seen, and did lay hold on many rockets. And as many as were destroyed by it were never heard from more. So Bill, an engineer of great merit in the eyes of the kerbals, said within himself, What is this beast, that it doth seek to destroy the rockets of the kerbals? So he went unto the prophet Jebediah and said unto him, Behold, I will slay the kraken. But the prophet turned himself from before the face of Bill, and he said unto him, Scott Manley shall bring judgment unto all on the day of the battle of ages. Why seekest thou to hasten the rightful hour of this demon\u0027s reward? Now Bill cherished his own life, therefore he did speak unto the prophet with harshness, saying, I am a mighty kerbal, and lo, I will slay the demon in order that I and my brethren might not perish. But the prophet spoke to the sky, for Bill would not give heed, and said, All will be brought to stand before you, o hallowed Manley, and the kerbals will deliver the wicked into your divine judgment, where their sins will be weighed in the balance of all that is just and true. Nevertheless, until that day we will suffer the burdens that you in your wisdom see fit to give unto us.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nBut Bill left the prophet in anger, supposing that he knew of himself, and sought after the kraken. And as he flew in his plane, behold, the kraken did hover in wait for him, that thereby it might take him in ignorance. And the kraken did find success in this thing. Yea, it did lay hold on Bill, and blown his plane to bits.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nAnd thus we see that those who are prideful and refuse to bow down shall be laid low and made unto dust. And it came to pass that the kraken grew tired, and went back to the sky. But the mighty and just Scott Manley, our lord and savior was waiting for him. And the souls of all those whom the kraken had slaughtered were weighed against it in the divine balance. And the kraken was found wanting, and received its condemnation in everlasting darkness, which the prophet in his patience had foretold.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px;\u0022\u003E\nPassage 5.\n\u003C/p\u003E\n\u003Cp style=\u0022margin:6px 0px 0px;\u0022\u003E\nalex 2:1\u003Cbr\u003E\nthe kerbals, innocent in their naivety sourt much guidance from the almighty manley. the first occurrence of the all powerful scott bestowing his infinite wisdom upon the prophet jeb and his devout engineers so that they may exceed all other kerbals in the race unto the holy space. the situation was grave, the prophet jeb had died 3 times thus far in the pursuit of success but they had had no luck, so the prophet jeb took a rover unto the hills above the planes and found a cave and spoke unto manley. jebediah spake thusly “why for will this craft not fly, for it hath both wings and engines yet it flies not straight!” the almighty scott spake unto jeb and said “hullo this is scott manley. thou craft, tho good in construction and thrust flies not well for you center of the lifting forces of thy wings rests firmly in front thy center of mass. thou must place the center of mass firmly in front or inline with the center of lift for else your craft will fly not straight, now go and fly safe!” and thus the great lord manley had spoken and returneth the prophet jeb unto the space plane\u003Cbr\u003E\nhangar and he spoke unto the head engineer as he descipeded his encounter with the almighty manley and relayed his advice, and jebediah spake “remove the wings from the nose cone and place them by the cockpit so that our holy col is inline with the com” then up spake a young kerbal and asked “how for may me see this holy col and jebediah spake, “the almighty scott manley declares that we shall press buttons on the left of the screen until the holy blue ball and arrow be visible.” not long after the divine alterations had been made the young jebediah returned unto scott and spake thusly, “our engineers did follow your recommendations most precisely my lord but another issue has come to light forthwith, for now thou most sacred of craft whilst not take off.!”\u003Cbr\u003E\n“well now my young kerbal” spake the almighty scott “thou haveth gone to far, thou must place thy center of mass only just behind thy holy center of lift else thou craft will barly steer, the closer thou places the center of mass to the holy center of lift the more maneuverable thy craft will become! now go, with this knowledge unto the faithful engineers so that you may build many great craft, and thus was the first and second teaching of the almighty god scott manley.\n\u003C/p\u003E\n\u003Cdiv style=\u0022border-left-width:2px;border-left-style:solid;border-left-color:rgb(220,222,227);padding-left:12px;\u0022\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-12T01:22:36Z\u0022 title=\u002201/12/2016 01:22  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 12, 2016\u003C/time\u003E by amankd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2016-01-12T02:02:17Z","Content":"\n\u003Cp\u003E\nOh man, those pictures! Someone has to send these to him. It would tickle his ego.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Eedit\u003C/strong\u003E: \u003Cem\u003EI just read that text, or rather some of it. You put a lot of thought into this. That scares me. \u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-12T02:04:07Z\u0022 title=\u002201/12/2016 02:04  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 12, 2016\u003C/time\u003E by Majorjim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2016-01-12T05:01:34Z","Content":"\n\u003Cp\u003E\nOh mah gawd. Dem edits doh. Dayumn.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I would register my support, but I don\u0027t have FaceBook. Have my official support from the KSPForums instead!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-12T05:03:49Z\u0022 title=\u002201/12/2016 05:03  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 12, 2016\u003C/time\u003E by SpaceplaneAddict\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Greenhornet553","CreatedById":154907,"CreatedDateTime":"2016-01-12T09:13:23Z","Content":"\n\u003Cp\u003E\nThe pictures.... why\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t believe I actually read the whole thing, I would like to open the page but ATM my internet hates me. I am definitely supporting this.\n\u003C/p\u003E\n"}]}