{"TopicId":137920,"ForumId":39,"TopicTitle":"Cinematic ---Duna to Kerbin aerobrake","CreatedByName":"Friend0rags","CreatedById":162639,"CreatedDateTime":"2016-04-23T23:34:39Z","PageNum":1,"Articles":[{"CreatedByName":"Friend0rags","CreatedById":162639,"CreatedDateTime":"2016-04-23T23:34:39Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/h6ptDOImuFs?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s the best video editing software? Any tips?\n\u003C/p\u003E\n"},{"CreatedByName":"MrMeeb","CreatedById":84238,"CreatedDateTime":"2016-04-24T12:39:44Z","Content":"\n\u003Cp\u003E\nHey! Not a bad (first?) try!\n\u003C/p\u003E\n\u003Cp\u003E\nTo start with a few initial pointers to really get what I feel to be a cinematic look, I would recommend keeping the GUI off and the mouse off the screen the whole time. Of course, this would depend on what you\u0027re going for. If you\u0027re going for a full-blown movie style cinematic, I would think this to be essential. Otherwise, immersion can suffer. I do admit that this will make playing the game in order to get the shots more difficult (Shift - F5 and Shift - F9 will become your best friends! \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E), it really does pay off. This video has a lot of good shots too, with some nice framing. What I did for \u003Ca href=\u0022https://youtu.be/IBTQxanCbC0\u0022 rel=\u0022external nofollow\u0022\u003Emy very first try\u003C/a\u003E was play the game as normal, recording the whole time, and when it came to getting the shots, I\u0027d just line everything up, turn off the GUI and there you go. I\u0027d then cut out everything else later on in editing software (we\u0027ll get to that), and boom! You have a pretty gnarly looking cinematic.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore getting on to video editing software, I want to quickly point out a couple of mods that can really make your cinematics flourish. The one mod I use \u003Cem\u003Ejust for making films \u003C/em\u003Eis Camera Tools. It will really give you some more flexibility in your shots, especially with the new camera pathing tool that\u0027s on its way in. \n\u003C/p\u003E\n\u003Cp\u003E\nIn terms of editing software, personally I use Sony Vegas Pro 13. However, Windows Movie Maker is nothing to shake a stick at! (Really!) It\u0027s a good place to start, as it makes you focus on the quality of the shots you\u0027re producing, without bogging you down in a new editing environment with lots of shiny features. There are a collection of other free ones, and you can find lists of them elsewhere, and I know that other people also enjoy using Adobe Premier. \n\u003C/p\u003E\n\u003Cp\u003E\nThere are of course a great number of tricks of the trade that I will leave you to find yourself. After all, I\u0027m still learning too \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E  \n\u003C/p\u003E\n\u003Cp\u003E\nNow, my turn to ask a question...where\u0027d you get that music from? I like it! \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nFinally, if you wanna check out my latest cinematic, you\u0027re more than welcome to! It might give you some ideas:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/bAR14XppOu0?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMaking cinematics can be real fun! I hope to see you around some time \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  \n\u003C/p\u003E\n"},{"CreatedByName":"Friend0rags","CreatedById":162639,"CreatedDateTime":"2016-04-26T20:34:41Z","Content":"\n\u003Cp\u003E\nHey thanks for the pointers.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSong was just a stock Youtube Track; had to replace Hans Zimmer.\n\u003C/p\u003E\n"}]}