{"TopicId":138189,"ForumId":39,"TopicTitle":"Stock Ion probe at Duna","CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2016-04-26T18:00:06Z","PageNum":1,"Articles":[{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2016-04-26T18:00:06Z","Content":"\n\u003Cp\u003E\nBeen spending the past week watching various Blender tutorials - thanks to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/57681-esinohio/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257681\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57681-esinohio/\u0022 rel=\u0022\u0022\u003E@esinohio\u003C/a\u003E for the links! Decided to put some of what I\u0027ve learned to use. It was annoying to find that I still only had a general idea of how things worked and I had to go back and reference several videos again to figure out what to do for some things but in the end after about 8 hours of work, including render time, I finally ended up with something that I found satisfying. Scratched that itch for a bit!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/ukxOp/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe trickiest part was the lighting, since I was adamant about getting the sun in the shot I knew the probe was going to be really hard to see. I made the dish more reflective and found a good angle for the probe to catch sunlight as well as Dunashine after I moved the probe in closer, although I still had to bump up the Gamma a bit in composite and re-render the probe at a much higher sampling so I could brighten it without showing much lighting artifacts. Turning it so the battery was visible let me use its LED as an emissive as well. The Ion stream is created by embedding a torus shape ring into the engine model as an emissive and then having it wrapped by a cone shape set with a volumetric shader. Was originally planning to use a RenderLayer for the probe in composite so I could access the emissive channel but that didn\u0027t prove useful so I just rendered everything out as images and composited them for the final result.\n\u003C/p\u003E\n\u003Cp\u003E\nMany thanks again to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/83990-starwhip/\u0026amp;do=hovercard\u0022 data-mentionid=\u002283990\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/83990-starwhip/\u0022 rel=\u0022\u0022\u003E@Starwhip\u003C/a\u003E for the planet models and hopefully he continues to work on his Kerbol System modeling project!\n\u003C/p\u003E\n\u003Cp\u003E\nIf anyone wants to check it out, \u003Ca href=\u0022http://www.blade-edge.com/misc/Duna%20and%20Ike%20Sun%20Ship%20Composite.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u0027s the blend file\u003C/a\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2016-04-26T18:08:03Z","Content":"\n\u003Cp\u003E\nLovely render! I like the ion trail especially.\n\u003C/p\u003E\n\u003Cp\u003E\nThe sun bugs me a little though. Lens flare in Blender is a tricky beast, which is why I usually do that in another program. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2016-04-26T21:59:45Z","Content":"\n\u003Cp\u003E\nstaying in Blender was a constraint I made for myself. I\u0027ve seen in done better in the tutorials I\u0027ve watched but I wasn\u0027t willing to go back and review them. For my first attempt, I\u0027m happy with how it turned out. What other program do you use?\n\u003C/p\u003E\n\u003Cp\u003E\nYea I\u0027m extremely happy with how well the ion trail turned out, was way easier than I thought it would be. That was the biggest thing I had to sort of cobble together on my own, although \u003Ca href=\u0022https://www.youtube.com/watch?v=N8wLd4Lob-o\u0022 rel=\u0022external nofollow\u0022\u003Ethis video\u003C/a\u003E helped\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-26T22:01:13Z\u0022 title=\u002204/26/2016 10:01  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 26, 2016\u003C/time\u003E by Gaiiden\u003C/strong\u003E\n\u003C/span\u003E\n"}]}