{"TopicId":147317,"ForumId":39,"TopicTitle":"3m/s To Spare","CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-09-09T02:53:45Z","PageNum":1,"Articles":[{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-09-09T02:53:45Z","Content":"\n\u003Cp\u003E\nI don\u0027t usually post here so I\u0027m not sure if this is the right place. It qualifies as a (brief) recounting of a recent mission though.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027m playing Strategia and my own upcoming contract pack, Parts Unlimited, and I got the strategy to land probes on Mun. Due to my contract pack\u0027s weird way of getting parts, I only had a handful of parts unlocked (though I chose each and every one of them, many for this specific mission). Most of my buildings were still the lowest tier including \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and launchpad, and I was tight on money so I made the barest bones probe I could.\n\u003C/p\u003E\n\u003Cp\u003E\nI didn\u0027t realize just how tight I\u0027d cut the margins until I noticed coming down that I only had a couple dozen m/s more than my surface velocity left in the tank. I white-knuckled the keyboard and nailed the landing, with 3m/s to spare.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223ms.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://pulpaudio.com/ksp/3ms.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhew!\n\u003C/p\u003E\n"},{"CreatedByName":"Freshmeat","CreatedById":111048,"CreatedDateTime":"2016-09-09T13:32:27Z","Content":"\n\u003Cp\u003E\nI\u0027ve managed to run out of fuel so low that the lander sat down unharmed, but I had landing legs to take the impact. Props to you for a perfect fuel budget.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-09-10T03:21:19Z","Content":"\n\u003Cp\u003E\nI once docked something to a giant mothership. I can\u0027t remember if I had 2 or 0.2 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E left afterwards.\n\u003C/p\u003E\n"}]}