{"TopicId":151350,"ForumId":39,"TopicTitle":"Tales of the Groundbound: A Hand Into The Black, Chapter 12","CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2016-11-02T17:02:31Z","PageNum":1,"Articles":[{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2016-11-02T17:02:31Z","Content":"\n\u003Cp\u003E\nChapter 12\n\u003C/p\u003E\n\u003Cp\u003E\nDirec fumbled for the handset of the ringing phone in the darkened bedroom.\n\u003C/p\u003E\n\u003Cp\u003E\n“Hello,” he said having gotten the handset to his head on the second attempt. He listened to the response from the other side. His mind churned with sleep, the active flight plans, and why Gene would still be at the office. “Gene, do you know what time it is?”\n\u003C/p\u003E\n\u003Cp\u003E\nHis wife rolled over and muttered something indistinct.\n\u003C/p\u003E\n\u003Cp\u003E\n“Hang on, Gene. I’m changing phones.” Set the handset down on the nightstand and left the room. Two voices came tinny and indistinct through the handset.\n\u003C/p\u003E\n\u003Cp\u003E\nHe came back into the bedroom and placed the handset back in the cradle. He looked into the mirror over the dresser and ran his hands through his hair. He exhaled slowly.\n\u003C/p\u003E\n\u003Cp\u003E\n“Sorry dear,” he said as dressed in the dark room. ”I’ve got to go into the center.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Okay,” she said sleepily. “Bring back a loaf of bread and a carton of milk.”\n\u003C/p\u003E\n\u003Cp\u003E\n“And a stick of butter,” he said as he closed the bedroom door.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Mmm, right,” she said to the empty room.\n\u003C/p\u003E\n\u003Cp\u003E\nDirec walked into the briefing room. The tables had been pushed into the center of the room. They were covered in papers. The chalkboard was covered in calculations and diagrams. Some were half erased, others were over written by others.  The cool night air from outside mixed with the smell of coffee and pizza. He shook his head to clear memories of university and being a young engineer.\n\u003C/p\u003E\n\u003Cp\u003E\nGene, Gus, Linus, Jebediah, and Valentina were standing around a table.\n\u003C/p\u003E\n\u003Cp\u003E\n“Just like school,” Direc said.\n\u003C/p\u003E\n\u003Cp\u003E\n“Don’t know about you,” Linus said. “But, my projects were harder, but slightly less… exciting though.”\n\u003C/p\u003E\n\u003Cp\u003E\nDirec walked over to the table. “Okay,” Direc said. “I’ve got the overview. Now the details.”\n\u003C/p\u003E\n\u003Cp\u003E\n“About 7 hours ago, a ship owned by Experimental Engineering Group‎ experienced catastrophic structural failure.” Gene said. “The lone occupant is unharmed, and the situation is currently stable. Around that time we received notification of the incident through our monitoring network. Six hours ago, we made informal inquiries to Exp Eng. At that time they were assessing the situation and their deployable assets. Two hours ago, again through informal channels we were notified that they intend to formally request assistance.”\n\u003C/p\u003E\n\u003Cp\u003E\nDirec looked at them. They had been working on this for more than two hours.\n\u003C/p\u003E\n\u003Cp\u003E\n“Okay,” Direc said. “So, what do your friends over there say?”\n\u003C/p\u003E\n\u003Cp\u003E\nGene looked around the table awkwardly. It was still a small community, despite the large number of organizations launching. But, talking to competitors outside of formal channels could create problems. “The capsule is patched. But they figure there’s still a small leak somewhere. He’s got about a day of air left if they can’t find it; longer if they do. The orbit is mean 170 km, delta 20, inclination 10. He was about to square it up when something blew out. They’ll pick apart the telemetry later. But, they want him home first.”\n\u003C/p\u003E\n\u003Cp\u003E\nDirec nodded. “What’s our plan?”\n\u003C/p\u003E\n\u003Cp\u003E\n“We have an O-Basket launching in two days. If we strip out the third seat and comforts, downsize the support, fill all the tanks to max, and time the launch right we can do it. Once the two ships rendezvous, their pilot EVAs to the OB and climbs in. They\u0027ll do a braking burn at AP and return to the surface.”\n\u003C/p\u003E\n\u003Cp\u003E\n“There’s a ‘but’ isn’t there?”\n\u003C/p\u003E\n\u003Cp\u003E\n“There’s no margins,” Linus said. ”One pass, that’s it. We’ll have just enough delta V at the top to get it low enough to start aerobraking. We’ll have no control over where they come down. We spend too much of it at rendezvous, launch, or the rendezvous burn, neither of them come home.”\n\u003C/p\u003E\n\u003Cp\u003E\n“A lot of reasons to say no,” Direc said.\n\u003C/p\u003E\n\u003Cp\u003E\n“Sir,” Valentina said. “If it was one of us up there you’d chance it with less.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Yes, I would.” Direc said. “But, it isn’t.”\n\u003C/p\u003E\n\u003Cp\u003E\nJebediah looked down from having stared at the ceiling through most of the conversation. “On the brown side it’s us, them, and others,” he said. “In the blue it’s us and them.” He shook his head as if clearing a memory. “Up there, up in the black, looking down, there is no them, no other, just us.”\n\u003C/p\u003E\n\u003Cp\u003E\nThe phone on the wall rang. Gene walked over and answered it. “Director,” he said. “It’s the chairman.”\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-15T14:51:37Z\u0022 title=\u002202/15/2017 02:51  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 15, 2017\u003C/time\u003E by steuben\u003C/strong\u003E\n\u003C/span\u003E\n"}]}