{"TopicId":156435,"ForumId":39,"TopicTitle":"Kerbal Instrument Panel: In-Desk Apollo Themed Hardware Controller","CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2017-02-14T09:49:52Z","PageNum":5,"Articles":[{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-08-02T10:31:57Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022MV5LOmH.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002275.30\u0022 height=\u0022903\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/MV5LOmH.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo I found the best of both worlds! The low cost of a hall effect based magnetic sensor, and the fit and finish of a production absolute position encoder. I do believe internally, these are off the shelf hall effect rotational position sensors. The screws that attach the mounting plate were all stuck to the back, right at the center. That\u0027s where I\u0027d expect the magnet to be on one of these types of sensors. Externally, it\u0027s all in a nice anodized housing, with mounting brackets and a ball bearing mounted shaft. It\u0027s everything I could want!\u003Cbr\u003E\u003Cbr\u003E\nThese are connected to power (5 volts DC) and they output an analog value that ranges between 0-5 volts. I can read that using an ADC pin on an Arduino, which has a 10-bit resolution. That\u0027s good for 1024 steps!  The tape meter will only have 144 lines of numbers, so 1024 steps is more than enough resolution. It\u0027s actually good for 7 steps per line. I still don\u0027t have the timing pulleys and belt yet... Despite whatever claims China makes regarding having the current \u0022situation\u0022 under control, I believe it as far as I can throw the Great Wall. I am STILL having issues with Chinese suppliers, and strongly suspect they aren\u0027t all back at 100%... Given I am still encountering no-ship issues, I suspect some of the suppliers are not even operating at all. I don\u0027t exactly trust that government, but I do hope the people there are actually recovering.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I ordered two of these parts. One is for the tape meter, and the other will be for the carriage meter. I still need a 6:1 ratio timing pulley with an extra small pulley to do the tape meter. The 6x tooth pulley will mount to the sensor, so it takes 6 turns of the motor, and 6 turns of the tape meter shaft for one turn of the sensor. That will map 1024 locations along the entire length of the tape, back to the beginning. I want to try and find some kind of PID program to control the motor using the sensor position as the feedback. Most PID loops read a digital encoder, but I can likely get pulses per second and direction by timing the change and direction of increment, or the analog value of the sensor, which matches a 1024 position encoder anyway. Doing it this way means I only need to update the value of the tape meter, and the program seeks the newly updated position and holds it. If the position changes, it should try to match the rate of change. As long as the PID loop is done right, it should just always work. Heck, there might even be a dedicated PID capable motor driver chip that I could use to handle the tracking in hardware... I\u0027d be able to use a DAC to output a 10-bit analog value, and then I need only transmit a value for every frame of data, and the tape would handle itself in hardware!\n\u003C/p\u003E\n\u003Cp\u003E\nNow, in regards to the carriage meter, I\u0027ve been looking at an old school electronic word processor\u0027s carriage mechanism. It has a stepper motor attached to a pulley, and it slides the print head back and forth on a steel shaft. If I cut it down to size, I might be able to fit it in as my carriage meter. I don\u0027t yet know the ratio of turns needed to make it work, but I also strongly expect I can likely get the full range reduced to a single rotation of the sensor. This would give my DeltaV readout 1024 steps from the start of a burn to the end of a burn. I\u0027d probably want to copy the same PID loop as the tape meter, however, this one would have to be an end-to-end type system, with endstops, while the tape meter is a continuous loop. With the tape meter, It can do stuff like spin backwards to go directly from \u0026gt;9999m to 0m, in the case of a vessel change or reset. The tape meter wouldn\u0027t need to spin all the way down from the \u0026gt;9999m line down to 0m. The carriage meter needs to know where the top and bottom limits are, and has to move through the normal range to get from one part of the range to another. I\u0027d like to implement the PID into both, in order to smooth out steps, if at all possible. I might also be able to get away with driving it using simple DC brush motors, or a brushless with a controller.\u003Cbr\u003E\u003Cbr\u003E\nAs  a final note... I REALLY like the build quality and even the anodizing color. That\u0027s a beautiful green, and it\u0027s truly a shame to hide such a Kerbalish color inside the unit... Absolutely tragic! Almost as tragic as the number of times I\u0027ve had to order parts before it even got shipped out to me! \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nShould anyone need parts like this, I spent about $16 a piece for them, and ordered them from Aliexpress. $16 is way more than the \u0026lt;$4-5 hall sensor boards available, but this has everything... The bearing, the mounting bracket, the shaft, all in one convenient package. WELL worth the increase in cost. Interestingly, the bracket isn\u0027t metal. It\u0027s actually a circuit board! I\u0027ve been seeing this more and more... Instead of cutting some custom metal bracket, just make a circuit board with the correct holes and shape drilled and cut into it. Easier to machine and produce than metal parts too, but still more than sturdy enough for the task.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-08-02T10:45:21Z\u0022 title=\u002208/02/2020 10:45  AM\u0022 data-short=\u00223 yr\u0022\u003EAugust 2, 2020\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-09-15T02:19:22Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022veV1YYQ.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002266.00\u0022 height=\u0022791\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/veV1YYQ.jpg\u0022\u003E\u003Cbr\u003E\nEvery job is easy when you have the right tool. That bevel gear was held onto that shaft with loctite, a set screw, and a locktite bonded roll pin... For a \u003Cu\u003E\u003Cem\u003Eflippin\u0027 tape meter!?\u003C/em\u003E\u003C/u\u003E They literally don\u0027t build \u0027em like they used to. This was merely a display device for a dial on a piece of high end 1960s era test equipment! I tried several times to remove the roll pin, but it was very tight in it\u0027s hole. My press wasn\u0027t big enough to give me enough leverage, and I didn\u0027t have a V-Block the right size to securely rest the bevel gear on. Took it to work, asked my boss if he had a push pin and block that\u0027d work for it... Took literally 3 minutes to find the tools and do the job. I had to smile when he mentioned he made the narrow V-Block himself, way, way back when he was in shop class. That\u0027s a satisfying feeling... To know a tool a man has created himself is still getting regularly used, decades later. I love it! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mvPyeIe.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.65\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/mvPyeIe.jpg\u0022\u003E\u003Cbr\u003E\nThis pic is an old one, but is relevant here. It shows the clearance available around the underside of the navball... And yeah... I ended up deciding the hardest arrangement would be the most ideal arrangement. The navball is just too far shifted left, and I want to bring it closer to the center of the instrument panel. It\u0027s just too important an instrument to be off to the side. This helps. I initially had been looking at some larger timing pulleys, but found some smaller diameter ones. The small pulley is only half the diameter of the bevel gear. I\u0027ll unfortunately need a very long belt (the second longest the manufacturer offers, in fact). They are currently backlogged, due to the pandemic, and are not even currently selling the large belt separately. I\u0027m still waiting for a reply to find out if I can \u003Cem\u003Eeven get\u003C/em\u003E the long belt. You can see a 1:1 scale drawing of the navball instrument, as viewed form the side and bottom. This configuration requires the use of an idler wheel, which I\u0027ll make with a pair of ball bearings, as seen. There is a valid alternative solution though... If I buy a dual shaft motor, I could theoretically use two shorter belts. One short belt and two small 1:1 pulleys on one side of the motor. The other side will have a 1:6 ratio, and be farther back, enough to allow the sensor wheel to sit behind the navball. I need to order the pulleys ASAP, if I want them in October yet. Sadly, no US sources, and the Chinese sources are all struggling to keep up... This is gonna be a difficult purchase, to say the least. Still trying to get some other parts since \u003Cem\u003EMay!\u003C/em\u003E \u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022yQk6e6J.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.92\u0022 height=\u0022671\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/yQk6e6J.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-09-15T11:40:20Z","Content":"\n\u003Cp\u003E\nUpdate...\u003Cbr\u003E\u003Cimg alt=\u0022WxLVARa.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002254.76\u0022 height=\u0022657\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/WxLVARa.jpg\u0022\u003E\u003Cbr\u003E\nI worked out a belt arrangement (in red) that uses the stock belt that comes with the 6:1 ratio timing pulley set I found, plus a second pair of 1:1 pulleys and a second belt. I didn\u0027t worry about the specifics of adding the idler wheel into the mix, as this arrangement can work without the idler, though I may or may not add the idler just to bring the sensor wheel closer to the back of the Navball housing.\u003Cbr\u003E\u003Cbr\u003E\nI also found a planetary gear motor with a 6mm diameter, 42mm long shaft... This is \u003Cem\u003EPERFECT!!!\u003C/em\u003E I added a pair of 12 tooth timing pulley wheels with a 6mm ID to the order, so now I have 4 pulley wheels, 2 belts, a motor, and a flange adapter to fit the large 10mm ID 72 tooth wheel to the diameter of the absolute position sensor\u0027s 6mm shaft. The 6:1 ratio pair also had the 12 tooth wheel with the 6.35mm ID part, so it fits the Tape Meter\u0027s drive shaft. ALL the parts to complete the drive mechanism of the Tape Meter are now on order! Now let\u0027s all hope the three suppliers pull through. I upgraded all shipping to a tier with tracking. Cost a little more... worth it.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m really excited about this! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nI was tempted to keep on trying to figure out what I need for the Carriage Meter as well, but I wanted to get this \u003Cem\u003EON ORDER NOW\u003C/em\u003E, since this stuff could \u003Cem\u003ESTILL\u003C/em\u003E take till October 22 to reach me... if it all even ships... I can really only work on one thing at a time anyway, so really... There isn\u0027t any point in rushing the other parts. I can work those out while I wait for this, cause I ain\u0027t getting any more work done on this till the parts show.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-12-21T14:11:16Z\u0022 title=\u002212/21/2020 02:11  PM\u0022 data-short=\u00223 yr\u0022\u003EDecember 21, 2020\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003Cbr\u003EALL THE TAPE METER DRIVE PARTS ARE OFFICIALLY ORDERED!!!\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-09-20T11:32:07Z","Content":"\n\u003Cp\u003E\nSo, the last week has been... Hectic... I ordered all the parts, all centered around that *perfect* motor I\u0027d found...\u003Cbr\u003E\u003Cbr\u003E\nThe supplier on AliExpress never updated their stock, and had run out, and were not getting more. Just \u003Cem\u003Egreat\u003C/em\u003E... \u003Cimg alt=\u0022:huh:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 title=\u0022:huh:\u0022\u003E\u003Cbr\u003E\nSo I look elsewhere, and find the same type of motor on Ebay the next day...\u003Cem\u003E IT WAS THE \u003Cu\u003E\u003Cstrong\u003ESAME\u003C/strong\u003E\u003C/u\u003E SELLER!!! \u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003C/em\u003E\u003Cbr\u003E\nI didn\u0027t know whether to laugh or scream or both... Ugh! \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nAnyway, the issue, is all the timing pulleys had already been ordered, and the ones for the motor had 6mm IDs. The motor I found had an extra long 6mm shaft, that would let me reliably mount a pair of pulley wheels to, rather than just one. Larger motors that typically had shafts that long tended to be either 8mm shafts or threaded screw shafts. Smaller motors with 4mm shafts just weren\u0027t long enough to secure two pulley wheels. I searched for a solid week, trying to find the right motor, and kept up coming up short. In the end, I came up with a remarkably simple solution that will let me use the parts already ordered, with one of the more common 4mm shaft motors.\u003Cbr\u003E\u003Cbr\u003E\nA brass tube. 6mm OD, 4mm ID. I\u0027ll Loctite the brass tube over the 4mm motor shaft, essentially installing a 6mm shaft onto it. It\u0027s super simple! If I wanted to, I could even get a longer set screw on the inner timing pulley wheel and drill out the brass tube over the motor shaft\u0027s flat, allowing the inner motor to have a set screw set against the 4mm motor shaft. Would be simple enough. Anyway, the diagram below should make the plan clear. As I said, it\u0027s actually a super simple solution!\u003Cbr\u003E\u003Cimg alt=\u0022jbAZQbX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002231.73\u0022 height=\u0022380\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/jbAZQbX.png\u0022\u003E\u003Cbr\u003E\nAnd since I can cut the brass tube to whatever length I like, I also went ahead and purchased a few 6mm ID ball bearing pillow blocks, so I can actually support the end of the shaft. There will be pulleys tightened up on these, and they aren\u0027t going to be 180° out, so there will always be a directional force pulling on that motor shaft. The extra support will help reduce wear on the motor.\u003Cbr\u003E\u003Cbr\u003E\nThe motor was selected for it\u0027s peak output speed, and voltage range. I selected a 6 volt rated motor, as that\u0027s a voltage I can easily drive off of a small motor driver board, controlled by an Arduino. The peak no load speed is 280 RPM. divided by 60, that\u0027s 4.6 RPS, or approximately 1.3 seconds to perform a complete cycle (6 rotations of the tape drive input shaft). For a position reset, since the halfway point on the tape is 3 turns to home position, it shouldn\u0027t take more than about .64 seconds to reset the tape meter, if it ran at peak speed. In reality, it\u0027ll be slightly slower, as one must accommodate for ramping up motor acceleration, and then ramping the motor speed down again to stop. I can\u0027t imagine a reset taking more than 1 second, even taking motor ramping into consideration.\u003Cbr\u003E\u003Cbr\u003E\nFor practical display purposes, the motor would run at a much lower speeds. It\u0027ll certainly be PWMed. I haven\u0027t determined how I\u0027ll correlate desired position/sensor position error into motor command yet. I could do it a few ways. A proper PID controller driven off the error would likely work. I could also possibly do a lookup table of error/rate of change/motor speed values, so the system just drives motor at X voltage based on degree of data/sensor error.\u003Cbr\u003E\u003Cbr\u003E\nFurthermore, if I discover that I can\u0027t get a fine enough resolution of motor control, I DO have some motors on hand already that are geared much lower. I can still mount pulleys on them using the brass tube. The lower gearing means finer control, at the expense of rapid tape movement. What that would mean is that a... Rapid unplanned decent might get tape lag, and that tape resets would probably take a few seconds. I have considered, in addition to the aqua green LEDs to edge light the tape, the addition of red LEDs to indicate rate of change exceeds the instrument\u0027s capability. Basically, if error increases at max motor speed, the red lights come on to indicate tape meter value is unreliable, and to fold your tray tables in the upright position, place your head between your legs, and kiss your retrograde surface goodbye... Cause you\u0027re probably not gonna slow down in time to nail the landing... Only \u003Cem\u003Eyou!\u003C/em\u003E \u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-09-20T12:03:33Z\u0022 title=\u002209/20/2020 12:03  PM\u0022 data-short=\u00223 yr\u0022\u003ESeptember 20, 2020\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-10-15T16:36:58Z","Content":"\n\u003Cp\u003E\nSmall updates... I\u0027ve got the bearings, the steel tube, the flange adapter to mount the large pulley wheel to the 6mm absolute position sensor shaft...\u003Cbr\u003E\nThe timing pulley wheels and belts are also already in the USA (currently sitting in some facility in Greenwood Indiana)...\u003Cbr\u003E\nAaaaand... The motor is \u003Cem\u003Estill stuck \u003C/em\u003Eat the airline in China.\n\u003C/p\u003E\n\u003Cp\u003E\nI still have no idea if it\u0027ll even get shipped. Apparently, a lot of small packages ship in free belly space on passenger flights, and with the Rona out and about, passenger flights are drastically reduced. New restrictions have barred batteries and magnets on some Chinese flights, and apparently my 4mm shaft motor got hit by that, and Chinese customs refused to load it. It was resent by way of a different shipping method, and has been sitting around \u0022Handed over to Airlines\u0022 for the last 8 days... I have no idea if it was refused a second time, if they just haven\u0027t found a flight with free space in the belly to load it onto, or what... At this point, I\u0027d have been happy for it to ship by slow boat, cause I\u0027d probably have gotten it already!\u003Cbr\u003E\u003Cbr\u003E\nI did have a small product quality scare... The bearing blocks look fine, but the bearings installed look like trash, with one even being dented. I feel 95% convinced I was sold salvaged bearings... Whatever. They aren\u0027t in a precision or a high speed application. If they work, they work... The REAL problem was the brass tube I bought. when it arrived, I measured it, and the outer diameter was spot on at 6mm... Perfect! Inner diameter was... less so... One of the tubes was 4.4mm and the other 4.5. They weren\u0027t even consistent between each other, and they were so out of spec I could never have used them on the 4mm motor shafts! I was VERY unhappy with the product quality. Fortunately, I had also ordered steel tubing, realizing i probably shouldn\u0027t mix a trio of aluminum, brass, and stainless steel all together. I might end up with some sort of galvanic corrosion over time. I ordered stainless steel tubing... And I hoped and prayed that it was closer to spec than the brass garbage was!\n\u003C/p\u003E\n\u003Cp\u003E\nWell, it arrived in the mail today, and the first thing I can say, is the tubes were VERY roughly cut. I had to file and deburr the ends first, before I could take any measurements, but thankfully, I am able to confirm that they were much closer. One is nearly spot on, at 4.02mm, while the other two were a \u003Cem\u003Elittle\u003C/em\u003E wide, at 4.09 and 4.11mm. Ultimately, I have one tube for absolute certain that will work, so I\u0027m fine with it. That\u0027s all that matters!\n\u003C/p\u003E\n\u003Cp\u003E\nNow it\u0027s just a matter of waiting for the timing belt and pulleys to arrive... and to wait for the motor... I\u0027ll also have to figure out how best to frame all the various components together. Probably a sandwich of plates, separated by spacers. It\u0027s simple, and doesn\u0027t require anything more complex than a drill to make.\n\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-10-18T06:47:10Z","Content":"\n\u003Cp\u003E\nOne worry off my back... The motor appears to have been flown, and is now in the US... Or at least in a shipping crate on the far side of US customs. Now I get to wait for it to trickle it\u0027s way into the US mail system. The Pulley wheels and belts arrived on the 8th... And it\u0027s now the 18th. They are still in \u0022Shipping partner facility\u0022, and are technically not in the USPS system yet. 10 days... Looking at other items tracking history... Arrival at the US to delivery was 15 days... Ugh... I\u0027m still looking at a good chunk of next week to get the pulleys and belts, and likely Halloweenish, or possibly even November before I see the motor! I HATE all this WAITING! That motor better be a suitable ratio for what I need! Given the time delays between deciding a part is needed and receiving said part, I sure hope I judged the ratio requirements accurately!\u003Cbr\u003E\u003Cbr\u003E\n**EDIT**\u003Cbr\u003E\nFRIDAY!!! The motor made it into the USPS system, and it is saying delivery Friday! Timing belts and pulleys may or may not arrive by then, but if their arrival and time in transit with a \u0022shipping partner\u0022 match my other shipments, it\u0027ll likely arrive close to the same time. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n**ED2T**\u003Cbr\u003E\nMotor arrived! I was worried about the torque of a motor with such a small gear ratio (at 6 volts it is rated at 280 RPM, so it\u0027s a bit speedy). After some basic testing, I think it\u0027ll be fine. At 6 volts, I couldn\u0027t stop the shaft with my fingers, and current went up from 73mA at no load, to around \u002B400ma, the peak on the small power supply I was driving it from. That leaves me more than confident it\u0027ll run whatever friction a pair of rubber belts add to the system. I also connected a reed switch and battery in series with my pulse counter, and attached a magnet to the shaft, to see if the motor speed matches up with the rated speed. I set a 60 second timer, and released the reset on the pulse counter when I started the timer. When it hit zero, I pressed the hold button, and got a pulse count of 294, which is well within a reasonable margin of error of the rated 280 RPM. Overall, I\u0027m pretty satisfied with the motor.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BUBIc8J.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/BUBIc8J.jpg\u0022\u003E\u003Cimg alt=\u00225VExLCo.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022839\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5VExLCo.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs for the timing belt and pulley wheels... They have been stuck in Greenwood Indiana for the past 10 days...\u003Cbr\u003E\nStoopid™ shipping partner... Pitney Bowes... More like Pitiful Slows... It\u0027s infuriating that the US is being the slow part of this. My general understanding, is that these shipping partners sit at one of the lowest priorities, so will sit and sit until other things are sorted before them. It\u0027s aggravating... If it were closer, I\u0027d consider trying to pick it up in person...\u003Cbr\u003E\u003Cbr\u003E\nAnd further shipping updates... It apparently left the Greenwood shipping partner on the 16th... DAYS ago. It\u0027s \u003Cem\u003Estill\u003C/em\u003E not been received by the USPS system, but at least an update finally got logged. As of my prior edit, that detail had not been logged yet. Hopefully it means \u003Cstrong\u003E\u003Cem\u003ESOON™\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-12-21T14:23:54Z\u0022 title=\u002212/21/2020 02:23  PM\u0022 data-short=\u00223 yr\u0022\u003EDecember 21, 2020\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003Cbr\u003E\u0026quot;I sure hope the gear ratio of that motor is fine!\u0026quot; . . . \u0026quot;It was not fine...\u0026quot;\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-10-30T06:09:20Z","Content":"\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003E\u003Cem\u003EFINALLY!\u003C/em\u003E\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe LAST package from China showed up, delivering my timing pulleys and belts. MONTHS of waiting for parts...\u003Cbr\u003E\nMORE than half a year, and boy, once I had everything, did I ever put things together! There are still parts I need to get...\u003Cbr\u003E\nHardware like screws, etc. The two metal plates, right angle bracket, and a few more spacers, but I\u0027ll explain what\u0027s left to do nearer to the end...\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022h3swMZ5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002273.75\u0022 height=\u0022556\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/h3swMZ5.jpg\u0022\u003E\u003Cbr\u003E\nFirst, I cleaned up the 6mm tube\u0027s ends and slid the two small pulley wheels on.\u003Cbr\u003E\nI left a small amount of clearance for the motor side, to accommodate mounting screws, and secured the left pulley to the tube.\u003Cbr\u003E\nI used my center punch to mark the tube where the two set screws lined up on the right pulley. The right pulley is going to secure the tube to the motor shaft.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022N9QsSMX.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002276.25\u0022 height=\u0022535\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/N9QsSMX.jpg\u0022\u003E\u003Cbr\u003E\nDrilled out and aligned.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00223LjObbv.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002270.50\u0022 height=\u0022504\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3LjObbv.jpg\u0022\u003E\u003Cbr\u003E\nI suppose I could have done this before mounting the pulleys, but ehh...\u003Cbr\u003E\nThe piece taped above is one of the spacers I will be using to create the mounting frame.\u003Cbr\u003E\nI cut the motor shaft tube slightly shorter than the spacer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225j8bm3p.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002287.50\u0022 height=\u0022398\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/5j8bm3p.jpg\u0022\u003E\u003Cbr\u003E\nIn order to secure the 6mm tube to the 4mm motor shaft, I used a hardened steel ball bearing, taken from a gutted ball bearing, and placed it into the hole.\u003Cbr\u003E\nThe set screws are not long enough to go the additional depth without being bound by only a few threads (at least on the flat side of the shaft).\u003Cbr\u003E\nThe ball bearing makes up the difference, and was a simple fix that I could use with on the hand materials.\u003Cbr\u003E\nA 90s laptop HDD motor was \u003Cem\u003Ebrutally\u003C/em\u003E sacrificed for this donation. A hammer and chisel and even a dremel were used. Absolutely nothing survived. Except the BBs.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wH4V52Z.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.00\u0022 height=\u0022640\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/wH4V52Z.jpg\u0022\u003E\u003Cbr\u003E\nHere I demonstrate posing in a \u003Cem\u003Ework like\u003C/em\u003E fashion. No one is fooled. Who is holding the motor? No one, that\u0027s who! No work is occurring here! Like those faked fast food photos on the menu.\u003Cbr\u003E\nIt does allow me to point out that the point of a set screw (or in my case, the ball bearing held by a set screw), is not for the screw to be the primary point joining gear to shaft...\u003Cbr\u003E\nInstead, it applies a directional force that causes friction along the entire opposing mating surfaces. This is much more surface area than just the ball point of a metal sphere.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bcE3cIL.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022135.17\u0022 height=\u0022532\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/bcE3cIL.jpg\u0022\u003E\u003Cbr\u003E\nHere we see the completed motor drive portion of the tape drive assembly.\u003Cbr\u003E\nThis is also a good point to begin explaining how this will go together.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NVrYaX5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022110.75\u0022 height=\u0022523\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NVrYaX5.jpg\u0022\u003E\u003Cbr\u003E\nRegarding the spacers I pointed out above... Well, there will be two parallel plates of metal, secured together by those spacers.\u003Cbr\u003E\nThe left plate will have the bearing block mounted to it, and the right plate will mount the motor. The uniform spacers will keep them properly aligned.\u003Cbr\u003E\nGoing with a pair of plates separated by spacers makes for super simple construction as well. It\u0027s just a pair of plates, and drilling a few holes... That\u0027s it.\n\u003C/p\u003E\n\u003Cp\u003E\nMy \u0022totally not CAD, and drawn with nothing more than a Mac equivalent of MS Paint\u0022 diagram from nearly 2 months ago ended up being spot on! \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThis post is getting pretty long, so I\u0027m gonna end it here, and post the sensor wheel assembly and the total progress in a second post, to immediately follow.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-12-21T14:27:09Z\u0022 title=\u002212/21/2020 02:27  PM\u0022 data-short=\u00223 yr\u0022\u003EDecember 21, 2020\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-10-30T07:03:20Z","Content":"\n\u003Cp\u003E\nAn interesting aside... I spent so much time measuring and planning and getting every detail just perfect in the\u003Cem\u003E design stage\u003C/em\u003E, that I have been able to assemble all of this without the need to actually bring out any measuring tools yet! Oddly enough, the design is intrinsically engineered for each step to support a degree of variability, so that things just sorta fit into place. Align it and tighten it. Just thought that was interesting. Obviously, measuring will be an absolute necessity once I begin to make the two plates. I need everything to line up perfectly, and for all the shafts to be perfectly perpendicular to the pair of parallel plates. Just thought that was an interesting aspect to the way I picked all these parts, and how they\u0027ve all come together. Now, to continue with the sensor wheel assembly:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KM8ZGsw.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022135.75\u0022 height=\u0022968\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KM8ZGsw.jpg\u0022\u003E\u003Cbr\u003E\nI\u0027ve shown the absolute position hall sensor before, but here you see it with the flange adapter.\u003Cbr\u003E\nAs mentioned in earlier posts, the input shaft of the tape meter makes 6 turns to represent one full cycle of the tape.\u003Cbr\u003E\nWe need a 6:1 ratio between the tape drive and the sensor. The large pulley was only available in larger ID openings, too large for the 6mm sensor shaft.\u003Cbr\u003E\nI got a 6mm to 10mm flange adapter, but the set screws stick out, and it was necessary to grind them down to sit flush with the OD.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lx19KMv.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022165.92\u0022 height=\u0022802\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/lx19KMv.jpg\u0022\u003E\u003Cbr\u003E\nSince the sensor shaft isn\u0027t long enough to pass all the way through the large pulley, and since the large pulley, is well... large, we want to support it.\u003Cbr\u003E\nI used a second flange adapter, and more of the 6mm steel tube to create an extended shaft. I used my center punch to mark the flange holes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022X0sdHyf.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022128.75\u0022 height=\u0022819\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/X0sdHyf.jpg\u0022\u003E\u003Cbr\u003E\nI then drilled out those holes. Yet to be done: I still need to tap those holes, and get appropriately sized screws to secure the flange to the pulley wheel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OQJVrpT.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022148.92\u0022 height=\u00221178\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OQJVrpT.jpg\u0022\u003E\u003Cbr\u003E\nHere we can see the fit. Good news, it fits! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022x9XYfm7.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022140.67\u0022 height=\u00221179\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/x9XYfm7.jpg\u0022\u003E\u003Cbr\u003E\nAnd yet another bearing block will be used to support the other end of the sensor pulley. This is just to help take the strain off the sensor itself.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pRvDac0.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022156.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pRvDac0.jpg\u0022\u003E\u003Cbr\u003E\nFinally, we see a rough alignment check. The distances are not representative of the final configuration (the sensor wheel will be set far back).\u003Cbr\u003E\nThe tape meter itself also has it\u0027s pulley wheel mounted. You can see the general alignment of where the belts will go.\u003Cbr\u003E\nThe right plate will extend to align with the front of the tape meter, while the left plate will only reach the rear of the tape meter.\u003Cbr\u003E\nI will cut a custom length set of spacers to align the right plate so it mounts the correct distance from the tape meter housing.\u003Cbr\u003E\nThe left plate will mount to a 90° bracket, that will in turn mount to the rear of the tape meter. Mounting against two different axes should keep it rigid.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, for things left to do...\n\u003C/p\u003E\n\u003Cp\u003E\nI need to get screws and other hardware, as well as fresh Loctite. My old loctite turned from blue to brown... \u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003Cbr\u003E\nThe motor, bearing blocks, none of that came with mounting screws... Of course... The sensor has screws for it\u0027s adjustment plate only.\u003Cbr\u003E\nI also need to find suitable material to use for the plates. Probably go with 1/16 inch aluminum, but I also considered PCB material too.\u003Cbr\u003E\nI need to tap a few holes, based on the screws I end up using, hence why I haven\u0027t tapped anything yet. \u003Cem\u003EEvery\u003C/em\u003E screw will get Loctite too.\u003Cbr\u003E\nI would VERY MUCH like to put that large pulley wheel on a lathe and take out a large portion of it\u0027s mass. It does not need to be so heavy duty.\u003Cbr\u003E\nIf I can cut it down to be mostly hollow, kinda like a car\u0027s rims, with just a thin plate at it\u0027s core, then there will be far less mass for the motor to fight against.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s about it for now. I have to catch up on work, so I\u0027m gonna do that before I work on the plates.\u003Cbr\u003E\nI\u0027m actually looking at a lot more free time, in the short term... Work is slowing down, due to the primary product I\u0027ve been making likely not being re-ordered.\u003Cbr\u003E\nThe other product is kind in limbo too, as we don\u0027t even know if it\u0027ll get reordered or not. I\u0027ll certainly have to start looking for a second job to keep up my finances. \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003Cbr\u003E\nIt does set me up for potentially having a little bit of free time between a week or two from now, and whenever I do find more work.\u003Cbr\u003E\nMaybe I\u0027ll even find the time to build a stamping jig, so I can ink the Radar Altimeter numbers onto the tape. Would be nice to get that out of the way.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-12-21T14:30:58Z\u0022 title=\u002212/21/2020 02:30  PM\u0022 data-short=\u00223 yr\u0022\u003EDecember 21, 2020\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2020-10-30T13:16:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223874985\u0022 data-ipsquote-contentid=\u0022156435\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604041400\u0022 data-ipsquote-userid=\u0022129946\u0022 data-ipsquote-username=\u0022richfiles\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, richfiles said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/OQJVrpT.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022OQJVrpT.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u0022148.92\u0022 height=\u00221178\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OQJVrpT.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDamn, this really, really looks like a piece of hardware I\u0027m very familiar with called the Mk2 rocket injector plate! It\u0027s the top lid of our combustion chamber. Just imagine oxygen inlet holes instead of flange depressions and a kerosene pipe down the middle tube and maybe a little bit bigger.\n\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-10-30T22:52:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223875057\u0022 data-ipsquote-contentid=\u0022156435\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604063803\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDamn, this really, really looks like a piece of hardware I\u0027m very familiar with called the Mk2 rocket injector plate! It\u0027s the top lid of our combustion chamber. Just imagine oxygen inlet holes instead of flange depressions and a kerosene pipe down the middle tube and maybe a little bit bigger.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo you\u0027re saying I need extinguisher ports in my instrument panel, cause my pulley wheel is on fire? \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2020-10-30T23:29:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223875294\u0022 data-ipsquote-contentid=\u0022156435\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221604098376\u0022 data-ipsquote-userid=\u0022129946\u0022 data-ipsquote-username=\u0022richfiles\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, richfiles said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo you\u0027re saying I need extinguisher ports in my instrument panel, cause my pulley wheel is on fire? \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt looks like it\u0027s \u003Cem\u003Esupposed\u003C/em\u003E to be on fire. At least on the bottom side.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-10-30T23:29:27Z\u0022 title=\u002210/30/2020 11:29  PM\u0022 data-short=\u00223 yr\u0022\u003EOctober 30, 2020\u003C/time\u003E by cubinator\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Unicyclecowboy","CreatedById":208091,"CreatedDateTime":"2020-11-11T01:19:13Z","Content":"\n\u003Cp\u003E\nI\u0027m working on a similar project, might I enquire where you found an attitude indicator? \n\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-11-11T10:56:51Z","Content":"\n\u003Cp\u003E\nLong story short... Ebay. I found my unit on ebay, and I think I spent about 4 months searching, before one popped up that was suitable and fell in my budget. It wasn\u0027t cheap. It cost me a few hundred dollars, and I have no guarantee it\u0027s even functional, though the seller claimed it was removed from a  working Israeli P-4 Phantom flight simulator. Since it\u0027s easier to copy and paste, here\u0027s what I typed on the Simpit repository a few years ago:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n[They occasionally] pop up on ebay. They ARE expensive... Just so you know... I\u0027ve seen them sell for over a grand before... \n\u003C/p\u003E\n\u003Cp\u003E\nThe good news, is you also see them sometimes pop up for the $150-300 \u002B shipping mark. You just have to be on top of them and react fast.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso... MAKE SURE it includes the servo amplifier in the back. That\u0027s the little \u0022backpack\u0022 thing attached to the rear of the unit. It NEEDS that to function. It\u0027s probably possible to recreate that function as well... The circuit isn\u0027t complicated, but you\u0027d have to reverse engineer the ENTIRE UNIT to do that... Not a simple task. It\u0027s better to pass on a real cheap unit and wait for one that has everything [unless you are confident in your reverse engineering skills]. If you find a sub $100 3 axis unit that\u0027s missing the backpack, it may actually work, but the electronics package may have failed. The controls are actually quite simple. You have servo motors and 3 synchro receivers. If you can figure out the pins to those, you could control the servo motors directly from an arduino, while reading the analog value of the synchros. You\u0027ll still need a 400 Hz sine wave for reference, but that\u0027s no problem. It\u0027s POSSIBLE, but more complicated. Not that much more complicated, but you have to aim for a completely different direction of control (reading synchros instead of emulating the outputs of them). You also need to be aware that some units might be sold to collectors for show... and might not actually work at all. [Additionally, there are the rare units that are based on resolvers instead of synchros, but I\u0027ve never seen one pop up outside of space paraphernalia auctions]\n\u003C/p\u003E\n\u003Cp\u003E\nPay special attention to what you\u0027re getting... There are VERY MANY 2 axis units on ebay. Practically ALL the units with a blue sky are 2 axis units. Sad too, as it\u0027d match Kerbal nicely. 2 axis units only have pitch and roll. No yaw. A lot of those types of attitude indicators actually have built in gyros too! Either an electrical power source or a vacuum line spins the gyro and the \u0022ball\u0022 simply reacts to the local gyro... No electrical command signals at all to control those types of navballs. If you look inside a 2 axis navball, you\u0027ll find it\u0027s actually a nav-donut. If you want to fly a lot of planes, you can get away with one, but it\u0027ll be of limited use in space. Patience is a virtue. I\u0027ve been looking for one of these since the beginning of the year.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, 3 axis navballs are uncommon, and very expensive. Anything that is certified as a flyable part is pretty much going to cost over a grand, and sometimes a few grand. What you want to look for are the \u0022retired\u0022 units. Ones that have had a sufficient number of flight hours on them, and are either not certified for flight, or marked for simulator use. Those tend to remain under a thousand dollars, and can sometimes be found for $150-300-ish. They might not come with a connector, but with enough searching you can almost always find the matching connector, and for cheap.\n\u003C/p\u003E\n\u003Cp\u003E\nAlways try to get one that includes the electronics package. Your life will be miserable trying to figure out how to make it work without it. it IS possible, but I don\u0027t recommend it. Chances of finding a lone electronics unit are so much worse than even finding the navball in the first place!\n\u003C/p\u003E\n\u003Cp\u003E\nIf you live near an aviation scrapyard, you might be able to purchase scrap there. Contact the proprietor and see if they have salvaged components for sale.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen buying on ebay, BE VERY CAUTIOUS that you don\u0027t buy a mechanical navball or a 2 axis electronic unit. Mechanical navballs have a simple power supply connector or a vacuum line hose connector on the back. the vacuum line version uses air flow to spin a gyroscope, and the electric one uses a simple electric motor (usually only 2 or 3 wires) to spin a gyro. These are mechanical navballs, and work by physically tilting the whole unit agains the horizon. There are no electronic controls, usually the only electronics are the lights to light it up, and the motor, if it isn\u0027t the air driven variety. 99% of what you see on ebay, and 99.999999% of any with a blue/brown design (like KSP uses), is going to be one of these. You DO NOT WANT this! It is unusable for this application.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the off chance that you are willing to settle with a flight style 2 axis navball, then you can theoretically purchase a synchro driven (remote gyro) 2 axis model, and have a separate display for heading. You can purchase a separate heading instrument, and control it, or make a heading instrument using any motorized mechanism you can continuously rotate 360°, to spin a degrees dial past a fixed heading pointer (most comfortable for viewing) or spin a pointer over a fixed degrees scale (this is easy to make, but less intuitive to read). You could optionally also have a toggle option to swap axes between the heading instrument and one or the other axes of the navball. This would allow you to, say, set roll to the heading instrument, and then read pitch and yaw on the navball, even though normal settings would have pitch and roll on the nav ball, and yaw on the heading instrument... If that makes sense. You can do a more \u0022budget navball\u0022 by doing 2 axis \u002B heading, rather than going all out for a 3 axis like I did.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want a genuine 3 axis navball, you are pretty much not looking at commercial aircraft instruments anymore. 99% of commercial aircraft will use a 2 axis pitch and roll navball, combined with a separate heading instrument, since heading by itself is a crucial navigation element for commercial flight. You need to look at things more suited to old fighter jets, simulators, etc. That\u0027s what I did. I just watched ebay for a few months, till I found the right part.\u003Cbr\u003E\u003Cbr\u003E\nThe way you an typically tell the difference between a 2 axis and a 3 axis ball, is a 2 axis ball will always follow a centered scale. That scale can tilt up and down and rotate on the center of the scale, but the scale can never turn left or right off that centered scale. A 3 axis ball will always have  globe like point or line grid that can not only tilt and rotate, but turn as well. I have seen  few 2 axis balls that really looked suspiciously like a 3 axis ball, but wasn\u0027t. I also can\u0027t stress enough, anything with a small 2-6 pin electrical connector or a fitting for a hose is going to be a mechanical navball. Those are useless.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are alternatives, if you want to do something simpler. One user on the forums has created a virtual navball, using some sort of controller and a small color LCD. This is a much cheaper way to get a navball. Saitek, and other companies also create some LCD based flight instruments, primarily aimed at flight sim applications. I do not know if there is an open source means to communicate with these or not, and they can be spendy, but usually cheaper than going with real hardware.\n\u003C/p\u003E\n"},{"CreatedByName":"Francois","CreatedById":171427,"CreatedDateTime":"2020-11-11T17:00:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223879958\u0022 data-ipsquote-contentid=\u0022156435\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221605057553\u0022 data-ipsquote-userid=\u0022208091\u0022 data-ipsquote-username=\u0022Unicyclecowboy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Unicyclecowboy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m working on a similar project, might I enquire where you found an attitude indicator? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve been working on building one but I\u0027ve put the project on pause to build a small controller during the lockdown. If you want future update, I post here:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u002255562\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed3359636971\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/60620-custom-hardware-simpit-repository-for-people-who-take-ksp-a-little-too-far/\u0026amp;do=embed\u0026amp;comment=3580415\u0026amp;embedComment=3580415\u0026amp;embedDo=findComment\u0022 style=\u0022height:294px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nSorry for highjacking your thread \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129946-richfiles/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022129946\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129946-richfiles/\u0022 rel=\u0022\u0022\u003E@richfiles\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-11-11T22:04:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223880193\u0022 data-ipsquote-contentid=\u0022156435\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221605114035\u0022 data-ipsquote-userid=\u0022171427\u0022 data-ipsquote-username=\u0022Francois\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Francois said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSorry for highjacking your thread \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129946-richfiles/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022129946\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129946-richfiles/\u0022 rel=\u0022\u0022\u003E@richfiles\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot too much of a hijack... I link that on my very first post of this thread! \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022be6RxBS.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/be6RxBS.jpg\u0022\u003E\u003Cbr\u003E\nI felt pretty certain my controller was going to need a pan to fit everything... Yeah, that\u0027s definitely right. I did some fitting, and yeah, the FDAI definitely protrudes below the bottom, by the tiniest amount. the tape meter protrudes even further. That\u0027s no big deal. Like I said. I just need a pan. I might \u003Cstrong\u003E\u003Cem\u003Eactually\u003C/em\u003E\u003C/strong\u003E use a pan... As in a cooking pan. Already the right shape, no sharp corners... just drill a few holes, tap, and screw in with a few screws! If not that, then I\u0027ll find some bit of pre-shaped metal to cover the hole that will need to be in the bottom panel for everything to fit properly. It does mean that if I want the unit to be easily pulled out of it\u0027s mount in my desk and used in a portable manner, then I\u0027ll likely need to have stands that can be threaded onto the bottom, cause a pan will unfortunately make it not level. There is simply no avoiding that, unfortunately.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tQ1091z.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tQ1091z.jpg\u0022\u003E\u003Cbr\u003E\nThis brings me to my next dimensional discovery... I apparently don\u0027t have that much space between the instrument panel trim and the trim of the FDAI as I remembered. The old .39 inch Chinese LED 7-segment display modules would have fit that gap, but the replacement modules I got will most definitely not fit the gap. Furthermore, my 14 segment LEDs are taller yet, and definitely don\u0027t fit between the outer trim and the FDAI trim! Now, they do fit... but I\u0027d literally be cutting into the trim of the housing for them to pass through, and then there\u0027s the issue of them being \u0022shaded\u0022 by being right up under the overhang of the housing. That, I definitely don\u0027t like...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zXBEU0h.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022934\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/zXBEU0h.jpg\u0022\u003E\u003Cbr\u003E\nI think I have a simple solution to the problem, that also creates something visually interesting... The gap above is what I have to work with. Not much space, if limiting myself to the gap between the FDAI trim and the housing trim, but it I use the whole space between the FDAI\u0027s trim and the main housing, It\u0027s a comfortable space, but I don\u0027t want the housing overhanging it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002208Y16XH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002258.67\u0022 height=\u0022547\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/08Y16XH.png\u0022\u003E\u003Cbr\u003E\nSimple solution, is to create a fully external module that bolts onto the outside of the panel, between the overhang of the housing and the FDAI trim. There\u0027s over half an inch (over 1 cm) of overhang, giving me plenty of thickness to work with. This gives me extra room to work with the LED displays, without cutting into the housing trim, and without cutting into the front panel too significantly. There only needs to be four tapped holes for the mounting screws, and one hole or slot for wires to pass through. Because it would be mounted outside the panel, it won\u0027t be situated so far behind the overhang. That will mean it\u0027s view should remain unobstructed.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know what I\u0027d make the display housing from. Plastic would be super easy to machine, and I can paint it. Aluminum would be more tedious to machine, but it would certainly look really good though. I\u0027m not sure it would really matter though... I kinda feel like painting it green. \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Unicyclecowboy","CreatedById":208091,"CreatedDateTime":"2020-11-13T04:27:59Z","Content":"\n\u003Cp\u003E\nHoly cow. thanks for the response and all the info. I am building a Gemini capsule as an interactive art/science exhibit. I am a ways away from integration and control. I\u0027ve haven\u0027t decided if I want to link it to Kerbal or Reentry, as my expertise is more physics/astronomy then electronics/coding. but I think when I get there I will just build my own from scratch, I work with autocad so that type of design doesn\u0027t scare me as much as all the integration you\u0027ve done. awesome stuff. I\u0027m new to the platform here, maybe ill make a thread for my project.   thanks again,  looking forward to seeing  progress on your project. \n\u003C/p\u003E\n"},{"CreatedByName":"KerballingSmasher","CreatedById":195689,"CreatedDateTime":"2020-11-13T13:55:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223880756\u0022 data-ipsquote-contentid=\u0022156435\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221605241679\u0022 data-ipsquote-userid=\u0022208091\u0022 data-ipsquote-username=\u0022Unicyclecowboy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Unicyclecowboy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am building a Gemini capsule as an interactive art/science exhibit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOoooh, that does sound cool! Good luck with that!\n\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-11-19T11:27:51Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022pIZLAgQ.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/pIZLAgQ.jpg\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nMinor update. I may try a three layer plate sandwich with the support bearing in the above configuration. The big difference, is it just allows the sensor belt and pulley to sit completely beside the Navball, as opposed to needing to sit behind. Not a big change, and it\u0027s not a certain change, but I kinda like it. I need to order/pick up more spacers. I should be able to go down to the hardware store or Fastenal to find them. Shouldn\u0027t have any need to order those. If it works out, I\u0027ll likely need to cut down the support shaft on the sensor wheel.\n\u003C/p\u003E\n\u003Cp\u003E\nI am also going absolutely crazy trying to figure out what thing I clearly have, that I clearly can\u0027t remember what it was, or where I clearly stashed it, that I based that LED display idea from my last post on. \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-11-26T19:15:14Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022khajgvl.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022983\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/khajgvl.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve cut the three plates. Next step is to drill the holes for the struts and the guts. \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003Cbr\u003E\nBasically, the next step has to be perfect. I don\u0027t want any bits walking on me (that\u0027s where the drill bit flexes and drifts off to one side as it starts drilling out the hole). For that reason, I\u0027m thinking that maybe I should start off with two opposing corner holes, and screw all three plates down to a block, throw that block in my mill vise, and actually use the correct size endmills to \u003Cem\u003Eprecisely\u003C/em\u003E drill out the remainder of the holes. That, or I could just hand drill the plates in the block... Still accomplishes alignment. My mill is only slightly a mess right now. I need to move a bunch of things out of my \u003Cs\u003E  closet  \u003C/s\u003E machine shop and into my storage room, so I can actually get to my mill again.\u003Cbr\u003E\u003Cbr\u003E\nOne of the critical steps, and the reason I went to the hardware store the other day, is that many of the holes need to be counter sunk. I bought a pack of tapered head screws. I\u0027ll drill the holes, then use a larger bit to drill a cone shaped recess for the screw head. I need to do this for the screw holes inside the tape meter, as well as the screw holes that are butted up against the navball. The middle plate will sit flush against the side of the navball housing, and there\u0027s not much clearance inside the tape meter, and the LAST thing I want, is for the head of a screw to snag the tape, \u003Cu\u003E\u003Cem\u003E\u003Cstrong\u003EEVER!\u003C/strong\u003E\u003C/em\u003E\u003C/u\u003E It should be fun, cause the right plate will attach to the back side of the tape meter using angle brackets... and if you look closely, there\u0027s not a lot of space in there.  It may be necessary for me to counter sink those holes using a dremel grinding wheel and come in at it from an angle. It\u0027s gonna be awkward, but more than doable.\n\u003C/p\u003E\n\u003Cp\u003E\nA few final details regarding assembly... The tape drive motor will sit beneath the navball. The sensor wheel will sit beside the navball, and the sensor itself will stick out past the back of the analog edgewise meters. I\u0027ve double checked that there would be clearance. I would like to try to find some thin teflon sheet washers to put on the bushings of the tape meter. I had for a long time assumed it had ball bearings, but it just uses a brass bushing. I want a washer and possibly a teflon washer to make the sprocket shaft spin nice and smooth. I don\u0027t want side to side play, as that might introduce a rattle, and if I make it too tight, I get slight binding. Barring a teflon washer, a felt washer would also absorb any rattle from side to side play. I may pick up some thick grease to pack the bushing too... We\u0027ll see. I don\u0027t want light oil to seep out and get on the tape. That tape is old, and has held up well... I\u0027d not like to add random chemicals to it and see how it handles it, not even oil or grease.\n\u003C/p\u003E\n\u003Cp\u003E\nOn another side note, regarding tape meters in general, I saw that you can now buy 35mm film leader in quantities far less than the 1000 yard (almost 1000 meter) spools... $25-40 is a far cry from the $100-200 for the big spools. Film leader could be very useful for creating home made tape meters, so just a thought for others who might want to try something like this. The nice thing with film leader, is you can spool as much as you want, so in theory, you could have a much longer tape meter than I have. Just some random thoughts...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220mBczoP.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002265.25\u0022 height=\u0022261\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/0mBczoP.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, thinking about the Velocity Readout and the ∆V Carriage Meter... And maybe even the Auxiliary Data Readouts... The ∆V meter is already going to be using some unique \u0022smart\u0022 displays as it\u0027s readout. I have a large number of salvaged Siemens DLG 1414 displays, and I purchased a pair of Osram DLG 2416-20 displays. Both are from the same product series, green variants in two different character sizes of quad 5x7 dot matrix alphanumeric smart displays. They are different manufacturers simply cause there are multiple part suppliers for the same series of part numbers. These displays are not cheap.  New, the 1414 displays are about $20 a piece. I salvaged them from the video effects panel that I also salvaged my DSKY buttons and the T-Bar fader I plan to use as my throttle lever, so that was quite the deal! the pair of 2416-20 displays were bought from a surplus supplier that had them on sale... And I\u0027m regretting not getting more of them now... I have no idea where I got the HP HDSP-2531. That\u0027s a yellow 8 character 5x7 dot matrix smart display. I\u0027ve had those parts for probably a decade and a half??? On Digikey, that\u0027s a $42 part. I really need to power them up some time and test to see if they even work. They are NOS, but with how old they are (1997) it appears that either the clear plastic has shrunk, or the grey epoxy on the bottom has expanded. Either way, it\u0027s caused some cracking of the sides of the clear plastic. I\u0027m hoping that is purely cosmetic, and hasn\u0027t affected functionality.\u003Cbr\u003E\u003Cbr\u003E\nAnyway, I was reading some older posts today, trying to find earlier mentions of the two green smart displays, and came across a mention about the Apollo\u0027s system of driving their navball. I found this mention of the Apollo\u0027s ORDEAL system: \u0022\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003EORDEAL (Orbital Rate Display Earth And Lunar) was actually developed so late into the design, that it exists as a literal black box attached to the wall... There was never any stage of the design where it was integrated into the instrument panel. It was literally hung on the wall and wired into the FDAI, as an afterthought! It was the device that generated their horizon, relative to the orbital body. Without it, they only had inertial reference. Turns out, it was a very much NEEDED afterthought!\u003C/span\u003E\u0022. I\u0027ve always considered the ORDEAL unit as my inspiration for the Auxiliary Readout Display, in that it was intended to \u0022add on additional data readouts\u0022. Now, I do want it integrated into the panel, not just be some strap on box, however, I do realize that the smart displays I have could indeed give it a sufficiently unique look, so as to differentiate them from the DSKY. This is where I kick myself though, for not getting more of the DLG 2416-20 displays... I\u0027ve \u003Cem\u003Emeasured\u003C/em\u003E the LED die spacing, and that\u0027s a 7mm tall character display. The DLG 2416 is listed \u003Cem\u003Eeverywhere\u003C/em\u003E as a 5mm tall character display, but I can\u0027t find active part number references to the 2416-20 anywhere. I think the -20 is a variant with larger characters, and they have long since sold out from the surplus part supplier I originally acquired them from. Seriously kicking myself...  I looked online, and the largest display available in this style, in green, that produces a 7mm tall character, costs a crazy $52 each, and has a 24 week backorder. I can\u0027t afford that price right now, no way! I need a minimum of 3 of them, maybe 4, if I can fit 3 rows on the Aux Readout!  That\u0027s why I\u0027m considering settling on the yellow 5mm tall displays that I already have. The smaller size (compared to the LED displays I used int he DSKY) means I might be able to fit three rows instead of just two, and I\u0027ll have room for buttons on the side. I can use my smaller DLG 1414 displays to show units. Maybe mixing yellow data with a green unit would look interesting??? I dunno.\n\u003C/p\u003E\n\u003Cp\u003E\nI really, REALLY wanted to have the larger 7mm tall characters for the Velocity Readout. The two DLG 2416-20 displays would be perfect for that, but the problem is my limited quantity... I already am committed to using one of them for the ∆V Meter. Had I bought 3 or 4 instead of just the two, I\u0027d be in a different boat. I could deal with Aux data being only a 5mm character, if the Velocity and ∆V were 7mm. Two pieces is just \u003Cem\u003Enot enough\u003C/em\u003E though, and I can\u0027t find \u003Cem\u003EANY\u003C/em\u003E more of the DLG 2416-20 part \u003Cem\u003Eanywhere\u003C/em\u003E! The only option for a 7mm character is that backordered $52 part... Ugh... The only other alternative for that style display in a 7mm tall character is to use row-collumn driven dot matrix LED displays, which will require me to still add a controller, I\u0027d need 47 I/O lines to multiplex, or I\u0027d need to double multiplex (run 5 columns through a 1 of 8 decoder, which would require a bunch of logic to switch between 8 banks of 5, or I need to source controller chips, and in all of this, I have to code the character generation too. That\u0027s what I LOVE about the smart displays... You just send the ASCII code for a character, and the position you want it displayed, and \u003Cem\u003Ethat\u0027s it!\u003C/em\u003E They\u0027re \u003Cem\u003Esimple!\u003C/em\u003E By the time I add decoders to drive it... The LEDs would cost $22... A pair of MAX6952 quad 5x7 display smart controller chips would cost $35 for the pair, I need to add boards too... By that point, it\u0027s already a few bucks over the $52 smart display... It\u0027s not even worth it anymore to mess with anything else. Even the DSKY displays are using smart controller chips to drive the 7-segment displays, and the units displays are all done by my diode ROMs. All the decoding is automatic there too.\n\u003C/p\u003E\n\u003Cp\u003E\nI still want all those 3.8mm, 5mm, and the rare 7mm displays to be a bit more prominent though, and I found the simplest solution... A bar magnifier. These days, you see \u0027em used as reading aides, but back when these smaller LED displays were normal, it was common to have bubble lens or bar lens magnifiers over the LED to magnify it. I love that retro look, and I think I\u0027ll mimic it here too. Still, I\u0027d rather magnify a 7mm tall character into a 10.5mm character, than a 5mm into a 7.5mm character, particularly for the Velocity readout.\n\u003C/p\u003E\n\u003Cp\u003E\nMan, I am SO kicking myself for not getting more of those DLG 2416-20 displays... \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThose pushbuttons have such a satisfying click. Bought \u0027em a decade and a half ago for another project that never happened, and I\u0027ve wanted to use \u0027em for ages. I was originally gonna use \u0027em for my DSKY keypad, till I repurposed the video effects board buttons for a more authentic look. For the Aux Readout Panel, these would probably be perfect, as I \u003Cem\u003Ewant\u003C/em\u003E that panel to \u003Cem\u003Enot\u003C/em\u003E look like \u003Cem\u003EDSKY 2: The Samening\u003C/em\u003E. I do like the LEDs too... Don\u0027t even know what I\u0027ll use the LEDs to show. Might just tie \u0027em to button presses. Who knows. I got other colors too. Pretty much picked Digikey and the surplus store Axeman clean of every available variety of these pushbuttons, back in 2006.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fnkkskn.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022157.00\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fnkkskn.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-27T05:48:48Z\u0022 title=\u002211/27/2020 05:48  AM\u0022 data-short=\u00223 yr\u0022\u003ENovember 27, 2020\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-11-30T14:27:28Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/cKxGQ1QVwVw?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/eqIMg49.mp4\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://i.imgur.com/eqIMg49.mp4\u003C/a\u003E - Downloadable video\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve done it! The tape meter is functioning, if only mechanically at the moment. There are some issues I have to deal with, and there\u0027s still \u003Cem\u003Elots\u003C/em\u003E of work, but I can say that the mechanism is more or less done! So first off, \u003Cem\u003Ewhat\u0027s left\u003C/em\u003E... I still need to actually print the correct numbers on the tape itself. Right now it just shows degrees, but when I\u0027m done, it should have 0m - 10000m in stepped increments (not a true logarithmic scale, but close to the ground, will be 10m increments, further up 100m increments, further up yet, maybe 500m increments, and so on, divided into 144 individual markings (minus a space the size of about half the window, to allow for an \u0022end of tape\u0022 even though it\u0027s in a loop.)\n\u003C/p\u003E\n\u003Cp\u003E\nA lot of this was merely test fit, so I\u0027ll actually have to pull it apart and re-assemble it with Loctite. Reason I haven\u0027t, is threading the belts can be quite difficult with some parts assembled fully, and I know I\u0027ll have to tweak a few things, so I\u0027m saving final assembly (with Loctite) for when it\u0027s \u003Cem\u003Edone\u003C/em\u003E. Other bits that have yet to be done, are the teflon/felt washers for the tape sprocket. You can hear that the whole thing is a tad rattly, and that might help. All minor bits I need before it\u0027s Loctite bonded.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, the big issue, is I \u003Cem\u003Egrossly misjudged \u003C/em\u003Ethe motor\u0027s capabilities, and how much friction would be in the system. It spins fine at higher voltages, but I have nothing at lower motor drive voltages... It just stalls. I didn\u0027t account for the added friction of adding the tape and it\u0027s 5 plastic rollers into the mix, nor properly estimated the added friction of flexing taught belts, and I realize I \u003Cem\u003Ereally\u003C/em\u003E should have ordered a gear motor with a much higher gear ratio, and more torque. It spins extremely fast at full voltage, but it stalls on lower voltages. The solution is simply to just get a motor with a more appropriate gear ratio. The existing motor spins at 280 RPM at 6 volts... I\u0027m debating whether to go with the 130 RPM or the 70 RPM. Honestly, I\u0027m erring toward the 70 RPM... Any vessel that comes into the atmosphere at a speed that requires more than 5.1 seconds to go from 10000 m to 0 km is only gonna burn up or hit Kerbin... Poof! T\u003Cspan\u003Ehe motors are cheap too, only $5.22 \u002B $5.79 shipping, but I \u003Cem\u003Edid not want\u003C/em\u003E to have to deal with \u003C/span\u003E\u003Cem\u003EChinese shipping\u003C/em\u003E\u003Cspan\u003E again... Ugh... That\u0027s one nightmare I\u0027d rather avoid, but I can\u0027t find the motor stocked in the US. Oh joy... Shipping delays, here I come!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn a positive note, I see no reason the old 280 RPM motor can\u0027t be used with the ∆V Carriage Meter. I can even gain torque just by what parts I get for it\u0027s drive mechanism.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OdqrX6C.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/OdqrX6C.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo, before I go into too much detail on the tape meter, I started my day yesterday by finally notching the analog meter that\u0027s gonna have to sit against the control panel support rail. Notching this meter gains me half an inch, and you know what... I need every fraction of a inch, every millimeter of free space if I\u0027m to have any hope of this thing fitting! With this notch, the body of the meter will sit flush with he lip the front panel rests on, and the side bezels should just fit the gap between the meter and the edge of the enclosure.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tEJpTjP.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022998\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tEJpTjP.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDespite the massive chunk taken, there is no interference with he mechanical operation of the meter. the long metal arm is the calibration arm. It attaches to a front mounted cam, and adjusts the spring tension of the meter. The thin brass looking bit is the movement stop. It\u0027s literally just a tiny bit of brass wire with a rubber catch to stop the meter from moving, and that rubber bit is not visible here... Like I said, no interference, despite the massive chunk removed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Higlqb6.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221088\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Higlqb6.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat bit about milling the three panels together? HA! I was too focused on working on this, and didn\u0027t bother to make my mill usable, so it was all dremel work!\u003Cbr\u003E\nIf the screw hole is big enough, it\u0027s \u003Cem\u003Ealways\u003C/em\u003E in the right precision location! \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002283wmp1T.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221039\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/83wmp1T.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI spent so much time on this stage. There was a minuscule, but measurable taper on the back of the tape meter body\u0027s primary casting. Had to strategically use lock washers to maintain both the right alignment, as well as serve as a buffer to make up for that taper.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HM1ebbz.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/HM1ebbz.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStarting to take shape!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002216eQUzC.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221141\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/16eQUzC.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was critical to mount the outside pulley with enough shaft to secure it safely, as well as to actually align it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vl1PpeB.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/vl1PpeB.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce I was ready for that last panel, it all went together quickly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223ij0D5m.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022162.42\u0022 height=\u0022979\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/3ij0D5m.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was one area I didn\u0027t properly consider when estimating friction losses. Those are just plastic rollers on steel posts. Least I can do is find some teflon washers or something.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gOKhRhk.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/gOKhRhk.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll this crazy mechanism, just so that I can squeeze an uncommon instrument into a narrow gap in my panel!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fkGQw4I.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022119.50\u0022 height=\u0022691\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fkGQw4I.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLike a glove! The navball can sit right on that ridge, and never have to worry about space. The motor and the primary drive belt are all contained in the space of the tiny gap.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tCOfwlX.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221168\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tCOfwlX.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd here, in the rear, we can see how even though the magnetic hall effect position sensor sticks out past the analog meters, it doesn\u0027t actually occupy the same space. it sits well behind the meters. The motor sticks out 2/3 of the way under the navball, but it\u0027s non-intrusive. I\u0027ll likely add an extremely thin layer of foam between the Navball and the tape meter, with hopes of trying to control vibration and motor noise.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AzfZ0WH.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022162.25\u0022 height=\u0022915\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AzfZ0WH.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLooks beautiful, doesn\u0027t it! I really have zero complaints with the fit of this. I managed to actually succeed in fitting it all in! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-20T06:46:40Z\u0022 title=\u002204/20/2021 06:46  AM\u0022 data-short=\u00223 yr\u0022\u003EApril 20, 2021\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-12-02T13:21:11Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022KCkvtlH.png\u0022 data-ratio=\u0022137.50\u0022 height=\u00221157\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/KCkvtlH.png\u0022\u003E\u003Cbr\u003E\nHad a little fun, and took a break from physical construction today. I updated my mockup to more accurately reflect my current forecast plans for this project. Still not shown is my translation controller... Honestly, I\u0027m not actually sure where to mount it. It\u0027s literally a stand alone Fairchild Channel F joystick, and it\u0027s on a cable with a 9-pin Atari style connector on the end. I have no desire to mod such a vintage video game controller, so wherever it gets mounted, it\u0027ll be in what will essentially be a rubber gripped clamp of sorts, that secures it into place, probably somewhere along the front edge of the case, or possibly the control panel edge.  Turned sideways, the pistol grip base is only about 1.5 inch wide, which in theory, would allow it to fit in the edge of the control panel, where the throttle and the Stage and Abort buttons sit. My only worry is it sticking out, past the edge. That sounds like a recipe for snagging it and either damaging it, or messing up orbits or maneuvers. I considered mounting it up to the left of the analog meters, but that puts \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E control at literal arms reach... Not a fan of that idea either. I might consider a notch in the desk, to the left of the staging and abort buttons, and side mount it there.  A notch makes sure it\u0027s not aggressively sticking out, waiting to be a snag in the making... This isn\u0027t something I\u0027ve decided yet, so when I get to it... I\u0027ll get to it. For now, it\u0027s simply not depicted.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022u6OUN6f.jpg\u0022 data-ratio=\u0022131.67\u0022 height=\u0022987\u0022 width=\u00221200\u0022 src=\u0022http://i.imgur.com/u6OUN6f.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe center joystick is the Fairchild Channel F controller. Yes, I recycled yet another front page image. It is one of the strangest controllers I\u0027ve ever used! You hold the base in your hand like a pistol grip, and grasp the knob with your palm. This is actually \u003Cem\u003Eexceptionally similar \u003C/em\u003Eto the way the \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E controller in both the Apollo and Shuttle was configured. In the orientation shown, you can move the knob left and right, up and down, push it in and pull it out, as well a twist it clockwise and counter clockwise. It does not have \u003Cem\u003Eany\u003C/em\u003E kind of trigger or action button, only the \u003Cem\u003E4 axes\u003C/em\u003E of movement. Like I said... It\u0027s an unusual controller! Heck, thinking about it, I could probably even get away with mounting it into the top surface of the panel, at a slight downward angle, so it doesn\u0027t overhang the edge, but is raised above the control panel surface... Think hood scoops, except instead of an air intake, the end is an \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E knob. That has the added benefit of \u003Cem\u003Eactually giving me hand a rest!\u003C/em\u003E I\u0027ll have to look at what makes the most sense. Add that one to the ever growing pile of options... \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022hgDHUKN.jpg\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/hgDHUKN.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nImagine that Fairchild controller embedded in the control panel, starting deepest near the rear of the panel, and sticking out the top toward the front, with enough hand rest space to be comfortable.\u003Cbr\u003E\nMan... I really love this shot! That gentle arcing curve of the panel, sloping slightly down toward the front. That was never part of the original plan, but it just came together accidentally, simply because the parts I happened to salvage for use on this project had that gentle arc built into their design. I happily stole it, just like I stole yet another recycled image, this time one from the simpit repository, that I posted way before I ever began this thread! Told ya, today\u0027s lazy day! \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg alt=\u0022Wgia2da.jpg\u0022 data-ratio=\u002283.25\u0022 height=\u0022937\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Wgia2da.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo back to the mockup... And \u003Cem\u003Emoar\u003C/em\u003E recycled images! It should be noted that there will almost certainly be more toggles than what are shown, and the layout is all up for grabs, except for the general location of the staging buttons and the throttle. Those parts are\u003Cem\u003E physically deeper\u003C/em\u003E, and must sit to the far left, so they clear my keyboard drawer. There will be a small pan underneath those parts to add a little extra depth, to accommodate them. So anyway, what \u003Cem\u003Eactually\u003C/em\u003E changed? Well, the biggest difference is the \u003Cem\u003Ecorrect\u003C/em\u003E number and type of analog meters, the addition of the Radar Altimeter tape meter (which amazingly had \u003Cem\u003Estill\u003C/em\u003E not been added to the mockup in all this time), and updating the location of all the instruments on the main panel to reflect their \u003Cem\u003Efinal\u003C/em\u003E layout. I\u0027ve also updated the DSKY to appropriately represent just how BIG it\u0027s become, and I\u0027ve also updated the mockup to show the raised Velocity LED module that I had discussed in an earlier post, as well as my latest update for the Auxiliary Data Readout (ADR), featuring my newest idea... \u003Cem\u003EColors!!!\u003C/em\u003E There\u0027s actually a lot more color everywhere. The overhead module now shows the sky colored Atmospheric Density gauge, as well as the large VFD, the ADR may end up extra colorful, and the DSKY\u0027s annunciator grid now accurately reflects it\u0027s illumination colors, The DSKY annunciator LEDs normally come in only Red, Yellow, and Green. A while back, I had taken up the challenge to do something useful during the end credits of the last Lord of the Rings movie, so I repaired my milling machine. With it fixed, I milled out the LED dies from a surplus of yellow annunciators I had. I epoxied 3mm LEDs of a variety of other colors into the milled out annunciators. This allowed me to create annunciators that represented the on screen colors of the various navball vectors, e.g.. Prograde, retrograde, Normal, anti-normal, Radial, Anti-radial, etc. In addition to the unique vector colors, I have a blue annunciator to signify ground contact, a reference to the Lunar Module\u0027s blue contact light, as well as several standard red green and yellow annunciators for things like High Temp, Chutes Risky, Chutes Safe, Master Alarm, \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E, Brakes, and stuff like that. Looks like Christmas on the mockup, but it should me much more muted in operation. The entire left column will only ever have a single annunciator lit at a time, indicating what vector is being displayed on the Navball\u0027s crosshairs. The right column has a number of conditional and status indicators that could come on in different patterns.\n\u003C/p\u003E\n\u003Cp\u003E\nNow regarding the ADR... I\u0027ve been looking at part availability and cost, while also wondering just how do I actually control these displays, and I think i have a great solution! If I can source the parts for a reasonable price, the ADR will now be gaining color coded displays! I already have yellow smart LED displays, and red and green ones both seem to be available for semi-reasonable prices on ebay. The units displays might all end up reading green, or I might get the yellow and red versions. I just have \u003Cem\u003ESO many\u003C/em\u003E green ones already, \u003Cem\u003Esooooo\u003C/em\u003E... The basic plan is that there will be a red, yellow and green display, and I\u0027ll have a red yellow and green button by each display, to select that display. I will have several additional pushbutton switches (refer to my post on the smart displays to see what I\u0027m referring to) that will each refer to a specific bit of data. Press a display button, press a data button, that data goes to that display. Super simple! I\u0027ve also been thinking that I\u0027ll probably just have fixed data on the overhead VFD, but \u003Cem\u003Eif\u003C/em\u003E I do end up doing anything else up there, I might end up using a similar assignment system.\n\u003C/p\u003E\n\u003Cp\u003E\nThe final big update is easy to miss. If you look closely, you\u0027ll notice the raised LED module above the Navball, and if you \u003Cem\u003Ereeeeally\u003C/em\u003E zoom in, you\u0027ll see additional LEDs on either side, and on top, just below the velocity readout... These bar graphs will serve as a rate meter. It\u0027s one thing to see your attitude and your velocity, but a rate meter tells you \u003Cem\u003Ehow much\u003C/em\u003E rotation you are currently experiencing on each axis. It\u0027s actually possible to zero out a wild spin using just your rate meters. That\u0027s one reason why I feel rate meters are an absolute necessity for my build, and I think I can make them incredibly thin. I\u0027ve decided that I can take advantage of the raised LED velocity readout as an opportunity to create a pair of \u0022bezel wings\u0022, just off off either side of the Navball. I haven\u0027t decided which path to take. I could try to buy a bunch of those Russian micro bar graph LEDs. They have red and green varieties, and they look really cool, but they are only 5 segments, and 5mm long, so I\u0027d need to order \u003Cem\u003Ea LOT\u003C/em\u003E of them! The other option is to just buy a bunch of surface mount LEDs and create three identical boards with the SMD LEDs as individual segments. It ends up being a ton of extra work, but they might look okay, and if I\u0027m doing a circuit board for the SMD LEDs, I have the added advantage of routing wiring on the back of the board more easily without through holes taking up space... Either way, I\u0027m dead set on on having those rate meters!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-12-07T09:56:12Z\u0022 title=\u002212/07/2020 09:56  AM\u0022 data-short=\u00223 yr\u0022\u003EDecember 7, 2020\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-12-09T07:09:35Z","Content":"\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022105498\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed7496058901\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/135150-translational-control/\u0026amp;do=embed\u0026amp;comment=2980130\u0026amp;embedComment=2980130\u0026amp;embedDo=findComment\u0022 style=\u0022height:261px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nSo, this is a pretty old thread, from way back in 2017, but it popped up in a  search on Translation Hand Control (the official NASA term for the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E controller), and I learned a few things about it that I\u0027d forgotten. Apparently there was a mode switch of some kind tied to rotating the controller, making the Fairchild Channel F controller even more relevant! Reading that thread again reminded me that I wanted to use rotation to emulate the scroll wheel... Might still do that. We\u0027ll see. One issue that was brought up, was the lack of tactile feedback in the switches, and the fact that the controller is purely digital. The one single reply that I had not read, from way back in 2017... Is actually a \u003Cem\u003EGREAT\u003C/em\u003E idea! If I want tactile switches, I only need a solenoid to \u0022tap\u0022 the mount that secures the THC unit. That would give both an auditory and tactile feedback when any switch engages or disengages. Honestly, it\u0027s a super simple solution, and it would definitely work, and I like it VERY much! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHmm... Now I need to either start saving for a 3D printer, or find someone with one willing to help me out to make bezels... Particularly the velocity/rate meter bezel. I want that to be perfect. I might just try machining it, if I can find aluminum pr plastic bits that are sized right. I REALLY need to clean up my \u003Cs\u003Ecloset\u003C/s\u003E machine shop, so I can get to my mill.\n\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2020-12-17T01:46:08Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/7oSCJBIMUL0?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nDownloadable video:\u003Cbr\u003E\u003Ca href=\u0022https://i.imgur.com/euAwlXP.mp4\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://i.imgur.com/euAwlXP.mp4\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\nI must apologize for the audio quality on this video... Seems my mic\u0027s gain is cranked so high that you can even hear \u0022wind\u0022 blowing across it as I move left and right. It picked up the audio of me tapping my phone screen... Weird, but okay... No idea why it was so sensitive.\u003Cbr\u003E\u003Cbr\u003E\nNow that that oddity is out of the way, just a minor update. I got the new motors in the mail yesterday, and I installed the slowest speed model of the two to see how it worked... I like it. Good low end speed control. I can drive it on as little as 0.65 volts, and with PWM, I should get even better low end control. At low speeds, it\u0027s actually nearly silent, though I imagine once all the parts are assembled, I might get chassis amplification of noise. It\u0027s one reason I plan to mount this to the chassis using rubber grommets, and plan to use foam to keep any metal parts from making contact with anything else directly. For reference, each number on the tape will represent the height of two numbers in the final tape meter, once the tape has been properly printed. Each of the lower altitude increments will be in\u003Cspan style=\u0022background-color:rgb(249,249,249);\u0022\u003E 10 meter increments between 0 and 1000 meters, 100 meter increments between 1100 meters and 3000 meters, and 500 meter increments between 3500 meters and 8500 meters, with the final unit being \u0026gt;9999 meters. It\u0027s a total of 135 total increments. I might tweak that a bit. I need to see how quickly decent can happen at 1000m. If it drives the tape too fast, I could have a transitional region with 50m increments, and get some finer resolution farther up the tape. Ultimately, the real goal, is to keep the tape speed low, and thus the noise low, and ease in reading high.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:rgb(249,249,249);\u0022\u003EI also got some, but not all of the taps I recently ordered, as well as a pin vise. Still waiting on the rest of my taps, and the screw assortment. I waited to mount the absolute position sensor, till I could get the taps, so I could thread the mounting holes. I want to be able to loosen the sensor and adjust it, to fine tune it, relative to the tape meter position. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:rgb(249,249,249);\u0022\u003ESo yeah, that\u0027s where things sit.  \u003C/span\u003ESoldering circuit boards for work, so I\u0027ll mount that sensor after that\u0027s dealt with.\n\u003C/p\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2021-01-05T12:55:48Z","Content":"\n\u003Cp\u003E\nI got started working on my analog meters again. This task proved far more complex than my brain had planned for.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022plSQ3d1.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221187\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/plSQ3d1.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a test, realized there was a lot of light spill from the color accent LEDs, so I decided to use the dremel to cut out channels for those LEDs.\u003Cbr\u003E\nI also secured the scale by drilling and tapping holes for it to be clamped down to.\u003Cbr\u003E\nOn a side note, I looked for a week for my 4-40 screws and nuts, as well as my Dremel bits. Bought the Dremel bits Sunday, and the screws a day before. I found my bag of bulk 4-40 hardware and my Dremel bits Sunday evening... While at the hardware store, I saw the epoxy, and thought, I got that at home... Took me hours to find it. It was hiding in plain sight. In fact... ALL of it was... \u003Cimg alt=\u0022:mad:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_angry.gif\u0022 title=\u0022:mad:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022K58hV1R.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221075\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/K58hV1R.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA screw and washer might not seem like enough, and that scale might look like paper, but it\u0027s not. It\u0027s Nekoosa Synaps XM synthetic paper, which is a textured polyester sheet that can be fed through a laser printer. It\u0027s very difficult to tear, and the four screws and washers holding the four tabs keeps it tightly in place.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AY82nMx.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022894\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AY82nMx.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI cut, drilled, and mounted a small piece of protoboard to the meter, where the old incandescent light sockets were originally mounted. This will be where all the LEDs mount.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022y4SnRBq.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.50\u0022 height=\u0022378\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/y4SnRBq.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSmall snag... I already prepped my red and yellow LEDs ages ago. I had a massive pile of 1x4 rectangular yellow LEDs, but no other colors. I needed 1x2 LEDs, so I used my mill to cut them into two. I DID find some 2x4 green LED packages, but these were too wide, so I used a tiny hack saw blade to saw four of these 2x4 LED modules into eight total 1x4 modules. Had I used the mill, I would have 1: had to clean up the space to use it, and 2: ruined half the LEDs. The mini saw blade went through the center without harming the LEDs on either side of it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Fq8ImNo.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221120\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Fq8ImNo.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt took a while... There\u0027s a fiberglass reinforced board inside these, where all the LED dies are bonded to. It really slowed the blade down.\u003Cbr\u003E\nTook a while, but the alternative was spending money to wait even longer.\u003Cbr\u003E\nI tested every LED die with a small coin cell battery, to verify that none were damaged by the sawing process.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222XRnjVO.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022161.67\u0022 height=\u0022688\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/2XRnjVO.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSince these were cut, I had to paint the exposed side to contain their light.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tdxZzb0.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022125.17\u0022 height=\u0022915\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tdxZzb0.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBent the negative leads...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nEbDaL6.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002280.50\u0022 height=\u0022462\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/nEbDaL6.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI kinda went nuts, and gave every LED it\u0027s own resistor. For this application, I just went overkill. One issue with assembly, is that the ideal resistors in my collection were pre-bent resistors, meaning I had to \u003Cstrong\u003E\u003Cem\u003Eun\u003C/em\u003E\u003C/strong\u003E-bend them for all of these. Lead forming actually wasted way more time than I expected. Such is the cost of free-form electronics.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Hu7lsCa.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022840\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Hu7lsCa.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMade sure to test every LED assembly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022P6XixI6.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221006\u0022 src=\u0022https://i.imgur.com/P6XixI6.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTest fitting the Green LED into the carved slot behind the scale.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lPcFCDV.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/lPcFCDV.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLikewise, testing the red and yellow LED assembly.\n\u003C/p\u003E\n\u003Cp\u003E\nGonna split this post, cause it\u0027s already pretty long...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-05T21:33:54Z\u0022 title=\u002201/05/2021 09:33  PM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 5, 2021\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2021-01-05T13:11:12Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022CByQFiw.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022988\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/CByQFiw.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI started test fitting the LED assemblies, securing a wire, and then pulling them back, applying epoxy, and then lighting the LEDs up, in order to test the alignment with the color accents on the scale. The epoxy sets in about 5 minutes, so that gives just enough time to get the alignment corrected before the LEDs are locked into their final places.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eEHAub3.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221140\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/eEHAub3.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was a real jumble. Next time, I\u0027ll plan things ever so slightly differently, and try to be a little more uniform with how I do the wiring.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022O3P8uf8.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221153\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/O3P8uf8.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce again, a resistor per LED. I tried to aim the LEDs to best spread out over the diffuser, and I may still try to adjust the alignment for best spread. I used 10 of the aqua/teal colored LEDs I picked up in bulk\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bZ0bvJK.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/bZ0bvJK.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nToo much side spill of the light... But there\u0027s a simple solution for that!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Bb8SUxi.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022126.00\u0022 height=\u0022479\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Bb8SUxi.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI figured out the geometry for a light shield\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oCIVgWx.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022151.25\u0022 height=\u0022603\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/oCIVgWx.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt installs nicely over the LED assemblies, and doesn\u0027t intersect with meter operation.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tZ95qwP.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u0022768\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/tZ95qwP.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce side installed, and it\u0027s doing the job nicely! I\u0027ll paint the edge of the plastic to further contain light spill.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd here we have it...\u003Cbr\u003E\u003Cem\u003E\u003Cstrong\u003EOne finished backlight mod!\u003Cbr\u003E\nOne down, four to go...\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cCyxVsc.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022166.67\u0022 height=\u00221200\u0022 width=\u0022993\u0022 src=\u0022https://i.imgur.com/cCyxVsc.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m pretty satisfied with how this turned out. I\u0027ve been up all night working on it, but after just a few more tweaks, It\u0027ll be ready for the movement assemblies to be reinstalled, and the cover closed up. I knew exactly what needed to be done, but my goodness, getting it from in my head into reality just took forever!  There are ways I can streamline, and I do expect the next 4 meters to go faster, but boy, it\u0027s gonna be slightly tedious. I\u0027ll make it though. A lot of the most tedious things have already been completed too, like sawing the green LEDs and measuring the shields, so there\u0027s that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-05T21:35:28Z\u0022 title=\u002201/05/2021 09:35  PM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 5, 2021\u003C/time\u003E by richfiles\u003C/strong\u003E\n\u003C/span\u003E\n"}]}