{"TopicId":158113,"ForumId":39,"TopicTitle":"Press Release","CreatedByName":"roboslacker","CreatedById":175473,"CreatedDateTime":"2017-03-23T16:15:02Z","PageNum":1,"Articles":[{"CreatedByName":"roboslacker","CreatedById":175473,"CreatedDateTime":"2017-03-23T16:15:02Z","Content":"\n\u003Cp\u003E\nToday, the KSP launched the newest rover, the \u003Cem\u003EKerb 4. \u003C/em\u003EThis rover will follow up on the \u003Cem\u003EKerb 3\u003C/em\u003E, which uncovered evidence of life in the R\u0026amp;D complex.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022\u003Ci\u003EKerb 3 \u003C/i\u003Efound thing none of us were expecting,\u0022 said a spokeskerb for the agency. \u0022It uncovered evidence of water in the R\u0026amp;D complex, and images sent back from it show what we believe to be artificial structures. Sadly, a design mishap forced us to walk out there and recover the rover.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWhen reminded by reporters that he was getting off topic, the spokeskerb talked some more about \u003Cem\u003EKerb 4. \u003C/em\u003E\u0022This Rover is designed to search for lifeforms.If there\u0027s anything there, we\u0027ll find it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022There was some difficulty with the rover design. Early prototypes were nearly uncontrollable. And there were a few moments during the launch where we thought it would roll off of the launchpad. But it worked marvelously, and we estimate that it\u0027ll reach its destination in around 10 minutes. And when that happens, you\u0027ll be the first to hear.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-03-23T21:07:46Z","Content":"\n\u003Cp\u003E\nNo pictures? \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"roboslacker","CreatedById":175473,"CreatedDateTime":"2017-03-23T23:19:26Z","Content":"\n\u003Cp\u003E\nArtist\u0027s conception of the \u003Ci\u003EKerb 4\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/JRuUam5.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022JRuUam5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n[I didn\u0027t really do this mission]\n\u003C/p\u003E\n"},{"CreatedByName":"roboslacker","CreatedById":175473,"CreatedDateTime":"2017-03-26T00:14:53Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cb\u003ERockomax tests new solid fuel booster\u003C/b\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Image result for mushroom cloud\u0022 src=\u0022http://www.atomicarchive.com/Effects/Images/WE12.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EYou can feel the power\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nRockomax has recently successfully tested a new solid fuel booster, which is said to be far more powerful than existing rockets. A lead engineer is quoted as saying, \u0022It\u0027s like if you took a LV-N, and let all the thrust out at once instead of over time. Also, the new engines have a pleasant green glow to them.\u0022 Company statements claim that the new, more powerful booster will do away with overly complicated lower stages. Underfunded space programs in totalitarian states are expected to greatly benefit from the new technology.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBut many kerbals feel that the engine has no real application, as SRBs are said to be vastly inferior to \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELf\u003C/abbr\u003E/O engines. Additionally, they point out that the new engine\u0027s power is beyond the acceleration tolerances of most spacecraft. Company spokeskerbs responded by going on a rant about nobody understanding spaceflight anymore. \u0022In my day.\u0022 one was quoted as saying, \u0022We didn\u0027t need all your fancy control systems. If we wanted to go to space, we pointed our rockets up and launched. If you can\u0027t take the power, you have no place is space exploration.\u0022 Most experts agree that the company spokeskerbs were out of their minds.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAt any rate, the engines do offer unparalleled power, and they do have that lovely green glow. More on this if it develops.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-03-31T21:01:20Z","Content":"\n\u003Cp\u003E\nNext step: sending your space probe to space? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"roboslacker","CreatedById":175473,"CreatedDateTime":"2017-04-04T14:57:45Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003ELawsuit Filed Against Anonymous Supplier\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAfter the loss of the \u003Cem\u003EUntitled Space Craft \u003C/em\u003Ewith all hands, the KSP filed a lawsuit against the anonymous suppliers who provided  the defective parachutes which resulted in the loss of the ship.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWe reached out to the suppliers for comment, only to realize that nobody knows who the suppliers are. In the words of a construction manager, ¨The parts would just mysteriously show up lying by the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, and money would be missing from our accounts.¨\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAfter bring asked why they used anonymous suppliers in the first place, KSP supply chief stated, ¨Well, there aren´t any non-anonymous parachute suppliers.¨\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAt press time, the lawsuit had been dropped after realizing there wasn´t any legal system to file the lawsuit.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-04T15:07:49Z\u0022 title=\u002204/04/2017 03:07  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 4, 2017\u003C/time\u003E by roboslacker\u003C/strong\u003E\n\u003Cbr\u003EAccidentally posted before I finished\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-04-05T04:23:18Z","Content":"\n\u003Cp\u003E\nProgress marches on. \n\u003C/p\u003E\n"},{"CreatedByName":"roboslacker","CreatedById":175473,"CreatedDateTime":"2017-04-09T22:48:32Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cb\u003EScientist baffled by new satellite\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cb\u003E\u003Cimg src=\u0022http://i.imgur.com/hZFyrqE.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022hZFyrqE.png\u0022\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cem\u003E\u0022How did we even get this photo?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nToday, scientists have officially given up trying to figure out what the KSP\u0027s latest satellite was intended for. \u0022Just look at it,\u0022 one spokeskerb said, \u0022The design makes no sense. There\u0027s a bunch of antennae, but what does it transmit? There\u0027s no science equipment.\u0022\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe spokeskerb continued, \u0022The antennae aren\u0027t relay types either, so what can it be? Well, whatever it is, it has no power generation, so it won\u0027t last a week.\u0022\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnonymous sources indicate that this is some sort of memorial, but what to? Some suspect the KSP\u0022s new director of being part of a monolith cult, which would explain some stuff. More on this if nothing noteworthy happens.\n\u003C/p\u003E\n"}]}