{"TopicId":162861,"ForumId":39,"TopicTitle":"World War K (Conclusion: \u0026quot;The Return\u0026quot;: An introduction to The Final Stand, and The Authors Note)","CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-07-03T23:42:03Z","PageNum":8,"Articles":[{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-10-25T10:58:29Z","Content":"\n\u003Cp\u003E\nCan\u0027t wait for more!\n\u003C/p\u003E\n"},{"CreatedByName":"MiffedStarfish","CreatedById":175356,"CreatedDateTime":"2017-10-25T17:21:10Z","Content":"\n\u003Cp\u003E\nWow! I really need to keep checking the forums, I missed TWO chapters! On another note, I submitted the Floating Fortress ages ago, but now that has been replaced by a new carrier, (from the discord) would you like that instead? \n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-10-25T18:59:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223203240\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508952070\u0022 data-ipsquote-userid=\u0022175356\u0022 data-ipsquote-username=\u0022MiffedStarfish\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, MiffedStarfish said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWow! I really need to keep checking the forums, I missed TWO chapters! On another note, I submitted the Floating Fortress ages ago, but now that has been replaced by a new carrier, (from the discord) would you like that instead? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSure; I still plan on using the fortress though \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-10-27T22:48:25Z","Content":"\n\u003Cp\u003E\nGood news: typing chapter 21 now!\n\u003C/p\u003E\n\u003Cp\u003E\nGood-er news: you\u0027ll get one more chapter than planned!\n\u003C/p\u003E\n\u003Cp\u003E\nBad news: I\u0027m not with my computer at the moment, so I can\u0027t upload \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E oh well \n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-10-30T16:57:11Z","Content":"\n\u003Cp\u003E\nChapter 18. Getting near the end; Chapter 22 is going to be the Big One. The Final Battle. Can\u0027t believe how much has happened.. But for now, enjoy number 18!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EChapter 18\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003EThe Battle of Dystrios\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 10:00am, 3 Days later\u003Cbr\u003E\nLocation: Belfast, Dystrios (Capital)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “Great day out there, huh?” The radio officer asked, staring outside a window. “’Tis a great day sir!” The operator answered, checking satellite, RADAR, and Visual scanners. “Not a single thing in the sky. Perfect day for a pic-“ He was cut off and a huge blob filled the RADAR screen. He checked the visual scanners, which confirmed his worst fears. “Huge grouping. Looks like a mix from Kerthenia and Klathu. Possible Agonarch too, though I don’t think they’d manage to get past Kruola’s defense systems.. Pretty sure they’re a bomber/fighter combination.” The officer nodded. “Scramble the fighters. Activate the Lancer SAMs and every AAA gun we’ve got in the north. We can’t afford a single second lost. And for Kerm sake, alert everyone we’ve got. The UK, Veloxia; obviously Kruola. This is going to be massive.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “I’ve taught you well,” Val said as she passed the ball forward. “Looks like the student..” Haydi muttered as she did a textbook sliding tackle; getting the ball with ease. “Has become the teacher.” The match had been a psychological chess game, with the score 0-0 10 minutes from the half. Paddy, Jim, Thompberry, Hans, Meg, Bryson, Ben, Triop, and Maxxy were all watching tensely. Half wore “Team Val” shirts, while the other wore “Team Haydi” emblazoned across their chest.\u003Cbr\u003E\n    Haydi slipped past, and was open. “Come on!!” She took the shot, which just narrowly missed; bouncing off the post and spinning out of bounds. Just then, Gene burst in, skidding along the ground. “Everyone, suit up!” He shouted. “You picked a lousy time for a drill,” Val ignored him, kicking the ball to the center of the field. “Call came in. Belfast is under attack. They need every they can get.” Val paused the game in shock. Paddy darted up.\u003Cbr\u003E\n    “Dystrios is under attack?!” He exclaimed. Belfast was his home. Where he’d grown up. And someone dared to attack it?! “Let’s get after it!” Paddy sprinted out of the room, and the others followed suit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 11:15am\u003Cbr\u003E\nLocation: Belfast, Dystrios\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    The battle was intense. AAA and SAM posts had wiped out some of the bombers, but others had managed to slug the city. Now, it was a massive cloud of fighters doing battle. It was Klathu, Kerthenia, and Agonarch against Kruola, Veloxia, and Dystrios. The fight was going in favor of the enemy. One of the pilots in a DE-01 Hurricane was hot on the tail of an enemy fighter, but the enemy was far more maneuverable. “Come on…” Just then, the radio came to life, and sang a charge horn noise. The pilot looked up and smiled. The F-22’s had arrived.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “Let’s light ‘em up!” Val shouted, diving down onto the first enemy she saw. The enemy was fast, but not at all maneuverable. At least not compared to the -22. Val buzzed the enemy with guns, and the craft was shredded; falling to the ground in a massive explosion. Even from 500 meters up, and through a fairly well-insulated fighter jet cockpit, Val heard a massive cheer below them. Citizens were in the streets and on the rooftops watching the battle unfold. “What’s this?!” Val exclaimed, picking up onto another fighter. In response, Paddy did a roll, popping off flares and giving the crowd below a show. They cheered even louder, and then Paddy finally went into the fight.\u003Cbr\u003E\n    “This is for Tarkin!” Jim shouted, obliterating two fighters. The first one had its wing shredded, smoke and flame shooting out of the sides. Jim turned the plane, and fired on the second, which also shredded the wings. They both flipped over, and careened into each other slicing the two in half as they collided in a huge fireball. Jim grinned as the crowd screamed its approval. Then, as he formed up on the next enemy, he heard a beeping. “Lock!” He shouted, diving down. He saw the missile in his mirrors. He bobbed and weaved, wowing the crowd below. Then, he yanked up on the stick as hard as he could. The plane shot up into the sky, and the missile followed him. Jim kept on climbing. And climbing. And climbing some more. Finally, when he was about to reach the critical stall speed, the missile flamed out. Hovering in the sky for a second, it floated up, and exploded in a huge explosion.\u003Cbr\u003E\n    “Jim. Jim, you okay?” The radio was silent. “Jim!” Gene feared the worst. Then, a roaring cheer thundered through the city as an F-22 dove down, the remnants of the missile’s fire trailing off his stabilizers. “That is beautiful!” Paddy exclaimed as he shot down another fighter. Val skillfully blasted a plane apart, grinning as her plane fit nicely through the hole the explosion and debris had caused.\u003Cbr\u003E\n    Val turned to engage the next one, but there was nothing. The rest of the planes were retreating! Cowards! Val shot off an AMRAAM, and it caused a monumental fireball as the carcass spun down to the bay below. The air was silent for a bit, and then a huge cheer louder than the jets themselves blasted out, the citizens celebrating the victory. A chant started, which was disorientated at first. Then, Val heard it.\u003Cbr\u003E\n    “\u003Cem\u003EOff we go, Into the wild blue yonder.\u003C/em\u003E.” Val smiled and began singing along over the radio. The other pilots joined in; even the ones from Dystrios and Veloxia.\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cem\u003EClimbing high, into the sky.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EOff they go, zooming to meet our thunder,\u003Cbr\u003E\nAt ‘em boys, give ‘em the gun.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EDown we dive, shooting out flame from under,\u003Cbr\u003E\nOff with one terrible roar!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWe live, in fame, or go, down in flame,\u003Cbr\u003E\nFOR NOTHING CAN STOP THE UN AIR FORCE!!!\u003C/em\u003E” \u003Cbr\u003E\n    \u003Cbr\u003E\n    The Raptors blasted over the city, performing the greatest of fly-overs. The crowd roared below them, and Paddy laughed in joy, performing a loop for the citizens below. Even though it didn’t seem possible, the crowd seemed to shout louder than they had before. “That was amazing!!!” He shouted as he rejoined the group. “Let’s land. I’m sure you’ll want to spend some time back home.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 11:45am\u003Cbr\u003E\nLocation: Belfast, Dystrios\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “That was awesome!!” Thompberry shouted as they got out, joining the other pilots. “Did you see that shot?!” Jim asked. “I couldn’t believe my luck! 2 for one..” While the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E pilots talked about the battle, Paddy walked over to his old friends. “Rodden!” Paddy smiled and clapped his old pilot friends on the back. “How’s it been?!”\u003Cbr\u003E\n    “’T\u0027s been good, Paddy. I can’t believe how long it’s been… Top o’ teh heap, eh?” The friends joked around, and eventually the citizens came in, cheering on their favorite pilots. Of course, a lot of them were huge fans of Jim. Paddy was equally loved by all, signing many a picture, hat, diecast replica, and paper.\u003Cbr\u003E\n    “Tat was teh best job I’ve seen in me life!” Someone said to Jim as he signed the paper. Meanwhile, Paddy was right at home- laughing and singing with his fellow country-kerbs.\u003Cbr\u003E\n    The crowds stayed for hours, it seemed, but finally all but a few had left. “Time to go?” Val asked Gene, who checked his watch. “Yup. Paddy! Time to go!” Paddy turned with a dejected look on his face. “5 more minutes?” He pleaded. “Come on. You know how bad landing at night is..” Paddy sighed and walked over. After the group had been assembled, they went over to the Raptors. Jim was giving a demonstration to some citizens who were sitting on the tarmac, eagerly listening.\u003Cbr\u003E\n    “Jim? Time to go.” He sighed, and waved goodbye. The crowd groaned and dispersed. “Raptor to Tower, requesting takeoff clearance.”\u003Cbr\u003E\n    The planes fired up, and began the takeoff roll. Finally, they lifted up, seeming to pierce the sky as they headed home.\n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-10-30T19:07:34Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EChapter 19\u003C/span\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EIn the West\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 1:57pm (1357), 6 Days later\u003Cbr\u003E\nLocation: Territorial Arid Protective Center; West Bay, TAPE\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “They’ll come back.. I know it..” Danny whispered, slowly rocked back and forth on the floor of his cell. He’d been separated from his group about 3 weeks ago, and was being driven more and more mad by the day. He’d been repeating the same, optimistic phrases for almost a week now. “Sam’ll come in here.. He’s going to break me out of here.” While Danny sat on the verge of insanity, a loud clanging noise sounded, and shouting began to echo through the stone corridors.\u003Cbr\u003E\n    “I’M TELLING YOU, I DIDN’T DO IT!!” A voice cried out, pleading. “LET ME GO!!!” The shouting prisoner was being carried past the cell door; lifted up by two guards, legs flailing in a futile attempt to run. The guard on the right opened the door across from Danny’s, and the left guard tossed her in. She fell to the ground like a sack of potatoes, and the guards closed the door. After the guards left, a quiet sniffling noise filled the air.\u003Cbr\u003E\n    Danny looked over at her. She was young- around the 18-20 age- and exceptionally beautiful. Her hair fell down like a brown rippling river, and even though she was locked in a jail cell in drab prison clothes, it was impossible to ignore how pretty she was. Just then, something in Danny’s mind clicked, and he remembered something his dad told him forever ago. \u003Cem\u003EWhen you see a girl crying, always help; no matter what.\u003C/em\u003E\u003Cbr\u003E\n    “Hi,” He whispered, and the crying slowed to a halt as the girl turned. “Hi,” She whispered back, giving a slight wave. Her eyes, though slightly red, were hazel; warm and comforting. “What’s your name?” Danny asked, scooting closer to the door. “Suzanne. You?”\u003Cbr\u003E\n    “Danny. UK 1st Army, 156th Charging Bulls. 7955613.” Suzanne smiled. “UK? I’ve heard about you guys. What’re you doing here?” She asked. “I was separated from my unit a little less than a month ago. What’re you doing here?” Danny replied, accidentally making Suzanne cry. “Oh I\u0027m sorry! I didn’t mean-“ Danny attempted to apologize, before Suzanne waved.\u003Cbr\u003E\n    “I’m sorry,” She laughed, wiping the tears off her face. “It’s just you remind me so much of my brother back home. They arrested me a couple of days ago. I still don’t know what I’ve done..” She frowned, and curled back up in an attempt to stay warm. Danny wiggled his arm through the bars and threw his jacket over. “Keep it,” He said as she grabbed the coat.\u003Cbr\u003E\n    “I ca-“ Suzanne protested before Danny interrupted. “It’s warm. Trust me. You’ll feel a whole lot better.” She kept on trying to form the words, but eventually gave up and mouthed “Thank you,” before huddling up under the jacket and falling asleep.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 2:00pm\u003Cbr\u003E\nLocation: East Point Port, USK\n\u003C/p\u003E\n\u003Cp\u003E\n    Bill looked out at the ocean at the 5 enemy ships. “Have they moved at all?” He asked the first mate as he set down the binoculars. “Not from what I can tell, sir.” Jeff stared at the ships who were just out of firing range. He watched as a plane shot overhead; one of theirs. “Come on.. Get that bugger..” The plane fired off 2 missiles, and began harassing the ships with gunfire. The turrets did their job to perfection; slamming into the enemy ship and blowing a massive crater in the middle of the hull. The ship went up with a massive, towering pillar of fire, and it quickly capsized. Then, a barrage of Hydra rockets wiped out a second, and a third. As it ran out of ammo, the plane scurried off back to the aircraft carrier for a refuel before getting shot down.\u003Cbr\u003E\n    “They’re moving….” Bill braced against the railing and prepared for the imminent shots of gunfire rounds pounding into the deck. “They’re retreating!!” Bill exhaled, and went onto the ship intercom. “Stand down. We\u0027ve won.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 3:05pm\u003Cbr\u003E\nLocation: On the Southern Border of the USK\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    The artillery gun’s recoil shook the entire stand as it fired a 30 millimeter shell of pure destruction. The shell landed just a few inches short of the truck, sending up a pillar of sand and smoke as it impacted. “Dangit..” Sanson threw another shell into the canister and closed the blast doors. “Fire!” The gun again shook, and this time it hit, sending up a loud plume of smoke.\u003Cbr\u003E\n    The fighting against TAPE and the USK has never been easy, but in this war it seemed like everyone on both sides was throwing everything they could at each other. The Krakinian Sand War. Kerbin’s End. The NSK Civil War. The Second Great War. And now World War K, as it was coming to be known by the media and the soldiers. The USK had handled their own just fine; they had the second greatest army in the world. But no-one could handle an onslaught from 3 fronts. However, even though they were the UK’s biggest ally.. No.. Surely not. It just felt like the generals were paying more attention to Klathu and Kerthenia. They’d never let the USK fall!\u003Cbr\u003E\n    “Incoming!” Sanson aimed the gun at a tank that had peeked over the mountains near the Temple, and fired. It spun in a white-hot ball of fury, and finally the shell hit; splitting the vehicle in two. Wheels, armor, batteries, and ammo boxes slid down the mountain. “Check it out,” Sanson commanded, pointing to the dust cloud where they’d ended up. “See if there’s anything possibly salvageable.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 3:15pm\u003Cbr\u003E\nLocation: Near Baikerbanur; USK\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “So why are we here?” Ornous Kerman asked the other pilot as he looked down from the A-11. “Agonarch launched a blitz attack aimed straight for Baikerbanur. Our job is to blow up the convoys and hopefully make them turn back.” Ornous nodded, and checked the FLIR cam. “See anything?” The second pilot asked. “Nothing on visuals. Say, wasn’t the UK supposed to send us some of those new B-1’s?”\u003Cbr\u003E\n    Before the pilot could answer, a huge explosion shook the plane, and the A-11 Warthog fell down to the plains down below. “DANNY!!!” Ornous shouted. Keeping his wits, he dove down, trying to find out what this thing that had killed Danny was. There. Oh no…. The threat was an F-22 Raptor. But only the UK has those! That didn’t make any sense! Ornous chased the Raptor, and tried to get a missile hit. The Raptor popped flares, and the missile shot past.\u003Cbr\u003E\n    Just as fast as it had come, the Raptor was in a turn battle with the Warthog. This is gonna end horribly.. Ornous’s thought was right. The Raptor blazed behind him, and he heard the buzzing of 20 millimeter cannons firing. The wing was the first to go. Then the fuel tanks. And then, finally, the fire engulfed Ornous, and the Warthog spiraled down to the ground, exploding on the green ground below…\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    DualD Kerman, nicknamed “The Desert Eagle,” surveyed the wreckage from above. The smoke from the first attacker was still hanging in the sky, and the second had just pancaked into the rolling hills below; some slight smoke emitting from the crumpled Lump of metal. After running scan after scan on the terrain below, he finally radioed in to Control.\u003Cbr\u003E\n    “Colonel DualD Kerman, reporting. Two enemy vessels down. No signs of life. Returning to base.” The radio came to life, and a voice over the other end replied “Sehr gut. Any ozher targets in ze area?” Dual looked around and saw nothing. “Negativ. The invasion of Baikerbanur can go on as scheduled.” Dual spun the plane around, and went back to TAPE. The fighter ace had struck again.\n\u003C/p\u003E\n"},{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-10-30T20:10:27Z","Content":"\n\u003Cp\u003E\nBEWM, there I go! Just need to get my eyes opened that I\u0027ve been fighting for the wrong side all the time!\n\u003C/p\u003E\n\u003Cp\u003E\nLove the way u\u0027ve introduced me!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Oh btw, Just now I\u0027m working on a new RC model. Looks a little bit like the F-117 Night Hawk, just more modern. I\u0027ll post a video of it once I can get it airborne and maybe, just MAYBE it\u0027s a nice new type of fighter jet to be used in the story.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-30T20:13:29Z\u0022 title=\u002210/30/2017 08:13  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 30, 2017\u003C/time\u003E by DualDesertEagle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-10-31T15:14:20Z","Content":"\n\u003Cp\u003E\nChapter 20. I just finished up the final chapter (23), and whoo boy. Listening to the Dunkirk soundtrack now, and I think it fits the situation perfectly for what I\u0027m writing \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E Enjoy 20 for now, while I pump out the Epilogue.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EChapter 20\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003EAce\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 4:00pm, 2 Days later\u003Cbr\u003E\nLocation: \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “Who is this guy?” Maxxy asked as a picture of a rough-looking kerbal flashed up on the screen. “This is DualD Kerman. A fi-“ Haydi raised her hand. “Dualdy? How do you spell that?” Gene rubbed his face. “You don’t need to take notes,” He said. “Still though. Never hurts to learn.” After the whole name spelling debacle, Gene continued. “DualD Kerman. Fighter pilot for Klathu, h-“ Hans raised his hand. “Why does his name sound so familiar?” He asked. Gene muttered “Give me strength,” before carrying on.\u003Cbr\u003E\n    “He’s got more fights kills than almost half of the Klathu Air Force combined. Now, most recently, he’s shot down two of our A-11 Warthogs over the USK. He’s not to be underestimated. I know we’re all good, but he’s equal to, or better than most of us.” Val shook her head. “There’s no way this is totally legit! Anyone with that clean of a record has to have something going for him. Any special tech he’s running compared to everyone else?” Gene nodded.\u003Cbr\u003E\n    “Hans, as you mentioned, the name is familiar. Well, just a couple years ago, he turned traitor. And he took a Raptor with him.” Hans nodded, looking more than a bit peeved. “So he’s good, and he’s got a Raptor to boot?” Ben asked, nervously eying the picture. “Exactly. Now, we’ve received intel that he’s supposed to be going to be leading air support against the front. Now we’ve been tasked with holding the front. We’re going to need everyone we can get for this one.” Paddy and Hans rubbed their hands in anticipation. Thompberry looked a tad nervous.\u003Cbr\u003E\n    “If he’s as good as you’re saying..” He started nervously. “How do we know he’s not going to shoot us down?” Gene frowned. “I don’t know. I guess we’ve just got to wing it. Now. I guess it’s up to us to do our job. So stay safe, stay quick, and stay alive. Get ready; we’re going to hold the line in 3 hours.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 6:45pm\u003Cbr\u003E\nLocation: The UK Border\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “Seeing anything?” Gene asked as they blasted towards the border, and towards the most famous ace in the enemy’s arsenal. “Not yet. About 5 minutes away from the heavy fighting though, so it depends.” Everyone was nervous. There was no easy way to defeat an ace, but if the stories were true, then this was going to be one heck of a fight.\u003Cbr\u003E\n    “Hand on… I’m seeing something..” Val saw a small, tiny dot and squinted. It was plane-shaped.. Fast.. 2 engines.. It zoomed up into the sky and twisted up; momentarily blotting out the sun. Val saw the wing shape. “Look alive guys! The Desert Eagle has arrived!!”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “Too easy!” DualD dove down on the group. It was a 12 v 3, yet every bit of odds were stacked in his favor. Then, he saw the lead plane. Ah. They were F-22 Raptors. And it looked like they were from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Finally, he smirked. A worthy opponent.\u003Cbr\u003E\n    He fired off some experimental blasts, and then smiled as he sliced right through a hole in their formation. This was going to be fun.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “Yowza!” Bryson slammed on the brakes as a Raptor dove in between him and Jim. Immediately, Val, Hans, Paddy, Ben, Triop, Jim, and Maxxy shot down and began pursuing the Diving Raptor. Meanwhile, the two wingmen were picked up by the rest of the group. Seconds after the pickup, the first assistant was absolutely obliterated. The plane’s fuel tanks erupted into fire and flame, and the pilot ejected out before anything could happen to him. Haydi, who was engaged on the second Raptor, fired off a Sidewinder.\u003Cbr\u003E\n    The missile shot straight towards the enemy plane, and looked to be on course. Sure enough, the missile plowed into the rear of the enemy plane and it was blasted in two; wings shooting off every which way as the plane plummeted to the ground. “That was easy!” Haydi grinned as the pilots all went off to engage DualD Kerman.\u003Cbr\u003E\n    He was erratic; flying everywhere and anywhere to avoid the pilots. Val and Gene were hot on her tail, with Hans and Paddy had overshot after a loop and were spinning around to come back. Just as Val was about to fire, Dual snapped around. Val just narrowly missed, and instead of following, let Jim try a go. So far, Jim was the only one who could keep up move for move, feint for feint, loop for loop. Jim popped off a couple of test shots, but they were way wide.\u003Cbr\u003E\n    Then, for seemingly no reason, Dual rolled over. A second later, a sidewinder missile shot straight at the plane. It shot straight through the gap in between the wings and the stabilizers, and exploded way off to the right. “How?!” Haydi yelled in surprise. Jim activated the RADAR, and selected the target. “Come on…”\u003Cbr\u003E\n    Jim engaged the afterburner, and closed in. As soon as he was on the verge of effective range for the AMRAAM’s, Jim unleashed a salvo of 4 missiles. They closed in, and aimed straight for the rear of the plane. DualD spun and pulled up, attempting to evade the missile. He fired off chaff, activated the afterburners, and turned on the ECM Jammer, but it was no use. The first missile slammed into the center of the plane, ripping off the top half of the fuel tanks and lighting the entire plane on fire. Then, the second missile came in and tore off the bottom half, and the plane broke apart. Ammo and fuel ignited in a huge fireball, and Jim expertly flew through the ball like he had in Dystrios; fuel and fire trailing off his tail.\u003Cbr\u003E\n    “Yes! THAT’S HOW WE DO!!\u0022 Jim performed barrel roll after barrel roll over the combat zone, celebrating the successful downing of the most illustrious fighter ace in the entire KAF. Jim saw the disembodied cockpit falling to the ground, and watched. The canopy exploded off and shot up into the air, and then a small package shot out of the cockpit; propelled by some small \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E’s. There was a small figure in a seat-like device, and Jim realized what had happened. “He ejected!” Jim called out. “No-one shoot it unless you want one heck of a lot of trouble with Kerneva.” Years ago, after the Great War, a convention for POW rights decided that pilots who ejected from their planes were protected from getting shot at in their parachute.\u003Cbr\u003E\n    Instead of firing at the pilot, Haydi instead decided to fly by just above the chute, giving the pilot a 50m/s flyover. “Haydi..” Gene warned as they formed up. “What?! It’s not my fault he just happens to be there!” Gene shook his head and sighed. “Good job everyone. Debriefing in my office as soon as we get back.” Everyone groaned. “Come on Gene! That’s sooo boring!” Maxxy protested. “Plus, you can just go over the onboard footage,” Meg added. “Hahahaha no. I expect to see everyone in my office on the double.”\u003Cbr\u003E\n    “Gene! I\u0027ve still got a tournament to win!” Haydi protested. They’d been on hold for the game and everyone was ready to watch the final. Val laughed and told Haydi “In your dreams!” The jets all flew back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and off into the bright yellow sunset, and DualD Kerman watched. And planned revenge…\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    After what felt like forever, DualD finally landed. He stumbled a bit as the ground below him slid. He lay there on the ground and stayed there for a moment. Then, he got up and checked his gun. I really should have stayed at the gun range some more.. He thought as he checked his pockets to see if there was enough ammo. Never needed to use it.. A rustling noise sounded from behind a tree, and DualD aimed the gun. “\u003Cem\u003EWer ist da?\u003C/em\u003E” He asked. A Kerbal walked up and aimed his rifle at him.\u003Cbr\u003E\n    “Freeze kommie!” Dual whipped around, and yelled “Ah!” Dual’s hands shot straight up, the gun going flying up into the air. Dangit.. The soldier confiscated the pistol, and began marching him back to camp.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “So.. We’ve finally caught the Desert Eagle..” A Colonel with an oversized ego gave a frankly pretty nasty smirk. “You’ve been giving our CAS planes one heck of a time.” Dual didn’t smile. “\u003Cem\u003E\u003Cspan style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003EIst doch ein Kinderspiel\u003C/span\u003E.\u003C/em\u003E” The colonel smirked. “Oooh smart guy, eh?” He leaned closer.\u003Cbr\u003E\n    “\u003Cem\u003ENetter Versuch. Gut, dass ich im Norden aufgewachsen bin.\u003C/em\u003E” DualD’s heart sunk faster than an aircraft carrier with a hole in it. “Oh… Oh no.” The colonel laughed. “Corporal! Get me on the phone. Call the Kerbal Space Center.” He looked at DualD. “Our friend here’s going get the experience of a lifetime.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-31T17:28:47Z\u0022 title=\u002210/31/2017 05:28  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 31, 2017\u003C/time\u003E by DarkOwl57\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-10-31T15:42:26Z","Content":"\n\u003Cp\u003E\nThat\u0027s exactly what I\u0027d hoped for, getting defeated by someone I respect anyway! And u\u0027ve got me anxious for the next chapter!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf I may offer a correction tho:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223207916\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509462860\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n“\u003Cem\u003EEigentlich nicht wirklich schwer zu tun.\u003C/em\u003E”\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ndoes make sense, but \u0022Ist doch ein Kinderspiel\u0022 (\u0022It\u0027s just child\u0027s play\u0022) is what most germans would probably say instead.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOr if u\u0027d like some sort of insulting exaggeration \u0022Selbst ein Anfänger hätte die mit Leichtigkeit besiegt!\u0022 (\u0022Even a Rookie would\u0027ve defeated them with ease!\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-31T15:46:25Z\u0022 title=\u002210/31/2017 03:46  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 31, 2017\u003C/time\u003E by DualDesertEagle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-10-31T17:31:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223207938\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509464546\u0022 data-ipsquote-userid=\u0022161533\u0022 data-ipsquote-username=\u0022DualDesertEagle\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DualDesertEagle said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s exactly what I\u0027d hoped for, getting defeated by someone I respect anyway! And u\u0027ve got me anxious for the next chapter!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223207938\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509464546\u0022 data-ipsquote-userid=\u0022161533\u0022 data-ipsquote-username=\u0022DualDesertEagle\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DualDesertEagle said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf I may offer a correction tho:\n\u003C/p\u003E\n\u003Cp\u003E\ndoes make sense, but \u0022Ist doch ein Kinderspiel\u0022 (\u0022It\u0027s just child\u0027s play\u0022) is what most germans would probably say instead.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks. If I recall correctly, Google Translate was being a real jerk. And I was tired \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223207938\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509464546\u0022 data-ipsquote-userid=\u0022161533\u0022 data-ipsquote-username=\u0022DualDesertEagle\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DualDesertEagle said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOr if u\u0027d like some sort of insulting exaggeration \u0022Selbst ein Anfänger hätte die mit Leichtigkeit besiegt!\u0022 (\u0022Even a Rookie would\u0027ve defeated them with ease!\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSounds good, but I\u0027m not going for arrogant. Skilled, but not too cocky\n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-10-31T19:08:33Z","Content":"\n\u003Cp\u003E\nChapter 21! Initially, I\u0027d planned for 24 chapters, but instead condensed it to 22. The Second-to-last chapter. Let\u0027s do this thing.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EChapter 21\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EClosing In\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 8:15pm, The Next Day\u003Cbr\u003E\nLocation: Bahmuto City High; Bahmuto City, UK (Capital)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    The obnoxiously loud whistle almost deafened Josh as he stood on the sideline. “Would you stop that?” He muttered as he walked off to get water. He looked at the scoreboard, and sighed. 16-0. Badgers with the ball. Unfortunately, they were not ahead, and they were most definitely not the Badgers. As he looked up, he saw some white flashing lights. He shook his head. Probably that hit on kickoff from Number 73, He thought as he squirted the water into his face, trying to wash some of the grass off. For a 4-A school, you’d thing they’d have a bit of turf.\u003Cbr\u003E\n    Just then, a massive rumbling started deep in his chest. “What in the…?” He looked up and saw 2 pairs of white trails; the ends and rim of the trails tinged with a cobalt blue. Everyone on the field stood stock still; looking for the noise maker that was shaking the rickety old scoreboard. Finally, after some time, the rumbling left, and play resumed. “Goodbye Raptors,” Josh waved, before turning back to the field. “And good luck…”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 10:00am, The Next Day\u003Cbr\u003E\nLocation: \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “This the guy?” Gene asked as DualD was escorted off the plane. “Yup. Caused a load of trouble for our guys providing CAS. Glad to see he’s finally down.” The colonel nodded. “We’re really grateful for the help. He was really tormenting the ground troops at the front. Without you guys..” Gene smiled. “That’s what we do. 24 hours a day, 7 days a week. Good for birthday parties, weddings, and the occasional fighter ace with 3 days notice.” The colonel laughed, and began walking back to the plane. “Good luck with him,” he said, waving. “You’re gonna need it.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    DualD sat in the chair; his arms cuffed to the chair. This is absolutely humiliating.. Dual thought, looking around the cold, dark, and really pretty musty room. Probably hasn\u0027t been used since the Great War, it’s so old, He gave a faint chuckle to himself as a door opened up next him. “\u003Cem\u003EHallo,\u003C/em\u003E” Hans said, walking around. Just as Dual was about to reply, a flying fist punched him in the jaw; whipping his head around. “\u003Cem\u003EWie geht’s?\u003C/em\u003E\u0022 This time it was a kick to the leg.\u003Cbr\u003E\n    “\u003Cem\u003EWollte immer einen Verräter treffen\u003C/em\u003E,” Hans carried on conversationally; a flurry of fists and feet hitting Dual with every word. “\u003Cem\u003EWunderte sich, wie es ist\u003C/em\u003E.” Hans missed a kick, and the chair fell over- Dual still chained to the arms. Just then, when Dual thought he couldn’t take any more, the door flew open, and someone tackled Hans.\u003Cbr\u003E\n    “\u003Cem\u003EVerlassen! Jetzt!\u003C/em\u003E” A loud, heavily accented voice shouted. The two scuffled on the floor, until finally Hans was thrown back towards the door. Dual saw his savior; fairly tall, wearing a white lab coat. Light mustache. “Go.” Wernher pointed to the door. Hans glared at Dual, spat “\u003Cem\u003EDu hast Glück,\u003C/em\u003E” and went out. Wernher sighed, and began untying Dual.\u003Cbr\u003E\n    “Sorry about zat,” Wernher sighed as he righted up the chair. “Vhen he gets upset..” He began untying the wrists. “Hes temper tends to get ze best of him.” Wernher got up and helped Dual up. When Dual was finally able to support his own weight, Wernher extended his hand. “Vernher Von Kerman.” Dual shook his hand, and smiled a bit. “Thanks,” Dual replied; a slight country accent twanging around.\u003Cbr\u003E\n    “Ooh, Sozener?” Wernher asked as they sat down at the table of Dual’s cell. “Born up north, raised down south, trained both places,” Dual explained, remembering his history. “Ah I see. Vell, I’ve got good news and zome bad news. Ze good news is zat you won’t be considered a var criminal. Ze bad news is you vill not be allowed to fly vith ze team.” Dual nodded. “Ah well, I kind of expected that to be honest with ya. I wouldn’t do anything different if I was in y’all’s boots.”\u003Cbr\u003E\n    “I vill try to get zem to let you out from time to time,” Wernher said, walking out of the room. “\u003Cem\u003EViel Glück\u003C/em\u003E,” Dual waved. The door closed with a spooky certainty.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 12:00 Noon\u003Cbr\u003E\nLocation: Grand National, Kruola (Capital)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    Billy cowered in a corner as another bomb rattled the shelter. By now the entire capital had been almost reduced to rubble by the Kerthenian and Agonarch bombers at this point, but the attacks just kept on coming. It was impossible to walk outside without stepping on a chunk of rubble or a body. Rebels and Separatists had been launching protest after protest at the capital building, but they only served as cannon fodder from the Agonarch artillery barrages and the Kerthenian Bombers.\u003Cbr\u003E\n    Someone screamed as a bomb exploded what sounded like inches away from the shelter door; knocking out the power to the lights and making dust fall from the ceiling. The power flickered back on, and Billy saw a crack spreading across the ceiling. Then, a small metal tip pushed through the crack. \u003Cem\u003EBunker Busters..\u003C/em\u003E Billy closed his eyes as the fire washed over him.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “Is the bomb ready?” The officer asked. The orderly nodded, and the officer looked out the window. “Fire when ready,” He said. The button slid down, and the engines ignited. The nuke was on the way.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “30 Funds?!” Crystal exclaimed. “30 for one apple?!” The vendor shook his head. “Take it or leave it,” He said, pointing to the sign. “Of all the things..” Crystal muttered as she pulled the money out of her purse. “Here. 60.” She handed the vendor the paper, and took the apples. She stuffed the fruit in her bag, and began walking off down the road. Then, a siren sounded.\u003Cbr\u003E\n    Crystal looked up and saw a flaming pod-shaped thing falling to the ground. “Oh my god..” She whispered. The pod broke apart and revealed the payload; a 30 kiloton nuclear bomb. Three of them. The citizens around her screamed and began running; Crystal caught up in the sea of stampeding kerbals. The bomb went off, and light flashed. Then, the 500 mile per hour winds knocked her off her feet.\n\u003C/p\u003E\n"},{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-10-31T19:42:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223208082\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509476913\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n    DualD sat in the chair; his arms cuffed to the chair. This is absolutely humiliating.. Dual thought, looking around the cold, dark, and really pretty musty room. Probably hasn\u0027t been used since the Great War, it’s so old, He gave a faint chuckle to himself as a door opened up next him. “\u003Cem\u003EHallo,\u003C/em\u003E” Hans said, walking around. Just as Dual was about to reply, a flying fist punched him in the jaw; whipping his head around. “\u003Cem\u003EWie geht’s?\u003C/em\u003E\u0022 This time it was a kick to the leg.\u003Cbr\u003E\n    “\u003Cem\u003EWollte immer einen Verräter treffen\u003C/em\u003E,” Hans carried on conversationally; a flurry of fists and feet hitting Dual with every word. “\u003Cem\u003EWunderte sich, wie es ist\u003C/em\u003E.” Hans missed a kick, and the chair fell over- Dual still chained to the arms. Just then, when Dual thought he couldn’t take any more, the door flew open, and someone tackled Hans.\u003Cbr\u003E\n    “\u003Cem\u003EVerlassen! Jetzt!\u003C/em\u003E” A loud, heavily accented voice shouted. The two scuffled on the floor, until finally Hans was thrown back towards the door. Dual saw his savior; fairly tall, wearing a white lab coat. Light mustache. “Go.” Wernher pointed to the door. Hans glared at Dual, spat “\u003Cem\u003EDu hast Glück,\u003C/em\u003E” \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood thing I\u0027m attending this thread, eh? Apply the following, then everything makes perfect sense:\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cem\u003EWollte \u003Cstrong\u003E\u003Cu\u003Eschon\u003C/u\u003E \u003C/strong\u003Eimmer einen Verräter treffen\u003C/em\u003E,”\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cem\u003EWunderte sich, wie es ist\u003C/em\u003E.” --- replace this with --\u0026gt; \u0022Hab mich immer gefragt, wie das ist.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cem\u003EVerlassen! Jetzt!\u003C/em\u003E” -----\u0026gt; \u0022Raus hier! Sofort!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cem\u003EDu hast Glück,\u003C/em\u003E” -----\u0026gt; \u0022Da hast du aber Glück gehabt!\u0022 Or, if u\u0027d like to use a german saying, \u0022Da hast du aber Schwein gehabt!\u0022 (The germans see pigs as a symbol of luck and thus often replace \u0022luck\u0022 with \u0022pig\u0022, tho that joke doesn\u0027t really work too well in english.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-11-02T14:30:19Z","Content":"\n\u003Cp\u003E\nThe final battle. To think, I started this almost.. what was it, like 4 months ago? July, August, September, October- almost 5 months now. Whew... Enjoy this, the final battle. (That I\u0027m gonna type \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E) Enjoy!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EChapter 22\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EThe Big One\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 1:00am, 1 week later\u003Cbr\u003E\nLocation: \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    Val snored a bit as she slept; her hair a massive, tangled mess. Outside, some crickets quietly chirped, and fish splashed around in the pool next to the Admin building. The waves by the beach made nice, soft whooshing noises as they crashed over the sand. As Val snoozed, and as she rolled over onto her side, a phone split the cold night air. “BWARGH!” Val shouted as she fell out of the bed with a huge \u003Cem\u003Ethunk!\u003C/em\u003E straight onto her elbow. “Ow, ooh ow,” Val groaned as she walked over to the phone. Rubbing her eyes, she picked up the phone.\u003Cbr\u003E\n    “Colonel Valentina K,” Val said, massaging her arm. \u003Cem\u003EThat’s gonna leave a bruise and a half.\u003C/em\u003E As she listened to the message, her eyes popped open. “General, I-“ She tried to say. “\u003Cem\u003EToday?!\u003C/em\u003E Sir, you could have at least given us some advance-… \u0027No time,’ I see.. Why didn’t you call Gene? He’s the Commandin-… Oh yeah.. He is pretty hard to get up at any hour; especially at one in the morning. Yes. Yes, I see. Well good for them! Wish them luck from me. How\u0027s Alli doing? Ah, the flu.. Yeah, that\u0027s going around this time of year.. Medicine, Soup, and some good rest is what my mom always told me. Yes sir; Chicken Noodle is the best. Tomato works too.. Yes sir. Um, sir? Might I ask a question? Thanks. My question is if we’re going to get any international support. Like any if we’ll have extra fighter help from our allies. I see. Everyone else is doing their own attacks. Alright, thanks sir. When will the attack begin? Alright. Thank you General. Yes sir. Goodnight, sir.” Val set the phone down.\u003Cbr\u003E\n    Val sprinted out of her room, and into Mission Control. She had to plan for the Big One.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 6:00am\u003Cbr\u003E\nLocation: \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    Haydi yawned as her alarm went off. “Good morning, Four,” She said, stretching her arms out. “Good Morning,” Four replied as he retracted the solar panels and “Looked” outside. Haydi got dressed and began walking down the stairs. Right then, Val’s voice came over the intercom. “All pilots, please report to Mission Control. All pilots, report to control; on the double.” Haydi began running to Control, and by the time she had gotten there most of the other pilots were jet getting out of their rooms. “Haydi!” Val exclaimed when she walked in. “You’re fast..” Haydi shrugged. “Just got a fast start. What’s up?” The other pilots burst into the room and filled into the seats. Val nodded and started.\u003Cbr\u003E\n    “Morning everyone, sorry to wake you but this is important. Last night, I got a call from General Baker H. Kerman from HQ. We’ve got a battle. But this isn’t any battle.” Val pulled up an image of the continental map, and zoomed in on Kafrica; the continent they were on. All over the continent were yellow and blue lines heading to one point. Klathu’s capital.\u003Cbr\u003E\n    “This is it. We’ve pushed Klathu’s front line all the way back to Shadow City, and our ground troops have managed to punch through. Paratroopers and light attack vehicles are already on the outskirts of the city, while the rest of the army- Tanks, Artillery, and some other support- is following close behind. Meanwhile, off the coast, our entire navy, with Veloxian Naval Vessels waiting in the wings, is bunched up their coast, preparing to engage their navy. Marines are en route to the capital as well, and will land as soon as the air battle begins. As for us, the entire UK air force is going to depart from their bases, and overwhelm the enemy in the air. Once that occurs, we’ll be able to deploy all of the CAS aircraft and the bombers, and that’ll clear the way for our guys down on the ground to storm the capital building, and force a treaty. Any questions?” No-one asked a question. “Good. Now. I’m going to be frank here. This is going to be the biggest battle of the war; maybe of our entire lives. It will be a test of mental strength, physical endurance, and all the skill we can possibly think to muster. Some of us might not make it. But we’re the best pilots in the force, with the best planes and the best abilities. We know how to fight. We know how to work. We are the best in the world, and we know how to do this. Now. Suit up. We leave in 30 minutes.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 7:25am\u003Cbr\u003E\nLocation: The Outskirts of Hub City, Klathu (Capital)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “FIRE!!” The cannon fired the projectile up into the air, and seconds later it came rumbling down to the surface; collapsing buildings and sending up a huge plume of dust. “Again!” Sanson shouted. One day his unit was defending Kursk. Then it was out to the USK. Now, it was in the final battle. Amazing how much can change in the span of a few months.\u003Cbr\u003E\n    “Fire until you run out of ammo. We cannot let them come anywhere close to our fortifications!” The guns fired again and again; almost in unison as they attempted to repel the enemy through the cities. “And where the heck are those air units?!” As soon as he finished speaking, a deep rumbling rattled his chest, and the sun was blotted out. He looked up, and saw what seemed to be thousands of planes, all different shapes, sizes, and types. “Oh my god..” He muttered. “Here comes the cavalry.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “Light ‘em up!” Val shouted; inverting her Raptor and diving down on the first plane she saw; a F-65 Cobra. She powered down and fired off an AMRAAM; shredding the enemy into a thousand pieces which fell down to the ground below. She caught onto the next plane, and chased it down; mere feet above the rooftops. Then, the towers stopped and the skyline evened out, and Val could see the ground below. As she was about to fire, the plane in front of her erupted in flame; first the right wing, then the fuselage, and then the left, until the entire plane was a spiraling ball of fire. The wings ripped off, and the plane crashed into the ground; flattening 3 enemy tanks and 2 enemy Jeeps on the ground below, sending up an almighty explosion. Val looked around and saw a tank; it’s barrel pointed to the sky. The Army was here.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “Fire!” The massive M1 Abrams tank cannon rattled the entire vehicle as it shot off a shell; obliterating the heavy tank right in front of it. The enemy vehicle erupted in a ball of fire, and then exploded in a huge chaotic mess; debris flying everywhere as the ammo erupted. The team of 5 tanks rolled forward into a large clearing, and saw at least 10 tanks; their barrels all aimed at the tank. “Oh sh-“ Right then, the tanks all started blowing up; left to right. The tanks were obliterated and flipped over. The driver looked around, and saw it. The F-34B Lightning was hovering just a few meters off the ground; sending up dirt and stones as the \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E engine kept it up. Seemingly satisfied with it’s work, the plane gained altitude and shot off to attack the next vehicles. The Marines were here.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    “CHAAARRRGGGEEEE!!!!!” Crowds of marines sprinted out of the landing craft and began firing on the enemy ground troops; their footsteps sending up splashes of water and sand. Behind them, the navy was doing battle; massive titans of steel and spirit doing legendary combat for control over the seas. The rattling of machine guns filled the ears of everyone on the beach, and finally, after almost an hour of grueling, bloody conflict, the guns finally went silent. The Marines cheered, and began their advance. As they went over the crest of a hill, they saw the capital. And in the place of Klathu’s flag- A White star on top of a red X- was a pure, white flag. And the beach was silent. After what seemed like forever, one Marine kneeled. Then another. Then another. Until finally, the whole beach was filled with kneeling Marines, honoring their forever lost friends.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n    Val watched the flag slowly raise up, and flew over the ground at a little under 100 meters per second. “Oh my god..” The radio was silent as everyone saw the white flag rise. “We did it..” There was a whirlwind of emotion as Val felt every emotion flooding in at once. The hate at the enemy evaporated. The nation was finally at peace. \u0022It\u0027s over..\u0022 Suddenly, the entire channel was filled with people cheering, yelling, crying, screaming, and celebrating. \u0022IT\u0027S OVER!!!!!\u0022 Val shouted, celebrating as tears of joy streamed down her eyes. Klathu had finally fallen.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-02T14:32:52Z\u0022 title=\u002211/02/2017 02:32  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 2, 2017\u003C/time\u003E by DarkOwl57\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-11-02T17:33:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223209288\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509633019\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe F-34B Lightning was hovering just a few meters off the ground\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSeems like a dangerous thing to do in a heated fight O_O\n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-11-02T19:14:07Z","Content":"\n\u003Cp\u003E\nThe final Chapter (Of the main story). It\u0027s been real fun, I\u0027ve got to admit. But I\u0027m kinda happy it\u0027s over actually. With WWK done and dusted, I\u0027ve got some room to work on \u003Cem\u003ELife at the Top, The Legend of Luke Kerman, \u003C/em\u003Eand of course \u003Cem\u003EThe Final Stand\u003C/em\u003E. Before we begin the final chapter (Before the 5 or 6 epilogues), I\u0027d like to say thanks to everyone who\u0027s stuck with me. Now. LET\u0027S DO THIS THING! (Oh, and Enjoy \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EChapter 23\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EThe End\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 8:00pm, 1 Day later\u003Cbr\u003E\nLocation: World Kouncil Building, UK\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    The cameras were blinding as the delegates all walked out of the Kouncil building. Thousands of reporters were clamoring for spots as the announcement was made. The President of the IKA, Meghan Kerman, took the microphone. “Good evening everyone, I\u0027ll try to make this short for you,” She started, and began her speech.\u003Cbr\u003E\n    “Friends, we have been involved in this civil- and international- war for almost 4 years now. None of us have got away clean. We’ve lost family. Friends. Comrades. Brothers and Sisters. Mothers and Fathers. Thousands of innocents have died at both side’s hands. But today,” She held up a small packet of papers. “Today my friends, this war- this bloody, horrible, deadly war- is over. Today at just past 7:45 PM, in the World Kouncil Building in United Kerbin, delegates from both sides have finally ceded an end to the war. Our fight is finally over. Both sides have walked away with something we’ve longed for for so long: Peace. Our silly, stupid conflict has cost far to many lives. And now, we call an end to it. The end. Of \u003Cem\u003EWorld War K.\u003C/em\u003E”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 8:05pm\u003Cbr\u003E\nLocation: \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “It’s over….” Val whispered as everyone was jumping around and cheering; celebrating the end to the worst war in history. It had been a grueling fight.. terrible losses… Val kneeled down and did something she’d never tried before. She started praying. It caught everyone off guard, and they watched and listened.\u003Cbr\u003E\n    “Not quite sure how to do this,” Val started, before continuing. “But here we go. Kraken, if you’re.. You know.. ‘Out there,’ and all, I’d just like to say thanks. And.. if you can.. help us to like forget? All of this? We’ve lost a fair few amount of friends. Christina. Tarkin. Sanson over in Kursk. And if it’s your will and all.. Just.. Help us. Uh.. and that’s it, I guess. Thanks.” She got up and brushed her pants, and saw everyone staring at her. “What’re you looking at?” She asked. Everyone turned and began celebrating, and Val joined in. But there was one thing she hadn’t dared mention out loud to anyone. \u003Cem\u003EBring Jeb home. Please.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 3:00pm, 2 Days later\u003Cbr\u003E\nLocation: Bahmuto City, UK\n\u003C/p\u003E\n\u003Cp\u003E\n   \u003Cem\u003E “For where’er you go, you will always know, that those caissons go rolling along!!!”\u003C/em\u003E Val clapped as the army soldiers finished their song for the “official” post-war singing contest in some random restaurant in Bahmuto. “Air Force, you’re up!” Someone said. Immediately, the entire \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E staff, as well as about 5 other tables stood up and got in the center. Everyone who wasn’t standing was clapping, preparing for the song. “Ready?” Val asked the group. “One. Two. One, two, o-“ Just as Val was about to give the “go” command, Haydi ran up.\u003Cbr\u003E\n    “Val!” She shouted, almost tackling her as she sprinted in. “Whoah whoah whoah, slow down!” Val exclaimed, recovering. “Deep breaths now. In, out. In, out.” After Haydi had recovered, she started talking. “We found him. At least we think we found him. Gene-.. Gene said this is it. We’re close. Really, really close.” Haydi babbled on, but Val cut her off. “Found who?” She asked. Haydi’s eyes widened. \u003Cbr\u003E\n    “Jeb,” Haydi said breathlessly. “We found Jeb.”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cb\u003EThe End of World War K\u003C/b\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-02T19:33:19Z\u0022 title=\u002211/02/2017 07:33  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 2, 2017\u003C/time\u003E by DarkOwl57\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-11-06T16:49:39Z","Content":"\n\u003Cp\u003E\nThe Epilogue(s). This is one of my favorite parts of the writing process; tying up all the loose ends that I may have left. It\u0027s extremely fun, and now I get to do my favorite thing once again! I hope y\u0027all have enjoyed, It\u0027s been a fun ride, and without further ado......\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003EEpilogue(s)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EI\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EConsequences\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E    The war lasted for 3 years, 10 months, and 17 days. \u003Cbr\u003E\n    The landscapes of Osiris, Hub City, and all the other victims of nuclear bombings will never be the same again, while smaller communities affected by the war may never return.\u003Cbr\u003E\n    No-one knows if the areas affected by the bombs will ever be the same again.\u003Cbr\u003E\n    Over 40 million kerbals were killed, not including the no doubt millions of innocent kerbals in cities.\u003Cbr\u003E\n    The injured count is over 50 million, with almost 55% of the injuries occurring on or near the front lines of the numerous nations involved.\u003Cbr\u003E\n    In the official treaty, all nations but one have remained untouched with their war borders at the time of the truce; Klathu. The nation that started this war has now been split evenly between the Veloxian Republic and United Kerbin, who are now living together in harmony.\u003Cbr\u003E\n    Following investigation, it was found that Twitchi Kerman, instigator of the war, committed suicide when the first jeep rolled into his mansion’s gates.\u003Cbr\u003E\n    Across the world, everyone is rebuilding. Over 3 Billion funds have been set aside by various nations for relief and rebuilding efforts.\u003Cbr\u003E\n    Of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E staff, no-one’s lives are the same. Bryson, a star track and football athlete came home to find his home town in ruins. Haydi, who has decided to stay at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, has retired from being a fighter pilot and instead has turned to the stars; preparing to lead the first ever kerbaled mission to Duna. Jim and Thompberry have continued their show, which is now in their 88th episode; shooting all over the world for the perfect show. In between the shoots, Jim found time to release his songs; Longshot and Demons, both of which have shared the top spot for almost 50 weeks on the Billboard Top 100, International Music Today, and many more. Gene finally proposed to Meg after their multiple years of being together. The date is set for the next winter. Triop, Hans, and Ben have all turned their attention to training the next generation of recruits. Paddy, who was participating off-and-on in international air racing, has used his money to start a racing team to participate in the K1 World Championship; MonsterGP. DualD, who was prosecuted for War Crimes against the UK and her allies, is serving 10 years in a federal prison; However, Wernher is appealing. Now, we join the crew all over the world, 4 days after the war ended.\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-11-06T19:27:06Z","Content":"\n\u003Cp\u003E\nWhat happened to frying pan chucking Lilly and her family?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd I\u0027m wondering what my Kerbal counterpart is gonna do after jail?\n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-11-06T20:30:53Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EII\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EBack to Normal?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “How are you doing, Buck?” Val asked in the group call. “Pretty terrible actually. Turns out the school I was going to stay at and try to finish schooling burned to the ground in the fire. Nothing left.” Val sighed and shook her head. “Any chance of a rebuild?” Haydi asked from the garage; fiddling with some sparks and wires with Four. “Not sure. We’ll try, but it’s day-to-day at this point. Some of us aren’t even sure if the relief money’s even going to get here.” Buck kicked over a piece of concrete as he threw away a half-burned door. The radio was silent for a bit, but then Triop asked “Do you think anything’s going to be back to normal?”\u003Cbr\u003E\n    “No chance,” Bryson replied. “Maybe,” Haydi answered; tinkering around. “Probably.” Val leaned back. “I mean, nothing’s going to be exactly the same, but… I think the world’s going to be a much better place in 5 or 6 years time. It just takes a while..” The others murmured in agreement, and Haydi added “You know, I read somewhere ‘There’s always going to be something to knock us down, but all that matters is how we get back up,’ or something like that.” \u003Cbr\u003E\n    “Heyoo guys,” Thompberry’s voice chimed in over the radio. “Hey Thompers! How’s it going?” Haydi asked. “Good. The crew just got done shooting in Baikerbanur and they’re heading home. Jim, Me, and a few other crew guys are back in Bahmuto working on the next scene.” Thompberry sipped a smoothie. “How’s the studio?” Val asked. Just before the war had ended, a rogue car bomb had exploded just outside the studio and almost destroyed the place. “Good. We got an estimate yesterday; gonna be in the 3000 fund range. The outer structural beams are shot, but somehow the roof’s stable. We got most of the props and stuff out just in case she goes. We rented out another studio just down the road; a bit cramped but we can make due.” Val shook her head. “That sucks,” She said. “Ah well, what can ya do?” Thompberry asked. Right then, Paddy popped in.\u003Cbr\u003E\n    “Top O’ the Mornin’!” He said; the sound of hammering, drills, and wrenches in the background. “Paddy?” Val asked, trying to hear. “Wh.. Where the heck are you?” Paddy laughed. “We’re in Celrepan right now working on the car. Pre-Season Testing’s coming up soon and it’s full speed ahead. Lisa and Hank are both doing some sims right now. Y’all coming to watch?” He asked. “Testing’s at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, right?” Haydi asked. “Yup. We’re gonna to through R\u0026amp;D, past the AC, around the Tracking Station, past the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and the Hangar, and then we’ll go around again! The sims make it look like a whole load of fun.” Just as Val was about to answer, Gene’s voice came over the intercom.\u003Cbr\u003E\n    “Haydi and Valentina, please report to the Administration Building. Haydi and Val to the Admin Building.” Val got up, and took the phone. “Hey, we’ve got to go. Talk to you guys later?” She walked out of her office and headed down the hallway to Gene’s office. Before anyone could answer, Val had entered Gene’s office, and saw Gene’s laptop. She dropped her phone in shock, and it bounced on the carpet; forgotten. Val stared at the screen, which showed a rocket buried in Red Sand. There was a name on the cockpit.. Jeb’s name.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2017-11-07T03:37:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223212612\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510000253\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EII\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EBack to Normal?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “How are you doing, Buck?” Val asked in the group call. “Pretty terrible actually. Turns out the school I was going to stay at and try to finish schooling burned to the ground in the fire. Nothing left.” Val sighed and shook her head. “Any chance of a rebuild?” Haydi asked from the garage; fiddling with some sparks and wires with Four. “Not sure. We’ll try, but it’s day-to-day at this point. Some of us aren’t even sure if the relief money’s even going to get here.” Buck kicked over a piece of concrete as he threw away a half-burned door. The radio was silent for a bit, but then Triop asked “Do you think anything’s going to be back to normal?”\u003Cbr\u003E\n    “No chance,” Bryson replied. “Maybe,” Haydi answered; tinkering around. “Probably.” Val leaned back. “I mean, nothing’s going to be exactly the same, but… I think the world’s going to be a much better place in 5 or 6 years time. It just takes a while..” The others murmured in agreement, and Haydi added “You know, I read somewhere ‘There’s always going to be something to knock us down, but all that matters is how we get back up,’ or something like that.” \u003Cbr\u003E\n    “Heyoo guys,” Thompberry’s voice chimed in over the radio. “Hey Thompers! How’s it going?” Haydi asked. “Good. The crew just got done shooting in Baikerbanur and they’re heading home. Jim, Me, and a few other crew guys are back in Bahmuto working on the next scene.” Thompberry sipped a smoothie. “How’s the studio?” Val asked. Just before the war had ended, a rogue car bomb had exploded just outside the studio and almost destroyed the place. “Good. We got an estimate yesterday; gonna be in the 3000 fund range. The outer structural beams are shot, but somehow the roof’s stable. We got most of the props and stuff out just in case she goes. We rented out another studio just down the road; a bit cramped but we can make due.” Val shook her head. “That sucks,” She said. “Ah well, what can ya do?” Thompberry asked. Right then, Paddy popped in.\u003Cbr\u003E\n    “Top O’ the Mornin’!” He said; the sound of hammering, drills, and wrenches in the background. “Paddy?” Val asked, trying to hear. “Wh.. Where the heck are you?” Paddy laughed. “We’re in Celrepan right now working on the car. Pre-Season Testing’s coming up soon and it’s full speed ahead. Lisa and Hank are both doing some sims right now. Y’all coming to watch?” He asked. “Testing’s at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, right?” Haydi asked. “Yup. We’re gonna to through R\u0026amp;D, past the AC, around the Tracking Station, past the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and the Hangar, and then we’ll go around again! The sims make it look like a whole load of fun.” Just as Val was about to answer, Gene’s voice came over the intercom.\u003Cbr\u003E\n    “Haydi and Valentina, please report to the Administration Building. Haydi and Val to the Admin Building.” Val got up, and took the phone. “Hey, we’ve got to go. Talk to you guys later?” She walked out of her office and headed down the hallway to Gene’s office. Before anyone could answer, Val had entered Gene’s office, and saw Gene’s laptop. She dropped her phone in shock, and it bounced on the carpet; forgotten. Val stared at the screen, which showed a rocket buried in Red Sand. There was a name on the cockpit.. Jeb’s name.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFinally!\n\u003C/p\u003E\n"},{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-11-07T08:28:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223212612\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510000253\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nVal stared at the screen, which showed a rocket buried in Red Sand. There was a name on the cockpit.. Jeb’s name.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo he\u0027s on Duna?\n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-11-07T13:49:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223213003\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510043319\u0022 data-ipsquote-userid=\u0022161533\u0022 data-ipsquote-username=\u0022DualDesertEagle\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, DualDesertEagle said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo he\u0027s on Duna?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027ll see \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E Still gotta upload 2 more epilogues though.. speaking of which...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo for this one,  I \u003Cs\u003Estole\u003C/s\u003E borrowed a lot of material from Whispers of the Kraken; mainly the first couple chapters going into Val\u0027s personal past. And Shadows helped me with the launch sequencing. Couldn\u0027t have done it without you \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57438-catastrophicfailure/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257438\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57438-catastrophicfailure/\u0022 rel=\u0022\u0022\u003E@CatastrophicFailure\u003C/a\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EIII\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003ETo Duna\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “The Explorer rover found this 4 days ago. Now according to our scans, there is a life form in the general vicinity of the debris. Now we’re not sure if this is Jeb’s rocket. And if it is, there’s a pretty good chance he’s dead after 24 years off the planet. But he could still be alive. It’s a long shot, but..” Gene trailed off. “I’m going.” Val kept her chin up. “Val-“ Gene tried to say, before Haydi interrupted. “Gene, as commander of the \u003Cem\u003EDuna I\u003C/em\u003E mission, I’m requesting a transfer.” Then, she walked over to the other side of the room, and said “Haydi, I accept your request,” and walking back to where she was.\u003Cbr\u003E\n    “Sorry,” Haydi apologized, trying not to keep from laughing. “My hands are tied! Mission commander already accepted her.” Val grinned. “Thank you Haydi!” She gave Haydi a massive hug, almost lifting her off the ground. After Val had all but squeezed the life out of Haydi, they finally sat down. “Now,” Haydi said, trying to catch her breath. “Where’s Jeb?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 2100 Hours, 4 Months later\u003Cbr\u003E\nLocation: \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    Val’s breath made a small steam cloud as she laid down on the scaffolding in the chilly night air; staring up at the bright stars- diamonds sprinkled on a black velvet cloth. A strong and cold ocean wind blasted in; seeming to cut through Val’s jacket. She didn’t mind though. Her hand absentmindedly tapped at the hatch door, which was wide open. A couple lights were on inside the Complex and the R\u0026amp;D Center as everyone crunched the numbers on \u003Cem\u003EDuna I\u003C/em\u003E. \u003Cbr\u003E\n    Val remembered back to her childhood; way back beyond her high schooling and back in Jesalia. The days in the snow.. That freezing, barren place where she had lived for 12 years. Then the \u003Cem\u003EAccident..\u003C/em\u003E Val felt a couple tears well up as she remembered. “Gah this is stupid,” She muttered to no-one, wiping a tear away. “Heck, I can’t hardly even remember what the accident was..” She strained herself to remember. Then, everything came back. Papa was going to be the first Kerbal into space. His rocket- \u003Cem\u003EMoskva I\u003C/em\u003E- was going up.. Then..\u003Cbr\u003E\n    Val shut her eyes as she attempted to force out everything. The noises.. The explosions.. The Fire Crew attempting in vain to stop the furious flames that consumed everything… The fire.. The fire was horrible. A massive ball of flame that was so large the smoke could be seen in Imperial City… Val’s mom had moved them across the world a week later; doing the same thing Val had when Jeb left. Escape the memories. The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was her home now. Val still filled out the payments on her place in River City, but she never went there.\u003Cbr\u003E\n    Val rubbed her thumb on the hatch; feeling the smooth paint as she remembered. She smiled as she remembered how Jeb had basically tripped all over himself when he had met her mom; trying to get her approval. Then, the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Her first training flight in the ancient Ares. Her first flight in a rocket. And Valentina Kerman; the first female kerbal into space. Her mom was so proud.. Val heard someone coming up the scaffolding’s steps; the footsteps making a faint clanking noise. Val wiped away the tears and sat up, trying to look natural. Haydi appeared; smirking a bit as she saw Val. “Hey,” Val waved; flopping back down on the ground.\u003Cbr\u003E\n    “Knew I’d find you here,” Haydi replied, sitting down right next to Val. “Can’t sleep either?” Val asked, looking over. “You kiddin’?” Haydi asked. “How in the name of Kerb would I be able to sleep on a night like this?” Val let a tiny laugh escape. “I know how you feel,” She replied, remembering her first mission.\u003Cbr\u003E\n    “But seriously, we’ve got to get to bed. I can’t have my copilot pass out mid-gravity turn.” Val smiled. “Just remembering what it was like back when I was a kid,” Val sighed. “Back in the Dark Ages?” Haydi joked. Val gave off a quick Jesalian quip and Haydi smiled. “Hey, no fair! I don’t know dual languages!” The two laughed, and Val sighed. “Are you ready?” She asked. “Are you kidding?” Haydi laughed; laying down and staring up at the stars with Val. “Heck no,” She added. Val laughed.\u003Cbr\u003E\n    “Don’t worry. You’ve done all you can. Now it’s just a matter of getting the sim stuff to work in the outside world.” Haydi nodded. “Well, we’d better get out of here. Long morning ahead.” Val sighed and got up. She was just a bit shorter than the usual recruits, but even then Haydi towered about 5 or 6 inches above her. While they walked down, Val absentmindedly rubbed her hand around the rocket as they walked the spiral staircase around the rocket. The rocket that would take them all to Duna.\u003Cbr\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp\u003E\nTime: 1200 Hours, The Next Day\u003Cbr\u003E\nLocation: \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    “Aux systems flowing nicely. Fuel sensors picking up nothing unusual.” Gene nodded as he watched the behemoth of a rocket on the pad preparing for launch. “Ox tanks good?” The head data member called across the room. “All good here!” The fueler shouted out. “Comm Check; Val, Haydi, can you hear me?” Gene asked into his mic. There was some static before Haydi replied, “Loud and clear Gene! All systems looking good from up here!” In a happy voice. “Alright crew, are we all ready for count off?” Gene asked.\u003Cbr\u003E\n    “RADAR,”\u003Cbr\u003E\n    “Go”\u003Cbr\u003E\n    “Fuel,”\u003Cbr\u003E\n    “Go”\u003Cbr\u003E\n    “Engines,”\u003Cbr\u003E\n    “Gene, we are good to go”\u003Cbr\u003E\n    “Boosters,”\u003Cbr\u003E\n    “Go!”\u003Cbr\u003E\n    “Gimbal,”\u003Cbr\u003E\n    “We are a go for launch”\u003Cbr\u003E\n    “Telemetry,”\u003Cbr\u003E\n    “Go”\u003Cbr\u003E\n    “Staging,”\u003Cbr\u003E\n    “Go”\u003Cbr\u003E\n    “Guidance”\u2028    “Go”\u003Cbr\u003E\n    “Control,”\u003Cbr\u003E\n    “Go”\u003Cbr\u003E\n    “\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E”\u003Cbr\u003E\n    “We are a big fat go, Gene”\u003Cbr\u003E\n    “Range,”\u003Cbr\u003E\n    “Go”\u003Cbr\u003E\n    “Fuel,”\u003Cbr\u003E\n    “Go”\u003Cbr\u003E\n    “Data,”\u003Cbr\u003E\n    “Go!”\u003Cbr\u003E\n    “LRTS,”\u003Cbr\u003E\n    “…”\u003Cbr\u003E\n    “LRTS, confirm go for launch. LRTS?” The radio remained silent, and Gene went on.\u003Cbr\u003E\n    “Comms,”\u003Cbr\u003E\n    “GO!” Val shouted, making Gene jump a bit. “Sorry,” She giggled, before Gene continued.\u003Cbr\u003E\n    “Surgeons,”\u003Cbr\u003E\n    “Good”\u003Cbr\u003E\n    “Strategies,”\u003Cbr\u003E\n    “Go”\u003Cbr\u003E\n    “Math Department,”\u2028    “Calculators at the ready”\u003Cbr\u003E\n    “LRTS,”\u003Cbr\u003E\n    “Go for launch, Control,” A voice said after 10 more seconds of silence.\u003Cbr\u003E\n    “Flight,”\u2028    “Control, this is \u003Cem\u003EDuna I\u003C/em\u003E. We read ya loud and clear up here.”\u003Cbr\u003E\n    The control room clapped, and Gene called out “All systems report ‘Go.’ Countdown commenced; T minus 2 minutes.” Haydi began flipping switches to begin the numerous fuel purges. “\u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E purge.. OF purge.. Hey Val? Could you get- Yeah, that’s it, thanks. Gene, this is \u003Cem\u003EDuna I\u003C/em\u003E; we are running on our own power now. EC, \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E, and OX are all good.”\u003Cbr\u003E\n    “Good. T minus 1 minute now. Is the abort sequence prepared?” Val turned a handle and replied “Abort armed.” The countdown hit 45 seconds. “All valves closed; Mode 1 abort is armed.” Haydi continued the last-second checks. “Gimbal is good. Sound-suppression is on. All screens reading nominal. Gene, we’re go for launch.” T- 30. “All passengers report ready,” Phil Kerman answered from below-deck in the passenger space; the place where the crew would spend the next year in space and then who knows how many more on Duna.\u003Cbr\u003E\n    \u0022T minus 15 seconds.” Haydi looked over at Val, and smiled. “Let’s rock and roll,” She said, her finger hovering over the ignition switch.\u003Cbr\u003E\n    “Firing command is go. T- 10.”\u003Cbr\u003E\n    “9\u0022\u003Cbr\u003E\n    “8”\u003Cbr\u003E\n    “7. Ignition.” Even through the water suppression, Val could still hear the roaring of 7 engines roaring underneath her, and felt the vibrations rattling the seats.\u003Cbr\u003E\n    “6”\u003Cbr\u003E\n    “5”\u003Cbr\u003E\n    “4”\u003Cbr\u003E\n    “3. All systems go.”\u003Cbr\u003E\n    “2” The adrenaline ramped up to the max.\u003Cbr\u003E\n    “1”\u003Cbr\u003E\n    “\u003Cem\u003ELIFTOFF!\u003C/em\u003E” The bolts released and the rocket powered up into the sky as Haydi punched the throttle to max for the \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E rockets. The rocket started slowly, but then it picked up the speed; sending the vessel up.\u003Cbr\u003E\n    “\u003Cem\u003ELiftoff! Liftoff, 33 minutes past the hour! Duna has cleared the tower, and is ascending nicely up; Control reports nominal on all systems.\u003C/em\u003E” The crowds both at home and watching the launch live cheered as the TV announcer confirmed what they were seeing.\u003Cbr\u003E\n    “Beginning roll,” Haydi said, twisting the control stick slowly.\u003Cbr\u003E\n    “\u003Cem\u003ECaptain Haydi Kerman beginning the Pitch/Roll program, which will send Duna I onto it’s orbit of the planet.\u003C/em\u003E”\u003Cbr\u003E\n    The rocket shuddered a bit, and at 10 kilometers altitude exact, a loud popping noise sounded what seemed like miles below them. “Stage separation,” Haydi said, pushing in the stage button. A loud clang came from below them; followed by this hissing of 8 Separatrons blowing the spent Booster I Stage.\u003Cbr\u003E\n    “\u003Cem\u003EThe Booster Stage has been released; the rocket is now down to 2 \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E’s and 3 Liquid Fuel and Oxidizer Engines. Parachutes deployed on the boosters now.\u003C/em\u003E”\u003Cbr\u003E\n    Outside, the rocket shot through a couple of clouds; the wispy layers trailing the rocket as it surpassed Mach 2. Another pop, and the second set of \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E’s were ejected. Mach 3 now.\u003Cbr\u003E\n    \u003Cem\u003E“Duna One reports all systems good inside the capsule; the Second Booster Stage has been released now. Duna One is operating on it’s Liquid Fuel engines now.\u003C/em\u003E”\u003Cbr\u003E\n    The outboard engines popped, and Haydi flipped the stage switch again; separating the engines and tanks from the rocket. “Gene?!” Haydi shouted as she looked out of the window; showing nothing but a black sky tinged with blue underneath. Val felt herself lifting up a bit in her seat; even though the seatbelt were stiff as concrete. “We made it! Control, the is\u003Cem\u003E Duna I \u003C/em\u003Ereporting a successful launch to orbit. Cutting engines now.” Haydi shut down the engines, and Val was slammed forward against the seatbelt; rubbing her shoulders raw. “Oh wow that’s got a kick!” Haydi wheezed, peeling herself off the belt.\u003Cbr\u003E\n    “Good job, Duna. Abort to Mode 2; cycle the Auxiliary tanks. Might want to go ahead and stir the O2 while you’re at it.” Val pulled a handle, and the abort booster shot clean off; shooting straight out into space. “Monoprop update?” A voice on the radio asked. “Only Zero-point-zero-two percent used; a bit over projections but we’ll manage,” Haydi answered, checking the gauges.\u003Cbr\u003E\n    “Control, are we a go for escape?” Val asked, checking the projections. They were right on target. “\u003Cem\u003EDuna I\u003C/em\u003E, you are go for escape trajectory. Node is on your flight computers.” Val target the node which was coming up in 15 minutes. “Well that was fun,” Haydi told Val as she unstrapped her helmet from her suit. “First time?” Val asked as she got out of her seatbelt. “Always stuck down on the ground. Really fun though, I’ve got to admit.” Val floated down the steps to the habitation compartments, where everyone was still strapped in. “Everyone good here?” Val asked, looking around. Everyone nodded and smiled. There were a couple space veterans, but most of them were fairly new to the space program. As Val was checking the rovers in the cargo bay, her watch beeped. 5 minutes to Node. She ran up to the command pod, and strapped in. Haydi was checking all the switches and dials; making sure nothing important had blown up, damaged, or accidentally jolted and reset in the launch (During \u003Cem\u003EKerpollo 3\u003C/em\u003E, an altitude warning knob had been knocked back from 300m to 30; wrecking the landing gear on the craft and making the crew have to abort).\u003Cbr\u003E\n    “Back,” Val said as she strapped in. “Just in time to,” Haydi replied, before Gene came over the radio. “Tee minus 90 seconds,” He said. Val waited for the engines to fire, and then felt her helmet slam against the seat-back as they fired. Val saw her speed climb, and climb, and climb.. until they left Kerbin, and saw that pale blue dot- that tiny, blue and green marble hovering in nowhere- for the final time…\n\u003C/p\u003E\n"},{"CreatedByName":"qzgy","CreatedById":160994,"CreatedDateTime":"2017-11-07T16:26:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223213132\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510062540\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nfor the final time…\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nO_O hmmmmmmmmm i feel another story coming. Or death.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that was satisfying.\n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-11-07T18:30:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223213202\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510071978\u0022 data-ipsquote-userid=\u0022160994\u0022 data-ipsquote-username=\u0022qzgy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, qzgy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nO_O hmmmmmmmmm i feel another story coming. Or death.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that was satisfying.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell technically, you\u0027re right; there is another story coming. These 5 epilogues (Working on #5 now) are mainly trying to ease the readers into \u003Cem\u003EThe Final Stand\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd thanks! I hope I did my storyline some kind of justice. \n\u003C/p\u003E\n"},{"CreatedByName":"DualDesertEagle","CreatedById":161533,"CreatedDateTime":"2017-11-07T21:44:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223213295\u0022 data-ipsquote-contentid=\u0022162861\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510079445\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell technically, you\u0027re right; there is another story coming. These 5 epilogues (Working on #5 now) are mainly trying to ease the readers into \u003Cem\u003EThe Final Stand\u003C/em\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReally hope that my char gets to participate in that somehow.\n\u003C/p\u003E\n"},{"CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-11-08T19:51:28Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003EIV\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EOn Duna\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 1 Year, 2 Weeks, and 3 Days later\u003Cbr\u003E\nLocation: In orbit 80km above the surface of Duna; Somewhere above the Grand Canyon\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    Val slowly opened her eyes and looked out the window; seeing the red ridges and lumps below creating a beautiful patchwork of reds, slightly darker red, and light red. It wasn’t a painting, but it still looked great. Four quietly rolled up to Val’s room and said “Message from the captain,” Making Val jump a little. “Thanks for the wakeup call,” She answered; shrugging on her suit. A hologram of Haydi popped up and said “Come on Val! Orders for deorbit are going to come in any minute now! Meet me in the Command Pod on the double.” The hologram disappeared, and Four rolled out or the small room to let Val get through. As Val walked through the halls, she smiled a bit. She felt that she was so close to Jeb it seemed she could reach out and touch him. Val patted her chest pocket, where an old, tired paper crackled a it from it’s 20-plus year old life. Jeb’s letter. Val opened up the door and went into the command pod where Jernous Kerman was in the co-pilot seat. Both him and Haydi turned at the exact same time; staring at Val.\u003Cbr\u003E\n    “Morning,” Val said, letting Jernous get by and into his seat down below. “About time,” Haydi muttered. “I was thinking about leaving you down there and letting you wake up on the surface!” Val buckled in and slipped the headphones over her ears. Some were quietly chatting; Val supposed a mic was left open and the staff were chatting. Val looked out the window. Somewhere down there was Jeb. Somewhere…\u003Cbr\u003E\n    “Good morning \u003Cem\u003EDuna I\u003C/em\u003E; how’s it going up there?” Gene’s voice asked. “Pretty good, Gene. I’m just getting the final systems ready for the retro burns while Val stares off into blank space,” Haydi answered, smirking a bit in Val’s direction. “Hmm?” Val snapped back to reality, making Haydi laugh. “How’s it going back home?” Haydi asked.\u003Cbr\u003E\n    “Raining right now but I can see Kerbol poking through a bit through the clouds,” Gene answered. “Y’all ready for descent?” Haydi looked around and checked every switch. “Control, all presets and dials are set; this is \u003Cem\u003EDuna I\u003C/em\u003E, awaiting orders, over.” There was some clapping in the background as everyone got set.\u003Cbr\u003E\n    “Copy that, One; your descent node is in the computer. Fire when ready.” The radio clicked off, and Val checked the computer. 45 seconds until the burn. “After all this time..” Val muttered. “Hmm?” Haydi turned as the red ground slowly rolled past. “Oh, nothing,” Val answered, checking the fuel. “Ready?” Haydi smiled. “Ready.” She flipped the switch, and Val slowly began getting pressed into her seat. \u003Cem\u003EI’m coming, Jeb.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp\u003E\n    “Directional to Prograde,” Haydi commanded, carefully checking the altitude. “Prograde,” Val repeated; pushing the button. The Station rotated around, and finally settled. “Direction to Radial,” Haydi then said as the ground rushed up to meet them. “Radial.” Val pressed in the button and felt the craft shift; exposing the multitude of radiator panels protecting the craft on de-orbit. The craft began shaking, and flames began to appear outside the windows. Slowly, a dull, loud rumbling began intensifying. \u003Cbr\u003E\n    “Radiator temps are reporting good. Speed 1.5km/s and dropping.” The vibrations shook the entire cockpit so much Val was happy at the impossibly strong belts. The noise was at it’s peak volume; so loud that Val felt her eardrums would burst even through the almost sound-proof helmet. “Altitude is 15 kilometers and dropping at over 100 per second.” Val fought against the force of near 7 G’s and looked out the window. The red hills and rocks were blasting past as the station went almost horizontal to the ground. “10 Kilometers. Speed dropping..” The shaking slowed, and the flame slowly disappeared. The sound quieted almost immediately to a light whooshing; similar to the wind. Quickly, Val turned the craft to prograde before Haydi flipped the staging switch for the final time.\u003Cbr\u003E\n    “CHUTES DEPLOYED!!” Val felt the bite of 15 parachutes catching the air, and she smiled as the speed went from over 500 to under 30. “Control, this is \u003Cem\u003EDuna I\u003C/em\u003E. We’ve made it.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n………………………………………………………………………………………………………………\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nTime: 1400, 6 Months later\u003Cbr\u003E\nLocation: Duna I base; 15km from the Grand Canyon\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n    The vehicle touched down with a wonderful grace; it’s \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E engine throwing up red dust into the air. This was the final scouting flight to see where Jeb was. Val rushed out to the hangar, but the airlock door closed just before she could get out. Val watched through the window, and saw Haydi talking to the pilot. The pilot had his lips pursed, and looked upset and tired. Haydi and him were talking really fast; Val couldn’t read their lips. Haydi turned and said something Val couldn’t see. The pilot shook his head. Haydi looked up, and began walking back to the airlock. Haydi’s face said it all as she took the helmet off inside.\u003Cbr\u003E\n    “No.. Nonono!” Val stormed out of the hangar and ran into her room. Haydi chased after her. “Val!” Haydi shouted, keeping chase. Val slammed the door shut, but Haydi opened it up. “He’s here,” Val shouted at Haydi, who was sitting down in a chair. “We’re close! We’ve just got to-“ Haydi sighed. “Honey,” She said, putting a hand on Val’s shoulder. “The quicker you accept it, the less pain you’ll feel.” Val’s eyes pleaded with Haydi not to say more. “He’s not here.” Val’s face crumpled like paper, and she began crying; terrible, horrible painful sobs that rocked her entire body. “It’s alright, Val,” Haydi cooed; rubbing Val’s back. “It’s alright.”\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-09T00:04:05Z\u0022 title=\u002211/09/2017 12:04  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 9, 2017\u003C/time\u003E by DarkOwl57\u003C/strong\u003E\n\u003Cbr\u003Espeeling\n\u003C/span\u003E\n"}]}