{"TopicId":163898,"ForumId":39,"TopicTitle":"Eeloo is No Goddess","CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-07-30T18:04:36Z","PageNum":1,"Articles":[{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-07-30T18:04:36Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003EJebediah\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E \u003C/span\u003E\u003C/b\u003Estretched and yawned a bit more before sitting back up on the cold bed. He was bored because there were no entertaining shows to watch and freezing from the Russian weather. He flipped out his pocket calendar out his bag and checked the date again.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E1979, Day 66\u003C/span\u003E\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003EH\u003C/span\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003Ee took the pen off of the little wooden table between his and Valentina’s bed and crossed Day 66 off. It was pretty late out, and there was nothing else significant to do for a few more days. \u003Cem\u003EBesides getting Val back...\u003C/em\u003EJebediah grimaced to himself. He could see her outline in the balcony through the thin curtains. He sighed and stood up after picking up his thick blanket to walk out onto the ice-cold balcony with her. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003EH\u003C/span\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003Ee winced as the even colder air hit him in the face. The tropical weather of South America spoiled him a bit too much. It was lightly snowing, he saw the rooftops of the nearby buildings already dusted with fresh snow. A colourful cathedral was lit up in the distance, as well as a huge statue of some old mayor even further out. Valentina was born in this city, the city of Khabarovsk. She should’ve had more of a reaction, but she was in the same exact spot and position she was in twenty minutes ago, as if she froze.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E“\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EVal, you okay? Admirin’ the horizon\u003C/span\u003E\u003C/strong\u003E?” Jebediah came to her side and delicately laid a hand on her shoulder, expecting a warm reaction. Her scarf covered her chops, but he could tell she wasn’t happy. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E“\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003EChto eto\u003C/span\u003E\u003C/strong\u003E?” Valentina harshly whispered and straightened her jacket, still avoiding eye contact.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E“\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EHaha, urm,\u003C/strong\u003E\u003C/span\u003E” Jebediah nervously laughed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E“\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EC’mon, Val, you know I don’ know Munspeak, are you fine?\u003C/span\u003E\u003C/strong\u003E” He rubbed her shoulder and returned his hand, forcing a smile. Valentina looked at him and mentally digressed herself.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E“\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EI’m sorry, just thinking..,\u003C/strong\u003E\u003C/span\u003E” She turned back towards the horizon and hunched over the rail. Jebediah patted her back and brought her close to his side.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E“\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWe should talk, Val. You won’ feel better unless you talk,\u003C/strong\u003E\u003C/span\u003E” Jebediah brushed the hair out of her face as he whispered to her. Valentina looked up at his face and then back down, tracing her finger through the snow on the railing.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E“\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003EEverything’s so different, Jeb. What happened? How long was I gone for?\u003C/span\u003E\u003C/strong\u003E” She almost whimpered, her hand subtly trembling in her hair. Jebediah winced and braced himself to yet the truth out. She didn’t remember anything after her time on Eve.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E“\u003C/span\u003E\u003C/b\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EWell, let’s go inside first. I’m gonna get a cold out ‘ere. I have hot cocoa in the room fer’ us,\u003C/span\u003E\u003C/strong\u003E” He nuzzled her cheek, making her feel instantly warmer. She forgot how he could be. Valentina followed him back into the hotel room without a word.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003EJ\u003C/span\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003Eebediah poured his bottle of milk into the two cups the room had with the packages of cocoa powder he got at the nearby market. Valentina blankly stared off into nothing as she laid down, ignoring the TV and Jebediah sauntering about waiting for the hot cocoa. The microwave stopped with a pleasant ‘\u003Cem\u003EDING\u003C/em\u003E’, and he left the hot drinks on the little table to cool off. She snapped out of herself when he set the drinks down to her side. They smelled nice and homely, almost nostalgic. He sat down with that friendly smile on the edge of her bed, leaning his weight on one arm to face her.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003E\u0022\u003C/span\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EAre you sure you wanna hear what happened?\u003C/span\u003E\u003C/strong\u003E”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022color:#000000;\u0022\u003E\u0022\u003C/span\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EY-yeah..,\u003C/strong\u003E\u003C/span\u003E”\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-07-30T19:02:43Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022pj7tkwa.png\u0022 class=\u0022ipsImage\u0022 height=\u0022614\u0022 src=\u0022http://i.imgur.com/pj7tkwa.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve gotten better at drawing kerbals from studying their anatomy a tad too much...\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-07-30T22:17:16Z","Content":"\n\u003Cp\u003E\nJebediah shifted his weight so he could sit up straight. Valentina desperately looked for his face, but he faced the opposite wall. He didn’t want to see her reaction to the ‘news’ she missed. He kicked his feet for a moment while he ordered his spiel for her.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EDo you remember \u003Cem\u003Eanythin\u0027\u003C/em\u003E before 1971?\u003C/strong\u003E\u003C/span\u003E” Jebediah almost croaked. Valentina held her head and thought.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWell, it’s fuzzy, but I remember my childhood and joining the space programme,\u003C/strong\u003E\u003C/span\u003E” \n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EDo you remember the Bop VII\u003C/strong\u003E\u003C/span\u003E?”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWas that the Mun landing where-\u003C/strong\u003E\u003C/span\u003E” She sat up.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EYeah,\u003C/strong\u003E\u003C/span\u003E” Jebediah blushed and chuckled a little. He faced her again. She was tucked under the cover of the thick blanket and looked like a mermaid from the pattern on the blanket. He passed her a hot cocoa and he sipped from his own, cherishing the warm cup in his hands.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EDo you remember Eve?\u003C/strong\u003E\u003C/span\u003E” Jebediah smiled, still caught up in his cocoa. He realised how serious the question was when he saw Valentina flinch.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003EWell, I remember going there..,\u003C/span\u003E\u003C/strong\u003E” She cradled the brown cup and took another sip. \n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EI remember getting mad at the ground crew, and then they turned on the autopilot, and then it’s really fuzzy..,\u003C/strong\u003E\u003C/span\u003E” She rubbed her forehead. Jebediah scooted closer to her to calm her down.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EThe probes said it wasn’t safe to land there. You wouldn’t have believed the cloud cover! The surface wasn’t visible at all!”\u003C/strong\u003E\u003C/span\u003E Valentina started trembling. This was redundant to him.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI know, I’ve seen it for myself, don’t you \u0027member me\u003C/strong\u003E\u003C/span\u003E?” He nudged her with his elbow and smiled.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EOh, oh yeah, sorry. I’m still trying to process everything,\u003C/strong\u003E\u003C/span\u003E” She held her head again.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EThat’s about it besides the last few days,\u003C/strong\u003E\u003C/span\u003E” She shook her head and took a big gulp of her drink.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI asked what you knew about 1971 because that’s the year you left for Eve. You were s\u0027pposed to land and and come back by ‘74, but that obviously din’t happen,\u003C/strong\u003E\u003C/span\u003E” Jebediah let out a small, anxious laugh to try to lighten the mood.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003EWhat happened there?\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWell, I’ll try to sum up what happened from what I saw. You looked like you crashed from a lack of substantial parachutes, and I saw a bunch of melted debris around the greenhouse, which you were in,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EHow- how long was I in there?\u003C/strong\u003E\u003C/span\u003E” Valentina’s head throbbed.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI’d give the conservative estimate of six years..,\u003C/strong\u003E\u003C/span\u003E” He trailed off and tapped the glass cup. Valentina grimly sat in a light sense of shock. \u003Cem\u003EFeral\u003C/em\u003E? \u003Cem\u003ESix years\u003C/em\u003E? She must have been off Kerbin for two or three more.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI was surprised to see any sort of edibles in there. The frame was a bit bubbly from the heat, but other than \u0027at you were lucky to survive that long, if at the cost of yer’ sanity,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWhat happened on Kerbin while I was gone?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EA lot, but the significant events might shake you up a little more. Ya want the rest of my cocoa? I’m not thirsty anymore,\u003C/strong\u003E\u003C/span\u003E” Valentina gladly took his cup after he set her empty one on the table.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003ESo?\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EUm, so there was a huge deal about gender equality, so that was great. It happened just after you left for Eve, though, you probably never heard about it. Heh, they made a documentary where Vanessa was so happy to go outside by herself. It could melt any cold heart.\u003Cbr\u003E\n    Duna I was supposed to be a one-way trip. We only found that out when we arrived and landed and \u003Cem\u003Eeverything\u003C/em\u003E, Val! Bill was so upset. I wasn’t gon’ let his kid not see him again. We barely managed to get off the surface an’ back home, thanks to Bob being a man \u003Cem\u003Efer’ once\u003C/em\u003E. The made a big ol’ statue for us and I slammed into it when we returned,\u003C/strong\u003E\u003C/span\u003E” Jebediah made the crazy gestures as he reminisced like he always did when telling stories. Valentina laughed and wondered why Jebediah never thought of becoming an actor.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EMe an’ the boys went to Duna a few more times but I didn’t want to travel again after Duna II because I heard you supposedly died on Eve! I couldn’t deal with that,\u003C/strong\u003E\u003C/span\u003E” Jebediah exhaled heavily, kicking his feet excitedly.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EThey forced me on Duna III because none of the other pilots weren\u0027t ‘qualified’, but I think thatsa bunch of bologna. They only put me on that mission because the PR crew needed me! I was so frustrated by the time we get on home, I stole a ship so I could at least find you,\u003C/strong\u003E\u003C/span\u003E” He looked at her.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EAnd I’m glad I did,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(As someone from Missouri I think I suck at making country accents. I\u0027m making Jebediah\u0027s accent sound like someone from Georgia or Louisiana instead of Arkansas.\n\u003C/p\u003E\n\u003Cp\u003E\nComment if you like this so far, or if not tell me how I could write better. I\u0027ll continue it until I\u0027m done with this \u0022chapter\u0022 and I\u0027ll follow it up with more chapters and art if people like it.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-30T22:22:55Z\u0022 title=\u002207/30/2017 10:22  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 30, 2017\u003C/time\u003E by Atubara\u003C/strong\u003E\n\u003Cbr\u003EComments got merged, clarifying to differentiate story from tangent.\n\u003C/span\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-07-31T02:16:37Z","Content":"\n\u003Cp\u003E\nValentina giggled and playfully slapped his back.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003ESo cheesy, you know that?” What else happened?\u003C/strong\u003E\u003C/span\u003E” The tension in the air was mostly gone now, but Valentina figured she would cope with this new future with a strong stance. It wouldn\u0027t be easy.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EOl’ man Mortimer kicked the bucket, so the income was a mess while the new financial director figured stuff out fer’ the space programme. Guy named Dilvan Kerbell.\u003Cbr\u003E\n    They made a probe fer’ Moho but the press didn’t take it lightly and a lot of religious folk protested it. Geez, that was a big mess too. They didn’t find anything of interest on the surface, besides some strange lava well. Five kilometers deep, they think.\u003Cbr\u003E\n    Although, there was something really cool Tylo III found by Jool, I think it’s the coolest dang thing ever,\u003C/strong\u003E\u003C/span\u003E” Jebediah had a wide smile on his face not unlike a young kerbal eating mint for the first time.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EStop stalling, what is it?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EThe probe couldn’t get in orbit because there was a moon the size of dangol’ Kerbin! The Tylo III got flung off by Tylo, ain’t that funny?\u003Cbr\u003E\n    They confirmed the five moons around Jool, but Laythe didn’t just look like Kerbin... It actually had oceans too, Val! Vast, deep blue oceans! You shoulda seen the pictures, the islands were so clear. Vall looked like a scoop of mint ice cream and Tylo looked rugged and it was just so huge! Bop and Pol weren’t near as excitin’, but maybe that’ll be the lack of clear pictures-\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EDid Jool look as green as it does in the sky?”\u003C/strong\u003E\u003C/span\u003E Valentina laughed at Jebediah’s excitement. He was giddy and reveled in childlike joy.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EJ\u003Cstrong\u003Eo\u003C/strong\u003Eol..! Jool was so big..! It was so green and swirly and dang near grand as Jool is in legend. Most of the pictures Jool took up a good portion of the frame. It was also more massive than the guys at the labs thought, too. The Tylo III got shot straight outta there. I ran some numbers and I don’t think it’s ever comin’ back down,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWhat? Do you think it’s still going to be in solar orbit?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EN\u003Cstrong\u003Eo\u003C/strong\u003E ma\u0027am. I think Tylo and Jool slung the poor lil’ probe so hard that it’ll probably go into another star syst’m,\u003C/strong\u003E\u003C/span\u003E” Jebediah rubbed his chin.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EHaha, and maybe aliens will come down and say hello,\u003C/strong\u003E\u003C/span\u003E” Valentina joked to him.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EThat would be amazing! But maybe Laythe will have aliens. The Tylo III said the atmosphere is likely to be rich in oxygen. Oxygen can’t be there unless somethin’ was makin’ it,\u003C/strong\u003E\u003C/span\u003E” Jebediah made a great point. Valentina thought about what kinds of aliens could walk around the surface of such a world. He turned off the lights and tucked himself in after turning off the television. She was lost in her mind, dreaming about going to Laythe and swimming around to find life. \n\u003C/p\u003E\n\u003Cp\u003E\nThe stories from her childhood had to be wrong about kerbalkind being alone, right? They can’t be alone.\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-07-31T19:56:15Z","Content":"\n\u003Cp\u003E\nIntegrating Valentina back into the swing of things back at the space centre was a hassle. Occasionally she would forget where she was or what she was doing. Eve really scrambled her mindset. There were more pressing things happening at the space centre, however.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher Von Kerman sat in his office, organising blueprints and old papers. He coughed sifting through the dust that had settled, irritating his sinuses.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EIch hätte das nicht zulassen sollen!\u003C/strong\u003E\u003C/span\u003E” Wernher wheezed again and fanned away the dust with his hand. The old papers weren’t giving him any ideas. He had a deadline by the end of the year to produce blueprints for a craft that will bring kerbals to Laythe. He sat down, frustrated and tired.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EDas Leben ist kein Ponyhof, ist es?\u003C/strong\u003E\u003C/span\u003E” The old scientist rubbed his temple. At least he had hundreds of days left. Not a huge problem. Linus knocked and entered through the rickety door with a binder full of work he did the previous night. Wernher spotted the new golden tag Linus had on his lab coat. Linus settled down in the chair opposite of Wernher, moving stacks of paper out of the way to make room for his binder.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EAh, Linus, you have your Doctorate?\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E‘Bout time, believe it or not,\u003C/strong\u003E\u003C/span\u003E” Linus popped his collar. He’d been working since he was nineteen to get to his position. He had an office and global credibility like his superiors before him. Now, he was \u003Cem\u003EDr. Linus Kerman\u003C/em\u003E. \u003Cem\u003EMaster of astrophysics and rocketry, the heir to Wernher’s seat\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EWhat is this, dear Linus?\u003C/strong\u003E\u003C/span\u003E” Wernher slowly flipped the red binder around, shuffling his papers around in the process. At the ripe age of sixty, he had grown weak. The binder had plans for a massive spaceplane.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EIt’s my idea for the Laythe mission, I was hoping you could check over it and change everything necessary,\u003C/strong\u003E\u003C/span\u003E” Linus was proud of his three-munth work.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EThe spaceplane is supposed to be big enough to hold a thousand kerbals. It can land on the surface of Laythe and use the oxygen there to propel itself up and out of the atmosphere. It can mine the ground for more fuel and establish 100% failsafe contact with Kerbin except for bodies that block the signal,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EHere, the power source is solar panels, Jool is a bit far for that, ja?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EWell, I have reserves for RTGs on the interior of the spacecraft,”\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EIn every wall, that’s a little much,\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EFor the ship to sustain a thousand kerbals, I needed to have a huge power source,\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EWe can rid of the solar panels, they are a waste,\u003C/strong\u003E\u003C/span\u003E” Wernher marked out the little pipes and designs with his black marker.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EI’m supposing the thousand kerbals are for genetic diversity?\u003C/strong\u003E\u003C/span\u003E” Wernher saw the storage space where houses can be built outside of the station. He was impressed by Linus’ artistic ingenuity, making the ‘greenhouse’ wrap through the entire vessel like a nervous system.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EWell, due to the complexity of the ship, only two kerbals should go to Laythe. Then, once they’re there, they can colonise and build separate buildings, making the maximum total of two thousand kerbals. Probably more if they can make more building material from the Laythean surface,\u003C/strong\u003E\u003C/span\u003E” Linus explained and stopped Wernher from responding by pointing at the small three meter cubed space near the heart of the ship. Wernher flipped to page 45, detailing the room.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EThat’s where we’ll keep the err, constituents, for reproduction on Laythe. A cryogenic chamber for the eggs and whatnot. The original two will have to raise and train the children to be engineers, scientists, ect. Eggbornes mature much faster than lovebornes, yeah?\u003C/strong\u003E\u003C/span\u003E” Wernher was satisfied by Linus’ forethought besides a few hiccups in the fuel lines. A\u003Cem\u003E proper \u003C/em\u003Eheir, he thought. Linus left the room to let Wernher add his own touches. Wernher tapped his lip with his marker and added to the artistic beauty that was the Laythe I.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe satellites on the ship had to be black, with intricate golden embellishments. There would be 12 of them arranged into a flower, just like Laythe’s flower in the stories. A flower that would bridge the heavens to the Kerbin.\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-01T04:31:47Z","Content":"\n\u003Cp\u003E\nThe administrators came together to decide the crew for the Laythe I. They had to pick wisely; the mission had the potential to be more breathtaking and monumental to kerbal history than the Mun landing.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003ENow, the guys at R\u0026amp;D wanted two kerbs for this mission, see\u003C/span\u003E?\u003C/strong\u003E” Walt Kerman rubbed his chin stubble. The other men muttered among themselves, Linus drew inappropriate doodles on his clipboard trying to look busy.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003ELet’s make this more symbolic for the nutheads,\u003C/strong\u003E\u003C/span\u003E” Linus coughed to get the attention of his colleagues. Gus puffed another cloud from his cigarette, blowing it in Linus’ direction. Nobody wanted to ask how Linus planned to make the mission more symbolic, so he partook in a cigarette himself to indulge them. A flick of a match and the rush of synthetic chemicals in his bloodstream revived his motivation.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003ELaythe is already important in mainstream culture, and the Laythe I will be built to reflect that. Why not make the crew drive the point further? We need a man and a woman, just like Laythe and Tylo,\u003C/strong\u003E\u003C/span\u003E” Linus exhaled his own cloud. Walt nodded in agreement.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EWell, we gots two female astronauts and five men,\u003C/span\u003E\u003C/strong\u003E” Walt made a list of the roster for the meeting, anticipating he’d have to lead the decision-making.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003ECan you refresh me on what they are, like what they’re supposed to do on the job?\u003C/strong\u003E” Dilvan garnered dirty looks from around the room. The newbie financial director didn\u0027t even know the crew. Linus sneered and stirred his drink as Walt recomposed himself.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003ELinus says that there needs to be a pilot and a scientist. We gots Valentina for the pilot, we don’t have a female scientist. For the scientist we only have Bob-\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003ENobody likes Bob, come on, man!\u003C/strong\u003E” Dilvan protested Walt’s presentation.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E\u003Cem\u003EShut up\u003C/em\u003E, Dilvan!\u003C/strong\u003E\u003C/span\u003E” Linus slammed his fist on the table, quieting the room.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003EOh, sorry, I forgot your relationship wasn’t just \u003Cem\u003Eplatonic\u003C/em\u003E with Bob, was it?\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cem\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EDILVAN! I’LL-ack!\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E” Linus almost leaped over the table in rage until Gus yanked his collar back, slamming him back into his chair.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EKeep the peace, wouldya guys?\u003C/strong\u003E\u003C/span\u003E” Gus calmly puffed another cloud of smoke. Linus seethed in red hot anger, feeling his hands shaking with the desire to wrangle Dilvan’s throat. Linus was just about to contest until Gus continued as if nothing happened.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWalt makes a dang good point ‘bout this crew, can we get a consensus?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003ESo we gots Valentina Kerman and Bob Kerman, is that correct?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003EFine, yeah,\u003C/strong\u003E” Dilvan scoffed. Linus nodded in agreement. The meeting was a waste of time when there was only one solution to the criteria. He looked down at this clipboard and smirked. Nobody liked Bob alright.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-02T14:52:41Z","Content":"\n\u003Cp\u003E\nThe clock in the shoreside city rung a deep chime and with that, tens of thousands of kerbals celebrated with glee as the ball hit the ground, marking not only the start of a new year, but a new decade. Disco was dead and uh, ‘tude was a thing then.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003E1980, Day 1\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBill earned a five-year vacation to stay with his family after his services on the Duna missions. Jebediah let Valentina stay at his pad while he tended to the junkyard he ‘inherited’ from his father. Bob and Linus were planned to have an interview with the host of some night show just after midnight. Both of them arrived, but only Linus attended to the interview. Bob was… elsewhere… and not only physically.\n\u003C/p\u003E\n\u003Cp\u003E\n    He was in a shoddy hotel room, wiping away more hot tears from his red eyes. Another used tissue joined the pile that accumulated on the floor. The television’s antennae weren’t aligned, making the screen buss with white noise and static. Not that Bob cared. He was dealing with another ‘heartbreak’, maybe he’d feel dramatic enough to call it a ‘heartshatter’. Maybe that’s why I’m not good with the women, Bob thought.\n\u003C/p\u003E\n\u003Cp\u003E\n    The tropical weather made it muggy in the poorly conditioned room. He peeled the cover off of him and got up to look at himself in the backroom mirror. Maybe he had some meds in his jacket.\n\u003C/p\u003E\n\u003Cp\u003E\n    He picked up his blazer and rummaged around the pockets for any of his prescription pills. He found his new VFD display pocket calculator, caressing the side before setting it down on the counter. Technology has come so far, he thought. His hand was near the edge of the sink, leading his eyes upward. And so Bob gazed at himself in the crusty mirror. And there stood a sad, naked kerbal. He’s overweight, just enough to notice at a glance. A virgin in his mid 40s, yet he looks 50. Poorly trimmed moustache, swept hair to hide the balding spots and grey patches. Bob shuddered. That was him, alright.\n\u003C/p\u003E\n\u003Cp\u003E\n    He sighed and tried to ignore the reflection as he continued to try to find his pills. He shook the jacket, feeling more delirious in his search. \n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EC-come on! I need my- my m-m-mmeds!\u003C/strong\u003E\u003C/span\u003E” He stood in silence after yelling, finding himself shaking uncontrollably. Bob had been dealing with some harsh demons. He’d been everywhere. The Mun, Minmus, Duna. Yet he’d never had clearance to set foot on any other ground than the soil of Kerbin. It always had to be Jebediah. Bob slammed the brown blazer on the floor and smacked his head a few times in a feeble attempt to appease his migraine.\n\u003C/p\u003E\n\u003Cp\u003E\n    \u003Cem\u003EI hate ‘m, he always gets the glory, the girls, the one astronomy page in standard hist’ry books!\u003C/em\u003E Bob collapsed onto the floor in frustration and curled up in a corner. The tears starting trickling down his face again. \u003Cem\u003EWhat kind of man am I? Cryin’ over somethin’ like this? But Bill got to be happy too and make a family an’ why is everyone happy but me?!\u003C/em\u003E Bob needed to lash out at something, somebody, but that would only tarnish his reputation. He wanted to be famous. He wanted to be happy and have a wife \u003Cem\u003Eand-\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n    Bob exhaled with that shaky crying voice timbre. He wanted to stop being rejected.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EC-can I hold yer’ hand when we get out there?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EExcuse me?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI thought it would be n-nice if we- we uh,\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EWe can’t do that in public! Are you KIDDING, Bob?!\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EBut- but I t-thought you-\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EOf course not! We can’t risk the space programme losing funding over something like that!\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EC’mon love, I l-love,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EI don’t love you back. I don’t know what you thought this was,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    Bob curled up tighter and cried harder. The conversation was too fresh in his mind. He’d get over it. He’d get over it. He’d̨ g͜et o͏ver ͡i̸ţ.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(This is getting dark, but I promise you there\u0027s a happy ending, this is about as edgy as I\u0027ll get)\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-03T22:23:28Z","Content":"\n\u003Cp\u003E\nThe sun rose the next morning, as it always had, no matter what happened the day before. Bob rubbed his red, irritated eyes. He stayed up all night long. \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003E1980 won’ be a good year, will it?\u003C/strong\u003E\u003C/span\u003E” Bob cursed at the first sunrise of the decade. He stretched and pulled the thin blanket over him. He was covered in sweat and needed a shower, but he didn\u0027t feel motivated to move, let alone get up to take care of himself. The room was a mess too. Used tissues and cigarette butts littered the floor. One of the complementary glass cups were shattered after he threw it at the wall. Housekeeping wouldn\u0027t be happy at all, \u003Cem\u003Ewould they\u003C/em\u003E?\n\u003C/p\u003E\n\u003Cp\u003E\nNot that Bob cared.\n\u003C/p\u003E\n\u003Cp\u003E\nHe drank the last drop of his tapwater, his mouth feeling dry and sandy. Another cup shattered on the wall. The TV sputtered white noise in unison with the cheap electric fan on the table next to his bed. He turned over to the table and sloppily turned on the radio. More white noise.\n\u003C/p\u003E\n\u003Cp\u003E\nBill was doing much better than Bob that day. He woke up next to his wife, yawned, and wrapped his arm around her, kissing her forehead. She stirred a little before snuggling back up to him. He laughed a little at her and fluffed his pillow to get more comfortable. Bill figured his son was still asleep downstairs, tuckered out from staying up at noon to see the ball drop.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EAhnn, Vannie? We gotta get an’ make breakfast,\u003C/strong\u003E\u003C/span\u003E” He nudged her with his elbow.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EHold on, cariño,\u003C/strong\u003E\u003C/span\u003E” Vanessa groggily opened her eyes and turned over.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EVannie, mi amada bonita, we gotta get up, love,\u003C/span\u003E\u003C/strong\u003E” Bill inflected his tone to encourage his wife to get up. The Texan accent colliding with the Spanish language made that hard for her to take seriously. She stole Bill’s side of the blanket in protest and yawned again. \n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EFine I’ll git downstairs an’ eat all the banana an’ mangoes!\u003C/strong\u003E\u003C/span\u003E” He jokingly teased as he jumped out of the bed.  Vanessa groaned and turned back towards Bill.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003ENo… I want mangoes,\u003C/span\u003E\u003C/strong\u003E” She opened her heavy eyelids again and Bill had already rushed downstairs.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWhere are my glasses? Did he run off with them again?\u003C/strong\u003E\u003C/span\u003E” Vanessa blindly rummaged the bedside drawer, digging her hands through books and nightgowns. No glasses. She briefly remembered her time on Shersby’s farm and shuttered before shoving those memories back down. Bill said to\u003Cem\u003E not\u003C/em\u003E think of Shersby. Vanessa sighed in resignation, and decided to stay in the bed. The last time she tried going downstairs, the men in the black suits had to take her to the hospital. She didn’t like those men, they’d skulk around the house when Bill was gone. He said they were researchers or something.\n\u003C/p\u003E\n\u003Cp\u003E\n    Bill came back upstairs with a mango in his mouth and a big plate that had a stack of pancakes cooked with blueberries. The plate had mango slices as a side. She giggled and kissed Bill as he set down the platter on her lap.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EBreakfast in bed for my beautiful wife..,\u003C/strong\u003E\u003C/span\u003E” Bill sat down next to her and took another bite of his mango, straightening the glasses on his head with his free hand. Vanessa gasped and yanked her glasses off of his head, making him laugh back at her childlike attitude. The phone started ringing, cutting off Vanessa.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EHang on, Vannie… Yes, hello?\u003C/span\u003E\u003C/strong\u003E” Bill rolled his eyes and scoffed when he heard who was on the other side of the line.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EOh! Uh, hey, Bill. It’s Bob, just askin’ a question,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWhat do you wan’ Bob? I’mma bit busy wit’ the family an’ everythin’,\u003C/strong\u003E\u003C/span\u003E” Bill twirled his fingers through Vanessa’s long black hair. He didn’t like going out of his way to talk to Bob.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EC-can I stay at your place for a lil’ w-while?\u003C/strong\u003E\u003C/span\u003E” That stutter was so annoying to Bill.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003ERemember back in ‘67 when I invited you to my house an’ you tried to get a bit too friendly wit’ my wife?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EA-a-no… I d-d, I didn’t\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI remember, Bob. Call your brother or somethin’. Don’t talk to me outside of missions, ya hear, creep?\u003C/strong\u003E\u003C/span\u003E” Bob winced as the line shut off with a slam. Bob rubbed his tired eyes again. Jebediah wouldn’t want to talk.\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-05T03:41:53Z","Content":"\n\u003Cp\u003E\nBob felt so tired. He laid his head on the pillow. He would wake up at noon and remain in bed until tomorrow morning. That’s how he gets. A few blinks and he fell asleep. At least he wouldn’t have to worry about interacting with the half-asleep old people in the lobby downstairs. They got too excited at the prospect of free breakfast.\n\u003C/p\u003E\n\u003Cp\u003E\n    The rest of 1980 wasn’t so bad. Jebediah produced a nuclear engine in an attempt to create more efficient engines for interplanetary missions. It’s amazing what that guy can do with a bunch of spare junkyard scrap metal. The engines weren’t tested until the end of 1980 due to annoying paperwork that worried about the prospect of dealing with radioactive material. Two brave scientists died after long-term exposure. Journalists basically raided the R\u0026amp;D facility, and some edgy teenagers led to the biology lab being burned down after a peaceful protest went wrong.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EStop believing the rumours! These tragic deaths were caused by error and lack of knowledge dealing with blutonium-238. We know now how to prevent instances of death by radioactive means. Get off our case!\u003C/span\u003E\u003C/strong\u003E” Linus wasn’t the best individual to respond to the press about the topic, but anyone else would’ve diverted the topic to ice cream sandwiches. More effort was promptly poured into researching blutonium-238. \n\u003C/p\u003E\n\u003Cp\u003E\nBob was placed on a watch by the administrators due to his unstable behaviour. An altitude limit of 300 km was placed on him so he couldn’t pose a threat to important space missions. The warning didn’t sit well with him. It’s a good thing he didn’t know about the Laythe I or else he might have fallen deeper into depression. His seat was taken by Jebediah due to a rushed anonymous survey to accommodate for funding advertisement.\n\u003C/p\u003E\n\u003Cp\u003E\n    At midnight as 1980, Day 426 turned into 1981, Day 1, Linus sat and soaked in the munlight as he admired the framework of the Laythe I. The gigantic frame was complete, and the bottom rooms had been built. 1981 would be spent installing the upper floor of the station and the array of engines. Everything had to be done by Day 400. 1982 was a golden year to go to Jool. If they missed their opportunity, everyone would have to wait until \u003Cem\u003E1989\u003C/em\u003E, and nobody wanted to wait more to colonise the enigmatic moon. Linus saw his bag light up. Someone was calling, probably old Wernher. Linus lifted the brick-like device and pressed the call button.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003ELinus here, hello?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EJa, Linus?\u003C/span\u003E\u003C/strong\u003E” Wernher smacked his lips from his snack.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EIf you’re wondering where I am, I’m inspecting the vessel,\u003C/strong\u003E\u003C/span\u003E” The Russians were still unfriendly to the space programme. Linus kept his voice at a whisper, just in case they were eavesdropping.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003EAh, the party’s pretty fun here, dear Linus, you should come,\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003ENot a fan of gatherings. I’d rather make sure everything’s fine here,\u003C/strong\u003E\u003C/span\u003E” Linus caressed the steel beam beside him, smirking suggestively to himself.\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EThe vessel shall be fine, we should worry about the biology aspect. The cryo lab is the next room to be installed. Without the bio lab here, we need to make sure the pilots know how to take care of the eggbornes,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EThat’s easy, just have Valentina donate a few and watch the mayhem happen for a munth as they mature,\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003ESix days is not enough for a research trial. We need to investigate the slow growth hormones, Linus,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EYou listen to me! There is not enough time. A munth is more than enough for the eggs to hatch and mature, it’ll be fine. That way, we can start producing posters for the mission and make sure the pilots know everything. We’ll publicly announce the mission before Day 40,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EDay 40?! Are you crazy?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EI’m not crazy, I’m efficient!\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003ELinus you need to understand. This mission will cost us 23 billion dollars! If we screw this up, we will get lynched on live TV! The public will have our heads, Linus! Our green, oversized heads!!\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n        “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003ECalm down, old man. This will turn out fine enough,\u003C/strong\u003E\u003C/span\u003E” Linus hit the end call button on his cellphone. Linus rubbed his temple. He felt bitter. What actually made Laythe better than Duna to colonise? He shook his head. Laythe must be colonised.\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-05T20:26:54Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u00226ImbBuL.png\u0022 class=\u0022ipsImage\u0022 height=\u0022614\u0022 src=\u0022http://i.imgur.com/6ImbBuL.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nValentina looked dumbstruck at the picture.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n        \u0022\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWhy do I look so old? When did I get those wrinkles and grey hairs?\u003C/strong\u003E\u003C/span\u003E\u0022 She rubbed her chops and traced the wrinkles on her face. Jebediah scoffed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n        \u0022\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EAt least ya look like you cared fer\u0027 yerself. I forgot to shave and they just kept the shot without tellin\u0027 me,\u003C/strong\u003E\u003C/span\u003E\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n        \u0022\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EYou can barely see the stubble, it\u0027s fine,\u003C/strong\u003E\u003C/span\u003E\u0022 Both of the pilots were disappointed at how the picture turned out. Jebediah leaned towards the driver of the car and complained some more.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n        \u0022\u0027\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EEy when do we git an English version of this here ad? Next time we should do somethin\u0027 more tropical like playin\u0027 in the sand. People would like that, yea?\u003C/strong\u003E\u003C/span\u003E\u0022 The driver groaned and shushed Jebediah.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n        \u0022\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003ESólo espera unos minutos más. ¡Casi estámos allí!\u003C/strong\u003E\u003C/span\u003E\u0022 The man sitting shotgun spoke back to Jebediah.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n       \u0022\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EAyy, ¡Bien! No puedo esperar para llegar allí,\u003C/strong\u003E\u003C/span\u003E\u0022 Jebediah grumbled back to the guys in the front seats. Valentina scratched her jaw. She\u0027d never heard him speak Spanish, at least not like that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-08-05T20:28:35Z\u0022 title=\u002208/05/2017 08:28  PM\u0022 data-short=\u00226 yr\u0022\u003EAugust 5, 2017\u003C/time\u003E by Atubara\u003C/strong\u003E\n\u003Cbr\u003EForgot the almighty font differences.\n\u003C/span\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-06T00:27:00Z","Content":"\n\u003Cp\u003E\nThe car escorted Jebediah and Valentina to the newly-built biology lab that was built off-campus for security reasons. The driver scowled at his co-worker after Jebediah skipped on the tip.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003ESo we’re here to raise an eggborne, and that’s it?\u003C/strong\u003E\u003C/span\u003E” Valentina took in the fresh forest air. They were closer to the majestic mountains.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EYeah, although I didn’t really read the booklet. I don’t like children,\u003C/strong\u003E\u003C/span\u003E” Jebediah kicked a rock as they walked closer to the station.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003EOh, well, neither do I. I don’t have any experience with babies. This is going to be rough,\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI’ll help you out. I’m used to babies,\u003C/strong\u003E\u003C/span\u003E” Valentina was taken with fear and surprise. She stared at Jebediah with a slightly gaping mouth. He caught a glimpse of her confused stare and laughed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI grew up with Bob. He’s a perpetual baby,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EOh… o-oh,\u003C/strong\u003E\u003C/span\u003E” Valentina held her head. Jebediah held the door open for her and came face to face with Linus. Linus gently pushed Jebediah away and gestured for the two pilots to follow him. Valentina sneered at Linus.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI know you don’t like him, nobody does,\u003C/strong\u003E\u003C/span\u003E” Jebediah gave a warm smile and winked to his partner before he let her inside. She finally noticed his own wrinkles as they curled into a grin naturally. Time really flew on Eve. As the kerbals walked through the spacious corridors of the research facility, they came about a briefing room and a plethora of rooms down a hallway. Linus sat the pilots down in front of him in his office.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EFirstly, I have to address your donation contract, Ms.Valentina. You signed this way back in ‘64, and it states that it expires when you stop producing eggs. Since there’s two centres now actively using your eggs for genetic testing, I wanted to append the contract for legal purposes. Can you sign your initials here and here..,\u003C/strong\u003E\u003C/span\u003E” Jebediah got bored as Valentina and Linus discussed and focused his attention to some blueprints framed on Linus’ wall. Laythe I? That’s what they were going to pilot. A thousand bedrooms, twenty bathrooms, some sort of viewing centre? \u003Cem\u003EHow was all that going to go up in one piece?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003ENow may I have both of your attentions?\u003C/strong\u003E\u003C/span\u003E” Linus snapped in front of Jebediah’s face.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EHey, mister, I got it when you started speakin’!\u003C/strong\u003E\u003C/span\u003E” Linus grimaced at the pilot before him.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EYour task for the next six and a half days is to successfully raise a kerbal from an egg while teaching a certain skillset that it would have completed on Laythe. For Valentina, we’re shooting for a female scientist, specifically a mineralogist. For \u003Cem\u003E~you~\u003C/em\u003E, I want a male engineer that specialises in maintaining a greenhouse,\u003C/strong\u003E\u003C/span\u003E” Linus swiped booklets not unlike the ones the pilots received prior to the meeting to them.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EWe have rooms modeled for eggborne raising. You’ll stay in a little room for the next munth,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWhat happens if we don’ raise it proper?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EThen you do it again until you do it right, Mr. Jebediah! This is one of \u003Cem\u003Emany, many\u003C/em\u003E prerequisites to piloting the Laythe I,\u003C/strong\u003E\u003C/span\u003E” Linus was starting to get annoyed at him. Jebediah rubbed his forehead and exasperatedly skimmed through the booklet as some other scientists guided him to the room. The door slammed behind him. He already didn’t like how bland the white room was. Maybe it helped with the intellectual process. Valentina was in her room, also being bored from the blandness of the environment. It was like a prison cell; there was two beds, a sink, a table, and a toilet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe wall opened up with about thirty pounds of healthy food and a bowl with water. On closer inspection, Valentina curiously swished her finger around in the water and found the \u003Cem\u003Etiny, squishy, mucous-covered egg\u003C/em\u003E. She squicked and wiped her hand on her pants realising the egg was \u003Cem\u003Efreshly\u003C/em\u003E fertilised. She looked through the instructions in the booklet. Valentina carefully set up the heating pad and put the bowl on top, sprinkling in leaflets of algae for the hatchling to eat. It would be about two hours until the egg would hatch. She figured it would be a good idea to sleep and then care for the baby if she could be fully rested.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJebediah, as smart as he is, ended up eating most of the fruits that were laid out for the child. At least he didn’t tip the bowl over.\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-06T04:48:18Z","Content":"\n\u003Cp\u003E\n \u003Cimg alt=\u0022uv7z05r.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/uv7z05r.jpg\u0022\u003E\u003Cimg alt=\u0022k06MKo8.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/k06MKo8.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI doodled for a few minutes. Which one should I digitize for the story?\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-08-06T09:39:36Z","Content":"\n\u003Cp\u003E\nGo with both! The first one is kinda cute and I like Val\u0027s expression on the second.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-06T23:34:05Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/9URymbg.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/9URymbg.png\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nValentina started writing down in her journal to record the growth of the child. It had been around six or seven hours since the egg hatched. She wasn’t allowed to name the kid, being allowed to refer to her only as ‘\u003Cem\u003E0001/0052-656.34f\u003C/em\u003E’ which was as pretentious as a name could possibly be. She’d seen specimens in jars labelled similarly way back in 64’ when she had to go to the labs to lay her eggs. She figured the second number represented her and the third number represented the batch number because it went up sequentially. The first number was a mystery to her. It always changed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nShe was grateful the scientists delivered some keepsakes to her room so she wouldn’t be so bored. She was promised fresh clothes every day and just got a picture from when she was awarded a medal of bravery from the country of Mexico back from ‘67.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003E0001/0052-656.34f is doing fine. She walked, spoke her first words today, and started to learn how to use a writing utensil before she got tuckered out. She’s probably dreaming about letters. I’ll introduce her to the provided mineralogy books tomorrow,\u003C/strong\u003E\u003C/span\u003E” Valentina picked up her pen and was satisfied with her report, putting it off to the side behind the lamp. She sighed heavily, rubbing her tired eyes. She hadn’t noticed the toddler snuggled up on her lap. Valentina brushed the hair out of the young girl’s face and looked at the picture again. She used to be young too.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWhat happened?\u003C/strong\u003E\u003C/span\u003E” Valentina picked up the picture and whimpered to herself. She had pitch black hair, healthy glowing green skin, a personable smile! That woman in the picture was proud to be a servant of the military! She saw her own reflection in the glass. She didn’t have any of that anymore. She looked like a beat-up hag now. A nobody. She didn’t have any of those shiny medals anymore. Her skin was grey. This whole Laythe mission? She might be able to do one more Mun landing after she returns before retiring. Valentina was only 45, but she felt her tired bones and weakening eyes. She was supposed to be in the prime of kerbal health and welfare, but time was catching up to her quick. \u003Csub\u003E\u003Cem\u003EWhat happened?\u003C/em\u003E\u003C/sub\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHer eyes wandered as she thought to herself. They found the magenta patch on her right shoulder.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EIs this what happened?\u003C/strong\u003E\u003C/span\u003E” Valentina gripped the fabric under the patch to see it clearer. Sure enough, it was the \u003Cem\u003EVall XX mission patch\u003C/em\u003E, emblazoned with an image of Eve with bold white typeface spelling out the mission name and the year. 1971 sent bad vibes through her being. That was apparently the year she went off to the planet. And eight years later, she woke up on Kerbin. \u003Csub\u003EAnd everything was different.\u003C/sub\u003E Her eyes felt hot and burned. It wasn’t the lamp. Valentina felt tears run down her face, a feeling she hated.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWhy-Why did that happen to me? What if this is some sort of sick dream? W-why…!?\u003C/strong\u003E\u003C/span\u003E” Valentina started to sob, taking care to not rouse the child.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWhat kind of world is this? How did I get so old? How did we lose Vietnam… h-how am I alive?\u003C/strong\u003E\u003C/span\u003E” Valentina could barely see the picture of her younger self because of the tears. A pair of tiny hands started to wipe her eyes. She looked down, having completely forgot about 0001/0052-656.34f. Valentina sniffed a little, feeling her mascara smear. She was shaking, still overcome by fear and loss. The little girl in her lap looked so much like her. That was the little girl in her father’s locket. That scared 5 year old little girl whose father gave everything for, even when the Germans chased them north. Valentina felt a new wave of tears pouring from her eyes. She missed her dad. She missed being home and reading about new plane models with her dad and-\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe little girl giggled, clumsily wiping the mascara from Valentina’s face.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003EHaha, ma-mom! boo ma,\u003C/span\u003E\u003C/strong\u003E” 0001/0052-656.34f mumbled what seemed like words to Valentina. She hugged the little girl, knowing what unfair, unethical, cruel future the scientists held for her, no matter how well she performed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EI-I-I am n-not your mother, do not call me m-mom,\u003C/strong\u003E\u003C/span\u003E” Valentina tried to be firm but stuttered from her tears. It was a strict policy to not get attached to the eggborne specimens. She held 0001/0052-656.34f close and combed her soft black hair. The world wasn’t fair to eggbornes. They could only learn complex material during their first six or seven days of life, but when most of the population is welcomed into the world through placental birth, it’s hard being successful as an eggborne. Any eggborne seen in public has a job as a janitor or a fry cook. They were like adult-sized toddlers, going around day to day with a weird grin on their face, not knowing the consequences of their actions, and only able to feel happy or scared.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nValentina balanced her chin on the toddler’s head, taking in the comforting warmth. The world was cruel. 0001/0052-656.34f would be violently killed ‘in the name of science’ and it’s okay because of a contract Valentina signed. \u003Cem\u003EEggbornes are kerbals, too\u003C/em\u003E, but not in the eyes of the general public.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nActually kind of sad alert. I\u0027ll draw the hand picture if there\u0027s more demand for it. I would\u0027ve done that one first but I tried to when my system crashed, losing a good four hours of work. So I opted for Valentina\u0027s picture.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-08-07T00:39:54Z\u0022 title=\u002208/07/2017 12:39  AM\u0022 data-short=\u00226 yr\u0022\u003EAugust 7, 2017\u003C/time\u003E by Atubara\u003C/strong\u003E\n\u003Cbr\u003EA choice word was censored I think. I changed the censored word so it would make sense.\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-08-07T08:25:41Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223141910\u0022 data-ipsquote-contentid=\u0022163898\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221502062445\u0022 data-ipsquote-userid=\u0022166128\u0022 data-ipsquote-username=\u0022Atubara\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 07/08/2017 at 1:34 AM, Atubara said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThey were like adult-sized toddlers, going around day to day with a weird grin on their face, not knowing the consequences of their actions, and only able to feel happy or scared.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey certainly sound different to placental kerbals (I\u0027m not ready to call them defective but maybe inbred?) and 0001/0052-656.34f does seem to be very similar to Val. Both of which points make me think that eggbornes could be clones, i.e. parthenotes.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s making for an intriguing story either way, even if my guesswork is way off the mark.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-08-16T09:30:24Z\u0022 title=\u002208/16/2017 09:30  AM\u0022 data-short=\u00226 yr\u0022\u003EAugust 16, 2017\u003C/time\u003E by Deddly\u003C/strong\u003E\n\u003Cbr\u003ESnipped reference to deleted content\n\u003C/span\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-07T23:32:47Z","Content":"\n\u003Cp\u003E\nJebediah washed his hands as the scientists examined the fifty or so eggs in the bowl, picking out a specimen for him to raise. He dried his hands with the sink side towel and glanced at the paperwork Linus set to his side.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EYou will refer to your specimen only as…\u003C/strong\u003E\u003C/span\u003E” Linus looked at the paperwork again, holding the clipboard firmly as he made a few marks.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E0001/0052-656.12m,\u003C/strong\u003E\u003C/span\u003E” Jebediah groaned as Linus slowly punctuated every symbol.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003ECan\u0027t I call ‘m somethin’ like Jerry?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EWe have this nomenclature in place so you don\u0027t get attached to the eggborne… and well cataloging purposes too, but-\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWell, can’ I least get a more memorable name? Is the sixth egg male? Did she lay at least 52 eggs this time?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EWomen never lay more than fifty eggs at a time, and no. That egg has been \u003Cem\u003Ehandpicked just for you\u003C/em\u003E. You\u0027re keeping it whether you like it or not, Mr. Jebediah,\u003C/strong\u003E\u003C/span\u003E” Linus was really good at ticking other people off by being condescending all the time. \u003Cem\u003EThat finger waving thing he did was the worst!\u003C/em\u003E He ordered one of the other scientists to gently pour mineral water into the bowl to supplement the foetus. They walked out with the bowl that had the eggs in it, leaving Jebediah alone, at least for the next few hours.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn his boredom, he\u0027d occasionally saunter around the room, wiping dust of the furniture. He looked in the bowl to see the small egg was almost the size of his palm, a clear outline of a tiny kerbal inside. He looked at the clock. Nearly two hours passed without his knowledge.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EHuh, okay then. Uh, come on lil’ guy, you\u0027re due!\u003C/strong\u003E\u003C/span\u003E” Jebediah cupped his hands and gently lifted the egg out of the water. The egg was like melting jelly, but he resisted getting grossed out. A man from Arkansas never gets grossed out. The foetus kicked a bit, as if it were trying to hatch. Jebediah sat on his bed and quietly watched the silhouette.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI woulda’ let ya hatch in the water, but the guys in charge want to push evolution. Kerbals have been terrestrial creatures for thousands of years, and you\u0027re no exception,\u003C/strong\u003E\u003C/span\u003E” Jebediah stopped himself from going on an existential tangent. \u003Cem\u003EEngineer, not scientist\u003C/em\u003E. He looked back down at the egg, watching the silhouette squirming.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI\u0027m not supposed to help you, but you look like yer\u0027 strugglin\u0027 in there..,\u003C/strong\u003E\u003C/span\u003E” Jebediah wiggled his finger on the egg and watched the baby pop its head through the gooey membrane, spilling pink amniotic fluid over Jebediah’s hand. He flinched as the newborn started chirping, for lack of a better term, as it coughed up more jelly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EAt least that wasn\u0027t as gross as birth, Jool forbid,\u003C/strong\u003E\u003C/span\u003E” Jebediah sighed. He used his thumb to help stimulate breathing. The newborn held his finger with both arms as it cried, shivering from the cold. He turned up the thermostat and cleaned up his hand after he set the baby on the heating pad. Safe to say, his hand would be stained pink for the next few days, even after scrubbing. The baby ate the rest of its yolk and started eating the spinach to its side.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EThis is goin’ to be easier than raisin\u0027 a proper kid,\u003C/strong\u003E\u003C/span\u003E” Jebediah sounded adamant as he monitored the eggborne eating. Linus monitored Jebediah monitoring the newborn from his office, making sure everything was going according to plan. He kept his own observations of the test subjects on a digital log on his new computer, occasionally smacking the side of the box-shaped monitor when it froze. Linus’ new intern shifted uncomfortably in his seat opposite from him, organising papers.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EMr. Linus?\u003C/strong\u003E\u003C/span\u003E” The intern cleared his throat as he set the final stack to the side.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EYes, Dave?\u003C/strong\u003E\u003C/span\u003E” Linus was more occupied with making sure the data saved to the disk. For Dave, it was hard to tell when Linus was content or annoyed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003EWhy are we having them raise eggbornes when it would be safer to have lovebornes?\u003C/strong\u003E” Dave’s head felt like it was coiling back in into his body when Linus loomed over him with that malicious look.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EIt’s faster, and I don’t think Ms. Valentina would appreciate giving birth every five munths and spending eighteen years raising those kids to do their jobs,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003EWell, yes I get that and everything, but eggbornes are rather… risky… aren’t they-\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003EBEING RISKY IS MY GAME!!\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E” Linus roared, swished all the papers off of his desk, and shook his fist, resisting all urges to slug his intern square in the jaw.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EThis WHOLE MISSION is a risk, you idiot! We need to be efficient and we need to streamline every process!\u003C/strong\u003E\u003C/span\u003E” Linus’ yelling had scared Dave out of his office. He sat down with a huff and crossed his arms. He probably needed anger management class, but he digressed before continuing his work.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-08-08T02:48:30Z\u0022 title=\u002208/08/2017 02:48  AM\u0022 data-short=\u00226 yr\u0022\u003EAugust 8, 2017\u003C/time\u003E by Atubara\u003C/strong\u003E\n\u003Cbr\u003Echaracter development.gif\n\u003C/span\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-08T17:48:08Z","Content":"\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003E34 hours since hatching. 0001/0052-656.12m can easily repair broken greenhouse glass and care for plants. He knows all mathematics up to Calculus II but is weak in statistics. Bad handwriting. I’m \u003Cem\u003Enot\u003C/em\u003E looking forward to hyperpuberty..,\u003C/strong\u003E\u003C/span\u003E” Jebediah passed his report and shoved it in the black binder on the table. It wouldn’t be long until 0001/0052-656.12m would transition from boy to man in a time frame that could be measured in mere hours compared to years. Jebediah waited in anxious tension as the other kerbal arose, turning around to avoid eye contact.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EGood mornin’,... 0001/0052-656.12m.., ya feel fine?\u003C/strong\u003E\u003C/span\u003E” Jebediah asked firmly and waited. He turned around to find the other man centimeters from his face. The man stepped back and stared down Jebediah, fists clenched.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003ENow, don’ try any of that. There\u0027s nothin’ to fight over,\u003C/strong\u003E\u003C/span\u003E” Jebediah tried to make peace as the eggborne pounced on him, slamming his chair to the ground. Jebediah quickly got up and wrapped his arm around the assailant, knocking him onto the ground.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EYou guys are watchin’ aren\u0027t ya?! HELP ME OUT ‘ERE!!\u003C/strong\u003E\u003C/span\u003E” Jebediah screamed at the camera, accidentally loosening his grip on 0001/0052-656.12m’s arms. The eggborne slammed Jebediah into the wall and grabbed the chair next to the table. Jebediah winced as he caught the other man’s arms, fighting the more fit opponent. He looked into the eyes of the eggborne and he started to lose it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat wasn\u0027t any attacker. That man had Valentina’s silky hair and eyes, Jebediah’s quivered lip and sharp jaw, among the visible mixture of their genes. Jebediah gulped dryly. That was his kid. There must have been hundreds, no, thousands of kerbals that were his \u003Cem\u003Eand Valentina’s\u003C/em\u003E kids. He felt his arms turn to jelly. And tens of thousands more individuals that were Valentina’s children, their fathers being other people from the space centre, and only mere handfuls not even having fathers. \u003Cem\u003EHis stomach turned.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Csub\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EOh, k-kiddo-\u003C/strong\u003E\u003C/span\u003E\u003C/sub\u003E” 0001/0052-656.12m cut the pilot off by ripping his arms from Jebediah and violently thwacking the side of his head with the steel chair, rendering him helpless on the floor. Jebediah couldn\u0027t think or speak in that moment, feeling only the bright flash of impact and gravioli yanking him down. \u003Cem\u003EWhat kind of dad am I\u003C/em\u003E, he thought as he started to stumble up.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSome muscular guys busted in and restrained the eggborne, only making him feel angrier. One of the scientists shyly sneaked in and helped Jebediah up to bring him to the lobby with an ice pack and a mint candy. Valentina was also waiting in the lobby, free of injury.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWhy-Why you out here, Missy? I just got a redneck baptism from an angry manchild!\u003C/strong\u003E\u003C/span\u003E” Jebediah was still a little disoriented from the blow. He was really lucky not to poof out of existence.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EThey brought me out here after they heard of your ordeal. My room’s closer to here,\u003C/strong\u003E\u003C/span\u003E” Valentina chuckled at Jebediah’s ditty nature as he took a few pain relief pills. Jebediah tottered like a top in his seat, stopping to slam his cup down and blow a raspberry at Dave. He looked drunk, almost. Dave cleared his throat and straightened his bow tie.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003EDue to the high intensity stress and work you guys put in, the guys in charge are letting you two have a day off before one last day of prep! Isn\u0027t that nice!\u003C/strong\u003E” Valentina gave a sigh of relief while Jebediah uttered a battle cry as a resounding YES in response.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003ELinus gave me this money so you two could pick out a good hotel and enjoy some good cuisine tonight,\u003C/strong\u003E” Dave winked and passed the cash to Valentina.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EThanks, we\u0027ll try to us\u003C/strong\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003Ee it responsibly tonight… but we\u0027re not in a relationship if that\u0027s what you\u0027re implying,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EUh, yeah, and we totally won’ go to the casino and blow \u003C/strong\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003Eit all,\u003C/strong\u003E\u003C/span\u003E” Jebediah started feeling right again as the pills kicked in, rubbing his eyes.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-08-08T17:51:27Z\u0022 title=\u002208/08/2017 05:51  PM\u0022 data-short=\u00226 yr\u0022\u003EAugust 8, 2017\u003C/time\u003E by Atubara\u003C/strong\u003E\n\u003Cbr\u003EI sucked at formatting.\n\u003C/span\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-09T17:29:09Z","Content":"\n\u003Cp\u003E\n0001/0052-656.34f sat in her cell. She could smell the pheromones of all the nearby males walking around the facility. She didn’t know what men were, but she could smell them. She knew they were different. 0001/0052-656.34f couldn’t focus on reading her books, only wanting to press herself against the wall to get a clearer reading on those smells. The nearby women, 0001/0052-656.33f and 0001/0052-656.40f, were doing the same thing, following the curious and investigatory nature of kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n0001/0052-656.34f sat down without a word and stared at the sinkside mirror. She combed her fingers through her hair and straightened her crisp shirt collar. Linus entered the door, taking off his lab coat and setting it on the table after folding it. She inspected the man, thinking he was Valentina. But that wasn’t her, this creature had a more fleshed out face, less rounder. He had aligned pupils, his eyelids crooked down in an angry look. He had that smell. Linus took the bowl on the table that 0001/0052-656.34f spent her time in as an egg and gestured for her to come with him, outside of the room.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHe wrote down the egg sample ID number after she was done. 0001/0052-656.34f sat down next to her spawn, hugging the round, faded blue bowl it was in. Linus coaxed the bowl from her arms, making her whimper a little. Where was Valentina? A nearby woman, 0050/0052-653.21f, looked similar to Valentina, but she had scars and shiners. Where did she get those? Was Valentina her caretaker too? Why would she hurt her? Where was she?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nValentina laughed maniacally as she slyly slapped down her straight royal flush, greedily crowding all of the other’s chips.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003EOkay, you’re done. You’ve had winning hands for five games in a row, go to another table, miss,\u003C/strong\u003E” The floor man made a gesture as if he were shooing her off. Valentina smiled childishly and walked away with her eleven new black chips. She walked over to the table where Jebediah was playing roulette. She saw the swelling had gone down, leaving a big bruise on the left side of his head. He was really good at games like that. He must have had some weird luck charm hidden somewhere. Jebediah watched intentively and calmly shot the ball, watching as it bounced around and plopped into the green 0 slot. The table man sneered and begrudgingly paid Jebediah his $200. Valentina laughed to herself after she saw that he won almost $4000 just at the roulette table.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nShe nudged his shoulder, bringing him out of the zone.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWe have to get back to the room. We have a long day tomorrow,\u003C/strong\u003E\u003C/span\u003E” Valentina made Jebediah audibly whine, but her point made sense. They cashed in at over $5000 total, grinning as the crazy neon lights shot out of the casino into the rest of the huge beach hotel. It wasn’t until they reached the room that Valentina remembered about her heat cycle. Jebediah had to go all the way down to the car to get the cooler that Linus wanted them to bring. Good thing, he’d pay $3.71 a pop. That would be at least another $150 if she had a good spawn. Jebediah shook his head. The casino mood kept him greedy.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EJust more money for retirement, Jeb,\u003C/strong\u003E\u003C/span\u003E” He mumbled to himself. He had $130k in the bank and Valentina implied she had a similar figure. He wanted to talk about something that wasn’t money, but she got in ‘\u003Cem\u003Ethat mood\u003C/em\u003E’ when she needed to lay eggs. He certainly wasn’t in the mood for anything like that, especially after their ‘\u003Cem\u003Especial night\u003C/em\u003E’ in Khabarovsk. That was enough for a few more years. He walked into the room, discovering Valentina in her nightshirt and briefs, abdomen bloated.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EHi, love, is this the bowl?\u003C/strong\u003E\u003C/span\u003E” Valentina’s hormones made her act ditsy in a poor attempt to seduce him. Jebediah nodded and left her to do her business in the bathroom. They got a one-bed room to save on the bill. At least she could control herself to the point of not trying to yank his clothes off when the pheromones took over. Another head shake. He rummaged around in his black suitcase to find the thing he wanted to discuss with her. A little black box, textured like soft felt. It contained something he found in Duna’s canyons that the R\u0026amp;D guys put together for him. He opened the box. There lay a gold ring and on top, a beautifully cut, modestly sized diamond that reflected the munlight like a disco ball in the room. He quickly closed the box, worried that Valentina would see the light. He hadn’t realised it would shimmer like that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThey weren’t \u003Cem\u003Emarriage\u003C/em\u003E people. They weren’t \u003Cem\u003Ekids\u003C/em\u003E people. They weren’t\u003Cem\u003E lovey-dovey\u003C/em\u003E people. Jebediah sighed. They’ve been in a secret relationship since the 60s and nobody else knew except for Bill. Valentina walked out with her normal behaviour again, carefully packing the eggs into the cooler with the clear wrap. The munlight made her look as young as she did back then. But back then, they were in it for fun and genuine friendship. Now, there was a clear lack of libido and motivation to go out on the town. Jebediah thought it was his mind getting old and he’d get out of the phase.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIt was all Eve’s fault.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nValentina was apparently dead, and he went through lovers like bad smokers go through packs of cigarettes. Jebediah was lost in thought before Valentina quietly tucked herself under the cover, kissing him on the forehead before turning over and falling asleep. He smiled warmly, clutching his little box. He set it down back into his suitcase, making sure it was in the secret compartment. He followed suit and fell asleep not long after.\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-09T23:52:25Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/imZzAGq.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/imZzAGq.png\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nShould I try more art like this?\n\u003C/p\u003E\n"},{"CreatedByName":"cratercracker","CreatedById":171449,"CreatedDateTime":"2017-08-10T00:28:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223144487\u0022 data-ipsquote-contentid=\u0022163898\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221502322745\u0022 data-ipsquote-userid=\u0022166128\u0022 data-ipsquote-username=\u0022Atubara\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, Atubara said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/imZzAGq.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/imZzAGq.png\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nShould I try more art like this?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes!\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-10T02:57:55Z","Content":"\n\u003Cp\u003E\nSunrise flooded the room. Jebediah sighed heavily. He couldn\u0027t get much sleep from worrying about proposing. Well, mostly being upset he had to go back with 0001/0052-656.12m for the next six hours. Rubbing his head, he looked up and admired the convex piece above his bed. It detailed Jool holding the sun behind the pyramids. He found it weird the artist didn’t know the people of the west don’t worship Jool, but Jebediah disregarded it. He sat up. His head throbbed from yesterday’s excursion. At least he didn’t have a concussion. The phone starting ringing, making his head throb worse.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EFor Gilly’s sake, geez! Yeah, hello!?\u003C/strong\u003E\u003C/span\u003E” Jebediah swiped the phone, thinking it was the front desk calling for whatever reason.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EH-hey Jeb, glad I got the room number r-r-right,\u003C/strong\u003E\u003C/span\u003E” Bob put the phone between his shoulder and jaw so he could continue to digitise the papers Wernher gave him.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWow! Hey, Bob! Nice to talk to ya again!\u003C/strong\u003E\u003C/span\u003E” Jebediah was excited to hear from his brother again. They hadn’t talked since Duna III. Bob was less enthused, not being a big fan of him.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EI’m callin’ ‘cause Linus wants you guys back at the new bio lab,\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWe were headin’ there in a hour or so. B’fore we go, can I catch up on ya? It’s been years!\u003C/strong\u003E\u003C/span\u003E” Jebediah was that guy who got loud when he got excited. Valentina took an effort to pop an eye open before realising he was just doing his thing. Bob groaned and lost his place in the catalogue.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EJeb, I really d-don’t wan’ to, I’m b- I’m busy,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWell come on now, we probably won’t git a chance to talk until 2000 rolls around! Just tell me how you’ve been, bud,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EYou know. Depressed and worthless unlike you. I’m hangin’ up,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003ENo, oh no Bob! Come on now,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EYou listen here, right proper, Jeb! Y-you know exactly how I’m doin’! Y-y-you know I hate myself and you know w-why I do,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EBob, for \u003Cem\u003Ecryin’\u003C/em\u003E out loud,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cem\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EYOU WOULD WANT TO SEE ME CRY WOULDN’TCHA?!\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EBob, please calm down, you’re fine. Our mom wouldn’ wan’ this,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003E\u003Cem\u003EOur\u003C/em\u003E mom? You mean \u003Cem\u003EMY\u003C/em\u003E mom! M-Mary died because yer’ just so \u003Cem\u003EFULL OF YERSELF!\u003C/em\u003E\u003C/strong\u003E\u003C/span\u003E” Bob hit a nerve deep in Jebediah. He was a man that was hard to annoy, let alone tick off.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EBob, don’ talk about my mother like that,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EWhy not?! It’s not like ya even got to know her!\u003C/strong\u003E\u003C/span\u003E” Jebediah slammed the phone down. He knew he would be in a bad mood for the rest of the day. Valentina wrapped her arm around him, and kissed his cheek.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWhat’s wrong, Jeb? Who was that?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003ENobody, uh..,\u003C/strong\u003E\u003C/span\u003E” He looked away and rubbed his eyes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EI’ll get my stuff packed, okay?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EYeah, good plan,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nValentina and Jebediah had a ride back to the biology lab to finish raising their eggbornes for the final test.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n0001/0052-656.12m was as friendly as he was previously, watering a plant as Jebediah nervously crept in.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n0001/0052-656.34f was more affectionate and friendly than she was previously, drawing pictures of little kerbs in her notebook. Valentina smiled and and patted her back.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLinus was unsatisfied with all of his work. Everything was finally stored on the computers, but no correlation with genetic inheritance of the B4D-A55 gene was found. He laid his head on the desk. Not even with two thousand children between the only two individuals known to have the gene was there ever an instance of inheritance-except one, but that kerb died years ago, before they perfected DNA viewing. 0001/0052-1.47m was killed after testing the new Hammer engine. \u003Cem\u003EWhat a waste!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLinus investigated more in the network, seeing what the preserved papers from the previous bio lab had to say about Valentina\u0027s legacy.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003E\u003Ci\u003EValentina Kerman (b. 1936, day 34; Khabarovsk, Russia)\u003C/i\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003E\u003Cem\u003EActive years donating eggs: 1965-1971, 1980-1981\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003E\u003Cem\u003E656 batches, 32707 children total.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Courier New\u0027, Courier, monospace;\u0022\u003E\u003Ci\u003ENo reported loveborne or plantborne specimens.\u003C/i\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLinus sighed in defeat. He would have a lot of digging to do.\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-10T21:55:00Z","Content":"\n\u003Cp\u003E\nLinus had to give up on finding what causes the B4D-A55 gene to appear from thin air. At least until ARPANET had been expanded upon. He had to find a \u003Cem\u003Enew\u003C/em\u003E purpose for all the breeding going on in the biology centre. He looked to the bookcase to his side. They detailed all sorts of topics about the kerbal body, related species, and reproduction, among others. Out of curiosity, he picked up the book titled ‘\u003Cem\u003EKerb and his Grasslands\u003C/em\u003E’, skipping through the pages, occasionally stopping to look at the colourful pictures.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EThere’s kerbals, plants, bugs, fungi, and protozoa for the most part. There’s nothing else of interest in that book,\u003C/strong\u003E\u003C/span\u003E” Another of Linus’ interns, Johnwise, enlightened him on the contents of the book.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EI’m not a biologist, don’t think I’m stupid for asking, but are there really no other animals besides kerbs?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cstrong\u003EN-no, sir. The closest things genetically are lily pads at 17% similarity,\u003C/strong\u003E” Johnwise got nervous around his superiors because his last job as a clerk got him fired after making a valid point. Linus scratched his head and stuffed the book back into the bookcase, getting up to perform the final evaluation on his Laythe I simulation eggbornes.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EHm, gather Dave and Corpont. We’re meeting in the red room,\u003C/strong\u003E\u003C/span\u003E” Linus waved his hand and sent Johnwise on his way. Valentina was already in the red room, making sure 0001/0052-656.34f looked nice for the test. She was dressed in an off-white blouse and a black skirt, her hair tied up in the ponytail that was the uniform standard for years. She looked anxiously around the room. Valentina gave her a faux smile to help her feel safe.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EYou’re fine, what’s wrong?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003ESomething feels really bad, like something bad is going to happen. What’s going to happen after the test?\u003C/strong\u003E\u003C/span\u003E” Valentina flinched and hesitated.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:Verdana, Geneva, sans-serif;\u0022\u003E\u003Cstrong\u003EWell, umm..? You’ll get to have a job out in the real world! Isn’t that cool?\u003C/strong\u003E\u003C/span\u003E” 0001/0052-656.34f brushed off her grimace for Valentina and kicked her own feet a little bit, still anxious. The red room made everyone in it feel off, perhaps it was just the shade of blood red the designers chose. \u003Cem\u003ESpooky stuff\u003C/em\u003E. 0001/0052-656.12m walked in the room with Jebediah, warily inspecting the others. The pilot pointed the younger man’s attention to the papers set out for him on the long metal table. For both eggbornes there was a language skills and math placement exam that would measure their ability to critically think. Jebediah groaned just looking at the front page of the packet. He didn’t have to do anything like that to be an astronaut. Was that the new initiation? Lame.\u003Cbr\u003E\n    0001/0052-656.12m stabilised a greenhouse module where the glass shattered, courtesy of Corpont and his hammer. 0001/0052-656.34f had to rummage around in a sandbox to find evidence of life. It would’ve been more exciting if everyone weren’t so on edge. The red room was a large, spacious room with strange lighting. Here, scientists would perform various daring acts to experiment. Everything from testing jetpacks, bulletproof vests, and filling in bubbles to determine whether or not they could read. The eggbornes did that last part well enough. \n\u003C/p\u003E\n\u003Cp\u003E\n0001/0052-656.34f smiled as Linus gave her a passing letter on her performance, directing her to the nearby room. The other eggborne did just as fine. Free to roam until next munth’s physical training, the two pilots drove out to the casino to push their luck again. Valentina threw her dice, stuffing the knowledge of the fate of the two eggbornes deep down.\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EIt’s happened thousands of times, they were just used to train us, they were just tools, they were just…\u003C/strong\u003E\u003C/span\u003E” Valentina trailed off and blankly stared off as her dice landed. She was thinking aloud again.\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cs\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003E...\u003Cem\u003Ekids\u003C/em\u003E..,\u003C/strong\u003E\u003C/span\u003E\u003C/s\u003E” She grimaced as the floor man took five of her red chips.\n\u003C/p\u003E\n\u003Cp\u003E\nLinus was relaxing in his office, waiting for his ride to the space centre so he could play with the brand new computers there. Those were the computers he’d have installed on the Laythe I. He heard they were \u003Cem\u003Epowerful\u003C/em\u003E, \u003Cu\u003E\u003Cem\u003E15 megabyte storage capacity!\u003C/em\u003E\u003C/u\u003E Future technology couldn’t possibly get more advanced!\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EAh, that sounds more beautiful than Eve herself..!\u003C/strong\u003E\u003C/span\u003E” Linus lit a cigarette and puffed a ring of smoke. He was a rocket scientist with a doctoral degree in electrical engineering. He loved taking things apart, seeing how they worked, and making his own creation. He was good at that, a \u003Cem\u003Eprodigy\u003C/em\u003E among idiots. The little idol of Eve he kept in his office started to make a pleasant ringing noise, signalling his ride was there to pick him up. Linus would be back in his normal environment, drawing plans for future missions and playing Kick the Bob with the other guys.\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003ESurprised he hasn’t thrown himself into a farm yet. He’d be a worthless bull,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EHe skipped thinning and started balding because even his hair wants to get away from him,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\nLinus started rehearsing his best lines.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-08-11T08:02:37Z","Content":"\n\u003Cp\u003E\nUh-oh. I got a bad feeling about this...\n\u003C/p\u003E\n\u003Cp\u003E\nAlso (*facepalm*) I  just figured out what the B4D A55 gene was all about. Well played. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-11T19:01:44Z","Content":"\n\u003Cp\u003E\nIt’s been days since Bob yelled at his brother, feeling bitter before the incident, feeling just as bitter afterward. He was in the hotel bed of room 907, having not showered for days out of grief. Nobody from work called. Nobody really \u003Cem\u003Ecared\u003C/em\u003E. He closed his eyes, tightly clutching his cover.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd there he was. \u003Cem\u003E24 again\u003C/em\u003E. Jebediah was driving him and Bill back to the space centre campus from the bar, poorly singing the new hit, ‘\u003Cem\u003EQuarter to Three\u003C/em\u003E’ the long ride home. Before he knew it, Bob was riding on a pillar of flame with Jebediah and Bill, all of them completely drunk with Jebediah as the pilot. Bob was screaming and vomiting while Bill passed out from the G-forces of rocketing into orbit. Who knew a college dropout, an intern, and an ex-farmer would go down in history as monumental figures?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd there he was.\u003Cem\u003E 17 again\u003C/em\u003E. A happy, relatively healthy young man riding shotgun, hanging halfway out of the window of the car, waving his university admittance form like a crazy man. The driver was also a teenager; Jebediah was swerving and doing sick donuts in celebration of his own admittance form. They were going to go to the Joolian University of Science and become revered scientists.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd there he was. \u003Cem\u003E8 again\u003C/em\u003E. Crying in his mother’s blouse as Jebediah was getting punished by their dad for no real reason. Bob opened his eyes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EH-hated that ol’ man,\u003C/strong\u003E\u003C/span\u003E” Bob pouted quietly. His father was probably the reason why Bob was psychologically damaged.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003ESCIENCE IS AGAINST THE TEACHIN’S OF JOOL YOU HERETIC!\u003C/strong\u003E\u003C/span\u003E” Bob winced as the gruff voice echoed in his head. He felt hot tears drip down his cheeks.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI HATE YOU!\u003C/strong\u003E\u003C/span\u003E” Bob violently threw his radio at the wall and watched the black and grey shards scatter, needing to lash out at something. He laid there shaking, thinking of the grave consequences if that were another kerbal. He cuddled his pillow, seeking comfort in the warmth that it radiated, crying into the soft fabric. The phone started ringing. Bob sloppily turned over and slapped his hand around until it hit the phone. Any sort of social interaction would do him better than a pillow.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EBob, get your-\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003EButt to work?\u003C/span\u003E\u003C/strong\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EWell, that’s a nicer word, but yeah. We’re stationing an international space station in low Kerbin orbit, and I’d figure I’d offer you a seat there before the other applicants could be screened,\u003C/strong\u003E\u003C/span\u003E” Linus got back to the space centre just after Bob left, so he didn’t have a chance to ask him then. Bob scoffed at the proposal.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI know y-you’re just callin’ to m-make sure I’m still alive. I’m n-n-not a fan of people p-pokin’ fun at me,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EListen here, this is a good opportunity for you. This is a chance to repeal your little sui-hmm, your watch. There’s two seats on that station and there’s a representative from Russia, just like one of your previous crushes, hmm?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EI w-wasn’ int’res- interested in Val,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EAre you taking the seat or not, Bob?\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EI-I-I... y-yeah,\u003C/strong\u003E\u003C/span\u003E”\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAnd there he was\u003C/em\u003E. 44 and in charge of one of two seats on the ISS. The other belonging to Rosbella Kermolov, a scientist with fair knowledge in all areas of science like Bob. He was still depressed, yes, but he was going to try to get out of his rut with the opportunity. Why did Linus let him do this? Linus didn’t like business with Bob, did he? Rosbella gained Bob’s attention and called him over to analyse new scans of the upper atmosphere. She was a\u003Cem\u003E bombshell!\u003C/em\u003E She had short silky black hair and knew how to use makeup properly. She must have been in her mid thirties, if not younger.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cstrong\u003EJust a sec, Ros,\u003C/strong\u003E\u003C/span\u003E” Bob looked one last time out of the cupola module and fixed his shoddy combover. He had to be at his best around her so the Cold War could calm down back on the ground.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLinus took off his headphones and walked out of mission control. He had greater implications for placing Bob on the ISS, much to the public chagrin of his peers. A dark, wide smile grew on his face as he exited. Minmus joined Jool in the sky that night, two bright dots in conjunction with each other. Linus held out his hand at arm’s length.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n“\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EAbout… two degrees of separation I’d say tonight…\u003C/strong\u003E\u003C/span\u003E” He nodded. Laythe I was such an anticipated launch by the public. Pictures of Jebediah and Valentina making a sandcastle with a painting of Jool in the background littered the streets. Sitcoms were riding off of the popularity and restaurants fished the seas clean of algae, promoting it as quality seafood. Nothing could go wrong, or the space programme would get so much bad reputation it would need to close down for good; For nothing to go wrong, Bob had to be out of the picture. Linus grinned again. He started singing.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EA god among kerb\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EPredator among prey\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont face=\u0022Trebuchet MS, Helvetica, sans-serif\u0022\u003E\u003Cb\u003EEating caviar and leather\u003C/b\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont face=\u0022Trebuchet MS, Helvetica, sans-serif\u0022\u003E\u003Cb\u003EIf that very god just may\u003C/b\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003E\u003Cstrong\u003EEeloo is no goddess\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EAnd Eve\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EWill show her prowess\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Trebuchet MS\u0027, Helvetica, sans-serif;\u0022\u003EEeloo is no goddess\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont face=\u0022Trebuchet MS, Helvetica, sans-serif\u0022\u003E\u003Cb\u003EAnd he\u0027ll\u003C/b\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont face=\u0022Trebuchet MS, Helvetica, sans-serif\u0022\u003E\u003Cb\u003EMake ya run and run and run,\u003C/b\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont face=\u0022Trebuchet MS, Helvetica, sans-serif\u0022\u003E\u003Cb\u003EUntil Eve\u003C/b\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont face=\u0022Trebuchet MS, Helvetica, sans-serif\u0022\u003E\u003Cb\u003EShows her prowess\u003C/b\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont face=\u0022Trebuchet MS, Helvetica, sans-serif\u0022\u003ELinus whistled the rest of the jazzy 40s band tune on his way to bed.\u003C/font\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-08-11T22:20:37Z","Content":"\n\u003Cp\u003E\n\u0026gt;be you\u003Cbr\u003E\n\u0026gt;construction worker for the most ambitious project in kerbal history\u003Cbr\u003E\n\u0026gt;heck_yeah.TYPE\u003Cbr\u003E\n\u0026gt;you’re one of hundreds of workers working on the Laythe I\u003Cbr\u003E\n\u0026gt;putting in four hours a day\u003Cbr\u003E\n\u0026gt;every day\u003Cbr\u003E\n\u0026gt;dat paycheck tho\u003Cbr\u003E\n\u0026gt;at least 20k in the bank by the end of the year\u003Cbr\u003E\n\u0026gt;you have Kirk, Obsted, Merlock, and Eddous working crazy hours as well\u003Cbr\u003E\n\u0026gt;Fredby died after getting his shirt caught in a gear system\u003Cbr\u003E\n\u0026gt;RIP_in_pieces.midi\u003Cbr\u003E\n\u0026gt;Jebvis was testing the massive air intakes\u003Cbr\u003E\n\u0026gt;gets sucked in\u003Cbr\u003E\n\u0026gt;\u003Cem\u003EHAHA WOW\u003C/em\u003E\u003Cbr\u003E\n\u0026gt;at least a dozen kerbs have died so far\u003Cbr\u003E\n\u0026gt;be me\u003Cbr\u003E\n\u0026gt;laughing at Naphe doing an impersonation of Linus\u003Cbr\u003E\n\u0026gt;she has the resting face he has down perfectly\u003Cbr\u003E\n\u0026gt;not looking as I hit my hammer on the pipe\u003Cbr\u003E\n\u0026gt;uh_oh.tmp\u003Cbr\u003E\n\u0026gt;hit the pipe a little too hard\u003Cbr\u003E\n\u0026gt;gets sprayed with scalding carbon dioxide gas\u003Cbr\u003E\n\u0026gt;AaAaAaAAaAaAAa.mp3\n\u003C/p\u003E\n\u003Cp\u003E\nGus groaned as he got the progress report for the minth. Thirteen losses so far since the build crew starting constructing the vessel. As head engineer, he had to make sure the work environment was safe as possible. That was his promise after almost losing his life in a cockpit fire. He was getting too old for the kind of work that had him out in the field. Just like everyone from the original crew, Gus was going to get replaced within the next decade, probably sooner due to the wave of those newfangled computers. He sighed in resignation.\u003Cbr\u003E\n    Stacking his papers, he looked up to see Wernher entering his office, a folder most likely filled with complaints from the ground crew in hand. He was on a permanent tenure to the facility. Poor old man would be reduced to stacking papers like everyone else until he died.\n\u003C/p\u003E\n\u003Cp\u003E\n    “\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003E\u003Cstrong\u003EDear Gus, here’st the the lovely words of your employees. They have colourful language,\u003C/strong\u003E\u003C/span\u003E” Wernher smiled and gently put the folder down. His hands were slightly shaky, probably a product of old age. Gus tried his best to smile back accordingly; The old rocket scientist was still sarcastic but he was showing the signs of a senile individual. Wernher was turning into a sweet old man instead of staying the vibrant and flamboyant bachelor he used to be. As if his grey hair and slow movement didn’t show that already. Gus took the folder and started to address all the complains one by one. It would be a \u003Cem\u003Elong\u003C/em\u003E night.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0026gt;be me\u003Cbr\u003E\n\u0026gt;Rodas Reyansh Rajakerpal II from India\u003Cbr\u003E\n\u0026gt;don’t say anything about how my name is allerative\u003Cbr\u003E\n\u0026gt;I know\u003Cbr\u003E\n\u0026gt;everyone is celebrating some Mexican holiday\u003Cbr\u003E\n\u0026gt;not a fan of parties\u003Cbr\u003E\n\u0026gt;whatever, it gets me out of work\u003Cbr\u003E\n\u0026gt;Jaalla hands me a chocolate skull\u003Cbr\u003E\n\u0026gt;feels_good_man.jpeg\u003Cbr\u003E\n\u0026gt;soft yellow flowers are placed on small altars with pictures of the deceased workers.\u003Cbr\u003E\n\u0026gt;María, Jebvis’ wife, is wearing this huge red dress and her face is exquisitely painted like a skull.\u003Cbr\u003E\n\u0026gt;She’s handing out loafs of homemade bread and cookies\u003Cbr\u003E\n\u0026gt;Other women are doing choreographed dances.\u003Cbr\u003E\n\u0026gt;there’s a brass band playing some lively songs\u003Cbr\u003E\n\u0026gt;Mexico_is_pretty_cool.mov\n\u003C/p\u003E\n\u003Cp\u003E\n\u0026gt;be me\u003Cbr\u003E\n\u0026gt;Italian painter Giovanni Kermanicci\u003Cbr\u003E\n\u0026gt;Italy’s most talented painter and sculptor \u003Cbr\u003E\n\u0026gt;get commission from space agency\u003Cbr\u003E\n\u0026gt;a handwritten letter from Wernher himself!\u003Cbr\u003E\n\u0026gt;he wants me to paint scenes from mythology onto some sort of metal thing?\u003Cbr\u003E\n\u0026gt;look over\u003Cbr\u003E\n\u0026gt;OH\u003Cbr\u003E\n\u0026gt;there’s men unpacking huge teardrop-shaped machines and countless gallons of special paint, all different colours of the rainbow.\u003Cbr\u003E\n\u0026gt;there’s a deadline, I need to call some friends.\u003Cbr\u003E\n\u0026gt;gather a team of sixty specialised artists like myself.\u003Cbr\u003E\n\u0026gt;many of them have revitalised thousand-year-old portraits\u003Cbr\u003E\n\u0026gt;I have grouped them up so each teardrop gets one theme, five painters per teardrop.\u003Cbr\u003E\n\u0026gt;Wernher also wants certain images drawn with the scenes. He attached images of things I had to learn from math courses years ago.\u003Cbr\u003E\n\u0026gt;right_triangles.gag me with a spoon\u003Cbr\u003E\n\u0026gt;the artwork of everyone is beautiful\u003Cbr\u003E\n\u0026gt;different styles coming together with the intricacies of science and art coming together\u003Cbr\u003E\n\u0026gt;You done well, Gio.\n\u003C/p\u003E\n"}]}