{"TopicId":168315,"ForumId":39,"TopicTitle":"Tales of the Groundbound: Chapter 11, By The Pale Münlight","CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2017-12-08T14:39:26Z","PageNum":1,"Articles":[{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2017-12-08T14:39:26Z","Content":"\n\u003Cp\u003E\nChapter 11\n\u003C/p\u003E\n\u003Cp\u003E\nDirec walked into one of the design offices. The Münlight turned the grasses and shrubs visible on Direc’s Prairie silver and grey. The desk on one side of the room was covered in roughly a half dozen different paper models of lander designs. Under the models were dozens of designs and sketches.\n\u003C/p\u003E\n\u003Cp\u003E\nHe walked around the drafting desk on the other side of the room. Aldald was focused on the sheet of paper secured to it. The drafting machine slid swiftly over the paper. The parts already drawn didn’t match any of the models on the desk. The drafting machine knocked a set of french curves off the drafting desk. Direc caught it before it hit the floor.\n\u003C/p\u003E\n\u003Cp\u003E\nAldald looked up as Direc placed the curves back on the drafting desk. Aldald took off his glasses and rubbed the bridge of his nose.\n\u003C/p\u003E\n\u003Cp\u003E\n“Thank-you sir,” he said. He leaned back in his chair and stretched.\n\u003C/p\u003E\n\u003Cp\u003E\n“Design number seven?” Direc said.\n\u003C/p\u003E\n\u003Cp\u003E\n“Twelve.” Aldald gestured to the desk. “Those are just the ones that made to modeling.”\n\u003C/p\u003E\n\u003Cp\u003E\n“What removed them consideration?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Aerodynamics mostly. On re-entry too much sticking out of the shadow of the heat shield, or too much drag on launch. It isn’t too much of problem on launch. But on re-entry the parts outside the shadow will have a greater likelihood of burning off; cascade failure of the craft is likely to follow.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Yes. I can understand how most pilots will find parts of their craft falling off a little bit worrisome.”\n\u003C/p\u003E\n\u003Cp\u003E\nAldald snorted. “Usually followed by the rest of their craft falling off of them.”\n\u003C/p\u003E\n\u003Cp\u003E\n“You weren’t able to adapt the Scimon-L for a kerbaled lander?”\n\u003C/p\u003E\n\u003Cp\u003E\nAldald shook his head. “I started there. But, once I added in the capsule and related support, it went into a mass spiral.\u0022 He rolled his shoulders. \u0022For all practical approaches it\u0027s a linear programming problem. It’s made more interesting by the competing constraints of the heat shield shadow and surface stability.” He shrugged. “I’ve probably got the best I’m going to get. Launchers will have a ninety-five percent plus mass and the aero-section in the morning. Fab will have the design in the afternoon.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Good, good.” Direc moved to leave.\n\u003C/p\u003E\n\u003Cp\u003E\n“You know,” Aldald said. “If I could wrap this in some kind of shell it would be easier. At least for launching it.”\n\u003C/p\u003E\n\u003Cp\u003E\n“I have no doubt. The folks at Parts Design are working on something. But, it won’t be ready for a while.”\n\u003C/p\u003E\n\u003Cp\u003E\nAldald shrugged and smirked. “Well if it was easy it wouldn’t be called rocket science. And they wouldn’t need us would they?”\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-11T12:17:24Z\u0022 title=\u002212/11/2017 12:17  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 11, 2017\u003C/time\u003E by steuben\u003C/strong\u003E\n\u003Cbr\u003Eforgot series title\n\u003C/span\u003E\n"},{"CreatedByName":"Alpha 360","CreatedById":166007,"CreatedDateTime":"2017-12-10T05:37:21Z","Content":"\n\u003Cp\u003E\nI assume that you are publishing each chapter separately.....The problem is that I do not want to go digging through all the old forum posts to find chapter 10,9,8,7,6 ecta. But I am pretty interested in your writing style and would like to see more. Hint - Please compile all your chapters and post them together in a single post. That way you will get alot more attention, and therefore more likes. Here\u0027s one now to see it gets done.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-12-10T18:14:59Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/165283-tales-of-the-groundbound-preface-and-table/\u0022 rel=\u0022\u0022\u003EHere \u003C/a\u003Eyou go \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/166007-alpha-360/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022166007\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/166007-alpha-360/\u0022 rel=\u0022\u0022\u003E@Alpha 360\u003C/a\u003E\n\u003C/p\u003E\n"}]}