{"TopicId":19002,"ForumId":39,"TopicTitle":"[Writing - Video - Pictures] PHADE - Phantom Debris Initiative, chapter 3: Lies","CreatedByName":"ZootinZack","CreatedById":38280,"CreatedDateTime":"2012-09-10T20:08:19Z","PageNum":1,"Articles":[{"CreatedByName":"ZootinZack","CreatedById":38280,"CreatedDateTime":"2012-09-10T20:08:19Z","Content":"\n\u003Cp\u003EChapter 3, where Jeb, Bill and Tomson get a closer look at the anomaly. Feedback welcomed as always.\u003C/p\u003E\u003Cp\u003E=========================\u003C/p\u003E\u003Cp\u003ESUMMARY OF CHAPTERS 1 \u0026amp; 2\u003C/p\u003E\u003Cp\u003E=========================\u003C/p\u003E\u003Cp\u003EStrange readings from the Mun have revealed debris floating beneath the surface of the satellite. A capsule of three Kerbonauts were sent to investigate, but their mission was cut short by mysterious malfunctions and apparent mental breakdown of the crew. After Jebediah Kerman, from Kerbin, took the rocket down in a catastrophic landing, two of the Kerbonauts, obviously mentally unstable, disappeared on the surface of the Mun, leaving Tomson Kerman alone. (\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/17281-Writing-Pictures-PHADE-The-Phantom-Debris-Initiative\u0022 rel=\u0022external nofollow\u0022\u003ERead Chapter 1 here\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003ESent on a rescue mission, Jeb and Bill Kerman managed to land near the crash site, only to see Tomson vanish as well beneath the surface of the Mun. After a heroic, successful rescue, they are ready to go on, when Bill discovered a photograph in the crashed capsule, showing a mysterious and seemingly unnatural structure. Tomson, agitated, vehemently refuses to leave the Mun, claiming they \u0022have to be there\u0022. (\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/17990-Writing-PHADE-chapter-2-First-Kerman-in-the-Mun\u0022 rel=\u0022external nofollow\u0022\u003ERead Chapter 2 here\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003E====\u003C/p\u003E\u003Cp\u003ELIES\u003C/p\u003E\u003Cp\u003E====\u003C/p\u003E\u003Cp\u003EJeb, Bill and Tomson stood still, silent, for what seemed like a long time.\u003C/p\u003E\u003Cp\u003EBill leaned slowly towards Jeb and whispered:\u003C/p\u003E\u003Cp\u003E\u0022So... Should we head home?\u0022\u003C/p\u003E\u003Cp\u003E\u0022You heard the man, Jeb shrugged. \u0027We have to be here.\u0027\u0022\u003C/p\u003E\u003Cp\u003E\u0022But...\u0022\u003C/p\u003E\u003Cp\u003E\u0022COME! ON! Aren\u0027t you at least a little curious? We have plenty of fuel to make it to whatever the hell that is, and be back on Kerbin on time to catch \u0027Who Wants To Be A Kerllionnaire\u0027.\u0022\u003C/p\u003E\u003Cp\u003E\u0022It has nothing to do with why we\u0027re here,\u0022 Bill objected.\u003C/p\u003E\u003Cp\u003E\u0022For all we know, this thing has EVERYTHING to do with the reason we\u0027re here. It\u0027s not very far from the former Poseidon crash site. Not very far from where we landed five years ago. Not very far from where the phantom debris anomaly happened.\u0022\u003C/p\u003E\u003Cp\u003EHe pointed at Tomson, who was vacantly staring at the hatch, murmuring seemingly random numbers.\u003C/p\u003E\u003Cp\u003E\u0022Plus Tomson here is a few crayons short of a full box, if you know what I mean. He\u0027s not ready to return. Neither am I. And, admit it, neither are you.\u0022\u003C/p\u003E\u003Cp\u003EHad they ever been ready to return to Kerbin? Being here, Bill felt as if he had never left. He remembered his first step out of the Poseidon hatch, back on Kerbin, five years ago. Remembered the heavy feel of his footsteps, the panic that almost overwhelmed him when he reluctantly removed his helmet. His prolonged disinterest in his family, his work, his long daydreams about being back up there. It had felt like the most pivotal part of his life was behind him, the moment Poseidon had lifted off the munar surface. He knew the three of them had dealt with it differently - Jeb with chasing highs and girls, Bob by immersing himself into a task that was way beneath him. Bill had just vanished. Disappeared. What was the point of even existing beyond this? He had walked on the Mun!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/blJSN.jpg\u0022 alt=\u0022blJSN.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere do you go from there?\u003C/p\u003E\u003Cp\u003EThe answer was right here: you go back. As insane as Jeb could be, he understood that they couldn\u0027t live with themselves with the knowledge that a few engine nudges away, maybe, just maybe, laid an answer to all their questions.\u003C/p\u003E\u003Cp\u003EBill got on the radio.\u003C/p\u003E\u003Cp\u003E\u0022Bob? You there man?\u0022\u003C/p\u003E\u003Cp\u003EA few seconds passed.\u003C/p\u003E\u003Cp\u003E\u0022Yep Bill. Congratulations. Champagne is popping all over the place here. Press conference in the morning, you guys are heroes already!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah listen... We\u0027ve come across something... Unexpected. Take a look.\u0022\u003C/p\u003E\u003Cp\u003EBill downlinked the photograph and waited a few seconds.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/NTFwJ.png\u0022 alt=\u0022NTFwJ.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022What the Kerb is that?\u0022 Bob finally interjected.\u003C/p\u003E\u003Cp\u003E\u0022We don\u0027t know... But we\u0027d like to find out.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Why wasn\u0027t it in the original photos sent by the Tomson crew? This thing looks HUGE! You think it has to do with the PDs?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Your guess is as good as mine.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Give me this mic, Bob.\u0022\u003C/p\u003E\u003Cp\u003EThe voice coming from Control was deep, authoritative, not unlike the growl of a pitbull. This could only mean one thing, and it wasn\u0027t good.\u003C/p\u003E\u003Cp\u003E\u0022Jebediah, Tomson, Bill? This is Space Center director J. Edgar Kerman. I hereby relieve you of your investigation in the Phantom Debris Initiative and order you to come back to Kerbin as soon as you can make the proper preparations. You guys have done good work. It\u0027s time to see you home.\u0022\u003C/p\u003E\u003Cp\u003E\u0022But we can\u0027t come back!\u0022 Tomson cried.\u003C/p\u003E\u003Cp\u003E\u0022Come back, the director replied. This is a direct order.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Sir, if I may, Bill interrupted, we have plenty of fuel to make the trip and Jebediah here is the best rocket pilot in the universe. This is a rather unique opportunity to advance PHADE to the next level, and...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Retrieving Tomson was already quite the exploit, Bill, the director cut. And we appreciate that. This is probably just a lens flare, a small geographical anomaly that\u0027s been magnified out of proportion. Nothing for which I would risk the lives of my best Kerbonauts.\u0022\u003C/p\u003E\u003Cp\u003E\u0022But if I may...\u0022\u003C/p\u003E\u003Cp\u003E\u0022You may not. This is not a democracy. I repeat, this is a direct order from your director. See you soon boys, stay safe. Bob, make sure that they have proper trajectory information to get back to Kerbin.\u0022\u003C/p\u003E\u003Cp\u003EBill turned off the radio and glanced at Jebediah. His face was flushed with anger and determination.\u003C/p\u003E\u003Cp\u003EHe turned the radio back on.\u003C/p\u003E\u003Cp\u003E\u0022Bob, you there? What the Kerb...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah I\u0027m here, Bob said, his voice quivering. I\u0027m sorry, he... Surprised me. He must have been here already, uh, celebrating.\u0022\u003C/p\u003E\u003Cp\u003EEveryone knew J. Edgar Kerman didn\u0027t get where he was by \u0022celebrating\u0022. Wherever and whenever he was, his work was always his top priority. Jeb was right: something was going on, but Bill hesitated as to what exactly that was. Did the director have data they didn\u0027t know about on the \u0022small geographical anomaly\u0022? Or did he, as he pretended, have only safety in mind? Bill doubted it. This was the Kerbal who had sent multiple Kerbonauts away in old rackety rockets on numerous occasions, sometimes on trivial pursuits. Besides, safety wasn\u0027t really a \u0022Kerbal thing\u0022.\u003C/p\u003E\u003Cp\u003E\u0022Listen guys, Bob said, I have to run. I\u0027ll get you your flight plan in an hour. Make sure to be ready if you don\u0027t want to miss the window. The nights are long up there.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Uuuuh okay... Bill responded, puzzled, as he turned the radio off again and swivelled to face Jeb. Well that was weird.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Bob is not exactly \u0027like\u0027 us, Bill. He was plainly terrorized. He\u0027s just doing his job.\u0022\u003C/p\u003E\u003Cp\u003EThe subtext being they shouldn\u0027t count on him - or anyone in Control, for that matter - for anything. They were clearly on their own. Jeb started checking the various flight instruments.\u003C/p\u003E\u003Cp\u003E\u0022Tomson, a hand over here?\u0022\u003C/p\u003E\u003Cp\u003E\u0022A what?\u0022\u003C/p\u003E\u003Cp\u003E\u0022So... Uh yeah. How are you holding up?\u0022\u003C/p\u003E\u003Cp\u003E\u0022We have to go there.\u0022\u003C/p\u003E\u003Cp\u003E\u0022We\u0027ve established that, yeah. On numerous occasions, actually. That wasn\u0027t my question.\u0022\u003C/p\u003E\u003Cp\u003E\u0022A hundred twenty one eight thirty one point thirty nine thousand forty... The light...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Uuuuh okay. Fine. Sorry I asked.\u0022\u003C/p\u003E\u003Cp\u003EHe took his hand to his left temple, looked at Bill and made a gesture like he was unscrewing something from his head. Bill shrugged. His heart felt like a hole.\u003C/p\u003E\u003Cp\u003EJeb tapped the fuel gauge and made a note on the computer.\u003C/p\u003E\u003Cp\u003E\u0022I know what you\u0027re thinking, that we should get out of here, he started. Be good little boys. But what is the director going to do? He can\u0027t exactly hop in a rocket and fire us. It will have to wait until we come back, and with any luck, we\u0027ll come back with something. You know what\u0027s gonna happen if we leave now.\u0022\u003C/p\u003E\u003Cp\u003EBill knew. They were going back to the soul-crushing reality, facing the terrible truth that, at some point, they had been sitting a few kilometers away from the greatest mystery they had encountered in their lives. Bill sensed that it would be too much. That he would snap.\u003C/p\u003E\u003Cp\u003EThe next two hours were spent quietly making preparations for what was very probably their last flight as Kerbonauts. Careful fuel calculations were crucial if they were to actually go back home. EVA suits had to be checked and rechecked. Emergency landing protocols were vital.\u003C/p\u003E\u003Cp\u003EThe radio light came on. Bill shot Jebediah a look, and flicked a switch.\u003C/p\u003E\u003Cp\u003E\u0022Guys?\u0022\u003C/p\u003E\u003Cp\u003EIt was Bob.\u003C/p\u003E\u003Cp\u003E\u0022We\u0027re there Bob.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I had to switch frequencies, I\u0027m in the old control room. I have at least half an hour before the director suspects something. Listen to this. On the night of the first PHADE mission, Tomson sent 257 pictures that were RECEIVED in Control. Someone deleted number 213 almost immediately. That\u0027s the photo you re-sent.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I knew it!\u0022 Jebediah shot between his teeth.\u003C/p\u003E\u003Cp\u003E\u0022You haven\u0027t heard anything yet. I snooped around old mission logs for clues, looking for stuff we could have missed, and stumbled upon the first low-orbital Mun mission... This video was filed under obscure references, it\u0027s quite lucky I found it. But I did. Uplinking it now.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/c1yz8LTYPyQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022And guess who was the Kerbonaut in that one-Kerbal capsule.\u0022\u003C/p\u003E\u003Cp\u003E\u0022J. Edgar Kerman, Bill and Jebediah said in unison.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You\u0027re damn right it was. First Kerbal around the Mun. The Agency has known about this thing for at least twenty years. Painstalkingly erased every single piece of evidence they came across. There\u0027s more. There\u0027s a lot more. Twelve years ago, records exist of early efforts to land on the Mun: Project Odysseus. We\u0027re not talking theory either: a team was assembled, studies were made. Officially they never went for undisclosed reasons, but records didn\u0027t match, hear this. Of the three Kerbonauts on the team, only one is still on record, and I couldn\u0027t find a single piece of evidence of the very existence of the two other, after the supposed cancellation of the mission. Says here they retired after Odysseus got scratched, but I couldn\u0027t find financial records of their retiring packages. Not to mention spending mysteriously skyrocketed during this time period. There\u0027s at least 5000 liters of fuel, amongst other things, that simply disappeared. \u0027Clerical error\u0027. I think Project Odysseus went to the Mun, and I think they didn\u0027t like what they found. Care to know who is the Kerbonaut who\u0027s still on record, or are we past the guessing games?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Our dear director, I presume?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Exactly, Bob answered in a hushed voice. Soon after that he became Agency director. I don\u0027t have anything else. I\u0027ll go back to Control now and update you with your \u0027flight plan\u0027. Over.\u0022\u003C/p\u003E\u003Cp\u003EBill strapped himself in his seat.\u003C/p\u003E\u003Cp\u003E\u0022Let\u0027s go sight-seeing.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Spoken like a true Kerbal, Jeb replied with a laugh. Tomson you ready?\u0022\u003C/p\u003E\u003Cp\u003E\u0022I am,\u0022 Tomson answered, curiously lucid for the first time.\u003C/p\u003E\u003Cp\u003E\u0022Alright. Here goes nothing!\u0022\u003C/p\u003E\u003Cp\u003EAfter disabling the automated update system that was downlinking their position to the Control Room, Jeb got the rocket off the ground the only way he knew how: full throttle. He shifted the trajectory ever so slightly and, a few seconds later, cut the engines with confidence. Bill marvelled at Jeb\u0027s assurance: never a split second of hesitation, he\u0027d go exactly for the right button, would turn a knob exactly the right amount - and that had always been, too. Back in training, Bill remembered a younger, quieter Jebediah, repeatiedly correcting the default orbits they made apprentice Kerbonauts learn. \u0022Inefficient,\u0022 he used to say practically all the time. Jebediah had long been the unofficial pick for the future direction of the Kerbal Space Program. Everything changed when he came back from the Mun. He was always as brilliant - even moreso, as a matter of fact - but to say he had problems with authority (both receiving and administering it) was an understatement. He could get on board any rocket and make it dance through the air, but he wouldn\u0027t have been able to muster the organization skills to get another Kerbal to unscrew a light bulb.\u003C/p\u003E\u003Cp\u003EThe rocket soared through the Mun\u0027s lack of atmosphere. Soon, they could see the strange formation in the distance.\u003C/p\u003E\u003Cp\u003E\u0022Holy Kerbol, Jeb said. I couldn\u0027t believe it until I saw it.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/LUgwa.png\u0022 alt=\u0022LUgwa.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003ESeeing as they were almost eight kilometers up, the structure seemed immense, made of a light grey material that clashed with the dull sand of the surface.\u003C/p\u003E\u003Cp\u003E\u0022We\u0027re here. We\u0027re here,\u0022 chanted Tomson, trying to see through the porthole.\u003C/p\u003E\u003Cp\u003EAlmost simultaneously, the rocket jolted violently to the side.\u003C/p\u003E\u003Cp\u003E\u0022What the...\u0022 Bill started, before another, more powerful tremors threw him up in the air, only to be caught by his safety belt.\u003C/p\u003E\u003Cp\u003E\u0022Don\u0027t worry, got it,\u0022 Jeb said, although his voice was thinner that usual.\u003C/p\u003E\u003Cp\u003E\u0022Activate the ASAS!\u0022 Jeb shouted - the first time Bill had heard him say that in ten years. He executed the command promptly, but the Stability Augmentation System - also renamed Sickness Avoidance Solution by the Kerbonauts themselves - did nothing to quell the increasing shaking.\u003C/p\u003E\u003Cp\u003E\u0022Can you hear the walls? Bill shouted. I don\u0027t think we\u0027re supposed to HEAR the walls.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Chill out. Chill out.\u0022\u003C/p\u003E\u003Cp\u003EFrom all around them, the joints were shrieking as if some force was trying to tear the ship apart.\u003C/p\u003E\u003Cp\u003EOn the bright side, Tomson, glued to the porthole, had never been more ectstatic, repeating \u0022We\u0027re here\u0022 at the top of his lungs.\u003C/p\u003E\u003Cp\u003EJeb turned the rocket around in a swift motion and increased the amount of retro-burn, working hard to keep the rocket in a semblance of trajectory. His half-smile made him seem all-knowing whereas Bill, on the other hand, was ready to treat his spacesuit to a diversified array of bodily fluids. The deafening roar of the rockets, the excited shouts of Tomson, the high-pitched shrieks of the metal plates, produced a nightmarish cacophony that paralyzed his thoughts. The only sane thing to do was to watch Jeb\u0027s quick hands try to steady the ship: calm, his eyes slimmed down to a tight slit, as if he was conducting an orchestra. He was whistling. Bill couldn\u0027t hear it over all the racket, but he could swear the bastard was whistling.\u003C/p\u003E\u003Cp\u003EAnd then it happened. The rocket shimmered with a loud clunk, and red lights flashed on the control board. As Bill shot a look through the porthole he saw something grey and metallic flash by.\u003C/p\u003E\u003Cp\u003E\u0022Was that a...\u0022 he started.\u003C/p\u003E\u003Cp\u003E\u0022Just a landing leg,\u0022 Jeb shrugged, shouting in his microphone. \u0022We\u0027re still five out of six. We\u0027re good.\u0022\u003C/p\u003E\u003Cp\u003EBill checked the altimeter. We are far from good, he thought.\u003C/p\u003E\u003Cp\u003EAnd just as they went below the 4000 meters bar, it all got quiet. Jeb sat back, slowly pulling on the engine throttle with his right foot. He let out a laugh as the remaining legs touched the Munar surface ever so gently.\u003C/p\u003E\u003Cp\u003E\u0022Well, that was close, man,\u0022 he said.\u003C/p\u003E\u003Cp\u003E\u0022You don\u0027t have anything more historical to say?\u0022\u003C/p\u003E\u003Cp\u003EThey looked through the window.\u003C/p\u003E\u003Cp\u003E\u0022Here\u0027s for history,\u0022 Jeb whispered.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/nFDhX.png\u0022 alt=\u0022nFDhX.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Wow. Have you ever even heard of something like this?\u0022 Bill said in a hushed voice.\u003C/p\u003E\u003Cp\u003EThe structure was awe-inspiring, defying the very perception of their incredulous eyes. One of its bases only looked almost four times as big as their rocket. It was towering over them even though it was still much in the distance.\u003C/p\u003E\u003Cp\u003EThe radio beeped. Jeb flicked a switch.\u003C/p\u003E\u003Cp\u003E\u0022What\u0027s up Control, he said, trying to control his voice. It seems we uh, didn\u0027t receive any further instructions from you, we\u0027re sitting still. No sign of Phantom Debris anywhere. Our A.U.S. is also malfunctioning, but all systems are ready to go otherwise. Want to update our flight plan?\u0022\u003C/p\u003E\u003Cp\u003E\u0022We were getting worried over here, Bob said. Glad you\u0027re okay.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh we\u0027re okay, Jeb said with a smile. We\u0027re okay alright.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Nice to hear it. Uplinking your flight plan back to Kerbin. As for the Automated Update System, have you tried...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yup, turned it off and back on again. It looks fried.\u0022\u003C/p\u003E\u003Cp\u003E\u0022OK. We\u0027re going to radio it for the adjustments then.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I don\u0027t need \u0027adjustments\u0027, Bob, we\u0027ll be fine and back soon. I\u0027m going to go for a walk... You should do the same.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Uh... Bob hesitated, then lit up. Yeah. I\u0027ll go for a walk.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Talk to you later. Over.\u0022\u003C/p\u003E\u003Cp\u003EAs he turned around to Bill, he just had time to see Tomson hurriedly opening the hatch.\u003C/p\u003E\u003Cp\u003E\u0022We\u0027re... Jeb started. Hey man, don\u0027t do that!\u0022\u003C/p\u003E\u003Cp\u003ETomson shot him a look.\u003C/p\u003E\u003Cp\u003E\u0022We have to go! We have to be there!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Sure, sure, we\u0027ll go have a look but...\u0022\u003C/p\u003E\u003Cp\u003ETomson stepped out. Bill soon followed.\u003C/p\u003E\u003Cp\u003E\u0022Sweet Kerbol help me,\u0022 Jeb sighed as he jumped after him.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/qocq5.png\u0022 alt=\u0022qocq5.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Tomson! he shouted in his microphone. Stop and think for a second, what\u0027s so urgent!\u0022\u003C/p\u003E\u003Cp\u003E\u0022The world, the world is urgent, Tomson rambled. A hundred twenty one eight thirty one point thirty nine thousand forty... Find it, find it here. We have to be here, we have to be here because... You\u0027re the only one who can stop it.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Stop what?\u0022\u003C/p\u003E\u003Cp\u003ETomson didn\u0027t reply. He fired up his EVA and shot to the Arch. Jeb screamed, but it was too late.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/6oKVA.png\u0022 alt=\u00226oKVA.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Bill... Bill, you saw that?\u0022\u003C/p\u003E\u003Cp\u003EBill couldn\u0027t speak. He was fixing the point, under the arch, where Tomson had simply disappeared.\u003C/p\u003E\u003Cp\u003E\u0022He... He poofed,\u0022 Bill stuttered, after what seemed like an eternity of silence, a silence more deafening than any sound he knew. He thought the verb ridiculous, half expecting Jeb to burst out laughing, but his companion was mute.\u003C/p\u003E\u003Cp\u003EJeb took a step and started to approach the arch, when the beeping of the radio stopped him in his tracks. he turned it on.\u003C/p\u003E\u003Cp\u003E\u0022Bob?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Guys, you want to stay AWAY from that thing.\u0022\u003C/p\u003E\u003Cp\u003EJeb and Bill shot a look at each other. It was a little late for that, Bill thought.\u003C/p\u003E\u003Cp\u003EBob continued:\u003C/p\u003E\u003Cp\u003E\u0022I know what happened to Project Odysseus.\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-11T02:13:46Z\u0022 title=\u002209/11/2012 02:13  AM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 11, 2012\u003C/time\u003E by ZootinZack\u003C/strong\u003E\n\u003Cbr\u003Egrammar\n\u003C/span\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-09-10T23:18:52Z","Content":"\n\u003Cp\u003EThis is amazing. The suspense is killing me!\u003C/p\u003E\n"},{"CreatedByName":"ZootinZack","CreatedById":38280,"CreatedDateTime":"2012-09-11T18:54:59Z","Content":"\n\u003Cp\u003EThanks man, glad you liked it !\u003C/p\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2012-09-12T20:27:47Z","Content":"\n\u003Cp\u003EI saw the poof coming so hard as soon as Bob started showing them the real significance of the Mun Arch. A portal to another universe, perhaps, as some have suggested?\u003C/p\u003E\u003Cp\u003EGetting quite excited, I must say! And I think you satisfy my earlier suggestion about character development quite well in this update. I will be interested to see what kind of mindsets Bill and Jeb take by the end of this story.\u003C/p\u003E\n"},{"CreatedByName":"ZootinZack","CreatedById":38280,"CreatedDateTime":"2012-09-13T23:23:43Z","Content":"\n\u003Cp\u003EGlad you appreciate it!\u003C/p\u003E\u003Cp\u003EAs for the Mun Arch, I can tell you that it\u0027s definitely not a portal to another universe.\u003C/p\u003E\n"},{"CreatedByName":"Grand Lander","CreatedById":31521,"CreatedDateTime":"2012-09-18T06:47:25Z","Content":"\n\u003Cp\u003EVery Very awsome man!\u003C/p\u003E\n"}]}