{"TopicId":190269,"ForumId":39,"TopicTitle":"Project Shatter Point","CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2019-12-09T13:38:34Z","PageNum":3,"Articles":[{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2020-01-11T22:44:53Z","Content":"\n\u003Cp\u003E\nSorry for the somewhat late update, ive just bee stupidly busy IRL (although i get good money and enjoy what i do, my job takes way too many effin hours out of my life, and i had no real time to actually update my craft until now). \n\u003C/p\u003E\n\u003Cp\u003E\nIve also thought how to best add my universe to yours, and the only way i can see that happening is to attribute all my ships to Replitech (RT) which is purely a company that sells vessels. \n\u003C/p\u003E\n\u003Cp\u003E\nAKS in my universe has nothing on kerbin besides a few minor allies (none of which have any capability to launch ships or do squat military wise), and they are currently based on Duna and Dres, so if your factions ever actually make it to either of those 2 planets then i see it possible to have AKS be an actual faction that can be added and not go against lore, otherwise the only way AKS can be added and not mess up my universe\u0027s lore is as a random encounter in space.  Their ships are available through RT as sold to anyone who has money so you can just say they were sold to either of your 2 major factions (albeit they are rare and expensive since the only way for RT to obtain AKS tech is by repairing old hulls in space).\n\u003C/p\u003E\n\u003Cp\u003E\nBCorp has kerbin presense but doesnt own any surface infrastructure (there is none after a massive war wiped it all out before BCorp even existed), and like everyone else who remains kerbin bound, does everything in underground facilities, shipping their vessels through tunnels to the 3 space launch points available (\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, desert, and the north one).  If you want, you can include BCorp as an actual kerbin faction, but they would not have any surface presense, their facilities are virtually indestructible as they are deep undergroud and seismic weapons dont exist in universe (so no destroying their HQ), and they would primarily be added to story as ally of your less technologically advanced faction (dont remember which 1 that is) since they are currently severely limited in what they can deploy after AKS wiped out virtually all their research, scientists, ect at the end of the last major conflict (second battle of minmus), and its very unlikely to change any time soon in universe.  BCorp as of this moment possesses almost entirely space forces, a few tanks (all of my vehicles need a major overhaul as most are stock and stock wont stand a chance vs BDA so i wont even bother posting these), and some supply/utility vessels.  Their current goal is to restart their Mun mining operation after loosing it to AKS counterattack.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo make it official, here is BCorp\u0027s faction info:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBreakthrough Corporation (BCorp):\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EInfo:\u003C/strong\u003E Began shortly after the utter annihilation of most of kerbin, and like everyone else that survived the nuclear wasteland, built and expanded their infrastructure underground.  They focused initially on technology development, trying to find a way to expand civilization beyond Kerbin.  Created the AI that formed AKS by accident when trying to make unmanned weapons smarter, and ever since have been at war with AKS and its allies.  Currently won 2nd battle of minmus, but lost virtually all advanced technology.  They have some remains of their old Mun mining colony, and are working to rebuild this after it was destroyed in order to obtain the resources to enable the manufacturing facilities on the station orbiting Mun to create warships.  Also occupy the old AKS station around Minmus that was abandoned instead of destroyed.  Like all the other Kerbin based factions, are severely limited in ability to understand/manufacture most advanced tech after AKS wiped out the entire science community, RnD, and flattened most of the Mun colony (this means no RTGs, reaction wheels, rapier, high \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E engines, ions, most plane parts, jets, ect).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMotto: \u003C/strong\u003E\u0022Inventing breakthroughs to go beyond the stars\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECreator:  \u003C/strong\u003EHigh council of BCorp (essentially a group of Kerbals, no 1 founder), current highest ranking admiral: Bob Kerman\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBeliefs:\u003C/strong\u003E Their future lies in rebuilding their Mun colonies, and continuing expansion to other planets/starsystems.  Also that creating AKS was a mistake and that they need to wipe the AI behind it out in order to keep organic life as dominant in the Kerbol system and not give AI free reign.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDeals:\u003C/strong\u003E Buys lost technology based weapons from RT to help fight AKS, buys launch stages from Kerbin\u0027s government to launch their ships, has limited ties to black market mostly to obtain whatever advanced old tech scavengers manage to extract from older wrecked ships that litter higher orbits around Kerbin.  Sells most of their vessels to anyone who has the money to buy and doesnt have any connections to AKS.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFunds:\u003C/strong\u003E Low, 2nd battle of Minmus bankrupt BCorp almost completely, most of their money goes towards obtaining what little lost technology they can get their hands on.  They do not require funds to manufacture their own vessels in BCorp factories, and only need to pay those that own launch points like the kerbin gov to deploy their craft into orbit (and do buy launch stages from KG to use for their ships).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECraft in service currently: \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSpace: \n\u003C/p\u003E\n\u003Cp\u003E\nFF-1 Broadsword:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qgXicRq.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/qgXicRq.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA staple of BCorp\u0027s fleet, the Broadsword is basically a armored brick with weapons strapped on as afterthought.  It was originally created to try and give BCorp a survivable ship that wasnt immediately blown to bits by advanced torpedoes, and it did just that.  Quickly became the number 1 hated vessel of anyone hostile to BCorp with many cases of the best ships completely depleting their ammo and still not fully removing a Broadsword from the battlefield, and due to its low cost and ease of manufacture, when 1 was destroyed, 2 more would take its place a week later.  It changed alot from initial versions, but the current model fixed the ship\u0027s massive ammunition problem (older series were armed with a single SRM-6M which was inferior to a bomber offensively), at the cost of having less anti-ship weapons.  Armed with 2 SRM-1M and 4 SRM-4L (very good against fighters with lots and lots of light missiles, only 2 medium ones that will damage capitals).  Like most BCorp ships, its a bit high on parts, you might want to swap the SRM-4Ls with SRM-1Ms as the light SRMs are basically useless against capital ships and eat alot of parts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/p3axub0xcrvixm8/BC%20FF-1%20Broadsword%20mk4.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/p3axub0xcrvixm8/BC FF-1 Broadsword mk4.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFF-2 Longsword:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lIvBMxh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/lIvBMxh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UsCyStB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/UsCyStB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe last remaining ship that BCorp has in stock based on lost technology (they cant manufacture any new ones, but they have like 10ish of them in warehouses from earlier manufacture), the longsword offers good range and firepower that gives it a chance in a 1v1 against AKS warships.  Armor is paper thin against G series torpedoes, but can survive a few SRM volleys before the ship is split in half.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/nl4pk3p9xdnu1by/BC%20FF-2%20Longsword%20mk3.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/nl4pk3p9xdnu1by/BC FF-2 Longsword mk3.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBC-1 Warhammer:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224lw3q0D.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/4lw3q0D.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227HOrG4I.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/7HOrG4I.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe 1st and only battlecruiser made by BCorp, the warhammer was an attempt at matching the Dimension series of AKS warships that were deployed to devastating effect throughout the 2nd battle of Minmus.  While the project utterly failed at creating an equal, it managed to build a ship entirely out of new tech which could be manufactured by anyone on Kerbin and was able to survive anything but a very unlucky shot from AKS G series torpedoes.  The 1st prototype was finished and immediately blown to bits by AKS (it did claim a Nebula as its 1st kill but they got swarmed), but engineers didnt give up hope, made modifications, and the 2nd prototype supported by 2 broadswords, a longsword and a squadron of fighters managed to defeat a AKS strike group around Kerbin composed of 3 vulture squadrons, 1 nova, 1 starlight, and even a pirate controlled Vanguard class battlecruiser with just the loss of the longsword (considering how much stronger AKS ships are and that they had 3 times the number of fighters thats actually very impressive).  The ability to carry starfighters was never taken advantage of in combat, so they may be removed to save parts and or improve armor/firepower.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/umxzk15xo532cco/BC%20BC-1%20Warhammer%20mk2.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/umxzk15xo532cco/BC BC-1 Warhammer mk2.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBC Micro-C starfighter weapons refit\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022o389vej.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/o389vej.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBased on macey dean\u0027s super old mosquito from like around the time i got into KSP, ive kept these things around and constantly been updating them for nostalgia and the fact that they really make solid fighters with regards to everything but armor (super agile, small enough to stack 8 of them in a carrier with ease, nose mounted guns are very accurate).  They were originally sold in lore by Allied Shipyards (bought out by RT a long time ago), and are used by every single faction in my universe to some degree except for AKS ) they used to be 2nd line, but were phased out and replaced by the even cheaper and unmanned Berserker series).  The current updated refit model featured high powered monoprop thrusters for \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E that exceeds any other fighter, and after arming with a single SRM-4L, it has enough firepower to engage any starfighter, enough ammo to allow the occasional bad aim, and they are light so that \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E doesnt suffer much.  They can fit the Warhammer class no problem but are normally deployed from 100% pure starfighter carriers which have the range and fuel to resupply them properly.  Not very popular among pilots due to lack of protection (pretty much anything that direct hits the pod is lethal and not just disabling), but respected by even the best pilots due to the sheer agility and speed (not to mention its not exactly easy to hit a fighter so bloody small).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/w85arkdmgfvhfdv/BC%20Micro-C%20Refit%20Launcher.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/w85arkdmgfvhfdv/BC Micro-C Refit Launcher.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBC Pidgeon:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225kH2luJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/5kH2luJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kzKLjOY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/kzKLjOY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA converted orbital tug which had most of its fuel replaced with armor/weapons.  The craft is not very common due to a continuous demand for the tugs the pidgeon is based on (BCorp sells those to civilians), but its well liked due to the heavy armor plating thats uncommon on starfighters and solid weapons package (up to 4 SRM-4L, usually carries just SRM-2Ls though to not eat what little \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E there is).  Considered superior to both the vulture and berserker series and can even engage a tri-fighter although the latter\u0027s medium SRMs are capable of 1-shotting the Pidgeon making it risky to try (very few pilots in universe are dumb enough to solo a tri in any starfighter). \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/pyrhg9t9c17kzun/BC%20FI-Pidgeon%20Launcher.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/pyrhg9t9c17kzun/BC FI-Pidgeon Launcher.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAir: \n\u003C/p\u003E\n\u003Cp\u003E\nFS-Medusa:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HYrrsqY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/HYrrsqY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBCorp\u0027s last \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E designed before the great loss of technology, the Medusa is designed to deploy from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, take down a starfighter in orbit, and return to the ground without loosing any components except the missiles.  Only a single squadron of these things remains in universe, and they are kept locked up in a top secret warehouse underground for emergency use in the event that AKS ever returns to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E with any sort of forces (since noone can realistically engage a \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E in atmo due to speed, its immune to fire until rendezvous).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/xyeqpg3dh6qpjva/BC%20FS-1%20Medusa.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/xyeqpg3dh6qpjva/BC FS-1 Medusa.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEvery other \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E technology wise was lost after the 2nd battle of minmus concluded, as were jet engines, propellers, and other things of that nature so no planes are normally available.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLand:  Small quantity of heavy tanks, supported by defensive emplacements on Mun, scattered vehicles left on Minmus (all of these are outdated and dont work with BDA so ill need time to make new ones and or update old to work).\n\u003C/p\u003E\n\u003Cp\u003E\nSea:  None\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAlliances: \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMain focuses:\u003C/strong\u003E  Space vessels/travel, annihilating AKS, recolonizing Mun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ELesser focuses: \u003C/strong\u003EColonizing Minmus,\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESummary: \u003C/strong\u003EBCorp is primarily in space, no surface infrastructure on kerbin, relatively weak after last battle, wants to kill AKS ad its allies, relatively low tech as advanced stuff was lost to them, ships tend to suck but are used en-mass due to BCorp\u0027s very good manufacturing capabilities in their own factories which allow crazy numbers of ships to be made quickly and with little labor.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd here\u0027s AKS\u0027s info...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAI Korporation Systems Alliance (AKS):\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EInfo:\u003C/strong\u003E Created by BCorp, led by self aware AI alongside a handful of kerbals that compose the leaders of smaller factions that didnt like BCorp.  Went to war against BCorp to survive, and has been doing so ever since.  Currently has 2 bases under their control, their 1st major operation on Duna, and a smaller expedition was also sent to Dres but that doesnt have much with regards to maufacturing so for all intents and purposes it doesnt do anything useful yet.  They use very small quantities of super strong warships (tech advantage), and have access to all but interstellar levels of technology (so anything in the stock KSP lineup, no interstellar parts pack or such though).  Fought a conventional symmetric war against BCorp, lost that after the 2nd battle of Minmus, and have been operating from the shadows ever since (they have as of this moment 2 warships in kerbin orbit, and 1 is leaving for duna after being shot apart and needs a refit so soon it will be just the 1).  They have 0 persense on Kerbin itself after the kerbin government finally refused to provide them with launchers to deploy warships into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E (all their factories shut down and self destructed to keep anyone from learning their secrets).  Sacrificed their entire fleet at the last stages of the Minmus campaign to destroy all records of technology that BCorp and kerbin factions possessed, leaving the others in a primitive state where the only way to obtain old tech was to steal it from damaged warships and such in orbit or from stackpiles left before the battle (noone understands now how to manufacture let alone even how most old tech works after a string of assassinations by undercover agents in the science world combined with orbital assault on RnD facilities and the Mun colony).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMotto: \u003C/strong\u003E?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECreator:  \u003C/strong\u003EBCorp, important kerbals: Kidana Kerman (leader of Kerbin strike group), Bill Kerman (overseer of entire Duna operation).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBeliefs:\u003C/strong\u003E ?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDeals:\u003C/strong\u003E No internal economy, everything is made for free purely limited by time (their mining and manufacturing is fully automated run by droids and AI, no Kerbals required, ships and vehicles and such are distributed to commanders after manufacture).  Some of the subgroups that make up AKS buy ships and weapons from RT by trading raw material (ore) that AKS has plenty of (AKS is bottlenecked by ship manufacturing not ore extraction) so AKS can field almost any ship that RT or BCorp would have (not that they use BCorp primitive trash ofc, they have used most RT ships though at some point in time).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFunds:\u003C/strong\u003E None, AKS does not have any internal economy, economic interaction limited to its subgroups.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECraft in service currently: \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSpace:\n\u003C/p\u003E\n\u003Cp\u003E\nAKS HK-1 Vulture:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WmoVqFm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/WmoVqFm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMedium interceptor, the Vulture can engage any starfighter in comes across and can still harass larger vessels that its weapons cant penetrate by targeting any unarmored exposed component like engines.  Forms the backbone of the entire AKS fighter force due to its extremely easy and fast manufacture.  Known for its high ammo capacity (for a interceptor) in the form of 2 SRM-4Ls.  Unmanned design keeps pilots safe and allows kamikaze tactics as a last resort when ammo is depleted.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/5uxpat1my3n96sr/AKS%20HK-I%20Launcher.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/5uxpat1my3n96sr/AKS HK-I Launcher.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAKS HK-II Trifighter-II:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tTDraG2.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/tTDraG2.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVery hard hitting strike fighter easily capable of obliterating any fighter, corvette, or other lightly armored target, and doing serious damage to the strongest capital ship with good aim.  Armed with 1 SRM-4L and 2 SRM-4M.  Inability to mass produce limits it to only the most elite pilots, very rarely encountered in universe and mostly deployed in defense of critical installations like the duna shipyard.  Influenced by alot of thinsg actually, some BSG viper, some SW droid fighter, some my own design, a \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTo\u003C/abbr\u003E i made a while back, ect.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/939futjf8wqwnhn/AKS%20HK-II%20Launcher.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/939futjf8wqwnhn/AKS HK-II Launcher.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAKS SK-I Class-I:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MsYZSiv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/MsYZSiv.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QNEoDpg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/QNEoDpg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe 1st warship produced by AKS, the class-I was considered the best ship in universe when it was introduced during the battle for the Mun. Replaced by the SK-II and later Supernova class, it is mostly found occasionally on sale in the black market or RT catalogs given how many of these things were abandoned/destroyed throughout various battles and are fairly easy to repair.  Not used by AKS with the exception of a heavily modified version that acts as Bob Kerman\u0027s personal command ship (he used to serve on one of them decades ago and has kept it mostly because he is attached to it despite newer alternatives) and a few left in the hands of AKS allies (this thing was one of few ships that AKS officially exported to subfactions in large quantity so anyone who is/was allied to AKS may still have them around).  Comparable in role and capability to the BCorp Longsword/Shadow series (Shadow = Longsword with stealth kit added) which was implemented way later as a counter to it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/ur0lf4y8dxp7vzb/AKS%20SK-I%20Class-I.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ur0lf4y8dxp7vzb/AKS SK-I Class-I.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAKS SK-III Nova\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022B1a94zQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/B1a94zQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnmanned throw-away corvette designed to fill ranks quickly and at low resource cost.  Uses no AKS tech except reaction wheels and 1 \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E, which means that the hull can be manufactured almost anywhere and there is no risk of advanced tech falling into another faction\u0027s hands (the hulls of this vessel are the only thing AKS actually outsources to its subfactions for them to manufacture since its so simple).  Armed with 2 RT-5 dumb fired torpedoes and 2 SRM-4M for a balanced punch against both fighters and capital ships.  Lethal in numbers to the largest ships, but even 1 can still do decent damage during a suicide run.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/71vhykovu4a65uw/AKS%20SK-III%20Nova.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/71vhykovu4a65uw/AKS SK-III Nova.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAKS SK-IV Nebula-III\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NORqCO0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/NORqCO0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBackbone of any AKS fleet, the Nebula is very balanced, decent armor, absurd firepower just shy of a cruiser and good range (over 3000 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E).  Armed with 4 SRM-4M, 2 G7d mid range heavy guided torpedoes,and 2 kinetic drone anti-fighter weapons.  Its got a very well known and obvious radiation signature so AKS cant use them in Kerbin orbit without immediately being attacked so they are mostly used on Duna and Dres for defensive purposes while other less common ships fight BCorp\u0027s colony attempts.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/2z7o485ddxknf96/AKS%20SK-IV%20Nebula-III.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/2z7o485ddxknf96/AKS SK-IV Nebula-III.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAKS SK-VI Dimension-IV:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022x6geMUZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/x6geMUZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wiUpO5o.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/wiUpO5o.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe strongest AKS warship in existence (as of this point at least), the Dimension is designed as a command vessel with both carrier and direct combat capabilities.  It has a huge hangar in the back that can fit up to 6 HK-I or equivalent fighters, and due to its highly modular design, can be reused as a command center, weapons platform, and even to store fuel for extended range operations.  Range is absurd given its size (~3000 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E), and it carries a very balanced weapons complement allowing it to engage anything from capital ships to starfighters.  Armed with 6 SRM-4M, 2 G7d torps, and 1 kinetic drone (SRMs and the drone are usually omitted when used to carry fighters).  Only 1 is currently in service (Kidana\u0027s flagship), with 1 more planned for immediate deployment to defend Duna.  Heavily influenced but not really a replica of the droid warship in the opening on star wars ep3, the 1 that got blown to bits, split in half, and the front somehow landed on a runway despite not having any engines on it (scifi or not, no idea how the hell you are controlled landing a ship that big with no engines on it).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/b1c8fbyiaayawvl/AKS%20SK-VI%20Dimension-IV.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/b1c8fbyiaayawvl/AKS SK-VI Dimension-IV.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd the old versions (can be used by other factions as all of them have had a few recovered by scavengers).\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nDimension\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PvacCoZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/PvacCoZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UkuELSm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/UkuELSm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe 1st model, armed with 6 SRM-4M, 4 kinetic drones, and 2 older G5 torpedoes.  Used early during the 2nd battle of minmus, only 3 were produced (all were lost to enemy fire).  2 of them have been refurbished by scavengers and put up for sale by RT at very high price.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/usrw8uxbl8o1y19/AKS%20SK-VI%20Dimension.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/usrw8uxbl8o1y19/AKS SK-VI Dimension.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDimension-II\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022esIbaCI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/esIbaCI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tDCG28U.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/tDCG28U.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nImprovement to the ship, the 2nd version focuses more on starfighter carrying then direct combat as it has 2 less SRM-4Ms onboard but has a slightly larger fighter bay.  Still, its more or less a stepping stone between it and the later models since it had inferior firepower to all other models and less hangar space then its successors.  Hangar is located on the front which also makes it more vulnurable to enemy fire and harder to exit due to the entrance having a odd shape.  One was deployed, abandoned almost intact after having its bridge blown apart, and was like the original version scavenged, fixed, and currently is in use by a band of pirates.  Only 1 was ever deployed, 3 were made (the others were hidden on kerbin and never launched so you would not break lore by giving them to anyone saying they uncovered a buried warship).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/ack6jy3k0b3erb6/AKS%20SK-VI%20Dimension-II.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ack6jy3k0b3erb6/AKS SK-VI Dimension-II.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDimension-III (dlc modded version):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bJuSNWZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/bJuSNWZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nkHTQMp.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/nkHTQMp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnother interm design, this one basically stole the layout and look of one of RT\u0027s warships that AKS got their hands on.  Armed with 6 SRM-4M and 2 G5 torps all in the front.  AG#3 toggles the torpedo bay door (located on the bottom front), and AG#4/5 toggles the hangar doors (they slide open to allow fighters to exit and can be closed to offer some armor protection).  2 were produced, 1 was left abandoned around \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E after running out of fuel post failed aerobrake and with no way to refuel it (you can say it was found and can be given to any faction in your universe), the other was cut in half in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E just after AKS defenses around Minmus fell and is now on sale by RT post repairs (noone in my universe can actually afford it as RT wants a small fortune for such a rare and powerful vessel given there is only 1 available for them).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/f7aj3kbuk25g50z/AKS%20SK-VI%20Dimension-III%28dlc%29.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/f7aj3kbuk25g50z/AKS SK-VI Dimension-III(dlc).craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSK-VII Aurora:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222fdZJss.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/2fdZJss.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA support ship created by AKS subfaction which proved very capable after some alterations.  Armed with 4 G5s, 2 SRM-4M, and 4 kinetic drones.  Weaker armor then a nebula limits its role to more fire support then frontline damage tanking, but since it has a total of 4 heavy torpedoes, its pretty good at that (and still has 2 defensive SRMs is absolutely needed).  All of these in AKS service were lost to various reasons, and are now only available on black market and through RT which like many other AKS ships, has refurbished wrecks from the battlefield and put them up for sale.  Heavily influenced by the orion battleship in stargate but not really a replica.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/9vraxol250qawen/AKS%20SK-VII%20Aurora-II.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/9vraxol250qawen/AKS SK-VII Aurora-II.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSK-VIII Starlight:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aLMta6H.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/aLMta6H.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022STfK73u.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/STfK73u.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAssault carrier that combines a deadly complement of 4 G5 torpedoes, a near limitless fighter capacity (solong as they have claws to attack to the external surfaces), and good fuel capacity.  Its not really intended to be shot at too much (has armor but even medium SRMs will hurt it seriously), but it has armor and it will take a few hits before going down so it can still tank is needed.  Weakness (just like what its a replica or) is the core where the 2 tristarts connect together (it uses engines to armor that up but because of this its also very easy to blow the engines apart with accurate fire).  Not the cheapest carrier, but the strongest one in universe from a survivability standpoint (except dimension ofc but thats technically a cruiser and not a carrier).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/a5f8t1ipmgiodsg/AKS%20SK-VIII%20Starlight.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/a5f8t1ipmgiodsg/AKS SK-VIII Starlight.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAir:  No presense on any planet that supports jets, handful of SSTOs from old days in storage but nothing new.\n\u003C/p\u003E\n\u003Cp\u003E\nLand:  Civilian housing on duna, orbital defense cannons and supporting infrastructure on duna, ike, dres, handful of outdated armored cars (AKS doesnt use heavy tanks, prefer high numbers of weaker more mobile cars), in process of developing a medium sized walker tank (if only i could get the legs to bloody work).\n\u003C/p\u003E\n\u003Cp\u003E\nSea:  None\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAlliances: \u003C/strong\u003ECouple pirate groups that have a common goal (fighting BCorp).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMain focuses:\u003C/strong\u003E  Surviving in a world thats against its very existence, leaving Kerbol system once and for all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ELesser focuses: \u003C/strong\u003EImproving Duna operation (very slow and limited production due to just 1 refinery being active), stopping BCorp from restarting mun mining colony operation.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESummary: \u003C/strong\u003EAKS is not a kerbin faction (has no land of assets in Kerbin period) that operates out of Duna and Dres. They are hostile to BCorp and its allies, doesnt have a conventional economy (no money internally to AKS), and is composed of a massive number of tiny subfactions that allied with the AI core running the show. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, thats my 2 factions, although i can only see BCorp being put on your map since RT isnt a faction, they just sell ships/weapons, and they dont care whatsoever who they sell to, anyone with the money can get their hands on RT sold vessels.  AKS i can only see you implementing as a random encounter in space (they do have strike groups go to Kerbin to fight BCorp so you could randomly come across them), and their ships are often available through RT.  Only 1 that could never be found on market in some condition would be the Dimension-IV as there is only 1 of those in universe and its currently in AKS hands as the flagship of the Kerbin strike group (and BCorp doesnt even know thats its a AKS ship as theyve never encountered it in combat yet and looks fairly different from the older III model).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-12T18:35:47Z\u0022 title=\u002201/12/2020 06:35  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 12, 2020\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-01-11T23:28:35Z","Content":"\n\u003Cp\u003E\nDon\u0027t worry, if you have Craft that need overhaul I\u0027ll do it. You don\u0027t have to go through the trouble of adding weapons and I\u0027ll make sure that they are balanced.\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-01-12T01:51:59Z","Content":"\n\u003Cp\u003E\nBig updates: Breaking news. In 1-2 weeks I\u0027m installing an ssd and clearing my computer. Also, I\u0027ve got a PUP (Malware) that doesn\u0027t want to die. I\u0027ve gone to the bleepingcomputer forums and they told me not to really touch the computer or install anything. That does mean no mods but I can still play and respond. \n\u003C/p\u003E\u003Cp\u003E\nAlso for lore or what I\u0027m going to do:\n\u003C/p\u003E\n\u003Cp\u003E\nBCorp is going to side with SPUM, Or become an ally.\n\u003C/p\u003E\n\u003Cp\u003E\nAKS may be a random encounter with the first ASA launch to Duna. Aka manned. The probes I use are usually preprogrammed. Anyways. This is early to mid-tier at the start btw so make some early models for early battles. Or later on you can come into play. Later I\u0027ll post more options or you can choose your own Idea with my approval. I\u0027ll allow most things tho.\n\u003C/p\u003E\u003Cp\u003E\nAnd make sure you vote which side you are rooting for. No plot armor allowed unless for prolongue stuff or events like power-outage or out of fuel. But after all those things it\u0027s up to you.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you can control both factions...\n\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2020-01-12T03:51:04Z","Content":"\n\u003Cp\u003E\nI cant make any promises (again, freetime is severely limited and i need to do some errands tomorrow), but ill try and add a few extra ships to teh catalog which have been updated/rearmed for modern standards.\n\u003C/p\u003E\n\u003Cp\u003E\nAre you interested in any pirate vessels i have?  No idea if you have any pirate factions or plan to have random pirate attacks, but i have a really nice ship for said pirates that actually looks like it were made in a shack and not in a shipyard.\n\u003C/p\u003E\n\u003Cp\u003E\nI also have alot of RT ships that arent really for any of my 2 factions that ill add, most of which are actual replicas from sci-fi movies and such.  What i remember off the top of my head that i made are a few starwars ships (venators, 1 practical as assault carrier, 1 900 part model with a crazy massive interior thats walkable, star destroyer, tie fighters, ect), hatak replica (no weapons but it looks pretty), normandy that can actually \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E and has a fully detailed interior that is walkable (and is like 900 parts so i doubt itll be of any real use outside of perhaps cinematics or something).\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, i have some ground infrastructure, mostly civilian housing, massive skytower (HL2 citadel inspired tower thing i used as AKS HQ on duna), a few random ground fortifications (mostly LC tech replicas actually).  I have a functional orbital cannon for AKS use (its actually armed with torpedoes that can be deployed against targets orbiting duna or lighter gravity worlds).  Interested in any of that (most youd have to do is rearm them with BDA and tweak armor values so they dont instantly explode to a singl 50cal bullet).  Also have a few space stations and a few different shipyard styles as well as utility like fuel tankers and refineries and such.  Im not really gonna spam your thread with craft, but if there is any specific thing you are looking for just ask and i might have something already working to fit the need.\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-01-12T14:56:16Z","Content":"\n\u003Cp\u003E\nI would love more Craft. Just make sure you follow Craft rules. Those pirate Craft can be used to battle \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022195204\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0022 rel=\u0022\u0022\u003E@fulgur\u003C/a\u003E. As a small twist in their ethics. Also, make sure you split the factions into two different posts unless they are branches of a main faction. \n\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2020-01-12T19:40:22Z","Content":"\n\u003Cp\u003E\nHere are a few more unaffiliated ships, 1st one is pirate ship, rest are sold by Replitech (RT) and are available to anyone who wants to buy them regardless of faction affiliation (RT in lore sells to anyone who has the funds although BCorp is their primary customer as of this moment).\n\u003C/p\u003E\n\u003Cp\u003E\nPRT Annihillator-II:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022X0UrQ03.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/X0UrQ03.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022f4g2y1z.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/f4g2y1z.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDestroyed and rebuilt a grand total of 7 times, the Annihillator-II is considered the most famous pirate vessel known on Kerbin, even serving as Jebediah Kerman\u0027s flagship for a short time (Jeb and Val are both notorious pirates in my universe).  Originally made out of a wrecked shadow class, pirates didnt have any wings to repair it with so the outer hull was replaced with heavy duty panel armor.  It has taken alot of wear/tear over time, and every time it was lost the pirates just found the hull, towed it back home, and repaired the damage with whatever components they could get their hands on (hence the trashy look random wing parts and structural tube sticking out of the side that was strutted together).  Its remained operational in high Kerbin orbit ever since and has engaged both AKS and BCorp forces, constantly changing ownership as 1 pirate faction steals it from its previous owner.  You are free to blow this thing apart as many times as you want as in lore it just keeps getting rebuilt/recreated by someone in the underground pirate world.  Also, please keep the name and dont deploy more then 1 of them at a time, its supposed to be 1 of a kind that just keeps getting overhauled every time its obliterated (no such thing as Annihillator class warship, its just called the Annihillator-II).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/x21ca4xq0g3wdgc/PRT%20Annihillator%20II.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/x21ca4xq0g3wdgc/PRT Annihillator II.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd now the RT ships that are again, available for any faction that feels like buying them:\n\u003C/p\u003E\n\u003Cp\u003E\nRT Ha\u0027tak class mothership:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226A7roOS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/6A7roOS.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FCXxJSf.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/FCXxJSf.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBasically a replica of Ha\u0027tak from stargate, not too much practical use for this thing.  Too small to carry anything but a Micro-C or Vulture, lowish \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for its role (not enough fuel tanks onboard it for the weight), and just 3 experimental guided missiles that im not even sure work, but its there, it looks really pretty, and it looks about as \u0022unconventional\u0022 as warships get.  Just added this in case you want something genuinely alien looking that doesnt resemble conventional (this thing doesnt really fit with any faction\u0027s styling in my lore so ive never deployed it, still keep it in RT\u0027s catalog as i like the way it looks and have gotten into less \u0022conventional\u0022 designs recently as too much sci-fi looks similar to a submarine of some cross section with rear engine cluster strapped on and this doenst look nothing like normal sci-fi ships would).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/lw3eakg791b43ia/RT%20Ha%27tak%20Mothership.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/lw3eakg791b43ia/RT Ha\u0027tak Mothership.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRT Imperial class SD:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WIgA12S.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/WIgA12S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JPJSRAa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/JPJSRAa.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIm not even going to mention what this is a replica of (anyone who doesnt know clearly doesnt watch sci-fi), very old and outdated, but its very good for cinematic use (and still functions as a warship since its armed with enough SRMs to hurt capitals), and well if you want to add this then feel free.  Classified as a command frigate in universe as it was mostly used as a flagship until replaced by the much bigger and superior venator.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/swacsc8o7h7nxde/RT%20Imperial%20Class.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/swacsc8o7h7nxde/RT Imperial Class.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRT Venator SD:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VL0XXXi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/VL0XXXi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CjdRiFl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/CjdRiFl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe largest warship offered for sale by Replitech, the Venator is classified as an assault carrier since it has the hangar space to accomodate a full squadron of fighters, and has enough weapons to do serious damage to capital ships.  Armed with a grand total of 8 SRM-2M, and 2 SRM-2L.  Its very expensive (as any ship of this size would be), and has balanced armor scheme (hybrid between wings and panels, panels protect critical sections, wings make up most of the outer hull as they dont weigh so much) allowing it to take some fire (even if its not quite designed to be shot at too much).  Obviously as close to a replica of the star wars venator (my favorite star destroyer hull style of anything from that series) as i could get without going absolutely insane with parts (i had to skip the doors despite planning robotic actuators there due to parts).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/v5zbl0v8v0fvk08/RT%20Venator-Class%20SD.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/v5zbl0v8v0fvk08/RT Venator-Class SD.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRT Providence class dreadnought:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022b23QUnZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/b23QUnZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022G9kQtTm.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/G9kQtTm.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDesigned as a lower cost alternative to the venator, the providence is better armored and much more compact, but has almost no fighter space (there is a hangar, but its only going to fit a micro-C or equivalent size comfortably).  Its also armed with an insane 6 SRM-4Ms and 2 SRM-4Ls (at the time this was considered to be very good for a destroyer/cruiser which this thing is despite SW calling it a dreadnought) bringing the focus of the ship more towards direct ship-ship combat instead of carrier/command roles.  This thing was actually bought by AKS and while the ship didnt perform all that great, the hull was found to be very hard to kill and the overall shape was taken to base the 2 latest Dimension class cruisers on (RT was not very happy that AKS basically bought 1 of them and then made their own variations, but there wasnt much they could do at the time as they needed ore from AKS to manufacture their more profitable vessels).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/crztvc1b2rlqzvy/RT%20Providence-Dreadnought.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/crztvc1b2rlqzvy/RT Providence-Dreadnought.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRT Tie Interceptor:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YMivdHl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/YMivdHl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nReplica of TIE fighter from SW, came out quite solid even though it seems notorious for loosing the pod and killing the pilot inside when shot by light SRMs at shorter distances.  Guess i properly replicated the fact that in star wars lore ties were supposedly cannon fodder (no shields, no armor, basically death traps).  Used by BCorp in small amounts but the aforementioned survivability issues make it a very unpopular and most squadrons that were issues the TIE would actively avoid combat especially against armored fighters like the Pidgeon or Tri that could survive the initial attack and return fire.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/nny4j5gn9dbwj48/RT%20TIE%20Interceptor.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/nny4j5gn9dbwj48/RT TIE Interceptor.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNone are faction exclusive so use em as you see fit.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-12T19:40:42Z\u0022 title=\u002201/12/2020 07:40  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 12, 2020\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fulgur","CreatedById":195204,"CreatedDateTime":"2020-01-12T21:22:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223727366\u0022 data-ipsquote-contentid=\u0022190269\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221578840976\u0022 data-ipsquote-userid=\u0022201477\u0022 data-ipsquote-username=\u0022Arco123\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Arco123 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThose pirate Craft can be used to battle \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022195204\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0022 rel=\u0022\u0022\u003E@fulgur\u003C/a\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDon\u0027t I get any allies? Not even anarcho-kommunist SPACE PIRATES? (Second time dead in a ditch: can we make/break alliances? Thinking of acting like the kommunists and destroying all corporations...)\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-01-12T23:43:11Z","Content":"\n\u003Cp\u003E\nY-e-p!\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-01-13T15:23:15Z","Content":"\n\u003Cp\u003E\nAlso, guys, Make sure you fill out the faction form on these forums. So you may have to edit a bit and make sure you follow most of the Craft rules. You don\u0027t need many pics but just follow the minimum. I\u0027m also focusing on the info side so stay tuned for updates.\n\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2020-01-19T19:26:54Z","Content":"\n\u003Cp\u003E\nWell my \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E dropship hasnt been going too well, so i decided to revive one of my older dropships (non atmo only but it does sorta work on duna solong as the payload isnt too heavy or anything, and it will flip all over in said atmo too).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022n5LWDhg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/n5LWDhg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225mLVNej.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/5mLVNej.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yXvrG1v.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/yXvrG1v.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNot the most practical thing in the universe, but i upgraded it to have NTR engines (so it can actually go interplanetary to some degree unlike the original model), its designed to appear as a natural rock formation or something of that sort when on the ground, and its got the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E to deorbit/land a 50t vehicle (never actually made a tank above 20t in this game, so not really very useful capability imo).  IRSU has been added over the original model allowing this thing to at least theoretically have infinite range if you take advantage of things like slingshots (it can at the bare minimum do kerbin-jool if you fuel it up at minmus).  Primary engine \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E is pathetically bad though so be sure to have alot of patience (2 nukes pushing like 80t with vehicle onboard), but it can always burn using its quad aerospikes so landing even on high gravity isnt a problem at all.  ~150 parts total, so basically nothing for most people that play KSP (that doesnt include the 200 part vehicle inside ofc).  I didnt really bother arming it (this would use BDA and have at least some point defense) as i dont have BDA installed atm (loading times and lag is bad enough with all the mods i have as is), but it shouldnt be hard to add some BDA weapons to it and armor it up so it doesnt instantly explode when someone so much as looks in its direction.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, any idea what this is a replica of, i seriously doubt anyone on here will know since its something i vaguely remember from animated show i watched when i was a kid in like mid 2000s (and im pretty sure this was seen only in 1 episode of said show)...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-19T19:32:37Z\u0022 title=\u002201/19/2020 07:32  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 19, 2020\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-01-20T02:18:00Z","Content":"\n\u003Cp\u003E\n\u003Cbr\u003E\nCheck out the new updates. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-01-22T16:12:56Z","Content":"\n\u003Cp\u003E\nMake sure you add more vessels \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022195204\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0022 rel=\u0022\u0022\u003E@fulgur\u003C/a\u003E. I cant really make a Craft buying thing without more of SPUM\u0027s allies. Also add more info on your factions so I can add it.\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-01-23T02:40:05Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cem\u003E\u003Cb\u003ENOTICE: All further operations will be discontinued due to rough times. That means no videos, comments, anything from me after these final messages. I may return but that isn\u0027t likely.\u003C/b\u003E\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-02-03T00:31:18Z","Content":"\n\u003Cp\u003E\nI got everything back up but I\u0027m taking a break from forums for the time being. (About until next week.) I\u0027m trying to upgrade parts of my computer so wait a bit. I\u0027m a little bit exhausted right now. \n\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2020-02-08T02:55:33Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201477-arco123/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022201477\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201477-arco123/\u0022 rel=\u0022\u0022\u003E@Arco123\u003C/a\u003E, do you have the dlcs or not?\n\u003C/p\u003E\n\u003Cp\u003E\nJust asking as i made a massive overhaul of the Venator class from RT\u0027s catalog and its fully finished now and ready to be blown to bits...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WgvaFEV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/WgvaFEV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEngines are authentic and as close to properly scaled as i could and had to use 1.8m parts as the others looked bad (id have to have made the ship like enormous otherwise and go way above any sane part count to get there).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022h9isLR8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/h9isLR8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nProportions are a tad off, and the angles arent perfect either, but its the best i could do with the limited shapes of the stock parts (and not willing to make it 800 parts).  Weapons are obviously not authentic replicas either, but i added just enough to make it a threat itself but not so many that it lags my game to death.  Currently armed with 8 SRM-1M, 2 SRM-2L, and 1 general purpose torpedo.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GZy23TC.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/GZy23TC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd my favorite part, actual working actuated doors that open/close.  Had to make them larger then the real venator\u0027s upper doors, but at least they will fit most starfighters that dont have huge wings or anything of that sort (and somehow dont fit into the side doors (the top door is the largest of all 4 possible entry points for a fighter).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HQhlbRP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/HQhlbRP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd well, hangar is largeish.  Its actually a hair bigger then the Dimension class\u0027s hangar, but given the part count of the ship itself i would not reccomend having more then 2 fighters onboard (unless they all get deployed well b4 anything else comes into load range of this monster.\n\u003C/p\u003E\n\u003Cp\u003E\nI know ur busy, as am i (not to mention sick so i sorta feel like shat these last 3 days), but if you ever want to continue ill be happy to upload this (and i think ill redo my repository so that the ships are just provided in a single zip file or so instead of the current 1 link per craft which is a bit unpractical imo).\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-02-08T14:25:04Z","Content":"\n\u003Cp\u003E\nYep, I have the dlc. On Monday I plan to come back. Thanks for redoing that ship. It looks amazing! I\u0027m kind of sick too. Once I get back I\u0027m going all out.  \n\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2020-02-09T16:45:18Z","Content":"\n\u003Cp\u003E\nI\u0027d argue this falls under RP based on precedent set by trying to do this previously. Especially considering you\u0027ve used our roleplay map without asking first for very similar purposes and there were strict warnings against that by vandamode.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-02-09T17:03:40Z\u0022 title=\u002202/09/2020 05:03  PM\u0022 data-short=\u00224 yr\u0022\u003EFebruary 9, 2020\u003C/time\u003E by Spartwo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-02-10T13:19:18Z","Content":"\n\u003Cp\u003E\nWell, sorry. Can I ask now to use that map or do I have to use a different map for it. Sorry I forgot about that. I\u0027m kinda new to the whole thing.\n\u003C/p\u003E\n\u003Cp\u003E\nAbout the roleplay. I asked him in a topic about it: \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022123837\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed6965577070\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/111158-ask-the-mods-questions-about-the-forums/page/195/\u0026amp;tab=comments\u0026amp;do=embed\u0026amp;comment=3725373\u0026amp;embedComment=3725373\u0026amp;embedDo=findComment#comment-3725373\u0022 style=\u0022height:242px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nAnd he told me it\u0027s fine. But, to keep it on the rails and don\u0027t let it spill over onto the forums and not allow anybody to get too competitive. If you think this is wrong please tell him and he\u0027ll be the judge. (I\u0027m just doing this part as an extra. Doesn\u0027t have to be in here!) \n\u003C/p\u003E\n\u003Cp\u003E\nThank you for voicing your concerns. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027ve changed to davnci resolve 16 so don\u0027t expect me to edit anymore until I get used to it. I still have to finish 3-hour long tutorials before I feel safe editing in it. I\u0027m a little sick but I can continue working on the project. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/58131-spartwo/\u0026amp;do=hovercard\u0022 data-mentionid=\u002258131\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/58131-spartwo/\u0022 rel=\u0022\u0022\u003E@Spartwo\u003C/a\u003E (Edit because he didn\u0027t reply.) \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-02-16T00:12:48Z\u0022 title=\u002202/16/2020 12:12  AM\u0022 data-short=\u00224 yr\u0022\u003EFebruary 16, 2020\u003C/time\u003E by Arco123\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2020-02-11T01:03:29Z","Content":"\n\u003Cp\u003E\nHere is a somewhat better upload of all me ships:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/5jghrmt4tfeez10/panzer1b%20ships.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/5jghrmt4tfeez10/panzer1b ships.zip?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEverything in 1 zip archive, just select folder you want, copy to game, and launch it.\n\u003C/p\u003E\n\u003Cp\u003E\nAll space stuff (capital ships, fighters, ect) come with launch stage and should be in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.  The ground stuff (CIV prefix as these arent really military facilities) is \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E, doesnt come with launcher, and most of it has the ability to be deorbited on its own on duna or lighter gravity planets.  Utility is mostly where i keep all the random crap like shuttles, fuel tankers, stations, ect.  Quite a bit of whats in here is really outdated and may or may not work, but i thought i may as well give you the full repository of ships that will at least load into the game, i created, and arent 100% worthless in their roles.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDetails on the currently good ships are in my previous post where i added all the ships to, so i wont bother double posting or spamming your thread with pics/writeups on how they all work.  Also, since i remembered, pretty much all my ships have following action groups: [1] main engines [2]\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E toggle (\u003Cabbr title=\u0022Reaction Control System\u0022\u003Ercs\u003C/abbr\u003E on my ships does not engage with just the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E key as i want to be able to disable certain \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E on a ship like the ones attached to fighters/weapons) [3]utility toggle (antennas, solar panels, some ships use this for \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E engine), [0]weapon \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E systems (a few torps have actual \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E on them for better accuracy which engages with this).  Also, any oddballs should have the AGs in their descriptions somewhere.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd something new im working on since i sometimes feel like deviating from space warfare:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228FeqYkk.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/8FeqYkk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226MXXZr8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/6MXXZr8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIts the core of BCorp\u0027s new revamped modular base system which im remaking from the ground up since i lost the old files and many of those are from KSP version 0.24 and will likely not even work like at all.  Its not armed but i will have LRM launcher modules and probably a SRM turret (or just use BDA for weapons) to provide the complex itself with some degree of protection.  Its badly needed since BCorp has finally managed to clear AKS from orbit and got their mothership to drag the old-tech refinery module which is compatible with this style of base system to the mun (this will function as the core the refinery attaches to and ill need to make a solar reactor to power it as well as a radiator module as well to make the drills/refinery not cook itself too badly).\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-02-13T19:51:43Z","Content":"\n\u003Cp\u003E\nJust to let you know that you have to edit your main post in order for me to add those updated and new ships. (Just so you \u003Cu\u003Ewant\u003C/u\u003E to do that.) I\u0027ve got a lot of stuff done but I still have a lot to work on. \n\u003C/p\u003E\n\u003Cp\u003E\nI got most of the stuff with davinci resolve 16 done but I\u0027m not totally done. (I haven\u0027t been able to pump out stuff due to not getting enough computer time to experiment and write. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022195204\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0022 rel=\u0022\u0022\u003E@fulgur\u003C/a\u003E Get over here and stop being lazy! I\u0027m joking. Just make sure you have a couple more Craft to fight us and stuff. Also make sure to update your main post!!! The hovercraft doesn\u0027t count until you add it. Plus, I need the info on your faction. (You know. The form thing.) \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-02-13T19:53:53Z\u0022 title=\u002202/13/2020 07:53  PM\u0022 data-short=\u00224 yr\u0022\u003EFebruary 13, 2020\u003C/time\u003E by Arco123\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fulgur","CreatedById":195204,"CreatedDateTime":"2020-02-13T20:27:41Z","Content":"\n\u003Cp\u003E\nOops forgot! Will this be on 1.9? It\u0027s just dropped and I\u0027ve downloaded it so, if you are playing on 1.8, no more Ussari/SPUM/KSR/☭ craft for you \u003Cspan\u003E\u003Cspan\u003E;-)\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWill do some tomorrow Greenwich time.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I thought that you invented the ☭ faction?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-02-14T14:42:08Z","Content":"\n\u003Cp\u003E\nYeah, as soon as all the mods update I\u0027ll do it. It takes a while anyways so we will have plenty of time. I\u0027m still on 1.8.1 but lots of time. \n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-02-16T00:00:32Z","Content":"\n\u003Cp\u003E\nA few small updates to the main post plus a document!\n\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2020-02-16T14:16:25Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201477-arco123/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022201477\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201477-arco123/\u0022 rel=\u0022\u0022\u003E@Arco123\u003C/a\u003E Please either use the correct map with credit or use a different map\n\u003C/p\u003E\n"},{"CreatedByName":"Arco123","CreatedById":201477,"CreatedDateTime":"2020-02-16T15:06:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223741991\u0022 data-ipsquote-contentid=\u0022190269\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221581862585\u0022 data-ipsquote-userid=\u002258131\u0022 data-ipsquote-username=\u0022Spartwo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n43 minutes ago, Spartwo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201477-arco123/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022201477\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201477-arco123/\u0022 rel=\u0022\u0022\u003E@Arco123\u003C/a\u003E Please either use the correct map with credit or use a different map\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOkay, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022195204\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/195204-fulgur/\u0022 rel=\u0022\u0022\u003E@fulgur\u003C/a\u003E, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/95108-panzer1b/\u0026amp;do=hovercard\u0022 data-mentionid=\u002295108\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/95108-panzer1b/\u0022 rel=\u0022\u0022\u003E@panzer1b\u003C/a\u003E. Were gonna stop with the player stuff so we can work. Plus, were not allowed to use the map. (Most maps are way too old with accounts that haven\u0027t used the forums for a long time. And their respective topics are too old or locked.) So, the only real option is to not do it. Unless we get permission. \n\u003C/p\u003E\n\u003Cp\u003E\nAnyways. I\u0027ve removed the maps and the player part. The best part is that we can work on the core part and you guys can work on making your Craft and Factions to be in there instead of playing around. You can still ask me to let you attack somebody or to buy a certain Craft. All of the bare-bone features. \n\u003C/p\u003E\n"}]}