{"TopicId":192077,"ForumId":39,"TopicTitle":"The Upsilon Initiative (KSP Community Project)","CreatedByName":"Ash Hightail","CreatedById":200896,"CreatedDateTime":"2020-03-02T02:22:58Z","PageNum":1,"Articles":[{"CreatedByName":"Ash Hightail","CreatedById":200896,"CreatedDateTime":"2020-03-02T02:22:58Z","Content":"\n\u003Cp\u003E\nHi, for the past 8 months the community of Stratzenblitz75 has creating a community project called the Upsilon Initiative. Essentially we wanted to create a community effort to colonize the entire kerbol system, and completely streamline it with automated systems so anyone could participate in the project. You can land a few kerbals on eve and call it \u0022colonized\u0022 but we want to do that on a HUGE scale. If you want to join us watch the video and join our discord. If you want some background history read on. About 8 months ago Stratzenblitz75 created a community project called the Sigma Initiative, which could not be completed because it was done all manually and it took in hundreds of submissions. When it failed we took initiative to create the Upsilon Initiative, a completely automated version that would require no human intervention. Anyways there\u0027s your brief history lesson, go watch the video.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/nsBZORo8Ozg?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Mipps64","CreatedById":228463,"CreatedDateTime":"2023-04-06T07:47:26Z","Content":"\n\u003Cp\u003E\nHi the links dont seem to work. Is there any other way for me to join?\n\u003C/p\u003E\n\u003Cp\u003E\nI have been following you for a while now and i was really inspired and wanted to join.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Mipps64","CreatedById":228463,"CreatedDateTime":"2023-04-06T07:48:15Z","Content":"\n\u003Cp\u003E\nNVM  i saw your recent post\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}