{"TopicId":193699,"ForumId":39,"TopicTitle":"Audacity: Memoirs of a Kerbonaut","CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-05-07T22:33:31Z","PageNum":7,"Articles":[{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-04-12T17:18:26Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EI think the formatting got a bit mangled again when I pasted this chapter in, or maybe that\u0027s just how the forum formats text now?\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThis chapter was getting a bit too long for my liking (almost hit 10,000 words) so I\u0027ve cut what was the last part of this chapter and put that at the start of the next one instead; this means that the BIG REVEAL will have to wait, but (I hope) it\u0027ll be worth it.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Cu\u003EChapter 15- Bah, politics!\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EA stunned silence followed this bombshell announcement. Gene, Natalia and Dr Davlos were all staring at Dilgas in disbelief, while he looked back, clearly enjoying the effect that his surprise announcement had had on them.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You’re not, though.” Natalia broke the impasse.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Not what?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Married to her.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I believe this marriage certificate with our names on it rather invalidates your point, young miss.” Dilgas replied, holding out his hand for an aide to pass over another brown envelope with the aforesaid certificate inside.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I believe the divorce certificate with your names on it rather invalidates your point.” You pompous, arrogant, smug, patronising, violent, abusive, misogynistic sociopath, she added in her head, accompanying each word with an imagined punch in the face.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThis wasn’t the reply Dilgas had expected, judging by his reaction, but he recovered quickly.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“And where is this certificate? Perhaps you would be kind enough to show it to the group?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“It’s on the website, look it up yourself. In the meantime, you can take that worthless piece of paper,” she jabbed a finger at the court order, “and shove it up your Arstotzka.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EDilgas stared; the GSS agents gaped; Davlos made little squeaking noises, as if he was trying to speak but his voice wasn’t working.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Doctor,” Dilgas turned to Davlos, much to the latter’s discomfort, “by the powers granted to me by this court order, you will ensure that these two-“ he made a contemptuous gesture at Gene and Nat- “are not allowed in the same room as Valentina-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Doctor Davlos,” Nat interrupted and continued talking over him, “by the powers granted to me by the legally enforceable power of attorney signed by Valentina herself, you will ensure that this man-“ she aimed an equally contemptuous scowl back at Dilgas, “is not allowed in the same building as Valentina-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“-no dissemination of information-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“-escorted to the nearest exit-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“-deported with extreme prejudice-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“-refuse to disclose any details-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Enough!” Davlos interrupted them both, which surprised everyone (most of all Davlos himself).\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I’m a doctor, not a lawyer! You’ll have to take this up with the hospital’s legal team.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Believe me, I will,” said Dilgas, then he turned to Nat. “And I hope you’re ready to have your Arstotzka handed to you on a plate.” He matched her scowl with his infuriating smug grin, then turned to leave.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Don’t you have an election to rig first?” Nat sniped after him.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EHe turned back, the smugness never wavering, but has he approached she noticed the simmering anger in his eyes.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I hope you’re planning a trip to Eeloo in the near future,” he said to Gene, pointedly ignoring Nat entirely, “because by the time my legal team is finished, neither of you will be allowed any closer to Valentina. I suggest you call for a cab; you won’t be here for much longer.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EDilgas turned to leave.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Huuurk.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EAnd walked face-first into a fountain of vomit.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ESasha beamed at her handiwork; Jeanette barely kept a straight face; Martin didn’t even try.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Bullseye! Nice work kiddo! Please tell me someone got that on camera.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThe GSS agents hurriedly bundled Dilgas into the waiting elevator before any more pukey projectiles made an appearance, pursued by laughter and leaving a faint smell of baby sick in their wake.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“That was a very foolish thing to do.” Gene said to Nat once the doors had closed. “He clearly came here looking for a fight, and you just gave him one on a silver platter.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ENat was defiant.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Oh, ВЯЕZНЙЕVS ТФЕИДILS ДИD ВЕLLУ-ВЦТТФЙ FLЦFГ on him! If he wants a fight, he’ll get one.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Language!” Jeanette scolded her. “There are children present!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ESasha was too busy trying to put her entire left foot into her mouth to notice.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“This is exactly what I was afraid of,” said Davlos. “As soon as he gets a new jacket, he’ll be in front of the cameras making another stupid speech; within the hour thousands of his supporters will be swarming the hospital from all directions. If he wins, you’ll never see Val again; if he loses, he only has to step in front of a camera again and an angry mob will break down the doors, ransack the entire hospital looking for you then chase you off the helipad, with or without an aircraft waiting to pick you up, and you’ll never see Val again.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Could we move her? Get her out of here without anyone noticing and away to somewhere safer?” Gene asked Davlos.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Only if you don’t mind killing her in the process. You’d need an entire ICU on the back of a truck to even consider it, and she’d probably never make it from here to there anyway.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“And what about us?” Jeanette asked angrily. “Or are you planning to use our daughter as a sacrificial lamb to buy you enough time to save yourselves?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“They wouldn’t hurt her, would they?” Asked Natalia.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“If we were dealing with sane, rational people, then no, but if an angry mob comes charging through the main entrance, all bets are off; remember Tripansk?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EGene, Martin and Jeanette all remembered Tripansk all too well: in the last days of the Great Crisis that had culminated in the Unification, previously peaceful pro- and anti-Union protests suddenly boiled over into widespread violence that convulsed the city for days; cars and buildings were set alight, paramedics and firefighters refused to enter the city for fear of being attacked by the rampaging mobs while the police force fought valiantly to clear a path for the vast crowds of people stumbling out of the city, most leaving all their worldly possessions behind. Hundreds died, thousands were injured and the damages ran into the tens of billions.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Then we have to set the narrative instead of letting Dilgas do it.” Said Natalia. “We need to beat him, and we need everyone to see it happening. If he tries anything shady, the whole world has to know about it.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“How do we do that?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We pull all of Val’s records- all her medical records from the Space Centre’s archives, everything we can get locally from before she joined the Space Program, all the legal documents with her name on them that we can possibly find. We can use that to not only prove that the court order is invalid but also show that he shouldn’t be let anywhere near her. Which he shouldn’t.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Why not?” Davlos asked, retreating as Natalia advanced towards him.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Why not? Because he tried to kill her, that’s why not!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Nat, you need to take a minute and calm down,” Gene intervened, trying to save Davlos who by now was cowering in a corner.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You were there, Gene! You know what he did to her!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Yes, I do, and believe me I don’t like this situation any more than you do, but going down there and yelling at people like this will only make things worse.” It took considerable effort for Gene to keep his voice calm. “Go outside, take a walk, get some fresh air; in the meantime I’ll get the whole Program’s legal department on this and spread the word up through the Unity Government- they’ll be queueing up to join the fight when they hear what he’s trying to do here. Please, let me handle this, Nat.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThey could all see the internal battle Nat was fighting with herself, and to their relief Gene’s advice won out. Nat let out a sigh that seemed to come all the way up from her feet, letting some of the tension out of her body with it and the anger and fear that had been boiling over receded to merely simmering on the back burner.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Don’t let him take her, Gene.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I won’t,” he reassured her.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EShe headed towards the lifts, trying to ignore the little voice in her head screaming at her not to leave Val’s side, pushed the button and almost leapt into the lift when it arrived. She was surprised when Martin joined her, now carrying Sasha in a baby carrier on his chest.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Buy you breakfast?” He said as the doors closed. Nat was about to decline the offer when her stomach rumbled very loudly and reminded her that she hadn’t eaten since lunchtime yesterday.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“OK. Free hospital food is still free food.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I didn’t mean from here- there’s a place I used to go to on the other side of the park does the most amazing maple-glazed bacon bagels, and I’m pretty sure I saw it was still there when we were driving in yesterday.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You lived here?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Born and raised, went to a school about half a mile south of here. I’m hoping a nice long walk outside will get this little one to have a nice long nap and get over the jet lag, so that maybe I can get over the leg lag too without being woken up every hour the entire night.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThe lift lurched into what little motion it could muster.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Maple-glazed bacon bagels sound amazing, but unfortunately Kerbo Kidney-kicker here won’t let me eat meat.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Kerbo-? Ohhhh, right. Not to worry, the same place does the best triple-cooked djan chips in the country, and let me tell you, you haven’t lived until you’ve tried triple-cooked djan chips, smothered in cheese and dusted with pepper and spices.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I don’t know what that is, but I want some. No, I need some.” Nat was salivating at the mere thought of all that cheesy, spicy goodness.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Iyaaaa!” Sasha beamed at Nat, who couldn’t help but smile back.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Oh, now you’re all smiles, now there are other people around,” Martin grumbled. “Just keep your distance from those little fingers, though: having your eyes grabbed and nearly put in her mouth is not a pleasant experience!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ENat backed out of grabbing range just in time and was convinced Sasha gave her a dirty look as she did.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EMartin suddenly got a glazed look in his eyes.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Huh. Last time I was in this hospital, Tina was about this old but barely half her size. Strange how I can’t remember what I went upstairs for, but I can remember that day like it was yesterday- the doctor’s name, the borderline creepy smiling animals on the wallpaper of the waiting room, even meeting an old friend from school; strange coincidence, she went on to become a lawyer, last I heard she was somewhere around here dealing with custody disputes and things like that. Can’t remember her name though, which is unfortunate.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThe lift stopped at level 5.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Matsen! That’s it- Matsen O’Kerman.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Sorry, what?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EMartin turned and did a double-take: sitting in a wheelchair was none other than Matsen O’Kerman herself, wearing a hospital gown and with an IV bag hanging on a stand attached to the wheelchair. A moment later she recognised him as well.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Martin!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“What are you doing here?” They both asked at the same time.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Ladies first.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Age before beauty.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Iyaaaaa!” Sasha interrupted them both, giving Matsen a big smile.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Hiya to you too!” Matsen leaned forwards but winced and sat back again. “Ooh, don’t do that. So is this surprise daughter or surprise granddaughter?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Tina hates it when people ask that. No, this one’s ours.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EMatsen’s eyes flicked over to Nat, then returned to Martin with an accusatory scowl.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Don’t tell me you and Jeanette-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EBoth Martin and Nat were immediately at opposite sides of the lift.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Oh, no-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We’re not-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I’m just kidding. Or maybe it’s the painkillers, I can’t really tell; everything’s been a bit fuzzy since I woke up.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“What happened to you?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Appendix burst.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Again? I thought you had that removed when we were in school?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I did. It grew back.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“They can do that?” Natalia looked a little bit queasy at the thought.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThe doors nearly closed between them, but Martin blocked it with his foot and they re-opened; Matsen wheeled herself in before they could close again and they restarted their achingly slow progress towards ground level.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“So why are you here, and why were you talking about me in an eerily prescient way?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ENatalia answered.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We were talking about lawyers because that despicable creature that people here call their Governor is trying to-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Dilgas? What’s he doing now? And where do I sign up to kick his saggy green backside?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“He’s trying to take control over Valentina’s medical care based on a lie.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Valentina, the astronaut? I thought she was in space?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Haven’t you seen the news?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I remember almost nothing from the last twenty-four hours. What exactly happened?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Dauntless was destroyed.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Dauntless, as in the Dynawing shuttle Dauntless? How did that happen?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We don’t know yet. All that matters to me is Val’s barely clinging on up there and that raging sociopath is trying to steal control over her medical care by telling blatant lies to get a judge to sign a court order. I’m going down to see the hospital’s legal team to make sure his phony court order doesn’t get enforced and to try and set up some kind of appeal or hearing or something.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“If he has a court order, I doubt there’s anything that the hospital can do to help you.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“But it’s completely and outrageously untrue! It would take five minutes of internet searching to prove that!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You still need to prove that in a formal legal session, and with the election happening tomorrow no judge in the country will ever agree to hold that hearing- at least not one who isn’t overtly biased one way or the other. If you’re lucky, you might be able to persuade someone to file an injunction temporarily halting the court order until a hearing takes place, but they’d probably appoint someone to make the decisions on Val’s behalf and bar both you and Dilgas from going near her.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“That’s absurd!” Nat fumed. “Val signed that power of attorney agreement precisely to prevent something like this happening. This whole thing stinks.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Dilgas is involved- you didn’t really expect it to come out smelling like roses?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ESasha added her own thoughts on the subject of things that didn’t smell of roses, which in the confined space they were currently occupying was enough to make their eyes water.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You know what- I’m going to find that certificate right now.” Nat took her phone out her pocket and started tapping away, grumbling about the slow wi-fi under her breath but keeping it uncharacteristically free of profanities.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Maybe you should call Judge Jonton; he’d have it all sorted out by tea-time.” Martin suggested as the lift finally juddered to a halt on the ground floor.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I don’t exactly have him on speed dial, and unless you’re going to use your psychic powers to have Judge Jonton appear right outside the doors-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I think he already has,” said Judge Jonton, standing right outside the doors and looking mildly bemused. Then the smell hit him and he took a step back with a grimace.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“That’s her.” An unwelcome voice came from behind him as Dilgas, flanked by the same GSS agents and followed by a phalanx of sharp-suited lawyers, approached across the hospital’s main entrance hall.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EJonton’s eyes flicked around the lift, widened slightly when they settled on Natalia, then rolled upwards as he muttered “I should have stayed in bed…” so that only those in the lift could hear him before turning back towards Dilgas.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“As I just explained to you, at great length and in great detail, there are no shortcuts in the legal process, even for you. Especially for you. You can’t challenge her objection to your court order when she hasn’t formally objected to it yet, nor can you force a hearing on the subject without giving her time in advance to prepare her case- and for you to prepare yours too.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E “There’s no need for any of that,” said Dilgas, giving Nat a very unpleasant smile. “I’ll make things nice and simple for you: either you publicly renounce whatever spurious claim you’re peddling and promise to leave Estovus and never come back, or I will use every means at my disposal as Governor to-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Stop talking.” One of Dilgas’ lawyers interrupted him. Unused to being cut off mid-sentence, he turned towards her with a slightly dazed expression. “What?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You were about to threaten to use your powers as an elected official against a member of the public for your personal legal advantage.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“So what?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“It’s completely illegal, that’s what! Had you finished that sentence, you could have been arrested, charged with abuse of power and intimidation, barred from the election and maybe even ended up in prison.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Do us all a favour and let him finish!” someone shouted in the background, which got a few cheers from the bystanders watching this dispute play out in the very public setting of a hospital entrance hall.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Hypothetically, if someone did file an objection, how long would it take to get a hearing?” Matsen asked Jonton.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“For a decision as urgent as this, it would probably be at least a week before a hearing could be scheduled.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“A week!?” Dilgas was dismayed. “Can’t you see the urgency of this situation?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You can’t build a proper legal case faster than that. It takes time to do the research, find the evidence you need and then prepare for the hearing itself.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Got it!” Nat shouted, holding her phone out triumphantly.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Got what?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ENat handed Jonton her phone.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“One divorce certificate, formally dissolving the marriage of one Dilgas Leslie Kerman and one Valentina Anastasia Kerman, dated over four years ago.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“That’s not true.” Caught on the back foot, Dilgas fell back on his usual strategy- going on the attack. “That’s a total lie. Blatantly untrue, total fiction.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“It’s on the UDA- the Unified Digital Archives; you could have looked that up yourself.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“She’s right,” said Jonton. “As a matter of fact, you should have done that before you applied for that court order in the first place. At best, this is negligent and the court order can be declared void; at worst, you deliberately misled a judge in a legal session- which is a criminal offence.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“This is an outrage! You can’t unilaterally end a marriage just like that!” Dilgas tried to snap his fingers for emphasis, but failed miserably.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Actually, you can- under Section 14 of the Kerman Rights Act of 1153SR, a marriage between two people who have been separated for at least eight years can be ended by either party without the consent of the other. The law stipulates that reasonable efforts should be made to contact the other party to offer them a chance to object, consent or negotiate, but if no objection is received within the 120 day time limit then the divorce can be completed unilaterally.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EJonton was in his element.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“If I call up the official inquiries hotline and give them this reference number, and they come back with the same details that are on this screen,” he held up the phone, “and confirm that the supporting evidence submitted with the application is in order, I will strike down your court order right here, right now. In effect, I will be saying that you lied to a court official: just think for a moment what effect that would have on your poll ratings, the day before the election.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“So to sum up,” said Nat, giving Dilgas a look of almost savage glee, “as I said earlier, you can take that useless piece of paper and \u003Ci\u003Eshove it up your\u003C/i\u003E-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EDilgas lost his temper.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Arrest her!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“What?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Who?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Why?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“ARREST HER!” He bellowed at his squad of GSS agents, who didn’t budge.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We can’t arrest people just because you say so,” one of them replied.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Fine, I’ll do it myself!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EHe pushed them out the way, barged past Jonton and advanced on Nat, who stood her ground fearlessly.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I’m placing you under arrest for...”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“For what exactly?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Fraud!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“What fraud? That was entirely Val’s doing, I had no part in it whatsoever.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EShe could almost see the wheels spinning in Dilgas’ mind.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Insurance fraud!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“What?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“This whole thing is an elaborate scheme for you to cash in on fraudulent life insurance policies in Valentina’s name.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“That’s so obviously made up, it hurts.” Martin interjected.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“And you are?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“The deputy senior underwriting officer for the third-largest insurance provider in the world.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Ha! So you’re conveniently on hand so soon after the accident to grease the wheels and take your cut of the payouts.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Astronauts are almost uninsurable. The Space Program has to get six different companies to collectively underwrite all their policies to spread the risk to an acceptable level; it would be literally impossible for anyone to get a policy in Val’s name. And for the record, the reason I’m here is because my teenaged daughter is upstairs in a medically induced coma, fighting for her life, because she flew into space and saved Val’s life.” Those last three words struck like hammer blows and Dilgas took an involuntary step backwards when he saw the cold fury in Martin’s eyes.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Hold on a minute.” Jonton rejoined the conversation, looking intently at the phone screen. “These dates don’t add up.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Which dates? You mean the divorce is invalid and I was right the whole time?” The smugness returned to Dilgas’ voice and face in moments.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“No, I mean the date of this birth certificate I just found in the UDA for a Valentina Anastasia Kerman, dated 19-02-1139SR.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“And?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“And, the marriage certificate here is dated 13-01-1153SE, meaning Valentina was thirteen at the time.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“And?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EDilgas’ lawyers had already realised where this was going and were frantically whispering to each other.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“And, Section 17 of the Kerman Rights Act explicitly set the minimum age at which you can get married at sixteen. This Act went into force on 13-07-1153SE, exactly eleven days before the date on this marriage certificate. Meaning-“\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EA deafening howl suddenly filled the air as the fire alarms went off. Reacting instantly, the GSS agents formed a protective circle around Dilgas and hurriedly rushed him towards the nearest exit, ploughing through the throng of people also heading for the doors, bundling him into a waiting car before filling the other cars in the motorcade and racing away with the sounds of roaring engines and whooping sirens in their wake.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“How convenient…” muttered Jonton as the evacuation began. They followed the crowd to the exits, pouring out into the street and immediately running into the crowds of protesters outside to create a swirling mass of confused people. Dilgas’ lawyers had mysteriously disappeared, vanishing in the crowd like candyfloss into a puddle; Matsen was immediately shivering as a biting cold wind howled through the buildings; Nat was on edge, constantly looking out for a potential attack; Jonton was studiously ignoring the young couple ahead who were trying to take a selfie with him in the background; Sasha was having the time of her life, smiling and waving at all these strange new people who invariably smiled and waved back.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“So can we have him arrested now?” Asked Nat with an excited note in her voice. “Just imagine how it’d look to have him thrown out of this election by a rule that he made up to try and cheat it.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Unfortunately, no. What you can do is file a report with the EBI, who will investigate the case and then prepare a report for the Prosecution Service to consider bringing charges against him as soon as they can, or for the local government to use as the basis for another vote to remove him from office; though they’ve already tried that five times and every time the vote has been entirely along partisan lines, so they never reached the three-quarters majority required. If he loses the election, you’ll be joining a very long queue of people trying to convict him of all manner of wrongdoings, but if he wins, you’ll need to wait another five years; or he’ll just pre-emptively pardon himself for everything to avoid prosecution.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“So a criminal can pardon himself for his own crimes? Seems legit.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Guess who introduced it. Now if you’ll excuse me, I have some phone calls to make. I wouldn’t be at all surprised if you heard from the Department of Justice by the end of the day to say that a certain court order had been annulled.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EJonton smiled at their reactions before disappearing into the crowd.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“In the meantime,” said Matsen, “I suggest you call your lawyer back home and get them to send over that power of attorney certificate Val signed, so that if he comes back you’re ready to face him head-on.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You really think he’d come back after what just happened?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Any rational person wouldn’t, but think about this: of all the places Dilgas could be, the day before the election that decides if he remains Governor or not, he came here; either he thinks there’s some significant political gain to be had from this whole escapade, or else he considers this to be more important than re-election, which is probably even more worrying.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ENat’s stomach growled again, audible even over the noise of the crowd.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“OK, OK, I’ll get some breakfast now, quiet down,” she said, looking down at her midriff.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I thoroughly concur with your assessment. Sorry to run off so soon, but I’m guessing you’ll be sticking around for a while so how about we catch up over a coffee this afternoon? It’s been lovely to see you again Matsen.” Martin said, offering his hand which Matsen shook.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You too Martin, and I’ll take you up on that coffee- if you’re paying.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Just be careful not to put your second appendix on the shelf beside the first one or you’ll wake up one morning with a dozen little appendices wriggling across the floor.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You think I have it pickled in a jar?” Matsen asked, amused.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Sure- what’s the point in having an obscure organ removed if not to keep it in a jar and get rid of unwelcome houseguests by showing it off to them.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EMatsen burst out laughing, then winced again. “Don’t make me laugh, it hurts.” She thought for a moment. “You know, you never did tell me this little lady’s name.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Sasha. Say bye-bye, Sasha.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Iyaaaaa!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Close enough.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EMartin and Nat headed off through the crowd and within minutes were walking through a leafy park, surrounded by well-tended flowerbeds and the sound of birdsong. It was an idyllic place, the hustle and bustle of the city muted behind high hedgerows, and despite normally having no time for such frivolities as chirpy birds and pretty flowers Nat could feel that coiled lump of tension in her chest slowly start to loosen up and dissipate. Sasha found the whole experience utterly fascinating and yet infuriating at the same time, all those sights and sounds and smells kept tantalisingly out of reach (and out of her mouth).\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ENat was initially sceptical of the rather run-down little café that Martin led her to, sandwiched between a bookshop and an office block, and once inside her opinion didn’t improve much as she took in the dilapidated furnishings and faded paintwork.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EAnd then she took a bite of triple-cooked djan chip, and her mouth exploded into riotous celebration at the cheesy, spicy deliciousness. Martin smiled in amusement as he watched her demolish an entire bowl almost without pausing for breath, then had to defend his own bowl from pilfering fingers.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“See? I told you they were good,” Martin said as Nat licked her fingers clean.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Good? They’re amazing! Why haven’t I heard of these before?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“It’s just one of life’s big mysteries. How does something like this remain an obscure delicacy, but making a “pizza” using a big slice of cauliflower as the base become a worldwide phenomenon?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I think I’ll just stick to cheesy djan chips, thanks. Val would love these.” Nat’s smile faded and she looked down at the battered ring on her finger. “A couple of weeks ago we were picking out curtains for the new nursery room and arguing about whether you should put tea into milk or milk into tea. She was going to retire from spaceflight after this mission and stay at home with us for a while, but now… it all seems so pointless.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EShe started subconsciously twirling the bent and battered ring around her finger.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I tried to talk her out of flying this mission- she wasn’t even supposed to be on it but she talked Gene into letting her fly one last time before she hung up her helmet for good.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EShe looked up guiltily.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Sorry, you have enough to worry about without me dumping all my problems on you as well.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Don’t be- sounds like you needed to get some things off your chest.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThey sat in silence for a while, then Martin had an idea.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I know what’ll make you feel better.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EHe scooped Sasha out of her carrier and plonked her down on the table in front of Nat.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Take your finger, put it in your mouth like so, and-“ he demonstrated, producing a loud popping noise that made Sasha giggle. A pop from Nat was enough to set her off in that infectious laughter only babies can produce and they spent several minutes trying, with very little success, to keep popping; it was very hard to do while laughing, but Sasha was in hysterics and didn’t care in the slightest if they actually made the noise or not.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You’re absolutely right- I feel much better now,” Nat said, wiping the tears from her eyes. “Thanks.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Don’t thank me,” Martin replied.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Then thank you, Sasha.” Sasha gave her a big grin, showing off both of her teeth, then let out a cute little yawn.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EBellies full and spirits lifted, they meandered back through the park towards the hospital, Sasha’s eyes slowly drooping until gravity finally triumphed and she began snoring in an endearingly cute way.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Once more into the breach…” Martin sighed as the approached the hospital’s entrance, still crowded with protesters, news crews and various nosy people wondering what the fuss was about. Their hearts sank when they saw people pointing at them- then shot up again when hundreds- no, thousands- of people began applauding and cheering them. The crowd parted in front of them and a phalanx of riot police formed up like an honour guard to escort them through and into the building.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EAs usual, Sasha slept through the whole thing.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThey were greeted at the reception by Matsen and Jonton, both grinning broadly.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“What’s going on?” Martin asked.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Haven’t you heard?” Matsen interpreted their puzzled looks to mean they had not. “The Estovus Bureau of Investigations has begun formally investigating Dilgas for all manner of illegal deeds. Everything that happened here earlier was livestreamed by at least three people, and it turns out having your past crimes publicly revealed by TV’s Judge Jonton is a pretty good way of crashing your poll ratings- he’s down by over a third since this morning and it looks like his chances of re-election are dwindling to nothing.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“And while we’re on the topic of good news- you’ll be glad to hear that a certain court order has been annulled due to overwhelming evidence against the original claim.” Jonton added.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Just like that?” Nat couldn’t believe what she was hearing.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Just like that. If Dilgas has any sense, he’ll drop out of the election and co-operate with the investigation to try and get a reduced sentence; but more realistically, he’ll fight tooth and nail against it, send SHOUTY ALL-CAPS MESSAGES on social media, try to fire anyone who’s involved with the investigation to slow it down and generally do everything he can to weasel his way out of trouble. But as far as you and Val are concerned, you’re home free.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EFor once, Nat was speechless.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Arnold just resigned!” Someone shouted and a round of applause broke out.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Who’s Arnold?” Martin asked.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“The judge who signed that court order in the first place. Not surprising, really, he would have been removed from the Supreme Court anyway.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003ENat suddenly grabbed Jonton and hugged him tightly, something he clearly wasn’t expecting, but he recovered quickly and returned the embrace. She gave Matsen a slightly awkward sideways hug to avoid hurting her before heading for the stairs with Martin and Sasha in tow.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EMartin started to say something but stopped himself.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“What?” Nat asked.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Just a bad pun.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I like bad puns; please, continue.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I was going to say something like, ‘you were getting really stressed out about all this legal drama, but in the end it was a walk in the park’.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EAnd then they reached the second floor, spotted a TV with a breaking news bulletin, and their jaws dropped.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E***\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EUpstairs in the ICU, Gene was pacing restlessly in an attempt to avoid falling asleep again from a combination of emotional exhaustion and jet lag. It took him a few seconds to realise that the tinny buzzing noise he was hearing was his phone ringing.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Hello?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EBobak’s voice came through, echoing slightly as if he was in a conference room using a speaker phone.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We’ve found the launch site.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EGene was immediately wide awake.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Where?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Looks like a disused airbase out in the drylands two hundred kilometres west of Carter station. Turns out an old ballistic missile detection satellite actually spotted the launch, but forty years in space has worn down the solar panels so badly that it had to wait nearly a whole day to charge up its batteries before sending the report. There are teams on their way to the site now, but it’s probably two days too late to find anything useful. Judging by when the debris field was first reported by the crew, it was probably over that launch site when it got hit; for all we know they brought along some telescopes and watched it happen right over their heads.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Wouldn’t Carter station have seen the launch at that range?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“One of the rocket refurbishing contractors got in touch to say that they’re missing a launch rocket that was in their storage area waiting to be refitted. The rocket’s a Papillon­-class by Luciole Space Systems- small, light, fits in a single shipping container if you pack it right. A small rocket like that, flying a standard gravity turn, wouldn’t show much of a signature; Carter wouldn’t have been able to spot it even if they were looking, and their dish was pointed the other way to pick up the signal from the Blue Horizons probe out at Lindor.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“What about Nye and Harvester stations? It would have flown right over them.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We think we know the answer to that too. Some leisure sailboats off the Estovus coast found floating debris with a Luciole logo on it, as well as what we believe is radar reflective paint. Something as small as the second stage on a Papillon with stealth paint, coasting with its engine off? The ground station wouldn’t have a clue.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EStealth paint…\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Once it’s in space, orbiting retrograde and coming directly at Dauntless, all it would need to do is throw a lot of shrapnel around- ball bearings, nuts and bolts, anything small enough that the FOD radar would have a hard time getting returns off it but heavy enough to go through the meteor shields- and we’ve got a potential Kessler syndrome on our hands.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThe full enormity of what had happened hit home. Stealing a booster and shooting it at an orbiting vessel was one thing, but stealth painting a booster so that radar couldn’t see it coming, and leaving debris in orbit to not only hamper any rescue attempt but to effectively ground all future space launches at least until the end of the year… It was nothing short of a declaration of war against the Space Program.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EHad they targeted the Zenith Space Station, or Trailblazer when it was still parked in orbit of Kerbin, it would have completely shut down all space launches for years or even decades. If there could be a silver lining to any of this, it was that nearly all of the debris from both Dauntless and the KST would have been knocked out of orbit along with anything that had collided with either spacecraft, and most of what was left would fall out of the sky fairly quickly as the Mun’s gravity nudged them with each orbit until atmospheric friction inexorably dragged them to destruction.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Tell Walt to release all this information to the press, immediately. Whoever did this tried very hard to make it look like an accident; we need to make sure everyone knows it was deliberate murder.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Will do, boss,” Walt’s voice came over the call, followed by the scraping of a chair and the opening and shutting of a door.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We’ve also located the Dauntless’ crash site, on an island off the Burdari coast about two hundred kilometres north of McAuliffe.” Bobak continued.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EBurdar… Of all the places it could have been, why, oh why, \u003Ci\u003Eoh why!?!?, \u003C/i\u003Edid it have to be Burdar; or the Democratic Kingdom of Glorious Righteous and Blessed People’s Burdarian Republic of Burdar And Affiliated Nations, to use the name that they insisted everyone else should use (or the Burnana Republic as everyone actually called it). They were a spectacularly insular and isolated nation, not because they wanted to be (far from it- they were very keen to share their ‘joyously and righteously glorious’ socio-econo-political system with the rest of the world, as the unfortunate neighbouring states on their shared northern continent had soon discovered) but because some ninety years earlier Supreme Blessed Leader Pete, Knight of Righteousness, Scion of the Kerm, Hero of the Glorious Kingdom Republic, had gotten blind drunk on his ceremonial palace-barge, fallen overboard and been sucked into the propellers; this led to a total moratorium on all forms of motorised device- cars, boats, planes, tanks, yo-yos, even cuckoo clocks were not spared in the purge- that had persisted to this day, simply because the current Supreme Blessed Leader Arlo was too busy gambolling around the gardens of his palace, stark naked but wearing a tea-cosy on his head, making the occasional baa-ing noise and nibbling the odd cabbage leaf to rescind it. Being an island nation surrounded by substantial bodies of open ocean, this was something of a hindrance for them getting anywhere without mechanical power, though they also liked to think that the reverse was also true and that the ocean protected them from the plotting, scheming world who was always rumoured to be preparing an invasion; this was of course utter nonsense- the rest of the world simply didn’t care enough to bother invading and didn’t particularly like the idea of sending in jets and tanks to fight dirt-poor peasants armed with little more than pointy sticks and badly translated insults.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EDropping a wrecked Dynawing on their territory would be a political headache for the highest levels of the Unity government, who would be all too happy to drop the unenviable task of travelling out there and sweet-talking the upper echelons of Burdari society, offering many profuse apologies and presenting a variety of gifts as compensation for the grievous insult to Burdari sovereignty, straight into Gene’s lap.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“…by a deep sea trawler last night-“ Bobak was still talking and Gene had to drag his focus back on topic.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Sorry, say that again?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We’ve got confirmation on Firebird’s nuclear engines. The crew on a trawler spotted them floating in the ocean and tried to pull it out the water but nearly capsized themselves with the weight. A team of radiation specialists flew out by helicopter at first light this morning and are keeping an eye on it, but so far no radiation leaks have been detected- looks like the emergency protocol worked exactly as designed- and we have a floating crane and a cargo ship on their way out to recover them to land so they can be fully checked over.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“That’s a relief; the last thing we need right now is radioactive contamination on top of everything else.” One item crossed off Gene’s very long mental list of problems. “What about the rest of the debris?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We’ve had hundreds of reports of debris spotted in the sky, most of it burning up before it got to ground level, but we’re expecting most of Dauntless’ thermal tiles to survive re-entry and fall to the surface relatively intact, with a small but significant risk of debris landing on someone or something on the ground. The models we’ve run so far suggest that most of those should have already come down by now and the rest by the end of the week.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EGene glanced up, stared in horrified fascination, then cut Bobak off mid-sentence with “I’ll call you back.” Drawn inexorably to the TV in the corner, he approached and turned the volume up to hear the breaking news report. The news anchor was clearly surprised by the news he was reading but managed to keep his voice and face neutral.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Sources in Romana’s campaign team have strongly refuted the allegations against her, telling our reporter that all campaign finances are meticulously documented and independently audited. They have also released a statement saying that ‘the despicable and cowardly actions by Dilgas and his appointed cronies to illegally steal this election will not be tolerated, and all avenues of legal action will be explored and exhausted to thwart this heinous crime against all Estovans and the entire world beyond’. This statement also urges supporters to continue to cast their votes for Romana tomorrow, by writing in her name if it has been removed from the ballots, and calls for supporters of other candidates to unite behind her to ensure that this outrageous scheme will not succeed.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EA short time ago, Dilgas’ campaign also released a statement warning that any votes for an illegitimate candidate would not be counted and would be considered spoiled ballots, as well as condemning ‘the rampant hypocrisy of calling a political opponent corrupt whilst siphoning donations to a charitable foundation to fuel a political campaign’.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EGene continued to listen to the report with growing dread.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“We cross now to our reporter Kerny, who is outside Northill Hospital. Kerny, what’s the situation over there?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EIt was hard to hear the on-scene reporter over the sound of many angry people.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Well, Stan, the mood here has turned decidedly darker since this announcement was made. There have already been scuffles between different groups of protesters and the hospital has had to close its doors to emergency patients after a group armed with baseball bats and other makeshift weapons tried to force their way inside through the ambulance bay. There’s still no official word from the Space Program regarding the condition of veteran astronaut Valentina or her rookie rescuer Martina and so far hospital staff have remained tight-lipped, though they have confirmed that the aircraft seen landing on the helipad late last night were carrying Yeager Space Complex’s reserves of O-negative blood as well as a number of staff who had volunteered to donate more to make up a shortfall in the hospital’s own blood bank. There’s still no official word on the stand-off between Dilgas, TV’s Judge Jonton and-”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EWithout warning a group of protesters surged forwards, charging down their opponents and instigating a huge fistfight. Kerny and his cameraman beat a hasty retreat as the violence spread and the feed cut back abruptly to the news studio and a visibly worried Stan.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“That was Kerny Kerman reporting from Northill Hospital.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Can you believe this?!” Natalia almost shouted as she entered the room. “That slimy, cheating…” She cut herself off with some effort. “No. I’m not wasting my breath on him any more; he doesn’t deserve it.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You actually think this is Dilgas’ doing?” Davlos asked as he joined them. Gene gave him a scathing look.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“He turns up here and tries to steal control of Val’s care, but instead manages to completely destroy his own election campaign and tank his poll numbers, then magically within the hour a massive scandal strikes his political adversary, ruling her out of the election by a rule that he created just for that purpose and effectively guaranteeing that he’ll win, and you think that’s just a coincidence?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Well…”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You said it yourself- he can’t stand losing. Considering what happened today, is it really such a stretch to think that he’d fabricate evidence of a crime to effectively guarantee re-election and avoid getting arrested and thrown in jail for the rest of his life?”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I should have known it wouldn’t be that easy.” Nat said, her voice laden with bitter disappointment. “It never is, when the psycho ex shows up and tries to force their way back in. I should have known!”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EThat last word was unexpectedly loud, making everyone jump and startling Sasha awake, blinking in confusion.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“Why are you blaming yourself again? None of this is your fault.” Gene tried to reassure her, but she was having none of it.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“You don’t get it. I spent half of my adult life bouncing from one toxic relationship to the next; since I’ve known Val I’ve had three exes showing up unannounced and trying to cause trouble, and every time Val was there to back me up and chase them off. Every time. And now that it’s my turn to do the same for her, how do I repay her? By sticking my oar in and making everything worse!\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EBarring some kind of miracle, he’s going to get re-elected, and how long do you think it’ll take before he comes back here, flanked by stooges and sycophants, to try again? Because I’m pretty sure it’s less time than it’ll take for Val to wake up, if…” She couldn’t finish the sentence.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EFor a moment it looked like she was about to start venting her feelings on the furniture again, but the urge was fleeting.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E“I won’t let him take her.” There was an ominous edge in her voice, one that made everyone move back slightly. “No matter what else happens, \u003Ci\u003EI will not let him take her\u003C/i\u003E.”\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003EDavlos scurried out of her way as she marched towards Val’s room, leaving a tense silence behind.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial, Helvetica, sans-serif;\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/193699-audacity-memoirs-of-a-kerbonaut/\u0026amp;do=findComment\u0026amp;comment=4002030\u0022 rel=\u0022\u0022\u003EChapter 16\u003C/a\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-09T17:45:27Z\u0022 title=\u002207/09/2021 05:45  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 9, 2021\u003C/time\u003E by jimmymcgoochie\u003C/strong\u003E\n\u003Cbr\u003ELink to next chapter\n\u003C/span\u003E\n"},{"CreatedByName":"GuessingEveryDay","CreatedById":203507,"CreatedDateTime":"2021-04-12T17:21:46Z","Content":"\n\u003Cp\u003E\nA new chapter is out, and it\u0027s amazing! I can\u0027t believe I forgot about the age stuff!\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2021-04-12T20:38:52Z","Content":"\n\u003Cp\u003E\nTriple-cooked djan chips with cheese - now there\u0027s a\u003Cem\u003E real\u003C/em\u003E kerbonaut breakfast! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I think Jonton would be proud of his namesake too.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOn a more serious note - great chapter. Things are really heating up along two story threads!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOh - and making that \u0027pock\u0027 noise by flicking a finger in your cheek. Totally reliable way of distracting babies - can confirm.  I really enjoyed that scene, it brought back good memories.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-04-12T21:02:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223953391\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618259932\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTriple-cooked djan chips with cheese - now there\u0027s a\u003Cem\u003E real\u003C/em\u003E kerbonaut breakfast! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I think Jonton would be proud of his namesake too.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOn a more serious note - great chapter. Things are really heating up along two story threads!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOh - and making that \u0027pock\u0027 noise by flicking a finger in your cheek. Totally reliable way of distracting babies - can confirm.  I really enjoyed that scene, it brought back good memories.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI just re-re-read First Flight, so if you see anything that looks oddly familiar... \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe cafe scene was a pretty late addition, it just didn’t flow well when they arrived, ate and left again in a few paragraphs; glad you liked it!\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2021-04-13T07:32:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223953404\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618261358\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI just re-re-read First Flight, so if you see anything that looks oddly familiar... \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s all good - and I\u0027m delighted that you re-read \u003Cem\u003EFirst Flight\u003C/em\u003E. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Noah Foloni","CreatedById":209396,"CreatedDateTime":"2021-04-14T20:43:54Z","Content":"\n\u003Cp\u003E\nNOOOOOOOOOO i hit the end!\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSheridan","CreatedById":170462,"CreatedDateTime":"2021-04-14T23:07:24Z","Content":"\n\u003Cp\u003E\nAbsolutely brilliant chapter and it was absolutely worth waiting as long as it took \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Thank you \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Didn´t saw comming such a political storyline \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Wizard Kerbal","CreatedById":209063,"CreatedDateTime":"2021-04-15T04:43:45Z","Content":"\n\u003Cp\u003E\nJust a (few)question(s):\n\u003C/p\u003E\n\u003Cp\u003E\nHow old is Tina as of the Dynawing backwards landing, and now?\n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s an artzoska, \n\u003C/p\u003E\n\u003Cp\u003E\nI had one else but fogot\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-15T14:11:02Z\u0022 title=\u002204/15/2021 02:11  PM\u0022 data-short=\u00223 yr\u0022\u003EApril 15, 2021\u003C/time\u003E by Wizard Kerbal\u003C/strong\u003E\n\u003Cbr\u003EI remember my third question! I looked up the Lindor-5, but the only one I found optimized for your save file had a tiny first stage relative to the Acapello. So, is that the right one, or do you have a different version I can see?\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-04-15T10:26:35Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/209063-wizard-kerbal/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022209063\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/209063-wizard-kerbal/\u0022 rel=\u0022\u0022\u003E@Wizard Kerbal\u003C/a\u003E:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nTina is 9 in Chapter 1, 15 (and a half, ish) in chapters 2 and 3 and 17 from chapter 8 onwards; on a regime-related note, a Kerbal pregnancy lasts 9 \u003Cs\u003Emonths\u003C/s\u003E munths, or more accurately around 40 weeks, as for humans (though a Kerbin day is 12 rather than 24 hours so it’s half as long in terms of seconds).\n\u003C/li\u003E\n\u003Cli\u003E\nI refer you to the source: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/113974-whispers-of-the-kraken-epilogue-revelations-of-the-kraken/\u0022 rel=\u0022\u0022\u003Ehttps://forum.kerbalspaceprogram.com/index.php?/topic/113974-whispers-of-the-kraken-epilogue-revelations-of-the-kraken/\u003C/a\u003E (It’s the second in a trilogy so best to start with the first one; they’re well worth the read, though the third is only partly finished (and unclear when or even if it will be continued again \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E). While you’re at it, read this too: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-epilogue-and-last-thoughts/\u0022 rel=\u0022\u0022\u003Ehttps://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-epilogue-and-last-thoughts/\u003C/a\u003E - First Flight and the Kraken trilogy were a big inspiration for me to start writing Audacity and I highly recommend both; honourable mention for Emiko Station too, and there are many more KSP-based stories out there for you to fill the time between my glacially slow updates here (\u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E). Most of those will be listed here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/59234-the-fan-works-library/\u0022 rel=\u0022\u0022\u003Ehttps://forum.kerbalspaceprogram.com/index.php?/topic/59234-the-fan-works-library/\u003C/a\u003E, but a quick trawl through the fan works section of the forums could turn up a hidden gem or two.\n\u003C/li\u003E\n\u003C/ol\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-05-12T22:03:37Z","Content":"\n\u003Cp\u003E\nHas it really been a year since I started this story? Back then we were only into the \u003Cem\u003Efirst\u003C/em\u003E lockdown; since then we\u0027ve had Lockdown 2: Electric Boogaloo; Lockdown 3: This Time It\u0027s Personal (Protective Equipment) and possibly Lockdown 4: A New \u003Cs\u003EHope\u003C/s\u003E Normal.\n\u003C/p\u003E\n\u003Cp\u003E\nI can honestly say that when I wrote the first chapter I wasn\u0027t expecting the story to end up where it is now, and while it\u0027s been a bit of a slog trying to get the recent chapters done (and I expect that to be the case for the next few as well, sadly) I\u0027m hoping that Tina\u0027s tale has many more years of life left in it yet.\n\u003C/p\u003E\n"},{"CreatedByName":"Souptime","CreatedById":204451,"CreatedDateTime":"2021-05-14T10:22:23Z","Content":"\n\u003Cp\u003E\ni would like to put in my pre-order for the hardcover version of this\n\u003C/p\u003E\n\u003Cp\u003E\ni mean, seriously, this is an AMAZING piece of literature\n\u003C/p\u003E\n\u003Cp\u003E\nbut there\u0027s only 1 thing that irks me but that\u0027s not directed to you or the story as a whole\n\u003C/p\u003E\n\u003Cp\u003E\njust the whole \u0022You can marry at 16\u0022 thing is just weird to me as an american, but it would make sense as kerbal years months and weeks are basically half of the real world, so it doesnt make sense to ME, but it makes sense to the whole canon\n\u003C/p\u003E\n\u003Cp\u003E\nthat being said dilgas marrying val when she was 13 is a yikes from me, both as an american and seemingly in the canon\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nkedophile?\n\u003C/p\u003E\n\u003Cp\u003E\nplz no man it is wordplay 100\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\ncant wait for the next one! will you do anything for KSP 2 or will that stay out of the canon (If the story lasts that long)\n\u003C/p\u003E\n\u003Cp\u003E\ni see lindor got into the story, what modded things are withing the universe of Audacity?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nand i remember a mention of a forum user \u003Cem\u003E\u003Cstrong\u003Emaybe\u003C/strong\u003E \u003C/em\u003Ebeing added as a cameo, cant wait for my debut as a bowl of hospital food \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E (Joke obvs)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"JoeSheridan","CreatedById":170462,"CreatedDateTime":"2021-05-14T13:21:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223971308\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221620857017\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/13/2021 at 12:03 AM, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHas it really been a year since I started this story?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow.. really? Such a long time? But yeah..  it´s even about 7 Months since i found this nice project of yours and i still look on in every few days to look for an update \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Keep it up, please.\u003Cbr\u003E\u003Cbr\u003E\nAnd you thing it goes many more years? PLEASE YES and:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223972094\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221620987743\u0022 data-ipsquote-userid=\u0022204451\u0022 data-ipsquote-username=\u0022Souptime\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Souptime said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni would like to put in my pre-order for the hardcover version of this\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt´s not only you who would buy that. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nI really wonder if the KSP publisher would authorize this fanproject as a licensed one...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003Ejust the whole \u0022You can marry at 16\u0022 thing is just weird to me as an american, but it would make sense as kerbal years months and weeks are basically half of the real world, so it doesnt make sense to ME, but it makes sense to t\u003C/span\u003E\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003Ehe whole canon\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ndoens´t sound so weird to me. I am from germany and here the \u0022normal\u0022 age is 18 too but age 16 is possible. They have to get a certificate that they are mentaliy grown up enough to reasonably decide about getting married and than they can do it. But i really don´t know how often that happens.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-05-14T13:27:12Z\u0022 title=\u002205/14/2021 01:27  PM\u0022 data-short=\u00223 yr\u0022\u003EMay 14, 2021\u003C/time\u003E by JoeSheridan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-05-14T13:56:03Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204451\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0022 rel=\u0022\u0022\u003E@Souptime\u003C/a\u003E I looked it up, and it turns out that my home nation Scotland is a bit of an outlier in that the age of majority (legal adulthood) is 16- everywhere else in the EU (and the UK) it’s 18, though many of those (including the rest of the UK) will allow marriage at 16 under certain specific conditions.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nI feel a bit like I’m trying to close the gate after the cat has bolted out of the bag, but I’ve already burnt that bridge after I crossed it so it’s too late now.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nNow that I’ve got the malaphors out of my system...\n\u003C/p\u003E\n\u003Cp\u003E\nRe. mods, so far I’ve mentioned several Near Future mods (Aeronautics and Launch Vehicles mostly, though others were on my mind when I wrote some details of spacecraft), Cryo Tanks and Engines, Mk-33, Mk4, Luciole, X-20, SSPX, SCANsat and JNSQ of course. There could be more that I’ve forgotten, it’s been a while and I’ve played various different KSP games since I started playing KSP- stock, stock with OPM, JNSQ, stock with Kerbalism, \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E/\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1...\n\u003C/p\u003E\n\u003Cp\u003E\nThat being said, I don’t necessarily intend to ensure that everything I talk about has a real KSP analog- for example the Lindor V is essentially a Kerbal Saturn V with three stages and burning hydrogen in the second and third stages (the stock\u002BMH Acapello only has 2 stages and wouldn’t make it to Kerbin orbit in JNSQ) and the Trailblazer is loosely based on a design I used in a career game in JNSQ to go to Duna, though that ship had zero life support because I wasn’t using a LS mod in that game.\n\u003C/p\u003E\n"},{"CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-05-25T00:18:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223972094\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221620987743\u0022 data-ipsquote-userid=\u0022204451\u0022 data-ipsquote-username=\u0022Souptime\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/14/2021 at 4:22 AM, Souptime said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni would like to put in my pre-order for the hardcover version of this\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSame. I’ll take 1.\n\u003C/p\u003E\u003Cp\u003E\nThis is kind of confusing though because I read the first chapter and my mind kept autocorrecting Dynawing to Shuttle\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-06-01T20:54:59Z","Content":"\n\u003Cp\u003E\nThe next chapter is shaping up nicely. In the meantime, though, I was re-reading my own story and noticed something in Chapter 1 that I didn\u0027t notice before, definitely didn\u0027t plan, but which totally works for the story now so I\u0027m using it.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThe crew of the \u003Cem\u003EDynamic\u003C/em\u003E in Chapter 1 were Jeb, Val, Doodul... and Nat \u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon2.png\u0022 title=\u0022:o\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-06-01T21:10:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223982687\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221622580899\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe next chapter is shaping up nicely. In the meantime, though, I was re-reading my own story and noticed something in Chapter 1 that I didn\u0027t notice before, definitely didn\u0027t plan, but which totally works for the story now so I\u0027m using it.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThe crew of the \u003Cem\u003EDynamic\u003C/em\u003E in Chapter 1 were Jeb, Val, Doodul... and Nat \u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon2.png\u0022 title=\u0022:o\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI thought Nat Kerman was Bill/Bob, but no, it was Nat.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204451\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0022 rel=\u0022\u0022\u003E@Souptime\u003C/a\u003E, you got a cameo. It was the free hospital food \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-06-01T22:50:27Z\u0022 title=\u002206/01/2021 10:50  PM\u0022 data-short=\u00223 yr\u0022\u003EJune 1, 2021\u003C/time\u003E by Admiral Fluffy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Souptime","CreatedById":204451,"CreatedDateTime":"2021-06-24T21:29:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223982694\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221622581856\u0022 data-ipsquote-userid=\u0022210816\u0022 data-ipsquote-username=\u0022Admiral Fluffy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/1/2021 at 5:10 PM, Admiral Fluffy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204451\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0022 rel=\u0022\u0022\u003E@Souptime\u003C/a\u003E, you got a cameo. It was the free hospital food \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni did?! i missed it!\n\u003C/p\u003E\u003Cp\u003E\nim trying to find itttt\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-06-24T21:36:23Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210816-admiral-fluffy/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022210816\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210816-admiral-fluffy/\u0022 rel=\u0022\u0022\u003E@Admiral Fluffy\u003C/a\u003E \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204451\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0022 rel=\u0022\u0022\u003E@Souptime\u003C/a\u003E Funnily enough, I actually wrote a bit about it being \u0022soup time\u0022 in the story, but I haven\u0027t got that far yet (it would be in 2 chapters\u0027 time) and now that you\u0027ve gone and spoilt the surprise... \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Souptime","CreatedById":204451,"CreatedDateTime":"2021-06-24T21:38:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223994515\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221624570583\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210816-admiral-fluffy/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022210816\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/210816-admiral-fluffy/\u0022 rel=\u0022\u0022\u003E@Admiral Fluffy\u003C/a\u003E \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204451\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0022 rel=\u0022\u0022\u003E@Souptime\u003C/a\u003E Funnily enough, I actually wrote a bit about it being \u0022soup time\u0022 in the story, but I haven\u0027t got that far yet (it would be in 2 chapters\u0027 time) and now that you\u0027ve gone and spoilt the surprise... \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSOUPrise\n\u003C/p\u003E\n\u003Cp\u003E\ni\u0027ll see myself out the door...\n\u003C/p\u003E\n\u003Cp\u003E\nand i cant add anymore heckin likes \u0026gt;:(\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022like_1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022256\u0022 width=\u0022256\u0022 src=\u0022https://kerbal-forum-uploads.s3.us-west-2.amazonaws.com/reactions/like_1.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-06-24T21:39:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223953281\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221618247906\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/12/2021 at 11:18 AM, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n“OK. Free hospital food is still free food.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204451\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0022 rel=\u0022\u0022\u003E@Souptime\u003C/a\u003Ethere it is\n\u003C/p\u003E\n"},{"CreatedByName":"Souptime","CreatedById":204451,"CreatedDateTime":"2021-06-24T21:40:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223994517\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221624570799\u0022 data-ipsquote-userid=\u0022210816\u0022 data-ipsquote-username=\u0022Admiral Fluffy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Admiral Fluffy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204451\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204451-souptime/\u0022 rel=\u0022\u0022\u003E@Souptime\u003C/a\u003Ethere it is\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\no\n\u003C/p\u003E\n"},{"CreatedByName":"Admiral Fluffy","CreatedById":210816,"CreatedDateTime":"2021-07-07T23:23:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223782133\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221588890811\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/7/2020 at 4:33 PM, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThread of the month! Thanks, kind nominee (whoever they were- let me know and I\u0027ll give you a cameo part \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHa ha yes I get a cameo mwahahaha \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-08T21:56:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224001167\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625700186\u0022 data-ipsquote-userid=\u0022210816\u0022 data-ipsquote-username=\u0022Admiral Fluffy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Admiral Fluffy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHa ha yes I get a cameo mwahahaha \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou haven\u0027t seen it yet... \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext chapter is nearly ready, I plan to post it tomorrow once I\u0027ve gone through and proofread it from beginning to end.\n\u003C/p\u003E\n"},{"CreatedByName":"Wizard Kerbal","CreatedById":209063,"CreatedDateTime":"2021-07-08T22:53:01Z","Content":"\n\u003Cp\u003E\nApparently there\u0027s a ghost upstairs.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m definitely \u003Cem\u003Enot \u003C/em\u003Ere-reading this story, playing calming music and holding, let\u0027s say, a 1-pronged fork.\n\u003C/p\u003E\n\u003Cp\u003E\nAHHHHHHH WHAT THE HECK APPLE MUSIC THIS IS NOT CHILLING MUSIC.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-08T23:35:21Z\u0022 title=\u002207/08/2021 11:35  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 8, 2021\u003C/time\u003E by Wizard Kerbal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"obnox twin","CreatedById":208205,"CreatedDateTime":"2021-07-09T01:13:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224001628\u0022 data-ipsquote-contentid=\u0022193699\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625781367\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou haven\u0027t seen it yet... \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext chapter is nearly ready, I plan to post it tomorrow once I\u0027ve gone through and proofread it from beginning to end.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI can\u0027t wait I love this story this is really great and well made Please countion this (Spelling is not good)\n\u003C/p\u003E\n"}]}