{"TopicId":225297,"ForumId":39,"TopicTitle":"Driti-Kohlian War, First year","CreatedByName":"total","CreatedById":46205,"CreatedDateTime":"2024-07-01T22:06:24Z","PageNum":1,"Articles":[{"CreatedByName":"total","CreatedById":46205,"CreatedDateTime":"2024-07-01T22:06:24Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003EIntroduction\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI have been running a turn-based multiplayer strategy wargame in KSP for the past few months and we just recently finished the first year of in-game time (thought the first year only started in April). The game is set during the ww2 period and simulates armed conflict between the fictional countries of the Federal Republic of Dritland and the Kingdom of Kohlia. The players  get to build their own war machines with era appropriate parts provided from several different mods, then allocate their countries industrial capabilities into constructing their creations and then issuing commands to their troops, the commands are then simulated by the GM (that\u0027s me) on their computer and the results of the actions are relayed back to the players. The game has a dedicated Discord server were it is run and we are looking to recruit more members. It is recommend you have experience with mods such as BDarmory, and \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E,  as well as interest in strategy gaming and ww2 era conflict but none of these are strictly required.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003EThe War so far\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EBefore May 1939\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTension between Dritland and Kohlia has been growing for the past several years due to a variety of factors such as; introduction of increasing trade tariffs, differing ideologies, border and territorial water disputes and Dritland supporting the overthrow of the Drosian monarchy. Both countries started increasing their military spending. In Dritland the military high command has taken an active part in administering the country however it is not a full military dictatorship. In Kohlia the king felt that the parliament was holding his country back and decided to dismiss them, turning the country into an absolute monarchy.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UrncaVz.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.31\u0022 height=\u00221139\u0022 width=\u00221042\u0022 src=\u0022https://i.imgur.com/UrncaVz.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EMay 1939\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOne early April morning a flight of Kohlian fighters spotted a large aircraft with Dritian markings flying into Kohlian airspace north-west of the Kohlian city of Egnardo. Kohlia claims that when the fighters approached the plane to investigate they identified it as a Drit bomber and that the bomber opened fire on them first. Dritlands\u0027 ministry of truth claims that the bomber was on an exercise flight and was not carrying any bombs when it drifted into Kohlia due to a navigational error. Whatever the truth is in reality, this incident caused a major diplomatic incident between the two already diplomatically strained countries. In less than a week Dritland officially declared war and advanced its ground forces from their northern military base of Camp Zhelak into Kohlia where they were met by a similarly sized Kohlian force. After an intense opening exchange to the war the Dritian forces claimed an convincing victory in the battle and were the first to occupy enemy territory. Perhaps emboldened by their success in the north Dritian generals ordered their forces to take the Kohlian military base Base Cerberus in the south but there their advance was stopped by the bases defenders.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg data-ratio=\u0022109.31\u0022 width=\u00221042\u0022 alt=\u0022ZlcfItH.png\u0022 src=\u0022https://i.imgur.com/ZlcfItH.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EJune-October 1939\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn the period after the initial engagements the war cooled down somewhat and the front lines became largely static and no large battles took place. Many feared that the war wound turn into a long, static and bloody conflict like the Great War of the east a few decades ago did. However several scouting actions, bombing raids, artillery bombardments and smaller attacks did take place in several locations across the two countries. Particularly the Dritian bomber fleet was used to bombs several enemy cities in an attempt to diminish the Kohlian war industry. These attacks in turn caused Kohlia to deploy a large number of AAA units in an attempt to defend their cities from these bombing raids. Though in the middle of a war both sides manage to find time to participate in the Illustrious Jacques Kerman Air Speed Trophy with both constructing a racing plane. The Kohlian W1K2 Warbler coming out on top with an average speed of over 690 km/h.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cPRGpSB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.31\u0022 height=\u00221139\u0022 width=\u00221042\u0022 src=\u0022https://i.imgur.com/cPRGpSB.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ENovember 1939\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKohlia attempts to take back their occupied territory in the north with an attack in the north, the attack is not successful in taking the tile back from the Dritian forces. Not being discouraged by the setback in the north, a large Kohlian combined arms force cross into Dritland from Base Cerberus and are met by the Dritian vanguard. The battle of the Ste Olga plain is so far the largest engagement fought in this war and the largest battle since the Great War of the east. After lengthy fighting and heavy losses the Kohlian forces manage to even out the score by also managing to advance into and occupy Dritian territory. In a later report a Dritian sergeant swears that they saw the Kohlian  W1K2 Warbler racing plane with bombs strapped to it drop them and then getting shot down in the battle but this report has not been able to be verified.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BUhar3Z.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.31\u0022 height=\u00221139\u0022 width=\u00221042\u0022 src=\u0022https://i.imgur.com/BUhar3Z.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EDecember 1939\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the chaos of the last month the chilly month of December is relatively calm as the rival forces decide to throw shells in lieu of men at the enemy. in the factories of the warring parties workers prepare to construct new machines of war with the soon to be unlocked components from 1940 and in the military bases of the countries interviews for new generals are being conducted....\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LnRuPEa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022109.31\u0022 height=\u00221139\u0022 width=\u00221042\u0022 src=\u0022https://i.imgur.com/LnRuPEa.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003EWishing to Join?\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJoin the discord here:  \u003Ca href=\u0022https://discord.gg/m9g44nkS\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://discord.gg/m9g44nkS\u003C/a\u003E (Valid until: 10.7.2024)\n\u003C/p\u003E\n\u003Cp\u003E\nPlease bravely announce your joining in general and feel free to ping the gm if you have any questions.\n\u003C/p\u003E\n\u003Cp\u003E\nA little bonus:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HCzAM6K.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002234.56\u0022 height=\u0022377\u0022 width=\u00221091\u0022 src=\u0022https://i.imgur.com/HCzAM6K.png\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2024-07-01T23:04:39Z","Content":"\n\u003Cp\u003E\nWere any kerbals harmed in the making of this post? I\u0027m wondering whether it belongs in Mission Reports or Fan Works. \n\u003C/p\u003E\n"},{"CreatedByName":"total","CreatedById":46205,"CreatedDateTime":"2024-07-01T23:41:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224403389\u0022 data-ipsquote-contentid=\u0022225297\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221719875079\u0022 data-ipsquote-userid=\u002227914\u0022 data-ipsquote-username=\u0022Vanamonde\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, Vanamonde said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWere any kerbals harmed in the making of this post? I\u0027m wondering whether it belongs in Mission Reports or Fan Works. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003E\nThe kerbals are just unconscious because they are sleeping I promise. I wasn\u0027t really sure which board would be the most appropriate to this content and I figured Discussions would be pretty good. I guess \u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003EFan Works is closer of the 2 so would you please move the thread over there.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2024-07-02T00:11:23Z","Content":"\n\u003Cp\u003E\nAnd moved. Enjoy yourself. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"bobby72006","CreatedById":180503,"CreatedDateTime":"2024-07-02T18:49:08Z","Content":"\n\u003Cp\u003E\nTo the NAVAL guy on the discord, I don\u0027t have my discord phone verified.\n\u003C/p\u003E\n"},{"CreatedByName":"bobby72006","CreatedById":180503,"CreatedDateTime":"2024-07-06T04:16:53Z","Content":"\n\u003Cp\u003E\nFigured out a solution, discord has more reasonable verification now.\n\u003C/p\u003E\n"},{"CreatedByName":"Iapetus7342","CreatedById":233205,"CreatedDateTime":"2024-07-15T19:26:06Z","Content":"\n\u003Cp\u003E\nI see the HL2 references with Nova Prospekt and White Forest.. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\n\u003C/p\u003E\n"}]}