{"TopicId":29474,"ForumId":39,"TopicTitle":"What if there was a war for the Kerbol system? (You write it!)","CreatedByName":"Bigcheecho","CreatedById":68020,"CreatedDateTime":"2013-05-27T08:33:20Z","PageNum":3,"Articles":[{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-06T20:08:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bigcheecho\u0022 data-cite=\u0022Bigcheecho\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKapan Rebel Alliance\u003C/strong\u003E\u003C/span\u003E\u003Cp\u003EThe Kapan Rebel Alliance is a rebel alliance formed in Kerbin. Like the UMP and MLF, they desire an end to this war. Unlike the rebel factions, however, they have red matter warheads, stronger than Evian antimatter. Only problem is, it takes 20 years to produce even a milligram of it. They only have 1 RM warhead left, and they hope to fire it into Kerbin. They have an expertise in spying, stealing all of Eve\u0027s red matter a few months before the Evians discovered how to produce 100 kilograms of antimatter in 5 minutes. Will they use their last warhead wisely? Will they gain independence? Will they stand the test of time?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWrong. They got only one miligram of it left. That\u0027s equal to 1000 1picogram warheads anyways.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAt Kra\u0027s Underwater Base \u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAfter the Eve Red Matter Attack, the KRA council voted for what they would do with that 1000 picograms of redmatter. They decided to rip jool in half.\u003C/p\u003E\u003Cp\u003EKirke : Guys, go capsule 2 pico-redmatter warheads. Prepare the ICBM and send it to the station.\u003C/p\u003E\u003Cp\u003EBilly-Bobman : Kirke! What are you doing bro?\u003C/p\u003E\u003Cp\u003EKirke looked at Billy\u0027s face saying : Who are you?\u003C/p\u003E\u003Cp\u003EBilly : I\u0027m one of the manned fleet ships commander, sir.\u003C/p\u003E\u003Cp\u003EKirke : AH. So, we are going to make a giant boom in Jool\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E2 weeks later, with the ICBM charged, and full of one precius picogram of RM, fully fueled departed to jool. Unfortunately, Duna\u0027s gravity captured it. Kirke, thinking that 1 picogram was overpowered, tought \u0022There goes the red planet.\u0022. Do you know that giant crater near the south pole? Yes, Kirke made it. Just a bit of kerbals lost anyways.\u003C/p\u003E\u003Cp\u003EKirke : The KRA does NOT care about kerbals. We care about profit.\u003C/p\u003E\u003Cp\u003EThen, he runned to the satelite dish station.\u003C/p\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-06-06T20:24:24Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003EKerbal Space Ship Snackatron\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESomewhere near Eeloo..\u003C/p\u003E\u003Cp\u003E\u0022Damn, there\u0027s barely any Baby Kerman bars on board.. Thanks Jeb.\u0022 Bill says to Jeb after finding out that Jeb ate all the snacks during the trip to Eeloo.\u003C/p\u003E\u003Cp\u003E\u0022Don\u0027t worry. The snacks aren\u0027t a big threat, not bigger than the war in the Kerbol system that is.\u0022 Jeb replies.\u003C/p\u003E\u003Cp\u003EThe KSS Snackatron was the symbol of all of Kerbin\u0027s snacking industries. It took a trip to Pol then to Eeloo, to survey the far reaches of the Kerbol system. It also plans to go to Moho, to survey the extreme heat of the sun.\u003C/p\u003E\u003Cp\u003E\u0022I don\u0027t want to die, if we still have Separatons on board, I want to tear them off and then shoot them at an enemy. At Jool, that is what I meant.\u0022 Bob shouts as he still has the fear of death.\u003C/p\u003E\u003Cp\u003E\u0022Well, don\u0027t worry, Bob. You won\u0027t die.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Promise, jeb? Promise that you won\u0027t go crazy again?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Of course! I like being myself, after all those cookies. We\u0027re going to go to Laythe for resupply.\u0022\u003C/p\u003E\u003Cp\u003EThe KSS Snackatron then activates its Rockomax Mansnail, Skipper, and Atomic Engine motors and sets off for a Trajectory to Laythe.\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-06T21:25:38Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKapan Space Craft Ragnarok\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIn somewhere near Laythe, the KSC Ragnarok was following KSS Snackatron. Activated its Evian target systems, those beatiful arrays of smart missles shyning with their new look.\u003C/p\u003E\u003Cp\u003EKirke himself was in that ship. He said :\u003C/p\u003E\u003Cp\u003E\u0022ATIVATE LAZORS! Target the Snackatron! TRACTOR BEAMS!\u0022\u003C/p\u003E\u003Cp\u003EAnd all the engineers replied, \u0022YES SIR\u0022\u003C/p\u003E\u003Cp\u003EBefore the Smackatron could transfer from jool to laythe, the ragnarok grabbed it and they slowed down to suborbital speeds.\u003C/p\u003E\u003Cp\u003EKirke was beamed to recruit Jebediah and Bob kerman.\u003C/p\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-06-06T21:38:40Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EKSS Snackatron\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAs the Lazors were fired, the KSS Snackatron deploys its state-of-the-art and extremely strong heatshield to bounce back the lazors and tractor beams. Having barely any weapons, Jeb goes on EVA, takes out loads of Separatons, and then launches them at the Ragnarok.\u003C/p\u003E\u003Cp\u003EAs the Snackatron was also on a Suborbital trajectory, it activated its more powerful engines, going fast to go on the other side of Laythe.\u003C/p\u003E\u003Cp\u003E\u0022CRAP!! WERE GONNA DIE!\u0022 Bob screams\u003C/p\u003E\u003Cp\u003E\u0022Don\u0027t worry, Bob, we got half of our weapons left!!\u0022 Jeb replies\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-06T21:52:24Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKapan Space Craft Ragnarok\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EUsing its state-of-art Kaisimir field generators ( Kaisimir is a type of electromagnetic field that may be created using a homemade coil. No OP on that. ), the Ragnarok defents itself, and beams back Kirke. The engineers switch the Kaisimir field for propulsion and goes hypersonic to the Kapan Space Station. And shoots a yotagram (very, very, VERY small. 10^-10^100 if you understand maths) of RM to the smackatron. Of of those default superdense pulsars appeared and launched Snackatron 8x FTL.\u003C/p\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-06-06T22:20:00Z","Content":"\n\u003Cp\u003EOOC: RM be overpowered, and its impossible to even contain a SINGLE bit of it, as well as Anti matter, as Anti matter can only be contained by Anti matter.\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-06T22:27:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sax Man Aeronautics\u0022 data-cite=\u0022Sax Man Aeronautics\u0022\u003E\u003Cdiv\u003EOOC: RM be overpowered, and its impossible to even contain a SINGLE bit of it, as well as Anti matter, as Anti matter can only be contained by Anti matter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, sure RedMatter and Anitmatter may EXIST and be processed.\u003C/p\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-06-06T22:29:53Z","Content":"\n\u003Cp\u003EAnd there is no such thing as \u0022Red Matter\u0022 In real life, and if you were to process Antimatter, then you would need QUADRILLION tons of Energy, or even something that could break physics (impossible). Unless you are a star trek nerd, then I suggest that you know that Anti Matter could rip anything in Space (matter, which is everywhere) apart. Literally.\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-06T22:37:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sax Man Aeronautics\u0022 data-cite=\u0022Sax Man Aeronautics\u0022\u003E\u003Cdiv\u003EAnd there is no such thing as \u0022Red Matter\u0022 In real life, and if you were to process Antimatter, then you would need QUADRILLION tons of Energy, or even something that could break physics (impossible). Unless you are a star trek nerd, then I suggest that you know that Anti Matter could rip anything in Space (matter, which is everywhere) apart. Literally.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you know that thing, that golden shiny thing, FICTION?\u003C/p\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-06-06T23:40:28Z","Content":"\n\u003Cp\u003EKnowing the fact that KSP is based on Space physics, and that if you were to put Anti matter into physics, well, lets say, your game crashes.\u003C/p\u003E\n"},{"CreatedByName":"Bigcheecho","CreatedById":68020,"CreatedDateTime":"2013-06-07T00:06:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sax Man Aeronautics\u0022 data-cite=\u0022Sax Man Aeronautics\u0022\u003E\u003Cdiv\u003EKnowing the fact that KSP is based on Space physics, and that if you were to put Anti matter into physics, well, lets say, your game crashes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot with a small amount. Standard Evian AM warheads have only 5 milligrams of antimatter per warhead. However, even 1 milligram of antimatter produces the energy equivalent to the Hiroshima bomb * 2. The Hiroshima bomb produced energy equivalent to a 16 kiloton explosion.\u003C/p\u003E\u003Cp\u003ETherefore, doing fairly simple math, Evian antimatter warheads produce the energy from a 160 kiloton explosion, therefore having an explosion a little over 1.5x as strong as \u003Cem\u003ETsar Bomba\u003C/em\u003E, the world\u0027s most powerful nuclear bomb.\u003C/p\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-06-07T00:58:59Z","Content":"\n\u003Cp\u003EHow do you measure Evian Antimatter if any kind of Antimatter crushes anything matter. Plus, even 5 milligrams of antimatter could crush anything matter.\u003C/p\u003E\n"},{"CreatedByName":"Bigcheecho","CreatedById":68020,"CreatedDateTime":"2013-06-07T04:10:00Z","Content":"\n\u003Cp\u003EThey store it in antimatter.\u003C/p\u003E\u003Cp\u003EIf that doesn\u0027t make sense; I\u0027ll give you two additional things:\u003C/p\u003E\u003Cp\u003E1. We haven\u0027t discovered all physics laws\u003C/p\u003E\u003Cp\u003E2. This takes place in the future\u003C/p\u003E\u003Cp\u003EWith those two things, it is perfectly possible that the Evians have discovered a way to quickly produce antimatter and ensure that it is stable enough to not destroy everything.\u003C/p\u003E\n"},{"CreatedByName":"sytaline","CreatedById":64225,"CreatedDateTime":"2013-06-07T07:02:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ShyzyIndustries\u0022 data-cite=\u0022ShyzyIndustries\u0022\u003E\u003Cdiv\u003EWrong. They got only one miligram of it left. That\u0027s equal to 1000 1picogram warheads anyways.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am pretty sure that\u0027s a bit OP and since you keep saying I could report you for spam. Trust me I have been on this thread for ages and OP stuff does\u0027t survive for long, just like the scs!\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-07T15:18:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sytaline\u0022 data-cite=\u0022sytaline\u0022\u003E\u003Cdiv\u003EI am pretty sure that\u0027s a bit OP and since you keep saying I could report you for spam. Trust me I have been on this thread for ages and OP stuff does\u0027t survive for long, just like the scs!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure that 1 picogram of red matter damages almost the same area of New Zeland. After some maths I discovered the KRA would need 10 ^ ten hundred tousand RM 1picogram warheads to destroy a planet with radius of Earth.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-07T15:24:41Z\u0022 title=\u002206/07/2013 03:24  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 7, 2013\u003C/time\u003E by ShyzyIndustries\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bigcheecho","CreatedById":68020,"CreatedDateTime":"2013-06-07T15:30:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ShyzyIndustries\u0022 data-cite=\u0022ShyzyIndustries\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure that 1 picogram of red matter damages almost the same area of New Zeland. After some maths I discovered the KRA would need 10 ^ ten hundred tousand RM 1picogram warheads to destroy a planet with radius of Earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess RM is not that bad, then. As long as it takes a long time to produce. (40 years per gram should be good.)\u003C/p\u003E\u003Cp\u003ENOTE: Most planets in the Kerbol system have about 1/10 the radius of their Sol counterparts.\u003C/p\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-06-07T15:47:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ShyzyIndustries\u0022 data-cite=\u0022ShyzyIndustries\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure that 1 picogram of red matter damages almost the same area of New Zeland. After some maths I discovered the KRA would need 10 ^ ten hundred tousand RM 1picogram warheads to destroy a planet with radius of Earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETheres no such things as Red Matter, and there isn\u0027t any kind of real life measurements to make it a legitmate resource.\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-07T16:27:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sax man aeronautics\u0022 data-cite=\u0022sax man aeronautics\u0022\u003E\u003Cdiv\u003Etheres no such things as red matter, and there isn\u0027t any kind of real life measurements to make it a legitmate resource.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ef - i - t - c - t - i - o - n!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E Originally Posted by ShyzyIndustries \u003Cp\u003EI guess RM is not that bad, then. As long as it takes a long time to produce. (40 years per gram should be good.)\u003C/p\u003E\u003Cp\u003ENOTE: Most planets in the Kerbol system have about 1/10 the radius of their Sol counterparts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnyways, 40 years a gram is 4 years the miligram with is 0/4 years a nanogram and 0/04 to produce a picogram. Not that there is any kerbal technology to combine the HUGE energy required to make a picogram of red matter. A rule : anything lesser than a miligram requires 10^time energy to make.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-07T16:33:20Z\u0022 title=\u002206/07/2013 04:33  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 7, 2013\u003C/time\u003E by ShyzyIndustries\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sax Man Aeronautics","CreatedById":65964,"CreatedDateTime":"2013-06-07T16:40:27Z","Content":"\n\u003Cp\u003EHow do you know if Red Matter could sustain damage to anything then, it wouldn\u0027t exist in the first place and it would literally tear a hole in space and time.\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-07T16:47:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sax Man Aeronautics\u0022 data-cite=\u0022Sax Man Aeronautics\u0022\u003E\u003Cdiv\u003EHow do you know if Red Matter could sustain damage to anything then, it wouldn\u0027t exist in the first place and it would literally tear a hole in space and time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERed matter was an unstable matter with distinct gravitational properties. It\u0027s superdense red dye!!\u003C/p\u003E\n"},{"CreatedByName":"Bigcheecho","CreatedById":68020,"CreatedDateTime":"2013-06-08T03:15:14Z","Content":"\n\u003Cp\u003EBut as this is the future, where new physics laws could have been discovered, let\u0027s just continue the story.\u003C/p\u003E\u003Cp\u003EWe left off on the end of a battle between KSS Snackatron and a Kapan ship.\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-09T00:31:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bigcheecho\u0022 data-cite=\u0022Bigcheecho\u0022\u003E\u003Cdiv\u003EBut as this is the future, where new physics laws could have been discovered, let\u0027s just continue the story.\u003Cp\u003EWe left off on the end of a battle between KSS Snackatron and a Kapan ship.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERemains of the Ragnarok\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAs the Snackatron sheilds reflected the beam, and with 2 of the Ragnarok\u0027s engines, the KRA fleet is now in serius trouble. All the krakenpoo - redmatter converters would take 20 years a gram and just materializing it out of thin air would take 40, the KRA got no more planet bustin weaponry in the following 20 to 40 years. However, as eveian rebels joined the KRA, and with the newly stabilished Joolian Konvension of physis laws, creating red, dark and antimatter weaponry is possible in almost half the time. Materialization, in a ship going ten hundred times the speed of light would take 25.555555 years or so. However, acheiving ten hundred times the speed of light would litteraly require converting the entire Kilky Kay into raw and pure energy. With eveian warpdrives it is possible to acheive 95.99999 percent of the speed of light, but that would reduce the time to 39.9999. Useless bu**s***.\u003C/p\u003E\n"},{"CreatedByName":"botse","CreatedById":39993,"CreatedDateTime":"2013-06-09T02:32:56Z","Content":"\n\u003Cp\u003E[Comes back from playing SPAZ and sees so much OP\u0027nes holy chap]\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eat fleet node one TR fleet 90\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u0022Sir and ma\u0027am KRA ships are closing in on this node scans show 20 RM warheads in the fleet\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well kilo it seems that the KRA have found us i think this maybe the time to show our full power?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes it is mark call in the \u003Cem\u003Ereflex\u003C/em\u003E the KRA have just kicked up one hell of a **** storm\u0022\u003C/p\u003E\u003Cp\u003E-data link locked-\u003C/p\u003E\u003Cp\u003E-sending jump point codes-\u003C/p\u003E\u003Cp\u003E-codes locked and running-\u003C/p\u003E\u003Cp\u003E*out side in space you can see point of light said point of light then expands to 1km in radis then coming out of it is one of the biggest ship the kerbol system has seen coming in at over 3km long and 1.2km wide[think of a SW SD] its the biggest damn ship known to kerbal kind and all this time a video of it has been sent to all planets in the system along with this sound file*\u003C/p\u003E\u003Cp\u003E\u0022This is grand commaner gattaling of the reflex naviy what you are seeing is the frist of a new line of ships we call them \u003Cem\u003Ehome planets\u003C/em\u003E they are a war ship frist and a cloney 2nd with a crew of 5000 and armour in the 20m range and a weapons load out of over 200 railguns and 100s of missile banks it is like flyinn in to a wall\u003C/p\u003E\u003Cp\u003E*f shells for any ship, this one ship can take on 25 nomal fleets at once. But thats y we have a rule for calling in these ships it goes like this \u0027if any fleet node is found or civ base hit a HP may be called if said node or base is wiped out one more ship may be called a max of two ships may be in system if all bases in system have been hit and taken out 10 ships may be used at once\u0027 now all you need to knwill this is going on the \u003Cem\u003Ereflex\u003C/em\u003E has benn killing off the KRA fleetow is that the group KRA has now hitting in over there heads we have been sitting and waiting for this war to stop we even hoped that jeb could stop this once and for all but it seems like we were rong. Jeb if you see this may kod and god help you and if this ends like i hope drinks are on me\u0022\u003C/p\u003E\u003Cp\u003E*will this was going on the \u003Cem\u003Ereflex\u003C/em\u003E was riping the KRA fleet a new one*\u003C/p\u003E\u003Cp\u003E[And with that the TR are now in full gear and ready for a war on full system scale hope im not making the TR to OP im just one uping shyzy]\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-09T12:53:30Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EThe KRA\u0027s Broadcast\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EEarlier tody, the KRA\u0027s commander, Kirke Kerman, sent a public broadcast to all the active factions.\u003C/p\u003E\u003Cp\u003E\u0022Hello, people of the Kerbol system. This is a message from the KRA\u0027s commander. I\u0027m just sending this, to warn you, that if you destroy the \u003Cem\u003ERagnarok\u003C/em\u003E, the Kerbol system\u0027s gone. The RM warheads WILL combust and create a Singularity of the size of all the planet\u0027s mass. (after some time)\u0022\u003C/p\u003E\u003Cp\u003EGood thing it was just a warning, Kirke isn\u0027t crazy enough to arm a ship capable to destroy the kerbol system.\u003C/p\u003E\u003Cp\u003EOOC : Idk what TR is.\u003C/p\u003E\n"},{"CreatedByName":"botse","CreatedById":39993,"CreatedDateTime":"2013-06-09T13:56:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ShyzyIndustries\u0022 data-cite=\u0022ShyzyIndustries\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EThe KRA\u0027s Broadcast\u003C/span\u003E\u003C/strong\u003E\u003Cp\u003EEarlier tody, the KRA\u0027s commander, Kirke Kerman, sent a public broadcast to all the active factions.\u003C/p\u003E\u003Cp\u003E\u0022Hello, people of the Kerbol system. This is a message from the KRA\u0027s commander. I\u0027m just sending this, to warn you, that if you destroy the \u003Cem\u003ERagnarok\u003C/em\u003E, the Kerbol system\u0027s gone. The RM warheads WILL combust and create a Singularity of the size of all the planet\u0027s mass. (after some time)\u0022\u003C/p\u003E\u003Cp\u003EGood thing it was just a warning, Kirke isn\u0027t crazy enough to arm a ship capable to destroy the kerbol system.\u003C/p\u003E\u003Cp\u003EOOC : Idk what TR is.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOOC : TR stands for \u0027the reflex\u0027\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eon bord the \u003C/strong\u003E\u003Cem\u003E\u003Cstrong\u003Ereflex\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u0022Commaneder all ships but the KRA flag ship are down or out\u0022\u003C/p\u003E\u003Cp\u003E\u0022Good ready the main gun for firing\u0022\u003C/p\u003E\u003Cp\u003E\u0022Heling are you shore you wont to show them it?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes gatt i do\u0022\u003C/p\u003E\u003Cp\u003E-running grav cannon_fire.exe-\u003C/p\u003E\u003Cp\u003E*the noze of the ship opens to show a small star or what seems to be one*\u003C/p\u003E\u003Cp\u003E\u0022Open a link to the flag ship\u0022\u003C/p\u003E\u003Cp\u003E\u0022Aye aye cap\u0022\u003C/p\u003E\u003Cp\u003E-data link locked-\u003C/p\u003E\u003Cp\u003E\u0022KRA ship you have one min to dump the RM warheads so we can take the out or you well be hit with a pin point black hole to take them out ether way the warheads will be hit\u0022\u003C/p\u003E\u003Cp\u003E-link cut-\u003C/p\u003E\u003Cp\u003E[shyzy your turn mate]\u003C/p\u003E\n"}]}