{"TopicId":30718,"ForumId":39,"TopicTitle":"First Flight (Epilogue and Last Thoughts)","CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-06-01T16:40:21Z","PageNum":3,"Articles":[{"CreatedByName":"Mr. Pseudonym","CreatedById":27614,"CreatedDateTime":"2013-07-07T16:22:59Z","Content":"\n\u003Cp\u003EMORE! This is great! Keep it up!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-07-14T08:19:24Z","Content":"\n\u003Cp\u003E\nThis next part is a little shorter and is something of an interlude from rocket building. Hopefully this thread in the story will make more sense in a few chapters time!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EThe Other Side\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe village lights twinkled in the dusk as Jonton toiled up the hill towards his home. It had been a very interesting day indeed but for now he was more than a little footsore and simply looking forward to a bowl of something hot and maybe sitting out on the porch for a while with his feet in a basin of cool water. No wind tonight either to put a chill on things he thought to himself as he trudged up the garden path.\n\u003C/p\u003E\n\u003Cp\u003E\nThe front door opened, spilling out a fan of warm golden light onto the ground. Gerselle stood in the doorway looking partly amused and partly exasperated.\n\u003C/p\u003E\n\u003Cp\u003E\n“What time do you call this, Jonton Kermol?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJonton opened his mouth to speak but saw the corner of Gerselle\u0027s mouth quirked upwards in a half smile. “I\u0027m not sure,\u0022 he answered “but I do know it\u0027s way past supper time.\u0022He sniffed the air appreciatively. “Fortunately for me, it seems like someone left some white bean stew on the stove.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHe gave Gerselle a brief hug. “Think I\u0027ll just wash the road dust off before supper. This kerbal will be a \u003Cem\u003Elot\u003C/em\u003E nicer to be around after a quick hose down.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle wrinkled her nose at him. “You just go ahead and do that. It\u0027ll make \u003Cem\u003Ethis\u003C/em\u003E kerbal a lot nicer to be around too.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJonton chuckled as he went inside. The house was a fairly normal kermol dwelling - a simple circular hut, built around the trunk of a Kerm tree with three walls marking out rooms for sleeping, eating or bathing. The kermwood walls were polished to a soft inviting glow and colourful homespun rugs littered the floor. Jonton stepped through into the bathing room, slipping off his rumpled travelling clothes as he did so. Grabbing a large handful of dripping sweetmoss from the pool, he sponged himself vigorously, the water running off his skin in icy rivulets. Shivering but feeling much refreshed he took a spare poncho from the rail and padded out onto the porch, fingers combing his hair back out of his eyes as he went.\n\u003C/p\u003E\n\u003Cp\u003E\nA steaming bowl of stew was waiting for him on the table and was demolished in short order. By the time he had helped himself to a second bowl from the stove, Gerselle was waiting for him on the porch, rocking back and forth in her chair.\n\u003C/p\u003E\n\u003Cp\u003E\n“So, were the stories true?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJonton pushed his empty bowl away with a contented sigh. “Sort of. Or at least the more sensible ones were. There was definitely a rocket - and three crazy kerbals packed into a can on top of the rocket too. It didn\u0027t fly around the world though - I\u0027m guessing the kerman are probably working on that part.\u0022 He looked wistful. “Actually, I say crazy but they seemed like pretty level types to be honest.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle shifted in her chair. “Were there many other kermol at the launch?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“Quite a few actually. Patbro was there, Ludvis as well. Didn\u0027t recognise too many after that but there were plenty of grey robes dotted around the crowd.\u0022 Jonton scratched his head. “The Interplanetary Society were careful to come over and talk to us too - actually, some of us went back to their factory afterwards to have a look round and meet the team.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle looked amused. “Interplanetary Society?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJonton nodded. “Kerbin Interplanetary Society is what they call themselves. Bit of a grand name at the moment really - the flight this afternoon was impressive but it sure didn\u0027t go near any planets other than Kerbin. He smiled. “But like I said, I reckon they\u0027re working on that. Not that I blame them after seeing those pictures.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“Pictures?\u0022 asked Gerselle curiously.\n\u003C/p\u003E\n\u003Cp\u003E\n“Pictures of Kerbin, taken out of the window of the last rocket they flew. A lot of them weren\u0027t that good but there was one that was simply beautiful. Kerbin on one side, all greens and blues, the dark sky on the other but with even more stars.\u0022 Jonton paused. “And the Mun rising over the horizon.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle looked at him. “We could always go kerman for a year or two you know,\u0022 she said softly.\n\u003C/p\u003E\n\u003Cp\u003E\nJonton smiled again. “It\u0027s a kind offer, love but we\u0027ve got plenty of time yet. I have a feeling they\u0027ll be flying into space for many years to come.\u0022 He gazed fondly at the tiny tousled head peeping sleepily out of her poncho. “Besides, living amongst the Kerm does have its advantages.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nLittle Joenie wriggled as she was lifted out of her pouch and squeaked grumpily in the sudden cold as she was passed across to her father. Jonton wrapped his daughter in a corner of his poncho and murmured to her in soothing tones as he snuggled her into one shoulder. Joenie burrowed into the comforting warmth and promptly fell asleep again.\n\u003C/p\u003E\n\u003Cp\u003E\nThe two kerbals sat on the porch as the Mun rose over the trees, sometimes sitting in companiable silence, sometimes talking of this and that. Eventually, Jonton couldn\u0027t hold back any longer and yawned widely, trying his best not to disturb the sleeping kerblet at his shoulder. Gerselle made a shooing gesture at him. “You get to your bed, Jonton Kermol - you know you\u0027ve got a long night ahead of you.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHe reluctantly unwrapped his daughter\u0027s fingers from his ear and gently handed her back to her mother.\n\u003C/p\u003E\n\u003Cp\u003E\nThe bedroom was fragrant with the faintly cinnamony odour of Kerm leaves and Jonton noted absently that the new buds near the ceiling had finally opened. The large clump of leaves at the head of his bed unfolded as he approached, making a very inviting looking pillow. They rustled slightly as he lay down, curling themselves around his head. As Jonton drifted off to sleep, he was only vaguely aware of the familiar tickling sensation of hundreds of wispy leaf hairs burrowing into his scalp.\n\u003C/p\u003E\n\u003Cp\u003E\nThat night he dreamed of rockets and kerbals flying far out beyond the reach of Kerbin. High above his head, the Kerm trees rustled in the still night air.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022float:none;background-color:rgb(255,255,255);color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026lt;\u0026lt; \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-101-a-is-for-acorn/\u0026amp;do=findComment\u0026amp;comment=495693\u0022 rel=\u0022\u0022\u003EChapter 7\u003C/a\u003E\u003Cspan style=\u0022float:none;background-color:rgb(255,255,255);color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E   ::     \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-101-a-is-for-acorn/\u0026amp;do=findComment\u0026amp;comment=522046\u0022 rel=\u0022\u0022\u003EChapter 9\u003C/a\u003E\u003Cspan style=\u0022float:none;background-color:rgb(255,255,255);color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026gt;\u0026gt; \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-08-09T17:54:07Z\u0022 title=\u002208/09/2019 05:54  PM\u0022 data-short=\u00224 yr\u0022\u003EAugust 9, 2019\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-14T09:45:01Z","Content":"\n\u003Cp\u003EWow, that was...different \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 alt=\u0022:sealed:\u0022\u003E Nice go at world-building - now we\u0027ll be waiting for more exposition \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E And \u0027pouch\u0027? Did you mean folded poncho, or are you imagining Kerbals as marsupial-like species?\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2013-07-14T09:59:14Z","Content":"\n\u003Cp\u003EWell written. \u002Brep and subscribe- I wish I could write this well.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-07-14T13:33:01Z","Content":"\n\u003Cp\u003EThanks Mekan1k. That means a lot to me, particularly given your own contributions to the Fan Works forum!\u003C/p\u003E\u003Cp\u003EScotius - yeah \u0027different\u0027 probably sums it up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Different enough that I figured some sort of \u0027honestly - this is still part of the story\u0027 comment was in order first. As a wise man once said, exposition will only get you so far, at some point you need some kind of conflict to drive the narrative. This chapter lays the groundwork for picking up on that. \u003C/p\u003E\u003Cp\u003EThe only problem is that the conflict I have in mind goes to the heart of what it means to be kerbal (in my imagining of them at any rate) and how kerbal society works. So yeah - more exposition incoming! As far as possible, I\u0027m hoping to do this by action rather than too many large slabs of dialogue but seriously, if anyone has any tips and tricks on how to avoid clunky exposition, I\u0027m all ears. This is my first piece of creative writing of any substantial length, so I\u0027m far from experienced with any sort of story telling techniques.\u003C/p\u003E\u003Cp\u003EOh - and pouches. Yeah, I envisage kerbals as being marsupial. I don\u0027t think they really have the patience for sitting on a nest and given their physical proportions, I didn\u0027t think that making them mammalian would work too well either!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-14T13:37:25Z\u0022 title=\u002207/14/2013 01:37  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 14, 2013\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-14T14:18:07Z","Content":"\n\u003Cp\u003EHeh, they do have sort of round bellies - so yeah, it can work. Ahh, exposition - bane of fanfic writers. We have clear image of our world in our heads, but how to transmit it to the readers without losing something important? Either by \u0027large slabs of text\u0027, or by \u0027talking heads\u0027. Or, eventually, by surreptitiously slipping slivers of local lore inside story flow. For example: I presume those \u0027grey robes\u0027 are some kind of religious order. Avoid explaining more of what they do, and their beliefs as long as they are not directly relevant to the story. And when such moment comes, appoint one of them Mr. Exposition by saying something like: \u0022You dare to invade god\u0027s domain, infidel! It is our duty as protectors of the faith to punish you for insolence. Die in fire!\u0022\u003C/p\u003E\n"},{"CreatedByName":"qwertyx2y","CreatedById":22588,"CreatedDateTime":"2013-07-16T01:22:00Z","Content":"\n\u003Cp\u003EThis is the best fan art story I have ever read, I can\u0027t wait for these parts to be in the actual game.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Pseudonym","CreatedById":27614,"CreatedDateTime":"2013-07-16T17:03:24Z","Content":"\n\u003Cp\u003EI love this fanfic. Keep writing!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-07-19T23:06:30Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKerbal in Space Soonest\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe planet Kerbin spun sedately against the starry backdrop of space. Sunlight gleamed from the polar ice caps and from the bands of cloud that streaked the otherwise clear azure skies. A major low pressure system swirled across the southern ocean, promising wet weather ahead for the larger of the two main landmasses.\n\u003C/p\u003E\n\u003Cp\u003E\nA pinprick of light flared in the skies over the northernmost reach of that same ocean. The pinprick grew larger, resolving itself into a tiny flame climbing boldly out of the atmosphere. The flame winked out and a small metal tube tumbled back towards the surface, leaving a tiny, fragile looking metal shell to coast onwards around the curve of the planet. Brief puffs of incandescent gas jetted out from the sides of the shell, setting it into a slow, graceful spin. The last rays of sunlight from Kerbol glinted off its surface as it crossed the terminator and disappeared from sight.\n\u003C/p\u003E\n\u003Cp\u003E\n----------\n\u003C/p\u003E\n\u003Cp\u003E\nAdemone stood on the viewing balcony at the back of the Rockomax mission control room watching the preparations for the R1 flight unfold. The room was surprisingly quiet with nothing more than a muted babble of conversation in the background as each controller checked over his console and reported various readouts back to the flight director.\n\u003C/p\u003E\n\u003Cp\u003E\nA large screen on the far wall displayed a map of Kerbin, with the projected flight path of the R1 highlighted against it. Next to it, smaller screens displayed the view over the launch pad, a view from inside the capsule and the view along the rocket itself. Other smaller monitors around the central display were blank, although Ademone knew that they would display the critical flight parameters during the mission.\n\u003C/p\u003E\n\u003Cp\u003E\nAdemone studied the view along the rocket intently. Most of the screen wasn\u0027t showing anything more interesting than the guidance fins for the BA-C against a uniform expanse of grey concrete. On the edges of the image you could just pick out two of the launch cradle arms that held the booster securely in place. She shifted her gaze to the other screen to check the cradle positioning and orientation. Everything seemed to be ready. Both kerbonauts were installed in the capsule, calmly checking the spacecraft systems and chatting to the flight director.\n\u003C/p\u003E\n\u003Cp\u003E\nA sudden movement from the comms console caught her eye. The controller was clearly signalling for a colleague to come and inspect something. Another kerbal walked over to the console and bent over the display screens. Ademone could see what appeared to be a heated debate, before the second kerbal went over to the flight director and whispered in her ear. The director listened intently and then pointed over to her.\n\u003C/p\u003E\n\u003Cp\u003E\nThe controller hurried over. “We\u0027ve picked up a transmission, ma\u0027am. It appears to be from another spacecraft.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAdemone nodded. \u0022Are we receiving voices?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe controller shook his head. “No. Low bandwidth data signal only. We havn\u0027t been able to decipher it but we think it\u0027s probably telemetry and flight control data.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAdemone raised her eyebrows. “Flight control data?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“Yes, ma\u0027am. Or at least we assume so. There appears to be a fairly regular downlink transmission but we only picked up one uplink signal before the spacecraft disappeared over our horizon.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAdemone drummed her fingers on the balcony, studying the map. “Interesting. Probably another satellite if we\u0027re not hearing any voices but it sounds like a more sophisticated one than last time if they\u0027re sending commands to it.\u0022 She broke off ruefully. “\u003Cem\u003EJust\u003C/em\u003E another satellite. Isn\u0027t it amazing how quickly the extraordinary becomes ordinary. Anyway - please tell Communications to monitor for any new signals - and to keep a log too. We might be able to work out what\u0027s happening up there.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“Yes, ma\u0027am.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nApplause rippled around the room. Ademone turned her attention back to the displays in time to watch the rapidly departing R1 on one screen. Her breath caught in her throat as she took in the black and white image on the other screen. It was fuzzy and kept shaking out of focus but the spectacular exhaust plume from the BA-C and the equally spectacular view of Kerbin rapidly falling away behind the booster were both very clear to see. One of the controllers flicked a switch on his console and suddenly the room was full of the muted roar from the booster and excited chatter from the two kerbonauts. Ademone made a mental note to send a recording to Leland. It would make a suitable accompaniment to the video footage from the booster.\n\u003C/p\u003E\n\u003Cp\u003E\nInside the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E launch bunker, things were rather less restrained. Bob was bouncing up and down in his chair as Lucan announced a successful communication link to the \u003Cem\u003EKerbin 2\u003C/em\u003E. Moments later, even Bill smiled in satisfaction as the telemetry screen lit up. The \u003Cem\u003EKerbin 2\u003C/em\u003E had separated from its booster right on schedule and the propulsion module appeared to be firing properly. Everyone\u0027s eyes were glued to the screen as the projected periapsis crept upwards and then stopped. Seconds later there was a brief flickering of indicator lights from Lucan\u0027s console and then the bunker erupted in jubilation as three new numbers appeared on the telemetry board.\n\u003C/p\u003E\n\u003Cp\u003E\nPitch - 0 rad/s\n\u003C/p\u003E\n\u003Cp\u003E\nYaw - 0 rad/s\n\u003C/p\u003E\n\u003Cp\u003E\nRoll - 0.02 rad/s.\n\u003C/p\u003E\n\u003Cp\u003E\n------------\n\u003C/p\u003E\n\u003Cp\u003E\nThe kitchen at the Junkyard and Spaceship Parts company had never been busier. Excited engineers sat at the long tables, busily discussing the morning launch, speculating on whether the satellite was working and making the odd surreptitious bet on whether it would land in one piece. Lucan was sitting in a corner with Geneney talking over the flight plan when his eye was caught by the image on the television screen behind him.\n\u003C/p\u003E\n\u003Cp\u003E\n“Hey, you guys - looks like someone else is launching a rocket today!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe room suddenly went quiet. Jeb got up and turned up the volume.\n\u003C/p\u003E\n\u003Cp\u003E\n“We are now seeing live images from the onboard camera. Around the edges of your screen you should just be able to make out the four \u0027petals\u0027 holding the BA-C booster in place. In few minutes time we\u0027ll be able to watch the flight right from the booster! If you\u0027re just tuning in now, this is the maiden flight of the Rockomax R1 capsule and the new BA-C booster. We are told that this will be a \u003Cem\u003Esub\u003C/em\u003E orbital flight only today - the rocket will not be going all the way to space - but we should still get a good view of Kerbin.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe camera switched to a view of the Rockomax launch pad revealing the BA-C booster nestled within four ungainly looking gantry arms, much to the puzzlement of the watching Interplanetary Society engineers.\n\u003C/p\u003E\n\u003Cp\u003E\nA bright torrent of flame poured out of the bottom of the booster as the on screen countdown clock ticked off the last few seconds. As the clock reached zero, the gantry arms swung smoothly out of the way and the rocket lifted sedately off the pad.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher frowned at the television. From the colour of the exhaust flame the thing had to be solid fueled. But even allowing for the size of the rocket, the launch profile just didn\u0027t look right. OK, it had to be a lot heavier than a Trashcan but even then the accleration, no - the \u003Cem\u003Erate\u003C/em\u003E of acceleration just looked wrong. Maybe just an odd camera angle.\n\u003C/p\u003E\n\u003Cp\u003E\nEveryone in the room stared mesmerised at the screen as the viewpoint switched to the on-board camera. Even the crews of the \u003Cem\u003EKerbals 1 \u003C/em\u003Eand \u003Cem\u003E2\u003C/em\u003E were lost in awe at the view of Kerbin unfolding in front of them and the normally garrulous commentator seemed to be equally lost for words. The curve of the horizon was just becoming clear when the exhaust plume from the booster flared out. The view from the camera tilted abruptly sideways as it tumbled away from the unseen capsule above it. There were several groans of disappointment as the camera feed cut out and was replaced by a view out to sea, presumably from the launch site.\n\u003C/p\u003E\n\u003Cp\u003E\nCheers rang out from two crowded rooms on opposite sides of the continent at the sight of a small red and white striped parachute floating down through the cloudy sky.\n\u003C/p\u003E\n\u003Cp\u003E\n----------------\n\u003C/p\u003E\n\u003Cp\u003E\nThe satellite spun silently through space, its camera flashing in the raw sunlight like a miniature lighthouse as it revolved. An observer from a more martial culture would have noted that it bore a distinct resemblance to a sword hilt, with a large pommel, a somewhat stubby handle and a simple, almost hemispherical guard.\n\u003C/p\u003E\n\u003Cp\u003E\nPrecisely timed bursts of glowing gas took the place of the swordsman\u0027s hand as the hilt spun and shifted in a delicate slow-motion choreography. A first burst checked it\u0027s spin, bringing it to a standstill. The second burst flipped it neatly over, pommel swapping place with guard. The pommel breathed fire for two long minutes and then, in a final salute, spun precisely back into place behind the guard.\n\u003C/p\u003E\n\u003Cp\u003E\nThe satellite raced onwards but now its stately circular path had been nudged into a slowly decreasing spiral. The onboard camera faithfully recorded the transition from night to day as it sped over the terminator for the last time. Pinpricks of light flared briefly around the base of the propulsion unit as it broke free, gliding away along its own trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nNow the satellite was dipping into the first wispy fringes of atmosphere, the speed of its passing stripping electrons from their atoms in an eerie pale glow. The glow intensified, becoming suffused with crimson as the heatshield slammed into ever thickening air. The crimson rapidly shifted to a bright yellow and then became a wake of incandescent white fire, surrounding the \u003Cem\u003EKerbin 2\u003C/em\u003E and blazing out behind it.\n\u003C/p\u003E\n\u003Cp\u003E\n--------\n\u003C/p\u003E\n\u003Cp\u003E\nThe Rockomax mission control room was cool and quiet as Ademone let herself in and sat down at the communication console. Out by the launch pad, the party was in full swing and she strongly suspected that by now, the first celebratory toast to the crew of the R1 was rapidly becoming a whole string of toasts to anything and everything connected with the mission. Ademone smiled to herself. There would be more than one sore head tomorrow but everyone definitely deserved a break after the last hectic weeks before the flight.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, down to business. She flipped open the console logbook and switched on the secondary receiver. It was already tuned to the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E frequency but there was no signal other than the normal background hiss. According to the log, the next transmissions were due any time now.\n\u003C/p\u003E\n\u003Cp\u003E\nThere it was. A steady stream of faint but audible signals and then suddenly a rapid and far stronger burst of encoded data. Two minutes of silence and then another shorter burst of data. Ademone paged through the log. Odd - this didn\u0027t seem to match up to any of the earlier signals. She looked up startled at yet another uplink transmission, before the steady stream of fainter transmissions resumed.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the next hour, Ademone busied herself reviewing the flight data, whilst keeping half an ear open for the next overpass of the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E satellite. For a moment she thought she heard the transmissions start up again but they were quickly obscured by a loud fuzz of static. Try as she might, she couldnt tune it out without losing the signal altogether. Shrugging slightly she waited patiently for it to clear.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then, over the noise she could just make out the transmissions starting up again, growing louder and louder as the static faded away. Her eyes widened in sudden understanding. These sounded like the weaker downlink signals only a lot stronger. Which could only mean that the radio transmitter was much much closer - or much much \u003Cem\u003Elower\u003C/em\u003E as it passed overhead.\n\u003C/p\u003E\n\u003Cp\u003E\n------------\n\u003C/p\u003E\n\u003Cp\u003E\nAs the first few members of the Kerbin Interplanetary Society arrived at Jeb\u0027s warehouse the next morning, they found Jeb standing quietly next to a new table in the middle of the Museum. On the table, resting on a simple, yet elegant stand was the main body of the \u003Cem\u003EKerbin 2\u003C/em\u003E, it\u0027s scorched heat shield still attached. By the time Bob arrived, there was a sense of expectancy in the air. Jeb still hadn\u0027t moved away from the table and there was a strange abstracted look on his face. In fact the last time Bob could remember seeing him like this was shortly before he suggested founding the original \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally the last stragglers filed in and promptly fell silent as they sensed the atmosphere in the room. Jeb looked around to make sure he had everyone\u0027s attention and then began.\n\u003C/p\u003E\n\u003Cp\u003E\n“My friends - yesterday we made history together.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAn imperceptible ripple passed through the crowd as every kerbal unconsciously drew themselves up just a little straighter.\n\u003C/p\u003E\n\u003Cp\u003E\n“When you work on something for so long, its easy for it to become routine. Just something you do - no big deal. But take a step back for a moment and consider just what we \u003Cem\u003Edid\u003C/em\u003E yesterday.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We built a machine capable of flying so high and so fast that it flew clear around the planet and might never have come back down!\n\u003C/p\u003E\n\u003Cp\u003E\n“But it did come back down - because we designed it that way. Together we reached out across the void. We touched the machine. And we brought it home.\n\u003C/p\u003E\n\u003Cp\u003E\n“We brought it back down through fire hot enough to vaporise steel. We brought it back down so carefully and so precisely that after a voyage of over one hundred \u003Cem\u003E thousand \u003C/em\u003E kilometres, we could take a short boat trip, pluck it neatly out of the sea and put it here on this table before you!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb paused and looked each and every kerbal in the room squarely in the eye.\n\u003C/p\u003E\n\u003Cp\u003E\n“But that was yesterday.\n\u003C/p\u003E\n\u003Cp\u003E\n“Today is a new day and today we take the next great step! Today we embark upon the dream of countless generations of kerbals before us. Today we finally set out to do that which we founded the Kerbin Interplanetary Society for!\n\u003C/p\u003E\n\u003Cp\u003E\n“Generations of kerbals to come will look back at us and see that this was when it happened. This was when we realised that we could do it. This was the day we took the decision to put a kerbal into space and bring him - or her - safely back to Kerbin!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nQuite a number of he crowd had been half expecting something like this. Even so, the passion and the conviction in Jeb\u0027s voice was enough to send a shiver down their spines. Jeb paused again, blinking hard.\n\u003C/p\u003E\n\u003Cp\u003E\n“Make no mistake my friends - this will not be easy. It will require all the skills and all the technologies we have built so far. We have rocket engines - but now we\u0027ll need bigger ones. We have capsules - but now we\u0027ll need better ones.\n\u003C/p\u003E\n\u003Cp\u003E\n“But most of all, we\u0027re going to need volunteers. Someone to pilot the ships. Someone to forge a new path and set Kerbalkind on the road to the stars! And I believe that each and every kerbal standing here today should be given the chance to be one of those volunteers if they so choose.\n\u003C/p\u003E\n\u003Cp\u003E\n“To be a pilot for Project Moho.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u0026lt;\u0026lt; \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-101-a-is-for-acorn/\u0026amp;do=findComment\u0026amp;comment=510059\u0022 rel=\u0022\u0022\u003E Chapter 8\u003C/a\u003E   ::     \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-101-a-is-for-acorn/\u0026amp;do=findComment\u0026amp;comment=544574\u0022 rel=\u0022\u0022\u003EChapter 10\u003C/a\u003E\u0026gt;\u0026gt;\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-04-18T07:12:58Z\u0022 title=\u002204/18/2020 07:12  AM\u0022 data-short=\u00224 yr\u0022\u003EApril 18, 2020\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JakeGrey","CreatedById":61242,"CreatedDateTime":"2013-07-20T02:40:20Z","Content":"\n\u003Cp\u003EI have not the words to express how wonderful this is...\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-20T09:34:06Z","Content":"\n\u003Cp\u003EI have a lot of words, but they are simply inadequate for the task. So - instead i will take my hat off, and bow to you and your writing skills. Well done, sir - very well done indeed.\u003C/p\u003E\n"},{"CreatedByName":"[ Jeremy ]","CreatedById":33887,"CreatedDateTime":"2013-07-20T12:00:27Z","Content":"\n\u003Cp\u003EI could only dream of having writing skills like that, A very fine read indeed!\u003C/p\u003E\n"},{"CreatedByName":"Mr. Pseudonym","CreatedById":27614,"CreatedDateTime":"2013-07-20T19:53:52Z","Content":"\n\u003Cp\u003ESlight Project Mercury reference detected... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGood chapter anyway. Keep it up!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-07-21T21:27:29Z","Content":"\n\u003Cp\u003E*bows before Jeremy and Scotius*\u003C/p\u003E\u003Cp\u003EMr.Pseudonym - Yup, Project Moho was fairly blatant Project Mercury tribute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E but then again \u0027Kerbal in Space Soonest\u0027 was a nod in that direction too! There\u0027s a couple of other references to actual manned programs in the story too. It\u0027s actually been really interesting reading up on Project Mercury as \u0027research\u0027 for this part.\u003C/p\u003E\u003Cp\u003ETo Qwertyx2y and JakeGrey - thank you and glad you like it! Next chapter is underway, although I confess to slacking off a little this weekend to (gasp) play KSP rather than writing about it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Crew selection is done though - Project Moho has it\u0027s pilots. Time to build those ships and then go light some candles...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-21T21:32:44Z\u0022 title=\u002207/21/2013 09:32  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 21, 2013\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"qwertyx2y","CreatedById":22588,"CreatedDateTime":"2013-07-22T01:16:34Z","Content":"\n\u003Cp\u003EI guess the KSP playing could be said to be \u0022gathering ideas\u0022.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2013-07-23T11:08:04Z","Content":"\n\u003Cp\u003EI love this series, take your time writing the next chapter, I know it\u0027s going to be good!\u003C/p\u003E\n"},{"CreatedByName":"Mr. Pseudonym","CreatedById":27614,"CreatedDateTime":"2013-07-23T15:55:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSK\u0022 data-cite=\u0022KSK\u0022\u003E\u003Cdiv\u003E*bows before Jeremy and Scotius*\u003Cp\u003EMr.Pseudonym - Yup, Project Moho was fairly blatant Project Mercury tribute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E but then again \u0027Kerbal in Space Soonest\u0027 was a nod in that direction too! There\u0027s a couple of other references to actual manned programs in the story too. It\u0027s actually been really interesting reading up on Project Mercury as \u0027research\u0027 for this part.\u003C/p\u003E\u003Cp\u003ETo Qwertyx2y and JakeGrey - thank you and glad you like it! Next chapter is underway, although I confess to slacking off a little this weekend to (gasp) play KSP rather than writing about it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Crew selection is done though - Project Moho has it\u0027s pilots. Time to build those ships and then go light some candles...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere should be 7 pilots first round, then the new nine, then the kerballo program 14, etc... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-07-23T18:30:03Z","Content":"\n\u003Cp\u003EWonderful story! I like the way you are developing your characters.\u003C/p\u003E\u003Cp\u003EI\u0027ve subscribed so I won\u0027t miss any of the ongoing story.\u003C/p\u003E\u003Cp\u003ELooks as if there may be a race developing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-23T19:04:44Z","Content":"\n\u003Cp\u003EOk, guys: it\u0027s time to vote for your favourite Mercury astronaut.\u003C/p\u003E\u003Cp\u003EMine is Scott Carpenter (because Pete Conrad kinda flunked \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E). I know - the guy was not really popular, and he never went to space again. But i like his attitude as it was described in The Right Stuff. He was kind of Renaissance man, liked the science side of the program and was really thrilled to be in space because...y\u0027know - SPACE! I would be like that in his place \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESecond is Alan Shepard - he was stone cold pro. Kinda like Jeb, but with less goofiness \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-07-23T20:04:54Z","Content":"\n\u003Cp\u003EShepard is da man!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-07-23T20:40:01Z","Content":"\n\u003Cp\u003ECarpenter for me too - meh I messed up my re-entry but I was doing SCIENCE up here. Kinda like Leonov on the Soviet side. First man in history to do an EVA, has a real hairy moment getting back into the capsule and the first thing he does - start drawing the view from space with a sketch pad and coloured pencils he took with him! But then - and no disrespect to the Americans, I always get the impression that the Soviet astronauts were much more \u0027y\u0027know - SPACE!\u0027 about the whole adventure.\u003C/p\u003E\u003Cp\u003ESeriously - no disrespect. The time I went to DC, I spent most of my time in the Air and Space Museum at the Smithsonian. Talk about a kid in a candy store \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E That\u0027s some history you can be proud of - it certainly made me wish that we had an equivalent back here in the UK. Ah well - if we ever pony up to get Skylon working...\u003C/p\u003E\u003Cp\u003EAstronauts in general - Pete Conrad without a shadow of a doubt. Inspirational leader, stone cold pilot but with a sense of humour too. Kind of guy you\u0027d go for a beer with or go for a trip around the moon with. My favourite part of Apollo 12 was probably when he passed the controls of the LM ascent module over to Bean, just because he figured Bean deserved a chance to do some of the flying too. Not on the mission plan but as he said at the time - what are they going to do - they can\u0027t even hear us right now!\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-07-24T02:34:28Z","Content":"\n\u003Cp\u003EI think our (American) Astronauts were supposed to be steely eyed rocket men so they were selected by those qualities. Me? I\u0027d be squealing like a school girl all the way up into orbit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was a bit young to remember any of Project Mercury (the program ended in 63 and I was 3 at the time). I have faint memories of Project Gemini. I followed Project Apollo pretty well.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-24T14:32:23Z","Content":"\n\u003Cp\u003EMeh, i missed all the cool stuff \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I was either too little to remember (or care at the moment \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) or the fact of growing up on the communist side of Iron Courtain got in the way.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Pseudonym","CreatedById":27614,"CreatedDateTime":"2013-07-26T16:14:36Z","Content":"\n\u003Cp\u003EAny updates on the story?\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-07-26T20:42:13Z","Content":"\n\u003Cp\u003E@Bostlabs. Wish I could say the same! Sadly, I wasn\u0027t even a twinkle in my daddy\u0027s eye when Apollo 17 splashed down and I doubt I took much notice of AAP either \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EStory is rolling along. This next chapter is going to be reasonably substantial I think - it\u0027s already sitting at just a shade over 2200 words.\u003C/p\u003E\n"}]}