{"TopicId":30718,"ForumId":39,"TopicTitle":"First Flight (Epilogue and Last Thoughts)","CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-06-01T16:40:21Z","PageNum":40,"Articles":[{"CreatedByName":"scy","CreatedById":111983,"CreatedDateTime":"2016-08-07T21:21:27Z","Content":"\n\u003Cp\u003E\nUse a German keyboard? Linux has various other solutions, but you have to go look for them.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother great chapter, KSK. Great interview and I love having to join the dots a little to follow the story and work out what\u0027s going on... like why a female pilot was requesting permission to enter Wakiran airspace.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-09T20:46:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222708655\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470604887\u0022 data-ipsquote-userid=\u0022111983\u0022 data-ipsquote-username=\u0022scy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7 August 2016 at 10:21 PM, scy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUse a German keyboard? Linux has various other solutions, but you have to go look for them.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother great chapter, KSK. Great interview and I love having to join the dots a little to follow the story and work out what\u0027s going on... like why a female pilot was requesting permission to enter Wakiran airspace.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m curious though - what picture did you get when you joined the dots?\n\u003C/p\u003E\n"},{"CreatedByName":"GKSP","CreatedById":160883,"CreatedDateTime":"2016-08-11T01:55:44Z","Content":"\n\u003Cp\u003E\nOnce again, that was an excellent chapter.  Great job KSK!\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"scy","CreatedById":111983,"CreatedDateTime":"2016-08-11T21:38:14Z","Content":"\n\u003Cp\u003E\nWell, I was thinking of Val, and her top secret military stuff... which was several chapters back and I still don\u0027t have a clue how it ties in really. But then I realised, yes, this was commercial collaboration... but I still don\u0027t get why Wernher took a private jet. Presumably even with the heightened tensions kerbals still travel and there are international airlines?\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-12T08:35:15Z","Content":"\n\u003Cp\u003E\nMore on Val in a couple of chapters which will hopefully clear things up a bit. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd you\u0027re right - international flight is still a thing but it\u0027s being increasingly disrupted by the heightened tensions. Air passengers get a bit nervous at the sight of fighter jets out of the window and for their part, the various border security forces get \u003Cem\u003Every\u003C/em\u003E nervous about civilian air traffic. It\u0027s unlikely that anything will go wrong but it just takes one mistake...\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s one of the reasons Wernher was sent over on a private jet. Not to mention that, right now, VIPs don\u0027t get much bigger than cutting edge rocket scientists assigned to a potentially major part of Project Starseed.  There\u0027s also a certain amount of \u0027waste anything but time\u0027 kicking in, so private jet travel for key KSA personnel is less of an issue than it might have been.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, private jets are well... private. Which is helpful if you\u0027re reviewing highly confidential briefing notes on nuclear reactors. \u003Cem\u003EEspecially\u003C/em\u003E compact, high powered nuclear reactors. In fairness the risk of a random air passenger even understanding what most Wernher\u0027s notes meant was pretty low, but the KNSA isn\u0027t noted for its willingness to take risks.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-12T08:36:50Z\u0022 title=\u002208/12/2016 08:36  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 12, 2016\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-25T20:44:46Z","Content":"\n\u003Cp\u003E\nSorry about the wait folks but this one turned out to be more complicated than I first thought, with bits of it needing quite a bit of rewriting along the way. The good news is that the next chapter is about done - I originally planned to roll it into this one but there\u0027s only so many section breaks you can include in a single chapter. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyway, for better or for worse, the next chapter is up. This one\u0027s for superstrijder...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003EFor Kerm and Kerbal\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe sound of the door opening failed to disturb either of the kerbals at the table, both with heads bent over their tasks and, Gerselle was amused to see, both with tongues protruding from the corner of their mouths. She watched the younger kerbal carefully cut a drinking straw into small pieces and the older, no less carefully, wind a strip of wet paper around a wire frame. Smiling to herself, she waited for Joenie to finish before closing the door behind her and putting down her bags. The clank of bottles managed to do what an opening door could not, and Joenie looked up inquisitively. “Mummy! Did you get juice?” She bounded to her feet and rushed over for a hug.  \n\u003C/p\u003E\n\u003Cp\u003E\n“Look out for the bags, sweet… \u003Ci\u003Ecareful\u003C/i\u003E, Joenie! You’ll break all the bottles and then you won’t have any juice! No, let me carry them - you can carry the vegetables for me. Oh, thank you, Enely.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Not a problem,” Enely replied easily, picking up two shopping bags and lifting them onto the kitchen bench. “Do you need any help chopping or slicing?”\n\u003C/p\u003E\n\u003Cp\u003E\n“I’ll be fine,” said Gerselle. “There’s not much to do. And besides,” she added, raising an eyebrow, “I’ll need my washing bowl back before we eat.”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely looked slightly abashed. “Yes, yes, of course. Come on, Joenie, I’ve finished the first layer - do you want to do the next one?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Can I have some juice first, Mummy?”\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle sighed. “You can have a little glass - I don’t want you filling yourself up before supper.” She pulled a bottle of fruit juice out of the grocery bags and poured some out for Joenie, who promptly gulped it down before clambering back onto her chair. Resignedly, Gerselle watched her dig her hand into the washing bowl and retrieve a fistful of dripping paper.\n\u003C/p\u003E\n\u003Cp\u003E\n“Not as much as that, Joenie. Look.” Enely demonstrated with his own, smaller handful. Joenie dropped her wad of paper back in the bowl, giggling at the soggy, splattering noise it made, before picking up a clump of strips between finger and thumb and moulding them onto the growing model. Gradually, with the occasional patient suggestion, the wire framework acquired a more-or-less even shell of papier-mâché. \n\u003C/p\u003E\n\u003Cp\u003E\n“Why don’t you put the last bit there, Joenie? There you go - perfect!” Enely surveyed the finished model, feeling obscurely pleased with himself. “I’ll just go and wash out the bowl and then we can make the grooves. Gerselle looked up from stirring her saucepan to see a bulbous, grey…something standing on a square of cardboard. Enely caught her eye with an embarrassed little smile. “It’ll look better once it’s marked, spined and painted.” he said.\n\u003C/p\u003E\n\u003Cp\u003E\n“Do you like my kerbahusk, Mummy?” said Joenie.\n\u003C/p\u003E\n\u003Cp\u003E\n“It’s very good, sweetheart,” said Gerselle, “but what is it?”\n\u003C/p\u003E\n\u003Cp\u003E\n“It’s a cactus, Mummy - we’re learning about deserts at school, remember!”\n\u003C/p\u003E\n\u003Cp\u003E\n“Oh, yes - of course you are.” Gerselle smiled. “And I think I know who’s going to take in the best homework on Münday.” She cast an amused half-smile at Enely, who shrugged.\n\u003C/p\u003E\n\u003Cp\u003E\n“I’m Hazachim. If there’s one thing I do know about, it’s cactuses.” He picked up a paintbrush and turned to face Joenie. “A real kerbahusk has big grooves running down it - like this.” He gouged a channel in the still-pliant papier-mâché with the brush handle. “And the bits between the grooves are are covered in spikes. Why don’t I do the grooves and you can make all the spikes with bits of straw?”\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle turned the heat down under her pan. “And then you can \u003Cem\u003Eboth\u003C/em\u003E clear and set the table.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n—————\n\u003C/p\u003E\n\u003Cp\u003E\nThe supper dishes were cleared away, the finished model cactus put on top of Joenie’s toy box to dry, and Enely was busying himself with the coffee pot. He could just hear Jonton’s voice from next door, punctuated by indistinct questions from Joenie. He took two mugs out of the cupboard and arranged them on a tray, the coffee burbling away behind him.\n\u003C/p\u003E\n\u003Cp\u003E\n“Night night, Enely!”\n\u003C/p\u003E\n\u003Cp\u003E\nHe turned to see Joenie in her nightdress, clutching a book with one hand and Gerselle’s hand with the other. “Peaceful night, Joenie. Painting tomorrow, yes?”\n\u003C/p\u003E\n\u003Cp\u003E\nJoenie nodded enthusiastically, unsuccessfully stifling a yawn.\n\u003C/p\u003E\n\u003Cp\u003E\n“Come on, you,” said Gerselle, “otherwise you’ll be asleep before we can finish your story.” She led Joenie away. Jonton picked up the coffee tray and went through to the sleep room.\n\u003C/p\u003E\n\u003Cp\u003E\n“Good evening, Jonton.”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton shook himself, leaves rustling around his head. “Evening, Enely.” He sniffed the air. “Coffee smells good.” He paused. “Hmmm, smells tempting in fact. You couldn’t bring me a mug too could you please?”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely hid his surprise behind a show of fussing with the tray. “Of course. I’ll be right back.” He hurried through to the kitchen, returning with the first mug that came to hand. Jonton raised his eyebrows at the \u003Cem\u003ETwelve Riders\u003C/em\u003E logo printed on the side but decided not to say anything. He took the full mug from Enely and sipped it cautiously.\n\u003C/p\u003E\n\u003Cp\u003E\n“Ahhhhh, that hits the spot, as Fredlorf would say. Funny - it’s been forever since I wanted anything but plain water but that coffee just smelt right tonight.” He grinned. “Got a kick to it too after so long without. Shall we see what’s going on in the world?”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely nodded and switched on the television before settling into one of Gerselle’s new sack chairs with his own mug of coffee.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“…so, plenty left to do in Kerbin orbit, Bob?”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Very much so - and then the real work begins.”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“I think that probably counts as one of the biggest understatements we’ve ever heard in this studio, Bob. Moving further afield though, do you have any updates for us on the Mün or Minmus programmes?”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBob leaned forward in his chair. “Absolutely,” he said. “Preparations for Pioneer 6 are going well and we expect to be launching as planned. Then we’ll be taking a break from the Mün to focus on Minmus. We’re planning at least two crewed flights, maybe three if all goes well. After that, we’ve got some big plans for Pioneers 7 and 8! We’ll be using a much bigger lander, so the crews will be able to take a lot more supplies with them to the Mün and stay on the surface for longer. Incidentally, building a bigger Mün lander will also give us some valuable experience in building a Duna lander when the time comes. We’re also thinking about sending a rover to the Mün for long range surface EVAs.”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“You mean a car, Bob?”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBob laughed. “Nothing so grand I’m afraid. More like a small buggy, probably not much bigger than a tik-tik, although it will be battery powered. We won’t be making the crews pedal in their spacesuits.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe presenter chuckled. “I’m sure that wouldn’t work too well. Now, I know this is a sensitive topic, Bob but I’m afraid I do have to ask. Is it true that Commander Ribory has started practicing in the landing trainer despite all the safety concerns.”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“The\u003C/em\u003E new\u003Cem\u003E landing trainer,” Bob corrected him. “She has, and I watched her first training session myself. The Mark 2 trainer doesn’t look a lot different on the outside but the fly-by-wire system - the computer and sensors that control it - have been completely overhauled and re-qualified. We’ve been working extensively with the Kerbin Air Accident Board to make sure that none of our previous mistakes were repeated.”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“So are you saying that the KSA accepts responsibility for the accident?”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“The KAAB report is on the public record,” said Bob calmly. “The KSA fully accepts its conclusions and is working around the clock to fulfil it’s recommendations. We’re completely reorganising our crewed spaceflight operations and rescheduling our major crewed programmes to make sure that we can dedicate all our resources to them. Right now of course, we’re expanding those resources to cope with the demands of Project Starseed but until then, as I mentioned earlier, we’ll be running a single munar programme at a time…”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n“Mün buggies.” Jonton shook his head. “I’ll bet young Gildas can’t wait to see those!”\n\u003C/p\u003E\n\u003Cp\u003E\n“I’d like to see them too,” said Enely, “I wonder how they’ll get them to the Mün?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Get what to the Mün?” said Gerselle, closing the door behind her. She blinked at the steam rising from Jonton’s mug. “A hot drink, dear?”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton grinned. “Yep. Like I said to Enely, that coffee just smelt right tonight.”\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle traded a worried look with Enely. “I suppose it has been a long time,” she said uncertainly, picking up her own mug. “but if it keeps you awake all night…”\n\u003C/p\u003E\n\u003Cp\u003E\n“No danger of that,” said Jonton, “after a day rebalancing the breadfruit fields. Feels like I’ve spent the day with Fred’s old hoe, pulling out the knotweed by hand. Did you still want to watch me working on the nematodes tomorrow, Enely?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Very much, if it wouldn’t be a trouble,” said Enely.  A change of picture on the television screen caught his eye and he turned his head to watch. “The Council chamber?” His eyebrows shot up and he raised a hand for quiet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“…depredations wrought by these so-called Children of Kerbin. No more excuses. If Wakira cannot or will not control these incursions, then Firesvar must take steps to protect its borders.” President Enemone strode coldly back to her seat, pointedly ignoring President Lanrick and Chief Ambassador Burvis opposite her.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe broadcast cut back to a group of kerbals sitting in the KBS studio. Enely walked over to the television and muted the volume. “So the… \u003Cem\u003Eseffleks\u003C/em\u003E have finally managed it,” he said, throwing himself into his sack chair. “The one Regionality that hasn’t been fighting - probably because nobody in their right mind picks a fight with Firesvar - and now these,” Enely’s jaw worked “\u003Cem\u003Ebjedla\u003C/em\u003E idiots stuff a cactus straight…” He broke off. “Sorry.”\n\u003C/p\u003E\n\u003Cp\u003E\n“You need to teach me some Hazachim,” Gerselle observed, “It sounds like the perfect language for moments like these.”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton sighed. “I have some sympathy for their goals,” he said, “but planting new Groves without care or thought to the \u003Cem\u003Eother\u003C/em\u003E ones around them? I can’t imagine a worse thing to do for their own Kerm, let alone the others.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“I can,” said Enely bleakly.\n\u003C/p\u003E\n\u003Cp\u003E\nJonton looked at him. “Of course you can,” he said softly. “I’m sorry, Enely.”\n\u003C/p\u003E\n\u003Cp\u003E\n“I wouldn’t care,” said Gerselle, “but nobody is planning to lock their seeds away in a freezer and just forget about them. And if we do end up taking them to Duna, they’ll need to travel in cold storage anyway - I can’t see anyone building a spaceship big enough to plant Kerm in.”\n\u003C/p\u003E\n\u003Cp\u003E\n“No,” said Enely. “Not if those Mün ships are anything to go by.” He stifled a yawn. “Anyway, I think I’ll go to bed. Thank you for the company.”\n\u003C/p\u003E\n\u003Cp\u003E\n“I think I will too,” said Gerselle, gathering up the coffee mugs and following him out of the door “and hope for better news tomorrow.” Once Jonton was out of earshot she beckoned to Enely. “Coffee?” she whispered, “When did he start drinking coffee again?”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely looked at her silently. \u003Ci\u003EDoes she know? She must know\u003C/i\u003E. “Forgive me,” he whispered back, “I’ve been trying to find the right time but it’s difficult to talk about. The first time I communed with him, the whole experience was so strange that I didn’t think anything of it. I thought it would just go away but…”\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle stared at him. “A barrier. A soft patch?”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely nodded frantically. “Yes, exactly that. A soft patch - and it’s getting bigger.”\n\u003C/p\u003E\n\u003Cp\u003E\n“You think it has something to do with the coffee?”\n\u003C/p\u003E\n\u003Cp\u003E\n“I don’t know. I can’t think what else it would be.”\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle gripped his shoulders. “You’re communing again tomorrow…” It wasn’t a question.\n\u003C/p\u003E\n\u003Cp\u003E\n“Yes - yes I will.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n——————\n\u003C/p\u003E\n\u003Cp\u003E\nThe next morning, Enely lay down on his usual bunk feeling as though he’d swallowed a handful of especially restless caterpillars for breakfast. Jonton hummed to himself, leaves rustling in the morning sunlight, as he finished his morning exercise routine, stretching his arms over his head and cracked his knuckles. “Right then - nematodes! Ready to get started?”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely wedged another pillow under his head in reply and let his forehead brush against the waiting leaf cluster. White light unfolded in his mind, brighter than usual and somehow faster and sharper. \u003Cem\u003EProbably the caffeine\u003C/em\u003E, he thought. \u003Cem\u003EI should tell him - too much caffeine could make this difficult.\u003C/em\u003E Then the white light faded into a muddy brown mindscape.\n\u003C/p\u003E\n\u003Cp\u003E\n“The first thing to know about nematodes,” Jonton began, “is that I have to ignore most of them. When you can get up to a couple of million microscopic worms in a square metre of soil and Kerm knows…” He broke off with a rueful cough. “Actually, the Kerm doesn’t know how many species. Anyway, there are too many to keep track of, let alone control. The good news is that most of them will just get on with it.” \n\u003C/p\u003E\n\u003Cp\u003E\nThe muddy brown faded into a blotchy sandy colour. “Bacterivores…” Dark green patches spilled over the blotches. “Fungivores.” Dark grey strands zig-zagged over the green and sand, sprouting ever denser tangles of filaments and turning the mindscape back to its original mud-brown colour. “And the tangled webs of predators that feed on them and on each other. That part I can control to an extent, or rather I can poke at the webs to nudge them into the right shape. If I think too hard about what I’m doing it all starts to go wrong - that was the big mistake I kept making to begin with.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nA regular array of ragged, lighter green dots appeared. “Now \u003Cem\u003Ethese\u003C/em\u003E,” Jonton said enthusiastically, “are the rhizospheres and this is where things get really interesting!”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely listened to Jonton’s increasingly detailed explanation of plant root environments and nematode balances with half an ear, whilst surreptitiously searching for the soft patch in Jonton’s mind.\n\u003C/p\u003E\n\u003Cp\u003E\n“…and this is a beautiful example! Normally, these would be a serious pest but when they start chewing up the gingergrass roots, the damaged roots exude a group of pheromones which attract the right predatory nematodes to feed on the parasites. With a bit of encouragement, a bit of gingergrass can keep the whole field clean of the little swines!”\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EActually, that does sound interesting. The Berelgan researchers will be all over this kind of data. Maybe they’ll even be taking gingergrass to Duna\u003C/em\u003E. Enely stopped short. \u003Cem\u003EOh my…\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe soft patch yawned open, revealing an iridescent membrane underneath. Oily swirls of colour rippled under the surface and as Enely leaned closer he made out snatches of sounds and scents and even the occasional word. The swirls seemed to sense his presence, darting towards him, growing thicker and richer, stretching the membrane to a translucent shimmer. Words became mumbled fragments of sentences, their meaning lurking just out of reach. Then, quietly, as if heard from the next room, two words echoed though Enely’s head.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0026lt;Help me\u0026gt;\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n——————\n\u003C/p\u003E\n\u003Cp\u003E\n“And then a voice asked me to help it,” said Enely. “Didn’t you hear it too, Jonton?”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton shook his head. “Not a thing. I haven’t heard any voices for a long time,” he added wryly, “and even then, they weren’t really talking to me so much as over me.” His eyes widened. “The shards…”\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle’s eyes met his. “The shards,” she whispered. “That might…” She gnawed on a fingernail. “I think there\u0027s only one thing I can do, love,” she said aloud. “Stop trying to keep the shards intact and just let them melt. Put all the pieces back together, give the Kerm its voice and let it concentrate on mending the Grove.” She saw Enely’s confused expression. “Something Jonton said to me before…before he went an-Kerm. I’ve never forgotten it.”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely gaped at them. “The shards happened when your Kerm shattered, yes?” He saw Jonton wince. “You let them go, let them become \u003Cem\u003Eyou\u003C/em\u003E…” He closed his eyes. “But what…”\n\u003C/p\u003E\n\u003Cp\u003E\n“But what if they didn’t?” finished Jonton. “Or not completely. Like oil and water maybe. Even if you shake them together really hard, they don’t stay mixed forever.” He bowed his head. “I remember what it was like after the shattering. Never being quite sure who or what I was, trying to hold onto the kerbal parts of me and being too terrified to sleep because that’s when the voices were strongest.”\n\u003C/p\u003E\n\u003Cp\u003E\n“We were both terrified,” said Gerselle quietly, “I was terrified that your mind would melt with the shards and that I’d never get you back again.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Looking back, I think it did,” said Jonton slowly. “but the kerbal part of me had had more practice at being ‘me’ - if that makes any sense - and held together somehow.” He swallowed hard. “The Kerm part of me had no idea, no practice at all. When I let go of the shards they must have fallen apart completely.”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely’s eyes snapped open. “Only now they’re pulling back together again and crying out for help!” He rocked back on his heels. “That’s what the voice reminded me of! Older - how could it not be older after all it had been through - but still like my Kerm!”\n\u003C/p\u003E\n\u003Cp\u003E\nThunderstruck silence greeted him.\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle opened her mouth and then closed it again. “What did Gusemy say about going an-Kerm?” she said faintly. “That nobody could condone the destruction of Kerm minds on a global scale? So what happens if the Kerm mind survives?”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton’s eyes met hers “It could be the answer we’ve been looking for. Break the Law of Thirty Seven in every Grove and have the Keepers volunteer to go an-Kerm. The new an-Kerm pull back their borders, make room for a newly planted Kerm and then, when the time comes, separate again, leaving an intact Kerm behind.” He shivered. “Although put like that it sounds beyond crazy.”\n\u003C/p\u003E\n\u003Cp\u003E\n“And instead we might start a second Age of Madness,” said Gerselle “Maybe we were just lucky, Jonton - and being lucky once is too slender a peg to hang the whole of Kerbin on.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Twice,” said Enely quietly. He looked at Jonton. “Your Kerm already survived one shattering back in the Age of Madness. It must have or it wouldn’t be here.”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton’s leaves twitched. “If it was communing at the time…what happened to my kerbals?” He swallowed. “If the Kerm survived did their minds break into shards instead?”\n\u003C/p\u003E\n\u003Cp\u003E\n“They might have pulled together again,” said Enely lamely.\n\u003C/p\u003E\n\u003Cp\u003E\n“This doesn’t sound right,” Gerselle said slowly. “I felt your \u003Cem\u003Escars\u003C/em\u003E, love, the first time we Communed - and I felt the \u003Cem\u003Eolder\u003C/em\u003E scars underneath.” She pinched the bridge of her nose. “Before…before us, I think your Kerm was just a Kerm. You’d \u003Cem\u003Eremember \u003C/em\u003Eif it had ever been an an-Kerm before. So the only way that the scars make sense is if they’re healed wounds from \u003Cem\u003Eboth\u003C/em\u003E shatterings. You let go of the shards and they knitted back together. Which explains how you learned to look after the Grove - your Kerm mind was still there somewhere.” She threw up her hands. “Don’t ask me what happened after that.”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton’s leaves rustled around his head and a sudden gust of cinnamon blew through the room. “Joenie,” he said quietly. “You remember when I was retreating from Patbro’s daughter’s…” He snapped his fingers. “From Tivie’s new Grove?”\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle nodded.\n\u003C/p\u003E\n\u003Cp\u003E\n“I never told you at the time but I nearly gave in. Not because of the pain, although help me that was bad enough, but because in the end I just couldn’t fight thousands of years of Kerm instinct howling at me to stop. It was Joenie who got me through. I remembered her pummelling my trunk with her little fists, telling the ‘bad tree’ off for hurting me. She was the anchor I needed and she helped me to remember the promise I made to everyone, that this an-Kerm would rather retreat than fight.” Jonton’s voice trembled. “It was barely enough and I felt it tear something inside me. There were times after that where I’d be checking the fields, find that everything was fine, and have absolutely no recollection of doing the work myself. I put it down to muscle memory - a sign that looking after the Grove was becoming automatic. Of course I took this to be a good sign.” Jonton gave Gerselle and Enely a twisted smile. “A sign that I was becoming a proper Kerm.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Which you were in a way,” said Gerselle softly. “And that gives me an idea for helping the Kerm \u003Cem\u003Eand\u003C/em\u003E getting you back, Jonton Kermol. She looked at Enely. “It would need both of us though and your part could be painful.”\n\u003C/p\u003E\n\u003Cp\u003E\n“What do I need to do?” said Enely. “I’ve already lost one Kerm - if I can do anything to help another, I will.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Two anchors,” said Gerselle. “We both commune with Jonton. I help him remember what being kerbal is all about - give his kerbal self something to hang onto and rally around. You do the same for his Kerm self.” A hard lump of self-loathing settled in the pit of her stomach. “By showing it your Kerm. Young, newborn almost and untouched by kerbal thought. Trying to share it’s world with you.” She saw Enely’s expression. “I’m sorry, Enely - truly I am. But I don’t know who else to ask.”\n\u003C/p\u003E\n\u003Cp\u003E\nAnother gust of cinnamon filled the room. \n\u003C/p\u003E\n\u003Cp\u003E\nFor a long minute Enely stared at his feet unable to meet her, or Jonton’s gaze. \u003Cem\u003EWhen she said painful\u003C/em\u003E…Then he lifted his head, a haunted look in his eyes. “I will do this,” he said. “I will keep my word and do this.”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton bowed his head in silent acknowledgement. “We should speak to Erlin,” he said. “The Berelgan will need to know about this anyway and they’ll be able to help us with the other arrangements.” He looked at Gerselle. “We do things properly this time, love. Proper medical supervision, controlled conditions, someone there from the Berelgan to record everything. I had no idea what I was doing when I planted that thirty-eighth tree and look where that nearly got us. I can’t - I won’t take that kind of risk again. Not with either of you.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026lt;\u0026lt; \u003C/span\u003E\u003Cu style=\u0022text-align:left;text-transform:none;text-indent:0px;letter-spacing:normal;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;text-decoration:underline;word-spacing:0px;white-space:normal;\u0022\u003E\u003Cfont\u003E\u003Cfont color=\u0022#0b0114\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-115-now-and-forever/\u0026amp;do=findComment\u0026amp;comment=2699006\u0022 rel=\u0022\u0022\u003EChapter 66\u003C/a\u003E\u003C/font\u003E\u003C/font\u003E\u003C/u\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E:     \u003C/span\u003E\u003Cu style=\u0022text-align:left;text-transform:none;text-indent:0px;letter-spacing:normal;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;text-decoration:underline;word-spacing:0px;white-space:normal;\u0022\u003E\u003Cfont\u003E\u003Cfont color=\u0022#0b0114\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-115-now-and-forever/\u0026amp;do=findComment\u0026amp;comment=2731963\u0022 rel=\u0022\u0022\u003EChapter 68\u003C/a\u003E\u003C/font\u003E\u003C/font\u003E\u003C/u\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026gt;\u0026gt; \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-01T14:36:11Z\u0022 title=\u002205/01/2020 02:36  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 1, 2020\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-27T08:19:37Z","Content":"\n\u003Cp\u003E\nAnd this one\u0027s for Ten Key...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ENow baby call;\u003Cbr\u003E\nAnd see the sunlight shining in the sky.\u003Cbr\u003E\nLet the sunlight open up your eyes.\u003Cbr\u003E\nNow, is the time for love.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBad Company - \u003Ca href=\u0022https://www.youtube.com/watch?v=JaZJQqsPwr8\u0022 rel=\u0022external nofollow\u0022\u003ESee the Sunlight.\u003C/a\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003EA Time for Love\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJoenie put on her coat and sat down to tie up her shoes. “I don’t want to go to Adbas’s house,” she said. “I want to help Daddy with the Kerm tree.”\n\u003C/p\u003E\n\u003Cp\u003E\n“I know you do, sweetheart,” said Gerselle, “but we’re all going to be busy talking to the Kerm ourselves and the doctors are going to be busy looking after us while we’re talking. There won’t be any room in the sleep room for you too.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Why are the doctors coming? Why will you need doctors to talk to the Kerm?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Because we’re going to be talking to it for a long time, popkin,” said Jonton. He tapped the vines coiled around his waist. “And asking it nicely to let go of me so I can go outside again.”\n\u003C/p\u003E\n\u003Cp\u003E\nJoenie scowled. “Don’t call me popkin, Daddy. I hate being called popkin!”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton hid a smile. “I’m sorry Joenie. I keep forgetting you’re too old to be a…”\n\u003C/p\u003E\n\u003Cp\u003E\n“Daddy!”\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle checked the clock. “Adbas will be here any minute, sweetheart. Do I get a hug before you go?” \n\u003C/p\u003E\n\u003Cp\u003E\nJoenie wrapped her arms around her mother’s waist, burying her face in her poncho. “Be careful Mummy.” Deliberately she pitched her voice in the squeaky tones of a younger kerblet. “Up, ‘ummy? Hug Daddy?” Gerselle laughed despite herself and, swinging Joenie up into her arms, turned her around to face Jonton. Joenie leaned forward and kissed her father on the nose. “Be careful too, Daddy.”\n\u003C/p\u003E\n\u003Cp\u003E\nJonton kissed her back. “I will, sweetheart. We all will.” \n\u003C/p\u003E\n\u003Cp\u003E\nJoenie wriggled out of Gerselle’s arms and, to Enely’s astonishment, ran over and flung her arms around his waist. “And you be careful, Enely!”\n\u003C/p\u003E\n\u003Cp\u003E\nAwkwardly, Enely patted her on the head. “I will,” he said. “I promise. We still need to make a mallek to go with your cactus, yes?”\n\u003C/p\u003E\n\u003Cp\u003E\nThe doorbell rang. Joenie let go of Enely, waved at everyone and ran for the door. Gerselle picked up Joenie’s backpack and followed her.\n\u003C/p\u003E\n\u003Cp\u003E\nThere was a long silence. \n\u003C/p\u003E\n\u003Cp\u003E\n“Are you sure you want to do this, Jonton?” said Enely at last. \n\u003C/p\u003E\n\u003Cp\u003E\nJonton nodded. “I’m sure,” he answered. “It’s been…something else, but I do want to go outside again and see the world with my own eyes.” He sighed. “Besides, from what you and Gerselle were saying, I think it’s going to happen anyway - and just for once, I’d like to decide something for myself rather than waiting until it’s too late.”\n\u003C/p\u003E\n\u003Cp\u003E\nEnely walked over and gripped him by both shoulders. “Bravely said, Keeper. We’ll be there for you.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n——————\n\u003C/p\u003E\n\u003Cp\u003E\nThe harsh, aseptic smell of rubbing alcohol drowned out the sweeter aroma of surgical adhesive as one of the medics swabbed down Enely’s forehead and wrapped a not-quite-skin coloured elasticated band just under his hairline, leaving the top of his head clear. Gerselle lay on her bed, already wearing her band, a thick skein of multicoloured wires emerging at the nape of her neck and snaking across the floor to an equipment trolley. Enely settled himself on a nearby bunk and watched the other medic at work on Jonton’s forehead, beads of perspiration trickling down his neck as he threaded an electrode pad through the gap between two Kerm leaves and delicately pressed it into place against the an-Kerm’s skin. Clumps of grey-flecked hair lay scattered on the floor around them.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first medic walked over to the equipment trolley and plugged in Enely’s band. He pressed a button, waited a moment and then leaned forward to peer at a dense array of lines beginning to scribble their way across one of his monitors. He glanced at Gerselle’s monitor then looked up at the two kermol. “Your bands are working nicely. How do they feel?”\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ELike somebody’s knuckling the sides of my head\u003C/em\u003E, thought Enely. “No worse than you’d expect,” he said. Gerselle grunted in agreement.\n\u003C/p\u003E\n\u003Cp\u003E\n“They do feel a bit tight at first but most people get used to them in a few minutes,” the medic said soothingly. “And they’re a lot better than hooking all three of you up the the old-fashioned way.” He gestured at Jonton, who was canting his neck to one side to allow yet another electrode to be glued to the side of his head, the coloured wires threaded between his leaves in an uneasy sculpture of biology and technology. His medic carefully inspected his work before joining his colleague at the monitors, an obvious look of relief crossing his face. He blinked at the third screen.\n\u003C/p\u003E\n\u003Cp\u003E\n“Ohhh-kay. I think this is working.” He tapped the side of the monitor and checked the plug connecting it to Jonton. “Definitely got brainwave activity you’ll be happy to know but it’s not like anything I’ve ever seen before. According to this you could be asleep, communing, having a fit… Kerm I don’t know.”\n\u003C/p\u003E\n\u003Cp\u003E\n“That bedside manner needs a little more work,” his colleague noted, apparently to himself. He smiled reassuringly at Enely and Gerselle. “Everything looks just fine from here so please just relax and start whenever you’re ready.” \n\u003C/p\u003E\n\u003Cp\u003E\nGerselle lifted her head up to the waiting leaf cluster, Enely following just behind her. Their EEG traces shivered and then went abruptly berserk. \n\u003C/p\u003E\n\u003Cp\u003E\nFamiliar white light filled her mind, washing away the sleep room ceiling. She sensed Enely joining her, his nervousness mirrored by her own, churning up the lambent mists around her. Mists that flowed over and around long gone scars before swirling away into darkness and fear. Instantly her own unease spiked into fright which rebounded off Enely’s already heightened nerves and magnified, lashed back at her.\n\u003C/p\u003E\n\u003Cp\u003E\nPractice and experience overcame instinct. Gerselle clamped down on her own roiling emotions, absorbing the fear and burying it beneath the surface. Cautiously, she extended her awareness through their slender, fragile link, reaching out to her partner, recalling the intensity and the joy of their first communion and letting it wash over them both.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIt’s all right my love. We’re going to be fine - we’re all going to be fine.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWe’ve got you, Jonton\u003C/em\u003E, Enely said.\u003Cem\u003E As the Hazachim say, our water is yours and we’ll keep the speargrass from your fields.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n—————\n\u003C/p\u003E\n\u003Cp\u003E\nErlin watched the monitors anxiously, willing order on the chaotic patterns sprawling across all three screens. One of the medics got up, moving quickly from patient to patient, checking pulses and noting eye movements before moving on.\n\u003C/p\u003E\n\u003Cp\u003E\nTwo of the three monitors settled into a set of steadier rhythms, punctuated by irregular bursts of activity. Erlin stared at the complex rhythms on third screen in fascination. Each cycle of the underlying waveforms perturbed into a smaller and smaller copies of themselves, turning to fuzz as the detail passed beyond the ability of the screen to display. Gradually two of the glowing traces strengthened, shimmered and shifted, each mirroring a trace on one of the other screens.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second medic blew out his cheeks in relief. “They’re in! Longest rapport time I’ve ever seen but they’re in.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n—————\n\u003C/p\u003E\n\u003Cp\u003E\nWith an effort, Enely put Gerselle’s voice to the back of his mind, letting their link dwindle to a filament of emotions and half-formed images and words. He sent a last wave of reassurance to Jonton, before closing their link down to a bare trickle of sensation. For a moment he floated in the darkness, breathing deeply, gathering himself for the task to come. Then he re-opened the link, letting his thoughts skip lightly over the surface of Jonton’s awareness. Probing for the flaw in the the other’s memories, softly calling out to it, careful not to disturb the an-Kerm’s link with Gerselle. \n\u003C/p\u003E\n\u003Cp\u003E\nThe flaw found him.\n\u003C/p\u003E\n\u003Cp\u003E\nLarger than ever before, the membrane ballooned out towards him like a shimmering, iridescent soap bubble, thought patterns flickering beneath it’s surface. Slowly, Enely let his own thoughts brush against it, opening himself to it, letting himself sink into receptivity. The bubble puckered and swirled in response, ripples racing across it, reflecting off hidden lodes of deeper thought. The puckers deepened into folds and rilles, lodes became tendrils, probing at the bubble, stretching it to bursting but unable to break through. Memories of scents and fragmented images billowed from the surface, both edged with frustration and pleading. Enely saw Joenie hurtle past, saw images of faces and a flag, saw himself and Gerselle sitting on cushions, placing pieces on a game board.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0026lt;help me\u0026gt;\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGritting his teeth, Enely plunged into his past, tearing through half-healed scabs, ripping through times of sorrow and loss, reliving moments of pain and grieving. Reaching for happier days; for a mental picture of a smiling kerbal used to greet a new Kerm. Reaching for a barrage of scents and a medley of coloured blotches and swirls; the chatter from an infant Kerm sharing it’s world for the first time, untouched by contact with kerbals. Enely imagined himself cupping his hands protectively around those few precious memories, shielding them from the raging bubble, holding them up to its helplessly writhing surface.\n\u003C/p\u003E\n\u003Cp\u003E\nGradually the lashing tendrils slowed, the fragmented images sucked back beneath the surface, retreating into quiescence. The bubble quivered, folds and rilles slipping into new patterns, frustration giving way to curiosity, pleading to expectation. \n\u003C/p\u003E\n\u003Cp\u003E\nEnely smiled and opened his hands.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n—————\n\u003C/p\u003E\n\u003Cp\u003E\nWith relief, Gerselle sensed Enely drifting away. She paused for a moment, checking that their link was still there if needed, then turned all her attention to Jonton. \u003Cem\u003EMy Jonton. Kerman not an-Kerm.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHow do we do this, love?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EDo you remember what you told me when you were learning to tend the Grove? Feel, taste or smell only, you told me. Seeing was a crutch - too slow and clumsy for what you needed. It was\u003C/em\u003E kerbal \u003Cem\u003Ethinking you said.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nComprehension lit up Jonton’s mind.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EExactly. Remember the sights of your Grove, my love. Walking the fields, seeing the crops, the colours of the flowers, the earth beneath your feet and the blue skies above you. Remember clouds and sunlight on water. Remember the sounds of the river - birdsong and the splashing of water on rock. I’ll help you.\u003C/em\u003E  Gerselle dipped into her own memories; herself standing by a gate, watching Joenie scampering down a lane towards a grey robed kerbal, who dropped to his knees and swept her into his arms. \n\u003C/p\u003E\n\u003Cp\u003E\nSlowly, tentatively, a mirror image of the same scene trickled down the link. In the distance a kerbal by a gate, a kerblet sprinting down the road as fast as her little legs could carry her. A lurching drop, the pavement suddenly a lot closer; then an explosion of green and an armful of squirming toddler and excited babble.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same scene washed over her again. Fainter this time and blurred, like a picture of a picture. The link wavered and Jonton’s tentative image fell apart, blowing away like dust. \u003Cem\u003ESorry, love.\u003C/em\u003E Jonton’s mental voice sounded abashed. \u003Cem\u003EI remember that day - of course I do - but I shared it with my trees… with my Kerm I mean.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EI could see you remembering\u003C/em\u003E, Gerselle replied. Understanding and encouragement flowed through the link. \u003Cem\u003EWe’ll try another one. Focus on \u003C/em\u003Eyour \u003Cem\u003Ememories, not the pale reflections.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSome time later, the understanding and encouragement was beginning to wear thin. Every memory that Gerselle chose echoed between herself and Jonton, leaving mere after-images and fading reflections behind. The first sight of Joenie curled up in the bottom of her pouch had triggered the strongest reaction yet and for a moment, she thought the tiny, wrinkled figure, so newly born as to be barely recognisable as a kerblet, would be the anchor they sought. Then it too fell apart; a memory caught between two mirrors, reflections of reflections receding into a sparkling mote of dust.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIs there anything you didn’t share with that Kerm, Jonton Kermol?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSilence answered her question. Behind it she sensed Jonton’s growing desperation and behind that, a storm of frustration and pleading directed at Enely.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EOne more memory to try then. And if you’ve shared this one oh partner of mine, then we are going to have \u003C/em\u003Ewords. \u003Cem\u003EI’m sorry, Enely\u003C/em\u003E, she thought aloud. I\u003Cem\u003Ef it makes you feel any better, I didn’t want to do this either...\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLambent mists swirled through the darkness and became sunlight.\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle stood in the centre of the clearing, surrounded by a half circle of her friends and closest family, chosen to be her Witnesses. Music played in the background as a scrubbed and very much younger Jonton, accompanied by his own chosen companions, stepped into the clearing. He joined her in the centre, the ring of Witnesses closing behind them. All the right words in all the right places. A golden torc placed gently around her neck and then Jonton in her arms.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rest of the afternoon passed by in a blur of music, dancing and well-wishers; a beaming Jonton by her side the whole time. Finally, as the sun set over the Grove, they made their way up the hill towards the Keeper hut, the path before them strewn with flower petals. She had a vague recollection of a door closing behind them and then Jonton’s hands quivering as he undid the clasp on her torc…\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n—————\n\u003C/p\u003E\n\u003Cp\u003E\nTwo faces suddenly blushed a furious dark green. \n\u003C/p\u003E\n\u003Cp\u003E\nErlin blinked at Gerselle and Enely, still supine on their beds, and then stared in outright astonishment as Jonton’s face turned an equally striking colour.\n\u003C/p\u003E\n\u003Cp\u003E\n“Great Kerm above…” said one of the medics quietly.\n\u003C/p\u003E\n\u003Cp\u003E\n“I’m not sure I want to know,” Erlin murmured.\n\u003C/p\u003E\n\u003Cp\u003E\n“What?” The medic glanced up. “Never mind that - would you look at this!”\n\u003C/p\u003E\n\u003Cp\u003E\nErlin froze. The baroque, nested waveforms had disappeared. Three perfectly normal sets of EEG traces whisked quietly across the screens in front of him.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n—————\n\u003C/p\u003E\n\u003Cp\u003E\nThe sunlight shrank to a pinprick; a brightness at the end of a tunnel. Jonton stifled a cry as the world closed in around him, trapping him, numbing his roots and cutting off his connection to the earth. Leaves, twigs and branches followed. Frantically he threw himself at the communion link trying to submerge himself in its comforting familiarity.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0026lt;open your eyes\u0026gt;\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe voice was kindly but firm. The link shrank to a hair-fine thread, a vast presence gently turning Jonton away.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0026lt;put down the burden dear friend. It is no longer yours to carry\u0026gt;\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle and Enely floated awestruck in the back of his mind. The presence wrapped around them like a blanket, holding them warmly in the blackness.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWho are you?\u003C/em\u003E Jonton managed at last.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0026lt;I am Kerm\u0026gt;  Puzzled. \u0026lt;You know this\u0026gt;\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EI know\u003C/em\u003E what \u003Cem\u003Eyou are\u003C/em\u003E, said Jonton carefully, \u003Cem\u003Ebut\u003C/em\u003E who \u003Cem\u003Eare you? Do you have a name?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0026lt;I have never needed such before. We speak, I know you, we are friends. That is all that matters\u0026gt;\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGerselle came forward. \u003Cem\u003EIt is\u003C/em\u003E, she agreed, \u003Cem\u003Ebut it would be easier for us - for us kerbals I mean - if we had a name to call you by. My name is Gerselle - and the one who carried your burden is Jonton.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0026lt;Gerselle… Jonton… \u0026gt; The Kerm paused. \u0026lt;Very well my friends, I too will have a name\u0026gt;\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0026lt;My name is Elton\u0026gt;\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026lt;\u0026lt; \u003C/span\u003E\u003Cu style=\u0022text-align:left;text-transform:none;text-indent:0px;letter-spacing:normal;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;text-decoration:underline;word-spacing:0px;white-space:normal;\u0022\u003E\u003Cfont\u003E\u003Cfont color=\u0022#0b0114\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-115-now-and-forever/\u0026amp;do=findComment\u0026amp;comment=2729750\u0022 rel=\u0022\u0022\u003EChapter 67\u003C/a\u003E\u003C/font\u003E\u003C/font\u003E\u003C/u\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E:     \u003C/span\u003E\u003Cu style=\u0022text-align:left;text-transform:none;text-indent:0px;letter-spacing:normal;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;text-decoration:underline;word-spacing:0px;white-space:normal;\u0022\u003E\u003Cfont\u003E\u003Cfont color=\u0022#0b0114\u0022\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight-chapter-115-now-and-forever/\u0026amp;do=findComment\u0026amp;comment=2776921\u0022 rel=\u0022\u0022\u003EChapter 69\u003C/a\u003E\u003C/font\u003E\u003C/font\u003E\u003C/u\u003E\u003Cspan style=\u0022background-color:rgb(255,255,255);color:rgb(53,60,65);float:none;font-family:Roboto;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u0026gt;\u0026gt; \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-01T14:37:25Z\u0022 title=\u002205/01/2020 02:37  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 1, 2020\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-08-28T07:05:02Z","Content":"\n\u003Cp\u003E\nElton... JONton... and rocketmen all over the place! Pretty sure there was a candle in the wind somewhere, too, and I\u0027m not sure about Benny and there\u0027s definitely been jets! I see what you\u0027re doing here!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AviosAdku","CreatedById":165040,"CreatedDateTime":"2016-08-28T22:39:17Z","Content":"\n\u003Cp\u003E\nWow! KSK, you\u0027ve done it again, another moving chapter that had me on the edge of my seat and ... I\u0027m at a loss for words, again. A simple \u0022like\u0022 isn\u0027t adequate for situations like this, the technical details adding depth and building the moment, I ... I don\u0027t know what to say. Made my day without a doubt, thank you.\n\u003C/p\u003E\n\u003Cp\u003E\nAku\n\u003C/p\u003E\n"},{"CreatedByName":"JakeGrey","CreatedById":61242,"CreatedDateTime":"2016-08-29T00:43:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222733043\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472367902\u0022 data-ipsquote-userid=\u002257438\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, CatastrophicFailure said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nElton... JONton... and rocketmen all over the place! Pretty sure there was a candle in the wind somewhere, too, and I\u0027m not sure about Benny and there\u0027s definitely been jets! I see what you\u0027re doing here!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, good Lord, I can never unsee it now you\u0027ve said that.\n\u003C/p\u003E\n"},{"CreatedByName":"superstrijder15","CreatedById":155985,"CreatedDateTime":"2016-08-29T11:45:36Z","Content":"\n\u003Cp\u003E\nThe Kerm finally has its(his, hers I don\u0027t know) sentience!! Thanks again for all these awesome chapters \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0026amp;do=hovercard\u0022 data-mentionid=\u002261025\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0022 rel=\u0022\u0022\u003E@KSK\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2016-08-29T12:24:34Z","Content":"\n\u003Cp\u003E\nTears, real tears, in my eyes.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-29T20:23:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222734326\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472471136\u0022 data-ipsquote-userid=\u0022155985\u0022 data-ipsquote-username=\u0022superstrijder15\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, superstrijder15 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Kerm finally has its(his, hers I don\u0027t know) sentience!! Thanks again for all these awesome chapters \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0026amp;do=hovercard\u0022 data-mentionid=\u002261025\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0022 rel=\u0022\u0022\u003E@KSK\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re always welcome. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  That\u0027s a good question by the way, to be addressed in the next chapter!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222734358\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472473474\u0022 data-ipsquote-userid=\u00228333\u0022 data-ipsquote-username=\u0022Commander Zoom\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Commander Zoom said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTears, real tears, in my eyes.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd again - you\u0027re always welcome! Recommend  not reading First Flight whilst chopping onions though. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nJesting aside, that was a big chapter for me too. A bit like \u0027Echoes of Time\u0027 (the big Kerm history reveal chapter back at the end of Part 2), I\u0027d been laying the groundwork for a long time and it was a bit nerve-wracking to finally release it. Oh - \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222733773\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472423957\u0022 data-ipsquote-userid=\u0022165040\u0022 data-ipsquote-username=\u0022AkuAerospace\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, AkuAerospace said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWow! KSK, you\u0027ve done it again, another moving chapter that had me on the edge of my seat and ... I\u0027m at a loss for words, again. A simple \u0022like\u0022 isn\u0027t adequate for situations like this, the technical details adding depth and building the moment, I ... I don\u0027t know what to say. Made my day without a doubt, thank you.\n\u003C/p\u003E\n\u003Cp\u003E\nAku\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt doesn\u0027t get a lot better than making somebody\u0027s day! Thanks - and there\u0027s another word that doesn\u0027t seem quite adequate for the task at hand. Incidentally, I have half a plan rattling round my head for something that I think you may like (judging from that last comment). It\u0027s a bit of, dare I say, very kerbal technology for which I think I can work in the right technical details to make it plausible. Bonus points if I can do that without a huge info dump. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s quite plot-important though and I\u0027m *really* looking forward to writing it, so I\u0027m hoping it\u0027ll translate well from noggin to page!\n\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2016-08-29T21:35:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222729750\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472157886\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/25/2016 at 2:44 PM, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI originally planned to roll it into this one but there\u0027s only so many section breaks you can include in a single chapter. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGuilty as charged. \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222734842\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472502203\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJesting aside, that was a big chapter for me too. A bit like \u0027Echoes of Time\u0027 (the big Kerm history reveal chapter back at the end of Part 2), I\u0027d been laying the groundwork for a long time and it was a bit nerve-wracking to finally release it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo worries there KSK. . .that was a perfect three-point landing. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2016-08-30T06:26:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222734842\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472502203\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBonus points if I can do that without a huge info dump.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe are ready to recieve thy wisdom!\n\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-09-19T16:07:32Z","Content":"\n\u003Cp\u003E\nSo... um...\n\u003C/p\u003E\n\u003Cp\u003E\nMOAR pls?\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-09-19T17:16:34Z","Content":"\n\u003Cp\u003E\nOn its way. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nJust under 2,000 words in, probably not going to be much more than 3,000 - 3,500 all told, unless it decides to expand in random directions in the writing. I got a bit stuck with the chronology on this one and thought I\u0027d boxed myself into a corner for a while. Figuring out a way to fix that took some time and last weekend was the first proper writing time I\u0027ve had for a while.\n\u003C/p\u003E\n\u003Cp\u003E\nNot a lot of time for writing this coming weekend either (nephew\u0027s 5th birthday and I can\u0027t let the wee man down) but I\u0027m hoping to have something out by Friday. Unless it sucks, in which case it\u0027ll be a while longer. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-19T17:48:08Z\u0022 title=\u002209/19/2016 05:48  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 19, 2016\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2016-09-19T22:25:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222764822\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474305394\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOn its way. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n I got a bit stuck with the chronology on this one and thought I\u0027d boxed myself into a corner for a while. Figuring out a way to fix that took some time and last weekend was the first proper writing time I\u0027ve had for a while.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027d be interested to hear the details on this when the time comes. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-19T22:27:31Z\u0022 title=\u002209/19/2016 10:27  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 19, 2016\u003C/time\u003E by CatastrophicFailure\u003C/strong\u003E\n\u003Cbr\u003EFlarp this flarping bag of flippleflarpery flarping editor! Flarp!\n\u003C/span\u003E\n"},{"CreatedByName":"SilverlightPony","CreatedById":79637,"CreatedDateTime":"2016-09-21T22:39:06Z","Content":"\n\u003Cp\u003E\nHoly crap, what a good story.  I need more of this in my life.\n\u003C/p\u003E\n\u003Cp\u003E\n/subscribed\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-09-22T11:35:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222768311\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474497546\u0022 data-ipsquote-userid=\u002279637\u0022 data-ipsquote-username=\u0022SilverlightPony\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, SilverlightPony said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHoly crap, what a good story.  I need more of this in my life.\n\u003C/p\u003E\n\u003Cp\u003E\n/subscribed\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n*does a happy dance*\n\u003C/p\u003E\n\u003Cp\u003E\nGlad you\u0027re enjoying it and thanks for dropping by to subscribe and comment!\n\u003C/p\u003E\n\u003Cp\u003E\nDoesn\u0027t look like the next chapter will be out by Friday although it is ticking along nicely. Got a wee bit stuck on a particular point of worldbuilding last night and discovered that I\u0027d lost my notes on it. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E Luckily there was a version of sorts on the forum, so I was able to rebuild (and embellish) the notes but then I also had to check back through the rest of the story to check for any continuity gaffes. That took a while.\n\u003C/p\u003E\n\u003Cp\u003E\nSo - not quite as many as many new words as I was hoping for last night but at least I\u0027ve got Kerbin\u0027s governing institutions straight in my head. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Plecy75","CreatedById":158708,"CreatedDateTime":"2016-09-22T14:44:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222768889\u0022 data-ipsquote-contentid=\u002230718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474544101\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDoesn\u0027t look like the next chapter will be out by Friday although it is ticking along nicely. Got a wee bit stuck on a particular point of worldbuilding last night and discovered that I\u0027d lost my notes on it. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E Luckily there was a version of sorts on the forum, so I was able to rebuild (and embellish) the notes but then I also had to check back through the rest of the story to check for any continuity gaffes. That took a while.\n\u003C/p\u003E\n\u003Cp\u003E\nSo - not quite as many as many new words as I was hoping for last night but at least I\u0027ve got Kerbin\u0027s governing institutions straight in my head. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nwell, at least that gives me more time to organize the whole story into a physical book! when it\u0027s done, i\u0027ll post a link to the printable version. I am take no credit for the writing of this book! all credit goes to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0026amp;do=hovercard\u0022 data-mentionid=\u002261025\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61025-ksk/\u0022 rel=\u0022\u0022\u003E@KSK\u003C/a\u003E. also, i think the next chapter will push the word count past 250,000! congratulations in advance!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-22T16:51:12Z\u0022 title=\u002209/22/2016 04:51  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 22, 2016\u003C/time\u003E by Plecy75\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Plecy75","CreatedById":158708,"CreatedDateTime":"2016-09-22T17:51:36Z","Content":"\n\u003Cp\u003E\nit\u0027s done! here\u0027s the link \u003Ca href=\u0022https://www.dropbox.com/s/7d2kjkzl2z5wm7o/First%20Flight.docx?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/7d2kjkzl2z5wm7o/First Flight.docx?dl=0\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-09-23T08:48:12Z","Content":"\n\u003Cp\u003E\nHey Plecy,\n\u003C/p\u003E\n\u003Cp\u003E\nAppreciate the enthusiasm and you\u0027ve surely made a nice job of pulling the story together into a single piece! Thanks.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you were planning to share it at all (which is fine) please could you add a title page at the start with a quick acknowledgement of me as the author plus a link to this thread and a link to the main KSP website. In the unlikely event that anyone reading a kerbal fanfic \u003Cem\u003Ehasn\u0027t\u003C/em\u003E heard of KSP, I think it would be good to at least point them in the right direction for finding it.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m probably being a bit over-cautious here (and I\u0027m sure you\u0027ve figured this out already) but please don\u0027t put \u003Cem\u003EFirst Flight \u003C/em\u003Eup for sale on Amazon or otherwise distribute it for money. Partly because - well it\u0027s my work you\u0027d be selling - but mostly because Squad, quite understandably, would not be happy with people selling kerbal-related stuff without their say-so.\n\u003C/p\u003E\n\u003Cp\u003E\nA quick last point for future reference. Without being too much of a curmudgeon about this, it would have been nicer if you\u0027d asked me first about making a physical book rather than popping up on the thread and announcing it as a fait accompli. Like I said, I\u0027m cool with it, I definitely appreciate the enthusiasm and you\u0027ve made a great job of the book. Other writers might not be as relaxed though, so best to check first okay? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCheers,\n\u003C/p\u003E\n\u003Cp\u003E\nKSK.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Plecy75","CreatedById":158708,"CreatedDateTime":"2016-09-23T12:34:57Z","Content":"\n\u003Cp\u003E\nsorry about that, i\u0027ll get that cover page in ASAP. i just hope it doesn\u0027t take forever to design! i would never sell someone else\u0027s work, even the thought of it makes me sick. i just can\u0027t stand plagiarism. i just wanted to do something nice for everybody, since a bunch of posts in the forums aren\u0027t exactly the best platform to be reading a quarter-million-word novel on. it also makes it easier if you want to sell it yourself eventually! what image would you like on the cover page? also what exactly should i put in the copyright information?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-23T12:42:02Z\u0022 title=\u002209/23/2016 12:42  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 23, 2016\u003C/time\u003E by Plecy75\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-09-23T16:39:19Z","Content":"\n\u003Cp\u003E\nOh wow. No complicated designs required unless you wanted to - I\u0027d be curious to see what cover picture you chose! I was thinking of something simple, maybe something like this in centred text, font and spacing as you see fit:\n\u003C/p\u003E\n\u003Cp\u003E\nFirst Flight\n\u003C/p\u003E\n\u003Cp\u003E\nA Kerbal Space Program novel.\n\u003C/p\u003E\n\u003Cp\u003E\nBy KSK\n\u003C/p\u003E\n\u003Cp\u003E\nThen the two links somewhere under that.\n\u003C/p\u003E\n\u003Cp\u003E\nNo need for a formal copyright page at this stage. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes - if anyone does want to grab all of First Flight in a single file - now\u0027s your chance!\n\u003C/p\u003E\n"}]}