{"TopicId":31349,"ForumId":39,"TopicTitle":"Off-the-wall story: Descent","CreatedByName":"Polyoxide","CreatedById":68417,"CreatedDateTime":"2013-06-04T19:16:17Z","PageNum":1,"Articles":[{"CreatedByName":"Polyoxide","CreatedById":68417,"CreatedDateTime":"2013-06-04T19:16:17Z","Content":"\n\u003Cp\u003EAs a first post, you get to see my psychopathic ramblings in literature form. Enjoy, or not.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EDescent\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJens Kerman coughed. He knew when he enlisted as a pilot that he\u0027d probably die doing it. He struggled to see under a thick haze of smoke, which stung his eyes, forcing him to rapidly blink.\u003C/p\u003E\u003Cp\u003EKicking off the dented wall of the Mk1 Command Pod, he clicked on the intercom leading to the return module. His spacecraft consisted of a fairly dinky lander, latched onto a medium-sized rocket solely for the purpose of returning from MÃƒÂ¼nar orbit.\u003C/p\u003E\u003Cp\u003EIn a hoarse voice strained from smoke inhalation, he spoke into the microphone. \u0022Wake up, Redris module. Status report.\u0022\u003C/p\u003E\u003Cp\u003ENo response. He repeated the message several times, before the depth of their possible deaths set in. \u003Cem\u003ENo doubt they\u0027ve simply passed out,\u003C/em\u003E he thought solemnly to himself. His inability to open the airlock to the return module made him doubt his self-afflicted lies. His attempts to contact the equatorial space center were also futile - the antenna was unresponsive, and failed to contact any of the communications platforms.\u003C/p\u003E\u003Cp\u003EPractically nothing was working, everything from the cabin lights to the life support. Jens was rapidly forced to attach a gas mask to his face or risk asphyxiating. Despite the tendency for Kerbals to wear their undoubtedly comfortable spacesuits at every possible moment, Jens didn\u0027t feel the need. His was in a cabinet bracketed to the back wall of the pod, which had been warped out of recognition. Any moving parts within the command module had been completely sealed shut or remained inoperative. He could see Kerbin distantly approaching, with diffuse rays of sunlight refracting off the atmosphere.\u003C/p\u003E\u003Cp\u003EWhat had occurred to the spacecraft was bizarre by his standards - he was used to seeing the problem clearly. At least in those situations he had a view of the faulty section of the craft; this time he didn\u0027t. The Mk1 Command Pod was bracketed retrograde to the three-man capsule which contained both of his comrades, which obscured any view of the fuel containment sections. His only guarantee of getting home safely. What he did know, however, was that at about 300 kilometers above Kerbin\u0027s surface, the craft unexpectedly jolted with a deafening bang, knocking out power and thrust control. At that moment, the spacecraft began spinning uncontrollably and filling with smoke. Jens assumed it was a fuel issue, something he was used to on a much larger scale.\u003C/p\u003E\u003Cp\u003EAbout five seconds later, a second explosion sounded. Jens was unphased, but his glance towards the single window built into the capsule made his heart skip a beat.\u003C/p\u003E\u003Cp\u003EHe saw the return stage slowly drifting away, its command pod torn in half with his comrades - and by extension, friends - drifting lifeless in space. The small fuel pod - mostly empty - had a large gash in the side of it, feebly connected to the broken capsule by some framework and wiring. The remaining contents were smattered in space here and there, risking spontaneous combustion.\u003C/p\u003E\u003Cp\u003EJens sat in cold despair for a moment, as the pod slowly turned toward the rising Kerbin. His altitude was roughly 100km and plunging quickly. Below him were the faint trails of city lights.\u003C/p\u003E\u003Cp\u003EAt a moment\u0027s notice, the interior of the capsule became warm. Jens backed himself against the distorted wall, and despite his assured death upon re-entry, braced for impact.\u003C/p\u003E\u003Cp\u003E /end.\u003C/p\u003E\u003Cp\u003Econstructive criticism pl0x\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-06-04T19:56:27Z","Content":"\n\u003Cp\u003EBull****, everybody knows that re-entry is totally harmless \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-06-06T18:09:06Z","Content":"\n\u003Cp\u003ENice first post!\u003C/p\u003E\u003Cp\u003EI like the story very much, its very atmospheric and I\u0027d happily read more. Well - more about the start of Jens\u0027 mission anyway - I think we can tell what\u0027s going to happen next \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EStylistically, there are a couple of things I would tweak. The big one is probably \u0022The Mk1 Command Pod was bracketed retrograde to the three-man capsule\u0022. It\u0027s very clear but \u0027retrograde\u0027 doesn\u0027t really fit with the rest of your writing which is nice and descriptive and doesn\u0027t use much technical jargon! \u003C/p\u003E\u003Cp\u003EI can give you more details if you like but I didn\u0027t want to get too picky in this post - like I said, I liked the story a lot.\u003C/p\u003E\n"}]}