{"TopicId":31901,"ForumId":39,"TopicTitle":"Live on Twitch","CreatedByName":"Phenom Anon X","CreatedById":66562,"CreatedDateTime":"2013-06-07T19:00:39Z","PageNum":1,"Articles":[{"CreatedByName":"Phenom Anon X","CreatedById":66562,"CreatedDateTime":"2013-06-07T19:00:39Z","Content":"\n\u003Cp\u003EI\u0027m going to be streaming live at 1230 PST check out the preshow!\u003C/p\u003E\u003Cp\u003EI\u0027m just going to be working out some kinks with my fuel line and hopefully be running some glide tests\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/phenomanonx\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/phenomanonx\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESee you there :-)\u003C/p\u003E\n"},{"CreatedByName":"Phenom Anon X","CreatedById":66562,"CreatedDateTime":"2013-06-08T00:43:14Z","Content":"\n\u003Cp\u003EThanks to those that came out. Sorry if I missed some of you, I was playing full screen and I never see who\u0027s on chat when that\u0027s the case.\u003C/p\u003E\u003Cp\u003EThe SSMET (Space Shuttle Main Engine Test) mission was a half success. The main thing being that my Orbital Test Vehicle flew, the engines work and everything is a go. I just didn\u0027t have enough oomph to land on the runway, but landing this vehicle is a sheer joy!\u003C/p\u003E\u003Cp\u003EI\u0027ll be running another stream in a few minutes. (6pm PST, 9 Central) \u003C/p\u003E\u003Cp\u003EThis time I\u0027ll be recording the build of the main booster assembly. I\u0027ve also had enough NASA.tv for the day, so music will be the backgound filler on this go around.\u003C/p\u003E\u003Cp\u003EOnce again, I\u0027ll be running full screen so leave a message in chat. I tried to reach a couple people via private message, but Twitch was acting up, so for those I missed, thank you very much!\u003C/p\u003E\u003Cp\u003ENow off to go build a booster engine for the OV-1 - Wheeeeee!!!!\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-08T00:48:47Z\u0022 title=\u002206/08/2013 12:48  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 8, 2013\u003C/time\u003E by Phenom Anon X\u003C/strong\u003E\n\u003Cbr\u003Etime update\n\u003C/span\u003E\n"}]}