{"TopicId":33694,"ForumId":39,"TopicTitle":"Kings \u0026amp; Cultivars","CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2013-06-19T00:03:16Z","PageNum":1,"Articles":[{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2013-06-19T00:03:16Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027palatino linotype\u0027;\u0022\u003EKings \u0026amp; Cultivars \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027palatino linotype\u0027;\u0022\u003EPart 0\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027palatino linotype\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E: Prologue\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ERetired spaceflight director and self-made billionaire Harrison Kerman looked out over his balcony at the ever-changing world before him. He puffed a cigar occasionally, mumbling to himself. His young, naive, but friendly butler Clide sat patiently in the drawing room behind him. Harrison occasionally acted this way, forming a shield around him with his own thoughts which no outside influence could penetrate. But, this time, he muttered to himself, his voice gravelly from both age and cigar smoke.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022\u003C/em\u003E\u003C/span\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003ETwenty-five\u003C/em\u003E\u003C/span\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E. Twenty-five years since we put a Kerbal in space.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EClide looked up at him\u003Cem\u003E \u003C/em\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cem\u003E\u0022Sir?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022I suppose it was before your time. The exploration of space. Massive rockets launching at least every week, all of \u0027em carrying crews beyond the bounds of this tiny planet to explore the great unknown. But they called it quits after we lost the orbital outpost. And we gave up, abandoned the plan to send someone to the Mun and stuffed the designs into warehouses and forgot about them. Now we\u0027re just chucking satellites up into low orbit for television, phones, internet, but nobody\u0027s actually going anywhere anymore.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cem\u003E\u0022Why not?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHarrison looked back at Clide and stared blankly for a moment, then chuckled to himself and turned back to observe the valley below. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Just explained it to you, kid.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cem\u003E\u0022But, I mean, it\u0027s been twenty-five years. You\u0027d think someone would have done something by now. If the government won\u0027t do it, why not the private sector?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHarrison froze. Why hadn\u0027t he thought of it? More to the point, why hadn\u0027t he thought of it sooner? Maybe it was discouragement lingering after all these years, or just because he was getting old. But Clide\u0027s enthusiastic if slightly naive proposal to simply \u0022have the private sector do it\u0022 struck something within him. He then turned around and looked straight at Clide, gesturing towards him with his cigar.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Hey, Clide?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cem\u003E\u0022Y-yes sir?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022How\u0027d you like to be an astronaut?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EHarrison sat down in front of his fireplace and picked up the phone. He still had the number for the CEO\u0027s office at Rockomax embedded in his brain after all these years.\u003C/p\u003E\u003Cp\u003ERing ring...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u0022Hello?\u0022\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIt was Jeremiah. Though 25 years older, his voice hadn\u0027t changed a bit. That old fool was \u003Cem\u003Estill\u003C/em\u003E the CEO!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Guess who, Jer.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022Who... who is this?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Starts with an H. Used to order lots of stuff from you.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESilence.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022Harvey?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Harrison, you numbskull.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESilence again.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022I remember you. Good god.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Yep. You\u0027ll probably also remember that I like to get right down to business, so I\u0027ll be needing two hundred of each length of 3.75m diameter fuel tank. I\u0027m paying for them.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022What. Wh-- how the-- What the hell do you mean, you want two hundred of each length of 3.75m diameter fuel tanks? We haven\u0027t manufactured those since... since... oh god. You\u0027re not planning what I think you\u0027re planning, are you?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022...\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022Harrison, you\u0027re insane.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022I am aware.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022Look, the government is not gonna allow you to--\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022They\u0027ve already given me permission, because they think I ain\u0027t gonna do it.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022I-- the-- well. Uh.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022You still have the tooling and equipment for 3.75m stages, right? Might be a bit dusty but they should still work.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022Uh, we do. They\u0027re a few blocks south of the main factory.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Good. Have them ready by the end of the year.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cem\u003E\u0022I don\u0027t suppose you have a plan, do you?\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Never have, never will.\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cem\u003ETo be continued!\u003C/em\u003E \u003Cem\u003EAlso, the title will make sense at some point! This thread shall be forever documenting the process of a specific save file, triumphs and trials alike.\u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-19T03:48:35Z\u0022 title=\u002206/19/2013 03:48  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 19, 2013\u003C/time\u003E by NovaSilisko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-19T00:11:04Z","Content":"\n\u003Cp\u003EThanks Nova. Nice story.\u003C/p\u003E\u003Cp\u003EEDIT : Uuh! 50th post!\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2013-06-19T03:54:00Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027palatino linotype\u0027;\u0022\u003EKings \u0026amp; Cultivars \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027palatino linotype\u0027;\u0022\u003EPart 1\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E: VIPs, Orbit \u0026amp; St. Bognose\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHarrison Kerman herded his group of VIPs out into the dark. It was freezing cold, and the wind was howling. Apart from the lights of the small office building they just left and the stars above, the area was pitch black. Harrison guided the group along with a small flashlight before coming to a small podium, which lit up as he pressed a button. He cleared his throat and addressed the group:\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u0022Gentlemen. You\u0027re probably wondering why I\u0027ve brought you here.\u0022\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#ff8c00;\u0022\u003E\u0022You\u0027re damn right we are, it\u0027s freezing out here!\u0022\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022color:#ff8c00;\u0022\u003E \u003C/span\u003ECame a shout from the crowd.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u0022Not for long. As many of you should remember, the Kerbals In Space program was shut down exactly thirty years ago... thirty years ago this week, actually. After that, all mentions of the very idea of sending Kerbals back into space has been shunned and all who propose it are practically burned at the stake.\u0022\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#ff8c00;\u0022\u003E\u0022Your point being?\u0022\u003C/span\u003E It was the same angry, pompous voice as before. \u003Cspan style=\u0022color:#ff8c00;\u0022\u003E\u0022It was an expensive and dangerous program, not worth the risk! It was taking up far too much money that could have been going into our own pockets!\u0022\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThere was a general chatter of agreement and utterances of \u0022quite\u0022 and \u0022indeed\u0022 amongst the crowd. Harrison rolled his eyes. He tugged a walkie-talkie out of his back pocket, muttered something into it, and put it away. Then, like an instant sunrise, the area behind him lit up. The sound of the massive floodlights switching on reverberated through the night. It was a launch pad with a rocket mounted to its service structure what looked like only a hundred meters away.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mkOpPtt.png\u0022 alt=\u0022mkOpPtt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u0022This, my friends, is the Sargon medium-lift launch vehicle, and atop--\u0022\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#ff8c00;\u0022\u003E\u0022Okay? You\u0027ve built a rocket. We\u0027ve been building rockets for fift-\u0022\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EHarrison countered the interruption with one of his own. \u003Cem\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u0022Not just a rocket. Please direct your attention to the nose section.\u0022\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe crowd obliged, looking up at the topmost section of the launcher. They saw a ladder. They saw a hatch. They saw a window.\u003C/p\u003E\u003Cp\u003EAnd then it clicked. Their eyes grew wide.\u003C/p\u003E\u003Cp\u003EHarrison smiled seeing the realization on this group of naysayers\u0027 faces that he\u0027d done just what they thought him too eccentric, too old, and too discouraged to accomplish. A countdown clock illuminated, and the crowd began shuffling back nervously.\u003C/p\u003E\u003Cp\u003EFive...four...\u003C/p\u003E\u003Cp\u003EHe turned around, podium to his back as he braced against it. \u003Cspan style=\u0022color:#800000;\u0022\u003E\u003Cem\u003E\u0022Bear witness to the future, gentlemen!\u0022\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThree...two...\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u0022You also might want to duck.\u0022\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOne... Zero.\u003C/p\u003E\u003Cp\u003EThe engines and solid boosters ignited with a blast that knocked several of the VIPs flat onto their backs, all but forcing them to look up at the sky as the rocket carved its incandescent path across it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aKJ1b7p.png\u0022 alt=\u0022aKJ1b7p.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EClide Kerman sat patiently aboard Forsythia-Sargon 1. What kind of name was that, anyway? He surmised Harrison must have a thing for kings and foliage. As he was occupied contemplating the meaning of the mission\u0027s title, Clide hadn\u0027t been listening to his audio feed for some time. Launch came as quite a surprise. His precious orange juice was jolted out of his hand before being pulled down by the sudden large acceleration as the rocket ignited with VIP-toppling force. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/O1yUL8X.png\u0022 alt=\u0022O1yUL8X.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe was smushed back into his seat from the G-forces, which only let up after the jettison of the solid rocket boosters at roughly T\u002B30 seconds.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Wnm5RM2.png\u0022 alt=\u0022Wnm5RM2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBeyond that point, it was a fairly smooth ride. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d2CLVrd.png\u0022 alt=\u0022d2CLVrd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kZU1kxu.png\u0022 alt=\u0022kZU1kxu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EBMALTH.png\u0022 alt=\u0022EBMALTH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnder five minutes later, he had escaped the atmosphere. For the first time in thirty years, Kerbals had conquered space! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UJu5RbE.png\u0022 alt=\u0022UJu5RbE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe loosened his seatbelt as the final burn finished and he became weightless. Unfortunately, his orange juice had become weightless as well. He considered trying to drink some of the floating orange droplets but decided against it when he realized they\u0027d just been sitting on the greasy and gross capsule floor.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HuoGJVZ.png\u0022 alt=\u0022HuoGJVZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EForsythia would go on to complete four more orbits of Kerbin before the next challenge came - returning the first astronaut in thirty years, and returning him alive.\u003C/p\u003E\u003Cp\u003EThe deorbit burn and reentry were nominal. Better than nominal, in fact. They were perfect. Clide himself was impressed, and he had helped build this very capsule. Actually, that would be a good reason for nervousness.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d0RYjy6.png\u0022 alt=\u0022d0RYjy6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere was, however, a slight miscalculation in the deorbit burn, and the spacecraft came down a little off-target.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LKdolbr.png\u0022 alt=\u0022LKdolbr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EKerbals are varied beasts. Differing opinion, taste, hopes, dreams, desires. But all of them share one inexplicable ancestral trait - if something is falling from the sky, watch it, and watch it closely.\u003C/p\u003E\u003Cp\u003EAnd the populace of St. Bognose did just that as the tiny capsule drifted lazily down into the middle of town - pressing their faces against windows, stopping in the street and on the sidewalks, dropping whatever they were doing. The younger of the observers did it out of mere curiosity. But the older folk knew what the object was, and could scarcely believe it! \u003C/p\u003E\u003Cp\u003EHarrison Kerman hadn\u0027t yet made his plans public. He\u0027d been planning to hold a press conference shortly after the capsule landed regarding both the kidnapping of 17 VIPs from a political ball and the first manned spaceflight in 30 years, but the unexpected landing in the middle of downtown St. Bognose meant he had to make it a bit informal.\u003C/p\u003E\u003Cp\u003EBut, the point had been made - Like it or not, Kerbals in space would be a fact of life from this point on!\u003C/p\u003E\u003Cp\u003EAt the meeting, Harrison also revealed (via sketch on a cocktail napkin) a ribbon-based system of progress monitoring for his private spaceflight endeavors.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ribbons.cgagnier.ca/image.php?user_ribbon=558\u0022 alt=\u0022image.php?user_ribbon=558\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003E\u0022Yes, it\u0027s mostly empty. Yes this is a cocktail napkin. No, the mission wasn\u0027t fake.\u0022\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIn the end, the landing in St. Bognose was a happy accident. The publicity drummed up from it was better than any advertisement money could buy, and it immiedietely enticed Kerbals of all ages - the old generation out of a nostalgic dream to see the return of manned spaceflight, and the new generation for the never-ending novelty and innovation of the very concept.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cem\u003ETo be continued in Part 2: How I Learned To Stop Worrying And Love Robots\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-06-19T06:06:44Z","Content":"\n\u003Cp\u003E*Subbed* Awaiting what else you have \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2013-06-19T06:48:32Z","Content":"\n\u003Cp\u003EYep, we got a good read here Mission Control. We are go for the next part.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-06-19T08:13:02Z","Content":"\n\u003Cp\u003ELove the pictures and all rockets should ignite with VIP toppling force! Looking forward to the next part.\u003C/p\u003E\n"},{"CreatedByName":"ninjakids","CreatedById":70896,"CreatedDateTime":"2013-06-19T09:16:22Z","Content":"\n\u003Cp\u003ECant wait for next part!\u003C/p\u003E\n"},{"CreatedByName":"POTKC","CreatedById":57600,"CreatedDateTime":"2013-06-19T15:26:54Z","Content":"\n\u003Cp\u003EYay, a story witten by a developer, and an \u003Cstrong\u003Eexcellent\u003C/strong\u003E one, too!!!\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-06-19T15:39:25Z","Content":"\n\u003Cp\u003ENice story! Will be following this.\u003C/p\u003E\n"},{"CreatedByName":"EnhancedCookie","CreatedById":34037,"CreatedDateTime":"2013-06-19T15:56:43Z","Content":"\n\u003Cp\u003EVery well written ! looking forward to reading more!\u003C/p\u003E\n"},{"CreatedByName":"ShyzyIndustries","CreatedById":68772,"CreatedDateTime":"2013-06-19T19:07:00Z","Content":"\n\u003Cp\u003ECant wait for more!\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2013-06-19T21:44:45Z","Content":"\n\u003Cp\u003EYou have my full attention, sir.\u003C/p\u003E\n"},{"CreatedByName":"ManaaniWanderer","CreatedById":28850,"CreatedDateTime":"2013-06-19T22:19:06Z","Content":"\n\u003Cp\u003EWell written Nova, this post is definitely getting subbed so I don\u0027t miss any of it.\u003C/p\u003E\n"},{"CreatedByName":"Needles_10","CreatedById":59554,"CreatedDateTime":"2013-06-19T23:03:21Z","Content":"\n\u003Cp\u003ENova, is this a story about (in some amazing way) \u0022Career Mode\u0022? Even if it isn\u0027t, it\u0027s an ASTOUNDING STORY. KEEP THE PARTS COMING!\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2013-06-19T23:11:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Needles_10\u0022 data-cite=\u0022Needles_10\u0022\u003E\u003Cdiv\u003ENova, is this a story about (in some amazing way) \u0022Career Mode\u0022? Even if it isn\u0027t, it\u0027s an ASTOUNDING STORY. KEEP THE PARTS COMING!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENah, it\u0027s just intended as a recording of some possible history of Kerbin. I hope to get it out to multiple thousands of years of spaceflight history.\u003C/p\u003E\n"},{"CreatedByName":"Needles_10","CreatedById":59554,"CreatedDateTime":"2013-06-19T23:24:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003ENah, it\u0027s just intended as a recording of some possible history of Kerbin. I hope to get it out to multiple thousands of years of spaceflight history.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI understand. Still! I love this! (If you ever plan on introducing the DSK, look to my first thread.) Keep it up, Nova!\u003C/p\u003E\n"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-06-21T16:23:35Z","Content":"\n\u003Cp\u003EToo funny, what did you base the reentry pic off of?\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-06-21T20:33:31Z","Content":"\n\u003Cp\u003EProgrammer, rocket builder and now writer. You are a man of many talents Nova. Kudos \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ElJugador","CreatedById":18783,"CreatedDateTime":"2013-06-23T23:01:09Z","Content":"\n\u003Cp\u003ETruly stunning work, Nova! Please continue.\u003C/p\u003E\n"},{"CreatedByName":"Kamsko","CreatedById":59669,"CreatedDateTime":"2013-06-24T11:13:38Z","Content":"\n\u003Cp\u003ENova - \u0022Gather around children, I have a story.\u0022\u003C/p\u003E\u003Cp\u003E*gathers around*\u003C/p\u003E\u003Cp\u003EYou have my attention.\u003C/p\u003E\n"},{"CreatedByName":"ninjakids","CreatedById":70896,"CreatedDateTime":"2013-06-29T01:38:30Z","Content":"\n\u003Cp\u003EWhen wil you make the next part!?!?!?!\u003C/p\u003E\n"},{"CreatedByName":"jocax188723","CreatedById":62648,"CreatedDateTime":"2013-07-01T04:55:56Z","Content":"\n\u003Cp\u003EWonderful. Genuinely wonderful. Can\u0027t wait for the next installment.\u003C/p\u003E\n"},{"CreatedByName":"ninjakids","CreatedById":70896,"CreatedDateTime":"2013-07-01T07:10:10Z","Content":"\n\u003Cp\u003EI\u0027m guessing he just gave up on this... or the next part will be awesome!\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-07-01T07:35:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ninjakids\u0022 data-cite=\u0022ninjakids\u0022\u003E\u003Cdiv\u003EI\u0027m guessing he just gave up on this... or the next part will be awesome!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood writing takes time.\u003C/p\u003E\u003Cp\u003EI guarantee Nova read and re-read everything he\u0027s put down on this story multiple times before he hit the post button. Shoot, probably previewed more than once as well to make sure the image size and placement looked right.\u003C/p\u003E\u003Cp\u003EI, for one, embrace our new developer/writer/builder overlord. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E(oh, and subbed!)\u003C/p\u003E\n"},{"CreatedByName":"ninjakids","CreatedById":70896,"CreatedDateTime":"2013-08-23T05:44:15Z","Content":"\n\u003Cp\u003EI can\u0027t wait for this next part.\u003C/p\u003E\n"}]}