{"TopicId":34676,"ForumId":39,"TopicTitle":"[AAR] Minstry of Space: Laythe Military Research Centre","CreatedByName":"Captain_Party","CreatedById":59820,"CreatedDateTime":"2013-06-25T05:39:21Z","PageNum":1,"Articles":[{"CreatedByName":"Captain_Party","CreatedById":59820,"CreatedDateTime":"2013-06-25T05:39:21Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EPROLOGUE\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHey guys! I was inspired by the long term Laythe base mission, so my Kerbals decided to have there own version of it, and, as my space ministry is basically the KAF (Koyal Air Force) they decided it was going to be a military base. This prologue is basically the ships on the launchpad and getting into orbit. Next chapter will be the actual beggining of the story. Hope you enjoy it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/df2Pwk9.png\u0022 alt=\u0022df2Pwk9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the Laythe space station that all of the space tugs will dock to after they have delivered they\u0027re load. I was going to go for Greek mythology, as thats what I normally do for my Space Stations, Olympus etc. But, as this is a \u0027British\u0027 expedition, I decided to go with a great British hero, such as Hillary, Churchill or whoever. But, as I normally name my Kerbin station Churchill or Olympus, I decided to go with \u003Ca href=\u0022https://en.wikipedia.org/wiki/Walter_Raleigh\u0022 rel=\u0022external nofollow\u0022\u003ESir Walter Raleigh\u003C/a\u003E, so its name is Raleigh Refueling Station. Also, those Comms dishes are configured to work with kethane as kethane scanners (just in case).\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022http://i.imgur.com/gF7EvGs.png\u0022 alt=\u0022gF7EvGs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd heres the bad boy in LKO without the Tug attached. It serves its purpose well, and if it gets broken or I\u0027m bored of it, I\u0027ll send a new one to Laythe and de-orbit it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8tdngwT.png\u0022 alt=\u00228tdngwT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHeres my IP Tug, its pretty standard, two NERVA\u0027s, RCS, Solar Panels... It can get to Laythe and back, pretty damn good...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WsyARbV.png\u0022 alt=\u0022WsyARbV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe pride and joy of my fleet! The Supermarine Skipper! It has rover wheels, solar panels, can refuel and has the KAF symbols on it! I decided not to include missiles, I mean, whats the worst that could happen..?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9B1z49N.png\u0022 alt=\u00229B1z49N.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe skipper in orbit. There are 3 other ships, but they\u0027re just hab modules and the comms centre.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-25T19:06:43Z\u0022 title=\u002206/25/2013 07:06  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 25, 2013\u003C/time\u003E by Captain_Party\u003C/strong\u003E\n\u003C/span\u003E\n"}]}