{"TopicId":37037,"ForumId":39,"TopicTitle":"Shinji\u0026#039;s Planet Ideas","CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-14T16:28:31Z","PageNum":1,"Articles":[{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-14T16:28:31Z","Content":"\n\u003Cp\u003EHello there!\u003C/p\u003E\u003Cp\u003ESince my post in the ideas thread for planets in the future of KSP, I wanted to make more, but I didn\u0027t want to clutter up the thread, so I split my post from the thread.\u003C/p\u003E\u003Cp\u003EAnyway, the thing is exactly what it says on the tin - planet ideas, with artwork!\u003C/p\u003E\u003Cp\u003EHere\u0027s my first concept:\u003C/p\u003E\u003Cp\u003ETalaoon: A gas giant that\u0027s about the same size as Jool. It has visible, large rings that orbit the planet. Of course, Talaoon has it\u0027s own moon system:\u003C/p\u003E\u003Cp\u003E-Maxmus: A polar opposite of Minmus, with the same gravity as Eve, has an atmosphere, has a very big gravity well, and has seas of fire with black rock plateaus. Contact with sea of lava = same as contact with Kerbol. The largest moon and the closest, too.\u003C/p\u003E\u003Cp\u003E-Minthay: A ocean dwarf planet, with only two somewhat small islands.\u003C/p\u003E\u003Cp\u003E-Eeloo: Of course, there\u0027s plans for it to become a part of a Gas Giant moon system, so why not?\u003C/p\u003E\u003Cp\u003E-Goliyu: The second smallest moon, with a surface similar to Laythe, except no atmosphere, white ground, purple seas (So it looks like Eve...to truly confuse people) and a Sphere of Influence that can overlap with Maxmus at a certain alignment. \u003C/p\u003E\u003Cp\u003EColossiod: Analog to Titan, with a supervolcano at the north pole that, if it erupts, makes the atmosphere very hot and everything will begin to overheat. Supervolcano erupts every 72 in-game hours. Blue surface, atmosphere, large fissures.\u003C/p\u003E\u003Cp\u003EArtwork:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QqK2EuO.png\u0022 alt=\u0022QqK2EuO.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-14T16:45:48Z\u0022 title=\u002207/14/2013 04:45  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 14, 2013\u003C/time\u003E by Shinji-The-Kerbonaut\u003C/strong\u003E\n\u003C/span\u003E\n"}]}