{"TopicId":42053,"ForumId":39,"TopicTitle":"Tale of a Space Program","CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-11T17:15:55Z","PageNum":1,"Articles":[{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-11T17:15:55Z","Content":"\n\u003Cp\u003E\u003Cem\u003EThis is my take on the story of Kerbin and my personal KSP, from when I first got the game to where I am now. This should hold you over until I can get Chapter One of Project: ARES out...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOne day in history (we can\u0027t pin down an exact date parallel to Earth time, but we think sometime around 1880), Kerbals decided that the continued survival of their species was more important than petty differences like national borders and philosophical views. As such, the Grand Union of Kerbin (GUK) was formed, and a new dating system was made: Before Union (BU) and After Union (AU). After seventy-three years, they decided that survival depended on getting into space and colonizing the planets and stars, and the Kerbal Space Program was formed.\u003C/p\u003E\u003Cp\u003EFor forty-seven years, all was well.\u003C/p\u003E\u003Cp\u003EBut at the dawn of 120 AU, a problem arose. Kerbalkind finally had the technology to visit the Mun, but \u003Cem\u003Eeveryone\u003C/em\u003E wanted to. Arguments arose. Kerbals bickered over strategies to get to the Mun. Eventually, it was too much. The once-mighty Kerbal Space Program split into hundreds of different companies and programs, with more splitting from them every day. Eventually, the dust settled, leaving the best programs on top... but more were forming by the hour.\u003C/p\u003E\u003Cp\u003EOne of the \u0027big\u0027 programs was the Kurtjmac Aerospace Program (KASP). This is not that program\u0027s story--it\u0027s story has been documented and retold for decades. Rather, this story is about one of it\u0027s splits. You see, one ambitious Kerbal (who would prefer to go simply as the Director) saw potential in KASP, but did not see how that potential could be fulfilled without his help (he was--and still is--a bit... vain...). He decided to form his own space program, the one that would finally come out on top when the splits stopped growing. So, in 133 AU, along with mathematician/physicist Gene Kerman and famous scientist/inventor/crackpot Wherner von Kerman, he formed a new program, named after a favorite movie of his... the Jedi Space Program.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zrtZvKA.png\u0022 alt=\u0022zrtZvKA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EChapter One VERY soon!\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-12T15:38:52Z","Content":"\n\u003Cp\u003EThe first launches of the JSP had a tendency to explode. This, of course, is a phase every new space program goes through. Still, the only people who came to the first few launches were the most hardcore rocketry enthusiasts and a politician, President John F. Kerman, who saw great potential in the fledgling space program (which wanted to become a government agency) and wanted to help.\u003C/p\u003E\u003Cp\u003EThe Kerbal 7, carrying Jebediah, Bill and Bob Kerman (freelance pilots, who worked for whichever agency paid best) was the first suborbital flight and first major success of the JSP. With this more people started coming to the launches, excited to see whether this new player would be able to get into orbit. Soon, the Columbus 24 launched Jeb, Bill and Bob into orbit around Kerbin. At this point, at least ten thousand people were coming to each launch, with more watching television and listening by radio.\u003C/p\u003E\u003Cp\u003EThe President grew very excited. Not only did he give wholehearted support to the program, which was quickly growing in power, but he also challenged them to land on the Mun before the end of the year. They were given a huge budget to do this. And thus, the Armstrong program began.\u003C/p\u003E\u003Cp\u003EA quick rundown of the program:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EArmstrong 1:\u003C/strong\u003E Stuck in a highly elliptical Kerbin orbit.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EArmstrong 2:\u003C/strong\u003E Returned to Kerbin without entering Mun SoI.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EArmstrong 3-9:\u003C/strong\u003E Failed to reach Mun.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EArmstrong 10:\u003C/strong\u003E Collapsed on launch pad.\u003C/p\u003E\u003Cp\u003EWith all these failures, the President grew impatient. In an open letter to the Director, he said that if Armstrong 11 did not touch the surface of the Mun, the JSP would no longer receive government support.\u003C/p\u003E\u003Cp\u003EThe Armstrong 11 was the first JSP craft to orbit the Mun. It was also the first to impact the surface of another celestial body. \u003C/p\u003E\u003Cp\u003EYes, we said impact.\u003C/p\u003E\u003Cp\u003EThankfully, the President counted this a success, and the JSP continued. However, sometime around Armstrong 22, John realized the futility of the program, and pulled the plug on government funding, redirecting funds to KASP.\u003C/p\u003E\u003Cp\u003EAt this point, the Director decided to cut his losses and wait a few decades for technology to be better before continuing his quest...\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EIf ANYBODY has feedback, I\u0027d really like to hear it!\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-08-12T23:50:47Z","Content":"\n\u003Cp\u003EInteresting read. I think it is time for the Director to get up, knock the dust off of his suit, pony up some cash and head a new program. \u003C/p\u003E\u003Cp\u003EThe JSP needs to proceed. Success is just over the horizon.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh and that is a nice graphic!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T23:53:02Z\u0022 title=\u002208/12/2013 11:53  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by BostLabs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-13T00:46:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BostLabs\u0022 data-cite=\u0022BostLabs\u0022\u003E\u003Cdiv\u003EInteresting read. I think it is time for the Director to get up, knock the dust off of his suit, pony up some cash and head a new program. \u003Cp\u003EThe JSP needs to proceed. Success is just over the horizon.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh and that is a nice graphic!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you! The graphic isn\u0027t actually my creation, someone made it for me while we were waiting for 0.20 and flags. Also, this is around the time I switched from the demo to the full version, so indeed, success is over the horizon! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-14T00:01:46Z","Content":"\n\u003Cp\u003EIn 182 AU, the Director decided that the technology was finally ready for his conquest of space. And so, the Jedi Space Program rose from the ashes (imagining a phoenix is optional).\u003C/p\u003E\u003Cp\u003EThe first ship of this reborn empire, though, was a monstrosity of a thing. Many would gasp in horror at it\u0027s futility. For one thing, it was TALL rather than WIDE. At the time, the Director denied evidence that aerodynamics were \u0022funky\u0022. For another thing, the staging was all wrong. Needless to say, it slammed into the ground, producing a satisfying explosion.\u003C/p\u003E\u003Cp\u003EUndaunted, the Director continued his work. Soon, orbit became routine once again. Still, the Mun was out of his grasp... until Armstrong 5. (as a note, the Armstrong program was restarted many times in the JSP\u0027s history)\u003C/p\u003E\u003Cp\u003EArmstrong 5, crewed by Bill Kerman was originally meant to land on the Mun, but it overshot and got a Minmus encounter. The JSP decided to continue with the mission anyway. After several minutes of terror, the Armstrong 5 touched Minmus, flipped over once, and landed on it\u0027s side, becoming the first JSP craft to successfully land on another world. Bill Kerman stepped out and took some photo ops, although flags were not widely distributed among the space programs at the time. \u003C/p\u003E\u003Cp\u003EBill was a bit stranded, but things get a little creepy here. You see, the next day, Bill reappeared at KSC. Confused, KSC contacted the Armstrong 5, still on Minmus. Bill was indeed gone, but the lander was still fully operational and could fly itself, despite having no pilot or probe core. Many a ghost story has been told about this event, but the popular consensus is that the lander was affected by one of the famous \u0027bug\u0027 phenomena. In any case, such a strange occurrence has never happened since.\u003C/p\u003E\n"},{"CreatedByName":"Apollo1391","CreatedById":73845,"CreatedDateTime":"2013-08-14T01:00:57Z","Content":"\n\u003Cp\u003ECool great story\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-14T01:19:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Apollo1391\u0022 data-cite=\u0022Apollo1391\u0022\u003E\u003Cdiv\u003ECool great story\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-15T16:47:43Z","Content":"\n\u003Cp\u003EAnother notable mission was the Armstrong 7, just two days later. Crewed by Danke Kerman, the ship got to the Mun successfully. Unfortunately, it ran out of fuel during descent. For many a pilot, this would be the end. However, KSC had a crazy plan. Danke ejected from the capsule, using his jetpack to slow down. It was tight, but the maneuver was a success. Danke Kerman was the first JSP kerbonaut on the Mun.\u003C/p\u003E\u003Cp\u003EHowever, he was stranded without a ship. So, the Armstrong 8, crewed by Jebediah and Bill Kerman, went to the Mun, with a Mk.59 Moon Visitor designed by the Vanndamode Space Company (a variant of which is still in use to this day, though it is quickly being phased out by the Artemis Mk.4). The ship tipped over on landing, but righted itself fairly quickly. Unfortunately, they were on the other side of the Mun from Danke.\u003C/p\u003E\u003Cp\u003EDanke attempted to jetpack some of the way so that he wouldn\u0027t have to walk quite as far, but sadly, he went too fast and slammed into the side of a hill, dying instantly from rib fractures. Bill still has minor PTSD to this day about it. Rest in peace, Danke Kerman. You got to go jetpacking on the Mun, something not all Kerbals can claim to have done.\u003C/p\u003E\u003Cp\u003EThis failure was followed by another one. In 184 AU, the Jedi Space Program set it\u0027s sights for Duna. The Curiosity 3, crewed by Bob, Danke (not related in any way to the first Danke) and Robur Kerman, was the first JSP rocket to reach interplanetary space. However, the JSP did not know the intricacies of interplanetary transfer at the time. The ship was infamously stranded in orbit around the sun... forever...\u003C/p\u003E\u003Cp\u003EThis caused many protests. People were throwing rotten fruit at the tracking station, the VAB collapsed--oh, it was horrible! The JSP was put out of commission for seven years. But in 191 AU, it came back...\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-08-15T18:07:28Z","Content":"\n\u003Cp\u003EWhere do they get all this rotten food from? \u003C/p\u003E\u003Cp\u003EThe VAB collapsed? That is a lot of rotten fruit! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-15T18:59:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BostLabs\u0022 data-cite=\u0022BostLabs\u0022\u003E\u003Cdiv\u003EWhere do they get all this rotten food from? \u003Cp\u003EThe VAB collapsed? That is a lot of rotten fruit! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess the VAB must have been shoddy. No wonder they replaced it in 0.21! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-17T16:08:12Z","Content":"\n\u003Cp\u003E192 AU will forever be know as \u0027The Year of the Company\u0027. Feeling that it couldn\u0027t do much with the standard parts, the JSP bought several new parts from private companies, including the controversial MechJeb. MechJeb did not prove as helpful as anticipated, but it did help build a very, very small Minmus base. In any case, this was also the year the JSP attempted to mine for Kethane (they failed, because they used the tech wrong) and the year they attempted to launch an ISA MapSat satellite (for some reason, the fabric of the universe in the area couldn\u0027t handle it). \u003C/p\u003E\u003Cp\u003EUnfortunately, even with all this new technology, not much happened in space exploration that year. Interplanetary missions were avoided at all costs, no new landers were designed, most of the ships were bought off the Spacecraft Exchange, and the JSP \u003Cem\u003Estill\u003C/em\u003E couldn\u0027t figure out docking. It was the least productive year for the JSP by far.\u003C/p\u003E\u003Cp\u003EBut it was in 202 AU when things started happening. That year, the Crystal 2 became the first interplanetary JSP craft, putting a probe in orbit around Eve. Later that year, the Curiosity 2 put a probe lander on Duna, the Curiosity 3 put two kerbals in orbit around Ike, and the Curiosity 4 landed three kerbals on Duna (albeit without a means of returning home). It was, in fact, the MOST productive year for space flight in JSP history. They were even considering starting a base on Eeloo.\u003C/p\u003E\u003Cp\u003EBut, a problem arose. Just as the JSP was about to start working with private companies again, a huge solar flare destroyed all the equipment, and killed all the kerbonauts.\u003C/p\u003E\u003Cp\u003EUndaunted, the Director pushed on, starting from the ground up. And it worked. Now, the Jedi Space Program has learned docking, built a stable airplane, put kerbals on Duna who may return home, and looks ever onward, hoping to one day have that black-and-green flag flying on every rock in the Kerbol system.\u003C/p\u003E\u003Cp\u003ELong live the Jedi Space Program!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ETHE END\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EI hope you enjoyed this short story. I wish it could be longer, but I came in from the 13.3 demo into18.2., so I haven\u0027t really played enough to have a longer story. If you\u0027d like more stories, click here for the archive: \u003C/em\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/46258-Jedi-Space-Progam-Archive\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/46258-Jedi-Space-Progam-Archive\u003C/em\u003E\u003C/a\u003E\u003Cem\u003E. See you next time! *KSP theme plays*\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Apollo1391","CreatedById":73845,"CreatedDateTime":"2013-08-17T19:30:33Z","Content":"\n\u003Cp\u003EBravo bravo\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-08-17T19:50:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Apollo1391\u0022 data-cite=\u0022Apollo1391\u0022\u003E\u003Cdiv\u003EBravo bravo\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*bows* Thank you, thank you.\u003C/p\u003E\n"}]}