{"TopicId":54501,"ForumId":39,"TopicTitle":"[Kraken War \u0026quot;Book\u0026quot; 2] Scavenging on Dres","CreatedByName":"Sesni","CreatedById":50625,"CreatedDateTime":"2013-11-27T15:32:02Z","PageNum":1,"Articles":[{"CreatedByName":"Sesni","CreatedById":50625,"CreatedDateTime":"2013-11-27T15:32:02Z","Content":"\n\u003Cp\u003EIntroduction : \u003C/p\u003E\u003Cp\u003EThe character that has the main perspective is called Sop, member of rifle unit 182 of the UK Marines. He and his company have crash-landed due to a Kraken attack, yet their main target was Dres. Dres has been abandoned because of the attack and its unimportance. The Kerbal Federation, under very strict terms from the victor of a war with aliens, the UK, the KF millitary is supposed to follow orders from head of UK command. The UK tells them what they can attack, and where they can go. They disobeyed these orders, trying to check for survivors in Company 1 of the 182 rifle unit of the UK marines. They are attempting to rescue them as well to gain the UK\u0027s trust.\u003C/p\u003E\u003Cp\u003ECrash. Kraken were good at digging holes. Really deep ones. I check my rifle.\u003C/p\u003E\u003Cp\u003E\u0022Hey Sop, can you confirm if On\u0027s dead?\u0022 That\u0027s Sev, my commander.\u003C/p\u003E\u003Cp\u003E\u0022On it.\u0022 I said, dropping a camera down, \u0022Yeah, dead.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Crap. Can you radio Arrestor for evac?\u0022 He knows we\u0027re the last two alive on this planet.\u003C/p\u003E\u003Cp\u003E\u0022No, it\u0027s dead\u0022\u003C/p\u003E\u003Cp\u003E\u0022Radio or...\u0022 He doesn\u0027t want to bring up the inevitable.\u003C/p\u003E\u003Cp\u003E\u0022Radio.\u0022 I say, firmly. \u0022Hey, look at that cave.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I see something that looks like engine thrusters. That cave probably contains a Kraken, so let\u0027s go to the engines first.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I think I see KF markers. It\u0027s probably going to scout out for any of us and Kraken dens.\u0022\u003C/p\u003E\u003Cp\u003E\u0022But that\u0027s against our rules???\u0022\u003C/p\u003E\u003Cp\u003E\u0022But they want to earn our trust again for returning a rifle unit and killing some Kraken???\u0022 I say. \u0022Come on.\u0022 We walk to the rover\u0027s landing site, a meager singular klick.\u003C/p\u003E\u003Cp\u003EHow do you guys like this? I\u0027m gonna take a while to think of more things but for now, this is what I\u0027ve got.\u003C/p\u003E\n"}]}