{"TopicId":57898,"ForumId":39,"TopicTitle":"A Space Station Under Seige","CreatedByName":"Sesni","CreatedById":50625,"CreatedDateTime":"2013-12-27T14:29:28Z","PageNum":1,"Articles":[{"CreatedByName":"Sesni","CreatedById":50625,"CreatedDateTime":"2013-12-27T14:29:28Z","Content":"\n\u003Cp\u003EBased on what I would do for a CSGO SFM animation. Different settings and characters, of course.\u003C/p\u003E\u003Cp\u003EKey : MMB ; Moho Millitary base\u003C/p\u003E\u003Cp\u003EMMS ; Moho Military station\u003C/p\u003E\u003Cp\u003ELOC : MMB\u003C/p\u003E\u003Cp\u003ETIME : 2313 MMS AREA TIME\u003C/p\u003E\u003Cp\u003ESTATUS : SEARCHING FOR MMS. CONTACTING ANY CRAFT NEAR MOHO AND SEE IF THEY KNOW THE MMS STATUS\u003C/p\u003E\u003Cp\u003E\u0022MMS, MMS do you copy? DO YOU COPY?\u0022 The Com-manager shouted.\u003C/p\u003E\u003Cp\u003E\u0022All millitary comms in the area have been knocked out. Good thing we have civilian transmitters stored.\u0022 Poc, the station commander said\u003C/p\u003E\u003Cp\u003ELOC : MMS\u003C/p\u003E\u003Cp\u003ETIME : 2314\u003C/p\u003E\u003Cp\u003ESTATUS : MOVING TO BOMB\u003C/p\u003E\u003Cp\u003E\u0022Come on come on chop chop!\u0022 Lok, commander, said. One beep per second from the bomb.\u003C/p\u003E\u003Cp\u003E\u0022They\u0027re on the other side of this airlock!\u0022 Five beeps per second.\u003C/p\u003E\u003Cp\u003E\u0022Charge in 3. 2. 1. Clatter, clack, tinkle.\u0022 Atin said, unlocking the airlock.\u003C/p\u003E\u003Cp\u003E\u0022Shi-\u0022 One solider was destroyed by a burst of minigun fire from the first enemy. Lok threw in a grenade, killing him. Twenty beeps per second. The UKN soldiers charged in, destroying KF soldiers. Ten kerbals died in the engagment. Thirty beeps per second.\u003C/p\u003E\u003Cp\u003E\u0022I\u0027ll get the bomb!\u0022 Corr, bomb disposal Kerbal said. Thirty-two beeps per second. Corr started defusing.\u003C/p\u003E\u003Cp\u003E\u0022Isn\u0027t it two seconds with 35 bps when it blows up?\u0022 Lok said.\u003C/p\u003E\u003Cp\u003E\u0022Yeah.\u0022 Corr said, defusing. 34 beeps per second. \u0022What\u0027s the god **** bombs in here?\u0022 He shouted in frustration. Thirty-five.\u003C/p\u003E\u003Cp\u003E\u0022Oh sh** it\u0027s gonna blow!\u0022 2.\u003C/p\u003E\u003Cp\u003E\u0022MMS, this is MMB are you there?\u0022 The MMB comm-manager asked. \u0022I think we lost the MMS.\u0022\u003C/p\u003E\u003Cp\u003EI suggest you watch the Ted Ed video about the anti-hero. Almost always in my stories, the protaganists are anti-heros.\u003C/p\u003E\n"},{"CreatedByName":"pigletx2","CreatedById":78322,"CreatedDateTime":"2013-12-27T14:46:34Z","Content":"\n\u003Cp\u003ENot bad! Not bad at all.\u003C/p\u003E\n"}]}