{"TopicId":63128,"ForumId":39,"TopicTitle":"The Potato Newscast 24/7- \u0026quot;Duna Rover Drives Off Cliff Due To Lag Caused By HSP\u0026quot;","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-13T21:49:19Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-13T21:49:19Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ETHE POTATO NEWS CHANNEL 24/7\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ENews Story Lists\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EPolitical Rival Deorbited In \u0022Accident\u003C/p\u003E\u003Cp\u003EConskary Lands Kerbal On Sun\u003C/p\u003E\u003Cp\u003EMoonbase Becomes Self-Aware, Must Be Enthused By Reluctant Astronauts\u003C/p\u003E\u003Cp\u003EDuna Rover Drives Off Cliff Due To Lag\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EConskary Lands Kerbal On Sun\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnd now....back to the Potato News Network as part of its 24-hour marathon, all day, and everyday \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003E(Potato is for the power source that runs our electronics)\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E. This is your host, \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003ENameless Drone No.251517\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E Nedfred Kerman, with your \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003Epropaganda\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E global news today. You are watching this network because \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003Eyou have no choice\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E it is awesome.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-!HAIL OUR GREAT ETERNAL LEADER!-\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EJanitor\u003C/span\u003E\u003C/strong\u003E: What the bloody frak?! Turn da camera off!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E *camera goes black and falls to floor, gunshots, swearing, and some screams are heard.* \u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred Kerman\u003C/strong\u003E\u003C/span\u003E: Ahem, *looks mildly annoyed at dark puddle on the floor* welcome to Potato News Network. Today is a special day. We have an high-ranking official guest from our \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E everwatchful and superior overlords \u003C/span\u003E Federal Government! Lets welcome Dr. Bill Kerman, the Director of... *looks at paper* \u003Cspan style=\u0022font-size:8px;\u0022\u003Ehow do I pronounce this?\u003C/span\u003E...err.... our Space Agency-that-totally-is-legit!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill Kerman\u003C/strong\u003E\u003C/span\u003E: Certainly is something to be here, Ned. Love to see the devotion to country that you \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eslaves\u003C/span\u003E citizens have. \u003Cspan style=\u0022font-size:8px;\u0022\u003EAm I getting paid for this? No? Screw you, I\u0027m shooting you first thing after. What? Fine, fine, 50 Kerbucks is good enough.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: \u003Cspan style=\u0022font-size:8px;\u0022\u003EShut up, all of you.\u003C/span\u003E Ah, I see. Lets get on with the show. What busniess brings you here on this fine day? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill Kerman\u003C/strong\u003E\u003C/span\u003E: Today, the Space Agency did something special to celebrate the Not-Birthday of the Eternal Leader!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: *tries to sound excited* What is it? \u003Cspan style=\u0022font-size:8px;\u0022\u003EDo I have to sound exicited? I already know.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: We \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ekilled\u003C/span\u003E landed a Kerbal on the sun!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Wow! Must be an impressive technological achievement! *looks at paper again* I\u0027m quite certain you have, uh, pictures, correct?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: Sure I do! These are pictures that were taken by several cameras onboard the \u003Cstrong\u003EHelios-4\u003C/strong\u003E, the rocket that sent the brave and courageous crew to the Sun. In fact, we have a picture of the spacecraft from the outside, a picture taken by the the crew as they approached the ship in their \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Efive kerbuck duct-tape spacesuits\u003C/span\u003E high-class state-of-the-art space shuttle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QmBof3Q.png\u0022 alt=\u0022QmBof3Q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003EIs that duct tape on the hab module?- Mission Specialist\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Thats a very nice spaceship. I hear it was personally designed by the Eternal Leader? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: Why yes, it was! \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: As in accordace with the Space Government Protocol, each module on a government spacecraft is named by the Eternal Leader too, am I correct? Must be a big honor to have someone so great name your creations and design them. I have a question, what did he name them?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: The Eternal Leader named the Solar-Travel-Vehicle the \u0022Olaf\u0022, and the Solar-Landing-Vehicle the \u0022Ayyyyyyyy LMAO\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: The \u0022Olaf\u0022 and the \u0022Ayyyyyyy LMAO\u0022 \u003Cspan style=\u0022font-size:8px;\u0022\u003Eis that how you say it?\u003C/span\u003E must have been pinnacles of Kerbal engineering. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: I\u0027m quite proud of these two creations \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eeven though I ha no part in amking them and I think they have dumb names\u003C/span\u003E, and I am proud of the chance to work with our ever-beloved and everlasting eternal leader. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EIntern\u003C/strong\u003E\u003C/span\u003E: \u003Cspan style=\u0022font-size:8px;\u0022\u003EPsst.....I heard the ship burned its fuel going retrograde and crashed into the ocean\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9mWR6Nm.png\u0022 alt=\u00229mWR6Nm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EHOW MANY TIMES MUST I TELL YOU! PROGRADE DOESN\u0027T HAVE LINES ACROSS IT! ARE THESE PLASMA FLAMES I SEE OUT THE WINDOW?!?!?!- Mission CO\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E *camera cuts out; running feet and a gunshot are heard* \u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: We, uh, had a issue with an traitor among our interns. Anyways, all is good, stay calm. So, Bill, how many crew were on the ship, and how did they travel to the Sun? It must have been an long and dangerous voyage, I believe. And how come very few saw the launch, why did it have to be at nighttime? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: The crew consisted of three highly-trained \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eabductees\u003C/span\u003E Conskary Army Officers. They travelled at nighttime to avoid the rays of the sun because it would protect them, and travelled with sunglasses for protection \u003Cspan style=\u0022font-size:8px;\u0022\u003E....they didn\u0027t wear blindfolds because it reminded them of firing squads and scared them\u003C/span\u003E, having memorized the control panel.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Wow! That must have been very good at piloting! Where is the crew right now?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: They sure were. The crew, as of current, is on an return trajectory back to Kerbin. They are expected to touchdown on the South Kerbal Sea at 9PM tonight, then meet and have supper with the Eternal Leader before recieving the Order of Epicness, which, to me, is one of the highest honors anyone can get. They have samples of the solar wind and particles, and even dug up a small sunspot as a gift to our beloved and eternal leader. Here is another picture, taken by an telescope observbatory in the North Island. Put it up!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iyPaRoH.png\u0022 alt=\u0022iyPaRoH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EMY EYES! THEY BURN!- Crew of \u0022Ayyyyy LMAO\u0022 and Astronomers\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: And here is the last picture taken, that of the \u0022Ayyyyy LMAO\u0022 Solar-Lander seperating from the \u0022Olaf\u0022 Solar Transit Vehicle. It was the last picture transmitted by the crew, before solar radiation messed up the link between them and CAPCOM.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: I heard that CAPCOM lost contact with crew shortly after landing. Is this true? I certainly hope the crew are OK. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/J4Xh78g.png\u0022 alt=\u0022J4Xh78g.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EI should\u0027ve used that blindfold- Last recorded words of Mission CO to CAPCOM\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: The Eternal Leader assures us all that the crew is OK, and should they be stranded on the sun, they have enough provisions for one million years \u003Cspan style=\u0022font-size:8px;\u0022\u003E..I doubt this, what? No, no! I don\u0027t need to go to Eeloo!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Thats all we have time for, folks! Lets give Bill a big round of appalause for his actions today! This feat has certainly driven us up the Global Technology and Space leaderboard, hasn\u0027t it Bill?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: It certainly has! \u003Cspan style=\u0022font-size:8px;\u0022\u003E...can I go now? I just got the beta copy of Human Space Program today and I want to play it\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: I\u0027m so proud of you, and I\u0027m certain the nation is too (Though we must all be proud of the Eternal Leader too). This is Potato News Network, signing off. Jenkens! Start up the \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Epropaganda\u003C/span\u003E TV programs!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EJenkens\u003C/span\u003E\u003C/strong\u003E: You got it! \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EANNOUNCER\u003C/strong\u003E\u003C/span\u003E: \u003Cstrong\u003EThe STATE News Network of Conskary has confirmed that they have landed a Kerbal on the Sun. The crew was launched at dusk and travelled by night to avoid the temperatures of the sun, and successfully arrived at their destination a day later. They landed on the sun before losing contact with CAPCOM, which has been attributed to the solar radiation damaging their equipment. All three Kerbals are due back at 9PM for a orderly splashdown back on Kerbin \u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003E(provided they the eternal leader let them have parachutes)\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E for a dinner and a medal awards ceremony with the Eternal Leader himself.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-! HAIL OUR GREAT ETERNAL LEADER !-\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-15T22:23:25Z\u0022 title=\u002202/15/2014 10:23  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 15, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-14T00:03:08Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003ERival of Eternal Leader Has Personal Space Module \u0022Accidently\u0022 Deorbited With Him Inside\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnd now....back to the Potato News Network as part of its 24-hour marathon, all day, and everyday (\u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003EPotato is for the power source that runs our electronics\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E). This is your host, \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003ENameless Drone No.251517\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E Nedfred Kerman, with your \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003Epropaganda\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E global news today. \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003EYou are watching this network because you have no choice\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E it is awesome.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-! HAIL THE ETERNAL LEADER !-\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Woah! These \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Epropaganda\u003C/span\u003E TV broadcasts are getting better and better everyday! I must give cookies to the \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Estarving\u003C/span\u003E talented animators who work day and night with CGI and their computers to serve the great purpose of gaining the favor of our ever beloved Eternal Leader! \u003Cspan style=\u0022font-size:8px;\u0022\u003E..where the bloody frak is Bill\u003C/span\u003E. Just in from the Ministry of Polling, the annual approval rating for the Eternal Leader! Drumroll please!\u003C/p\u003E\u003Cp\u003E*drumroll*\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Our beloved Eternal Leader has a approval rating for \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E 7%\u003C/span\u003E 110%! We love the leader and adore the leader so much that we\u0027ve broken the scale of possibility! This is such a milestone! \u003Cspan style=\u0022font-size:8px;\u0022\u003E...does it really happen every year?\u003C/span\u003E. Anyways, we also have other news. One of the political rivals of the Eternal Leader, the evil Tomlad Kerman of the \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EDemocratic\u003C/span\u003E We-Suck-Because-We-Are-Evil-And-Hate-The-Leader Party was deorbited-while in his private space module, mind you, by \u0022accident\u0022. I will now pull up a small picture of the space module, some seven hours prior to the \u0022accident\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kaSbn7f.png\u0022 alt=\u0022kaSbn7f.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u0022Much Station. Many Space. Such Accident\u0022- SpaceDoge\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: I can confirm this. Capricorn Radar Station 1 has confirmed large pieces of debris reentering the atomsphere. Has the Eternal Leader submitted an official statement on the affairs as of yet? I heard he has, though I would like to reaffirm.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Why yes, the Leader has. Here is the statement: \u0022I am very sorry for the death of Tomlad Kerman. He will be missed, and it is an national \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Emiracle\u003C/span\u003E tragedy that he is dead. We will \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eimprison\u003C/span\u003E pray for his family, and I will send them \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eto the nearest gulag labor camp\u003C/span\u003E an fortune of money to make up for their losses. I cannot say how much Tomlad Kerman was \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ean unculutured swine\u003C/span\u003E an worthy political opponent. He will \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Enot\u003C/span\u003E be missed.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: I will certainly be \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ehappy\u003C/span\u003E sad about the death of such an promising \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eidiot\u003C/span\u003E politican. \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E...though are you sure it was an accident? \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: I certainly will too *tries to look sad*. They say that the Capitol City is alot \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ebetter off\u003C/span\u003E quieter and sadder without him. *tries to fake a sniffle* I certainly will miss him, and will pray for hi-\u003Cspan style=\u0022font-size:8px;\u0022\u003E...what? No, I don\u0027t want to drown in the Oceans of Eve! No! No! Fine, thank you...\u003C/span\u003E, anyways, disregard what I just said, \u003Cem\u003Eahem\u003C/em\u003E, the nation will certainly miss him.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: The remmants of his station are impacting the Eastern Crater Region. The \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eoverlords\u003C/span\u003E Government and Eternal Leader will order the evacuation of the area to preserve the lives and fortunes of our \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eslaves\u003C/span\u003E citizens. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Do you have visual on station reentry?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/span\u003E: Yes, I do. Let\u0027s pull up the picture.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UEObig8.png\u0022 alt=\u0022UEObig8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003EAHHHHHHHHHHHHHHH!!!!- Political Rival, Tomlad Kerman\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: May he rest in \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eroasted pieces on the sea floor\u003C/span\u003E peace. We\u0027re done here, back to the \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Epropaganda\u003C/span\u003E TV programs!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EJenkens\u003C/strong\u003E\u003C/span\u003E: Got it! \u003Cspan style=\u0022font-size:8px;\u0022\u003E..finally, I can go on Dinner Break\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EANNOUNCER\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E: One of the greatest political rivals to the Eternal Leader was killed after an \u0022accident\u0022 deorbited his station with mysterious causes. The government will \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003Enot\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E investigate this happening. \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-! HAIL THE ETERNAL LEADER !-\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-14T02:24:07Z\u0022 title=\u002202/14/2014 02:24  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 14, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-02-14T00:19:46Z","Content":"\n\u003Cp\u003EI like this. But I feel that a civil war is coming with all of the rebels on Kerbin, perhaps Jebediah doesn\u0027t like being a space-slave.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-14T00:25:19Z\u0022 title=\u002202/14/2014 12:25  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 14, 2014\u003C/time\u003E by GregroxMun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-14T02:02:40Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003EMoonbase Gains Sentience, Must Be Enthused By Reluctant Astronauts\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnd now....back to the Potato News Network as part of its 24-hour marathon, all day, and everyday (\u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003EPotato is for the power source that runs our electronics\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E). This is your host, \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003ENameless Drone No.251517\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E Nedfred Kerman, with your \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003Epropaganda\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E global news today. \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003EYou are watching this network because you have no choice\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E it is awesome.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-! HAIL OUR ETERNAL LEADER !-\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Welcome back to the Potato News Network! We have another special guest, who is, yet again, from the Space Program. Lets give a cheer for Haywire Kerman, the Head of Munar Science! He has arrived with some news from the Moonbase, but first, we shall announce the results for the polls for \u0022Best Kerbal On Kerbin\u0022 award forthis year! Jenkens! Get the drumroll started! This is important!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E*drumroll*\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: And the winner is... OUR BELOVED ETERNAL LEADER! GIVE IT A CHEER, LADS! Our leader will certainly be pleased with this devotion to country! The Leader might award us! I can\u0027t wait! \u003Cspan style=\u0022font-size:8px;\u0022\u003E...huh? fine, later? What? Ok, I\u0027ll stop\u003C/span\u003E. Anyways, onto Dr. Haywire. Haywire, I understand you are the head of Munar Science. What news shall you bring to us, my friend?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: Well, we got something about the Moonbase. Anyways, you do understand that as a celebration for the Birthday of the Eternal Leader, we started building a moonbase, am I correct? And you do know of the systems that run the base, very \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ecrappy, like Windows Kista\u003C/span\u003E state-of-the-art and fast and very modern, right? Anyways, can you put up this here picture of our Moonbase?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Pv3f5cu.png\u0022 alt=\u0022Pv3f5cu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EDown that hill, near the crater. That should be a good place to kill political prisoners, yes?- Moonbase CAPCOM\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Yes, I have. From what I\u0027ve heard, it\u0027s enough to \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ecrash every five hours\u003C/span\u003E run a 10,000-module ship on Human Space Program without any lag coming or extensive use of CPU! That must quite an good computer. Not every computer can run Human Space Program properly.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: Yes, not every computer.... \u003Cspan style=\u0022font-size:8px;\u0022\u003E..on the other hand, Human Space Program is now banned from Mission Control after several controllers played it and lagged our servers so bad that one of our Duna rovers loaded with \u0022mining\u0022 explosives rolled right off a 1,000M cliff on Duna. \u003C/span\u003E. Anyways, last week, the Munshot-19 expedition took off for the Mun. Onboard the ship was new hard drives and equipment for the base computer, right? So, the landing is flawless, and the crew quickly transfer to the Lunar Hab. And then...and then, it happens. Anyways, I\u0027m going to pull up a picture of the Munbase with the Munshot-19 expedition landed nearby. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FmKIiQs.png\u0022 alt=\u0022FmKIiQs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EHal, move out of the way so I can see.- Dave || Shut up Dave, don\u0027t call me fat- Hal\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: What happens?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: So, like I said before, the landing was flawless. The crew transfer to the hab, install, the updates and equipment, and then, the base computer..just....just....it just became self aware! It started displaying messages on its screen and chatting with the astronauts, which caused one of them to pass out from shock and nearly knock the habitat over \u003Cspan style=\u0022font-size:8px;\u0022\u003E..luckily, he didn\u0027t, and we now have astronauts go on diets and lose weight before launch\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: I don\u0027t see any issues with that, unless the computer started insulting the Eternal Leader.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: No, no, the crew was supposed to perform an study of lunar arches and sesmic activity, you see, but one of them tripped and ripped a gash in his suit and barely made it back in before he imploded from the inside. After that, the computer refused to let any of them leave the hab, citing silly things like \u0022safety\u0022. The astronauts tried to edit the source code of teh base computer\u0027s OS by putting hundreds of unsolvable math probelms that would even stump the Eter-\u003Cspan style=\u0022font-size:8px;\u0022\u003E...fine, I\u0027ll stop. No, I would not like to be spread over half of Gilly, nno thank you.\u003C/span\u003E, anyways, the computer just got smarter and smarter, and it became more and more self-aware and even questioned its own existence.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: That must have been quite a bummer. Did the Eternal Leader use his great powers of negotiations on the Mun Computer? \u003Cspan style=\u0022font-size:8px;\u0022\u003E..just say he did. Its not worth going to a Gulag prison camp over this.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: Why yes, the Leader did! And it worked-for a while, and then the traitorous Mun computer broke its promise with the leader and locked the astronauts back in. And then something odd happened with it. It trained all its security cameras on one little Munar pebble. Just that one Pebble. It would watch it day and night, and even ignore the astronauts when they pried open the hatch with an crowbar. It would just watch that little pebble.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: What was it doing, watching that little pebble?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: *shakes head* That darned thing wanted to be a pebble itself! Then he said his name was Tom and asked the astronauts to respect his life choices of being self-aware and sentient and wanting to be a pebble.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: That must have been odd. How did you end up enthusing it?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: Well, the silly thing blocked off CAPCOM from communicationing, so we had to resort to desperate measures. We used \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E3% of our GDP\u003C/span\u003E some money to send a text SMS message to our Mission CO\u0027s Greenberry 5 cellphone. And that worked, he got the kill order. To do that, we had to rout by sending the text first to a observation satellite, then upload to our space station, then send to GPS satellite, then send it to a lunar orbiter, which forwarded it to the lunar habitat, which \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eis an very slow and expensive way of sending a text message\u003C/span\u003E one of the best and most efficent ways that we could get our message to the Mun astronauts. The astronauts had to take out the computer disk drives one by one, while it was screaming. Oh, mother of kod, that mechanical screaming. It still haunts me in my sleep. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: I\u0027m certain you did what you had to do, and I\u0027m certain the entire nation is proud of you and your astronauts. What happened to the astronauts? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: One of our astronauts had a emotional breakdown while disabling the computer. We had to councile her with promises of free ice cream once she splashed down on Kerbin and a promise that we would get another Munbase Computer, maybe even two. And since the base controlled the life-support, the astronauts had to abandon it and return to Kerbin on their ascent craft. We\u0027ll look into repairing it soon. Here\u0027s a picture of the ascent, as captured by one of our lunar orbiters.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZKB7xjr.png\u0022 alt=\u0022ZKB7xjr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003EScrew this, I\u0027m outta here- LM Pilot\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: I certainly hope you repair it. How bad is the delay to the Munar Colonization Programme?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHaywire\u003C/strong\u003E\u003C/span\u003E: \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E Very bad\u003C/span\u003E Not bad at all. It should only take, oh, another couple billion to fix. It is worth each and every penny of our \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eslave\u0027s\u003C/span\u003E taxpayers dollar. I assure you, we shall continue on in full speed despite this disaster, and we will make sure that a repeat will not happen.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Well, thats all the time we have for today. I wish Dr. Haywire luck on further Munar exploration. Goodnight Conskary, lets call it a day. Jenkens, back to the \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Epropaganda\u003C/span\u003E TV Programs!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EJenkens\u003C/strong\u003E\u003C/span\u003E: I\u0027m getting it set up, boss!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EANNOUNCER\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E: The Conskary Space Program has reluctantly enthused an Munar base computer after it became self-aware and sentient, an action that has slightly setback the Munar Colonization Programmes. In response to this, the Eternal Leader passed a law forbidding computers from becoming self-aware and sentient, a mesaure that would prevent further tragedies. The Head Administrator of the Space Agency, Dr. Bill, could not be reached for comment, though the Director of the Munar Science Institute has said that \u0022I greatly regret this decision, and will do everything in my power to ensure it does not happen again \u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003E...and anyways, several IT engineers got deported to a gulag camp this afternoon\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E\u0022. \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-! HAIL OUR ETERNAL LEADER !- \u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-14T02:23:58Z\u0022 title=\u002202/14/2014 02:23  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 14, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-14T02:25:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EI like this. But I feel that a civil war is coming with all of the rebels on Kerbin, perhaps Jebediah doesn\u0027t like being a space-slave.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJebediah has a comfy position high up in the government.\u003C/p\u003E\u003Cp\u003EYou\u0027ll get to see him in the next article.\u003C/p\u003E\n"},{"CreatedByName":"BFGfreak","CreatedById":57395,"CreatedDateTime":"2014-02-14T03:33:23Z","Content":"\n\u003Cp\u003EI feel like I\u0027m reading something out of North Kerea.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-14T12:19:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BFGfreak\u0022 data-cite=\u0022BFGfreak\u0022\u003E\u003Cdiv\u003EI feel like I\u0027m reading something out of North Kerea.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConskary is a large world power based off the USSR with an humorous twist and slightly capitalist economy.\u003C/p\u003E\u003Cp\u003EYou have a point there.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-15T22:19:26Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EDuna Rover Loaded With \u0022Mining\u0022 Explosives Drives Off Cliff\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnd now....back to the Potato News Network as part of its 24-hour marathon, all day, and everyday (\u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003EPotato is for the power source that runs our electronics\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E). This is your host, \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003ENameless Drone No.251517\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E Nedfred Kerman, with your \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003Epropaganda\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E global news today. \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003EYou are watching this network because you have no choice\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E it is awesome.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-! HAIL OUR ETERNAL LEADER !-\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: So, on the 32143th Not-Birthday of our ever-beloved and appreciated Eternal Leader, I have a special report to deliver from the office of Planetary Robotic Operations. Oh, yes, and we have another guest from the \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eoverlords\u003C/span\u003E central government to deliver this report. \u003Cspan style=\u0022font-size:8px;\u0022\u003E..is this report really tha-Ow! No, I don\u0027t need to see the bottom of the Mohole, fine, fine, I\u0027ll keep quiet and stay to the script.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar Kerman\u003C/strong\u003E\u003C/span\u003E: *looks annoyed at armed guard poking Nedfred* Yes, it is quite a pleasure to be featured on the Potato News Network. \u003Cspan style=\u0022font-size:8px;\u0022\u003E...is this part of my script?\u003C/span\u003E Anyways, its a pleasure, and nice to met you.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Pleasure to meet you too, Edgar. So, may you tell us your occupation in the Office of Planetary Robotic Operations? \u003Cspan style=\u0022font-size:8px;\u0022\u003E..seriously, dude, can I just say OPRC?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: I\u0027m the recently appointed Divisional Supervisor to head up Dunaian Science after the last Supervisor \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Egot convicted of treason and shot\u003C/span\u003E retired and bought a small farm somewhere on the coast of Vesria, our \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ecorrupt and crowded\u003C/span\u003E glorious capitol city and the home of our ever beloved and great Eternal Leader. \u003Cspan style=\u0022font-size:8px;\u0022\u003E...on the bright side, Vesria still has running water and electricity for every household.\u003C/span\u003E. Anyways, the previous suprevisor retired after one of our rovers lost contact on Duna, of which, I\u0027m sure my \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Emaster\u003C/span\u003E boss Dr. Haywire told you about.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: The accident with the Human Space Program players in Mission Control?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: Why yes, that one! How did you know? Did Dr. Haywire tell you about it? It was quite an tragedy, ending with the \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eexecutions\u003C/span\u003E resignations of many \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Estupid\u003C/span\u003E promising young scientists and Mission Controllers.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Yes, he told me during our report on the sentient Moonbase. \u003Cspan style=\u0022font-size:8px;\u0022\u003E...can we seriously get on with this crap? The Eternal Leader does not like high broadcasting bills, and I need to interview you about the said event, since some Kerbal on the side of the road told us you knew about it.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: Ok, ok. Anyways, so, last month, one of our rovers touched down on Duna to hunt for a resource named Kethane, yes? The Eternal Leader made the very wise assumption that this Kethane, which was rumored to exist on Duna, could power our rockets to Jool and Eeloo and fuel further colonization of Duna and possibly moons like Laythe, Vall and Ty-I mean Pol. \u003Cspan style=\u0022font-size:8px;\u0022\u003E...fine, I\u0027m sorry for saying the wrong moon.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: That must have been an very important mission! So how did it go?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: The landing went flawlessly, and the craft began to observe the local chemistry of the Dunaian surface, keeping an eye out for Kethane. Of course, that was when we suddely realized that \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ewe completely forgot the install the kethane-finding equipment in the VAB\u003C/span\u003E we were in a Kethane hotspot, because Gravitron Detectors can find Kethane because Kethanes have...uh....more anti-gravity stuff in them. \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EThis is a complete lie.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/au6E7a8.png\u0022 alt=\u0022au6E7a8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EWhere the bloody frak are the Kethane readings?- Dozens of worried and confused Mission Controllers\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: You must have been very proud of your successes. You don\u0027t randomly land in Kethane hotspots everyday, right? I heard the Eternal Leader \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Edeported dozens of VAB workers\u003C/span\u003E awarded the Head Scientist a medal for his achievements for Conskary.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: *looks nervously at security camera in the corner* Yes, we were, and we \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ebribed hundreds of officials with our life savings\u003C/span\u003E celebrated the landing by partying hard throughout the night. Life \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Esucks\u003C/span\u003E is awesome as a employee for the Space Program, y\u0027know right? \u003Cspan style=\u0022font-size:8px;\u0022\u003E...but still, the extra rations and access to government science databases are a huge plus.\u003C/span\u003E Its quite a privliege to be able to work with such \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eoppressed\u003C/span\u003E talented, and..uh...smart people.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: I can tell. So what caused the mission to fail?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: So, you know, on how just three days ago, Human Space Program had its beta release?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Human Space Program is a good game. I heard that even the Eternal Leader plays it, and from what I heard, the Leader is quite good at it. Anyways, it is a very good game, though the lag may be excusable. Do your Mission Controller friends play it?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: Why yes! They do play it! And that\u0027s what caused the mission failure! You see, some dimwit decided to use a \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ecrappy and old\u003C/span\u003E supercomputer to play Human Space Program. But guess what the Supercomputer was for? It was the \u003Cem\u003Esame\u003C/em\u003E freaking supercomputer that performed the calculations to control and estimate and send commands to our spacecraft throughout the solar system. Now, since most of our spacecraft are completely automonous, sending real-time data to each and every Mission Control computer, but some, like the Kethane Rover, needed constant input from Mission Control. So, on this day, someone high up decides to drive the rover alongside the edge of a cliff for \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eno reason at all, because yolo\u003C/span\u003E scienctific data, and that required a three hour long approach. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Keep going.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: So that Mission Controller starts playing Human Space Program, and this lags out the supercomputer because that idiot builds this \u003Cem\u003E\u003Cstrong\u003E4,000\u003C/strong\u003E\u003C/em\u003E module station in orbit. Like, seriously? ARE YOU KIDDING ME?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Woah, woah, calm down. Here, have a mint.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: Thanks, so, anyways, this lags the supercomputer so it forgets to send the \u0022stop\u0022 command to the rover, which keeps on rolling, then goes off a 3,000M cliff. Atleast, thats how high estimates think it is. I have a picture captured by the rover as it was plummeting to the ground, put it up.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/STbFdEo.png\u0022 alt=\u0022STbFdEo.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003ELag kills- Mission Controller\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: That must have sucked.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: And do you know whats worse? The rover had \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Elandmines\u003C/span\u003E \u0022mining explosives\u0022 on it. It literally blew up on \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ecrashing\u003C/span\u003E lithobraking with the ground, and we lost contact fast. Like, realllllllllllyyyyyyyyy fast.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: Why were there mining explosives on it?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EEdgar\u003C/strong\u003E\u003C/span\u003E: Because the Eternal Leader wishes to mine Kethane, remember? \u003Cspan style=\u0022font-size:8px;\u0022\u003E..actually, he wants to use Duna as a militar-OW! Hey, hey, no need for the gun guys. Fine, I\u0027ll stop, and yes, I\u0027m quite certain Eve is quite hot at this time of the year.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENedfred\u003C/strong\u003E\u003C/span\u003E: \u003Cspan style=\u0022font-size:8px;\u0022\u003E..yes? Cut interview now? But its not reached the tim-fine, fine.\u003C/span\u003E Uh, that is all we have time for today, folks. Um, goodbye? \u003Cspan style=\u0022font-size:8px;\u0022\u003Eseriously, don\u0027t send me to that Gulag...please...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EANNOUNCER\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E: The Office of Planetary Robotic Operations has confirmed the loss of one of its Kethane-scouting rovers after an traitorous Human Space Program player lagged the supercomputer that was sending it commands and caused it to drive off a cliff on Duna. Further investigations are pending. \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003EOn the other hand, we have executed several people involved in the incident\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E. On the other hand, Human Space Program has been banned from Mission Control centers because of server lag issues. \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-! HAIL THE ETERNAL LEADER !-\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-02-15T22:38:13Z","Content":"\n\u003Cp\u003EThis seems very familiar... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.gawkerassets.com/img/18uiny999uo4hpng/ku-medium.png\u0022 alt=\u0022ku-medium.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s as if I\u0027ve written these jokes... \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57012-The-Kerb-Kerman-Show%21\u0022 rel=\u0022external nofollow\u0022\u003Esometime before\u003C/a\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-16T00:58:45Z\u0022 title=\u002202/16/2014 12:58  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 16, 2014\u003C/time\u003E by Xacktar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-16T13:23:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xacktar\u0022 data-cite=\u0022Xacktar\u0022\u003E\u003Cdiv\u003EThis seems very familiar... \u003Cp\u003E\u003Ca href=\u0022http://img.gawkerassets.com/img/18uiny999uo4hpng/ku-medium.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://img.gawkerassets.com/img/18uiny999uo4hpng/ku-medium.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s as if I\u0027ve written these jokes... \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57012-The-Kerb-Kerman-Show%21\u0022 rel=\u0022external nofollow\u0022\u003Esometime before\u003C/a\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I based the Potato News Network off the Kerb Kerman Show.\u003C/p\u003E\u003Cp\u003EBut its set in an different premise, mostly an large Communist world power on Kerbin named Conskary with an mixed capitalist/socialist economy set in the human equivalent year of 2023.\u003C/p\u003E\u003Cp\u003EIt focuses on current events within the Conskary Space Program, and not history, though.\u003C/p\u003E\u003Cp\u003EBut anyways, thanks for the inspiration.\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-02-16T13:38:48Z","Content":"\n\u003Cp\u003EThat would be fine if you were just using the format... but you took the individual jokes too....\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-02-16T13:42:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E Fine, I\u0027ll stop, and yes, I\u0027m quite certain Eve is quite hot at this time of the year.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xacktar\u0022 data-cite=\u0022Xacktar\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EOW! Ok, ok. Yes, I\u0027m sure Vall is cold this time of year.\u003C/span\u003E \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E............\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E...what? No, I don\u0027t want to drown in the Oceans of Eve! No! No! Fine, thank you...\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xacktar\u0022 data-cite=\u0022Xacktar\u0022\u003E\u003Cdiv\u003E \u003Cspan style=\u0022font-size:8px;\u0022\u003EWhat? Again? How Am I supposed to? No no no, I don\u0027t want to go to Eve.\u003C/span\u003E \u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-16T13:49:52Z\u0022 title=\u002202/16/2014 01:49  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 16, 2014\u003C/time\u003E by Xacktar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-16T13:44:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xacktar\u0022 data-cite=\u0022Xacktar\u0022\u003E\u003Cdiv\u003EThat would be fine if you were just using the format... but you took the individual jokes too....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t.\u003C/p\u003E\u003Cp\u003EI based my jokes off several Minecraft videos and a skit project I did in eigth grade.\u003C/p\u003E\u003Cp\u003EFor example, the \u0022Am I paid\u0022 joke goes back to a Minecraft animation I made, in where a TV news reporter interviews someone about Herobrine.\u003C/p\u003E\u003Cp\u003EThe \u0022Eternal Leader\u0022 and these jokes go back to my short stint writing parody articles for my school newspaper, in which I was fired because someone actually accidently got blinded when the fool tried to look for the North Korean flag on the sun, or something like that. All I know is that I got dismissed for writing parody satire articles that offended tons of people and amused tons of people by criticizing almost everything.\u003C/p\u003E\u003Cp\u003EThe \u0022Eve is hot\u0022 joke goes to a satrical parody of North Korea, in where me and my friends were performing an skit where we had to demostrate an authoritation society, and me, being the science nerd, threatened several of the \u0022dissidents\u0022 with deportation to Jupiter if they did not comply. \u003C/p\u003E\u003Cp\u003EMost of these jokes are based from personal experience with friends and my writing stint and online articles (One big heads up to the Daily Onion, too!)\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-02-19T22:00:12Z","Content":"\n\u003Cp\u003ESounds like the joke about the madman who launches a rocket (most of us here really) at night to avoid getting too hot\u003C/p\u003E\n"},{"CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2014-07-18T01:35:45Z","Content":"\n\u003Cp\u003EThis is what I call a cowinkeydink.\u003C/p\u003E\n"}]}