{"TopicId":74085,"ForumId":39,"TopicTitle":"The continuing story of the Velocity Space Program","CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2014-06-04T04:23:35Z","PageNum":1,"Articles":[{"CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2014-06-04T04:23:35Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EThe Prologue\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe Velocity space program has a long, interesting, and occasionally comical history. This is the continuing story of all who have dreamed to see it develop, and what it is becoming. Sit down, relax, enjoy a jolly cup of tea unless you fear for spilling it on your electronics, and read their story.\u003C/p\u003E\n"},{"CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2014-06-04T04:37:52Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EChapter I - square one\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOn a grassy peninsula which all of you know of, two barely completed buildings stood. A stark white, blank, and newly built rectangle, the tallest building ever built on Kerbin stood. This was VAB, and it was soon to represent progress and opportunity, the workhorse not just of the space program but for all of Kerbin. The second structure was less noteworthy, a flat mound of concrete with a small tower to the side. It was the launch pad, and it was going to have to hear all of the burdens and terrible ideas the engineers came up with. Not two kilometers away, a much less noteworthy bench with two Kerbals existed. They seemed quite philosophical about the entire thing.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003Eback to square one again, eh? I just hope it doesn\u0027t turn into another white elephant.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003Ethis isn\u0027t just a start-over, Gene. We learned plenty of lessons during the Insular program, and we can use what we learned to make something that isn\u0027t just from scratch. Now we actually know what we\u0027re doing, and we\u0027re ready to explore the Kosmos.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003Ebut there are still plenty of lessons that we haven\u0027t learned yet. Kerbals cannot prepare for everything, and our only hope is to stop whatever is happening before things go horribly wrong. Besides, how are you gonna get Kosmonauts for the program? Only a few survived Insular, and I doubt any of them wanna stick their heads into the fire again. I bet it was cold up there...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003EYou\u0027re right, Gene. I\u0027m thinking you could help in, like you said, stopping disasters before they happen.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003Eyou want me to be a health inspector? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003E(sighs) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E No, I want you to be the ground control chief. I know it\u0027s quite a commitment, but that\u0027s the sort of work ethic we need here. Big commitments.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003Eok, I will. What about the Kosmonauts? How are you going to convince them that they aren\u0027t just being asked to poke their heads into the fire again? Is there anyone else who we could hire? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003Ewhat about Bill? He has the experience and the know-how, and he seems to always be able to get out of a tough situation alive.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003Ethe Recco survivor? His last experience messed him up so much, if you even mention space he hides under a table. Or a desk. Or the bed. Nah, he\u0027s never going to want to ever have anything to do with space again. What about Jebediah? The test pilot?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003E(guffaw)\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E a test pilot! You\u0027re joking! He would never be able to go without constant attention. Plus, he probably doesn\u0027t even know basic division! What makes you think he has the experience?!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003Ewhat do you mean, needs constant attention? Those airplane radios only work a fraction of the time, and flights can last hours. Besides, he worked with Kirrim, that special agent, to disable the ICBM depot in the eastern desert mountains. He had to know enough physics to jam the radio frequencies to fire the thing, and the gut to jump onto an armed missile and cut the wires under fire, and-\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003Ealright, you win! We\u0027ll call him this afternoon. But I still insist we ask that Bill fellow.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003Efine with me, although don\u0027t blame Bill if he hangs up on you. How about we go get a meal first? It\u0027s past lunch-time.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003Emy stomach agrees with your advice. Besides, I could use a orange cola milkshake to cool me down.\u003C/p\u003E\u003Cp\u003EThe sooner I get attention, the sooner the next chapter will come out! Don\u0027t forget to comment, unless you want me to quit the series!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-04T05:21:07Z\u0022 title=\u002206/04/2014 05:21  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 4, 2014\u003C/time\u003E by VelocityPolaris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aurora","CreatedById":111947,"CreatedDateTime":"2014-06-04T20:44:43Z","Content":"\n\u003Cp\u003EI like it. More, please \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2014-06-04T22:20:56Z","Content":"\n\u003Cp\u003EYay! Attention! I will start building the next part now!\u003C/p\u003E\n"},{"CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2014-06-04T22:29:18Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EChapter II - and then came Jeb\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIn the highlands of one of the most populous continents of Kerbin, (hint: the one the KSC is at) a long wooden hut resides. This is the oomlatt bar, where our two heroes had just sat down to lunch. Well, not entirely just. They were at least twenty minutes into a meal of Kird sandwiches, fried snaazner berries, and orange cola milkshakes. Well, Gene wanted Lemon, but it doesn\u0027t really matter. By then, only the soda-shakes remained.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003EHmmm. This is the best shake I\u0027ve ever had! Wernher, we really should come here more often!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003EI must admit, these people make some tasty orange cola milkshakes. However, it wouldn\u0027t be proper once we have a workforce. Eating in front of them... it seems... piggish? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003ENo wonder you made a bad director for Insular Space Program. Not eating with your crew makes \u0027em think that you consider yourself to be too dignified... to lower yourself down to their level. You\u0027ve got to associate with your Kerbals for them to trust you.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003EThat is not how we ran things in Kazi Kermany.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003EYeah? Well, let me know how THAT ended up.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003E...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003ESo, do I win or do I win?\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E ... Don\u0027t we have a phone call to make?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FFFF;\u0022\u003EGene: \u003C/span\u003ERight you are.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E We\u0027ll call the airbase and ask them to get Jebediah Kerman on the line.\u003C/p\u003E\u003Cp\u003EMeanwhile, somewhere in the Eastern Badlands...\u003C/p\u003E\u003Cp\u003EAn official-looking Kerbal in sat in a dusty wooden office, signing various paperwork with one hand and holding a cup of carbonated-caffeine-tea. (Kerbals have yet to come up with a better name for that beverage) He signed the final document and leaned back in his chair for a well-earned rest. About forty seconds later, the telephone rang. The tired official sighed, swigged down the rest of his carbonated-caffeine-tea, and picked it up. Werner (known to friends as wernher) von Kerman greeted him on the other end.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher: \u003C/span\u003EHello, is this Pavlova air force base? \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FFA500;\u0022\u003EOfficial: \u003C/span\u003EHypothetically, if I said it wasn\u0027t, would you believe me and then go away?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EWernher:\u003C/span\u003E No...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FFA500;\u0022\u003EOfficial: \u003C/span\u003E(sighs) Oh. Alright then, this is commander Kirlak in charge of Pavlova airforce base, how may I hurt you?\u003C/p\u003E\u003Cp\u003E(Now, some of you might know about a director Kirlak from Mekan1k\u0027s series. Let\u0027s just say that this is an alternative universe to Mekan1k\u0027s, where Kirlak is a depressed air force base commander. As for the name, I... ran out of original names?)\u003C/p\u003E\u003Cp\u003ENow, back to the story.\u003C/p\u003E\u003Cp\u003ECONSTRUCTION ZONE\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-11T23:11:29Z\u0022 title=\u002206/11/2014 11:11  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 11, 2014\u003C/time\u003E by VelocityPolaris\u003C/strong\u003E\n\u003C/span\u003E\n"}]}