{"TopicId":75905,"ForumId":39,"TopicTitle":"Project Colossus","CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2014-06-25T06:42:26Z","PageNum":1,"Articles":[{"CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2014-06-25T06:42:26Z","Content":"\n\u003Cp\u003E\u003Cem\u003E2 Years after the initial revolt against the Vigilance Corporation, The Rebellion has risen from the ashes of it\u0027s predecessor, and vows to succeed where all else have failed.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe Vigilance Corporation launched Project Colossus, a series of operations launched by special mission units with objectives to destroy the insurgents, and their organization, bit by bit.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EPeace and order, by force.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EChapter 1: Target: Praetorian.\u003C/span\u003E\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAs the screen buzzed with footage of the Praetorian H.A.W.C station launching it\u0027s duel missile payload against orders, with flight predictions and estimated casualties, the numbers of which ran into the billions. Details of the launch showed in large text: \u003Cstrong\u003EPriority: PARAMOUNT IMPORTANCE\u003C/strong\u003E.Soon, a large button popped up on the otherwise green and black screen: \u003Cstrong\u003EACTIVATE OMEGA TEAM Y/N\u003C/strong\u003E, Lukas Kerman clicked yes and names popped up with portraits of the individual agents:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKerman, Sigvan\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAgent Call-sign: Wolf\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKerman, Sigson\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAgent Call-sign: Coyote\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKerman, Ribvan\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAgent Call-sign: Crow\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EKerman, Mildred\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAgent Call-sign: Hyena \u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHe split them into two teams, Wolf and Hyena on one, Crow and Coyote on another, tasked with targeting each of the missiles en route to Kerbin, with only a few hours before they hit the atmosphere.\u003C/p\u003E\u003Cp\u003EThe two dropships launched immediately after he initiated the operation, with no briefing Omega team went out with clear orders: Destroy the warhead, and thus the missile. Sigvan sat in the left most pod of the dropship while Mildred sat on the right, they prepped themselves for the operation.\u003C/p\u003E\u003Cp\u003EWhile they were veterans, Ribvan and Sigson were both rookies, only on a few other ops before hand with little experience. With the stakes so high, Sigvan thought it was a mistake to bring them, he thought it would be a better idea to bring a normal soldier with them, or a drone.\u003C/p\u003E\u003Cp\u003EThe mission was easy on paper, but in practice far too much could go wrong, with at least 8 sets of 24 military grade missiles with the capability to level 64% of a city from the center. Bill Kerman, who was operating the satellite has gone dark, and because the missile\u0027s detonation could be remotely controlled by intention, the elimination of an elite squad could easily be worth more then hurting the rebellion\u0027s public image.\u003C/p\u003E\u003Cp\u003ESigvan knew this. While Mildred had always assumed that the Rebels were little more then glorified terrorists, this attack fit into this persona. Sigvan could see beyond that an realize that they had a cause behind them, while he doesn\u0027t agree with the cause, and would fight it to the bitter end, it existed nonetheless.\u003C/p\u003E\u003Cp\u003ETaking out an elite team? Worth it. Ruining your public image? Not worth it, nothing gained, everything lost.\u003C/p\u003E\u003Cp\u003EAs the dropship burned exiting the atmosphere, he continued to think \u0022Speed is everything, move fast.\u0022\u003C/p\u003E\u003Cp\u003ENearly twenty minutes later, they were close to the missile, it stopped burning and simply stood still, it would hit the civilian target, it was time. The plan was for Sigvan and Mildred to place cruise missiles on the body of the missile and detonate them, detonating the warhead and destroying the missile.\u003C/p\u003E\u003Cp\u003EThe pods dropped and Sigvan got out, the missiles were dropped shortly after, along with a later and tether to stay attached. Sigvan grabbed the ladder and moved toward the missile.\u003C/p\u003E\u003Cp\u003E\u0022Moving up, keep ready.\u0022\u003C/p\u003E\u003Cp\u003EMildred attached the tether, and Sigvan the ladder, he also grabbed a different tether and placed it, they we now attached to the missile.\u003C/p\u003E\u003Cp\u003E\u0022Grab a missile, hit the warhead and probe core.\u0022 Sigvan said, slightly agitated.\u003C/p\u003E\u003Cp\u003E\u0022Roger\u0022 Mildred said, confident in his own abilities.\u003C/p\u003E\u003Cp\u003E\u0022We have to move, keep the timeline.\u0022 Sigvan replied, talking faster, trying to stay calm.\u003C/p\u003E\u003Cp\u003EThe Large missiles were attached to the probe core and warhead.\u003C/p\u003E\u003Cp\u003E\u0022Set, let\u0027s move Wolf\u0022 Said Mildred.\u003C/p\u003E\u003Cp\u003E\u0022Roger.\u003C/p\u003E\u003Cp\u003EOverwatch, Omega 1, charges set, prep and ready for exfil over\u0022\u003C/p\u003E\u003Cp\u003E\u0022Roger that\u0022 Said Lukas, under the call-sign, Overwatch.\u003C/p\u003E\u003Cp\u003E\u0022Let\u0027s move gents\u0022 Said Jorzor, one of the team\u0027s pilots.\u003C/p\u003E\u003Cp\u003EMeanwhile, Sigson and Ribvan were both undergoing a similar situation, they had prepped the charges and were ready to leave, however, a brief tisk followed by a low rumbling sound a whhhhurrrrrrr.\u003C/p\u003E\u003Cp\u003ESuddenly time slowed. Sigson faced the missile and watched as the warhead launched, pushing the two agents back toward the now spinning dropship as the white cloud burst into little shrapnel bits which narrowly missed the agents.\u003C/p\u003E\u003Cp\u003ERibvan, bashed by a piece of debris managed to yell: \u0022ARGH, COMMAND, WE NEED TO GET OUT OF HERE\u0022\u003C/p\u003E\u003Cp\u003ESigson and Ribvan barely avoided vaporization, Neil, the other pilot, tried to regain control of the dropship, to no avail and he was forced to evacuate.\u003C/p\u003E\u003Cp\u003E\u0022*Heavy breathing* Command... This is... This is agent Crow... We... We made it...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Roger, you guys okay?\u0022\u003C/p\u003E\u003Cp\u003E\u0022I... I think so...\u0022\u003C/p\u003E\u003Cp\u003ESigson couldn\u0027t move, he felt cold and his vision shook and throbbed, he was alive, but only barely.\u003C/p\u003E\u003Cp\u003E\u0022Sigson looks okay...*Calming down* You okay?\u0022\u003C/p\u003E\u003Cp\u003ESigson was quiet.\u003C/p\u003E\u003Cp\u003E\u0022You with me? You okay? Talk to me Sig!\u0022\u003C/p\u003E\u003Cp\u003ESigson finally came to.\u003C/p\u003E\u003Cp\u003E\u0022Yeah... I\u0027m fine, I think...\u0022 He said, heavily breathing, trying to calm himself.\u003C/p\u003E\u003Cp\u003E\u0022Overwatch to Omega 2, what just happened up there?\u0022\u003C/p\u003E\u003Cp\u003ERibvan talked first: \u0022The missile blew, our dropship\u0027s gone. Over\u0022\u003C/p\u003E\u003Cp\u003E\u0022Copy, can you last another 30 minutes?\u0022\u003C/p\u003E\u003Cp\u003ESigson talked first this time \u0022I think so...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Good, hang tight\u0022\u003C/p\u003E\u003Cp\u003EAs they waited there to be rescued, they sometimes heard a fizzling and groaning, occasionally electric zolt sound, nothing they didn\u0027t pass off as what was left over of the missile.\u003C/p\u003E\u003Cp\u003EBut then, they saw something, something unimaginable, something that would bring even the mightiest of Vigilance Battlegroups to their knees.\u003C/p\u003E\u003Cp\u003E\u0022Uh... Overwatch?\u0022\u003C/p\u003E\u003Cp\u003E\u0022KCHHHHHHHHHHHHHHHHHHHHHHHHHHHH\u0022\u003C/p\u003E\u003Cp\u003E\u0022Overwatch?!\u0022\u003C/p\u003E\u003Cp\u003E\u0022CHHHHHHHHHHHHHHHHHHHHHHHHH\u0022\u003C/p\u003E\u003Cp\u003E\u0022OVERWATCH?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Come in Omega 2?\u0022\u003C/p\u003E\u003Cp\u003E\u0022You need to see this...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Patch us in...\u003C/p\u003E\u003Cp\u003EOh...My...God...\u003C/p\u003E\u003Cp\u003EWhat is tha-?KCHHHHHHHHHHHHHHHHHHHHHH\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-25T23:54:44Z\u0022 title=\u002206/25/2014 11:54  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 25, 2014\u003C/time\u003E by Special Agent Sigvan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2014-06-25T23:54:58Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EChapter 2: The Normandy\u003C/span\u003E\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ELukas remained confused, the screen buzzed with errors as he tried to connect to the two agents stranded on orbit, as the light flicked and mechanical moans and electric fizzles ran throughout the compound. After a brief period of time everyone in the bunker was concerned, the mechanical groans soon made way for the thought of a mechanical malfunction. Soon Lukas got contact with the agents, it would only last for a few minutes, but it would do for now.\u003C/p\u003E\u003Cp\u003ERibvan\u0027s voice ran through the speakers, frightened and in desperate need of something\u003C/p\u003E\u003Cp\u003E\u0022OVERWATCH?!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Come in Omega 2\u0022\u003C/p\u003E\u003Cp\u003E\u0022You...You have to see this...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Patch us in\u0022\u003C/p\u003E\u003Cp\u003EImages flashed up of a hefty Rebel cruiser, Letters on the side showing \u003Cstrong\u003ERSS NORMANDY\u003C/strong\u003E with many other escorts, one of which scared them the most: A station designed similar to the H.A.W.C station, with a payload of IBBs, the bombs mounted inside the Missiles launched by the Praetorian.\u003C/p\u003E\u003Cp\u003ETwo of them we missing.\u003C/p\u003E\u003Cp\u003E\u0022Oh...My...God...\u003C/p\u003E\u003Cp\u003EWhat is tha-\u0022\u003C/p\u003E\u003Cp\u003EThe connection timed out, the images were the only thing on the screen now.\u003C/p\u003E\u003Cp\u003ELukas calmed himself, he knew what to do.\u003C/p\u003E\u003Cp\u003E\u0022Contact Central, send these images with it, they\u0027ll want to see this.\u003C/p\u003E\u003Cp\u003EScramble cruisers and Hunters, we need to take this thing out\u0022\u003C/p\u003E\u003Cp\u003ETwenty minutes later Central Command received the images and message sent with them, and they briefed a large team to board the cruisers and rescue the stranded agents.\u003C/p\u003E\u003Cp\u003E\u0022Welcome team, Spectre brief them\u0022\u003C/p\u003E\u003Cp\u003EThe A.I. that controlled the majority of The Corporation\u0027s activities, Spectre, briefed the team.\u003C/p\u003E\u003Cp\u003E\u0022Of course Admiral. Team, you will be launched via dropship into the control room of the cruiser RSS Normandy, and terminate the internal crew. You will then activate self destruct protocols and utilize all ordnance on board to destroy the fleet.\u003C/p\u003E\u003Cp\u003EScrambling Cruisers, standby.\u0022\u003C/p\u003E\u003Cp\u003EWith the briefing over, they ran outside into their respective dropships, and watched as 12 Light Cruisers launched into orbit, prepping to destroy the rebel fleet.\u003C/p\u003E\u003Cp\u003EWhen then, they heard another mechanical groan, and saw the IBB hit the ground near Central Command, nearly vaporizing everything inside and the last of the launching dropships.\u003C/p\u003E\n"}]}