{"TopicId":88149,"ForumId":39,"TopicTitle":"[WIP] \u0026quot;Orbital Maintenance\u0026quot; | KSP Animated Short Produced by Ion Animations","CreatedByName":"thefirstOP","CreatedById":126712,"CreatedDateTime":"2014-10-21T22:56:28Z","PageNum":1,"Articles":[{"CreatedByName":"thefirstOP","CreatedById":126712,"CreatedDateTime":"2014-10-21T22:56:28Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XVCefZG.png\u0022 alt=\u0022XVCefZG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EWelcome to the first of hopefully many production threads where I\u0027ll be keeping the community up to date on the progress of our KSP animated shorts. Our lovely team of animators and creative types hope that you\u0027ll enjoy the (hopefully comedic) Kerbal Space Program shorts. While I\u0027m the only member of the team with a forum account (I\u0027ll be getting the others on the forums soon), I\u0027ll gladly answer any questions about our production pipeline, plans for the future and any other questions you may have about the animation process or our team. \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIn addition to creating animated shorts for the community, we also hope to share our models, rigs, and other assets we make with the community so that others can create high-quality shorts, films, or other creative works. All assets we publish will have a Creative Commons CC BY License, which \u003Cspan style=\u0022color:#000000;\u0022\u003Elets others distribute, remix, tweak, and build upon our work, even commercially, as long as there is credit to us for the original creation. These threads will be updated regularly (we\u0027re aiming for once a week) to showcase the work that was done and highlight the future path for each of our shorts. Because of the nature of 3D animation shorts can take anywhere from 1-3 months to complete to a satisfactory level, with each short ranging from 1-5 minutes. This is the limit to what we can produce without outside funding. If we see the demand for longer content, we will consider opening up a channel for financial support so that we can spend more time and effort creating this kind of content. For now however, remember that everyone on the team has a day job, and we\u0027re not going to be able to pump these out every week.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VQvWL6v.png\u0022 alt=\u0022VQvWL6v.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EThe software we will be using includes Autodesk Maya 2015 for our modeling, rigging, and animating; as well as some simple VFX particle simulations with fluids, fire, smoke, and dust. We will be using Adobe Photoshop CS6 for all our still asset manipulation, The Foundry\u0027s Nuke for compositing, and Adobe Premiere CS6 for final edit and render. Additional software we might make use of are Houdini for VFX and physics simulation, Realflow for fluid simulation, and various plugins for Maya to expand our capabilities.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOrbital maintenance is the first of our planned animated shorts and the plot is going to be kept a secret. It isn\u0027t going to be long, just over 2 minutes if our estimates are correct, but we\u0027re going all out on this one to show you what we are capable of producing. The completion goal is set to the 30th of November 2014 which gives us a little over a month to complete it. We would love to come out with a short once a month but with our daily schedules it looks like it\u0027s not going to happen for a long time.\u003C/p\u003E\u003Cp\u003EHere\u0027s the production schedule/milestones for the project.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gpbj2BI.png\u0022 alt=\u0022gpbj2BI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003ECLOSING NOTES #1:\u003C/span\u003E\u003C/strong\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EIn our next update, I\u0027ll fill out the pre-production section with the first page of our script and maybe a storyboard or two. I\u0027ll also fill out part of the modeling and texturing section to showcase what our modelers have completed up to this point. Remember a completion date just over a month away is quite ambitious and the possibility is very real we might have delays. This is the first time the whole team has come together to create something like this, but we do hope the community enjoys it. \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E(Posted 10/21/2014)\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cimg src=\u0022http://i.imgur.com/kDEUzl8.png\u0022 alt=\u0022kDEUzl8.png\u0022\u003E\u003Cp\u003EThe script was finalized on time and storyboarding is underway (as of 8:51pm Oct. 21st). In fact the rough sketch of the storyboard is done. Now physically writing a short is easy, as it\u0027s only two pages in length (since each page equals about a minute of screen time). The hard part is making a comedic plot with good dialogue. Changes can be made between now and post but now we have what we need to move onto phase two of pre-production.\u003C/p\u003E\u003Cp\u003EHere\u0027s the first page of our script, I lied about keeping the plot *entirely* secret. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SlWvkXql.png\u0022 alt=\u0022SlWvkXql.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI do hope that little cliffhanger left you with interesting thoughts of what could happen to our favorite Kerbonauts.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cstrong\u003ECLOSING NOTES #2: \u003C/strong\u003ENext update will add some modeling shots of our current progress. Until next time! \u003Cem\u003E(Posted 10/22/2014)\u003C/em\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cimg src=\u0022http://i.imgur.com/1JUGmBQ.png\u0022 alt=\u00221JUGmBQ.png\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003ESo we decided to completely remodel the Kerbal \u003C/span\u003E\u003C/span\u003E\u003Cem\u003Eand\u003C/em\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E the EVA suit. Initially we had \u0027completed\u0027 the model for both the base \u0027naked\u0027 Kerbal and the suit. The only issue was that we would have to significantly alter the pose for the base Kerbal to get it to fit inside the suit geometry, after all the Kerbal has to \u003C/span\u003E\u003Cem\u003Ewear \u003C/em\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003Ethe suit. Then we started studying the Squad shorts a bit closer and we realized that we had the body proportions totally off. The body needed to be smaller and the legs longer, knees more pronounced, etc... The suit also needed to be shifted to match, it was going to be a complete remodel from scratch, and then I realized we had a ripped game model from an earlier version. We used said reference model as a basis for redoing the modeling and finally we can say we\u0027ve achieved a Kerbal body model we\u0027re happy about. Suit is still WIP as of 12:14am Oct. 23rd. \u003C/span\u003EThe total redesign is on a short schedule as is but it allows us to do some very big things:\u003C/p\u003E\u003Cp\u003EKerbals actually wear the suit on top of their biological geometry. Since we are also designing the suit in parts meant to stick together, Kerbals can put on and take off the suits! So now, when Jeb enters a space station for example, he can actually remove his suit and be wearing actual clothes underneath!\u003C/p\u003E\u003Cp\u003ESpending the time to do this remodel now saves us time in the long run and hopefully opens up some shots and scene possibilities that before might have been impossible. Now onto the pictures! Each one is captioned in the imgur album with more details about what you\u0027re looking at.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Hj8ht\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cstrong\u003ECLOSING NOTES #3:\u003C/strong\u003E\u003Cp\u003EThere\u0027s going to be more to come, at least one more update with finished models and textures as well as some storyboard frames. Modeling, texturing, and rigging are by far the most time consuming aspect for our team so some deadlines might have to be pushed back. As always check the thread for any updates regarding the production of each of our shorts and you can stay up to date on the goings on. If an announcement needs to be made it will be put at the top in big red letters. Hope you enjoyed the second round of updates, until next time! \u003Cem\u003E(Posted 10/24/2014)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003ESo, it\u0027s update time again! And as always, there are some delays. Don\u0027t come yelling at me though, we warned you there would be delays. But to remind ourselves and everyone, the production timeline is only a best case scenario. We\u0027d love to get this short out by the end of Nov., but we\u0027re fine with moving into Dec. if we have to. (Especially since rendering might take a week on it\u0027s own.)\u003Cp\u003EEither way, here\u0027s the main points for the update:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EModeling of the base Kerbal and the EVA Suit is as close as we need to get it for this short. We might expand on it in the future, and we\u0027ve saved all our assets to make this possible, but for this first short, we\u0027re all happy with the outcome.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInitial automatic UV unwraps have been completed, now we just have to sort through them and clean them up, stitch them together, smooth things out, and test them before exporting the layouts for texture creation.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETexturing should start in about a week for the Kerbal suit (as the Kerbal is already textured for the most part). We\u0027re debating using Mudbox for texture painting, and to simply skip using UVs (and in a Maya centered workflow that might be the better idea) but as always we\u0027ll keep you all updated.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWe still need to model the props and the environments for this short including: space plane orbiter, space telescope, tools, toolbox, and Kerbin itself. That whole process might take around 2 weeks (realistically) to complete which almost guarantees that we\u0027ll miss our target deadline.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERigging is going to start simultaneously on a lower poly model so we have texture work and rigging happening at the same time, which should speed things up on that end.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFinally, test renders are hovering at around 90sec per frame with the settings we want which leads us to around a 7.5 day render time for the whole short. Optimization is going to have to happen if we want it to be rendered any faster.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnyways, with that out of the way, here\u0027s our final modeling shots for the Kerbal base mesh and suit.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/2Les4\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cstrong\u003ECLOSING NOTES #4:\u003C/strong\u003E\u003Cp\u003EWe\u0027re also going to open up a new section! Don\u0027t worry, the modeling and texturing section will still be updated, but now we have a new place to add our progress as we reach stage 3: rigging and animation! \u003Cem\u003E(Posted 11/01/2014)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cimg src=\u0022http://i.imgur.com/JtIrywl.png\u0022 alt=\u0022JtIrywl.png\u0022\u003E\u003Cp\u003E[COMING SOON]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-01T16:16:39Z\u0022 title=\u002211/01/2014 04:16  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 1, 2014\u003C/time\u003E by thefirstOP\u003C/strong\u003E\n\u003Cbr\u003EUpdating Modeling and Texturing Section, Added Rigging and Animation Section\n\u003C/span\u003E\n"},{"CreatedByName":"travis575757","CreatedById":83941,"CreatedDateTime":"2014-10-26T03:18:14Z","Content":"\n\u003Cp\u003ESurprised nobody has commented so far, seems pretty interesting though can\u0027t wait to see what the community does with these resources and what type of shorts are in store.\u003C/p\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2014-10-27T08:43:28Z","Content":"\n\u003Cp\u003Ewow! can\u0027t wait to find out more!\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-10-27T11:48:19Z","Content":"\n\u003Cp\u003EThis is looks great! What shall it become? Who knows! I\u0027m excited! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nassault630","CreatedById":20137,"CreatedDateTime":"2014-10-27T21:36:57Z","Content":"\n\u003Cp\u003EThis is really looking nice. Can\u0027t wait to see this evolve and what it will become.\u003C/p\u003E\n"},{"CreatedByName":"Gero","CreatedById":76730,"CreatedDateTime":"2014-10-27T21:46:11Z","Content":"\n\u003Cp\u003ELooks nice, looking forward to it!\u003C/p\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2014-11-09T16:17:26Z","Content":"\n\u003Cp\u003Eany news??\u003C/p\u003E\n"},{"CreatedByName":"imBobertRobert","CreatedById":73821,"CreatedDateTime":"2014-12-17T19:22:12Z","Content":"\n\u003Cp\u003ESo have you guys made any progress? I would hate to see you guys drop it, especially after how much work you\u0027ve put into it already!\u003C/p\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2014-12-17T19:45:49Z","Content":"\n\u003Cp\u003Editto!!!!!!!!!\u003C/p\u003E\n"}]}