{"TopicId":90684,"ForumId":39,"TopicTitle":"[Rough Copy] [Short Story] The Beginning Of It All","CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2014-11-19T02:26:57Z","PageNum":1,"Articles":[{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2014-11-19T02:26:57Z","Content":"\n\u003Cp\u003EFirst attempt at a (Fanfiction?) of KSP. Leave feedback, and this is just a rough-copy!\u003C/p\u003E\u003Cp\u003EChapter one.\u003C/p\u003E\u003Cp\u003E\u0022So what\u0027s on tonight, Bill?\u0022 Jebediah Kerman asked.\u003C/p\u003E\u003Cp\u003E\u0022Nothing good, really. Where\u0027s Bob?\u0022 Bill replied\u003C/p\u003E\u003Cp\u003E\u0022He\u0027s... working on something? Exactly what it is I\u0027m not sure.\u0022\u003C/p\u003E\u003Cp\u003EBob Kerman suddenly came running down the hallway and into the living room to join the two. He seemed to be more excited than usual. He was covered in ashes and was getting dirt all over the floor.\u003C/p\u003E\u003Cp\u003E\u0022You\u0027re cleaning that, Bob.\u0022 Jebediah said, slightly irritated.\u003C/p\u003E\u003Cp\u003E\u0022We\u0027ll deal with that later. I want you guys to see something!\u0022 Bob said excitedly.\u003C/p\u003E\u003Cp\u003EThe three walked outside and into the backyard. They lived in a small suburban neighborhood. The slight smell of a BBQ could be smelled, and an occasional dark barking.\u003C/p\u003E\u003Cp\u003E\u0022Look at this!\u0022 Bob ran into the toolshed and brought out a small model rocket. It was colored with red and black stripes, with a nose cone at the top. On the side it had written on it with a marker: \u0022Mun or Bust\u0022\u003C/p\u003E\u003Cp\u003E\u0022Watcha gonna do with that? Go to the Mun?\u0022 Jebediah joked.\u003C/p\u003E\u003Cp\u003E\u0022Real funny. Now watch this.\u0022 Bob said as he placed it carefully set it on the ground and brought out a box of matches. He lit one and lit a fuse. It traveled across the lawn and to the rocket.\u003C/p\u003E\u003Cp\u003E\u00225, 4, 3, 2...\u0022 the rocket had launched before Bob could count to 1. It soared into the sky, leaving behind a trail. The trio stared with amazement as it soared across the sky- wait, across? It was at this time that the rocket had fallen sideways and was headed strait for the forest.\u003C/p\u003E\u003Cp\u003EThey ran as fast as possible to the site of the crash. The rocket had landed in a tree, but thankfully it did not cause a forest fire.\u003C/p\u003E\u003Cp\u003E\u0022This gives me an idea...\u0022 Said Jeb.\u003C/p\u003E\u003Cp\u003EI know it\u0027s awful, but again. Rough copy. It\u0027s not done, and the next chapter should be posted later on. Tell me what you guys think so far!\u003C/p\u003E\n"},{"CreatedByName":"GamerMitch","CreatedById":83492,"CreatedDateTime":"2014-11-19T02:55:38Z","Content":"\n\u003Cp\u003EGreat Start! Just a couple suggestions:\u003C/p\u003E\u003Cp\u003E1.After every new person speaking, add a new space. Example:\u003C/p\u003E\u003Cp\u003E\u0022Hi\u0022 Bob said.\u003C/p\u003E\u003Cp\u003E\u0022What\u0027s up?\u0022 Jeb replied.\u003C/p\u003E\u003Cp\u003E2. Try looking up some synonyms for the words you used.Example:\u003C/p\u003E\u003Cp\u003EThe slight smell of a BBQ could be smelled\u003C/p\u003E\u003Cp\u003EFind a synonym for \u0022smelled\u0022\u003C/p\u003E\u003Cp\u003E3.Look at \u0022the revenge of genenand kerman\u0022,my own story, for any Ideas or help you might need.Link in my signature.\u003C/p\u003E\u003Cp\u003ELooking forward to chapter two!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-11-19T14:58:19Z","Content":"\n\u003Cp\u003ENice start! This is \u003Cem\u003Ereally\u003C/em\u003E going back to the very beginning.\u003C/p\u003E\u003Cp\u003EI agree with GamerMitch\u0027s comments. Spaces between lines of dialogue makes the story easier to read. Your punctuation is good though - it took me ages to start putting commas in the right place, i.e. \u0022What are we doing today, Bob?\u0022 and not \u0022What are we doing today Bob.\u0022\u003C/p\u003E\u003Cp\u003ESynonyms for \u0022smelled\u0022 would work, or alternatively, having one of the characters smelling the barbecue makes the sentence less passive: \u0022The three walked outside and into the backyard. They lived in a small suburban neighborhood. Jeb could smell barbecue smoke drifting over the fence.\u0022\u003C/p\u003E\u003Cp\u003EThese are minor points though - I\u0027m looking forward to chapter II as well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2014-11-19T17:03:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GamerMitch\u0022 data-cite=\u0022GamerMitch\u0022\u003E\u003Cdiv\u003EGreat Start! Just a couple suggestions:\u003Cp\u003E1.After every new person speaking, add a new space. Example:\u003C/p\u003E\u003Cp\u003E\u0022Hi\u0022 Bob said.\u003C/p\u003E\u003Cp\u003E\u0022What\u0027s up?\u0022 Jeb replied.\u003C/p\u003E\u003Cp\u003E2. Try looking up some synonyms for the words you used.Example:\u003C/p\u003E\u003Cp\u003EThe slight smell of a BBQ could be smelled\u003C/p\u003E\u003Cp\u003EFind a synonym for \u0022smelled\u0022\u003C/p\u003E\u003Cp\u003E3.Look at \u0022the revenge of genenand kerman\u0022,my own story, for any Ideas or help you might need.Link in my signature.\u003C/p\u003E\u003Cp\u003ELooking forward to chapter two!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EResponse to 1: Yeah, I normally do that when writing. This was made when I was a little bit tired. (Otherwise it would be longer and better)\u003C/p\u003E\u003Cp\u003EThanks for the support!\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2014-12-02T15:57:05Z","Content":"\n\u003Cp\u003ENew chapter time!\u003C/p\u003E\u003Cp\u003EChapter 2: Everybody Makes Mistakes\u003C/p\u003E\u003Cp\u003EJebediah set a blueprint paper for a new model rocket on their wobbly kitchen table.\u003C/p\u003E\u003Cp\u003E\u0022Okay,\u0022 Bob began, \u0022Here is what we\u0027re going to do. To avoid a near-disaster like last time, we are going to use a small parachute. But since this parachute is weak, we have to make it set off after we use a decoupler, (Or however you spell it:P) to separate the liquid fuel tank from the top.\u0022 Bob said this as he pointed to a small ring-shaped device between the top and the tanks.\u003C/p\u003E\u003Cp\u003E\u0022Afterwards, it should be able to slowly fall down to the ground, and we can see how it did! Any questions?\u0022\u003C/p\u003E\u003Cp\u003EBob looked to Jeb, who shook his head. He then looked over to Bill.\u003C/p\u003E\u003Cp\u003E\u0022What? Sorry I was too busy not paying attention to not pay attention.\u0022 Bill said innocently.\u003C/p\u003E\u003Cp\u003EBob gave Bill an angry glare, but looked back at the blueprint to explain it again anyways. Bill always seemed to act like this, but both Jebediah and Bob seemed to always forget about it.\u003C/p\u003E\u003Cp\u003E\u0022Well, how are we going to... program it or whatever to separate?\u0022 Jeb asked.\u003C/p\u003E\u003Cp\u003E\u0022It\u0027s too complicated to explain, and Bill\u0027s excuse this time not to pay attention would probably be going on vacation to the TV couch for 2 weeks. But you just leave it to me. I\u0027ll get you guys when it is ready.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003E2 Weeks Later...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u0022Kerbol seems to be extra bright today, at least compared to these past few days. Today\u0027s high will be 83. Thank you for watching KNN, and that\u0027s your weather for today!\u0022 The weather man said as the TV went to commercials.\u003C/p\u003E\u003Cp\u003E\u0022Hey, Bob! Today may be a good day to launch that rocket of yours!\u0022 Jeb yelled in the direction of the hallway, where their rooms are located.\u003C/p\u003E\u003Cp\u003EBob came rushing down the hallway like he did 2 weeks ago.\u003C/p\u003E\u003Cp\u003E\u0022It\u0027s done! Wait until you see- oh! Breaking news! I\u0027ll tell you after this.\u0022\u003C/p\u003E\u003Cp\u003EThey both turned their heads to look at the TV.\u003C/p\u003E\u003Cp\u003E\u0022This is KNN, Kerbal News Network, with breaking news! The Kerbal Space Program is being criticized heavily by the public after the recent discovery that all of the news from them about successfully launching an orbiting shuttle, was FAKE! The KSP seemed to have been doing this to get more funds to actually do anything. Reporters tell us that the reason they were discovered to have no knowledge about space or physics was when a little girl (let\u0027s assume Kerbals have genders) asked an \u0022astronomer\u0022 what was he looking at in a telescope. The astronomer replied, \u0022I\u0027m looking at Kerbin!\u0022 This was caught on the secruity camera, and how the footage was released to the public is unknown. The KSP has admitted to all these details as said that they don\u0027t even know how to make a model rocket. This is Gregson Kerman, KNN.\u0022\u003C/p\u003E\u003Cp\u003EThe TV then returned to it\u0027s show that was on before the Breaking News interrupted it.\u003C/p\u003E\u003Cp\u003EBob was shocked. The people who he had been following in their footsteps... frauds? He couldn\u0027t believe this. He dropped the model rocket, which Jeb caught before it hit the ground, and ran to his room, crying.\u003C/p\u003E\u003Cp\u003EJeb felt bad for Bob, but he had an idea.\u003C/p\u003E\u003Cp\u003EA few hours later, Jeb was driving to KSP headquarters, where a huge riot was at. People were throwing everything in sight, including each other. Jeb managed to get out of his car and squeeze through everybody and get through the doors.\u003C/p\u003E\u003Cp\u003E\u0022OH GOD! ONE OF THEM GOT IN!\u0022 A scientist cowering in the corner said.\u003C/p\u003E\u003Cp\u003E\u0022Relax, I\u0027m here to show you something that my friend made. He was, or maybe still is, a huge fan of space. He made this model rocket for the KSP to see. If you could please take it into consideration to let us launch it with everybody around, it would make him very happy.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Fine! Whatever gets these people away!\u0022 The scientist said, still unsure on the results.\u003C/p\u003E\u003Cp\u003EJeb placed the model rocket on the launch pad. It seemed so tiny, since the launch pad was built to support 5000 tons of rocket stuff. Soon, the riot shifted over to the launch pad, and many people were confused.\u003C/p\u003E\u003Cp\u003EJeb pulled out his cellphone and called Bob. When he answered with a \u0022what do you want?\u0022 Jeb could still tell he was upset.\u003C/p\u003E\u003Cp\u003E\u0022I got a surprise for you. Flick on the TV and go to channel 6.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Whatever.\u0022 Bob hung up and dragged himself out of the bed, and turned on the TV.\u003C/p\u003E\u003Cp\u003E\u0022As you can see here, the riot has moved to the launch pad, where a model rocket can be seen. A brave Kerbal walked to the headquarters and asked to launch a model rocket for his friend named Bob Kerman. It is said that Bob Kerman made this rocket from scratch without any help whatsoever, and this could be a big step forward in rocket science.\u003C/p\u003E\u003Cp\u003EBob was already on his way.\u003C/p\u003E\u003Cp\u003E\u0022And here he comes! Ladies and gentlemen, Bob Kerman!\u0022\u003C/p\u003E\u003Cp\u003EThere was a huge roar of applause, but a short one. Bob shed a tear of joy, and turned to Jeb to hug him. Jeb handed Bob the launcher.\u003C/p\u003E\u003Cp\u003EBob pressed it, and as if on cue, the crowd counted down. \u0022Five, Four, Three, Two, One, LIFTOFF!!!\u0022 The model rocket soared into the sky. Everybody on the ground began having trouble seeing it, but eventually it started to come back down. Bob saw this and pressed a second button the the remote, and it separated. He pressed a third button, and the parachute deployed. It took 15 seconds after this for it to touch the ground. The crowd roared with applause again, this time for a full minute.\u003C/p\u003E\u003Cp\u003EBob saw a familiar person come towards him... His hero... Werner Von Kerman...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ETo be Continued.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E(No, I did not intend KNN to be like CNN)\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-02T16:31:02Z\u0022 title=\u002212/02/2014 04:31  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 2, 2014\u003C/time\u003E by michaelsteele3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-12-02T22:16:48Z","Content":"\n\u003Cp\u003EGo, Bob!\u003C/p\u003E\u003Cp\u003EDecoupler was spelt correctly by the way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2014-12-03T13:17:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSK\u0022 data-cite=\u0022KSK\u0022\u003E\u003Cdiv\u003EGo, Bob!\u003Cp\u003EDecoupler was spelt correctly by the way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGoogle chrome had it underlined in red. There was no suggestions, so I thought I was way off. :/\u003C/p\u003E\n"}]}