{"TopicId":92519,"ForumId":39,"TopicTitle":"Imperius Kerbalius","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-12-11T02:21:24Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-12-11T02:21:24Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EREVIVAL OF AN RHOMAION: PART ONE\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yQ3Rmu8.png\u0022 alt=\u0022yQ3Rmu8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EmPf9co.png\u0022 alt=\u0022EmPf9co.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cem\u003E\u0022\u003C/em\u003E\u003C/span\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:\u0027Book Antiqua\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cem\u003EEmpires don\u0027t die. They are merely go into hibernation\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003Cem\u003E\u0022\u003C/em\u003E - Anonymous\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EPROLOGUE: THE DEFEAT AT JULITOLIA\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:left;\u0022\u003E\u003Cp\u003EStrategos Carian Kamninos of Konstantineyye was horrendously lost. The local guides hadn\u0027t been as much of a help as he expected, and the vast expanse of desert and sandstone cliffs in the Julitolian proviences of the Rhomaion Empire didn\u0027t really help with navigation at all. Behind him marched 10,000 soldiers of the finest Kerbal infantry that could be mustered from the massive Rhomaion military. It was magic; with a flick of the wrist, he could seperate them at will, send them scurrying for cover, or assemble them into formations. But that wasn\u0027t going to help him get out of the desert. He motioned toward a guide.\u003C/p\u003E\u003Cp\u003E\u0022Haven\u0027t we passed that cactus already for the third time in a row?\u0022, he asked.\u003C/p\u003E\u003Cp\u003EA squinty Kerbal with a long grey beard and a hungry glint in his eyes, Sjuai Tianj simply shook his head. The desert was barren, true, but as a native, he knew the difference between one cacti and the other while a newcomer such as Carian obivously hadn\u0027t the slightest clue about these things. \u003Cem\u003EDetails, details, details\u003C/em\u003E, he thought. Vultures circled overhead. They already knew what massive armies of gleaming steel and horses meant. Dinner.\u003C/p\u003E\u003Cp\u003E\u0022Soon.\u0022\u003C/p\u003E\u003Cp\u003EAn officer rode up, quickly catching up with Carian and saluted. The scouts were back from their long journey, and had rejoined up with the main force moving westward. Sent by the Carian only a day ago, they had ridden fifty kilometers ahead to check on enemy activity and returned back. \u003C/p\u003E\u003Cp\u003E\u0022Strategos! The enemy warlord is ahead, we estimate to be about twelve to fifteen thousand soldiers from the lights of their campfires. \u0022\u003C/p\u003E\u003Cp\u003ECarian nodded, and turned to his aide. He glanced upwards at the sky; the sun glared back, unhindered by the clouds, but the purple streaks of the sunset had already begun to show in the horizon. He checked on his map for the last time; he was about three kilometers east of the nearest city - that is, if he\u0027d brought the correct map. He stopped his horse and dismounted. The campfires of the enemy army glimmered in the distance. \u003C/p\u003E\u003Cp\u003E\u0022Give the order to halt and set up camp. Order the third Tagma to set up the nighttime perimeter. I want double the amount of guards.\u0022\u003C/p\u003E\u003Cp\u003EAnd with that, he had done the stuff of magic. The sun was setting, and the vultures, sensing that no dinner would be at hand, returned to their nests. The army scattered, setting up their camp and preparing to settle down for the night. \u003C/p\u003E\u003Cp\u003E*************************\u003C/p\u003E\u003Cp\u003EHe glanced to his left. Ten thousand Rhomaion soldiers from five Tagmas stood in full battle array, the sunlight glinting off their weapons and shields. Behind the lines of heavy infantry were the calvary using their lighter shields to shade themselves from the full heat of noon, and behind them were the reserve troops; mostly composed of calvary units and light infantry that would back up the assault on the enemy lines. He couldn\u0027t see the Imperial eagle, but he knew it was directly behind the center of the line and that most of the bureaucrats and Senators who tagged along would be there too. Any of the warlord\u0027s men attempting to kill them would have to fight through a thick formation of hsotile troops.\u003C/p\u003E\u003Cp\u003EThe Rhomaion army had formed up in a North-South line, with most of the heavy calvary units being placed on the left flank. To hopefully delay any outflanking manuveurs, two tagmas were positioned on both flanks to at a thirty degree angle, forming a trapezoid army formation.\u003C/p\u003E\u003Cp\u003ECarians main concern was the loyalty of his native mercenaries, most of which were on the right flank. Many of them resented the indefinite Rhomaion occupation of their land, and he knew it. Equipment had gone missing, plans were leaked and sabatoged; each time, they were the main suspects. On the horizon, the enemy troops spread out amongst the desert in a slow advance like a black cloud slowly engulfing the ground as it moved.\u003C/p\u003E\u003Cp\u003EA horse snorted as two of his aides rode up. \u003C/p\u003E\u003Cp\u003E\u0022Are the Tagmas in place?\u0022, Carian asked.\u003C/p\u003E\u003Cp\u003E\u0022Yes, Strategos\u0022, replied the officer.\u003C/p\u003E\u003Cp\u003E\u0022Are they clear on their orders?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Noone gets through at all costs.\u0022, mumbled the aide. \u0022Not a horse, not a single kerbal. We understand.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Good. And the scouts?\u0022\u003C/p\u003E\u003Cp\u003E\u0022The enemy is moving up their whole force. They can\u0027t let us just walk up to their main camp without losing face in front of their allies.\u0022\u003C/p\u003E\u003Cp\u003E\u0022And that means he wants victory as desperately as we do.\u0022, Carian flicked the reins and the three kerbals galloped towards the main line of heavy infantry. Thick clouds of dust were forming on the horizon, and crossbow bolts were starting to pelt the desert in front of them. \u003C/p\u003E\u003Cp\u003E\u0022Gentlemen, return to your Tagmas. Order the soldiers to stay restrained and not charge the skirmishers; they are merely taunting us with this light rain. Order the kerbals equipped with crossbows to hold fire.\u0022\u003C/p\u003E\u003Cp\u003EThey both saluted and rode off. Carian galloped to the center of the line and observed the situation playing out in front of him. The heavy infantry had begun to advance towards the enemy, and the crossbow barrage had given way to the thundering of the enemy calvary as they charged the soldiers. The infantry, expecting this, raised their shields into a turtle formation; the enemy horsekerbals crashed against the wall and floundered helplessly against the Rhomaionian swords.\u003C/p\u003E\u003Cp\u003ERiders who dismounted didn\u0027t outlive their horses by much. With a great cry, the soldiers slaugthered them, and the rest of the skirmishers withdrew to a safer distance, only returning on occasion to fire a quick volley of bolts before quickyl scampering away. One thing bothered his mind; why hadn\u0027t the right flank reported any action? \u003C/p\u003E\u003Cp\u003EA courier rode up, his mouth foaming.\u003C/p\u003E\u003Cp\u003E\u0022Strategos! Five thousand enemy troops, moving towards the right! They\u0027re using the dust clouds to shield their movement!\u0022 If the Rhomaion army had been in a straight line, the enemy contigent would\u0027ve already been at the rear of the army. Luckily for Carian, the enemy warlord hadn\u0027t taken into account the angle of the flanking units.\u003C/p\u003E\u003Cp\u003E\u0022I want the reserve troops to reinforce the right flank immediately!\u0022 Screams of pain could be heard from the front ranks of the Rhomaionian soldiers. The enemy had restarted their barrage, but this time twice as ferocious as before. \u003C/p\u003E\u003Cp\u003E\u0022Yes, Strategos!\u0022, and with that, the courier rode off. The battle had just begun.\u003C/p\u003E\u003Cp\u003E*************************\u003C/p\u003E\u003Cp\u003EKaram murmured to himself as he trudged forward, shield raised against the cloud of dust forming in front of him. Here he was, thousands of miles away from his home in Konstantineyye, fighting a distant enemy that not a single member of his family knew about, marching into a dust cloud that clogged the air between the two armies, as well as his nostrils and armor. In the distance, he could hear the screaming of his brethen as the enemy arrows swept across their lines like a scythe.\u003C/p\u003E\u003Cp\u003ESwearing under his breath and wishing he was at home with his wife and son, he marched onward with a determination shared only by his fellow soldiers. He looked around; he was on the right flank. Most of the enemy was hitting the center and taking moderate losses, although rumor was afoot that they would be attacked soon. \u003Cem\u003EFive thousand soldiers\u003C/em\u003E, he remembered. \u003C/p\u003E\u003Cp\u003EHe could hear the clanging of the enemy shields somewhat in front of him. There was a yell, and he raised his sword. Arrows began to strike his formation; the screams of his comrades showed that many had struck their mark. A light breeze swpt the dust away, revealing the outline of thousands upon thousands of soldiers in front of his line. \u003Cem\u003EWhat?! The enemy army was supposed to be concentrated on hitting our center; but they\u0027re somehow here!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EA kerbal in front of him collapsed as a arrow skewered his head, ripping right through the helmet. The dust cloud then vomited out a thousand more, smashing into their formation. Kerbals panicked as arrows struck their shields, and the line wavered before finally collapsing. Sensing the weakness, a thousand calvary burst out of the shadows, bearing down upon the hapless infantrykerbals. The line shattered, and he began to run to the rear despite the yells of his officers to halt - not that they mattered, since the whole unit was fleeing now.\u003C/p\u003E\u003Cp\u003E*************************\u003C/p\u003E\u003Cp\u003ECarian sat with the Senators from Konstantineyye, and looked up as one of his officers approached. Behind him was the nobility of the Empire; officials and superwealthy merchants who apparently couldn\u0027t find anything better to do with their time than to watch armies of kerbals slaughter each other. \u003C/p\u003E\u003Cp\u003EThe attacks on the center were light now; despite heavy losses, the soldiers had been able to beat back the enemy calvary, running down and killing around two thousand enemy soldiers and scattered the remainder. Since then, there had been no attacks on the center - well, atleast that Carian knew of. \u003C/p\u003E\u003Cp\u003E\u0022The men are holding up well; they\u0027re tired and have taken some losses but I doubt the enemy will attack the center again.\u0022\u003C/p\u003E\u003Cp\u003E\u0022What about the fourth Tagma? I\u0027ve heard they\u0027ve lost half of their soldiers and are still under assault.\u0022\u003C/p\u003E\u003Cp\u003E\u0022They are, but they\u0027re holding...however, we haven\u0027t gotten a report from Husilleno..\u0022 Who commanded the units in the right flank \u0022..and we\u0027ve heard rumors that they\u0027ve...they\u0027ve collapsed.\u0022\u003C/p\u003E\u003Cp\u003ECarian bolted up. \u0022What?!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe flank isn\u0027t holding; they\u0027ve broken through\u003C/em\u003E, he thought. \u003Cem\u003EIf the flank doesn\u0027t hold, the enemy can just roll along our entire line and wreak havoc amongst our army...\u003C/em\u003E \u0022Listen! I want a report immediately on the right flank! And bring Husilleno to me!\u0022. The courier galloped off into the distance toward a rising pillar of dust. He didn\u0027t return for two hours, by which time the sun had already begun to set. Dust clouds had reduced visibility to a half a kilometer. There was the steady sound of fighting in front of him, but he didn\u0027t hear any news from the flanks.\u003C/p\u003E\u003Cp\u003E\u0022Strategos! Strategos!\u0022, the kerbal cried. He was panting, and had abandoned most of his armor.\u003C/p\u003E\u003Cp\u003E\u0022What happened?\u0022\u003C/p\u003E\u003Cp\u003E\u0022They\u0027ve completely collapsed. Second and Sixth Tagmas got completely annhilated; they just don\u0027t exist anymore. The enemy is rolling itself up along the rear, and we\u0027ve got barely enough soldiers to keep them in.\u0022\u003C/p\u003E\u003Cp\u003E\u0022What about the reserves I sent?\u0022\u003C/p\u003E\u003Cp\u003E\u0022They\u0027ve punched through them too. Husilleno is totally surronded, but he\u0027s still trying to fight his way out. Most of the soldiers are just running, Strategos! They\u0027re just running!\u0022\u003C/p\u003E\u003Cp\u003ECarian turned to his aide.\u003C/p\u003E\u003Cp\u003E\u0022I want all the center forces to be sent to relieve the left flank. Order them to abandon positions.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Strategos, I must recommend \u003Cem\u003Eagainst\u003C/em\u003E this action.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I\u0027m not going to argue. Do as I say.\u0022\u003C/p\u003E\u003Cp\u003E\u0022No!\u0022 His aide grabbed the courier. \u0022Listen here. If we send the center forces against the enemy, we\u0027re running of risk of losing our entire army, not just half of it.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Returning to Konstantineyye with just four of the ten Tagmas I set out with isn\u0027t an appealing option. It\u0027s going to destroy my families political career.\u0022\u003C/p\u003E\u003Cp\u003E\u0022What is more important to you, your family or your country - wait, don\u0027t answer that. I\u0027m going to \u003Cem\u003Estrongly\u003C/em\u003E advise retreat. We can regroup the army at the coast and attack them again some other time.\u0022\u003C/p\u003E\u003Cp\u003E\u0022And what will I tell the Senate? And the Emperor?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Your duty is to the Empire. Do you want to save three thousand of your soldiers or save zero? Atleast with three thousand, we can hold our desert territories against local revolts. Do you want to be known as the kerbal who lost all of them?\u0022\u003C/p\u003E\u003Cp\u003EOne second. \u0022Damn you.\u0022, Carian snarled. \u0022It will be night soon, fall back; it\u0027ll be hard on the soldiers, but it\u0027s the only chance we have to preserve ourselves and get out of here with a scrap of dignity.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes, Strategos\u0022, and both the aide and courier galloped off.\u003C/p\u003E\u003Cp\u003ECarian was alone now, looking off into the distance. Uncovering his own sword, he took it out and fell on it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-11T03:34:17Z\u0022 title=\u002212/11/2014 03:34  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 11, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"}]}