{"TopicId":95858,"ForumId":39,"TopicTitle":"Looking for Scientific Advisers/Editors for crossover","CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2015-01-06T19:35:38Z","PageNum":1,"Articles":[{"CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2015-01-06T19:35:38Z","Content":"\n\u003Cp\u003ENot sure if this goes in this part of the forum, but I am currently writing a MLP: FiM/KSP crossover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img2.wikia.nocookie.net/__cb20130703151216/whatever-you-want/images/7/79/Le_Gasp_O.O.jpg\u0022 alt=\u0022Le_Gasp_O.O.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, yes, I know, writing an MLP fanfic and asking for help on this website? Thing is, I\u0027m not asking for help with the MLP parts, I\u0027m more asking for help writing the Kerbal sections, the flight and spaceflight bits in particular. Because while I may play KSP a lot, I don\u0027t know the math behind it all that well, which means I run the risk of major errors that would be a big turn-off to any spaceflight enthusiast. That, and it would be nice to have someone to bounce spacecraft designs off of so I don\u0027t have to create a hodgepodge of parts that seems to change as the story goes on.\u003C/p\u003E\u003Cp\u003ETo summarize, I am requesting assistance in this endeavour. Feel free to reply here if you are interested in joining this project, participants should ideally be able to use Google Drive\u0027s GDocs function, to facilitate collaboration on the story itself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-08T02:27:51Z\u0022 title=\u002201/08/2015 02:27  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 8, 2015\u003C/time\u003E by Fox62\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LePadeaux","CreatedById":61990,"CreatedDateTime":"2015-01-06T20:03:19Z","Content":"\n\u003Cp\u003EI\u0027d certainly be willing to help! You can see my crafts and what I\u0027ve done in my signature, though I\u0027ve done plenty of other things that I simply haven\u0027t posted. I also very much enjoy writing, though I haven\u0027t had the time due to work (every time I try to write a short story it turns into a short novel \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2015-01-07T03:22:55Z","Content":"\n\u003Cp\u003EI will note that the crossover involves Kerbals with FTL capability (20\u003Cem\u003Ec\u003C/em\u003E Alcubierre Dirves), meaning you should have a reasonable grasp of dealing with very large crafts. That\u0027s not to say your contributions would not be useful, it is merely that the Lotus Corporation has created no civilian spacecraft equivalent in size to what is envisioned for the main Kerbal spacecraft in the story, and your military craft are not suited for the exploration work that would be done by this vessel. That, and the ship uses various bits of tech from mods such as Karbonite, Karbonite\u002B, ExtraPlanetary Launchpads, TAC Life Support, and Deadly Re-entry, amongst some others, to reduce the needed carry weight for the trip, increase realism somewhat, and to make the ship a bit more interesting (and open up more possibilities for plot points!) So, your help would mostly be with the lighter exploration satellites and landers.\u003C/p\u003E\n"},{"CreatedByName":"LePadeaux","CreatedById":61990,"CreatedDateTime":"2015-01-07T06:59:37Z","Content":"\n\u003Cp\u003EI wasn\u0027t suggesting to use any of my craft, just examples of things I\u0027ve done and that I\u0027m capable of building decent crafts. I\u0027ve had experience with larger ships but I mostly stick to smaller ones for simplicity and efficiency. But I can certainly help with anything you need.\u003C/p\u003E\n"},{"CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2015-01-08T02:27:17Z","Content":"\n\u003Cp\u003EOk then. I should mention that Gmail and GDocs capability are required, so if you don\u0027t have a gmail, you might have a problem. Otherwise, shoot me a PM with your gmail address, and I\u0027ll share chapter 1 with you.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-01-08T14:46:36Z","Content":"\n\u003Cp\u003EAt the risk of threadjacking, you might be interested in JakeGrey\u0027s \u003Cem\u003EThe Next Frontier\u003C/em\u003E, as posted on these forums. It\u0027s also a crossover story and the level of kerbal technology involved seems to be about what you\u0027re looking at here. It\u0027s an excellent read in its own right, and might provide a bit of inspiration on the kind of spaceflight parts to include in your own story.\u003C/p\u003E\n"},{"CreatedByName":"JakeGrey","CreatedById":61242,"CreatedDateTime":"2015-01-08T15:09:00Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESpeaking of which, you might also try the SpaceBattles forums; those guys are thorough to the point of slightly obsessive when it comes to technical details.\u003C/p\u003E\n"},{"CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2015-01-08T16:21:07Z","Content":"\n\u003Cp\u003ESo you\u0027re looking for a technical adviser? I would like to help with that, but I\u0027m not sure how much help I would be. If you need normal editing help, I\u0027m happy to be of assistance.\u003C/p\u003E\n"}]}