{"TopicId":102249,"ForumId":44,"TopicTitle":"Europa and Earth water comparison","CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-03-19T08:39:05Z","PageNum":1,"Articles":[{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-03-19T08:39:05Z","Content":"How did they calculated this?\n\n[http://imgur.com/OnPVJ8A](http://imgur.com/OnPVJ8A)"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-03-19T08:53:31Z","Content":"How did they calculate how much water the Earth and Europa have? With Earth, you mostly have to add up the volume of the oceans and other surface water (and smaller contributions from ice caps and underground water and water vapor in the air). With Europa you can tell from its size and density how much of its interior must be rock and how much is water.\n\n**Edited \u003Ctime datetime=\u00222015-03-19T08:55:33Z\u0022 title=\u002203/19/2015 08:55  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 19, 2015\u003C/time\u003E by Brotoro**"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-03-19T09:21:24Z","Content":"\u003E \n\u003E How did they calculate how much water the Earth and Europa have? With Earth, you mostly have to add up the volume of the oceans and other surface water (and smaller contributions from ice caps and underground water and water vapor in the air). With Europa you can tell from its size and density how much of its interior must be rock and how much is water.\n\nOk, so how do you calculate density of planet covered by ice from such huge distance?"},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2015-03-19T09:55:02Z","Content":"Just look at how much Europa affects Jupiter. We can estimate the mass of Jupiter from how quickly its moons orbit it, and we can look at how much Jupiter \u0022orbits\u0022 Europa to estimate Europa\u0027s mass. Plus, if you have a probe, you can measure Europa\u0027s gravitational pull directly.\n\n**Edited \u003Ctime datetime=\u00222015-03-19T14:52:27Z\u0022 title=\u002203/19/2015 02:52  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 19, 2015\u003C/time\u003E by Vaporo**"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-19T14:49:22Z","Content":"Iapetus is the natural satellite which it seems has the most % of water according to its volume.\n\nThey think measuring its density that it may be 80% water."},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-03-19T15:36:50Z","Content":"\u003E \n\u003E Ok, so how do you calculate density of planet covered by ice from such huge distance?\n\nThe last thing Vaporo said. (We can look at the way Jupiter\u0027s moons orbit it to find the mass of *Jupiter*, but because the masses of the moons are much smaller, they don\u0027t have a big effect on Jupiter\u0027s motion...so we don\u0027t get the moons\u0027 masses that way.) You can look at the way the Jovian moons tug at each other, and the way they pull at our spacecraft during flybys of the moons, to get good measurements of the masses of the moons. We also get very accurate measures of the moons\u0027 diameters from the space probes, so we can get accurate volumes for them. And from mass and volume, you can get the average density.\n\n**Edited \u003Ctime datetime=\u00222015-03-19T15:38:56Z\u0022 title=\u002203/19/2015 03:38  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 19, 2015\u003C/time\u003E by Brotoro**"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-19T15:55:34Z","Content":"Problem with this animation is that it accounts for free water on Earth\u0027s surface and total water in Europa, so it is essentially highly misleading.\n\nEarth contains a lot more water than Europa, but most of it is trapped inside of it, highpressure-stuffed in magma and crystal lattices of lithosphere\u0027s minerals. Hydrosphere and atmosphere account for only one part of the total water content."},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-03-19T16:06:57Z","Content":"\u003E \n\u003E Ok, so how do you calculate density of planet covered by ice from such huge distance?\n\nMass in known from orbit around Jupiter and knowledge of Jupiter\u0027s mass, volume is known from apparent diameter. Density is easily calculated given those."},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-03-20T20:25:41Z","Content":"Density, which radius comes from direct observation via angular diameter and radar ranging, mass from indirect observation of the change of spacecraft\u0027s orbit.\n\nOther things could come from orbital parameters of Europa itself and it\u0027s observable error. If Europa does actually have liquid water below the thick ice, the solid core could be not at the center, and it\u0027d give a slightly different orbir that otherwise expected."}]}