{"TopicId":102324,"ForumId":44,"TopicTitle":"Electric or hydrogen cars?","CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-20T15:46:07Z","PageNum":7,"Articles":[{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-04-12T01:08:00Z","Content":"\u003E \n\u003E Electric cars are heavy which makes them inefficient. They are also bad for the environment because their batteries use hazardous materials and the walls they plug into are supplied by coal power plants mostly. Electric cars also take a long time to charge up, meaning you can\u0027t go on long drives. The batteries in electric cars also deteriorate quickly.\n\nYou\u0027re generalizing too much about batteries. Not all batteries deteriorate quickly (NiCds can last through thousands of cycles for instance -- unless you\u0027re talking about self-discharge, but the low-self-discharge NiMH batteries can actually outlast as *gasoline tank*), and not all batteries contain hazardous materials (in fact, modern rechargeables generally don\u0027t contain anything particularly toxic), and not all batteries charge slowly (NiCds can fully charge in as little as 15 minutes, NiMH in about an hour). Having long charge time doesn\u0027t preclude long range either.\n\nFuel cells also deteriorate, and with some designs, even faster than batteries. Also, I doubt they\u0027re all that light either.\n\nAnyhow, if standardized battery formats could be produced (like AAA/AA/C/D cells and such), you might not have to charge a battery at all, but could instead swap it out really quickly.. Y\u0027know, assuming the average IQ of the planet wasn\u0027t 40.\n\nAlso a bit pedantic but \u0022electric car\u0022 is a very general term, and the fuel-cell based hydrogen cars you\u0027re talking about are ALSO \u0022electric cars\u0022. The correct term for a battery electric car is \u0022battery electric car\u0022. Possibly with a hyphen in there somewhere.\n\n\u003E \n\u003E Hydrogen is abundent on Earth thanks to our large supply of water. Hydrogen goes into the car just like petrol and can run the car for a similar distance. If it runs out you can just refuel. Hydrogen cars don\u0027t need lots of batteries like electric cars so they can last longer without servicing. Finally Hydrogen is completely clean energy that doesn\u0027t require sourcing the power grid which currently runs off of coal and other fossil fuels.\n\nHydrogen requires heavy tanks pressurized to massive pressures (700 bar) - extremely dangerous, very inefficient. Hydrogen is a massively diffuse gas at any sort of normal temperature or pressure. Most mass-produced hydrogen is extracted from \u0022natural\u0022 gas (fossil fuel methane).\n\nWhat sort of nasty place do you live in? Less than 33% of my power is fossil fuels, and that\u0027s being downsized aggressively.\n\n\u003E \n\u003E I think in the future our power plants will use hydrogen fuel cells (If we don\u0027t work out fusion) and our cars will also run on the stuff. The apparent dangers of hydrogen are exactly the same as those with gasoline, so theres nothing new to combat. And best of all, we already have fuel stations set up all over the world. We can just slowly convert them to hydrogen pumps as more and more people use it over the ever rising price of gasoline.\n\nGasoline isn\u0027t pressurized to 700 bar. You could handle gasoline like as if it was poisonous, flammable water. Gasoline has a distinctive smell, and is very hard to explode, contrary to what you see in the movies. Hydrogen is violently explosive, has no smell (you can die from asphyxiation from hydrogen build-up in an enclosed space like oh, a car, without realizing that you\u0027re dying. The only clue you\u0027d have is that your voice would become squeaky, much like with helium..so, better talk to yourself constantly!), burns almost invisibly, is pressurized to extreme levels.\n\nGood luck pumping 700 bar gas using a gasoline station\u0027s storage and pumping gear. A gasoline station is actually better equipped to handle electric-battery refuel than electric-hydrogen refuel. They usually have mains power available. They don\u0027t have tanks and hoses rated for 700 bar. Hmm, I wonder what happens if a 700-bar pressurized transfer system fails to make a complete seal?\n\n\u003E \n\u003E and our trains that can\u0027t stop to recharge.\n\nEver heard of electrified rail? Don\u0027t need to recharge at all. (Also a lot of \u0027diesel\u0027 locomotives are actually \u0022diesel-electric\u0022, wherein the diesel motor drives a generator, which in turn drives the wheels via electric traction motors. Similar to the old turbo-electric warships. Not entirely relevant but it\u0027s something I\u0027ve always found interesting..)"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-12T04:03:42Z","Content":"\u003E \n\u003E Your going to need to cite this for me to even come close to believe it.\n\nLate rubisco.. is already post it in the page 14 and everybody saw it.\n\n\u003E \n\u003E Several problems here\n\u003E 1. Your citing Wikipedia, it is a tertiary source at best, please cite what it cites, a secondary or primary research article. \n\u003E \n\u003E 2. I can\u0027t find anywhere on the wiki page where it claims a PEM reaches 95% energy conversion efficiency .\n\n1-wikipedia is a very trust source in popular science topics. Is not the only source that I post over the whole discussion.\n\n2-Is there.. you can find it in many pages.. Just use google.\n\n\u003E \n\u003E This study specifically claims even best case energy conversion efficiencies below 80%\n\nSo? this include compression and short distribution. You have extra loses with renewable energy using diferent ways of distribution or storage.\n\n\u003E \n\u003E Question: how do you get to 20 bars to begin with?\n\nBecause there is many process which generate hydrogen with that initial pressure without reduce the general efficiency of the conversion.\n\nAlso if your initial water or oil source is at 300 bar, your hydrogen outcome will be in 300 bar.\n\n\u003E \n\u003E Now you need to add in the energy lose of producing ammonia from nitrogen and hydrogen, cracking it is going to be a loss, ammonia is highly toxic and the ammonia transport infrastructure would need to be greatly enlarged to handle supplying energy to the transportation sector.\n\nagain, that process is very efficient, you will lost only a 10% converting and then cracking the amonia.\nIs not highly toxic.. Almost everybody in the world use that product to remove fat from dishes. Breathe ammonia gasses is not worst than breathe gasoline. Remember Interstellar in dr.manÃ‚Â´s planet?\n\n\u003E \n\u003E Yeah sure, decades down the line, **meanwhile batteries are here and now.**\n\n**Only 5 or 7 years. And batteries right now are not the solution either..**\n\n**They are very expensive, the amount of litio in the world is far to be enoght to change all cars to electric, in fact only trying will rise the cost by a lot. They pollute too and the energy waste in find the raw materials plus battery efficiency put in equally with fuel cells efficiencies.**\n\n\u003E \n\u003E **It can\u0027t fly on hydrogen, not without adding huge fuel tanks! Have it fly on bio-petroleum made from algae, such a product can already be made into a mix-in or drop-in replacement for JP-4 and JP-8.**\n\n**Bio fuels are not the solution, we need to reduce the current amount of co2, biofuels do nothing in that aspect.**\n\n\u003E \n\u003E **You can\u0027t make a single fuel for everything, least of all hydrogen would not be that universal fuel. Batteries can take up much of the light vehicle market, which is 50-60% of oil usage. For trucks, trains, planes, etc, there are other, better, alternatives.**\n\n**Is the thing that I said from the begining of the topic and I reapeat this in each page of this topic.**\n\n**Hydrogen or ammonia can deal with all heavy vehicles or long range vehicles and batteries with all city cars in the world.**\n\n**And there is not better (free co2) alternatives for trucks, ship or planes than hydrogen or ammonia.**\n\n\u003E \n\u003E **You don\u0027t want me pulling out the spread sheets do you, remember what happened last time I pulled the spread sheets on you?**\n\n**What are you talking about? XD I dont remember, please make me remind it.**\n**If you post info where you are right.. and I am wrong, I dont have any problem with that. In fact I will thank you.**\n\n\u003E \n\u003E **The volume of liquid hydrogen and the tanks required for it would simply not fit in a passenger plane without radical re-design, right now fuel can be pumped into the wings and neutral pressure areas, it reduces weight and volume taken up, because more volume equals more aerodynamic resistance.**\n\n**Without re-design not.. But today all airline companies are re-designing their planes to be more fuel efficient.**\n\n**Liquid hydrogen provides 3 times the heat value of jet fuel per weight, but increases fuel volume by a factor of four.**\n\n**This volume factor increase energy consumption in a 10%, but it can be countered with new designs which include higher wing area to increase lift, then your altitude is higher so less drag.** \n\n**Also hydrogen jetengines can be more efficient than normal engines due you can increase the thermal difference (the first jet engine made was using hydrogen).** \n\n**At lower speeds hydrogen planes can be more efficient if their use fuel cells with electric engines. The hydrogen can be used also to cool a superconductor engine (way more efficient than any other engine in weight energy) before enter in the fuel cell something you can not do with batteries.** \n\n**Some pictures of what it will be good for a hydrogen plane:**\n\n[**http://techzwn.com/wp-content/uploads/2011/09/lockheed-stratoliner-by-william-brown3.jpg**](http://techzwn.com/wp-content/uploads/2011/09/lockheed-stratoliner-by-william-brown3.jpg)\n\n[**http://ichef.bbci.co.uk/wwfeatures/624\\_351/images/live/p0/10/qv/p010qv4l.jpg**](http://ichef.bbci.co.uk/wwfeatures/624_351/images/live/p0/10/qv/p010qv4l.jpg)\n\n[**http://i.dailymail.co.uk/i/pix/2014/11/07/1415356620393\\_wps\\_14\\_image005\\_png.jpg**](http://i.dailymail.co.uk/i/pix/2014/11/07/1415356620393_wps_14_image005_png.jpg)\n\n[**http://i.dailymail.co.uk/i/pix/2014/11/07/1415356611267\\_wps\\_11\\_image002\\_png.jpg**](http://i.dailymail.co.uk/i/pix/2014/11/07/1415356611267_wps_11_image002_png.jpg)\n\n[**http://ichef.bbci.co.uk/wwfeatures/624\\_351/images/live/p0/10/qw/p010qw64.jpg**](http://ichef.bbci.co.uk/wwfeatures/624_351/images/live/p0/10/qw/p010qw64.jpg)\n\n**For airplanes ammonia is discarded for the added weight of nitrogen and many other hydrogen virtues to be used in the design.**\n\n\u003E \n\u003E **Lithium Ion batteries regularly have charge-discharge efficiency above 90%. Tesla has claimed plug-to-wheel efficiencies of up to 86%.** \n\u003E **web.archive.org/web/20071011010258/http://www.teslamotors.com/efficiency/well\\_to\\_wheel.php**\n\n**Because battery to whell does not count the charge efficiency loss.**\n\n**Ion litio batteries has a charge / discharge efficiency of 80% / 90%, this means that from your original imput energy (your house) a 25% is lose due battery, then enters mechanical x% loses and electric motor loses (5%).**\n\n\u003E \n\u003E **To get the hydrogen out you need energy, lots of energy. Where does that energy come from? Currently that would be electricity from coal and oil.**\n\u003E **Hydrogen is not a miracle source of energy. It\u0027s just an energy storage medium just like a battery. Only when the energy source is clean the end use is too.**\n\n**Here is where everybody mistakes.**\nIs explained many times in the discussion but I guess I found a better way to clarify this:\n\nWhat are our energy sources? Sun (wind, solar, hydro, etc), Nuclear (fission, decay), fossil (gas, oil, carbon), etc.\n\nRenewable energy like wind and solar gets a huge improvements if they convert all its energy directly into hydrogen (electrolysis 95%) \u002Bcompression and distribution (10%), this way they achieve 85%. If they wanna storage using different ways and then obtain electrical energy again (with any storage system) its efficiency is 80% but **with a huge extra capital cost**\n\nNuclear not always is working as base load, in those cases usually they generate hydrogen using the electricity and the waste heat to increase the electrolysis efficiency (lower capital cost with equal efficiency than pem electrolysis)\n\nAll fossil fuels contain higher amounts of hydrogen. Right now we spent capital cost to convert oil into gasoline, kerosene, alcohol, etc with some lost in efficiency even if the remaning is used in other products.\n\nBut instead use that capital cost to purify oil in the fuels that we know, why not convert all the oil to hydrogen instead?\n\nIt has a 80% efficiency and the \u002B90% of the hydrogen produced is with this method.\n\nRight now liquid hydrogen is expensive (not for much) than other fuels just because there is not infrastructure. But ammonia which is produced from the 80% of hydrogen with a 5% of loses cost less than hydrogen it self because there is already an infrastructure which deals with ammonia.\n\nIf we change to a full hydrogen-ammonia economy (instead oil economy as we are now), the cost of hydrogen/ammonia will be equal to the gasoline, kerosene or gasoil, etc.\n\nBut with the big difference that fuel cells or thermal hydrogen combustion are way more efficient than fossil fuels, so you recover the 20% lose in the conversion.\n\n**Edited \u003Ctime datetime=\u00222015-04-12T04:35:00Z\u0022 title=\u002204/12/2015 04:35  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 12, 2015\u003C/time\u003E by AngelLestat**"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2015-04-12T04:17:43Z","Content":"Electric and hydrogen powered cars both are far less energy efficient than are petrol powered cars.\n\nThe generation, transport, and storage of electricity and hydrogen are extremely energy inefficient, an order of magnitude worse than petrol.\n\nThat said, there is a place for them, and that is in reducing localised pollution in inner cities, where traffic is extremely dense and there is no rapid way to disperse the exhaust gasses. But you won\u0027t reduce worldwide emissions that way, only replace emissions in one place with more emissions somewhere else.\n\nFor long distance travel (trucking, commuting) they\u0027re hopeless because the bulk and weight of both hydrogen fuel cells and batteries are such that it is impossible to create a decent sized vehicle that has a range large enough and a weight low enough to be in any way practical (you\u0027d need something the size of a campervan to replace a sub compact size car to get a range of a few hundred kilometers at highway speeds, if not larger)."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-12T04:22:31Z","Content":"\u003E Hydrogen requires heavy tanks pressurized to massive pressures (700 bar) - extremely dangerous, very inefficient. Hydrogen is a massively diffuse gas at any sort of normal temperature or pressure.\n\nThat is why ammonia has potential.\n\n\u003E \n\u003E Gasoline isn\u0027t pressurized to 700 bar. You could handle gasoline like as if it was poisonous, flammable water. Gasoline has a distinctive smell, and is very hard to explode, contrary to what you see in the movies. Hydrogen is violently explosive, has no smell (you can die from asphyxiation from hydrogen build-up in an enclosed space like oh, a car, without realizing that you\u0027re dying. The only clue you\u0027d have is that your voice would become squeaky, much like with helium..so, better talk to yourself constantly!), burns almost invisibly, is pressurized to extreme levels.\n\nHydrogen sensors will be very cheap and accurate. Although its flammable mixture range is much higher, it disperse very fast even in close spaces) which reduce by a lot its ignition chance. Gasoline leaks, by other hand remains with you (under you which is worst).\n\nAlso you dont need always 700 bar. Cars still have good autonomy with only 100 bar.\n\n\u003E \n\u003E (Also a lot of \u0027diesel\u0027 locomotives are actually \u0022diesel-electric\u0022, wherein the diesel motor drives a generator, which in turn drives the wheels via electric traction motors.\n\nIn fact I dont know of any diesel locomotives without electric generators (I am asking), from what I know, you can not have the torque and smooth needed to move a train with a 100% thermal engine.\n\n\u003E \n\u003E Electric and hydrogen powered cars both are far less energy efficient than are petrol powered cars.\n\u003E The generation, transport, and storage of electricity and hydrogen are extremely energy inefficient, an order of magnitude worse than petrol.\n\nI explain already in detail in my post above yours.. It all depends on the infrastructure evolution. And your words on current \u0022extremely energy inefficient\u0022 is way far from the true.\n\n**Edited \u003Ctime datetime=\u00222015-04-12T04:26:44Z\u0022 title=\u002204/12/2015 04:26  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 12, 2015\u003C/time\u003E by AngelLestat**"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-04-12T05:37:30Z","Content":"\u003E \n\u003E You\u0027re generalizing too much about batteries. Not all batteries deteriorate quickly (NiCds can last through thousands of cycles for instance -- unless you\u0027re talking about self-discharge, but the low-self-discharge NiMH batteries can actually outlast as *gasoline tank*), and not all batteries contain hazardous materials (in fact, modern rechargeables generally don\u0027t contain anything particularly toxic), and not all batteries charge slowly (NiCds can fully charge in as little as 15 minutes, NiMH in about an hour). Having long charge time doesn\u0027t preclude long range either.\n\u003E Fuel cells also deteriorate, and with some designs, even faster than batteries. Also, I doubt they\u0027re all that light either.\n\nNickel batteries however have far worse energy density than most other batteries, and even the Li-ion batteries in short-range electric cars are heavy enough that they significantly impact the range and increase energy requirements. Although the end user generally doesn\u0027t see this as they don\u0027t comprehend their car\u0027s energy use, only \u0022how much fuel?\u0022 Fuel cells are also very light, even counting high pressure or cryogenic tanks, at least compared to batteries, and for the power levels required by a car. Aircraft couldn\u0027t use fuel cells for their high power requirements, but for cars and trucks, it\u0027s perfectly reasonable and in fact likely to be ideal, and if it\u0027s distributed as hydrogen rather than generated from an on-board PEM at a charging station, planes could happily use hydrogen in gas turbines. Yes, it\u0027s bigger, but it\u0027s lighter, the #1 efficiency concern for aircraft, so room can be made if there\u0027s a suitably large hydrogen industry to fuel the planes.\n\n\u003E \n\u003E Anyhow, if standardized battery formats could be produced (like AAA/AA/C/D cells and such), you might not have to charge a battery at all, but could instead swap it out really quickly.. Y\u0027know, assuming the average IQ of the planet wasn\u0027t 40.\n\u003E \n\u003E Hydrogen requires heavy tanks pressurized to massive pressures (700 bar) - extremely dangerous, very inefficient. Hydrogen is a massively diffuse gas at any sort of normal temperature or pressure. Most mass-produced hydrogen is extracted from \u0022natural\u0022 gas (fossil fuel methane).\n\nNevermind that these batteries are huge and weigh often multiple times what the average American does? Even if you broke them down into little units, it\u0027d be a huge job to replace them if they\u0027re small enough for the average person to remove and handle.\n\nHigh pressure isn\u0027t dangerous so long as the systems around it are designed suitably. It\u0027s very easy to make a tank that will happily take far more pressure than that without damage - and if you\u0027re in a crash hard enough to burst it, it was probably the least violent part of that crash, and there would have been fuel leaks anyway. At least after such an incident, the hydrogen will disperse extremely rapidly, rather than pool and build up like gas, or burst into flames like pierced batteries are often warrant to do. The hydrogen may ignite also, but at no greater risk than other fuels - petrol in particular can be a rather nasty, sticking flame, while hydrogen will burn quite intensely, but very rapidly and dispersed, generally completely consuming itself without causing major damage. Incidents with hydrogen in rocketry aren\u0027t relevant here due to the sheer quantity difference, any fuel causes massive damage if there\u0027s an ignited leak at those scales.\n\n\u003E \n\u003E Good luck pumping 700 bar gas using a gasoline station\u0027s storage and pumping gear. A gasoline station is actually better equipped to handle electric-battery refuel than electric-hydrogen refuel. They usually have mains power available. They don\u0027t have tanks and hoses rated for 700 bar. Hmm, I wonder what happens if a 700-bar pressurized transfer system fails to make a complete seal?\n\nCurrent fuel stations aren\u0027t equipped to handle electric cars either - at least not supercharging ones that people will come to expect. They\u0027re on the mains, yes, but they have a single-phase few kW line at most. Supercharging electric cars needs 135 kW for each car, which will necessitate a high-voltage three-phase connection and high-power rectifiers to provide the DC connection they actually use. More places have installed electric rather than hydrogen because it\u0027s popular, but both need an overhaul to the fuel station. And you\u0027re somewhat overlooking that it would be quite reasonable to make hydrogen cars support an electric connection, even if they can\u0027t supercharge due to limited conversion capacity - which therefore makes the hydrogen car workable at more stations than electric vehicles.\n\nAs for failing to make a complete seal ... you just don\u0027t open the 700-bar line. Have a mechanical lock that must be engaged, then do electronic confirmation with a weaker pressure to confirm there\u0027s no leak. Then once the weaker pressure isn\u0027t decaying, open the gate to the primary. Provide no overrides for the system - if it\u0027s broken, get someone to fix it and use a different pump.\n\nAlso we should bear in mind that we can generate hydrogen pretty much for-free if we adapt our infrastructure. I\u0027ll point out the Fukushima incident, during which a reactor building got blown apart - by hydrogen buildup. In a building that did not have a PEM operating to generate hydrogen, this hydrogen was simply split from water by the heat of an idle reactor, and was sufficient to pretty well destroy the building. Nuclear reactors don\u0027t like changing load, so if you simply modify all reactors we have to generate hydrogen in down cycles, rather than just a few for which it\u0027s most profitable, we have lots of hydrogen, created at high pressure, at fairly negligible cost. Perhaps this won\u0027t be enough to power a full switchover to hydrogen vehicles, but it can power many of them, enough to make them viable on the roads, which will then encourage a clean hydrogen industry to be developed by the fact there\u0027s demand for it.\n\nIn terms of the performance offered to a road vehicle for a rechargable energy storage that can be supplied by whatever large scale power plant is suitable, hydrogen is unmatched - massively lighter, considerably smaller, and allows a long range in a package that will fit inside a normal-looking car. Unsuitable for aircraft as fuel cells, but batteries are \u0022you\u0027re a bumbling idiot\u0022 in terms of large aircraft suitability. Only real way to beat out hydrogen for effectiveness is to get a direct line to the power station, as trains are moving over to do - but that\u0027s not very suitable for the roads. Its infrastructure is literally its only real downside, and not in terms of efficiency, as the car makes that up by being lighter, only in terms of the transport practicalities that no-one has attempted to address yet due to lack of demand."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-04-12T23:18:42Z","Content":"\u003E \n\u003E Also you dont need always 700 bar. Cars still have good autonomy with only 100 bar.\n\nHow much though? 50km isn\u0027t going to beat a battery-electric. That\u0027s still some scary pressure too (although seven times less scary)\n\n\u003E \n\u003E In fact I dont know of any diesel locomotives without electric generators (I am asking), from what I know, you can not have the torque and smooth needed to move a train with a 100% thermal engine.\n\nI don\u0027t know specific models, but they use some sort of hydraulic coupling, which I imagine is vaguely like the slushbox in an automatic car. I don\u0027t\u0027 know too much about it, mostly was just told about it by a train-enthusiast friend (I\u0027m more into ships, personally).\n\n\u003E \n\u003E Nickel batteries however have far worse energy density than most other batteries, and even the Li-ion batteries in short-range electric cars are heavy enough that they significantly impact the range and increase energy requirements. Although the end user generally doesn\u0027t see this as they don\u0027t comprehend their car\u0027s energy use, only \u0022how much fuel?\u0022\n\nWhile it\u0027s true that the nickel-family batteries have low specific energy, they\u0027re rather durable and significantly safer than ion-based technologies (so far, anyhow). The latest model NiMH cells actually have longer shelf life than *gasoline*, let alone alkalines or lithium-ions.\n\n\u003E \n\u003E Fuel cells are also very light, even counting high pressure or cryogenic tanks, at least compared to batteries, and for the power levels required by a car.\n\nMost of the fuel cells I\u0027ve seen specs on have terrible specific power numbers (power/weight - usually 100w/kilo or less) - once you\u0027ve added a 700 bar bomb tank, you\u0027re probably looking at 1200 kilos of mass vs a 300-450 kilo battery.\n\n\u003E \n\u003E planes could happily use hydrogen in gas turbines. Yes, it\u0027s bigger, but it\u0027s lighter, the #1 efficiency concern for aircraft, so room can be made if there\u0027s a suitably large hydrogen industry to fuel the planes.\n\nLighter than what? Kerosene? No, the massive tankage prevents that, or we\u0027d ALREADY have hydrogen planes. It\u0027s combustion performance cannot be denied - but it\u0027s hard to produce and even harder to store.\n\n\u003E \n\u003E Nevermind that these batteries are huge and weigh often multiple times what the average American does? Even if you broke them down into little units, it\u0027d be a huge job to replace them if they\u0027re small enough for the average person to remove and handle.\n\nWouldn\u0027t be a big job with an electric-lift dolly. We have a couple at my workplace that could easily sling a 400kg anything into a slot. They aren\u0027t cheap, but then again, a gas pump (of any kind) isn\u0027t cheap either.\n\n\u003E \n\u003E High pressure isn\u0027t dangerous so long as the systems around it are designed suitably.\n\nWish my old man were around to tell you his scuba diving stories. While a tank can be good for many thousands of charges, damage is invisible to the naked eye and hard to detect even with specialist equipment.\n\nWell, until it fails, anyhow. Any idiot can see bits of metal shards embedded in everything and go, \u0022ooh, [nice explosion](http://abcnews.go.com/US/scuba-tank-explosion-kills-iraq-war-veteran-russell-vanhorn/story?id=14502395).\u0022\n\nHigh pressure is NOT safe. And 700 bar is around three times the pressure of a scuba tank.\n\n\u003E \n\u003E The hydrogen may ignite also, but at no greater risk than other fuels - petrol in particular can be a rather nasty, sticking flame, while hydrogen will burn quite intensely, but very rapidly and dispersed, generally completely consuming itself without causing major damage.\n\nHydrogen is actually significantly easier to ignite than gasoline - takes very little ignition to set it off, and it has a *wide* range of concentrations it will burn/explode in. Gasoline, as I implied before, is more like water.\n\nPlus you\u0027re completely ignoring the surprise asphyxiation issue - if your car suddenly filled with hydrogen, you\u0027d have 9-12 *seconds* of consciousness with no or only vague symptoms before you lost consciousness. Your only hope then would be to be in an accident severe enough to crack open the car\u0027s frame to let the hydrogen out, without igniting it or killing you directly (threading the eye of the needle there). It\u0027s actually quite neat - a similar system may be replacing lethal injection in the United States for executions, using nitrogen. Er, well, neat in an absolutely EFFING terrifying way.\n\nNote that some battery chemistries can leak hydrogen too, although it\u0027s in smaller amounts. Lead-acids are the worst for this - they have this charming tendency to generate hydrogen inside, and then EXPLODE when a spark sets \u0027em off, spraying acid everywhere. I walk really carefully in the UPS battery aisles.\n\n\u003E \n\u003E Current fuel stations aren\u0027t equipped to handle electric cars either - at least not supercharging ones that people will come to expect. They\u0027re on the mains, yes, but they have a single-phase few kW line at most. Supercharging electric cars needs 135 kW for each car, which will necessitate a high-voltage three-phase connection and high-power rectifiers to provide the DC connection they actually use.\n\nThat depends on the car - that old GM car used an induction paddle, which has to absolutely be AC, no matter what, so no rectifiers. The point is though, most of these things will have a backup slow-charge, which can work anywhere, even Bob\u0027s Discount Gas Station, established 1932, which has just one 110v, 15a single-phase 60hz AC plug. Bob\u0027s station will absolutely not have hydrogen. Especially since Bob, who is now 130, actually saw the Hindenburg disaster, and won\u0027t have any \u0022new-fangled explodium tanks\u0022 installed at HIS station. He will let you plug your car in for 45 minutes for $5 though, which will give you enough range to drive home or to a station that DOES have supercharging capacity.\n\n\u003E \n\u003E More places have installed electric rather than hydrogen because it\u0027s popular, but both need an overhaul to the fuel station. And you\u0027re somewhat overlooking that it would be quite reasonable to make hydrogen cars support an electric connection, even if they can\u0027t supercharge due to limited conversion capacity - which therefore makes the hydrogen car workable at more stations than electric vehicles.\n\nAnd how, pray tell, does a hydrogen car store electric charge? \n\nIf you want to get into weirdness like on-board water-capture tanks and reversible fuel cells (hi extra mass and complexity!), I could simply counter with photovoltaic cells, giving a pure-electric vehicle charging pretty much anywhere (slowly of course, the roof of my car wouldn\u0027t support more than about 2kw of photovoltaic cells - of course, that could give me about 33% charge just.. sitting in a parking lot whilst at work..hmm).\n\n\u003E \n\u003E As for failing to make a complete seal ... you just don\u0027t open the 700-bar line. Have a mechanical lock that must be engaged, then do electronic confirmation with a weaker pressure to confirm there\u0027s no leak. Then once the weaker pressure isn\u0027t decaying, open the gate to the primary. Provide no overrides for the system - if it\u0027s broken, get someone to fix it and use a different pump.\n\nAH yes, because systems always work properly and never fail with false positives. And a test at less than full pressure isn\u0027t necessarily going to detect a faulty seal either. Also if someone is topping off a 700 bar tank which is currently at 650 bar, they won\u0027t care that you did an initial low pressure test when the back-pressure blows the connector off, decapitating them instantly.\n\n\u003E \n\u003E Also we should bear in mind that we can generate hydrogen pretty much for-free if we adapt our infrastructure. I\u0027ll point out the Fukushima incident, during which a reactor building got blown apart - by hydrogen buildup.\n\n\\*cough\\* I\u0027d forgotten about that. All I have to say about hydrogen and safety at this point is: Hindenburg 2.0, QED. Only this time, the hydrogen really *is* at fault.\n\n\u003E \n\u003E In a building that did not have a PEM operating to generate hydrogen, this hydrogen was simply split from water by the heat of an idle reactor, and was sufficient to pretty well destroy the building.\n\nI had to look that up - there\u0027s no way that an IDLE reactor could raw-split water (thermolysis) into hydrogen and oxygen, that only happens above 2KC, and even then, very slowly. The Fukushima incident involved zirconium reacting with the water, allowing the hydrogen to be produced. I\u0027ve heard of some high temperature *electrolysis* research, but that was also in the thousand-degree range, well above the normal temperatures for the coolant in any *current* water-based reactors. And it requires diverting electrical output. Nukes are generally run in a baseload profile already, which means they\u0027re generally required 24/7 anyhow (power requirements do NOT drop off to zero at night time. Most power companies offer preferred rates at that time and a lot of industrial customers take \u0027em up on that).\n\nSo, no, I really don\u0027t want Fukushima/Scuba-Hindenburgs driving on the road with me and my classic gasoline automobile."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-13T00:51:02Z","Content":"\u003E \n\u003E How much though? 50km isn\u0027t going to beat a battery-electric. That\u0027s still some scary pressure too (although seven times less scary)\n\nYou are right, I mix some numbers from old hydrogen tanks or cryogenics. But industry is not searching how to reduce the pressure, in fact they wanted to increase using lighter materials at the same time.\n![Targets_for_On-Board_Hydrogen_Storage.gif](https://upload.wikimedia.org/wikipedia/commons/f/f6/Targets_for_On-Board_Hydrogen_Storage.gif)\n\nBut what about ammonia? In 2014 they found a easy way to cracked back to hydrogen, you will lost only a 10% in efficiency in make ammonia and then craked, but it will save a similar amount of energy in the hydrogen management. \n\nSmall cars like 1500 kg or less had more sense with batteries. But beyond that hydrogen will be the most efficient choice.\n\n\u003E \n\u003E Wish my old man were around to tell you his scuba diving stories. While a tank can be good for many thousands of charges, damage is invisible to the naked eye and hard to detect even with specialist equipment.\n\nyeah is possible.. but still not sure how severe would be a 700 bar h2 tank explossion vs a 700 bar air tank. The h2 \ndiffuse faster so it does not provide (in my theory) much acceleration to the tank parts as it will any other element compressed under the same pressures.\n\n\u003E \n\u003E if your car suddenly filled with hydrogen, you\u0027d have 9-12 *seconds* of consciousness\n\nHow can be filled if it is so diffuse? Also how do you extract the o2 from inside your car? Also pitched voice.. \n\n\u003E \n\u003E If you want to get into weirdness like on-board water-capture tanks and reversible fuel cells (hi extra mass and complexity!), I could simply counter with photovoltaic cells, giving a pure-electric vehicle charging pretty much anywhere (slowly of course, the roof of my car wouldn\u0027t support more than about 2kw of photovoltaic cells - of course, that could give me about 33% charge just.. sitting in a parking lot whilst at work..hmm).\n\nIt all depend in how cheap will be the new catalysts in the future.\n\n\u003E \n\u003E All I have to say about hydrogen and safety at this point is: Hindenburg 2.0, QED. Only this time, the hydrogen really *is* at fault.\n\nIs funny how all arguments against hydrogen only has 1 case to point in 1930. Hydrogen is flammable.. so it burns with air.. the same han all the history fire caused by oil derivatives.\n\n\u003E \n\u003E but it\u0027s hard to produce and even harder to store.\n\nah it seems that we are talking about antimatter now.\n\n**Edited \u003Ctime datetime=\u00222015-04-13T00:56:52Z\u0022 title=\u002204/13/2015 12:56  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by AngelLestat**"},{"CreatedByName":"NFUN","CreatedById":78715,"CreatedDateTime":"2015-04-13T01:32:43Z","Content":"*Wish my old man were around to tell you his scuba diving stories. While a tank can be good for many thousands of charges, damage is invisible to the naked eye and hard to detect even with specialist equipment.*\n\n**yeah is possible.. but still not sure how severe would be a 700 bar h2 tank explossion vs a 700 bar air tank. The h2** \n\n**diffuse faster so it does not provide (in my theory) much acceleration to the tank parts as it will any other element compressed under the same pressures.**\n\nPressure is pressure. No matter the gas, the contents of the tank will expand rapidly and be pretty destructive. If it diffuses faster (not entirely sure what you mean by that in this situation) than should it not be even more destructive by spreading out faster?\n\n*if your car suddenly filled with hydrogen, you\u0027d have 9-12 seconds of consciousness*\n\n**How can be filled if it is so diffuse? Also how do you extract the o2 from inside your car? Also pitched voice..** \n\nWhat do you mean by diffuse? It doesn\u0027t matter how light hydrogen is, it still roughly follows the ideal gas law like almost any other gas, and there is plenty of it at 700 bar. One may still suffocate with O2 in an enclosed area with enough of another gas present, for example, it is possible to execute or suffocate people with nitrogen. I doubt in that instance the oxygen present in the room has to be evacuated first. Also, He, not H2, is famous for making your voice go higher, and although H2 would too, neither would be used in a parlor trick at the levels or the duration one would be exposed to in Renegrade\u0027s example.\n\n*If you want to get into weirdness like on-board water-capture tanks and reversible fuel cells (hi extra mass and complexity!), I could simply counter with photovoltaic cells, giving a pure-electric vehicle charging pretty much anywhere (slowly of course, the roof of my car wouldn\u0027t support more than about 2kw of photovoltaic cells - of course, that could give me about 33% charge just.. sitting in a parking lot whilst at work..hmm).*\n\n**It all depend in how cheap will be the new catalysts in the future.**\n\nIt doesn\u0027t matter how cheap the catalysts are, they will still add weight and complexity, which is one of the core arguments against electric. \n\n*All I have to say about hydrogen and safety at this point is: Hindenburg 2.0, QED. Only this time, the hydrogen really is at fault.*\n\n**Is funny how all arguments against hydrogen only has 1 case to point in 1930. Hydrogen is flammable.. so it burns with air.. the same han all the history fire caused by oil derivatives.**\n\nHydrogen is much more flammable than gasoline, and his Hindenburg example was made because of its apparent relation with hydrogen. The Hindenburg burnt because its paint caught on fire, which he admitted (\u0022Only this time, the hydrogen really is at fault\u0022), and he could have used many other disasters as examples of explosions.\n\n*but it\u0027s hard to produce and even harder to store.*\n\n**ah it seems that we are talking about antimatter now.**\n\nThat is just redirection, stop being fallacious. Hydrogen is also notoriously hard to store, though I\u0027m not sure about the efficiency of electrolysis.\n\n**Edited \u003Ctime datetime=\u00222015-04-13T01:34:50Z\u0022 title=\u002204/13/2015 01:34  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by NFUN**"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-13T02:32:34Z","Content":"\u003E Pressure is pressure. No matter the gas, the contents of the tank will expand rapidly and be pretty destructive. If it diffuses faster (not entirely sure what you mean by that in this situation) than should it not be even more destructive by spreading out faster?\n\nHydrogen is less viscous, it will diffuse faster for any open space than keep pushing against something else. Even with that pressure you have only 5 kg of gas there, if you have a similar tank with air you have many times that mass, which will push with more force the tank parts or the air around.\n\n\u003E \n\u003E What do you mean by diffuse? It doesn\u0027t matter how light hydrogen is, it still roughly follows the ideal gas law like almost any other gas, and there is plenty of it at 700 bar. One may still suffocate with O2 in an enclosed area with enough of another gas present, for example, it is possible to execute or suffocate people with nitrogen. I doubt in that instance the oxygen present in the room has to be evacuated first. Also, He, not H2, is famous for making your voice go higher, and although H2 would too, neither would be used in a parlor trick at the levels or the duration one would be exposed to in Renegrade\u0027s example.\n\n[http://www.arhab.org/pdfs/h2_safety_fsheet.pdf](http://www.arhab.org/pdfs/h2_safety_fsheet.pdf)\n\n*\u0022Hydrogen has a rapid diffusivity (3.8 times faster than natural gas), which means that when released, it dilutes quickly into a non-flammable concentration.*\n\n*Hydrogen rises 6 times faster than natural gas at a speed of almost 20m/s. Therefore,unless a roof,a poorly ventilated room or some other structure contains the rising gas, the laws of physics prevent hydrogen from lingering near a leak. Simply stated, to become a fire hazard, hydrogen must first be confined Ã¢â‚¬â€œ but as the lightest element in the universe, confining hydrogen is very difficult. Industry takes these properties into account when designing structures where hydrogen will be used. The designs help hydrogen escape up and away from the user in case of an unexpected release.* \u0022\n\n![save_car.jpg](https://daryanenergyblog.files.wordpress.com/2013/06/save_car.jpg)\n\n\u003E \n\u003E It doesn\u0027t matter how cheap the catalysts are, they will still add weight and complexity, which is one of the core arguments against electric.\n\nThe electrolysis does not add weight.. the only that can add weight is the compression. But nobody said that this needs to be in your car.. You can have one in your house.\n\n\u003E \n\u003E Hydrogen is much more flammable than gasoline, and his Hindenburg example was made because of its apparent relation with hydrogen. The Hindenburg burnt because its paint caught on fire, which he admitted (\u0022Only this time, the hydrogen really is at fault\u0022), and he could have used many other disasters as examples of explosions.\n\nOk, I dint understand that part.. thanks to clarify.\n\n\u003E \n\u003E That is just redirection, stop being fallacious. Hydrogen is also notoriously hard to store, though I\u0027m not sure about the efficiency of electrolysis.\n\nMy point is, lets not exaggerate. \n95% its efficiency. Also read about ammonia storage in previous post.\n\n**Edited \u003Ctime datetime=\u00222015-04-13T02:41:38Z\u0022 title=\u002204/13/2015 02:41  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by AngelLestat**"},{"CreatedByName":"Kohai_Khaos","CreatedById":139284,"CreatedDateTime":"2015-04-13T02:48:59Z","Content":"\u003E \n\u003E You are right, I mix some numbers from old hydrogen tanks or cryogenics. But industry is not searching how to reduce the pressure, in fact they wanted to increase using lighter materials at the same time.\n\u003E [http://upload.wikimedia.org/wikipedia/commons/f/f6/Targets_for_On-Board_Hydrogen_Storage.gif](https://upload.wikimedia.org/wikipedia/commons/f/f6/Targets_for_On-Board_Hydrogen_Storage.gif)\n\n\u003E \n\u003E yeah is possible.. but still not sure how severe would be a 700 bar h2 tank explosion vs a 700 bar air tank. The h2 \n\u003E diffuse faster so it does not provide (in my theory) much acceleration to the tank parts as it will any other element compressed under the same pressures.\n\nWait a minute...that last one. Hydrogen at 700 bar has a density of a measly 0.042 kg/L. That thing quotes new tanks at 0.081 kg/L...by Boyle\u0027s law, this stuff is at 1350 bar. And you\u0027re going to tell me that it\u0027s safe.\n\nNotably, this is about 10 g/L more dense than liquid hydrogen. Now, I won\u0027t say this is impossible, since we\u0027re dealing with extremely high pressures that cause some deviations form ideal gas laws like Boyle\u0027s, but it\u0027s rather important to note that at such pressures, we should expect the compressibility factor to generally exceed 1, so you generally need even more pressure to achieve the desired density.\n\nAbout 10 g/L before you hit this density, however, the hydrogen should liquify simply due to the pressure. At that point, raising the density becomes extremely challenging; compressing liquids is an insane task, between 1 and 681 atm, water has gone from 1 kg/L to 1.03319089 kg / L. a 3% change. Meanwhile, the numbers I\u0027m seeing are people pulling at a lovely 14% compression \\*after\\* liquifying it. That\u0027s on top of the insane pressure it took to get it liquid.\n\nThis isn\u0027t some scuba tank exploding. You want a lightweight tank, fine. 1/10 of a meter of steel, with a fine density of 8,050 kg/m^3^. That\u0027s 805 kg/m^2^ of tank.\n\nIf a 1 meter by 1 meter section of tank blew off, and had only a tenth of a second\u0027s acceleration from the original pressure of our lovely 1350\u002B bar gas (135000000 N/m^2^), then our piece will be flying off at quite a lovely speed.\n\nHow lovely?\n\na = F/m; a = 135000000/805 = 167701.86335403726708074534161491 m/s^2^\n\nIn a tenth of a second, that thing\u0027s up at 16,770 m/s.\n\nHow about 1/100 of a second? Still moving at nearly mach 5 here.\n\n1/1000 of a second gets us down to 167.7 m/s, but let\u0027s not forget that this chunk of tank weighs over half a ton. Anything in the way is dying. Everything gets the same kinetic energy off of this, so lighter things fly off faster, heavier things fly off slower.\n\nWell let\u0027s say you just got hit head on by the airwave. A human being is about 1.75 m, width, I\u0027ll give you, say, about 0.254 m (10 in). If you were a rectangle, that\u0027d be about 0.4445 m^2^, of surface area.\n\nI can relate force with the inverse square law here (since it\u0027s a pressure wave propagating from what is assumed to be a point source), so F/A at any point = P/r^2^, thanks to how pressure waves work. F = PA/r^2^ = (135000000 N/m^2^)(0.4445 m^2^)/r^2^\n\nF = 60007500 N / r^2^, say, 100 meters away (r^2^ = 10000), you get struck with 6000.75 N. This is just the pressure wave\u0027s force on you if you\u0027re facing the explosion when it happens and nothing happens to get in the way (so you get a bit less because there is, in fact, air in the way, but this is a scary number, seeing as it\u0027s enough to send an average human, at 62 kg, flying off with just under 10 Gs, at a lovely 96.79 m/s^2^)\n\nA tank of any size exploding is going to be catastrophic. You don\u0027t need a big explosion because the pressure is just that damn high, and you\u0027ve got people REALLY close to this thing.\n\nIt\u0027s basically a *bomb* you\u0027ve got in your car, ready to go off whenever it wants, that\u0027s hard to access and assess any damage on. You\u0027re probably lucky that at the point you\u0027ve got these things working, there\u0027s basically no way for changes in temperature to cause any more compression than their already is, because otherwise these things would explode all the time due to their pressure exceeding their limits when large temperature changes occur.\n\nDo we even have mechanical seals capable of dealing with this? Do we really?\n\n\u003E \n\u003E How can be filled if it is so diffuse? Also how do you extract the o2 from inside your car? Also pitched voice..\n\nActually, the hydrogen will not be diffuse. You\u0027re carrying enough in the car to drive around with, after all; a simply massive amount. \u0022diffuse\u0022 doesn\u0027t even mean what you think it means, it means that something is spread out over a large area. Hydrogen is diffuse if you have it at 0.5 bar, because there\u0027s not much of it in a large volume. But hydrogen at 1 bar is no more diffuse than air at 1 bar, though they have different masses.\n\nThe problem is also not extracting the O\u003Csub\u003E2\u003C/sub\u003E from the car, but the fact that the H\u003Csub\u003E2\u003C/sub\u003E increases the amount of gas in the car, resulting in a lower *concentration* of O\u003Csub\u003E2\u003C/sub\u003E.\n\nSay I\u0027ve got 100 kg of air in a container (for those at home, that\u0027s 81.63 m^3^, a midsized car only has an interior area of about 3.37 m^3^). The concentration of O\u003Csub\u003E2\u003C/sub\u003E is about 20.9%, so I\u0027ve got 20.9 kg of O\u003Csub\u003E2\u003C/sub\u003E in there.\n\nIf I add 25 kg of pure hydrogen to it, I\u0027ve got 125 kg of stuff in, and only 20.9 kg of O\u003Csub\u003E2\u003C/sub\u003E, I\u0027ve now got 16.72% concentration. At that concentration, your mental state is impaired. This is a very bad thing for someone driving a car.\n\nSay I add 100 kg of pure hydrogen instead though. That brings concentration down to 10.45%, people start getting nauseous and losing consciousness around there.\n\nFor the midsized car, by the way, the division factor is like, 24.2. So 2 kg of pure hydrogen getting into the cabin is more than enough to impair the driver, and 5 kg is enough to knock people out. You really, *really* don\u0027t want a leak into the cabin.\n\n\u003E \n\u003E [http://www.arhab.org/pdfs/h2_safety_fsheet.pdf](http://www.arhab.org/pdfs/h2_safety_fsheet.pdf)\n\nI like the \u0022An explosion cannot occur in a tank or any contained location that contains only hydrogen.\u0022 blatant lie.\n\nTake a 100 bar tank at 0 C. This is what the tank\u0027s rated for, and it will burst at 20% over that.\n\nHeat the tank to 100 C.\n\nWatch the tank burst well before that because the pressure at 100 C is 136.61 bar. It doesn\u0027t matter what was in the tank in the least bit. You exceeded its pressure rating just through basic ideal gas laws.\n\n**Edited \u003Ctime datetime=\u00222015-04-13T03:05:03Z\u0022 title=\u002204/13/2015 03:05  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by Kohai\\_Khaos**"},{"CreatedByName":"NFUN","CreatedById":78715,"CreatedDateTime":"2015-04-13T03:12:59Z","Content":"*many times that mass, which will push with more force the tank parts or the air around.*\n\nNo, it won\u0027t. [Pressure is determined by the amount (moles) of the gas, not its weight.](https://en.wikipedia.org/wiki/Ideal_gas_law)"},{"CreatedByName":"Kohai_Khaos","CreatedById":139284,"CreatedDateTime":"2015-04-13T03:56:05Z","Content":"Can anyone else double check my 1350\u002B bars figure (for Boyle\u0027s law; logically, it\u0027s gonna be a bit higher experimentally because compressibility starts getting in the way) for that 0.081 kg/L number? I don\u0027t want to be too scaremongery, but I feel somewhat concerned about the simply insane numbers that that sort of thing bursting brings up (the rest of that post is some of the most frightening numbers I\u0027ve ever seen). I\u0027d prefer to know that I\u0027m at least semi-accurate on my numbers here. I couldn\u0027t find any experimental sources on what the pressure should be, after all."},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-04-13T11:57:57Z","Content":"WolframAlpha says to achieve that at room temperature requires over 2000 bar - though if you cool the hydrogen you can very easily get gaseous hydrogen to be that dense below 700 bar, which is likely to be what they\u0027re talking about. Regardless, that kind of density isn\u0027t necessary, as you still get great capacity with much lower densities. Notably, density is not the decider for phase transitions - water is enough proof of that. Hydrogen at 700 bar, 50 K is 90 kg/m^3 - and this is actually supercritical for hydrogen, so it\u0027s not looking at flirting with becoming liquid except by being cooled.\n\n\u003E \n\u003E [snip the pressure tank failure calculations]\n\nTotal lack of understanding of how to actually design pressure vessels and how pressure behaves on them when it does fail, basically every number here is meaningless. Pressure very rapidly dissipates beyond the tank, and at most you can consider the impulse on a piece of tank over a small multiple of wall thickness, as that\u0027s when the gas will simply spread around the piece instead.\n\nRunning the numbers through online calculators, most of them are more limited than the tools you\u0027d use to actually design this and the most I\u0027ve been able to verify is 350 bar with relatively generic steel - but even with this the required wall thickness is only 1.5 inches or so for a 1 ft diameter tank. If this is a tank 1m long, then that carries 145 litres without considering endcap volume, a tad small for hydrogen, but this is starting with what can be verified, and it only takes a small increase to be competitive with hydrocarbons on energy content in tank. (Only you\u0027re also getting much higher efficiency, so this isn\u0027t really necessary)\n\nNote that pressure vessels can be quite awkward to design due to materials not liking to behave evenly - the calculator I used limited output thickness to 2 inches, which is what prevented 700 bar calculations. Because of this however, very large safety factors are always used - often 5x to 10x, or even more. That tank quoted could potentially take 3500 bar or more before failure, and was only calculated using cheap steel, rather than what you\u0027d actually use for hydrogen.\n\n\u003E \n\u003E A tank of any size exploding is going to be catastrophic. You don\u0027t need a big explosion because the pressure is just that damn high, and you\u0027ve got people REALLY close to this thing.\n\u003E \n\u003E It\u0027s basically a *bomb* you\u0027ve got in your car, ready to go off whenever it wants, that\u0027s hard to access and assess any damage on. You\u0027re probably lucky that at the point you\u0027ve got these things working, there\u0027s basically no way for changes in temperature to cause any more compression than their already is, because otherwise these things would explode all the time due to their pressure exceeding their limits when large temperature changes occur.\n\u003E \n\u003E Do we even have mechanical seals capable of dealing with this? Do we really?\n\nAs above, while there are dangers, you\u0027re massively over-exaggerating. You won\u0027t get giant panels blown out, (tanks break open on a crack and let it all out through there - especially with hydrogen, as even a tiny crack allows a huge amount to escape rapidly, bringing pressure below damaging points) and the pressure diffuses very rapidly, as it spreads in all directions, so it won\u0027t cause injury unless some idiot\u0027s under the car working on the tank while under pressure when it goes. Proper scans of the tank can be made legally required to check for damage in yearly checkups, and yes, we do have capable seals - in industrial situations, 700 bar isn\u0027t even that impressive.\n\n\u003E \n\u003E Actually, the hydrogen will not be diffuse. You\u0027re carrying enough in the car to drive around with, after all; a simply massive amount. \u0022diffuse\u0022 doesn\u0027t even mean what you think it means, it means that something is spread out over a large area. Hydrogen is diffuse if you have it at 0.5 bar, because there\u0027s not much of it in a large volume. But hydrogen at 1 bar is no more diffuse than air at 1 bar, though they have different masses.\n\u003E \n\u003E For the midsized car, by the way, the division factor is like, 24.2. So 2 kg of pure hydrogen getting into the cabin is more than enough to impair the driver, and 5 kg is enough to knock people out. You really, *really* don\u0027t want a leak into the cabin.\n\nNone of this is something we don\u0027t understand, and you\u0027re assuming that we don\u0027t already have to deal with preventing gasses from entering the cabin. Camper vans carry high pressure tanks of natural gas, or various other similar hazards on a regular basis, and are legally required to verify that a leak in their storage compartment won\u0027t enter into the cabin. Do note that this isn\u0027t just a storage compartment, where you take them out to use them with a cooker - they do get connected to piping for the refrigerator and stove inside the van. We don\u0027t have issues with this, so it\u0027s perfectly acceptable to assume that hydrogen will have similar requirements, and that bar awful maintenance or tampering, 0% will enter the cabin. If an accident is ever bad enough that there\u0027s a break in the cabin for it to enter through, A) you have bigger worries, ![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) there\u0027s going to be at least a second hold for it to exit through, and hydrogen exits containers very quickly, even at RTP.\n\nAlso, why would you be carrying a huge amount of hydrogen? 60 gallons is a large tank for a fossil fuel car, which is 218 kg if you assume a dense fossil fuel. (0.8 kg/L) Assuming a low fuel cell efficiency of 60%, and hydrogen will happily match that energetic content with only 24 kg of fuel. This also discounts that a fuel cell vehicle would have a small battery and regenerative braking, so to match range with that 60 gallon tank would use even less fuel. By your numbers, you only need to be sure at least 9/10ths of the hydrogen will go elsewhere in case of a leak to have no problems whatsoever. (Impairment isn\u0027t a problem, as this is if you lost all fuel in a full tank - so the car isn\u0027t going anywhere) Given that camper vans show we can very easily prevent pretty much 100% of a leak from entering a closed cabin, this isn\u0027t really a concern - so long as you\u0027re giving the hydrogen somewhere else to go, it\u0027s no danger to the driver.\n\n\u003E \n\u003E I like the \u0022An explosion cannot occur in a tank or any contained location that contains only hydrogen.\u0022 blatant lie.\n\u003E \n\u003E Take a 100 bar tank at 0 C. This is what the tank\u0027s rated for, and it will burst at 20% over that.\n\u003E \n\u003E Heat the tank to 100 C.\n\u003E \n\u003E Watch the tank burst well before that because the pressure at 100 C is 136.61 bar. It doesn\u0027t matter what was in the tank in the least bit. You exceeded its pressure rating just through basic ideal gas laws.\n\nAn actual explosion can\u0027t happen in a pure hydrogen environment, no. Nothing to react with. The tank isn\u0027t anything like as likely to burst as you\u0027re trying to wildly claim either - 20% is an absurd safety rating, even aerospace areas where weight is the #1 driver use 50% minimum, and high pressure tankage is regularly 10x or more. That 100 bar tank could store our 700 bar hydrogen at the safety rating you\u0027re claiming.\n\nOn hydrogen\u0027s flammability, while it\u0027s easier to ignite with a spark, it\u0027s actually far more docile than fossil fuels in many ways - it can\u0027t ignite due to pressure, for one thing. And once it ignites, it burns very differently, not sticking to things and very rapidly leaving dangerous areas. Go look at the previous picture for a car after a hydrogen leak ignites, versus what can and does regularly happen to petrol cars that get a leak in an accident.\n\nFinal comment, it doesn\u0027t add mass to have a hydrogen vehicle rechargeable via electric outlets, as the vast majority of hydrogen fuel cell designs are reversible - by using a fuel cell you already have a rechargeable vehicle, and you\u0027re being wasteful by not giving it a charging port to be used when hydrogen isn\u0027t available. You also won\u0027t get 2 kW with roof panels, unless you\u0027re going to say your car is 10 m^2 and on the equator for its entire life, and the hydrogen car can do this just as easily, so is no advantage specifically for electric cars.\n\nEdit as I just recalled asking about why hydrogen is not used for aircraft: no infrastructure. There\u0027s a plenty large hydrocarbon infrastructure that can provide enough fuel for planes, so that\u0027s what\u0027s used as it\u0027s easiest. Hydrogen will be more efficient after a switchover, but airlines are cost-driven and with the tiny infrastructure and few places that actually have large hydrogen quantities, a hydrogen plane would have no place to fuel up and cost far more, so there\u0027s no interest as is. Interest will be generated after a hydrogen industry drives cost down and depleting fossil fuels drives hydrocarbon fuel cost up. Electric will have no interest from airliner manufacturers as it cannot even slightly provide the energy and mass requirements, while hydrogen can, so hydrogen will be the fuel of choice after fossil fuel depletion becomes more severe. At least, assuming we don\u0027t have miniature fusion devices by that point, but it seems unlikely - the European fusion committee isn\u0027t looking at even large tokamaks being commercial until the early 2040\u0027s at best.\n\n**Edited \u003Ctime datetime=\u00222015-04-13T12:05:34Z\u0022 title=\u002204/13/2015 12:05  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by Iskierka**"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-13T15:09:33Z","Content":"\u003E \n\u003E A tank of any size exploding is going to be catastrophic. You don\u0027t need a big explosion because the pressure is just that damn high, and you\u0027ve got people REALLY close to this thing.\n\u003E \n\u003E It\u0027s basically a *bomb* you\u0027ve got in your car, ready to go off whenever it wants, that\u0027s hard to access and assess any damage on. You\u0027re probably lucky that at the point you\u0027ve got these things working, there\u0027s basically no way for changes in temperature to cause any more compression than their already is, because otherwise these things would explode all the time due to their pressure exceeding their limits when large temperature changes occur.\n\u003E \n\u003E Do we even have mechanical seals capable of dealing with this? Do we really?\n\nhi, is the first time that I see a blast calculation so I can not help you with that and there are many things that I dont understand. Also my logic tells me that in case that your calculations are correct, that must be true only for blast which source and medium is the same gas.\n\nAlso not sure how to calculate damage by a pressure blast force.. One thing is a force applied to only 100 cm2 and a very different thing is that force equal applied to each point (inside and out) of your body. That force may looks scary for an object hitting you but not so much as air pressure. \n\n\u003E \n\u003E Say I\u0027ve got 100 kg of air in a container (for those at home, that\u0027s 81.63 m^3^, a midsized car only has an interior area of about 3.37 m^3^). The concentration of O\u003Csub\u003E2\u003C/sub\u003E is about 20.9%, so I\u0027ve got 20.9 kg of O\u003Csub\u003E2\u003C/sub\u003E in there.\n\u003E If I add 25 kg of pure hydrogen to it, I\u0027ve got 125 kg of stuff in, and only 20.9 kg of O\u003Csub\u003E2\u003C/sub\u003E, I\u0027ve now got 16.72% concentration. At that concentration, your mental state is impaired. This is a very bad thing for someone driving a car.\n\u003E \n\u003E Say I add 100 kg of pure hydrogen instead though. That brings concentration down to 10.45%, people start getting nauseous and losing consciousness around there.\n\nMountain climbers deal with 8% of O2, and they do it under a high physical activity. Not just sitting in a car.\nThe toyota Mirai carry only 5 kg of hydrogen which gives 165kwh, the Tesla S only has 85Kwh in its batteries.\n\nAlso there is not way that all those 5kg of hydrogen will remain in the car for more than half second. Cars are not pressure vessels or air tight. And as I said, hydrogen cars already are designed to let any leak escape from the car with ease.\n\n\u003E \n\u003E I like the \u0022An explosion cannot occur in a tank or any contained location that contains only hydrogen.\u0022 blatant lie.\n\u003E Take a 100 bar tank at 0 C. This is what the tank\u0027s rated for, and it will burst at 20% over that.\n\u003E \n\u003E Heat the tank to 100 C.\n\u003E \n\u003E Watch the tank burst well before that because the pressure at 100 C is 136.61 bar. It doesn\u0027t matter what was in the tank in the least bit. You exceeded its pressure rating just through basic ideal gas laws.\n\n700 bar hydrogen tanks only are in danger when overseed 1600 bars.\n\nThe tanks resist any fire gun shoot, to be able to pierce them you need .50 caliber barret. And if you do, the hydrogen leaks by the hole very quickly without explosion.\n\nAlso the tanks come with pressure release valves in case over pressure, plus 15 extra valves with a complicate hardware system to act the best way against any different problem. The tanks are in the less vulnerable part of the car. Expert said that due all these precautions h2 cars are even more safety than any other car. \n\n**So less put the \u0022hydrogen danger\u0022 aside and lets talk about the real drawbacks.**\n\nPressure Hydrogen transport and management comes with an extra cost which it will be notice in the car and the fuel cost.\n\nThat is why I think it will be more cost efficient to use ammonia for any \u002B1500kg vehicle with the airplane exception. For planes h2 cryo tanks works much better.\n\n\u003E \n\u003E *many times that mass, which will push with more force the tank parts or the air around.*\n\u003E No, it won\u0027t. [Pressure is determined by the amount (moles) of the gas, not its weight.](https://en.wikipedia.org/wiki/Ideal_gas_law)\n\nThat is true for instant 0, but to get impulse you need a force acting on time. I am not sure, but I still believe that is not the same two 100 liter tank at 700 bar one containing hydrogen and the other air which has 12 times more mass.\n\n\u003E \n\u003E WolframAlpha says\n\nOh, long time that I dint check this site.. they growth up a lot."},{"CreatedByName":"Kohai_Khaos","CreatedById":139284,"CreatedDateTime":"2015-04-13T17:00:57Z","Content":"\u003E \n\u003E WolframAlpha says to achieve that at room temperature requires over 2000 bar - though if you cool the hydrogen you can very easily get gaseous hydrogen to be that dense below 700 bar, which is likely to be what they\u0027re talking about. Regardless, that kind of density isn\u0027t necessary, as you still get great capacity with much lower densities. Notably, density is not the decider for phase transitions - water is enough proof of that. Hydrogen at 700 bar, 50 K is 90 kg/m^3 - and this is actually supercritical for hydrogen, so it\u0027s not looking at flirting with becoming liquid except by being cooled.\n\n700 bar / 50 K = x / 293 K (room temperature)\n\nx = 4102 bar.\n\nPlease, never let this stuff heat up. Ever. Keep your car charged at all times. I will admit to having no idea how much energy you will be spending keeping that heat away, but you will need electricity at all times, that\u0027s for sure. Seeing as you seem to know more about this actual field than me though, I\u0027ll just assume that whatever they do, the tank will be built strong enough to deal with this. In fact, built to deal with a bit more, at least 4353 bar (what the pressure *should* be at 100 F if I pretend that hydrogen is an ideal gas again, a lovely summer day in many places). I guess we\u0027ll be using that 10x rating tank.\n\nOf course, now you\u0027re giving people hoses that spray high-pressure hydrogen (since you will need to at least exceed 700 bar to get it to flow into the tank, rather than out, at least as far as I know. Unless there\u0027s a way to transfer gas from a low-pressure area to a high-pressure one, and I\u0027d love to hear it) at cryogenic temperatures at the gas station. I mean, sure, I was suggesting 1350 bar hoses, but at least the gas coming out of them wouldn\u0027t flash freeze human beings. Unless you intend the user to wait around, slowly putting in gas, reaching 700 bar, and waiting for the gas to cool down via whatever cooling system you use (you do intend to be capable of maintaining this 50 K, right? I can\u0027t do the math for how much power is going into that job whatsoever, since it depends on how quickly the heat dissipates from the tank.), filling it up to 700 bar again, and waiting for it to cool again, and so on.\n\nI would love to just calculate just how high into the air I can spray hydrogen with a hose at 700 bar. I think it would be the most amazing thing ever to see what kind of stuff we\u0027re really dealing with. I mean, will the hydrogen moving through the air break the sound barrier? That\u0027d be the most amazing thing ever.\n\nAlso, thank you for using the phrase \u0022critical point\u0022 because nobody ever bothered to teach me even the goddamn phrase, which makes me rather annoyed. Very nice bit of knowledge there. You did spur me on to go looking and I found a phase diagram, and apparently I was even wrong about what state the hydrogen I was \u0027anticipating\u0027 being at.\n\n![1372142909_phasediag.gif](http://hydropole.ch/wp-content/uploads/2014/12/1372142909_phasediag.gif)\n\nIf this is accurate, and I can\u0027t exactly know if it is because I couldn\u0027t find anything to really compare it to...the hydrogen at 1350 bar and at room temperature would have been flirting a little close to the line with *solid* hydrogen, though my eyes can\u0027t guesstimate exactly how close. But yeah, it looks like the stuff at around the numbers you\u0027re saying is in that critical area. I don\u0027t know enough to comment any further on that particular bit of physics.\n\nSee, if I try to do math outside of my league, it encourages people to come by and actually teach me what the hell I\u0027m doing.\n\n\u003E \n\u003E Also, why would you be carrying a huge amount of hydrogen? 60 gallons is a large tank for a fossil fuel car, which is 218 kg if you assume a dense fossil fuel. (0.8 kg/L) Assuming a low fuel cell efficiency of 60%, and hydrogen will happily match that energetic content with only 24 kg of fuel.\n\nUhm, how about gasoline, with its lovely density of 0.71 kg/L. Specific energy of 12.431 kWh/kg. After efficiency, say, 25%: 3.108 kWh/kg.\n\nHydrogen has a specific energy of about 33.3055556 kWh/kg (I\u0027m too lazy to do this math yet again, feel free to correct my number if I seem off, I just grabbed the number off the web). After efficiency, 19.983 kWh/kg. This means 6.43 kg of gasoline matches 1 kg of hydrogen. You\u0027ll need a bit more hydrogen, about 34 kg. Diesel has an ever so slightly lower specific energy than gasoline, but diesel engines can hit efficiencies of 50%, which would mean you\u0027d need about double that amount of hydrogen to match a high-efficiency diesel engine with a 60 gallon tank (plus some more, because diesel\u0027s higher density means it holds about 11% more energy per gallon over gasoline). You\u0027re still doing better per kg, but how about our 0.081 kg/L?\n\n418.5627 L for that 34 kg of hydrogen. That\u0027s a 110.573 gallon tank with our high-density hydrogen. Nearly double the volume of the gasoline tank.\n\nMatching the diesel engine, without accounting for its higher energy per gallon, just its efficiency increase, that\u0027s at least 220 gallons. That\u0027s 3.67 times the volume of our initial tank. I guess it\u0027s lucky we\u0027re talking about 60 gallon tanks, which you should only really find on \u0022small\u0022 big trucks, and bigger models already pack things like 200 and 500 gallon tanks.\n\nThen again, Lestat does keep saying that bigger vehicles are what\u0027s going to be ideal for hydrogen. So the bigger and bigger the more profitable we get here, right?\n\nOverall, tank sizes with hydrogen will about double in the case of gasoline, and will quadruple with diesel. This is without accounting for insulation and cooling that you will probably want to use on a hydrogen tank.\n\nThough, I do thank you for showing that a midsized car probably won\u0027t be carrying enough hydrogen to kill you or knock you out. Impair you, maybe if all the hydrogen drained into the cabin, which probably means the car\u0027s not working anymore.\n\n\u003E \n\u003E Final comment, it doesn\u0027t add mass to have a hydrogen vehicle rechargeable via electric outlets, as the vast majority of hydrogen fuel cell designs are reversible - by using a fuel cell you already have a rechargeable vehicle, and you\u0027re being wasteful by not giving it a charging port to be used when hydrogen isn\u0027t available.\n\nMinor objection: It does add mass. The mass of whatever tank you\u0027re storing the water in (as well as the mass of the water you\u0027re storing), unless you intend to reroute water out of a radiator to do this. Though, that\u0027d actually be kind of cool. Having the water that would otherwise be completely waste go to the radiator tank, so that at least some of it gets put to good use. In emergencies, this water could be re-electrolyzed with some electricity from a socket or something, and then used to run the car enough to get it going somewhere.\n\nThinking about it, this is a cool idea, though it does add a bit more complexity to the system."},{"CreatedByName":"Kerso1991","CreatedById":139126,"CreatedDateTime":"2015-04-17T13:44:36Z","Content":"I think you\u0027ll find that hydrogen \u0022fuelled\u0022 cars etc refers to hydrogen fuel cells, not the combustion of hydrogen within an engine. Fuel cells in general(I won\u0027t go into to much detail-you can look it up yourself) produce a electric current alone and NO combustion is involved AT ALL. So, hydrogen cars are just the same as electric cars (in that an electrical current is supplied to electrical motor(s)), just containing it own energy source. So(again), asking whether electric or hydrogen cars are best is jugs like saying which energy source is the cleanest: big-dirty-fossil-fuel-burning-harming-the-environment-inefficient power plants, or nice-clean-efficient-water-outputting hydrogen fuel cells. Hydrogen is also a renewable substance unlike coal, gas etc which is finite."},{"CreatedByName":"NFUN","CreatedById":78715,"CreatedDateTime":"2015-04-17T18:59:37Z","Content":"\u003E \n\u003E I think you\u0027ll find that hydrogen \u0022fuelled\u0022 cars etc refers to hydrogen fuel cells, not the combustion of hydrogen within an engine. Fuel cells in general(I won\u0027t go into to much detail-you can look it up yourself) produce a electric current alone and NO combustion is involved AT ALL. So, hydrogen cars are just the same as electric cars (in that an electrical current is supplied to electrical motor(s)), just containing it own energy source. So(again), asking whether electric or hydrogen cars are best is jugs like saying which energy source is the cleanest: big-dirty-fossil-fuel-burning-harming-the-environment-inefficient power plants, or nice-clean-efficient-water-outputting hydrogen fuel cells. Hydrogen is also a renewable substance unlike coal, gas etc which is finite.\n\nIn order to create the hydrogen, power plants must be used anyways. Fuel cells are just another type of battery, storing the energy used during electrolysis. This isn\u0027t an argument about clean energy, but of safety, efficiency, and *maybe* environmental friendliness in construction.\n\nI do like how you essentially said \u0022study it out\u0022 though. Really builds up your credibility."},{"CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2015-04-19T21:58:41Z","Content":"IMO, the only real advantage hydrogen has is that there\u0027s no need to change your \u0027fuelling habits\u0027. Just as we do now with petrol and diesel, you could drive the car until it\u0027s nearly empty, pull into a filling station, connect a hose and refuel. Otherwise it\u0027s just another type of battery, and not really a very good one.\n\nThe thing is, fuel cells have been around for decades (the Apollo spacecraft used them for power) so why do we not use them already. It\u0027s not like with battery electric where we\u0027re constantly working to improve/ waiting on energy density."},{"CreatedByName":"crazyewok","CreatedById":97592,"CreatedDateTime":"2015-04-20T17:33:59Z","Content":"\u003E \n\u003E Electric 100%.\n\u003E This has been a pet peeve of mine for a while, the idea that everyone complains about them.\n\u003E \n\u003E \u0022Doesn\u0027t matter if your car is electric, when you plug it in, its getting its power from a dirty energy source anyway.\u0022\n\u003E \n\u003E Well yeah, that\u0027s a valid argument, but only in the short-term. I think we can all agree that a \u0022Mr. Fusion\u0022 car engine is a bad idea. Even if we technically could do it, vehicles generating power with volatile energy sources is quite obviously a bad idea. However, what happens when/if fusion power becomes a practical reality? Electric cars will still be able to harness that power.\n\u003E \n\u003E Except for some really extreme discovery, ANY future energy source, no matter how powerful, will probably simply be converted to electricity. Electric cars can tap into that. This is good for the advancement of civilization because electric cars will be able to access the power source no matter what, without any need to make changes to our current infrastructure. No worrying about if the gas station is selling hydrogen, ethanol, gasoline, matter-antimatter particles, etc. Just plug the car into an outlet, and go!\n\nYeah but that\u0027s logic!\n\nEnvironmentalists don\u0027t like people talking logic as its ruined the fun they have moaning and whining of things ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-20T18:38:31Z","Content":"\u003E \n\u003E Yeah but that\u0027s logic!\n\u003E Environmentalists don\u0027t like people talking logic as its ruined the fun they have moaning and whining of things ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)\n\nThat is not logic.. that is lack of information.. Your will find the answer if you keep reading post on this topic. But I guess you wouldnÃ‚Â´t, because you dont wanna find how wrong you are.\n\nEven if your electric source is 50% or 80% carbon. Electric cars will pollute much less than gasoline cars."},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-04-20T18:52:55Z","Content":"A hydrogen cars don\u0027t pollute at all\\*\n\n\\*compared to internal combustion engines"},{"CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2015-04-20T19:39:19Z","Content":"\u003E \n\u003E A hydrogen cars don\u0027t pollute at all\\*\n\u003E \\*compared to internal combustion engines\n\nHydrogen has to be manufactured somewhere, which takes an input of energy. So the \u0027well to wheel\u0027 efficiency is generally worse than battery electric."},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-04-21T00:41:42Z","Content":"The well-to-wheel efficiency is not a fair comparison between hydrogen and electric cars. For equal capacity and range, the hydrogen car will weigh much less, and thus require less energy to begin with - it\u0027s far more likely that they\u0027ll have rather comparable efficiency in terms of transport capability per energy at well, or possibly even favour hydrogen, at least at longer ranges that many people will desire. Electric cars are largely restricted to city people at the moment - hydrogen cars could work for anyone without requiring huge batteries that ruin any chance of being efficient."}]}