{"TopicId":103442,"ForumId":44,"TopicTitle":"How to make KSP boot insanely fast","CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-04-05T12:13:56Z","PageNum":1,"Articles":[{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-04-05T12:13:56Z","Content":"Just found this out, by creating something called a RAM disk you can put KSP in there and use you systems RAM as if it were a hard drive!\n\nKSP load times are about 5-10 seconds and thats with CSS mod and KW rocketry!\n\nNot sure how stable this is, and of course you have to be careful of power cuts. You do need lots of RAM though, I have 8 gigs but more is better!\n\n[https://www.softperfect.com/products/ramdisk/](https://www.softperfect.com/products/ramdisk/)\n\nI use this as its free and appears to work fine."},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2015-04-05T15:48:11Z","Content":"Well it\u0027s good for speeding stuff up, but be careful about it.\n\nIf it does what I think it does, you may end up with lightning-fast KSP but slow everything else. \n\nI\u0027ve solved the problem via SSD. The SATA 6GB/s should solve every of your problems..."},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-04-05T15:48:18Z","Content":"ram drives is an old technology and it works.\n\nIt has some downsides, first you need to load your files into it, it take off total memory and you loose all files on it if you shut down or restart your computer.\n\nYes the ramdisk might load and then write files to HD on start up and shut down but an crash still removes all.\n\nWindows has an pretty good cache system who keep files in free memory and load them on use. This works well enough for most uses.\n\nHowever if you make or tweak mods in ksp an ram disk might be an good idea as you have to start the game a lot of times."},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-04-05T16:32:36Z","Content":"Yeah its useful if your going to be mod testing. Its pretty much useless if you have less than 8 gigs of ram as everything else will be slowed down to a crawl, it also takes seconds to transfer it to the RAM too.\n\nIt may actually improve frames too because its quicker to access game files and if you have a good processor then that can be fed with data faster (probably)\n\n**Edited \u003Ctime datetime=\u00222015-04-05T16:35:37Z\u0022 title=\u002204/05/2015 04:35  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 5, 2015\u003C/time\u003E by montyben101**"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-04-05T17:45:26Z","Content":"What exactly do you do? I\u0027ve added a new disk, labeled it as A:\\ of 4 GB volume, and copied the KSP folder into it. RAM has, as expected, been filled up. When I tried to run the program, it lasted the same time as usual. Not few seconds at all. What am I doing wrong?"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-04-05T18:08:39Z","Content":"Possibly loaded from the original drive, not the ram drive."},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-04-05T18:25:59Z","Content":"You can also do this with an entire operating system, boot from a USB (for example), load the OS into the RAM, and then you can be free to remove the disk."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-05T18:30:18Z","Content":"Generally speaking, RAM disks are almost always a bad idea. Modern OSes are very smart about caching disk contents to RAM, when you allocate RAM to a RAM disk you are essentially saying \u0022I know that the files here are more important to keep in RAM than what the OS thinks\u0022, and any free space on the RAM disk is not able to be put to use by the OS as well. There\u0027s also the penalty of loading all the contents to the RAM disk at each boot, and writing them back out before shutdown (as well as losing any progress if that write out is not completed before power is cut). These reasons are why RAM disks are usually only used on single-purpose, specialized computers (think database server with a high enough load that an SSD array can\u0027t keep up). \n\nFinally, in my experience KSP loading is to a large degree CPU-bound rather than disk-bound; when switching from a hard disk to an SSD on the same machine load times were only reduced by a minimal amount. So my bet is putting KSP in a RAM disk would give minimal benefits while having the downsides listed above."},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2015-04-05T18:41:00Z","Content":"Years back I was doing a reinstall on a computer, and the install disks were creating a ramdrive and assigning it drive letter C. I wasn\u0027t paying attention and installed win 95 or 98 or whatever it was on C: like I always did. Install went blazing fast, and the OS was screaming fast until the first reboot. I think I did the install twice before I realized that C wasn\u0027t fixed disk 0."},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-04-05T19:24:51Z","Content":"\u003E \n\u003E Possibly loaded from the original drive, not the ram drive.\n\nNope, it was loaded from the RAM drive. I\u0027ve monitored the task managed while KSP was loading. At first, RAM is like 5.7 GB and when I start KSP.exe, it starts climbing. 5.8, 5.9, 6, 6.1...\n\nSo it essentially already is in RAM, but then goes: \u0022Oh, I need to load KSP, let\u0027s start loading again. Moar memory, pls!\u0022\n\nIt would be cool if someone can tell me **exactly** what I need to do with this program."},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-04-05T19:54:16Z","Content":"\u003E \n\u003E Nope, it was loaded from the RAM drive. I\u0027ve monitored the task managed while KSP was loading. At first, RAM is like 5.7 GB and when I start KSP.exe, it starts climbing. 5.8, 5.9, 6, 6.1...\n\u003E So it essentially already is in RAM, but then goes: \u0022Oh, I need to load KSP, let\u0027s start loading again. Moar memory, pls!\u0022\n\u003E \n\u003E It would be cool if someone can tell me **exactly** what I need to do with this program.\n\nksp.exe will use its ram independent on the ram drive, the ramdisk memory space uses as much memory as you give it, say 4gb.\n\nGame has to be loaded the same way as normally only its loaded from an drive who is as fast as your memory, in short it would have no disk loading time, however the game still has to do lots of stuff then it starts so if your cpu is slow and perhaps do other stuff too you gain less."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-04-05T22:22:56Z","Content":"The problem with running KSP from a RAMdisk is that it appears to yield very little result. KSP seems to have issues beyond disk I/O.\n\nThat does not mean a RAMdisk can not be useful, just not here."},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-04-06T05:26:03Z","Content":"before ssds took over all the things, there were a few dram based products that would turn old ram sticks into a hard drive. some were battery backed, others backed to flash media like cf cards. they were limited by the speed of the sata bus at the time and i think a modern ssd would blow it out of the water."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-06T13:30:21Z","Content":"Yeah I know ram disk devices since 10 years, you can reduce time, but there is a reason about why almost nobody use it.. You dont get enoght benefics taking into account how expensive they are.\n\nWe have:\n\nCache ram (few megabytes): super fast very expensive for data which needs to be access very frequenty\n\nRam (few gygabytes): fast and expensive for frequenty data access \n\nssd (100gb average): average and average for average data access (we can put the SO here and the most used apps, also the virtual memory file)\n\nHard Disk (Terabyte): slow and cheap, for data we need to load once even a while.\n\nInternet (petabytes): for all the things we are not sure if we will check it some day.\n\nSo in that order, you can have the most cost/effective system, there is not much point to use cache ram as RAM or Ram for uses which does not need to be constant loaded.\n\nAll the computer architecture is designed with that structure in mind, so you can find few bottleneck which does not allow you to take the whole advantage of it.\n\n**Edited \u003Ctime datetime=\u00222015-04-06T13:36:57Z\u0022 title=\u002204/06/2015 01:36  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 6, 2015\u003C/time\u003E by AngelLestat**"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-04-06T14:49:19Z","Content":"\u003E \n\u003E before ssds took over all the things, there were a few dram based products that would turn old ram sticks into a hard drive. some were battery backed, others backed to flash media like cf cards. they were limited by the speed of the sata bus at the time and i think a modern ssd would blow it out of the water.\n\nThis is still an product however now it has probably moved out of your price range. Current use is high performance servers, it uses SSD as backup device and internal battery to store the data ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThink you only get it as rack mounted units."},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-04-06T14:53:49Z","Content":"\u003E \n\u003E Finally, in my experience KSP loading is to a large degree CPU-bound rather than disk-bound; when switching from a hard disk to an SSD on the same machine load times were only reduced by a minimal amount. So my bet is putting KSP in a RAM disk would give minimal benefits while having the downsides listed above.\n\nIn fairness the OP mentioned *boot time* and nothing else. That\u0027s where the ram disk will fly. Of course you will have to copy content TO the ramdrive but modern ramdrive drivers can take care of those little details."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-06T14:59:29Z","Content":"\u0022KSP boot\u0022 in the title, which I interpreted to mean \u0022loading KSP\u0022 as mentioned in the OP main text. I don\u0027t think it\u0027s referring to booting the OS."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-04-06T15:00:39Z","Content":"\u003E \n\u003E Internet (petabytes): for all the things we are not sure if we will check it some day.\n\nI object to listing internet as storage. Internet is a collection of machines with all those forms of memory, but not a form of memory itself. The cloud it not some kind of magical realm, it\u0027s a physical machine made out of many computers. The fact that some companies treat it as external storage does little to detract from the fact that the data is still stored on platters and chips."},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-04-06T15:08:01Z","Content":"i hear they are good for video editing rigs where you need high disk speed or various other professional workstation tasks. i saw some cheapish ones around $200-$300 (ram not included!). i hear you can raid0 ssds as well for more performance, though diminishing returns kicks in and you stop seeing meaningful gains at anything more than 3 disks. doing these kinds of things for a game is kind of crazy and a waste of money. \n\nif you want to do the ram disk thing, just get a rig with 16 or more gigs of ram. do a 4-8gb disk, and have some scripts to copy data to and from it at start up/shutdown (and dont expect any performance other than faster load times)."},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-04-06T15:08:01Z","Content":"\u003E \n\u003E I object to listing internet as storage. Internet is a collection of machines with all those forms of memory, but not a form of memory itself. The cloud it not some kind of magical realm, it\u0027s a physical machine made out of many computers. The fact that some companies treat it as external storage does little to detract from the fact that the data is still stored on platters and chips.\n\nI think perhaps what was intended is that any storage space you access over the internet is going to be limited by your broadband speeds, which is typically substantially lower than local I/O (unless you only use USB 2.0 drives for storage and have gigabit fiber internet...). Sure, it\u0027s stored on physical disks, but you\u0027ll never achieve transfer rates as fast as you would if you had those disks plugged into your computer."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-04-06T15:53:36Z","Content":"\u003E \n\u003E I think perhaps what was intended is that any storage space you access over the internet is going to be limited by your broadband speeds, which is typically substantially lower than local I/O (unless you only use USB 2.0 drives for storage and have gigabit fiber internet...). Sure, it\u0027s stored on physical disks, but you\u0027ll never achieve transfer rates as fast as you would if you had those disks plugged into your computer.\n\nTrue, but it just does not belong in the cache\u003ERAM\u003ESSD/HDD hierarchy. If that is the case, we need to add USB storage and other types too, but none of those are intrinsic parts of a system."},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-04-06T16:49:19Z","Content":"I think its one of those things where it depends on your setup as to how useful it will be"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2015-04-07T07:40:11Z","Content":"Ramdisk doesn\u0027t improve KSP loading time, speaking from someone that have 14 GB RAM. AFAIK there is a program to convert all textures to DXT something before KSP startup to reduce memory consumption and loading time"}]}