{"TopicId":104031,"ForumId":44,"TopicTitle":"What would a Kinetic Orbital Bombardment Strike looks like?","CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-13T09:11:36Z","PageNum":4,"Articles":[{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-29T21:13:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222828317\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477700851\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOh yes, of course. However, those methods are even easier to develop countermeasures for. Bombers? Surface-to-Air Missiles. Missiles? Harder to take out than a bomber, but technically still possible, depending on how much time you have before it hits and the type of missile. Rods from God? Nothing short of destroying the deployment satellite before it deploys (or while it\u0027s deploying), if there even is one (the rods could be satellites all to themselves, deployed in a constellation, not to mention the possibility of countering anti-satellite weapons). Destroying a satellite has varying levels of difficulty as well. There are probably some situations where rods from god would be useful in the real world. But they are still very, very, expensive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nModern warfare tends to be profoundly asymmetrical. The people being bombed tend to have no countermeasures to bombers. The benefit of orbital bombardment would require the results to be qualitatively different (say a \u0022bunker buster\u0022 capability outside the abilities of bombs), IMO. That or politically different (if you could send something such that you could pretend it was just a meteor impact (plausible deniability \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E )).\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-10-30T19:37:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222829450\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477775596\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nModern warfare tends to be profoundly asymmetrical. The people being bombed tend to have no countermeasures to bombers. The benefit of orbital bombardment would require the results to be qualitatively different (say a \u0022bunker buster\u0022 capability outside the abilities of bombs), IMO. That or politically different (if you could send something such that you could pretend it was just a meteor impact (plausible deniability \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E )).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot only that, but usually the side doing the bombing has air superiority. Also, war isn\u0027t going to be asymmetrical forever.\n\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2016-10-31T04:45:03Z","Content":"\n\u003Cp\u003E\nYeah, the world\u0027s superpower, aspiring superpowers, and well-developed nations will nonetheless plan and invest for the possibility of a war against an equal or superior enemy.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the most recent such war, the Falklands conflict, one drawback of bombers was exposed - their limited range. It took multiple tankers and tanker-to-tanker refuelling just to get one or two Vulcan bombers per run from the nearest UK air base to strike the Falklands. Even an extensive network of overseas air bases cannot put everywhere within easy range of bombers, while aircraft carriers are expensive and relatively slow to reach a destination. An orbital bombardment satellite can strike anywhere in the world by itself on fairly short notice, though whether such a satellite would ever be cheaper than an aircraft carrier is an open question.\n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2016-10-31T07:49:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222831327\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477889103\u0022 data-ipsquote-userid=\u0022104935\u0022 data-ipsquote-username=\u0022cantab\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, cantab said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah, the world\u0027s superpower, aspiring superpowers, and well-developed nations will nonetheless plan and invest for the possibility of a war against an equal or superior enemy.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the most recent such war, the Falklands conflict, one drawback of bombers was exposed - their limited range. It took multiple tankers and tanker-to-tanker refuelling just to get one or two Vulcan bombers per run from the nearest UK air base to strike the Falklands. Even an extensive network of overseas air bases cannot put everywhere within easy range of bombers, while aircraft carriers are expensive and relatively slow to reach a destination. An orbital bombardment satellite can strike anywhere in the world by itself on fairly short notice, though whether such a satellite would ever be cheaper than an aircraft carrier is an open question.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe Falklands/Malvinas War was fought more than 30 years ago. It\u0027s almost as far back in time to then as that war goes back in time to WW2. Things have changed since then.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, Great Britain was not a \u0022superpower\u0022, and Argentina was pretty far from it.\n\u003C/p\u003E\n\u003Cp\u003E\nBut even considering that, this line of discussion is just way off base. The US could have launched a kinetic system long ago if they really wanted to. But they don\u0027t, because it is simply way too expensive compared to something like a conventional precision-guided bomb or even a cruise missile. There is no need to stick some \u0022rods from god\u0022 up in orbit when you can have some much cheaper weapons mounted in a stealthed drone that can loiter over an area for days.\n\u003C/p\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-10-31T09:37:53Z","Content":"\n\u003Cp\u003E\nA very significant reason why nobody has deployed a \u0022rods from god\u0022 system is that it is destabilising, politically. In the same way that project pluto was destabilising. Building what is effectively a superweapon, tends (and rightly so) to make every other country on Earth just a little nervous, and pushes fingers a few millimetres closer to those big red buttons. \n\u003C/p\u003E\n\u003Cp\u003E\nThe US would *love* a rods-from-god system, their military\u0027s dream is a \u0022prompt global strike\u0022 ie: the ability to put a decent size (conventional) warhead anywhere on the planet within 24 hours, and rods from god might well be the *cheapest* way of doing it, since the technology is essentially off-the-shelf.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, the US are instead spending far more so that they can try and find a way to effect this goal without it having to look like an ICBM at launch or having weapons floating around in space - both of which are very politically undesirable situations.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-10-31T21:34:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222831511\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477906673\u0022 data-ipsquote-userid=\u002274091\u0022 data-ipsquote-username=\u0022p1t1o\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, p1t1o said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA very significant reason why nobody has deployed a \u0022rods from god\u0022 system is that it is destabilising, politically. In the same way that project pluto was destabilising. Building what is effectively a superweapon, tends (and rightly so) to make every other country on Earth just a little nervous, and pushes fingers a few millimetres closer to those big red buttons. \n\u003C/p\u003E\n\u003Cp\u003E\nThe US would *love* a rods-from-god system, their military\u0027s dream is a \u0022prompt global strike\u0022 ie: the ability to put a decent size (conventional) warhead anywhere on the planet within 24 hours, and rods from god might well be the *cheapest* way of doing it, since the technology is essentially off-the-shelf.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, the US are instead spending far more so that they can try and find a way to effect this goal without it having to look like an ICBM at launch or having weapons floating around in space - both of which are very politically undesirable situations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDeorbiting over an random coordinate might well be \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E expensive, an heavy bomber can reach everywhere within 24 hours, far less if you have bases. \u003Cbr\u003E\nNow add that most places you want to strike is in conflict areas so you arrange for bases nearby. \u003Cbr\u003E\u003Cbr\u003E\nOne destabilizing issue with an orbital speed smart penetrator is that it might be able to take out hardened missile silos. This require lots of them in an configuration who let them hit at once. \n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-10-31T22:17:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222831431\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477900163\u0022 data-ipsquote-userid=\u0022137807\u0022 data-ipsquote-username=\u0022mikegarrison\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, mikegarrison said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Falklands/Malvinas War was fought more than 30 years ago. It\u0027s almost as far back in time to then as that war goes back in time to WW2. Things have changed since then.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, Great Britain was not a \u0022superpower\u0022, and Argentina was pretty far from it.\n\u003C/p\u003E\n\u003Cp\u003E\nBut even considering that, this line of discussion is just way off base. The US could have launched a kinetic system long ago if they really wanted to. But they don\u0027t, because it is simply way too expensive compared to something like a conventional precision-guided bomb or even a cruise missile. There is no need to stick some \u0022rods from god\u0022 up in orbit when you can have some much cheaper weapons mounted in a stealthed drone that can loiter over an area for days.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRods from God were considered as weapons long before drones of the modern type existed. You are correct that the big issue is cost. It\u0027s just too much for what little it gives you. And it\u0027s only useful if you can ensure accuracy, which is not the easiest thing to do. You need to know where the enemy is first, after all. With bombers, you can do much more. But they are easier to shoot down.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-31T23:53:48Z","Content":"\n\u003Cp\u003E\nWhat you\u0027d really want is a nuke level event with such a weapon. All the destruction, none of the fallout. That\u0027s a lot of \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E, though.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-11-01T02:59:41Z","Content":"\n\u003Cp\u003E\nTargets number - the same. Delta-V to reach the orbit - the same. Mass: rod is several times heavier than a low-yield nuke.\u003Cbr\u003E\nSo, a comparable efficency would require launching 10 000 t of tungsten instead of hundreds tons of nukes.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-01T02:59:48Z\u0022 title=\u002211/01/2016 02:59  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 1, 2016\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T10:05:48Z","Content":"\n\u003Cp\u003E\nAsymmetric warfare is not an inherent part of modern warfare.  We live in a long peace that has existed since the end of World War Two.  To be sure there are many ongoing conflicts, but the fraction of global population lost to warfare each year is much lower than what was seen in previous centuries.\n\u003C/p\u003E\n\u003Cp\u003E\nWith regard to shockwaves above and below the surface, there is a lot of declassified material regarding this available on the internet.  It would not be like the movies.\n\u003C/p\u003E\n\u003Cp\u003E\nWith regard to orbital bombardment in general, the math is simple.  Let\u0027s run the numbers for a telephone-pole sized piece of steel impacting at 10km/s.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T10:17:02Z","Content":"\n\u003Cp\u003E\nSteel has a density of 8t per cubic meter.  A .5r by 10m h telephone pole is roughly 8 cubic meters of steel or 64 tons.  This is about as heavy as any feasible impact device would be with current or foreseeable technology.  Heavier impact devices are possible but require much more complex systems.\n\u003C/p\u003E\n\u003Cp\u003E\nanyway 64000kg at 10000m/s will yield 3.2 e10^12 joules.  Each ton of TNT has 4.2 e10^9 joules of energy.  So you are looking at something in the kilotons of yield.  Airbursting a steel telephone pole is doable, but difficult, so this would be an effective bunker buster to remove another nations nuclear stockpile or ICBM silos, but not for airbursting over troops or cities.\n\u003C/p\u003E\n\u003Cp\u003E\nIf one wanted to wipe out Three Gorges Dam or Cheyenne Mountain, this may be a better way to go than a high yield, nuclear ground burst.  In reality, smaller flechettes are more useful.  These things due to mass and perhaps a light-reflecting coating would be impervious to current and foreseeable ABM tech.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022But Goat, iron meteorites fall to earth all the time without leveling cities!  Surely these iron telephone poles can\u0027t be that destructive!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIron meteors entering our atmosphere rapidly find themselves melting at their leading edge stagnation points, tumbling and eventually disintegrating.  An iron-tungsten or DU impact or that had a ceramic leading edge or an an ablative coating would retain its mass.  \n\u003C/p\u003E\n\u003Cp\u003E\nThe weak point for this system would be time of flight.  While the projectiles aren\u0027t susceptible to ABM, the platform would be highly susceptible to ASAT/ABM.  So higher orbits would provide more energy and time to react, but long time of flight (hours or days) one you rifle your orbital weapon.  In that time, targets and inventories can be moved.  Energy dissipating paint is visible and iron is radar reflective, so there would be a fair bit of warning from an impending strike.  \n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps these factors make the weapon system more useful for retaliation than deterrence?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, in the movies these types of this strike out of the blue.  Moscow, Beijing, Washington or Brussels would have time to evacuate targets and coordinate retaliation before these things land.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, this is the reason why smaller flechettes have more tactical and strategic applications.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-03T13:34:59Z\u0022 title=\u002211/03/2016 01:34  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 3, 2016\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T13:39:46Z","Content":"\n\u003Cp\u003E\nAnother thought on airbursting a steel projectile falling from high orbit:  Iron meteors do this all the time due to ridiculous thermal gradient within the projectile.  Adjusting the ceramic coating around the vehicle and modifying the reentry profile could get a somewhat reliable air burst.\n\u003C/p\u003E\n\u003Cp\u003E\nThe more I consider the practicality of orbital weapons, the more I appreciate the \u0022good\u0022 facets of nuclear weapons.  Radioactive fallout and the fear of it, warranted or otherwise, is a deterrent for any nation to engage in even limited nuclear war.  Even aristocracy and the wealthy have to deal with cancer, birth defects, etc..  While air bursting nukes only creates a small amount of long term radioactive fallout, the fear of this still limits their use.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ability to use orbital flechettes to achieve similar destruction without the the fallout risk to politicians and elites makes mankind more prone to use these devices.\n\u003C/p\u003E\n\u003Cp\u003E\n Moreover the technology to do this is already here and within the capability of many nations and some Silicon Valley billionaires.  Obviously we are not talking 64ton impactors, but a 7 ton impact or at similar at similar speed would be devastating.\n\u003C/p\u003E\n\u003Cp\u003E\nAside from massive retaliation, there are few reasons not to use these things.  You can see the prescience of or fathers in signing the Outer Space Treaty.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-03T13:40:01Z\u0022 title=\u002211/03/2016 01:40  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 3, 2016\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-11-03T15:52:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222836408\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478180386\u0022 data-ipsquote-userid=\u0022168077\u0022 data-ipsquote-username=\u0022Jonfliesgoats\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Jonfliesgoats said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnother thought on airbursting a steel projectile falling from high orbit:  Iron meteors do this all the time due to ridiculous thermal gradient within the projectile.  Adjusting the ceramic coating around the vehicle and modifying the reentry profile could get a somewhat reliable air burst.\n\u003C/p\u003E\n\u003Cp\u003E\nThe more I consider the practicality of orbital weapons, the more I appreciate the \u0022good\u0022 facets of nuclear weapons.  Radioactive fallout and the fear of it, warranted or otherwise, is a deterrent for any nation to engage in even limited nuclear war.  Even aristocracy and the wealthy have to deal with cancer, birth defects, etc..  While air bursting nukes only creates a small amount of long term radioactive fallout, the fear of this still limits their use.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ability to use orbital flechettes to achieve similar destruction without the the fallout risk to politicians and elites makes mankind more prone to use these devices.\n\u003C/p\u003E\n\u003Cp\u003E\n Moreover the technology to do this is already here and within the capability of many nations and some Silicon Valley billionaires.  Obviously we are not talking 64ton impactors, but a 7 ton impact or at similar at similar speed would be devastating.\n\u003C/p\u003E\n\u003Cp\u003E\nAside from massive retaliation, there are few reasons not to use these things.  You can see the prescience of or fathers in signing the Outer Space Treaty.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes fallout is probably an blocker, on the other hand the fear of fallout was less in the 1950\u0027s and the Korea war was probably the war it was most relevant to use it. In later wars it would be less relevant. WW2 mass bombardment is also very rare after the Vietnam war. \u003Cbr\u003E\u003Cbr\u003E\nOrbital flechettes has some weaknesses, if they are fleche sized they would burn up / slow down too much to be practical. \u003Cbr\u003E\nflechettes is mostly released from an artillery shell or rocket some distance ahead of target I guess 100-300 meter. \u003Cbr\u003E\nGoing supersonic would make release harder too. \u003Cbr\u003E\u003Cbr\u003E\nNow if you go larger, you have an good perpetrator but you need an good guidance system. \u003Cbr\u003E\nPlasma effects would make it hard to adjust trajectory during reentry. \u003Cbr\u003E\nClosest to this today is the Chinese ballistic anti ship missile. An IRBM with an conversational warhead and terminal guidance mostly for going after ships. \u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T16:34:12Z","Content":"\n\u003Cp\u003E\nWhen I discuss flechettes, I am talking about relatively heavy things rather than the metal arrows experimented with in WW1 or in artillery.  I suppose the smallest device would be in the .5 ton range for mass.  A big flechette?  I am not sure what word really describes a 500-10000kg doomsday lawn-dart.\n\u003C/p\u003E\n\u003Cp\u003E\nI agree about plasma effects, but I wonder if there is a way around this.  I suspect there is.  RF is going to have trouble penetrating any layer of ionization, but layers of plasma don\u0027t block all frequencies on the EM spectrum equally.  A relay of sufficient power at sufficiently high energy could, theoretically, provide terminal guidance to our projectile. Of course, the feasibility of this is dubious, but who\u0027s to say what the future holds?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStrategy and Strategic Bombardment: I agree, and I foam at the mouth! \n\u003C/p\u003E\n\u003Cp\u003E\nI deleted my rant about the uselessness of strategic bombardment and my experience in various capacities.  \n\u003C/p\u003E\n\u003Cp\u003E\nI have another long-wined rant about airlifts and relief operations too, but I\u0027ll spare your eyes.\n\u003C/p\u003E\n\u003Cp\u003E\nStrangely, I think the air superiority fighter and space superiority vehicle, along with the submarine, have and will do more for strategic balance of power than anything.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-03T16:56:21Z\u0022 title=\u002211/03/2016 04:56  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 3, 2016\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003Cbr\u003EDeleted a rant\n\u003C/span\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T16:57:37Z","Content":"\n\u003Cp\u003E\nI am still wondering what could provide terminal guidance or any communication to a veihcle enveloped by plasma.  Could the right type of laser do it?\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-11-03T17:31:39Z","Content":"\n\u003Cp\u003E\nStrategic bombardment (WW2) was largely ineffective due to the inability to hit targets. If every 500b GP bomb dropped by a B-17 or B-24 had landed within a few meters of specifically designated targets (not just \u0022factory X,\u0022 but each bomb aimed at specific elements, uniquely), then such bombing would have likely been very effective indeed.\n\u003C/p\u003E\n\u003Cp\u003E\n The sort of area bombing utilized vs Japan (and to a lesser extent, Germany by Bomber Command) is another story, and more applicable to some forms of orbital bombardment. Not \u0022extinction level\u0022 bombardment, but perhaps \u003Cem\u003Elocal\u003C/em\u003E extinction level bombardment. Ie: hitting someone with something akin to a small asteroid. The largest possible effect that contains the bulk of effects within countries that are not a problem. Ie, you hit country A, and perhaps B and C have some minor effects since they are nearby, but country D that is a major power is totally unaffected.\n\u003C/p\u003E\n\u003Cp\u003E\nExample targets would basically be places that you wish to no longer exist. At all. The sort of thing you could do with a nuke, but that has all the baggage of a nuke. Same sort of counter-value targeting, however. This is entirely legitimate for certain targets, IMO (IS leaps to mind).\n\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2016-11-03T17:47:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222836703\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478192257\u0022 data-ipsquote-userid=\u0022168077\u0022 data-ipsquote-username=\u0022Jonfliesgoats\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, Jonfliesgoats said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am still wondering what could provide terminal guidance or any communication to a veihcle enveloped by plasma.  Could the right type of laser do it?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think the projectile would be obscured by plasma all the way, would it? So have the projectile rely on inertial guidance or even no guidance at all during the \u0022blind zone\u0022, then activate a more capable system once sight and communication is restored.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222836772\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478194299\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExample targets would basically be places that you wish to no longer exist. At all. The sort of thing you could do with a nuke, but that has all the baggage of a nuke. Same sort of counter-value targeting, however. This is entirely legitimate for certain targets, IMO (IS leaps to mind).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGetting into how ISIS should be fought will be considered too political for the forum, but how it \u003Cem\u003Eis\u003C/em\u003E being fought by the USA and its allies is definitely not by levelling the entire cities they operate in.\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T17:52:48Z","Content":"\n\u003Cdiv title=\u0022Page 16\u0022\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cp\u003E\nFixed targets would still be doable with INS.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nFor manned capsules, there is a period of maximum aerodynsmic pressure which also corresponds to maximum heating and maximum ionization.  When you run the numbers for high angles, say 45, the reentry vehicle continues to accelerate all the way to the surface and generates tremendous heat and ionization.  It never slows down.\n\u003C/p\u003E\n\u003Cp\u003E\nCheck out formulae 4.1.7-7 and 4.1.7-8.  \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.faa.gov/other_visit/aviation_industry/designees_delegations/designee_types/ame/media/Section%20III.4.1.7%20Returning%20from%20Space.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.faa.gov/other_visit/aviation_industry/designees_delegations/designee_types/ame/media/Section III.4.1.7 Returning from Space.pdf\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-03T17:55:10Z\u0022 title=\u002211/03/2016 05:55  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 3, 2016\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-11-03T18:00:33Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/104935-cantab/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022104935\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/104935-cantab/\u0022 rel=\u0022\u0022\u003E@cantab\u003C/a\u003E No, but that is certainly a \u003Cem\u003Epossible\u003C/em\u003E way, given their attitudes regarding indoctrination children (basically tainting the place as long as anyone so indoctrinated remains), and the fact that such attacks would clearly deny them the second bit of the name---State. Anyplace they try and run as a state ceases to exist. Seems like it would suck the air out of the movement, and be a powerful disincentive to coming under their control. The CCCP had a similar attitude in terms of the \u0022no step backwards\u0022 defense of some areas in WW2.\n\u003C/p\u003E\n\u003Cp\u003E\nThe nature of orbital bombardment in general implies this sort of discussion, IMO. It\u0027s like discussing nuclear weapons. \u003Cem\u003EAll\u003C/em\u003E nations with the latter have some or all of their forces arrayed against \u0022counter value\u0022 targets. For the unaware, that means population centers. The benefit of rocks (or whatever we deorbit) is that we avoid radiation. That\u0027s about it. The fact that the cost is so very high means it\u0027s not going to happen---or that the only targets that are viable are ones where the cost is considered worth it. Nukes would be cheaper... but the geopolitical costs are effectively infinite, so they are not on the table. That makes even a ridiculously expensive orbital attack look \u003Cem\u003Ebetter\u003C/em\u003E cost wise, but only for nuke-level targets.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-03T18:01:10Z\u0022 title=\u002211/03/2016 06:01  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 3, 2016\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T18:17:49Z","Content":"\n\u003Cp\u003E\nBlowhard Mode: Engage!\n\u003C/p\u003E\n\u003Cp\u003E\nDaylight Strategic bombardment in WW2 was limited by targeting.  We had the Norden bombsight and we\u0027re lucky if one in ten bombs was within 100m of target.  At night, entire population centers were targeted on both continents.\n\u003C/p\u003E\n\u003Cp\u003E\nTo be sure the Eighth Air Firce leveled Axis factories.  Still fighter production increased.  Production was decentralized.  Despite repeated raids on synthetic fuel plants and oil fields, fuel production continued.  Freeing escort fighters to strafe and attack trains and convoys during return legs did a lot to hamper the distribution of required resources.  One can argue, did a lot more to cripple axis war efforts than the actual bombing campaigns.  \n\u003C/p\u003E\n\u003Cp\u003E\nIn Japan and Europe large fire bombing raids of Tokyo, Dresden and other places did not bring Axis powers to the negotiating table.  Even after two nuclear attacks, the surrender of Japan was not assured and may not have happened at all without a Soviet invasion of Manchuria.\n\u003C/p\u003E\n\u003Cp\u003E\nWould we have been better off with those aircraft and crews dedicated to anti submarine roles in the North Atlantic?  Close air support was certainly valuable.\n\u003C/p\u003E\n\u003Cp\u003E\nHeavy bombers failed to do the trick in Korea, due to political considerations and close air support again is where air power really showed its value.\n\u003C/p\u003E\n\u003Cp\u003E\nIn Vietnam, during Linebackers 1 and 2, Rolling Thunder, etc. strategic bombardment failed.  We kept resorting to regular infantry in Vietnam and irregular forces in other parts of Indochina.  We were trying to stop men pushing bicycles through mud with supersonic jets.  Wrong tool for the job!\n\u003C/p\u003E\n\u003Cp\u003E\nAs recently as our bombing campaigns in Serbia, we saw that you can\u0027t break a resistance through air power alone.  We keep trying and failing to win through bombing campaigns because doing so is politically expedient.  We can sell a cheap war to our people where only a handful of people are at risk of bleeding.  The reality is that winning any fight is damned bloody business.  \n\u003C/p\u003E\n\u003Cp\u003E\nI believe in aerospace and have committed my professional life to aerospace in one form or another for decades.  Victory is impossible without air dominance.  However, air dominance in and of itself doesn\u0027t win wars.  As long as we pretend we can fight on the cheap and clean by relying on gizmos, we will keep losing to illiterate rice farmers and goatherds.\n\u003C/p\u003E\n\u003Cp\u003E\nI sincerely hope I am wrong about my deductions.  If strategic bombing works/ed, it means a lot of lives and a lot of my time hasn\u0027t been wasted.  Can you think of examples of successful strategic bombing?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-03T18:31:56Z\u0022 title=\u002211/03/2016 06:31  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 3, 2016\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T18:30:01Z","Content":"\n\u003Cp\u003E\nOn a separate note, 84kg of reentry mass equals one ton of TNT.  So something the size of your leg could level a large building.  \n\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2016-11-03T18:30:15Z","Content":"\n\u003Cp\u003E\nInertial guidance has relatively low precision though. A JDAM bomb has a Circular Error Probably of 30 m with inertial guidance, meaning a 50:50 chance of landing closer or further to the target. And that\u0027s with a mere couple of minutes free fall time, a longer flight time worsens the error.\n\u003C/p\u003E\n\u003Cp\u003E\nRegarding cost, I wonder if a kinetic bombardment platform would necessarily be *that* expensive really. High estimates for the cost of the SLS rocket are $35 billion, let\u0027s attribute that full cost to launching the Doomsat and wild-guess developing the satellite itself costs the same kind of money. So $70 billion total or thereabouts. That\u0027s a lot by the standards of normal people, it\u0027s even a lot by the standards of NASA spaceflight or to the world\u0027s wealthiest people. But the US military spends $600 billion *a year*, and expects to spend $1500 billion on the F-35 fighter over its lifetime (OK, to 2070, but still). By military spending standards, kinetic bombardment doesn\u0027t look so expensive after all, especially if you can make a program out of it with multiple sats each capable of multiple strikes.\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T18:34:44Z","Content":"\n\u003Cp\u003E\nLaunch would be expensive, but your kinetic platform never has to land, refuel change crews, etc.. Kinetic actually means something with regard to weapons employment, so going kinetic with a kinetic platform may actually be cost effective.\n\u003C/p\u003E\n\u003Cp\u003E\nThe question as Tater mentions, is whether or not it\u0027s an effective deterrent.  \n\u003C/p\u003E\n\u003Cp\u003E\nI can definitely see its value as a conventional bunker-busting system.\n\u003C/p\u003E\n\u003Cp\u003E\nI am a technician and not an historian.  This is a decent summary of strategic bombing that is open source.  My view of bombing is pessimistic.  Tater\u0027s is more in line with the experts in that they suggest better targeting may have let strategic bombing bring about an end to a given conflict.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonal experiencempaysna role as well.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.militaryhistoryonline.com/wwii/articles/failurestratbombing.aspx\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.militaryhistoryonline.com/wwii/articles/failurestratbombing.aspx\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-11-03T18:44:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222836772\u0022 data-ipsquote-contentid=\u0022104031\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478194299\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n55 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStrategic bombardment (WW2) was largely ineffective due to the inability to hit targets. If every 500b GP bomb dropped by a B-17 or B-24 had landed within a few meters of specifically designated targets (not just \u0022factory X,\u0022 but each bomb aimed at specific elements, uniquely), then such bombing would have likely been very effective indeed.\n\u003C/p\u003E\n\u003Cp\u003E\n The sort of area bombing utilized vs Japan (and to a lesser extent, Germany by Bomber Command) is another story, and more applicable to some forms of orbital bombardment. Not \u0022extinction level\u0022 bombardment, but perhaps \u003Cem\u003Elocal\u003C/em\u003E extinction level bombardment. Ie: hitting someone with something akin to a small asteroid. The largest possible effect that contains the bulk of effects within countries that are not a problem. Ie, you hit country A, and perhaps B and C have some minor effects since they are nearby, but country D that is a major power is totally unaffected.\n\u003C/p\u003E\n\u003Cp\u003E\nExample targets would basically be places that you wish to no longer exist. At all. The sort of thing you could do with a nuke, but that has all the baggage of a nuke. Same sort of counter-value targeting, however. This is entirely legitimate for certain targets, IMO (IS leaps to mind).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, with precision guided weapons its easy to destroy key target unless deep underground or hidden. \u003Cbr\u003E\nThis also applies tactical, hit command centers, artillery and supplies then all the way down to machine-gun positions and the rest become much easier. \u003Cbr\u003E\nHowever tactical its easier and cheaper to use planes or artillery. \u003Cbr\u003E\nFor the US area effect has become an special case regarding bombardment, common as you need to hit trenches, supply dumps, vehicle parks even enemies in the open but default is more and more becoming point attack. Others will follow here. \u003Cbr\u003E\u003Cbr\u003E\nThe large scale city bombings was more like nuclear strikes, fortunately rare today. Cities will still be wrecked if you fight over them but this is more tactical as you fight over every house with heavy weapons. \u003Cbr\u003E\nNot something you would use orbital bombardment for. \u003Cbr\u003E\u003Cbr\u003E\nSee two uses, main is deep buried target, here an telephone pole long rod perpetrator will goo far down. Second is rapid strikes on target of opportunity \n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-11-03T18:54:46Z","Content":"\n\u003Cp\u003E\nHow fast can you deorbit something accurately?  If you launch your penetrator, it would take, like half an hour, to reach its target right?\n\u003C/p\u003E\n\u003Cp\u003E\nSo this could be great for hitting a cruising ship, airplane, etc. over water.  I can\u0027t see it being used for anything in a high CDE area.\n\u003C/p\u003E\n\u003Cp\u003E\nWould it be possible to make stealthy penetrators?  The right geometry and ceramics are theoretically doable.  If you can bypass early warning radar, resolution on IR systems is poor.  You could deorbit a number of leg-sized penetrators to collapse cave complexes, submarine oens and revetments in one foul swoop one could stop, say, an invasion across the strait of Formosa before millions of people die.\n\u003C/p\u003E\n\u003Cp\u003E\nStealthy orbital strikes could actually save few, perhaps?\n\u003C/p\u003E\n\u003Cp\u003E\nINS accuracy: deoends on some other things too.  Ideally some sort of additional terminal guidance could be provided.\n\u003C/p\u003E\n\u003Cp\u003E\nBeyond plasma, if anyone knows to look for your targeting info, they have an early warning.  So without breaking any cryptology, a sudden increase in data burst transmissions, laser data links (there is always some scatter) etc would tip off an adversary.\n\u003C/p\u003E\n\u003Cp\u003E\nA scary revelation from 1991 was that the CCCP was monitoring commodity prices as an indicator of a first strike by the West.  Had the price of blood suddenly gone up, a bunch of Soviet sleeper agents would have gone tearing around Europe and the US murdering pilots in their sleep.\n\u003C/p\u003E\n\u003Cp\u003E\nThe world is and always has been strange.  This is why we need more expeditionary weirdos with calculators.\n\u003C/p\u003E\n"}]}