{"TopicId":106319,"ForumId":44,"TopicTitle":"Possible alternative to cryogenics?","CreatedByName":"Branjoman","CreatedById":123426,"CreatedDateTime":"2015-04-30T17:00:27Z","PageNum":1,"Articles":[{"CreatedByName":"Branjoman","CreatedById":123426,"CreatedDateTime":"2015-04-30T17:00:27Z","Content":"This idea actually started from a minecraft mod called Applied Energistics. In it is a concept called \u0027Spatial IO\u0027 wherein you basically capture space and stuff it into a hard drive. One funny thing you can do is capture a person who happens to be inside the spatial cage. This got me wondering...if you had a hard drive or solid state drive large enough, could you suspend a human being in it? Would they survive at all?"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2015-04-30T17:05:00Z","Content":"No you could not, and no they would not survive."},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-04-30T17:11:09Z","Content":"Are you meaning, converting a person to some digital state and reproducing them after some time? That seems possible, but very science fiction at this time (not that cryosleep is not still, too).\n\nIf you are meaning more literally how the Minecraft mod seems to do it, then, no. Not with just a hardrive. You would need some very fantastic tools to do it in the first place. I disagree that they would not survive, though. More likely you would push the button (or whatever), and they would be unaffected."},{"CreatedByName":"jerdrb","CreatedById":141908,"CreatedDateTime":"2015-04-30T17:41:56Z","Content":"Here\u0027s a rebuttal question for you. If we clone you, is the clone actually you? Yes it is exactly your dna, and if we save the brain synapsis and all the signals at that instant it may you. But does the you that is typing on your computer to write the original quest actually exist as that clone? No. At the instant you make that clone, it is someone different. Identically at the very instant made, but changing based on experiences that are different from you, since it is not in the same location. So \u0022saving\u0022 someone onto a hard drive might be feasible as soon as we clone someone and are able to make completely synthesized human DNA. But never will you be able to save the me that is typing this message, and have me come back from a drive."},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2015-04-30T18:52:19Z","Content":"Translation: \u0022If we had magic, could we do magic?\u0022\n\nStoring matter in a hard drive doesn\u0027t even make sense. That\u0027s not how they work."},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2015-04-30T19:18:42Z","Content":"\u003E \n\u003E Translation: \u0022If we had magic, could we do magic?\u0022\n\u003E Storing matter in a hard drive doesn\u0027t even make sense. That\u0027s not how they work.\n\nWell, you could maybe store quantum states and everything, and just \u0022reapply\u0022 it to matter later. Still sounds not like a tech that will ever have a use, but might theoretically be possible. It\u0027s actually close to Star Trek\u0027s beaming (which also can be used as storage in-series)."},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-04-30T20:37:57Z","Content":"Change your title to cryonics cause this is not cryogenics."},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2015-04-30T21:35:34Z","Content":"\u003E \n\u003E If we clone you, is the clone actually you?\n\nYears ago I read a book in which a protagonist answers exactly this question, and I like his answer very much.\n\nThe answer was: \u0022Yes, he is me, but I\u0027m not him\u0022."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-04-30T21:46:59Z","Content":"\u003E \n\u003E Here\u0027s a rebuttal question for you. If we clone you, is the clone actually you?\n\nHere is another question:\n\nAre you the same you from 5 years ago?\n\nAll of your atoms except a few have been replaced since then. You have had new experiences. You have matured. Is your older self you?\n\nIf yes, then a clone is you as well. Because your atoms get exchanged throughout your lifetime, and as such a clone having different atoms of the same elements doesn\u0027t make him \u0022not you.\u0022 However, when his experiences start to differ with yours, then he is no longer you.\n\nTo answer the OP:\n\nThis is a bit Fi-Sci (Fictional Science) at this point in time... While interesting, it\u0027s just not as practical as incited hibernation or cryonics.\n\n- - - Updated - - -\n\n\u003E \n\u003E Translation: \u0022If we had magic, could we do magic?\u0022\n\u003E Storing matter in a hard drive doesn\u0027t even make sense. That\u0027s not how they work.\n\nAh, but any technology sufficiently advanced is indistinguishable from magic."},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-04-30T21:48:31Z","Content":"\u003E \n\u003E Here\u0027s a rebuttal question for you. If we clone you, is the clone actually you? Yes it is exactly your dna, and if we save the brain synapsis and all the signals at that instant it may you. But does the you that is typing on your computer to write the original quest actually exist as that clone? No. At the instant you make that clone, it is someone different. Identically at the very instant made, but changing based on experiences that are different from you, since it is not in the same location. So \u0022saving\u0022 someone onto a hard drive might be feasible as soon as we clone someone and are able to make completely synthesized human DNA. But never will you be able to save the me that is typing this message, and have me come back from a drive.\n\nThat\u0027s not how cloning works. What you\u0027re describing is a replication from Star Trek.\n\nCloning produces a zygote. You don\u0027t get an adult human being. And no, it\u0027s not the same person. It\u0027s a new special person with some similar mental potentials, that\u0027s it."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-04-30T21:54:01Z","Content":"\u003E \n\u003E That\u0027s not how cloning works. What you\u0027re describing is a replication from Star Trek.\n\u003E Cloning produces a zygote. You don\u0027t get an adult human being. And no, it\u0027s not the same person. It\u0027s a new special person with some similar mental potentials, that\u0027s it.\n\nWell...\n\nYou could grow the clone in similar conditions that you were, and then \u0022imprint\u0022 your mind onto it. Kind of like that Schwarzenegger movie..."}]}