{"TopicId":109481,"ForumId":44,"TopicTitle":"Proton M 3rd stage explodes, leaving MexSat-1 unusable","CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-05-16T07:39:29Z","PageNum":1,"Articles":[{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-05-16T07:39:29Z","Content":"According to polish radio, Proton M rocket scheduled to launch Mexican telecom satellite from Baikonur crashed 9 minutes after launch. As of now i can\u0027t find any outside confirmation of this, but...yeah. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\n**Edited \u003Ctime datetime=\u00222015-05-17T01:47:59Z\u0022 title=\u002205/17/2015 01:47  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 17, 2015\u003C/time\u003E by B787\\_300**\n  \nremade the title to be more descriptive of what actually happened"},{"CreatedByName":"Lime","CreatedById":137978,"CreatedDateTime":"2015-05-16T07:43:41Z","Content":"Diden\u0027t the third stage explode?"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-05-16T07:46:12Z","Content":"I have no idea. Report was three lines uttered by a bored presenter ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif) Do you have any more information?\n\nEDIT: I found confirmation on media website. Indeed - it was (unspecified as of now) failure of the third stage.\n\n**Edited \u003Ctime datetime=\u00222015-05-16T07:51:48Z\u0022 title=\u002205/16/2015 07:51  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 16, 2015\u003C/time\u003E by Scotius**"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-16T08:48:14Z","Content":"From what I\u0027ve read out of Russian media, third stage engines shut down a minute early, resulting in the stage and payload crashing back to Earth. It fel in unpopulated area. No damage or casualties.\n\nInterestingly, it\u0027s a year, almost to the day, since the last Proton failure."},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2015-05-16T10:58:57Z","Content":"It seems that Russia is reverting back to the 60\u0027s in hardware quality."},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-16T11:32:28Z","Content":"UK has no space program. Does it mean it\u0027s still back in \u002730s?\n\nJokes aside, there were two probable causes in preliminary reports: incorrect assembly and/or 3rd stage steering engines failure."},{"CreatedByName":"Frida Space","CreatedById":60943,"CreatedDateTime":"2015-05-16T11:34:41Z","Content":"Rocket had reached a height of 160 km and crashed 3400 km down range of Baiknour."},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2015-05-16T11:49:25Z","Content":"\u003E \n\u003E UK has no space program. Does it mean it\u0027s still back in \u002730s?\n\u003E Jokes aside, there were two probable causes in preliminary reports: incorrect assembly and/or 3rd stage steering engines failure.\n\nOh sorry, I was talking about the Proton, not your whole country. What I meant was in the 60\u0027s Protons were very unreliable, however from the 70\u0027s-00\u0027s they have become much better but seem to be slipping back for some reason."},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-05-16T11:50:15Z","Content":"Looks similar to the incident last year, except without ending up far enough downrange to cause an international incident."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-16T11:50:55Z","Content":"\u003E \n\u003E UK has no space program. Does it mean it\u0027s still back in \u002730s?\n\nUK is a member to ESA. Besides, Russia is leaning towards \u002760s in far more way than just the technology."},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-16T12:03:39Z","Content":"\u003E \n\u003E What I meant was in the 60\u0027s Protons were very unreliable, however from the 70\u0027s-00\u0027s they have become much better but seem to be slipping back for some reason.\n\nIt certainly looks like that, but I don\u0027t think the reasons are the same. First Protons may have been unreliable because it was still in R\u0026D phase. Proton-M is 15 years old. NPC Khrunichev has a history of freak accidents with unreliable assembly to blame (remember the sensors connected upside-down?).\n\n\u003E \n\u003E Russia is leaning towards \u002760s in far more way than just the technology.\n\nKeep believing in whatever you are believing. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\n**Edited \u003Ctime datetime=\u00222015-05-16T12:08:13Z\u0022 title=\u002205/16/2015 12:08  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 16, 2015\u003C/time\u003E by J.Random**"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-05-16T12:15:24Z","Content":"The previous Proton failures have mostly been on government flights; they buy them nearly at cost and seem to get what they pay for for in terms of quality control. This was an ILS flight, and will heavily erode their cost advantage through increased insurance payments. If this keeps up they could suffer Sealaunch\u0027s fate.\n\n**Edited \u003Ctime datetime=\u00222015-05-16T13:33:28Z\u0022 title=\u002205/16/2015 01:33  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 16, 2015\u003C/time\u003E by Kryten**"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2015-05-16T12:47:36Z","Content":"Did they change something in the hardware in the last years?"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-16T12:51:40Z","Content":"\u003E \n\u003E Did they change something in the hardware in the last years?\n\nNothing substantial in hardware. Just the people.\n\nBy the way, Progress M-26M has also had a malfunction less than 24 hours prior, preventing ISS orbit correction. Hopefully just a glitch, though. These things happen, of course, but the recent string of problems is certainly starting to look like more than a coincidence.\n\n**Edited \u003Ctime datetime=\u00222015-05-16T12:56:35Z\u0022 title=\u002205/16/2015 12:56  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 16, 2015\u003C/time\u003E by K^2**"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-16T13:16:08Z","Content":"\u003E \n\u003E The previous Proton failures have mostly been on government flights; they buy them nearly at cost and seem to get what they pay do for in terms of quality control. This was an ILS flight, and will heavily erode their cost advantage through increased insurance payments. If this keeps up they could suffer Sealaunch\u0027s fate.\n\nProton has to survive 5 more years, give or take. Then there will be Vostochny and Angara. Hopefully."},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-05-16T13:19:16Z","Content":"Yup, there was a lot of russian stuff misshaps recently. \n\nRefurbished NK-33s which lead to antares crash (though it was fairly predictible - even during recent tests several NK-33 failed during static fire tests)\n\nthe problem with Fregat failure on ESA\u0027s galileo launch\n\nprogress M-27M which fell back to earth after, apparently, a soyuz Block I fuel leak \u0026 explosion, \n\nand today, progress M-26M planned ISS reboost which could not be carried out (they\u0027ll consult with nasa, and might retry in 1 week)and the proton-M third stage failure.\n\nGuess nasa will be even more eager to limit dependancy from russian hardware for ISS launches than they are now."},{"CreatedByName":"Frida Space","CreatedById":60943,"CreatedDateTime":"2015-05-16T13:21:36Z","Content":"Rocket reached 160 km of height and crashed approx. 3400 km downrange of Baikonur. Russia has sent a MI-8 helicopter to investigate after reports of explosions and sounds and stuff"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-05-16T13:35:22Z","Content":"\u003E \n\u003E Proton has to survive 5 more years, give or take. Then there will be Vostochny and Angara. Hopefully.\n\nAngara is still Krunichev-any structural issues with the QC system will remain."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-16T13:39:36Z","Content":"There are forest fires in the area. Local authorities suggest that debris from Proton could have caused it, but EMERCOM denies any evidence of this. Treat it as speculation."},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-16T13:41:40Z","Content":"\u003E \n\u003E Angara is still Krunichev-any structural issues with the QC system will remain.\n\nThere\u0027s a difference: sanity checks/self checks before launch. If software feels that something is wrong with the rocket, it scrubs the launch without human intervention. Hopefully, it will greatly reduce the \u0022sensors are upside down\u0022 factor. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-16T13:43:23Z","Content":"\u003E \n\u003E There\u0027s a difference: sanity checks/self checks before launch. If software feels that something is wrong with the rocket, it scrubs the launch without human intervention. Hopefully, it will greatly reduce the \u0022sensors are upside down\u0022 factor. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nIsn\u0027t that basically what Soyuz 2-1 was supposed to do? The one that launched Progress M-27M?\n\nOh, and if Vostochny gets built at all, it\u0027s going to be a miracle. Last I\u0027ve heard, workers were protesting again over not being payed."},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-16T13:57:46Z","Content":"\u003E \n\u003E Oh, and if Vostochny gets built at all, it\u0027s going to be a miracle. Last I\u0027ve heard, workers were protesting again over not being payed.\n\nThat\u0027s what happens when you only listen to bad news. They\u0027re finishing the power station and cooling station at the moment. Railway is almost finished, the final checkup block (kinda VAB-looking building which splits in half) is coming into shape. Launchpad itself should be finished in July. Regarding the payment - management is fixing the issues, slowly but surely (there\u0027s still 10mil unpaid for 100 workers, but money is already wired, not sure why the local management is lagging). Some fatcats are under investigation, which some people may also consider good."},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2015-05-16T14:03:07Z","Content":"\u003E \n\u003E \\*.... Last I\u0027ve heard, workers were protesting again over not being payed.\n\nYou heard wrong. They not protesting about not being payed. They protesting because the work is stopped and they loosing their jobs. Everyone got payed for work he had done the problem is just that the work has stopped.\n\n[http://www.themoscowtimes.com/news/article/workers-at-russian-cosmodrome-protest-conditions-with-rooftop-sos-to-putin/519108.html](http://www.themoscowtimes.com/news/article/workers-at-russian-cosmodrome-protest-conditions-with-rooftop-sos-to-putin/519108.html)\n\nBTW funding is a problem with all major space agencies worldwide.\n\nI have the feeling this thread is getting somewhat political, please stop that bull\\*\\*it."},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-16T14:13:03Z","Content":"No, he heard right, just not the whole story. There were issues with paycheck delays (and significant at that), made possible by a subcontractor\u0027s management (the one who also stopped the work because all the money became yachts and such). There\u0027s an investigation under way, and the payment issues are getting fixed."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-16T14:19:34Z","Content":"Well, I hope it gets resolved. The guys deserve their money, and another space center wouldn\u0027t be a bad thing. Although, I find it a great shame that disputes over Baikonur could not be settled to everyone\u0027s satisfaction."}]}