{"TopicId":111722,"ForumId":44,"TopicTitle":"Falcon Heavy Propellant Crossfeed, and Asparagus Staging","CreatedByName":"Sanguine","CreatedById":114962,"CreatedDateTime":"2015-06-02T10:54:37Z","PageNum":1,"Articles":[{"CreatedByName":"Sanguine","CreatedById":114962,"CreatedDateTime":"2015-06-02T10:54:37Z","Content":"As many of you would be aware, the Falcon 9 Heavy in development by SpaceX has the potential for fuel-crossfeed capability - essentially filling the centre tank from the outside tanks. Of course, they are behind in the times, as the KSP community has already had this fantastic technology for years.\n\nBut in any case, would it be possible to do rudimentary asparagus staging - and if so, would it be better than simply having onion staging? Take for example, a hypothetic Falcon 10, with one central booster and four outside boosters, and it does a simple asparagus stage, where 2 boosters fall off after having exhausted their fuel supply, leaving the 2 boosters on the side feeding into the central tank. Would this be practical, or am I just crazy?"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-06-02T11:24:41Z","Content":"Technically you could do an asparagus staging, with 4 boosters and drop two and two. \n\nThis would require more advanced piping, it would also not be done like KSP piping, but rather having core draw unevenly from the tanks.\n\nMost realistic would be to run crossfeed from first booster set until dry, then switch and draw from second booster set. \n\nIf you feed booster two from booster one it would be an separate pipe.\n\nAll booster has two pipes, booster set 1 has pipe to core and pipe to booster 2, booster set 2 has pipe inn from 1 and out to core.\n\nat launch set 1 feeds core and booster set 2, they are dropped and set 2 now feed core.\n\nKSP fuel lines is symbolic. Imagine you have multiple drop tanks, this is not unknown on long bombing missions with jet fighters. \n\nYou start draining from outer tanks, then they are dry you flip an switch for fuel source to central drop tank and eject the side tanks. \n\nIn KSP you have to draw an pipe from the two outer tanks to the core and then to plane."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-02T11:30:51Z","Content":"It\u0027s possible in theory (magnemoe\u0027s description is likely the route real world asparagus would take). Whether it can be made practical and reliable is another matter, and it\u0027s a bit of a case of diminishing returns crossfeeding past the first pair of boosters. Plus every staging event is a potential failure point, so fewer stages has some benefits in reliability."},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-02T11:39:12Z","Content":"The Falcon Heavy already has 28 Merlin engines. Your \u0022Falcon 10\u0022 would have 46. As said above, more parts means more failure points and more cost. There is a point at which it makes sense to simply build a bigger rocket.\n\nAlso, if you were doing KSP-style asparagus staging, your first pair of boosters would empty really quickly. On a nominal flight the Falcon 9 core stage burns for 180 secs. To feed 45 engines, the first pair of boosters would be empty after only 72 seconds. I\u0027m not sure how fast the rocket will be going after only 72 secs, but it\u0027s probably not worth the extra complexity and risk and the boosters might not be recoverable from such a low altitude.\n\n**Edited \u003Ctime datetime=\u00222015-06-02T11:47:04Z\u0022 title=\u002206/02/2015 11:47  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 2, 2015\u003C/time\u003E by Nibb31**"},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-06-22T12:14:35Z","Content":"Wouldn\u0027t asparagus staging cause severe spinning from fuel transfer that would break it apart?"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-22T12:17:53Z","Content":"\u003E \n\u003E Wouldn\u0027t asparagus staging cause severe spinning from fuel transfer that would break it apart?\n\nNo, the net rotational torque is near zero."},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-06-22T13:36:56Z","Content":"My understanding from things Musk has said is that they investigated the possibility of asparagus staging as KSP knows it and decided that it just wasn\u0027t feasible yet to pump fuel in the way we know and love. They can do A-\u003EB without much trouble, but A-\u003EB-\u003EC ends up adding too much risk and extraneous mechanical gear."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-22T13:49:08Z","Content":"You wouldn\u0027t do A-\u003EB-\u003EC IRL. Assuming C is the core and A and B are the asparagus stages, you would do A-\u003EC and A-\u003EB simultaneously, then switch to B-\u003EC after A is dropped. It does get complicated for more than two pairs of boosters, though."},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-06-22T19:01:18Z","Content":"Right, part of my point is that one of the reasons why you wouldn\u0027t do that is because you cannot. I agreed with how Magnemoe declared it would operate."}]}