{"TopicId":117935,"ForumId":44,"TopicTitle":"Why does the Earth crust contains heavy elements?","CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-08-08T08:30:42Z","PageNum":1,"Articles":[{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-08-08T08:30:42Z","Content":"Hi everybody!\n\nWhen the Earth formed all of it was molten and no solid crust existed. At that time heavy elements (like iron) sunk down to the core and light elements wandered to the surface (like oxygen).\n\nAccording to Wiki the current crust\u0027s composition is:\n\nO 46.6% \n\nSi 27.7%\n\nAl 8.1% \n\nFe 5.0% \n\nCa 3.6% \n\nNa 2.8% \n\nK 2.6% \n\nMg 1.5%\n\n(Unit in weight %) \n\nObservations tell us that there\u0027re (sometimes huge) deposits of heavy elements in the crust. Also volcanos spit lava high into the air because gases in the magma build up pressure.\n\nMy question is: Why is that?\n\nShouldn\u0027t there be only traces of heavy elements in the crust because they wandered to the core? 5% iron is a bit much and can\u0027t be explained by asteroid impacts alone.\n\nAlso shouldn\u0027t magma only contain a trace amount of gases?\n\nThe Earth is ~4.5 billion years old. There was enough time to do all that.\n\nSo... is there something I overlooked?"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-08-08T08:46:27Z","Content":"Our entire solar system is \u0022made\u0022 from elements left after the explosion of large star. From what I read, all heavy elements where created in that large star core.\n\nSome scientists estimated that if Sun explodes heaviest element we get from it should be iron, because Sun is relatively small star."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-08T08:51:07Z","Content":"\u003E \n\u003E Our entire solar system is \u0022made\u0022 from elements left after the explosion of large star. From what I read, all heavy elements where created in that large star core.\n\u003E Some scientists estimated that if Sun explodes heaviest element we get from it should be iron, because Sun is relatively small star.\n\nThat does not answer the question. The question was why not all heavy elements ended up in the core, far beyond our reach, after planetary differentiation - which is actually a good question. If I am to believe the web, this is because materials are formed (like oxides or more complex molecules) that have a low density, which differentiate the other way because of this. Without these, we would not have a lot of the elements our bodies and society are made of and thrive on.\n\n**Edited \u003Ctime datetime=\u00222015-08-08T08:54:39Z\u0022 title=\u002208/08/2015 08:54  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 8, 2015\u003C/time\u003E by Camacha**"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-08-08T08:55:59Z","Content":"I think there was a Nat Geo show or something that talked about this. It is still asteroid impacts that brings heavy element to the crust, but not really on the asteroids themselves, but their impact, which stir things up from the magma level and scatter it all over the place. This mostly applies to the extinction level impact events where a huge amount of energy is released.\n\nNo idea if that is true or not, but sounds plausible\n\nEdit: actually, I think they said the impact concentrates trace elements on the crust into larger deposits...hmm.hazy memories...![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif)\n\n**Edited \u003Ctime datetime=\u00222015-08-08T08:58:46Z\u0022 title=\u002208/08/2015 08:58  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 8, 2015\u003C/time\u003E by RainDreamer**"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-08-08T09:01:54Z","Content":"\u003E \n\u003E That does not answer the question. The question was why not all heavy elements ended up in the core\n\nBut that question suggests that each planet was formed only from gases and leftovers from that star I was writing about (and possible also from part of planets of that old solar system) and that\u0027s it... while some hypothesis say that planets collide with each other, destroying and passing part of their matter between each other.\n\nSo basically those heavy elements, we can mine easily, are from \u0022alien planets\u0022, not from original Earth ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-08T09:09:38Z","Content":"\u003E \n\u003E But that question suggests that each planet was formed only from gases and leftovers from that star I was writing about (and possible also from part of planets of that old solar system) and that\u0027s it... while some hypothesis say that planets collide with each other, destroying and passing part of their matter between each other.\n\u003E So basically those heavy elements, we can mine easily, are from \u0022alien planets\u0022, not from original Earth ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nTo be honest, I do not see how that question would suggest that. Besides, any impact large enough to merge planets will heat things up enough to case massive amounts of planetary differentiation, so you end up with exactly the same problem, just with an extra step in between. Then, finally, the planet would replace the crust, eliminating all heavy elements, as the tectonic plates sink into the mantle below. The materials are still here and plentiful, even in our relatively young rocks, so that obviously did not happen.\n\n**Edited \u003Ctime datetime=\u00222015-08-08T09:13:17Z\u0022 title=\u002208/08/2015 09:13  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 8, 2015\u003C/time\u003E by Camacha**"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-08-08T09:12:10Z","Content":"Volcanoes bring up silicon.\n\nAsteroids stir up the metals.\n\nRemember the hypothesis about the formation of the Moon. According to it the Earth was struck by a very large object. That would thoroughly mess up the differentiation.\n\nThis wikipedia article is interesting.\n\n[https://en.wikipedia.org/wiki/Banded_iron_formation](https://en.wikipedia.org/wiki/Banded_iron_formation)"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-08-08T09:14:27Z","Content":"\u003E \n\u003E To be honest, I do not see how that question would suggest that. Besides, any impact large enough to merge planets will heat things up enough to case massive amounts of planetary differentiation, so you end up with exactly the same problem, just with an extra step in between. Then, finally, the planet would replace the crust, eliminating all heavy elements, as the tectonic plates sink into the mantle below.\n\nOnly if you assume each collision is going to melt both cores. But if two planets collide and core of larger is intact after collision, it would create crust of heavy elements made from smaller planet core, mixed with old crust of larger planet?"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-08T09:15:54Z","Content":"\u003E \n\u003E Remember the hypothesis about the formation of the Moon. According to it the Earth was struck by a very large object. That would thoroughly mess up the differentiation.\n\nIt would also heat the Earth back up again, increasing differentiation. An impact like that is nothing to trifled with."},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2015-08-08T09:17:54Z","Content":"From what I understand, there\u0027s also the radiothermal heating of the Earth\u0027s core, which produces convection currents in the mantle, which can bring up heavy elements that are soluble in molten rock to the underside of the crust, where tectonic and vocanic action can move them out onto the surface.\n\nAs far as gases in magma goes, some gases are /also/ soluble in magma, and can get pulled into the mantle at subduction zones. Their solubility is dependent on temperature and pressure. When the pressure drops closer to the surface, the gases get less soluble, and start coming out. [https://en.wikipedia.org/wiki/Volcanic_gas](https://en.wikipedia.org/wiki/Volcanic_gas)"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-08T09:20:36Z","Content":"\u003E \n\u003E Only if you assume each collision is going to melt both cores. But if two planets collide and core of larger is intact after collision, it would create crust of heavy elements made from smaller planet core, mixed with old crust of larger planet?\n\nThe core is already molten - or as good as. The heat is there, it is the immense pressure that makes it have solid properties. Take away the pressure and things will be liquid. Whether your proposal might work would require some calculations, that is not really something you can say based on the seat of your pants.\n\n\u003E \n\u003E From what I understand, there\u0027s also the radiothermal heating of the Earth\u0027s core, which produces convection currents in the mantle, which can bring up heavy elements that are soluble in molten rock to the underside of the crust, where tectonic and vocanic action can move them out onto the surface.\n\nThat is pretty similar to the story posted above, that sound plausible."},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2015-08-08T18:19:30Z","Content":"As others have said most elements form compounds with other elements, (Oxygen to form oxides for example), which have different densities to raw elements. The list of elements you provided doesn\u0027t take that into account."},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-08-08T18:35:58Z","Content":"That\u0027s a good explanation! I didn\u0027t think of compounds."},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-08-08T18:52:34Z","Content":"My own guess would be more along the fact that it\u0027s weight-based percentage: had it been mole-based percentage it\u0027d be smaller due to iron\u0027s relatively heavy atoms (some ~100 amu compared to oxygen\u0027s ~18 amu, you need ~5 times more oxygen atoms to match iron\u0027s mass). Oxides should only form when it\u0027s in the crust already, where moisture are there for most of the time and it\u0027s not that hot (furnace goes up to 1800 deg C, lava is around 1200 deg and magma should be closer to furnace, means no oxidation yet). And if you compare that 5% of crust to core amounts, it\u0027s pretty small anyway. So, when will we mine the core ?"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2015-08-08T19:24:14Z","Content":"\u003E \n\u003E That\u0027s a good explanation! I didn\u0027t think of compounds.\n\nThe other parts of the explanation are Convection, Solidity and water-flow separation.\n\nThe magma is constantly, very slowly, convecting, in a way analogous to the way liquids convect when heated from below. (The difference is that the magma at any depth is effectively solid, it is only vast volumes of magma which are capable of rising.) This convection process brings heavy elements up to the sub-crust layers, and they get deposited there at places where new crust is forming.\n\nNext off, once heavy elements get trapped in the crust (whether they are in compounds or unreacted), they are locked in place and unable to move down. There is some degree of extra force due to their greater density, but it isn\u0027t enough to break the rock matrix they are in allowing them to slip through.\n\nSimilarly, there is no process by which heavy elements can sink through the magma. While at the surface magma can liquefy, at depth, under pressure, it is effectively solid and lead and other heavy metals are effectively trapped within the magma matrix, unable to diffuse down through the magma. It is only once magma has risen high enough in the mantle that it liquefies that heavier elements can start to settle out, and that is usually only when the magma is on the point of converting into crust (or spewing out of a volcano) when they get trapped.\n\nTectonic activity can affect the way minerals are presented in the crust. When a mountain range is lifted up due to the pressure of colliding tectonic plates, all minerals within the rock are lifted up, regardless of density.\n\nFinally, water tends to segregate different minerals within the crust. In many places at many times during the Earth\u0027s history there have been flows of cold water down into the lower crust where it tends to dissolve many minerals, including those that are not soluble at surface conditions but *are* soluble at great pressures and temperatures. The hot, mineral-rich water then rises, and deposits minerals at whatever depth is cool enough for them to precipitate out, without regard to their density. The same column of water can deposit many different minerals at different depths. This is how many heavy elements tend to end up in surface seams where we can mine them!\n\nSo there are lots of reasons why dense minerals can be found at the surface of the Earth, but they all, ultimately, depend on the unimaginably vast reservoir of heat at the core.\n\nThings will be very different on worlds that have never had a liquid core. Such planets will have been effectively solid ever since they got warm enough for gasses and liquids to separate out from the rock matrix and for the rock to consolidate. In those cases, there is a good chance that minerals will be present in the rocks at almost uniform distributions throughout. The only possible cause for variation in density will be if there was variety in the composition of the rocks and dust that aggregated to form the planet in the first place, but this is likely to be small-scale variation in distribution rather than any large variation.\n\n**Edited \u003Ctime datetime=\u00222015-08-08T19:26:26Z\u0022 title=\u002208/08/2015 07:26  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 8, 2015\u003C/time\u003E by softweir**\n  \nAdded quote to make it clear who I was responding to."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-08-08T22:20:05Z","Content":"\u003E \n\u003E That does not answer the question. The question was why not all heavy elements ended up in the core, far beyond our reach, after planetary differentiation - which is actually a good question. If I am to believe the web, this is because materials are formed (like oxides or more complex molecules) that have a low density, which differentiate the other way because of this. Without these, we would not have a lot of the elements our bodies and society are made of and thrive on.\n\nSome are blocked from sinking by a physical object."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-08T22:25:01Z","Content":"\u003E \n\u003E Some are blocked from sinking by a physical object.\n\nI am not sure you can speak of physical objects in a properly differentiating object. The point is pretty much that it all goes gooey and runny. Or do you mean something else?"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-08-08T22:27:36Z","Content":"\u003E \n\u003E I am not sure you can speak of physical objects in a properly differentiating object. The point is pretty much that it all goes gooey and runny. Or do you mean something else?\n\nSomething less dense happens to be below an amount of iron, and it has a high enough \u0022buoyancy\u0022 to hold the iron. Physically stopped bg it from moving down. Like a boat..."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-08T22:33:17Z","Content":"\u003E \n\u003E Something less dense happens to be below an amount of iron, and it has a high enough \u0022buoyancy\u0022 to hold the iron. Physically stopped bg it from moving down. Like a boat...\n\nOh, yes, sure ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) I think the Wikipedia page speaks of this, but I am not sure it was actually posted here. I guess you did ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-08-09T05:02:57Z","Content":"\u003E \n\u003E Shouldn\u0027t there be only traces of heavy elements in the crust because they wandered to the core?\n\nThere\u0027s an experiment you can do to verify the above is false. I did it myself as a kid.\n\nTake a bucket, fill it full of marbles (yes, I did this experiment with marbles when I was a kid!) and shake the bucket vigorously. Preferably NOT while doing a lambada, because your parents will stare at you and wonder what the hell you\u0027re doing.\n\nYou\u0027ll notice that the largest marbles (we called them \u0022boulders\u0022) end up at the TOP. The small ones end up at the BOTTOM. I was quite confused first time I saw this, but today it makes sense to me. Smaller particles (sand being an obvious example) will filter between the big ones, thereby ending up at the bottom.\n\nI\u0027m not a hundred percent sure this rule holds at the atomic or molecular scale, but I see no reason why it wouldn\u0027t."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-08-09T05:21:15Z","Content":"\u003E \n\u003E There\u0027s an experiment you can do to verify the above is false. I did it myself as a kid.\n\u003E Take a bucket, fill it full of marbles (yes, I did this experiment with marbles when I was a kid!) and shake the bucket vigorously. Preferably NOT while doing a lambada, because your parents will stare at you and wonder what the hell you\u0027re doing.\n\u003E \n\u003E You\u0027ll notice that the largest marbles (we called them \u0022boulders\u0022) end up at the TOP. The small ones end up at the BOTTOM. I was quite confused first time I saw this, but today it makes sense to me. Smaller particles (sand being an obvious example) will filter between the big ones, thereby ending up at the bottom.\n\u003E \n\u003E I\u0027m not a hundred percent sure this rule holds at the atomic or molecular scale, but I see no reason why it wouldn\u0027t.\n\nI don\u0027t think this applies to fluid dynamic (oil \u002B water, for example), and when our planet was just starting to form, the whole molten mess is more similar to fluid than solid."},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-08-09T06:00:00Z","Content":"\u003E \n\u003E There\u0027s an experiment you can do to verify the above is false. I did it myself as a kid.\n\u003E Take a bucket, fill it full of marbles (yes, I did this experiment with marbles when I was a kid!) and shake the bucket vigorously. Preferably NOT while doing a lambada, because your parents will stare at you and wonder what the hell you\u0027re doing.\n\u003E \n\u003E You\u0027ll notice that the largest marbles (we called them \u0022boulders\u0022) end up at the TOP. The small ones end up at the BOTTOM. I was quite confused first time I saw this, but today it makes sense to me. Smaller particles (sand being an obvious example) will filter between the big ones, thereby ending up at the bottom.\n\u003E \n\u003E I\u0027m not a hundred percent sure this rule holds at the atomic or molecular scale, but I see no reason why it wouldn\u0027t.\n\nThat\u0027s not true - the sand are all of similar density, just different grain size. Try to separate rice husk from the grain (which husk are less dense), shake them, and you\u0027ll observe a similar effect as boulders vs fine grains, though with husk at the top.\n\nAlso, magma is all fluid, so a better comparison would be water vs oil, or probably more along some liquid metals vs other molten metal."},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-08-09T22:16:25Z","Content":"\u003E \n\u003E I don\u0027t think this applies to fluid dynamic (oil \u002B water, for example)\n\nOf course it does. Why does oil float on water? Because oil is less dense.\n\nWhy is oil less dense........?\n\n\u003E \n\u003E That\u0027s not true - the sand are all of similar density, just different grain size. Try to separate rice husk from the grain **(which husk are less dense)**\n\nI boldfaced the important part there. The marbles I used when I did the experiment as a kid were all of **equal density.** Density is certainly a factor, but it\u0027s a secondary one. Given equal density, the smallest marbles/rocks/molecules will sink to the bottom/core/center.\n\nAnd on Earth, what substances are composed of the smallest molecules? Heavy metals. Those can exist as individual atoms. Most other elements cannot. A lone atom of, for example, oxygen will immedately (and usually with a degree of violence) combine with something nearby to form a compound."}]}