{"TopicId":118333,"ForumId":44,"TopicTitle":"spot the iss","CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-08-12T23:26:15Z","PageNum":1,"Articles":[{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-08-12T23:26:15Z","Content":"I can see it with the naked eye, but only as big as star. I\u0027ve seen photos where you can actually see all parts of iss clearly.\n\nI tried using binoculars but it wasn\u0027t much different. What do you guys suggest?\n\nI have a telescope but it\u0027s not really good, and it would be nearly impossible to catch the iss since it\u0027s too fast. Btw it says focal lenght: 360mm, diam: 50mm, coated lens, model 36050 telescope."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-12T23:31:35Z","Content":"Spotting more than the shine is very hard. It is just too small. With the naked eye it is very easy to spot though, on a good pass it is brighter than any of the stars.\n\n![iss_moon20080915.jpg](http://www.guidescope.net/earth/iss_moon20080915.jpg)"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2015-08-12T23:58:30Z","Content":"With low power binoculars (25x?) I was just able to tell it had some shape other than a dot when I saw it last week. I would recommend a tripod.\n\n**Edited \u003Ctime datetime=\u00222015-08-13T03:58:44Z\u0022 title=\u002208/13/2015 03:58  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 13, 2015\u003C/time\u003E by Aethon**"},{"CreatedByName":"hugix","CreatedById":55379,"CreatedDateTime":"2015-08-13T01:06:05Z","Content":"I saw a rudimentary shape of it with binoculars. I could tell there was some black between the giant solar panels.\n\nI am working on making a photo of the ISS as a station, not as a line across the sky. but it is very hard. Every time I tried my camera was just not pointing the right way. (and there was that time a plane flew over its path trowing off my cameras focus.)\n\nThe hardest part is getting the camera steady, I got a tripod, but pushing the button makes the camera wobbly oh so slightly. I can set a delay on my camera of 2 seconds. But that makes it harder to point my camera towards the sky where the ISS will be."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-13T01:50:52Z","Content":"\u003E \n\u003E The hardest part is getting the camera steady, I got a tripod, but pushing the button makes the camera wobbly oh so slightly. I can set a delay on my camera of 2 seconds. But that makes it harder to point my camera towards the sky where the ISS will be.\n\nTry an old school wire trigger or a modern wireless trigger (even though it might sound at odds ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif))."},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-08-13T03:13:56Z","Content":"If I might suggest: *An old field trick.* Tripods, even the best of them, can shake/vibrate. Find yourself a solid enough foundation of adequate height, a boulder or rock/brick wall. Take a few pair of old socks, put plastic bag liners inside them, and fill them with sand/dirt... tie off the end with string or a rubber band. Flop a few of them down and nestle your camera into it... you can push the stuff around and get the framing you need/want. Use the timer delay on the camera (assuming your camera has such) to make the shot.\n\nI always carry such stuff along with all my equipment. I do a lot of photomacrography (been doing such *for years*), and such a field trick works perfect every time. Welcome to my world."},{"CreatedByName":"Andersenman","CreatedById":61273,"CreatedDateTime":"2015-08-13T13:32:20Z","Content":"\u003E \n\u003E Spotting more than the shine is very hard. It is just too small. With the naked eye it is very easy to spot though, on a good pass it is brighter than any of the stars.\n\u003E [http://www.guidescope.net/earth/iss_moon20080915.jpg](http://www.guidescope.net/earth/iss_moon20080915.jpg)\n\nI love that shot!"}]}