{"TopicId":119256,"ForumId":44,"TopicTitle":"Pellet riding : bringing railroads to the Solar System?","CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-08-24T18:14:32Z","PageNum":1,"Articles":[{"CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-08-24T18:14:32Z","Content":"\n\u003Cp\u003EConcept : you build a gigantic superconducting quench gun on the Moon, and another one at either the surface or on one of the Moons of Mars. \u003C/p\u003E\u003Cp\u003EGuns fire BB sized iron pellets. Spacecraft is also a superconducting magnet line, and uses the magnets to decelerate incoming pellets, turning the magnets on after the pellets pass instead of turning them off after the pellets pass. \u003C/p\u003E\u003Cp\u003EHigh thrust - ultimately, the spacecraft is just a stack of gigantic superconducting magnets, chasing after this perpetually present \u0022iron bar\u0022 from a continuous stream of pellets. I think 1 G can be done easily. \u003C/p\u003E\u003Cp\u003EZero mass loss. If the spacecraft accumulates the energy from each pellet and decelerates it to 0 relative to the spacecraft, it can fling the pellets back to the moon that launched them, and if there\u0027s a pellet launcher at both ends of the journey, it ends up being a net zero momentum change and net zero mass lost from the moon. So you could do this for millions of years, sending large passenger vehicles back and forth, and not run out of iron for propellant. \u003C/p\u003E\u003Cp\u003EWhat\u0027s the rocket equation? Since there\u0027s no propellant carried onboard, it\u0027s immune to those logarithms. \u003C/p\u003E\u003Cp\u003EWhat do you think? This rough scheme sounds like what a \u0022civilized\u0022 inner solar system would be like, where people can routinely reach other planets in a week or so, although there would be periods of time when Mars is on the other side of the Sun where the \u0022track would be closed\u0022 and no trains would run.\u003C/p\u003E\n"},{"CreatedByName":"MinimumSky5","CreatedById":115138,"CreatedDateTime":"2015-08-24T18:35:36Z","Content":"\n\u003Cp\u003EThe pellets would be in a nice straight line, as the Moon and Mars move in their orbits. Also, there would have to be breaks in the line to allow the earth to pass through.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-08-24T18:36:43Z","Content":"\n\u003Cp\u003EDo you have any idea how much iron you would have to fire into space continuously? And how much energy and effort it would cost? I don\u0027t - but i bet it would be ludicrous amount. Even chemical fuels would be cheaper and easier to produce and store.\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-08-24T18:41:08Z","Content":"\n\u003Cp\u003EI do not believe that for routine travel that this is workable. Shutting down a section for,any,length of time to a location is almost like saying to the colony, hey, hope we gave you enough to survive! A lot can happen when it is on the other side of the sun!\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2015-08-24T18:41:47Z","Content":"\n\u003Cp\u003EUse Lasers instead. Or Particle cannons: \u003Ca href=\u0022http://www.nasa.gov/vision/universe/solarsystem/magbeam.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/vision/universe/solarsystem/magbeam.html\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-24T18:45:35Z\u0022 title=\u002208/24/2015 06:45  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 24, 2015\u003C/time\u003E by SargeRho\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2015-08-24T18:49:45Z","Content":"\n\u003Cp\u003EI don\u0027t think this idea even needs superconductors at the ground stations to work, and they might actually make it perform worse.\u003C/p\u003E\u003Cp\u003EConventional wire coils would work at least as well, and they tolerate a much higher temperature range than superconductors would (important when it spends 14 days baking in the sunlight, and 14 days in the shade).\u003C/p\u003E\u003Cp\u003EPlus, you can source aluminum from moon rocks, which means that you could avoid the launch costs of most of the mass of the completed system (coils, track).\u003C/p\u003E\u003Cp\u003EIt\u0027s a good idea, but the technology level required to make it would likely also mean that fusion-powered rockets are equally possible, and when you can stop off at any handy source of water or hydrogen to re-fuel, the rocket equation doesn\u0027t exactly get in the way in the first place. Fusion rockets have very high ISP, and they have enough power that they can also get high thrust, even at that high ISP. Heck, even a fission rocket (nuclear thermal rocket / NERVA) has great performance, and will run on most anything (water, ammonia, and hydrogen are popular choices for study).\u003C/p\u003E\u003Cp\u003ESo, it\u0027s a good idea, but I expect it would be used more for cargo transport than for moving people around.\u003C/p\u003E\n"},{"CreatedByName":"User Unrelated","CreatedById":74021,"CreatedDateTime":"2015-08-25T16:42:30Z","Content":"\n\u003Cp\u003ESo sort of like an interplanetary launch-loop?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Launch_loop\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Launch_loop\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m not so sure that it would work too well over such distances... And the tolerances would have to be INSANE.\u003C/p\u003E\u003Cp\u003E\u0022No... Jeb don\u0027t lean against the receiver coil!\u0022\u003C/p\u003E\u003Cp\u003E*continuous explosion sound as a LARGE QUANTITY of hyper-velocity iron pellets rain down on a location about 1mm to the right of the receiving coil*\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-08-25T16:43:35Z","Content":"\n\u003Cp\u003EYou do know the distance between the Earth and Mars is not constant right ?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-08-25T18:54:43Z","Content":"\n\u003Cp\u003Ewhat if instead you keep the accelerators on fixed stations and use the space craft as the bullet. have a small moon or asteroid with an accelerator on it. it can accelerate a ship on a trajectory to another object with another accelerator (running in reverse as a decelerator) and only needs to carry enough delta-v for course corrections. accelerators would be fly through devices and can be used to either speed up or slow down ships flying through them, possibly using multiple passes over a series of orbits. it would require really precise orbital control though. you need to hit a target on the other side of a planet with sub-meter precision.\u003C/p\u003E\u003Cp\u003Eyou could use a series of momentum transfer stations all over the solar system, they would require two way travel in order to keep their orbits more or less constant. they would need to be build on existing bodies in the solar system in their natural orbit. or the travel schedules can be tweaked to move those stations to more desirable orbits over time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-25T19:00:49Z\u0022 title=\u002208/25/2015 07:00  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2015-08-25T21:33:57Z","Content":"\n\u003Cp\u003EYou\u0027d better have \u003Cem\u003Eastoundingly \u003C/em\u003Egood aim, and substantial energy output onboard the spacecraft to slow those pellets down enough to get a reasonable delta-v.\u003C/p\u003E\u003Cp\u003EGiven the presence of superconducting technology, you\u0027d be better off with a magsail. Solar wind protons are free, and much easier to catch.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-08-25T22:15:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EUse Lasers instead. Or Particle cannons: \u003Ca href=\u0022http://www.nasa.gov/vision/universe/solarsystem/magbeam.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/vision/universe/solarsystem/magbeam.html\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAye, \u0022laser pumping\u0022 would be far less complicated, and less prone to error.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-08-25T22:48:46Z","Content":"\n\u003Cp\u003EYeah is similar to the concept of Jordan Kare of the sailbeam.\u003C/p\u003E\u003Cp\u003EAt this scale is much easier to make, the accuracy is more feasible.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EDo you have any idea how much iron you would have to fire into space continuously? And how much energy and effort it would cost? I don\u0027t - but i bet it would be ludicrous amount. Even chemical fuels would be cheaper and easier to produce and store.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs proppelent mass that you are not carrying but you use it for free, you are ignoring the rocket equation with this, extract the energy via solar panels in the moons is easier, and you dont need to shoot much, only a 10% aprox (I dint did the math) of the proppelent mass that you would use it in a normal rocket, in case the speed of the projectyle are equal to the exhaust of chemical combustion.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaarst\u0022 data-cite=\u0022Gaarst\u0022\u003E\u003Cdiv\u003EYou do know the distance between the Earth and Mars is not constant right ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd? Your acceleration/deceleration time may take only 10 min.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Ewhat if instead you keep the accelerators on fixed stations and use the space craft as the bullet. have a small moon or asteroid with an accelerator on it. it can accelerate a ship on a trajectory to another object with another accelerator (running in reverse as a decelerator) and only needs to carry enough delta-v for course corrections. accelerators would be fly through devices and can be used to either speed up or slow down ships flying through them, possibly using multiple passes over a series of orbits. it would require really precise orbital control though. you need to hit a target on the other side of a planet with sub-meter precision.\u003Cp\u003Eyou could use a series of momentum transfer stations all over the solar system, they would require two way travel in order to keep their orbits more or less constant. they would need to be build on existing bodies in the solar system in their natural orbit. or the travel schedules can be tweaked to move those stations to more desirable orbits over time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003Ethen you to scale your magnet accelerators size and power by a terrible amount, you also need huge capacitor banks.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EAye, \u0022laser pumping\u0022 would be far less complicated, and less prone to error.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah that idea is also good.\u003C/p\u003E\n"}]}