{"TopicId":119667,"ForumId":44,"TopicTitle":"39 days to Mars possible now with nuclear-powered VASIMR.","CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-08-29T15:44:19Z","PageNum":3,"Articles":[{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-31T11:59:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EThis is true (I actually do mention CCGTs in a subsequent post, but I was in nuclear mode at this point). The OP was assuming you could get 90-95% thermal efficiency out of the reactor in power generation mode, with minimal ancillaries, which is never going to happen. See my two most recent posts for something a little more in-depth.\u003Cp\u003EThe AGRs I worked on had a channel gas outlet temperature out 648 celsius. They used supercritical CO2 as their coolant. Really nice design, and the thermal efficiency is about 41% (except for Hunterston B, because they sucked a load of sea water into the reactor core by accident and gubbed it up with salt!)\u003C/p\u003E\u003Cp\u003EAll of the UK\u0027s reactor fleet have thermocouples in the reactor core, and although they do fail, it\u0027s pretty rare.\u003C/p\u003E\u003Cp\u003EThe main problem isn\u0027t that it is hard to maximise the efficiency of the reactor though, it is the trade-off between the thermal cycle efficiency and the radiator efficiency, which means you\u0027re not going to break 20% efficiency using a heat engine without needing a monster radiator which will completely destroy your specific power anyway. Thermocouples don\u0027t have the same fundamental limit as far as I know, but in practice they are even less efficient.\u003C/p\u003E\u003Cp\u003EAnd the OP is misinformed about even the gross points of the design.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are not considering everything. The VASIMR drive also has a cooling problem and would need radiators also. It looks like ther is really no gain to nuclear power since you would need a radiator array much bigger than a solar array. At least solar arrays radiate thier own waste heat. The solution here is a smaller VASMIR, more efficient watt/kg ratio of the panels, and a staging system taht uses LFOx in the initial burn stage. \u003C/p\u003E\u003Cp\u003EIn the Nerva Engine once it is triggered it will always produce heat even when not producing trust, and that heat will need to be dissipated also. All fission power plants have the same problem, once the fuel rods undergo neutron accelerated decay they are hot for months. Now we know why they don\u0027t use nukes in space.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-08-31T12:11:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EYou are not considering everything. The VASIMR drive also has a cooling problem and would need radiators also. It looks like ther is really no gain to nuclear power since you would need a radiator array much bigger than a solar array. At least solar arrays radiate thier own waste heat. The solution here is a smaller VASMIR, more efficient watt/kg ratio of the panels, and a staging system taht uses LFOx in the initial burn stage. \u003Cp\u003EIn the Nerva Engine once it is triggered it will always produce heat even when not producing trust, and that heat will need to be dissipated also. All fission power plants have the same problem, once the fuel rods undergo neutron accelerated decay they are hot for months. Now we know why they don\u0027t use nukes in space.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you replying to my post? I\u0027ve been saying all along that the OP is massively overoptimistic, that you\u0027d need huge radiators, and only get low thermal efficiencies.\u003C/p\u003E\n"},{"CreatedByName":"NuclearNut","CreatedById":143605,"CreatedDateTime":"2015-08-31T12:48:31Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EThis is true (I actually do mention CCGTs in a subsequent post, but I was in nuclear mode at this point). The OP was assuming you could get 90-95% thermal efficiency out of the reactor in power generation mode, with minimal ancillaries, which is never going to happen. See my two most recent posts for something a little more in-depth.\u003C/span\u003E\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EYeah, unless you are debating some \u003C/span\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Fission_fragment_reactor\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003Efar off paper reactor\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E, such efficiencies should never pop up in your calculations. Even then they should not pop up.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EThe AGRs I worked on had a channel gas outlet temperature out 648 celsius. They used supercritical CO2 as their coolant. Really nice design, and the thermal efficiency is about 41% (except for Hunterston B, because they sucked a load of sea water into the reactor core by accident and gubbed it up with salt!)\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow the heck did they... how... wow. I never knew you could do that, I wonder why they did not have any equipment to detect the saltwater in the secondary coolant loop, or the holes in the primary coolant loop needed to get the saltwater into the core.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EAll of the UK\u0027s reactor fleet have thermocouples in the reactor core, and although they do fail, it\u0027s pretty rare.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I know that most reactors have them in the core to measure the temperature accurately, but my main question is do the degrade in power output significantly over time. A sensor can still work if you adjust for it\u0027s degradation, but for power generation you will have problems .\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EThe main problem isn\u0027t that it is hard to maximise the efficiency of the reactor though, it is the trade-off between the thermal cycle efficiency and the radiator efficiency, which means you\u0027re not going to break 20% efficiency using a heat engine without needing a monster radiator which will completely destroy your specific power anyway. Thermocouples don\u0027t have the same fundamental limit as far as I know, but in practice they are even less efficient.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EWell I believe the main concern here is weight, not efficency, definitely not efficiency with nuclear fuels. Assuming you are using HEU or something like that, than unless you are getting efficiencies less than 1% I do not believe that that is much of a concern. From what I understand power density is more of a concern, and conventional reactors will not help because they are designed for low power density, water (or gas, I keep forgetting about those) coolant/moderator, not high power density, exotic coolant operation.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EAnd the OP is misinformed about even the gross points of the design.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EYeah, that was kind of clear from the beginning.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EYou are not considering everything. The VASIMR drive also has a cooling problem and would need radiators also. It looks like ther is really no gain to nuclear power since you would need a radiator array much bigger than a solar array. At least solar arrays radiate thier own waste heat. The solution here is a smaller VASMIR, more efficient watt/kg ratio of the panels, and a staging system taht uses LFOx in the initial burn stage. \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EIn the Nerva Engine once it is triggered it will always produce heat even when not producing trust, and that heat will need to be dissipated also. All fission power plants have the same problem, once the fuel rods undergo neutron accelerated decay they are hot for months. Now we know why they don\u0027t use nukes in space.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EWell actually, the solar power plant will weigh a lot more than the reactor \u002B radiators. You will, at best, get a measly .2 Kw a square meter of solar panels, and you will need a lot for your giant spaceship. \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EAnd the case with the NERVA (or any reactor for that matter) is complex, the decay heat will be present, but it takes a while (months) for the short and intermediate lived isotopes to build up to sufficient quantities to give you a toasty 11% of full power as decay heat. So if you run your NERVA for a few hours and scram it and put it in cold shutdown for the duration of the trip you will not have to worry about that that much.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EThe reason we do not use nuclear reactors in space is mostly political. People are afraid of anything nuclear. Nuclear reactors are capable of being used, have been used in the past (\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003ERORSAT)\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E, and are indeed more efficient than a bunch of solar panels, but not near as efficient as the OP is implying.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-08-31T14:20:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NuclearNut\u0022 data-cite=\u0022NuclearNut\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHow the heck did they... how... wow. I never knew you could do that, I wonder why they did not have any equipment to detect the saltwater in the secondary coolant loop, or the holes in the primary coolant loop needed to get the saltwater into the core.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey had a cracked weld in the gas circulator cooling system, which was letting through small amounts of CO2 from the primary coolant loop and acidifying the water used for cooling the gas circs. The plant was due to go on outage later that year anyway, so they rigged up a temporary fix, which was to dump the acidified water into the salt water tertiary coolant below the boilers, so it wouldn\u0027t corrode the circs.\u003C/p\u003E\u003Cp\u003EAnyway, long story short, when the reactor went on outage, they depressurised the core, with the cracked weld still there. Suddenly the core was below the pressure of the circ cooling system, which was now connected to the salt water tertiary coolant, everything flowed through the entire system backwards, and 8,000 litres of seawater were sucked into the reactor core, where it was vapourised by the residual post-trip heat, leaving a huge mess at the bottom of the fuel channels.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EYes, I know that most reactors have them in the core to measure the temperature accurately, but my main question is do the degrade in power output significantly over time. A sensor can still work if you adjust for it\u0027s degradation, but for power generation you will have problems .\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair point, I wasn\u0027t a C\u0026amp;I guy (one of the reasons I left the job was because they tried to make me do C\u0026amp;I!), so I don\u0027t really know if the readings have to be adjusted over time.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EWell I believe the main concern here is weight, not efficency, definitely not efficiency with nuclear fuels. Assuming you are using HEU or something like that, than unless you are getting efficiencies less than 1% I do not believe that that is much of a concern. From what I understand power density is more of a concern, and conventional reactors will not help because they are designed for low power density, water (or gas, I keep forgetting about those) coolant/moderator, not high power density, exotic coolant operation.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, fuel efficiency is of minimal concern, but thermal efficiency of the power plant is pretty crucial, as if your thermal efficiency is low, the amount of heat you need to reject to the environment is high, which means huge radiators!\u003C/p\u003E\u003Cp\u003EOf course, if your thermal efficiency is high, it implies you have a cold heat sink, which means that your radiators aren\u0027t going to work as well, which also means huge radiators!\u003C/p\u003E\u003Cp\u003EThe actual burnup of your fuel is pretty irrelevant in comparison (although it always makes me sad when I remember how much lovely U-235 is just wasted because we don\u0027t reprocess and burnup is so low in current plant designs)\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-08-31T14:45:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EPossibly because the effectiveness of a radiator goes up if it\u0027s more complicated. NASA\u0027s radiators are fer less dense, but also radiate far less heat per unit area. I\u0027m not an expert in radiative heat transfer, so I\u0027m just going to have to work with what I have.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, is not that. First I thought that maybe it depends on the amount of waste heat you need to radiate by m2, because if you have a very thin graphene layer, meanwhile it has the same area, it will radiate the same amout than a very thick block of iron or ceramic.\u003C/p\u003E\u003Cp\u003EBut that is true for radiation, but you need also conductive transfer to reach all the area, there is where the thick may enter in play.. But I am not sure you need so much mass when you are talking about just 300 kw/m2. I highly doubt it.\u003C/p\u003E\u003Cp\u003EAlso I understand the basis of almost each design mentioned in that page and still, not sure how it has so heavy system radiator density.\u003C/p\u003E\u003Cp\u003EIs not the first time I visit that page, I found some errors before in ISP for some designs and when it talks about Solar or Beamed sails.\u003C/p\u003E\u003Cp\u003EThat is why I look those numbers with doubt.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20130001608.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20130001608.pdf\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EActually, core temperature doesn\u0027t matter (strangely enough). You\u0027ll always get the same answer for Carnot efficiency. I can\u0027t link to the relevant secton, but I\u0027m going to try copying it in:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHeh, because he only wanted to calculate the optimal difference in temperature between the source and the radiator, \u0022to minimize radiator area\u0022, which is true, it needs to be 75%. But it does not mention in the final equation the source temperature, only the difference.\u003C/p\u003E\u003Cp\u003ETake a look to these examples:\u003C/p\u003E\u003Cp\u003EReactor Power 100 Mw\u003C/p\u003E\u003Cp\u003E75% ratio --\u0026gt; 1000-750k / 25% efficiency / 34kw/m2 / 2200m2\u003C/p\u003E\u003Cp\u003E75% ratio --\u0026gt; 2000-1500 / 25% efficiency / 544kw/m2 / 137m2 (higher temperature in the core maximizes radiator efficiency) \u003C/p\u003E\u003Cp\u003E50% ratio --\u0026gt; 2000-1000 / 50% efficiency / 106kw/m2 / 471m2 (4x radiator area but generates 2x power so we can reduce the reactor power and weight) \u003C/p\u003E\u003Cp\u003ESo to know the best temperature ratio from the whole system we also need to know the reactor mass and the heat engine mass depending its power.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIs like I said, if the radiator mass is low comparable to the reactor and engine mass, then we should maximize efficiency instead minimize radiator area.\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T15:05:15Z\u0022 title=\u002208/31/2015 03:05  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003Cbr\u003EI forger to calculate the heat radiated from both sides.\n\u003C/span\u003E\n"},{"CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-08-31T14:53:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EIsn\u0027t a 39 days to Mars a riskier trip than a 6 month trip? Because a 6 month trip can give a free return to Earth if something goes wrong en route.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E The 39 day trip envisioned for VASIMR would have so much power it could actually slow down at Mars. So half way accelerating, the other half decelerating.\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-08-31T15:11:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exoscientist\u0022 data-cite=\u0022Exoscientist\u0022\u003E\u003Cdiv\u003EThe 39 day trip envisioned for VASIMR would have so much power it could actually slow down at Mars. So half way accelerating, the other half decelerating.\u003Cp\u003E Bob Clark\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is true because you should maximize ISP in relation with your time trip goal, also if you are not using the reactor power, you are carrying death mass.\u003C/p\u003E\n"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-08-31T15:27:19Z","Content":"\n\u003Cp\u003EPeople who think unfissioned uranium is an issue should instead be worried about the radon under their homes, not rhe naturally occurring element.\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2015-08-31T16:11:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EIsn\u0027t a 39 days to Mars a riskier trip than a 6 month trip? Because a 6 month trip can give a free return to Earth if something goes wrong en route.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf the ultra fast VASIMR spaceship were to suffer a propulsion failure after it had built up speed, then the ship would be unable to stop and would therefore be lost. Bear in mind that the justification for building such a spaceship in the first place is to protect the crew from cosmic radiation and zero gravity, neither of which are show-stoppers. Even if the incredible power source required for the 39 day flight could actually be developed, it would be replacing two very modest risks with a much bigger one.\u003C/p\u003E\u003Cp\u003EIn the absence of an incredible sci-fi power source, electric (ion or plasma) propulsion would still be viable, but it would be slower than existing chemical propulsion. Therefore, electric propulsion would be used to haul cargo. Crewed spacecraft would use the 6 month fast transfer trajectory using chemical or nuclear thermal rockets.\u003C/p\u003E\n"},{"CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-08-31T16:56:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003ENot true. You can\u0027t surpass the Carnot limit with a heat engine. A rocket engine is still a heat engine.\u003Cp\u003EI\u0027ll crunch the numbers for you if you like.\u003C/p\u003E\u003Cp\u003EThe Space Shuttle Main Engine has a combustion temperature of 3500K and a chamber pressure of 20.64MPa (from wikipedia).\u003C/p\u003E\u003Cp\u003EPlugging these values into the NIST REFPROP 9.0 fluid properties calculator for water vapour, this gives us an enthalpy of 12500kJ/kg.\u003C/p\u003E\u003Cp\u003EThe exhaust velocity in vacuum is 4.4km/s. This gives a kinetic energy of 9,680kJ/kg.\u003C/p\u003E\u003Cp\u003EThermal efficiency of 77.44% in vacuum. Dropping to 51.8% at sea level, as the exhaust velocity drops to 3.6km/s.\u003C/p\u003E\u003Cp\u003EThis is because the chamber temperature is extremely high. It can afford to be as the chamber walls are regeneratively cooled, so the 3500K temperature never actually reaches them, it just exists in the centre of the chamber. For a nuclear thermal rocket, and especially for a nuclear power plant, you\u0027re limited by the material properties of the engine and the fuel. Uranium dioxide, for example, melts at 3100K. Not softens, actually melts. You can\u0027t run a nuclear reactor at those temperatures. NERVA ran at about 2400K.\u003C/p\u003E\u003Cp\u003ELook at it this way: If the SSME has a thermal efficiency of 95%, then why was the exhaust hot?\u003C/p\u003E\u003Cp\u003EIf you disagree with me, show me the maths. Or at least give me a source. Don\u0027t just say \u0022it\u0027s been proven\u0022, because it looks like you\u0027re fundamentally misunderstanding quite a few things about thermodynamics here, and I\u0027d like to be able to set things straight.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Note that because of the high combustion temperatures the SSME and other rocket engines can operate at above 90% efficiency and still be within the Carnot limit. The efficiencies quoted for rocket engines really are the thermal energy to kinetic energy values. Note though that rockets generally do not run at the stoichiometric ratios. For instance for the SSME and most other hydrolox engines the mixture ratio of oxygen to hydrogen is around 6 to 1 rather than 8 to 1. I believe the reason is you want to run at rather fuel rich to cool the engine below that at which it would run at stoich. Here\u0027s one source that gives the efficiency as 97% for the SSME:\u003C/p\u003E\u003Cp\u003EAn Overview of Advanced Concepts for Space Access.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI.\u003C/p\u003E\u003Cp\u003EIntroduction \u003C/p\u003E\u003Cp\u003EThe means of ferrying every man-made object taken \u003C/p\u003E\u003Cp\u003Efrom the ground to space has \u003C/p\u003E\u003Cp\u003Ebeen through chemical \u003C/p\u003E\u003Cp\u003Ecombustion of one type or another. From the days of Sputnik, \u003C/p\u003E\u003Cp\u003Elaunched with a combination of liquid oxygen \u003C/p\u003E\u003Cp\u003Eand kerosene, to modern, multi-staged launch vehicles, \u003C/p\u003E\u003Cp\u003Ethe paradigm has been the same Ã¢â‚¬â€œ combine fuel and \u003C/p\u003E\u003Cp\u003Eoxidizer to extract chemical \u003C/p\u003E\u003Cp\u003Eenergy which is then converted to kinetic\u003C/p\u003E\u003Cp\u003E energy. Current chemical propulsion \u003C/p\u003E\u003Cp\u003Etechnology is very efficient, on the \u003C/p\u003E\u003Cp\u003Eorder of 97-98%. For example, the \u003C/p\u003E\u003Cp\u003ESpace Shuttle main engines (SSME) are \u003C/p\u003E\u003Cp\u003Eapproximately 97% efficient in the ra\u003C/p\u003E\u003Cp\u003Etio of chemical power available to\u003C/p\u003E\u003Cp\u003E jet power produced from Eq (1).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.eas.uccs.edu/aketsdever/MAE%205391_files/JSR%20Launch%20Review%20Paper_Final2.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.eas.uccs.edu/aketsdever/MAE%205391_files/JSR%20Launch%20Review%20Paper_Final2.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E And here is an explanation by the noted authority on space history Henry Spencer that rocket engines generally get better than 90% conversion efficiency, and also why in the atmosphere the exhaust looks hot:\u003C/p\u003E\u003Cp\u003EEfficiency (Bruce P. Dunn; Henry Spencer).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u0026gt;...This is because the conventional rocket is extremely\u003C/p\u003E\u003Cp\u003E\u0026gt;inefficient due to the amount of wasted energy in the form of waste\u003C/p\u003E\u003Cp\u003E\u0026gt;heat....\u003C/p\u003E\u003Cp\u003ENo, sorry, this is wrong. Conventional rocket engines are quite efficient\u003C/p\u003E\u003Cp\u003Eat converting the energy of a chemical reaction into the kinetic energy of\u003C/p\u003E\u003Cp\u003Ethe exhaust jet; it is not possible to do a lot better. Good chemical\u003C/p\u003E\u003Cp\u003Erockets with long high-expansion nozzles (for use in vacuum) convert well\u003C/p\u003E\u003Cp\u003Eover 90% of the exhaust\u0027s heat into kinetic energy. In fact, people\u003C/p\u003E\u003Cp\u003Edesigning such rockets using LOX/LH2 have to consider inefficiencies\u003C/p\u003E\u003Cp\u003Earising from condensation of water in the exhaust, which tells you that\u003C/p\u003E\u003Cp\u003Ethey\u0027re getting so much energy out that the exhaust is falling below\u003C/p\u003E\u003Cp\u003E100degC (indeed, lower, because the pressure at that point is below 1atm).\u003C/p\u003E\u003Cp\u003ERocket exhausts *look* hot partly because you see them in atmosphere.\u003C/p\u003E\u003Cp\u003EWhen they slam into motionless air, much of the kinetic energy gets turned\u003C/p\u003E\u003Cp\u003Eback into heat.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://yarchive.net/space/rocket/efficiency.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://yarchive.net/space/rocket/efficiency.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E About the efficiency of the SSME turbopumps, I had thought they worked by tapping off a portion of the main combustion chamber combustion products. But actually they have their own preburners that drive their turbines. So this is like the case of a full combustion chamber driving a turbine at high efficiency:\u003C/p\u003E\u003Cp\u003ESpace Shuttle main engine.\u003C/p\u003E\u003Cp\u003E1.1 Turbopumps\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/b/bc/Ssme_schematic.svg\u0022 alt=\u0022Ssme_schematic.svg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Shuttle_main_engine#Turbopumps\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Space_Shuttle_main_engine#Turbopumps\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T16:58:42Z\u0022 title=\u002208/31/2015 04:58  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by Exoscientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-08-31T17:34:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EIf the ultra fast VASIMR spaceship were to suffer a propulsion failure after it had built up speed, then the ship would be unable to stop and would therefore be lost. Bear in mind that the justification for building such a spaceship in the first place is to protect the crew from cosmic radiation and zero gravity, neither of which are show-stoppers. Even if the incredible power source required for the 39 day flight could actually be developed, it would be replacing two very modest risks with a much bigger one.\u003Cp\u003EIn the absence of an incredible sci-fi power source, electric (ion or plasma) propulsion would still be viable, but it would be slower than existing chemical propulsion. Therefore, electric propulsion would be used to haul cargo. Crewed spacecraft would use the 6 month fast transfer trajectory using chemical or nuclear thermal rockets.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E That is the argument of Zubrin. But there is a flaw with that argument. You do have an alternative method of slowing down by the atmosphere. Note that with the Apollo missions they did do a free return trajectory around the Moon, but the Moon did not have an atmosphere. On return to Earth, the Apollo capsule did do a direct descent into the atmosphere using atmospheric braking.\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NuclearNut\u0022 data-cite=\u0022NuclearNut\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYeah, that was kind of clear from the beginning. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Not if you correctly recognize what the actual efficiency is of rockets both chemical and nuclear. Chemical rocket engines get better than 90% and so do nuclear rocket engines:\u003C/p\u003E\u003Cp\u003EBimodal NTR.\u003C/p\u003E\u003Cp\u003EEngine (Thrust Mode)\u003C/p\u003E\u003Cp\u003EThrust per engine 67,000 N\u003C/p\u003E\u003Cp\u003ETotal Thrust 200,000 N\u003C/p\u003E\u003Cp\u003ET/Wengine 3.06\u003C/p\u003E\u003Cp\u003EExhaust Velocity 9,370 m/s\u003C/p\u003E\u003Cp\u003ESpecific Impulse 955 s\u003C/p\u003E\u003Cp\u003EPropellant\u003C/p\u003E\u003Cp\u003EMass Flow 7.24 kg/s\u003C/p\u003E\u003Cp\u003EFull Power\u003C/p\u003E\u003Cp\u003EEngine Lifetime 4.5 hours\u003C/p\u003E\u003Cp\u003EReactor Power 335 MWthermal\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/realdesigns.php#id--Bimodal_NTR\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/realdesigns.php#id--Bimodal_NTR\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E At a thrust of 67,000 N and T/W of 3.06, this means the engine weighs, 21,900 N, or 2,230 kg. So at a 335 MWthermal power this is a 150,000 watts per kg power-to-weight ratio. And the conversion of this thermal to kinetic energy is over 90% efficient as measured by the engine exhaust velocity, where the jet power is calculated as: Power =(1/2)(mass flow rate)(exhaust velocity)^2 = (1/2)(thrust)(exhaust velocity)\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-01T04:52:43Z\u0022 title=\u002209/01/2015 04:52  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 1, 2015\u003C/time\u003E by Exoscientist\u003C/strong\u003E\n\u003Cbr\u003ECorrected jet power formula.\n\u003C/span\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2015-08-31T21:39:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exoscientist\u0022 data-cite=\u0022Exoscientist\u0022\u003E\u003Cdiv\u003EThat is the argument of Zubrin. But there is a flaw with that argument. You do have an alternative method of slowing down by the atmosphere. Note that with the Apollo missions they did do a free return trajectory around the Moon, but the Moon did not have an atmosphere. On return to Earth, the Apollo capsule did do a direct descent into the atmosphere using atmospheric braking. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn Zubrin\u0027s plan, the spacecraft is sent towards Mars on a free return trajectory that, without further correction, would cause the spacecraft to fly past Mars after six months outbound, and then take a further two years to loop back around and re-encounter the Earth. The spacecraft does not have to perform aerobraking at Mars to do this. Therefore, even if the spacecraft suffered a complete propulsion system failure after completing the trans-Mars injection burn, the crew can still get back to Earth.\u003C/p\u003E\u003Cp\u003EDuring the outbound leg, the crew would perform a midcourse correction burn that targets their spacecraft for aerocapture into Mars orbit. For most of the outbound leg, the crew would still have the option of changing their course back to the free return trajectory in the event of trouble. Once the spacecraft is within a few days of Mars, the option to perform free return aborts and powered flybys is lost. From that point onward, the crew are committed to aerocapture and instead rely on a robust series of backup and contingency options instead of abort options.\u003C/p\u003E\u003Cp\u003EOther free return trajectories are available that get the crew to Mars faster, but these require sharp increases in propellant mass, greatly increase the duration of the free return leg, and require dangerously high aerocapture speeds at Mars.\u003C/p\u003E\u003Cp\u003EThe VASIMR spaceship accelerates itself to speeds that are impossibly high for Mars aerocapture and absolutely require use of the propulsion system to slow down. If the spaceship suffered a propulsion failure while traveling at maximum speed, it would find itself on an escape trajectory out of the solar system! It has been suggested that this problem could be solved by inventing an incredible sci-fi atmospheric entry system to withstand the incredible entry speeds. However, this means that the VASIMR spaceship now needs \u003Cstrong\u003Etwo\u003C/strong\u003E incredible sci-fi technologies in order to succeed!\u003C/p\u003E\u003Cp\u003EThe promise of the VASIMR spaceship is that by relegating crewed Mars missions to a sci-fi parallel universe of the far future, crews can be protected from cosmic radiation and zero gravity, neither of which are regarded as significant risks by mission planners. Meanwhile, crewed missions to Mars can readily be performed with Saturn V equivalent heavy lift launch vehicles, existing or near-term technology, and existing space program budgets.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-09-01T02:31:37Z","Content":"\n\u003Cp\u003ESome posts have been trimmed from this thread. Keep the discussion on-topic, please.\u003C/p\u003E\n"},{"CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-09-01T05:15:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EIn Zubrin\u0027s plan, the spacecraft is sent towards Mars on a free return trajectory that, without further correction, would cause the spacecraft to fly past Mars after six months outbound, and then take a further two years to loop back around and re-encounter the Earth. The spacecraft does not have to perform aerobraking at Mars to do this. Therefore, even if the spacecraft suffered a complete propulsion system failure after completing the trans-Mars injection burn, the crew can still get back to Earth.\u003Cp\u003EDuring the outbound leg, the crew would perform a midcourse correction burn that targets their spacecraft for aerocapture into Mars orbit. For most of the outbound leg, the crew would still have the option of changing their course back to the free return trajectory in the event of trouble. Once the spacecraft is within a few days of Mars, the option to perform free return aborts and powered flybys is lost. From that point onward, the crew are committed to aerocapture and instead rely on a robust series of backup and contingency options instead of abort options.\u003C/p\u003E\u003Cp\u003EOther free return trajectories are available that get the crew to Mars faster, but these require sharp increases in propellant mass, greatly increase the duration of the free return leg, and require dangerously high aerocapture speeds at Mars.\u003C/p\u003E\u003Cp\u003EThe VASIMR spaceship accelerates itself to speeds that are impossibly high for Mars aerocapture and absolutely require use of the propulsion system to slow down. If the spaceship suffered a propulsion failure while traveling at maximum speed, it would find itself on an escape trajectory out of the solar system! It has been suggested that this problem could be solved by inventing an incredible sci-fi atmospheric entry system to withstand the incredible entry speeds. However, this means that the VASIMR spaceship now needs \u003Cstrong\u003Etwo\u003C/strong\u003E incredible sci-fi technologies in order to succeed!\u003C/p\u003E\u003Cp\u003EThe promise of the VASIMR spaceship is that by relegating crewed Mars missions to a sci-fi parallel universe of the far future, crews can be protected from cosmic radiation and zero gravity, neither of which are regarded as significant risks by mission planners. Meanwhile, crewed missions to Mars can readily be performed with Saturn V equivalent heavy lift launch vehicles, existing or near-term technology, and existing space program budgets.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Keep in mind that if the Apollo capsule\u0027s approach angle was off by a couple degrees it would have burned up on re-entry or be sent careening off into space. With the VASIMR you could arrange the encounter with the Mars atmosphere to loop it back around Mars to head back to Earth. This would require an accurate encounter angle, just like with Apollo. This is currently doable tech.\u003C/p\u003E\u003Cp\u003E The advanced tech would the case of actually slowing down completely by atmospheric braking at Mars if the propulsion system failed to slow it down before reaching Mars. My opinion is that this is doable with advanced materials that are lightweight and high temperature.\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-09-01T09:31:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exoscientist\u0022 data-cite=\u0022Exoscientist\u0022\u003E\u003Cdiv\u003ENote that because of the high combustion temperatures the SSME and other rocket engines can operate at above 90% efficiency and still be within the Carnot limit.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is true, just about. The Carnot efficiency of the SSME is about 92%. However:\u003C/p\u003E\u003Cp\u003E-Engines operate far below their Carnot efficiency. Carnot efficiency is a hard limit, not a realistic target.\u003C/p\u003E\u003Cp\u003E-Rocket engines are lousy power generation cycles.\u003C/p\u003E\u003Cp\u003E-Nuclear engines operate at lower temperatures than chemical rockets, because of material constraints. The only reason they have higher ISp (not the same as thermal efficiency) is because their exhaust is lighter (H2 as opposed to H20), and therefore moves faster.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E The efficiencies quoted for rocket engines really are the thermal energy to kinetic energy values. Note though that rockets generally do not run at the stoichiometric ratios. For instance for the SSME and most other hydrolox engines the mixture ratio of oxygen to hydrogen is around 6 to 1 rather than 8 to 1. I believe the reason is you want to run at rather fuel rich to cool the engine below that at which it would run at stoich. Here\u0027s one source that gives the efficiency as 97% for the SSME:\u003C/p\u003E\u003Cp\u003EAn Overview of Advanced Concepts for Space Access.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.eas.uccs.edu/aketsdever/MAE%205391_files/JSR%20Launch%20Review%20Paper_Final2.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.eas.uccs.edu/aketsdever/MAE%205391_files/JSR%20Launch%20Review%20Paper_Final2.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe formula quoted there is for propulsive efficiency, not thermal efficiency. Completely different concept:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Propulsive_efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Propulsive_efficiency\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Thermal_efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Thermal_efficiency\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA basic explanation is that thermal efficiency is the proportion of energy in the chamber that gets converted into kinetic energy in the exhaust. This is subject to the Carnot limitation.\u003C/p\u003E\u003Cp\u003EPropulsive efficiency is the proportion of the kinetic energy in the exhaust that goes towards driving the spacecraft. This can approach 100% with the right engine design.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd here is an explanation by the noted authority on space history Henry Spencer that rocket engines generally get better than 90% conversion efficiency, and also why in the atmosphere the exhaust looks hot:\u003C/p\u003E\u003Cp\u003EEfficiency (Bruce P. Dunn; Henry Spencer).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://yarchive.net/space/rocket/efficiency.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://yarchive.net/space/rocket/efficiency.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, he doesn\u0027t say that rocket engines \u003Cem\u003Egenerally\u003C/em\u003E get over 90% thermal efficiency, he says that certain engines, optimised for use in vacuum, with massive engine bells can get above 90% thermal efficiency. Not 97%, by the way.\u003C/p\u003E\u003Cp\u003EI\u0027ll say this again. A regeneratively-cooled rocket engine with a chamber temperature of 3500K, exhausting into vacuum is completely different from a cycle used for electrical power generation.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E About the efficiency of the SSME turbopumps, I had thought they worked by tapping off a portion of the main combustion chamber combustion products. But actually they have their own preburners that drive their turbines. So this is like the case of a full combustion chamber driving a turbine at high efficiency:\u003C/p\u003E\u003Cp\u003ESpace Shuttle main engine.\u003C/p\u003E\u003Cp\u003E1.1 Turbopumps\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/b/bc/Ssme_schematic.svg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://upload.wikimedia.org/wikipedia/commons/b/bc/Ssme_schematic.svg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Shuttle_main_engine#Turbopumps\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Space_Shuttle_main_engine#Turbopumps\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-01T10:40:12Z","Content":"\n\u003Cp\u003EHey Bob! I remember you from the New Mars forums. In any case, you seem to have a big thermodynamics issue here, as peadar1987 points out. You are mixing your efficiency concepts!\u003C/p\u003E\u003Cp\u003EOpen rocket cycles are very, \u003Cem\u003Every\u003C/em\u003E different beasts than closed power generation cycles. And regenerative cooling is just plain cheating in thermodynamic terms, I tell you (even tough it works, of course). The result? Electric drives will \u003Cem\u003Enever\u003C/em\u003E have high specific powers. Just the nature of the beast.\u003C/p\u003E\u003Cp\u003EIn fact VASIMIR isn\u0027t even a particularly good electric drive. It may get a nice Isp and be quite propellant-agnostic, but there are some ion drives out there that blow it out of the water in the really interesting electric drive metrics: electric-to-thrust efficiency, TWR, and more importantly, engine life and complexity.\u003C/p\u003E\u003Cp\u003ENow my pet sci-fi tech \u0022that could actually work\u0022 steps over this problem very neatly: \u003Ca href=\u0022http://www.askmar.com/Fusion_files/From%20SSTO%20to%20Saturns%20Moons.pdf\u0022 rel=\u0022external nofollow\u0022\u003EQED ARC engines\u003C/a\u003E, running off a highly speculative Polywell fusion reactor and regeneratively cooled (hence the All Regenerative Cooled, or ARC part of the name), are limited to about 2,000-3,000s, because then you maximize the thermal capacity of the propellant, and have to provide additional radiators to handle the waste heat. Which drops TWR precipitously! Note that in such a reactor, 80%of the output is converted to electric and only 20% ends up as heat, due to it working on a p-B11 fusion reaction, and thus direct electric conversion of charged particles instead of a heat cycle.\u003C/p\u003E\u003Cp\u003EPoint is, take a really long look at the atomic rockets section on thermodynamics, heat radiators, and \u0022the heat problem\u0022. \u003C/p\u003E\u003Cp\u003ERune. Physics apparently doesn\u0027t like torch drives.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-01T10:42:57Z\u0022 title=\u002209/01/2015 10:42  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 1, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-09-01T12:48:23Z","Content":"\n\u003Cp\u003EPeadar? You look to my numbers? \u003C/p\u003E\u003Cp\u003E----------------------------------------------\u003C/p\u003E\u003Cp\u003EHey, everyone, if we wanna know if a vasimir ship to mars really worth it, we need to imagine the best design, gather some estimations for what could be the lightest and high temperature reactor, what thermal cycle we use as engine, what kind of radiator and its area.. the amount of acceleration and proppelent.\u003C/p\u003E\u003Cp\u003EIt does not seems so hard.. (in case we look for an estimation)\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-09-01T13:13:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EPeadar? You look to my numbers? \u003Cp\u003E----------------------------------------------\u003C/p\u003E\u003Cp\u003EHey, everyone, if we wanna know if a vasimir ship to mars really worth it, we need to imagine the best design, gather some estimations for what could be the lightest and high temperature reactor, what thermal cycle we use as engine, what kind of radiator and its area.. the amount of acceleration and proppelent.\u003C/p\u003E\u003Cp\u003EIt does not seems so hard.. (in case we look for an estimation)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi Angel, I haven\u0027t had a chance to yet. Thermal efficiency stuff I can rattle off the top of my head, but radiative heat transfer I\u0027d have to put a bit more thought into.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-09-01T13:14:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EPeadar? You look to my numbers? \u003Cp\u003E----------------------------------------------\u003C/p\u003E\u003Cp\u003EHey, everyone, if we wanna know if a vasimir ship to mars really worth it, we need to imagine the best design, gather some estimations for what could be the lightest and high temperature reactor, what thermal cycle we use as engine, what kind of radiator and its area.. the amount of acceleration and proppelent.\u003C/p\u003E\u003Cp\u003EIt does not seems so hard.. (in case we look for an estimation)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot hard at all if you are 10 at 6 figure engineer working for a space agency. The only thing you are going to get here are, at best, someone who blenders the parts, carefully configs thier stats, assembles a 3-d model with none of the fine details like wiring, power plant design, solar panel strucure, radiator structure and deploy, etc. \u003C/p\u003E\u003Cp\u003EHere is the base problem\u003C/p\u003E\u003Cp\u003E- solar panels, not size but storable size and watt/mass ratio\u003C/p\u003E\u003Cp\u003E- radiator panels, storable size and watt/mass ratio\u003C/p\u003E\u003Cp\u003E- Nuclear plant, profile and mass \u002B infrastructur required including radiators, shielding.\u003C/p\u003E\u003Cp\u003EIn terms of the 6 to 9 month transfer window I think either technology would work, but for the 39day transfer you are going to need one heck of a good reliable engine to bring which ever into mars orbit, this must also include a command vehicle and a lander much larger than the lunar lander, otherwise its a suicide mission.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2015-09-01T13:19:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003ERune. Physics apparently doesn\u0027t like torch drives.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENonsense! Physics loves torch drives: an open-cycle gas-core nuclear-thermal rocket has enormous specific impulse and power. Atomic rockets says the minimum thrust-to-weight ratio is 1.8 and minimum specific impulse over 3,500s. The website continued that the theoretically-maximum power is almost 10,000 seconds thrust-to-weight ratio of 20.\u003C/p\u003E\u003Cp\u003EWe could even use antimatter annihilation contained by electromagnets well-separated from the ship\u0027s payload. Radiation decreasing with distance squared, the separation would minimize heating, permitting such engines as earthbound observers might mistake for dying stars. Just mind the neutron flux and don\u0027t burst the tank!\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-09-01T13:58:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EHi Angel, I haven\u0027t had a chance to yet. Thermal efficiency stuff I can rattle off the top of my head, but radiative heat transfer I\u0027d have to put a bit more thought into.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is not need to search for constants and do the math when we have web sites that do it for us.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.endmemo.com/physics/radenergy.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.endmemo.com/physics/radenergy.php\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.easycalculation.com/physics/thermodynamics/carnot-cycle-efficiency.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.easycalculation.com/physics/thermodynamics/carnot-cycle-efficiency.php\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe point is that we need to maximize reactor temperature, I guess 1500c may be our top, or maybe there is different technologies to achieve high temperatures but we are not sure of the weight penalties that might have.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://large.stanford.edu/courses/2013/ph241/kallman1/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://large.stanford.edu/courses/2013/ph241/kallman1/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe reactor power is the last thing we need to calculate, how much payload we need to carry to mars?\u003C/p\u003E\n"},{"CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-09-01T18:31:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EThis is true, just about. The Carnot efficiency of the SSME is about 92%. However:\u003Cp\u003E-Engines operate far below their Carnot efficiency. Carnot efficiency is a hard limit, not a realistic target.\u003C/p\u003E\u003Cp\u003E-Rocket engines are lousy power generation cycles.\u003C/p\u003E\u003Cp\u003E-Nuclear engines operate at lower temperatures than chemical rockets, because of material constraints. The only reason they have higher ISp (not the same as thermal efficiency) is because their exhaust is lighter (H2 as opposed to H20), and therefore moves faster.\u003C/p\u003E\u003Cp\u003EThe formula quoted there is for propulsive efficiency, not thermal efficiency. Completely different concept:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Propulsive_efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Propulsive_efficiency\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Thermal_efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Thermal_efficiency\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA basic explanatioy 6 ton is that thermal efficiency is the proportion of energy in the chamber that gets converted into kinetic energy in the exhaust. This is subject to the Carnot limitation.\u003C/p\u003E\u003Cp\u003EPropulsive efficiency is the proportion of the kinetic energy in the exhaust that goes towards driving the spacecraft. This can approach 100% with the right engine design.\u003C/p\u003E\u003Cp\u003ENope, he doesn\u0027t say that rocket engines \u003Cem\u003Egenerally\u003C/em\u003E get over 90% thermal efficiency, he says that certain engines, optimised for use in vacuum, with massive engine bells can get above 90% thermal efficiency. Not 97%, by the way.\u003C/p\u003E\u003Cp\u003EI\u0027ll say this again. A regeneratively-cooled rocket engine with a chamber temperature of 3500K, exhausting into vacuum is completely different from a cycle used for electrical power generation.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E I\u0027m curious. What does the NIST REFPROP 9.0 program say is the efficiency of the SSME when you take into account the mixture ratio is only 6 to 1? This would leave 1/4th the hydrogen uncombusted so would reduce the initial thermal energy.\u003C/p\u003E\u003Cp\u003E About the efficiency of turbopumps in general, the source I read that said some pumps were able to reach 90% efficiency was on general centrifugal pumps, which no doubt included water pumps: \u003C/p\u003E\u003Cp\u003ECentrifugal Pump EfficiencyÃ¢â‚¬â€What Is Efficiency?\u003C/p\u003E\u003Cp\u003E2012-02-01 ISSUE\u003C/p\u003E\u003Cp\u003Eby Joe Evans, Ph.D\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMany medium and larger centrifugal pumps offer efficiencies of 75 to 93 percent and even the smaller ones usually fall into the 50 to 70 percent range. Large AC motors, on the other hand, approach an efficiency of 97 percent, and any motorÃ¢â‚¬â€ten horsepower and aboveÃ¢â‚¬â€can be designed to break the 90 percent barrier.\u003C/p\u003E\u003Cp\u003EThe overall efficiency of a centrifugal pump is simply the ratio of the water (output) power to the shaft (input) power and is illustrated by the equation below:\u003C/p\u003E\u003Cp\u003EEf = PW / PS\u003C/p\u003E\u003Cp\u003EWhere:\u003C/p\u003E\u003Cp\u003EEf= efficiency\u003C/p\u003E\u003Cp\u003EPw= the water power\u003C/p\u003E\u003Cp\u003EPs= the shaft power\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.pumpsandsystems.com/topics/pumps/pumps/centrifugal-pump-efficiency-what-efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.pumpsandsystems.com/topics/pumps/pumps/centrifugal-pump-efficiency-what-efficiency\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E The only case I saw of a pump with higher than 90% efficiency was of hydroelectric turbines driven by water flow that convert this to mechanical power at 95% efficiency. \u003C/p\u003E\u003Cp\u003E The SSME hydrogen pumps, from a different source, were quoted as at 80% efficiency. Probably good enough, but I\u0027d like to see if they could be pushed to 90% by sacrificing some weight efficiency.\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-01T19:23:24Z\u0022 title=\u002209/01/2015 07:23  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 1, 2015\u003C/time\u003E by Exoscientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-09-01T19:22:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EHey Bob! I remember you from the New Mars forums. In any case, you seem to have a big thermodynamics issue here, as peadar1987 points out. You are mixing your efficiency concepts!\u003Cp\u003EOpen rocket cycles are very, \u003Cem\u003Every\u003C/em\u003E different beasts than closed power generation cycles. And regenerative cooling is just plain cheating in thermodynamic terms, I tell you (even tough it works, of course). The result? Electric drives will \u003Cem\u003Enever\u003C/em\u003E have high specific powers. Just the nature of the beast.\u003C/p\u003E\u003Cp\u003EIn fact VASIMIR isn\u0027t even a particularly good electric drive. It may get a nice Isp and be quite propellant-agnostic, but there are some ion drives out there that blow it out of the water in the really interesting electric drive metrics: electric-to-thrust efficiency, TWR, and more importantly, engine life and complexity.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E There are two separate questions on efficiency being discussed: rocket engine efficiency and pump efficiency. In regards to the question of rocket engine efficiency, if you look at the equations at the link on \u0022propulsive efficiency\u0022, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Propulsive_efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Propulsive_efficiency\u003C/a\u003E, you see that has nothing to do with what Henry Spencer was discussing in regards to rocket engine efficiency. It really is thermal efficiency Henry is discussing. And in the quote I provided from the report \u0022An Overview of Advanced Concepts for Space Access\u0022, the equation for calculating the efficiency of the rocket engines includes the enthalpy of the reaction. Again that has nothing to do with the concept of propulsive efficiency. \u003C/p\u003E\u003Cp\u003E The source for the efficiency of the SSME turbopumps just gave the efficiency as 80%. I\u0027ll see if I can find out how that was calculated.\u003C/p\u003E\u003Cp\u003E About VASIMR, it\u0027s not my preferred system either. I think Hall effect thrusters are better.\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-01T19:58:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exoscientist\u0022 data-cite=\u0022Exoscientist\u0022\u003E\u003Cdiv\u003EThere are two separate questions on efficiency being discussed: rocket engine efficiency and pump efficiency. In regards to the question of rocket engine efficiency, if you look at the equations at the link on \u0022propulsive efficiency\u0022, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Propulsive_efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Propulsive_efficiency\u003C/a\u003E, you see that has nothing to do with what Henry Spencer was discussing in regards to rocket engine efficiency. It really is thermal efficiency Henry is discussing. And in the quote I provided from the report \u0022An Overview of Advanced Concepts for Space Access\u0022, the equation for calculating the efficiency of the rocket engines includes the enthalpy of the reaction. Again that has nothing to do with the concept of propulsive efficiency. \u003Cp\u003E The source for the efficiency of the SSME turbopumps just gave the efficiency as 80%. I\u0027ll see if I can find out how that was calculated.\u003C/p\u003E\u003Cp\u003E About VASIMR, it\u0027s not my preferred system either. I think Hall effect thrusters are better.\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the SSME\u0027s use regenerative cooling, which is as I said a very big \u0022cheat\u0022. They take advantage of, literally, tons per second of liquid hydrogen to sink their waste heat in. With radiators, you are stuck with closed thermodynamic cycles, and Carnot efficiency kicks in.\u003C/p\u003E\u003Cp\u003EAnyhow, about the actual physics concepts you seem to be having a trouble with. Trust me, it\u0027s easy to get mixed up because most of these are engineering units, and we engineers like to use the same three words for everything. The actual definition you linked me to states:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u0022overall propulsive efficiency \\eta is the efficiency, in percent, with which the energy contained in a vehicle\u0027s propellant is converted into useful energy, to replace losses due to aerodynamic drag, gravity, and acceleration\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo it is a measure of conversion from chemical energy to kinetic energy. Chemical energy stored in the propellant. See how that might not make \u003Cem\u003Eany\u003C/em\u003E sense when considering an electric drive? Also, consider that there are three different methods to calculate it, depending on whether you are considering a propeller engine, a jet, or a rocket. That is also a big clue that something fishy is going on. And the explanation is simple: like Isp, \u0022propulsive efficiency\u0022 is an engineering kludge of a concept, that can only be applied in a narrow field for which it was intended. That field certainly \u003Cem\u003Edoes not\u003C/em\u003E cover nuclear-electric drive systems with closed thermodynamic cycles feeding electricity to an ion engine through an alternator.\u003C/p\u003E\u003Cp\u003EWhen looking how to model the performance of a hypothetical system of those characteristics, you are much better off using the sets of equations Winchell Chung offers in Atomic Rockets, which are basic, universal, and come from a physics, not engineering, point of view. He also sprinkles the site with awesome references to real-world designs, and you will be hard pressed to find any funny, unrealistic numbers among those.\u003C/p\u003E\u003Cp\u003EThe end result is more or less that, really, honest-to-Kod, a nuclear-thermal-electric drive system is never going to put anywhere near \u003Cem\u003Ehalf\u003C/em\u003E the wattage it generates as useful thrust. And that means some seriously heavy and big radiators that kill TWR even at insane levels of power... and consider that the crew and electronics has to survive being near that reactor, too.\u003C/p\u003E\u003Cp\u003ERune. It\u0027s funny that such a complicated question to answer with mathematical proof can be summed up in two lines of text.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-01T20:00:35Z\u0022 title=\u002209/01/2015 08:00  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 1, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-09-01T21:43:36Z","Content":"\n\u003Cp\u003EWhatÃ‚Â´s everybody talking about? This topic is about Vasimr!\u003C/p\u003E\u003Cp\u003ENot sure why turbo pumps or electrical pumps are mentioned.\u003C/p\u003E\u003Cp\u003ERockets ISP is lower than 450s, Nuclear rocket ISP is lower than 1000s, but that is nothing compared the isp you might have with vasimr, of course there are some cons, but from the top of my head I can said for sure, if we are talking of just 1 trip to mars without worrying at the trip time.. then yes.. lets use rockets.\u003C/p\u003E\u003Cp\u003EBut if the goal is to make a ship capable of interplanetary travel that can be reusable with short trip times, then vasimr seems to be the way to go.\u003C/p\u003E\n"}]}