{"TopicId":119752,"ForumId":44,"TopicTitle":"AMD 8 Core vs Intel 8 Core","CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-08-30T17:28:50Z","PageNum":1,"Articles":[{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-08-30T17:28:50Z","Content":"\n\u003Cp\u003ESo, i\u0027m thinking about building a new gaming PC, and came across the fact that Intel 8 cores are $1000 while AMD\u0027s are \u0026lt;$200. Why is that? How much worse could an AMD 8 core be?\u003C/p\u003E\u003Cp\u003EAlso, would appreciate any references on building PC\u0027s, specifically, on liquid cooling.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-08-30T18:03:34Z","Content":"\n\u003Cp\u003ELiquid cooling lets you use a bigger heatsink than you\u0027d be able to use with air cooling. All the liquid really does is move the heat from the CPU to the (possibly external) heatsink/fan, it\u0027s still cooled to the outside air. It tends to be louder than air cooling due to pump noise, and won\u0027t cool things any better if the heatsink/fan are the same size as what you\u0027d have with air. In general it\u0027s not worth the effort.\u003C/p\u003E\u003Cp\u003EWRT AMD vs Intel, Intel has much better per-core performance, and KSP cares about single-threaded performance FAR more than multi-threading. So get the fastest single-thread CPU you can (hint: \u003Ca href=\u0022http://anandtech.com/bench/CPU/1028\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://anandtech.com/bench/CPU/1028\u003C/a\u003E). Basically each Intel core is a lot better than each AMD core, but AMD can get you more cores for the same price, and most workloads for things most people do benefit from having extra cores so AMD is a good buy. But KSP is not most workloads, it\u0027s limited to a single core for the most demanding thread (the physics) and that\u0027s unlikely to change much soon. 1.1 might make it so different ships get different physics threads, but if you dock or build huge ships it will still need to be confined to one thread.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-30T19:44:03Z","Content":"\n\u003Cp\u003EIntel has a totally different architecture than AMD. The cores are not comparable at all. Intel cores are close to complete, discrete cores, each with their own hyper-threading too. AMD cores are somewhere between hyper-threading and full cores. Each set of 2 \u0027cores\u0027 share a lot of architecture, much more than is the case with Intel. Calling them cores is a great marketing move and it is not really a lie, but it also suggests more than is true. Saying it is actually a quad core with fancy hyper-threading is equally valid.\u003C/p\u003E\u003Cp\u003EBesides, comparing chips based on specifications is a fool\u0027s game anyway. The only proper way to gage performance is to look at benchmarks that were actually measured in real life scenarios. No artificial benchmarks and absolutely no comparing based on technical specifications. Find the chip you are looking at, preferably in a game you are looking at and see what it does.\u003C/p\u003E\u003Cp\u003EIntel 8 cores are overkill for modern games and a waste of money, and hyper-treading generally is too. Something like a i5 6600K will give you amazing performance, without costing you an arm and a leg. If your budget is a little tighter, AMD might become interesting too, since they offer quite a lot of performance for a given amount of money, but it really depends on the game or specific application.\u003C/p\u003E\u003Cp\u003EIf would advise against water cooling, unless you really know what you are doing. If you want to do that right (so no ready made kits) it costs an obscene amount of money for rather small gains. Air cooling is highly effective nowadays, cheap, low maintenance, silent and easy to deal with. Unless you want to get into water cooling for the fun of it, there are more effective ways of getting better performance or more silent systems. Not to mention the hassle of emptying and filling your loop, the possibility of leaks (always fun near expensive electronics), the added weight, etcetera.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-30T19:47:50Z\u0022 title=\u002208/30/2015 07:47  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 30, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-08-30T21:55:50Z","Content":"\n\u003Cp\u003EAgree here, intel 8 cores are very fast but also expensive, they are also overkill for games. \u003C/p\u003E\u003Cp\u003EWater cooling is just an issue if you overclock a lot or run stuff like the intel 8 core cpu. \u003C/p\u003E\u003Cp\u003EI have an intel 6 core at 4 GHz and use water cooling to reduce noise as the cpu fan tended to run too fast, its an pre asembled set with an 12x24 cm radiator and two fans.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-30T23:16:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EIntel has a totally different architecture than AMD. The cores are not comparable at all. Intel cores are close to complete, discrete cores, each with their own hyper-threading too. AMD cores are somewhere between hyper-threading and full cores. Each set of 2 \u0027cores\u0027 share a lot of architecture, much more than is the case with Intel. Calling them cores is a great marketing move and it is not really a lie, but it also suggests more than is true. Saying it is actually a quad core with fancy hyper-threading is equally valid.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHyperthreading on the intel is a technology that allows the logical splitting of cores. Its not neccesary for Intels function in most situation. On most computers you have alot of slow processes and a few fast processes. I upgraded a very old computer with a cheep early dual core and increased its windows speed many fold because it moved a RS232 process on a simulated dos emulator that needed to constantly check com1. This allowed the windows process to free itself. So if you are running something like creating 8 objects using new class instance, and each instance can run in the background, then the hyperthreading might be used. But most run when active and are silent in the background \u003C/p\u003E\u003Cp\u003EI used to be a big fan of AMD, that waned because the lifespan of AMD processors was typically 6 years but Intel typically last more than 10. Most of the AMD processors I\u0027ve thrown away were dead, most of the intel processors I\u0027ve thrown away were obsolete. I have one computer that is a MMx 233 that I used as A server CPU overclocked to 250 because the Mb was designed for AMD that I used for 10 years and then it is are now on a machine that Runs an HPLC.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-31T01:29:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003ESo, i\u0027m thinking about building a new gaming PC, and came across the fact that Intel 8 cores are $1000 while AMD\u0027s are \u0026lt;$200. Why is that? How much worse could an AMD 8 core be?\u003C/div\u003E\u003C/blockquote\u003ENot five times worse, but certainly worse in a vast array of benchmarks.\u003Cp\u003EI\u0027d say that up to Ã‚Â£150 or so - FX-8370, Core i5 4460 - the processor market is pretty competitive, with Intel and AMD offerings at any price point being pretty close overall, though KSP in particular will always do better on Intel. Above that price point though AMD just don\u0027t have anything that really matches fast Core i5\u0027s and i7\u0027s on performance, still less the \u0022extreme\u0022 Intel processors. That allows Intel to charge what they think will get them the most profit.\u003C/p\u003E\u003Cp\u003EA fun bit of history in the area. Back in mid 2013 AMD launched their FX-9590, \u0022the world\u0027s first 5 GHz CPU\u0022, and asked around $800 for it putting it squarely against Intel\u0027s $1000 6-core i7 4960X. Within a few months the FX-9590\u0027s price was slashed to something like $250, while the Intel processor was still a grand. That says volumes about how AMD just couldn\u0027t, and still can\u0027t, compete at the high end.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-08-31T03:19:28Z","Content":"\n\u003Cp\u003EHere is some insider perspective for you. Most modern PC games are optimized under assumption that you\u0027ll have four cores. Console games tend to be built around 6 cores, but CPUs on modern consoles are such fail, that if it\u0027s a straight up port, you won\u0027t be bottlenecking on CPU anyways.\u003C/p\u003E\u003Cp\u003EHaving more cores won\u0027t hurt, of course, so if you can afford an 8 core Intel, great! But if you have budgetting constraints, and are considering AMD CPUs, I wouldn\u0027t. Get yourself a quad-core Intel instead, and you\u0027ll still have better gaming performance.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-08-31T13:56:43Z","Content":"\n\u003Cp\u003EThanks for all the replies. \u003C/p\u003E\u003Cp\u003EI\u0027m not really sure if i have an answer. Why is AMD 10x cheaper than Intel? Are AMD\u0027s also 10x worse? \u003C/p\u003E\u003Cp\u003EAlso, w.r.t. liquid cooling: does one buy separate kits for CPU and GPU or do GPU\u0027s not allow for liquid cooling? Also, does one need to buy a CPU meant for liquid cooling, or can any CPU be modified (by just removing the heat sink) for liquid cooling?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SAI Peregrinus\u0022 data-cite=\u0022SAI Peregrinus\u0022\u003E\u003Cdiv\u003ELiquid cooling lets you use a bigger heatsink than you\u0027d be able to use with air cooling. All the liquid really does is move the heat from the CPU to the (possibly external) heatsink/fan, it\u0027s still cooled to the outside air. It tends to be louder than air cooling due to pump noise, and won\u0027t cool things any better if the heatsink/fan are the same size as what you\u0027d have with air. In general it\u0027s not worth the effort. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs this really true? While it is true that all heat is eventually rejected to air, liquid cooling is supposed to keep the processor a lot cooler, since the heat is removed more efficiently from the chip...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SAI Peregrinus\u0022 data-cite=\u0022SAI Peregrinus\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWRT AMD vs Intel, Intel has much better per-core performance, and KSP cares about single-threaded performance FAR more than multi-threading. So get the fastest single-thread CPU you can (hint: \u003Ca href=\u0022http://anandtech.com/bench/CPU/1028\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://anandtech.com/bench/CPU/1028\u003C/a\u003E). Basically each Intel core is a lot better than each AMD core, but AMD can get you more cores for the same price, and most workloads for things most people do benefit from having extra cores so AMD is a good buy. But KSP is not most workloads, it\u0027s limited to a single core for the most demanding thread (the physics) and that\u0027s unlikely to change much soon. 1.1 might make it so different ships get different physics threads, but if you dock or build huge ships it will still need to be confined to one thread.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought 1.1 with unity 5 was supposed to change all that. Multithreaded physics... everything i\u0027ve read so far has said that bigger ships will perform better. Do you have a reference to suggest it wont?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-08-31T14:21:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EI\u0027m not really sure if i have an answer. Why is AMD 10x cheaper than Intel? Are AMD\u0027s also 10x worse?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not how pricing works. At high end, demand for components becomes fairly inellastic. So very small changes in quality result in huge changes in equilibrium prices. This is particularly true because Intel has very little competition on the high end. Still, that $800 gap is there for a reason.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EAlso, w.r.t. liquid cooling: does one buy separate kits for CPU and GPU or do GPU\u0027s not allow for liquid cooling? Also, does one need to buy a CPU meant for liquid cooling, or can any CPU be modified (by just removing the heat sink) for liquid cooling?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny CPU. You will need to install a special heatsink instead of the stock one. They do make water-cooling kits for GPUs. But it tends to be more work to install it. There are also water-cooling ready graphics cards out there. Just hook up the hoses and you\u0027re set.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EIs this really true? While it is true that all heat is eventually rejected to air, liquid cooling is supposed to keep the processor a lot cooler, since the heat is removed more efficiently from the chip...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWater cooling only transfers heat. It doesn\u0027t remove it. In fact, it\u0027s impossible to just get rid of the heat. It has to go somewhere. In air-cooled system, heat goes directly from CPU heatsink to air. Which limits cooling rate by surface area of the CPU heatsink and air flow.\u003C/p\u003E\u003Cp\u003EWith water-cooling, water transfers heat from CPU heat sink to a larger external heatsink, which usually can be significantly larger and allows for better airflow. But yes, eventually, all that heat still has to go into air.\u003C/p\u003E\n"},{"CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-08-31T15:46:09Z","Content":"\n\u003Cp\u003EIntel\u0027s octocore is a state of the art CPU intended for high end applications. It\u0027s certainly much more than up to the task of gaming but it\u0027s really meant for workstations.\u003C/p\u003E\u003Cp\u003EAMD octocores are frankly mid tier CPUs.\u003C/p\u003E\u003Cp\u003EThe key thing to keep in mind is that most (not all) games are more dependent on one or two strong cores than having a lot of cores. A quadcore i5 with great single core performance will do much better for you than an octocore with weak single core performance. Very few games can do anything useful with all eight cores from either manufacturer.\u003C/p\u003E\u003Cp\u003ECLC units don\u0027t impart miraculous cooling. Their main attraction (to me, anyway) is stabilization, they produce far fewer heat spikes than a fan. They\u0027re also good for displacing heat, as the heat will be moved to the radiator which may (or may not) be more convenient for your design than blowing it out the back of the case, and they can raise the ceiling on overclocks if you want to do that. However, I\u0027ve never once heard the pump on one without trying to stick my head inside the case to do it, tiny high-speed GPU fans are many orders of magnitude noisier than either the pump or the radiator fans on mine.\u003C/p\u003E\u003Cp\u003EBut are you talking about CLC or custom/full immersion? There\u0027s quite a difference both in what you can expect out of it and expense/difficulty and risks. What are you trying to get out of it? Just great gaming performance, or do you want a computer to tinker on, or a competitive overclocker, or what? Full immersion on an X series Intel is maybe a little ambitious if you just want to game.\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-08-31T18:14:25Z","Content":"\n\u003Cp\u003EHigh end Intel CPUs also serve the scientific computing market-- they\u0027re pretty good for building \u0022cluster\u0022 computers. AMD CPUs are not really designed for that kind of number crunching. The extra demand there probably helps keep the prices up.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-31T18:15:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EHyperthreading on the intel is a technology that allows the logical splitting of cores. Its not neccesary for Intels function in most situation. On most computers you have alot of slow processes and a few fast processes. I upgraded a very old computer with a cheep early dual core and increased its windows speed many fold because it moved a RS232 process on a simulated dos emulator that needed to constantly check com1. This allowed the windows process to free itself. So if you are running something like creating 8 objects using new class instance, and each instance can run in the background, then the hyperthreading might be used. But most run when active and are silent in the background \u003Cp\u003EI used to be a big fan of AMD, that waned because the lifespan of AMD processors was typically 6 years but Intel typically last more than 10. Most of the AMD processors I\u0027ve thrown away were dead, most of the intel processors I\u0027ve thrown away were obsolete. I have one computer that is a MMx 233 that I used as A server CPU overclocked to 250 because the Mb was designed for AMD that I used for 10 years and then it is are now on a machine that Runs an HPLC.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHyper-threading is a small bit of extra hardware architecture. This tiny bit of extra hardware allows is faster switching of (CPU) tasks. This ensures the chip is idling less while switching tasks, making more efficient use of the portion doing the actual calculations. So while the OS sees double the cores, only a small bit of extra chip is active. Most of the chip is (almost) exactly the same as a non hyper-treading chip. \u003C/p\u003E\u003Cp\u003EPrograms that benefit the most from this are programs that switch a lot between tasks. A famous example is a video task, which consists of relatively simple calculations that need to be done many, many times over.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003Eliquid cooling is supposed to keep the processor a lot cooler, since the heat is removed more efficiently from the chip...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the heat will be removed more efficiently, but no, it will not be a lot. You might be able to overclock a chip a little bit further when cooled with water, but much more than a couple of hundred MHz it will not be. Those gains are great for benchmarks, but yield little to no actual real life performance that you will notice. It is an awful lot of trouble for something you will not really notice.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hagen von Tronje\u0022 data-cite=\u0022Hagen von Tronje\u0022\u003E\u003Cdiv\u003EIntel\u0027s octocore is a state of the art CPU intended for high end applications. It\u0027s certainly much more than up to the task of gaming but it\u0027s really meant for workstations.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt stock speeds, the newest Skylake quadcores will outperform the Intel octocore in most applications, unless it is a properly threaded app. Even when it comes to workstation-ish tasks, like CAD design, a quadcore often is the better choice. When you start looking at overclocking both to the maximum and doing almost perfectly multi-threaded tasks like rendering, the hexacores and octocores start gaining ground.\u003C/p\u003E\u003Cp\u003EIf you just want to game, be smart and buy an i5. It will be as fast as an i7 in almost every game, overclock well and be relatively cheap to boot. It is just the perfect choice for gaming. If you want to do other things too, it really depends on those other things, but generally an i5 is plenty good.\u003C/p\u003E\u003Cp\u003EI always say that if you do not know why you would need an i7, you do not need an i7. There are a couple of specific scenarios those make sense and those scenarios do not apply to most people.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ten Key\u0022 data-cite=\u0022Ten Key\u0022\u003E\u003Cdiv\u003EHigh end Intel CPUs also serve the scientific computing market-- they\u0027re pretty good for building \u0022cluster\u0022 computers. AMD CPUs are not really designed for that kind of number crunching. The extra demand there probably helps keep the prices up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen it comes to pure number crunching, AMDs actually do quite well. Those kinds of tasks often scale very well over multiple cores. The problem is the power consumption: if you light those cores up 24/7, a cheaper chip that consumes more power will quickly vaporize your initial gains. When it comes to servers and super computing, saving even a little power can make an upgrade worth it. And I hate to say it, but that is where AMD currently loses out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T18:18:46Z\u0022 title=\u002208/31/2015 06:18  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-08-31T18:46:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EThat\u0027s not how pricing works. At high end, demand for components becomes fairly inellastic. So very small changes in quality result in huge changes in equilibrium prices. This is particularly true because Intel has very little competition on the high end. Still, that $800 gap is there for a reason.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMakes sense. Comparable Intel and AMD cpus might be priced (linearly) proportional to their performance, but higher end, it becomes non-linear.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAny CPU. You will need to install a special heatsink instead of the stock one. They do make water-cooling kits for GPUs. But it tends to be more work to install it. There are also water-cooling ready graphics cards out there. Just hook up the hoses and you\u0027re set.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the info.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWater cooling only transfers heat. It doesn\u0027t remove it. In fact, it\u0027s impossible to just get rid of the heat. It has to go somewhere. In air-cooled system, heat goes directly from CPU heatsink to air. Which limits cooling rate by surface area of the CPU heatsink and air flow.\u003C/p\u003E\u003Cp\u003EWith water-cooling, water transfers heat from CPU heat sink to a larger external heatsink, which usually can be significantly larger and allows for better airflow. But yes, eventually, all that heat still has to go into air.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-31T18:53:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EMakes sense. Comparable Intel and AMD cpus might be priced (linearly) proportional to their performance, but higher end, it becomes non-linear.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is no linear proportionality when it comes to computer chips. Cheap chips are often relatively expensive (since shipping, packaging, personnel and store costs remain the same) and the top tier is relatively really expensive too. It is a bit of a wonky curve, I guess \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EYes, technicalities aside, what is the advantage?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you read \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/133009-AMD-8-Core-vs-Intel-8-Core?p=2171376\u0026amp;viewfull=1#post2171376\u0022 rel=\u0022external nofollow\u0022\u003Emy post\u003C/a\u003E? The gains generally are slim. Something like 200-400 MHz, though it can be more or less, depending on the chip and cooling. It is generally not enough to be noticed by the user without benchmarking.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf the performance gain is so minimal, why do people do it? If the performance gain is just shrinking the heat sink size on the CPU, who cares?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause some people want the best result possible for 24/7 computing (since more exotic forms or cooling are generally not feasible for every day use), other people like to fiddle with complex things for the fun of it and yet more people like to show off with their contrived contraption.\u003C/p\u003E\u003Cp\u003EIn short, water cooling is a hobby for most, not a necessity.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-08-31T19:28:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDid you read \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/133009-AMD-8-Core-vs-Intel-8-Core?p=2171376\u0026amp;viewfull=1#post2171376\u0022 rel=\u0022external nofollow\u0022\u003Emy post\u003C/a\u003E? The gains generally are slim. Something like 200-400 MHz, though it can be more or less, depending on the chip and cooling. It is generally not enough to be noticed by the user without benchmarking.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, may not have read in full. Got a lot of responses...\u003C/p\u003E\u003Cp\u003EWhat limits the gains to 400 MHz? Chip voltages and/or computer crashes? Or chip temperature i.e. liquid cooling isnt much better than a well-designed air heat sink...\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-31T19:45:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EWhat limits the gains to 400 MHz?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me be clear, 400 MHz is just an estimate. There is nothing that limits chips under water to that specific gain, since there many factors that play a role. I just meant to indicate that the gains are fairly minor. Maybe I should not have given a specific example - let us just say it is a handful of percent instead.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EChip voltages and/or computer crashes? Or chip temperature i.e. liquid cooling isnt much better than a well-designed air heat sink...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is mostly temperature. Water is still a room temperature liquid, so while it is somewhat more effective at removing heat, the difference is small. A lot smaller than it would be with liquid nitrogen or even helium. As a result, the overclock gains are relatively small too. They are there, but when you look at all the money and time invested, it hardly seems worth it unless you just want to fiddle with water cooling for the fun of it or do exceptional computational things.\u003C/p\u003E\u003Cp\u003EThe second part of the deal is the fact that air cooling has matured in the past few years. When the step was made from pure heat sinks (block \u0027o metal) to heat pipe type coolers, huge steps could be made. By now, heat pipe coolers are very well developed and amazingly good at what they do as a result. Water cooling used to provide much more of a gain, because air coolers used to be much less advanced.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T19:47:53Z\u0022 title=\u002208/31/2015 07:47  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-08-31T20:03:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003ELet me be clear, 400 MHz is just an estimate. There is nothing that limits chips under water to that specific gain, since there many factors that play a role. I just meant to indicate that the gains are fairly minor. Maybe I should not have given a specific example - let us just say it is a handful of percent instead.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am mostly concerned with the \u003Cstrong\u003Ecause \u003C/strong\u003Eof the limit, rather than the specific value of the limit.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt is mostly temperature. Water is still a room temperature liquid, so while it is somewhat more effective at removing heat, the difference is small.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dont understand the logic here. Water is 20x better than air at transferring heat (0.5 W/mK vs 0.025 W/mK thermal conductivity). A well designed water cooler should be able to keep the temperature much lower than an air cooled one. The only reason this wouldnt be the case is because of the thermal interface materials (TIMs) which might account for the bulk of the thermal resistance; in this case, you either have to bypass the TIM or use cryogenic fluids.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-31T20:17:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EI dont understand the logic here. Water is 20x better than air at transferring heat (0.5 W/mK vs 0.025 W/mK thermal conductivity). A well designed water cooler should be able to keep the temperature much lower than an air cooled one. The only reason this wouldnt be the case is because of the thermal interface materials (TIMs) which might account for the bulk of the thermal resistance; in this case, you either have to bypass the TIM or use cryogenic fluids.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are pretty much right there. Delidding is a popular pastime among overclockers, and absolutely necessary if you want to play with the big boys. A packaged chip can only expel heat so fast.\u003C/p\u003E\u003Cp\u003EPlease note that plainly looking at air versus water conductivity does you little good. Heat pipes are nifty devices that use the vaporizing of a liquid in a vacuum to transfer heat. Air is only used in the final stage, but the same can be said about water cooling. Calling air cooling does current coolers little justice, calling them vapour phase cooling systems would be more accurate. Like I said: this type of coolers is really quite good compared to heat sink air type coolers. It is effective and compared to water robust, cheap and almost fool proof. They spread heat over a large area to help poor air conductivity along, just like water cooling does. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/2vk5B6Gga10?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T20:19:44Z\u0022 title=\u002208/31/2015 08:19  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-08-31T20:21:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EYou are pretty much right there. Delidding is a popular pastime among overclockers, and absolutely necessary if you want to play with the big boys. A packaged chip can only expel heat so fast.\u003Cp\u003EPlease note that plainly looking at air versus water conductivity does you little good. Heat pipes are nifty devices that use the vaporizing of a liquid in a vacuum to transfer heat. Air is only used in the final stage, but the same can be said about water cooling. Calling air cooling does current coolers little justice, calling them vapour phase cooling systems would be more accurate. Like I said: this type of coolers is really quite good compared to heat sink air type coolers. It is effective and compared to water robust, cheap and almost fool proof. They spread heat over a large area to help poor air conductivity along, just like water cooling does. \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/2vk5B6Gga10?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven heat pipes wont help if a TIM is thermal bottleneck.\u003C/p\u003E\u003Cp\u003EMicrochannel water coolers can be just as good if not better than heat pipes, though heat pipes are passive (which is both an advantage and a disadvantage).\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-08-31T22:34:47Z","Content":"\n\u003Cp\u003EPrecisely. And the most common reason to use water cooling is because heat-sink-to-air is the bottleneck. In which case you have to either use a much larger external heat sink and water cooling, or you can go with active cooling and force heat into heat sink.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-09-01T01:10:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EPrecisely. And the most common reason to use water cooling is because heat-sink-to-air is the bottleneck. In which case you have to either use a much larger external heat sink and water cooling, or you can go with active cooling and force heat into heat sink.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you saying heat sink to air \u003Cstrong\u003Eis \u003C/strong\u003Ethe bottleneck OR that \u003Cstrong\u003Ewhen \u003C/strong\u003Eit is, switching to liquid cooling helps?\u003C/p\u003E\u003Cp\u003EPumped liquid cooling and heat pipes can easily achieve thermal conductances greater than the TIM, making the TIM the bottleneck. If the TIM is not the bottleneck, then switching to liquid cooling should give significant improvement, no?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-09-01T02:42:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EAre you saying heat sink to air \u003Cstrong\u003Eis \u003C/strong\u003Ethe bottleneck OR that \u003Cstrong\u003Ewhen \u003C/strong\u003Eit is, switching to liquid cooling helps?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe later.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EPumped liquid cooling and heat pipes can easily achieve thermal conductances greater than the TIM, making the TIM the bottleneck. If the TIM is not the bottleneck, then switching to liquid cooling should give significant improvement, no?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf your external heat sink has the same parameters as your CPU sink, then liquid cooling will make things \u003Cem\u003Eworse\u003C/em\u003E, since you now effectively have two TIM layers. The whole point is that you still have an external heat sink with much greater area and better ventilation than the heat sink you could possibly place inside. This is why we started talking about water cooling still being air cooling in the end. It just lets you be much more efficient about it.\u003C/p\u003E\u003Cp\u003EAs for TIM being a bottleneck, if that\u0027s the case, the only way to combat it is active cooling. You can increase the heat flow through TIM by increasing temperature gradient. Since you want CPU to stay cool, you need to make external temperature positively frigid. You can either use thermoelectric cooler between CPU and liquid cooler, or you can put your liquid through a refrigerator. Both are done occasionally for extreme overclocking.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-09-01T03:02:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EHyper-threading is a small bit of extra hardware architecture. This tiny bit of extra hardware allows is faster switching of (CPU) tasks. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.intel.com/content/www/us/en/architecture-and-technology/hyper-threading/hyper-threading-technology.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.intel.com/content/www/us/en/architecture-and-technology/hyper-threading/hyper-threading-technology.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAllows the running of two threads on a single core for applications designed to take advantage of it.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-09-01T03:23:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf your external heat sink has the same parameters as your CPU sink, then liquid cooling will make things \u003Cem\u003Eworse\u003C/em\u003E, since you now effectively have two TIM layers. The whole point is that you still have an external heat sink with much greater area and better ventilation than the heat sink you could possibly place inside. This is why we started talking about water cooling still being air cooling in the end. It just lets you be much more efficient about it.\u003C/p\u003E\u003Cp\u003EAs for TIM being a bottleneck, if that\u0027s the case, the only way to combat it is active cooling. You can increase the heat flow through TIM by increasing temperature gradient. Since you want CPU to stay cool, you need to make external temperature positively frigid. You can either use thermoelectric cooler between CPU and liquid cooler, or you can put your liquid through a refrigerator. Both are done occasionally for extreme overclocking.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EToday with heat pipes this is true, heat pipes works almost as well as water cooling downside is that they are solid so you are limited to 12 cm heat sinks and fans internally. water cooling lets you get past this up larger sizes. \u003C/p\u003E\u003Cp\u003E10 years ago before heat pipes water cooling was more relevant as the traditional coolers don\u0027t work as well\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-09-01T04:52:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EToday with heat pipes this is true, heat pipes works almost as well as water cooling downside is that they are solid so you are limited to 12 cm heat sinks and fans internally. water cooling lets you get past this up larger sizes. \u003Cp\u003E10 years ago before heat pipes water cooling was more relevant as the traditional coolers don\u0027t work as well\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, but external heat sinks on yeolde water-cooled systems had the same limitation. They were pretty crap, so you had to have a significant sized heat sink, usually sitting on the side of your expansion tank.\u003C/p\u003E\n"}]}