{"TopicId":119950,"ForumId":44,"TopicTitle":"Sleep Paralysis, Fear, and Rationality","CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-09-02T05:20:14Z","PageNum":1,"Articles":[{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-09-02T05:20:14Z","Content":"\n\u003Cp\u003EI recently happened upon quite a trove of disturbing pictures on imgur. After further investigation, they were determined to be portraits of \u0022an intruder\u0022, the eponymous creature reported to be in the room of those who suffer from recurrent sleep paralysis.\u003C/p\u003E\u003Cp\u003EI proceeded to delete my history, and clear my mind by petting the cat, as this reminded me of a brainless scientific \u0022experiment\u0022 I once carried out, the sordid details of which I will not reveal here (yet). However it has left me with a severe fear of the dark, which I had not previously experienced, a violent reaction to any sort of horror movie, and, of course, the occasional episode of actual sleep paralysis.\u003C/p\u003E\u003Cp\u003ESo, I\u0027d like to discuss the meaning of \u0022fear\u0022 and \u0022rational thought\u0022. Recently, I have been a proponent of the groups that state that fear is just an evolutionary instinct evolved to help us survive (fear of the dark, the unknown, spiders, etc.). All of those make good evolutionary sense, as the human eye is not well-developed for sight at night, the unknown may contain dangers that the human brain does not know how to process, and spiders are just plain icky. The episodes of sleep paralysis have served to convince me of this, as it demonstrates the utter inability of rational thought - I KNOW that nothing is there, but I still can\u0027t even breathe - instinctual response is overriding my consciousness as it has been demonstrated to do in other moments of \u0022extremity\u0022.\u003C/p\u003E\u003Cp\u003En.b. I will not be providing any drawings of my \u0022intruder\u0022 in the the interest of both mine and others\u0027 personal privacy.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-09-02T05:38:07Z","Content":"\n\u003Cp\u003EFear is one of the few things that can short circuit your rational thinking and send you to a place you never want to be in. I can rationalize in my mind that a cockroach is harmless, good for the environment, clean up after our mess, being an important link in the ecosystem, and all that. But if one happened to land on me, I would forget all of that and run screaming, nuke the place with pesticides until I see dead roaches, and douse myself in hot water \u002B wash my clothes a few times. It is not something that can be controlled.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2015-09-02T05:58:49Z","Content":"\n\u003Cp\u003EYou aren\u0027t the only one who\u0027s heard this described before... It\u0027s a terrible and horrific thing which I\u0027ve been trying to blot out of memory myself. Though I don\u0027t know anyone personally who has had this I\u0027ve heard several stories. I didn\u0027t even know there was anything posted on imgur recently about it. Just know that you\u0027re not alone and there\u0027s a nice place on the internet where people are always happy to chat. Like this one! Best of luck m8.\u003C/p\u003E\u003Cp\u003EEDIT: On another lighter note, I\u0027ve noticed that your avatar is no longer tipping his hat. It\u0027s making me strangely melancholy. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-02T06:01:04Z\u0022 title=\u002209/02/2015 06:01  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 2, 2015\u003C/time\u003E by Avera9eJoe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MinimumSky5","CreatedById":115138,"CreatedDateTime":"2015-09-02T09:12:06Z","Content":"\n\u003Cp\u003EI think that now we humans (at least, in the developed world) live a nice, cushy life compared to our neanderthal ancestors, our fear circuits will lock on to anything now, no matter how dangerous it is. I remember when I was younger (and still now, to an extent) I used to have a morbid fear of UFO\u0027s and aliens, of all thing! Completely irrational, but nothing to be ashamed of\u003C/p\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-09-02T09:42:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DuoDex\u0022 data-cite=\u0022DuoDex\u0022\u003E\u003Cdiv\u003EI proceeded to delete my history, and clear my mind by petting the cat, as this reminded me of a brainless scientific \u0022experiment\u0022 I once carried out, the sordid details of which I will not reveal here (yet). However it has left me with a severe fear of the dark, which I had not previously experienced, a violent reaction to any sort of horror movie, and, of course, the occasional episode of actual sleep paralysis.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI once was experimenting myself with at least one technique of inducing lucid dreaming and it usually ended in a state of sleep paralysis. At first it was a horrible situation but with time and experience the fear lessened and while it never went away completely it was at least partially replaced by being irritated and just plain angry with the whole situation.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-09-02T11:45:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MinimumSky5\u0022 data-cite=\u0022MinimumSky5\u0022\u003E\u003Cdiv\u003EI think that now we humans (at least, in the developed world) live a nice, cushy life compared to our neanderthal ancestors, our fear circuits will lock on to anything now, no matter how dangerous it is. I remember when I was younger (and still now, to an extent) I used to have a morbid fear of UFO\u0027s and aliens, of all thing! Completely irrational, but nothing to be ashamed of\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn that context how do you explain post traumatic stress disorder. \u003C/p\u003E\u003Cp\u003EI don\u0027t think the problem is cushy lives, I think we are surrounded by fear mongering media and politicians. I get a great deal of peace just by carefully selecting the channels on my digitsl TV. \u003C/p\u003E\u003Cp\u003EThe other problem is people should have campfire time out before sleepy time, lights down low, lots of orange light and turn off the friggen media.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-09-02T11:58:34Z","Content":"\n\u003Cp\u003EOkay, first off, I saw those images last night as I was browsing Imgur before bed.\u003C/p\u003E\u003Cp\u003EAnyone who \u003Cem\u003Ehasn\u0027t\u003C/em\u003E seen them, if you want to sleep tonight, don\u0027t look for them. :/\u003C/p\u003E\u003Cp\u003EI do not believe that I\u0027ve ever experienced sleep paralysis. But when I was younger I had moments where I\u0027d just lock up in the presence of fear, couldn\u0027t move, could hardly breathe. Fully awake, though. Is this close or is there more to it?\u003C/p\u003E\u003Cp\u003EInstinct can often overrule rational thought as well. Evolutionary survival sense is very powerful.\u003C/p\u003E\n"},{"CreatedByName":"Exploro","CreatedById":150492,"CreatedDateTime":"2015-09-02T13:40:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwhip\u0022 data-cite=\u0022Starwhip\u0022\u003E\u003Cdiv\u003EOkay, first off, I saw those images last night as I was browsing Imgur before bed.\u003Cp\u003EAnyone who \u003Cem\u003Ehasn\u0027t\u003C/em\u003E seen them, if you want to sleep tonight, don\u0027t look for them. :/\u003C/p\u003E\u003Cp\u003EI do not believe that I\u0027ve ever experienced sleep paralysis. But when I was younger I had moments where I\u0027d just lock up in the presence of fear, couldn\u0027t move, could hardly breathe. Fully awake, though. Is this close or is there more to it?\u003C/p\u003E\u003Cp\u003EInstinct can often overrule rational thought as well. Evolutionary survival sense is very powerful.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat is it with people wanting to see creepy things right before going to bed? Even I sometime will see the creepy videos from youtubers like Danger Dolan an hour or so before I go to bed...and thus should not be surprised at being jumpy to every single noise I hear in the middle of the night.\u003C/p\u003E\u003Cp\u003EAnyway what you experienced is basically sleep paralysis. I have had many episodes similar to this. For me I began experiencing this type of parasomia almost 12 years ago. The initial experience is alarming. But once you know what it is; that it is not an alien abduction or a demon entering into your midst, each subsequent event isn\u0027t so frightening. I don\u0027t experience it much anymore but it does still happen from time to time.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-09-02T13:42:52Z","Content":"\n\u003Cp\u003EI know someone who has had issues with this. I\u0027m curious, does it make you not want to go to sleep at all?\u003C/p\u003E\n"},{"CreatedByName":"ComradeWolfe","CreatedById":142254,"CreatedDateTime":"2015-09-02T14:53:22Z","Content":"\n\u003Cp\u003EFor those who experience it: How does it end? Do you eventually regain control while conscious, or do you fall back asleep and wake up later on?\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m curious about the \u0022intruder\u0022 images you guys refer to. My own searches of imgur revealed a lone picture of someone dressed as slenderman. Out of respect for the OP\u0027s wishes, please don\u0027t post any links here but if anyone can enlighten me with pics or a description via PM (the contents of which will remain confidential) I would appreciate it.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2015-09-02T15:49:10Z","Content":"\n\u003Cp\u003EWe need a link please.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-09-02T15:55:50Z","Content":"\n\u003Cp\u003EI had what was apparently my first encounter with this just a few weeks ago. I\u0027d already been having difficulty sleeping for weeks, which no doubt contributed to this. And I\u0027d been sleeping on the couch so as not to disturb my wife with constant restlessness. And on top of that, I had a nasty cold. I woke up laying on my back, and glanced over to the adjacent couch and as real as everything else in the room, someone was there. My entire body jerked into a hardcore fight/flight panic attack and as soon as that happened, the image was gone.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-09-02T16:12:04Z","Content":"\n\u003Cp\u003EHeh, I just saw that imgur album myself last night.\u003C/p\u003E\u003Cp\u003EI\u0027ve had sleep paralysis one time in my life, and fortunately \u0022The Intruder\u0022 did not appear. Whether that was due to luck, my own stable psyche, or having my head embedded in blankets is hard to say ^^;\u003C/p\u003E\u003Cp\u003EI experienced the oft-cited symptoms of being conscious, but feeling really heavy as if a heavy blanket were holding me down, but I found that if I mustered a bit of willpower I could make myself move anyway. It only took maybe half a minute to self-diagnose, conclude that the best recourse was to go back to sleep, and follow through on that.\u003C/p\u003E\u003Cp\u003EOn the topic of my fears... I was an odd child who watched the \u003Cem\u003EAlien\u003C/em\u003E series when I was something like 3 and, rather than being scared, thought it was the coolest thing ever. But the end of \u003Cem\u003E2001: A Space Odyssey\u003C/em\u003E gave me nightmares xD\u003C/p\u003E\u003Cp\u003ESo conventional scary things like monsters, shadowy specters, darkness, etc. don\u0027t really scare me, but the laws of physics breaking down seriously does. When I used to be big on Minecraft, as another example, Herobrine didn\u0027t spook me nearly as much as did the Far Lands.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-09-02T16:23:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003ESo conventional scary things like monsters, shadowy specters, darkness, etc. don\u0027t really scare me, but the laws of physics breaking down seriously does.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think there\u0027s more to being afraid of the dark than simply, \u0022What if something is hiding in the shadows?\u0022 The way I see it is the brain is constantly trying to interpret what the senses are telling it. This is why sensory deprivation chambers can more or less serve as a hallucinogen. In the case of darkness, there is so little visual detail to work with that the brain is left with much larger blanks to fill in (this also allows us to dream). What the brain decides to put in the dark corner of the room is probably just luck combined with environmental influences on your upbringing.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-09-02T16:42:27Z","Content":"\n\u003Cp\u003EIt happens because for some people, sometimes, parts of the brain don\u0027t go to sleep or wake up fast enough. Such people usually have much easier access to lucid dreams. It might be a symptom of underlying pathology, though. If it happens often, I\u0027d visit the neurology department.\u003C/p\u003E\u003Cp\u003EIt\u0027s one of the things that are responsible for the development of superstition like demon lore in all cultures.\u003C/p\u003E\u003Cp\u003EOur consciousness is not a single entity. It\u0027s layered, the layers can shed or build up, and there are deep things inside you that never show up on the surface. Drug usage can help them rise up and get lodged there forever and some things should stay under the carpet where no one can see them.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2015-09-02T17:49:04Z","Content":"\n\u003Cp\u003EIs this the one? \u003Ca href=\u0022http://imgur.com/gallery/TQyW5\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gallery/TQyW5\u003C/a\u003E (Click at your own risk, of course)\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2015-09-02T18:29:11Z","Content":"\n\u003Cp\u003Esleep paralysis is just a phrase to indicate a very light dream cycle in which the brain is ALMOST awake while the body is rigid (which is normal for a body during REM sleep as protection from involuntary movement while dreaming).\u003C/p\u003E\u003Cp\u003EWhat if anything you see, hear, smell, whatever in that state (if anything) depends on what the dream\u0027s about.\u003C/p\u003E\u003Cp\u003EMyself, I sometimes (and without my medication often) experience similar things early during my sleep (without my medication my sleep cycle is seriously messed up as a result of narcolepsy), to the point where my brain perceives the room around me as if I were fully awake, a state I remember clearly when waking up even though the actual dream I never remember.\u003C/p\u003E\u003Cp\u003EResult is that I may on waking up remember seeing the clock in my bedroom show 2 in the morning even though an EEG taken during the night shows me asleep from 11 in the evening to 5 in the morning.\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-09-02T19:06:23Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://images.duckduckgo.com/iu/?u=http%3A%2F%2Fnrichford.files.wordpress.com%2F2010%2F09%2Fshadowman-31.jpg\u0026amp;f=1\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://images.duckduckgo.com/iu/?u=http%3A%2F%2Fnrichford.files.wordpress.com%2F2010%2F09%2Fshadowman-31.jpg\u0026amp;f=1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDo not click after 8pm.\u003C/p\u003E\u003Cp\u003EPersonally my issues with this tend to ensue when I am very tired, or if I am worried, and if I am sleeping with someone else.\u003C/p\u003E\u003Cp\u003EUsually these hallucinations fall into an \u0022uncanny valley\u0022 as the image I linked and the album others have linked do (no embeds pls) - a corrupted, semi-familiar figure. Recent visitors to my room have included Evil Cat, Mad Scientist, and the Wife from Hell.\u003C/p\u003E\u003Cp\u003EAlso, I posted this at 1:30am in the morning, and didn\u0027t know about it until now. Interesting.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-09-02T19:14:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DuoDex\u0022 data-cite=\u0022DuoDex\u0022\u003E\u003Cdiv\u003EAlso, I posted this at 1:30am in the morning, and didn\u0027t know about it until now. Interesting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I do hope the sleepwalking Doctor divulges the experiment details, as I am highly curious, but I imagine it\u0027s too traumatic to ask conscious Doctor about. I\u0027ve had three episodes of hallucination in my life, one terrifying, one not, and one ridiculous and \u0022assisted\u0022. These drive my curiosity.\u003C/p\u003E\n"},{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-09-02T19:23:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DuoDex\u0022 data-cite=\u0022DuoDex\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://images.duckduckgo.com/iu/?u=http%3A%2F%2Fnrichford.files.wordpress.com%2F2010%2F09%2Fshadowman-31.jpg\u0026amp;f=1\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://images.duckduckgo.com/iu/?u=http%3A%2F%2Fnrichford.files.wordpress.com%2F2010%2F09%2Fshadowman-31.jpg\u0026amp;f=1\u003C/a\u003E\u003Cp\u003EDo not click after 8pm.\u003C/p\u003E\u003Cp\u003EPersonally my issues with this tend to ensue when I am very tired, or if I am worried, and if I am sleeping with someone else.\u003C/p\u003E\u003Cp\u003EUsually these hallucinations fall into an \u0022uncanny valley\u0022 as the image I linked and the album others have linked do (no embeds pls) - a corrupted, semi-familiar figure. Recent visitors to my room have included Evil Cat,\u003Cstrong\u003E Mad Scientist\u003C/strong\u003E, and the Wife from Hell.\u003C/p\u003E\u003Cp\u003EAlso, I posted this at 1:30am in the morning, and didn\u0027t know about it until now. Interesting.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMad Scientist, as in, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/142789-Mad-Rocket-Scientist\u0022 rel=\u0022external nofollow\u0022\u003EMad Rocket Scientist\u003C/a\u003E?\u003C/p\u003E\u003Cp\u003EThings just got spooky.\u003C/p\u003E\n"},{"CreatedByName":"RocketscientistV","CreatedById":80703,"CreatedDateTime":"2015-09-02T19:27:53Z","Content":"\n\u003Cp\u003EI\u0027m curious as to the nature of the experiment mentioned in the OP.\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-09-02T19:32:19Z","Content":"\n\u003Cp\u003EWhen I was a child, one of my friends had a large trampoline in her backyard. A group of us were playing on it one day, and someone landed hard at just the wrong moment, bouncing me up far higher than was safe. I have a vivid memory of looking \u003Cem\u003Edown\u003C/em\u003E at the roof of her house, along with the realization that I was not going to land on the trampoline and that I was probably going to land on my head. \u003C/p\u003E\u003Cp\u003EMy next bit of memory is of me standing in my friend\u0027s kitchen. I was later told that I did a bit of a tumble, landed on my shoulders, bounced up into a standing position and walked into the house. I don\u0027t remember doing any of those things. If I\u0027d had to think about it, I probably would have broken my neck.\u003C/p\u003E\u003Cp\u003EI think the brain\u0027s \u0022fight or flight\u0022 system is really on a hair trigger, and it absolutely can and will snatch control away from you if it sees something it perceives as a threat.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-09-02T20:25:16Z","Content":"\n\u003Cp\u003EDon\u0027t click after dark. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://knowyourmeme.com/memes/horrifying-house-guest-shadowlurker\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://knowyourmeme.com/memes/horrifying-house-guest-shadowlurker\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-09-02T22:01:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ten Key\u0022 data-cite=\u0022Ten Key\u0022\u003E\u003Cdiv\u003EI think the brain\u0027s \u0022fight or flight\u0022 system is really on a hair trigger, and it absolutely can and will snatch control away from you if it sees something it perceives as a threat.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not \u003Cem\u003Ethe brain\u003C/em\u003E and \u003Cem\u003Eyou\u003C/em\u003E. You\u0027re the brain, too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s just lower functions that take over in certain situations, as well as reflexes calculated in your spinal cord.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-09-02T22:08:08Z","Content":"\n\u003Cp\u003EAs someone who feels the (admittedly, very odd) compulsion to scare myself silly every few months, I like to look up creepypasta and the like. If anyone has any links to the pics OP was talking about, feel free to PM them to me. I don\u0027t sleep much anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for \u003Cem\u003Ewhy\u003C/em\u003E I like to scare myself sometimes, I really don\u0027t know. I believe it has to do with survival instincts: if you\u0027re scared, you\u0027re more alert to dangers, and more likely to survive. Sure it doesn\u0027t make nearly as much sense in today\u0027s world (you\u0027re not as likely to be eaten by a wolf in your own home, for example) but I guess I need to satisfy that weird urge once in a while. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only person I\u0027ve met who has had night terrors is my oldest brother. He only described one time (he woke up, couldn\u0027t move, couldn\u0027t make any noise, but felt like there was a presence in his otherwise empty room). Never had one personally, and I used to be \u003Cem\u003Eterrified\u003C/em\u003E of the dark.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-02T22:10:36Z\u0022 title=\u002209/02/2015 10:10  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 2, 2015\u003C/time\u003E by Slam_Jones\u003C/strong\u003E\n\u003C/span\u003E\n"}]}