{"TopicId":120024,"ForumId":44,"TopicTitle":"Could Ares 1 been saved?","CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-03T05:45:55Z","PageNum":1,"Articles":[{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-03T05:45:55Z","Content":"\n\u003Cp\u003ETwo of the primary problems with Ares 1 was the fact that it was underpowered, and it\u0027s thrust oscillations from having a SRB 1st stage.\u003C/p\u003E\u003Cp\u003EHowever, could both of these problems be fixed by adding Atlas V SRBs (and changing the 5-seg to 4-seg boosters)? The extra boosters would mitigate the thrust oscillation, as the oscillations are never at the same resonance. Orion would also have a greater mass, due to the extra payload allowed by having extra boosters, allowing it to make land landings, like it was originally slated to do, for example. Ares 1 could also be expanded in payload by adding up to 8 boosters, and/or a Centaur Upper Stage, though this capability is admittedly, not necessary, and may result in a too high TWR.\u003C/p\u003E\u003Cp\u003EMeanwhile, the upper stage could use 5x RL-60 (which would also provide a upper stage alternative for EELVs), or a smaller upper stage using the J-2S, which would be possible due to the extra boosters. The tankage could be based off of the Shuttle ET, making the upper stage more like the original Ares I, before things went downhill. This would solve the problems that arose when the J-2X was developed (such as high cost).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-03T06:49:30Z\u0022 title=\u002209/03/2015 06:49  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 3, 2015\u003C/time\u003E by fredinno\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"okan170","CreatedById":268,"CreatedDateTime":"2015-09-03T06:26:31Z","Content":"\n\u003Cp\u003EThe whole reason-to-live for Ares 1 was to re-use as much Shuttle hardware as possible. By the end of the program, almost the entire thing was brand-new; 4-segment to 5-segment was a bigger hurdle than they thought, and J2S needed to be redesigned to be J2X to make up for shortcomings in the first stage. \u003C/p\u003E\u003Cp\u003EI don\u0027t think any boosters can be mounted to the segmented SRB without a drastic redesign to redistribute the loads; the STS/Ares SRB was designed to be structurally held in very specific ways for the shuttle (and probably Ares V.) \u003C/p\u003E\u003Cp\u003EAs for augmenting the upper stage, you could have gone a lot further to try and save it but the end point was it was a terrible design and it wasn\u0027t worth the time and money to make it workable. And since, by this point, none of the hardware was even direct-from-STS, there was little to no reason to keep pouring money into it. Technically, Ares 1 could work. Maybe throw an additional $15 billion or so into it and it\u0027d fly. In the end, it just wasn\u0027t worth it to keep trying to fix it for more money than a new design would take.\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-03T06:58:57Z","Content":"\n\u003Cp\u003EI forgot to add the fact the the Ares 5-seg would be switched to a 4-seg in my proposal, reducing R\u0026amp;D costs associated with the extra segment. Would the R\u0026amp;D associated with being able to attach SRBs to the Ares 1 core be less than a 5-segment?\u003C/p\u003E\u003Cp\u003EHow could I have gone further to save the Upper Stage design?\u003C/p\u003E\u003Cp\u003EThis was more of a thought experiment than anything- I agree that a EELV-deived solution provably would have been better- learning how to stick Atlas V cores is easier than building a whole new upper stage, and learning how to use a SRB as a 1st stage for a HLV.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-09-03T08:00:59Z","Content":"\n\u003Cp\u003EWhy would you even want to save Ares I ?\u003C/p\u003E\u003Cp\u003EIts only reason for existing was the synergy with Ares V in the J2-X and the 5 segment SRBs. No Ares V means no synergy, and therefore no need for Ares I.\u003C/p\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2015-09-03T08:44:35Z","Content":"\n\u003Cp\u003EThrust oscillation \u003C/p\u003E\u003Cp\u003Eattitude control issues due to massive sail area \u003C/p\u003E\u003Cp\u003Efrustum buckling because of vehicle length\u003C/p\u003E\u003Cp\u003Einability to airstart the SSME causing a wasteful J2 engine upgrade\u003C/p\u003E\u003Cp\u003E4seg SRB underperformance leading to wasteful 5seg design... \u003C/p\u003E\u003Cp\u003EIt\u0027s all a massive hangover that NASA still hasn\u0027t recovered from.\u003C/p\u003E\u003Cp\u003EBest leave it in the past.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-09-03T09:07:45Z","Content":"\n\u003Cp\u003ECould have replace the SRB with a Pyrios booster? A potential replacement for the srb on the SLS.\u003C/p\u003E\u003Cp\u003EMore powerful and uses liquid fuel which is better for obvious reasons.\u003C/p\u003E\u003Cp\u003EHowever there is no need to use an Ares I anymore. The commercial crew vehicles could fill the same role and bring astronauts up.\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-03T09:43:38Z","Content":"\n\u003Cp\u003EIt was a THOUGHT EXPERIMENT. Read my earlier comment, I said exactly what my intentions were.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThat depends if the F-1 can even be used today and modernized economically. You know, \u0027cause the J-2X went so well...\u003C/p\u003E\n"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-09-03T13:15:31Z","Content":"\n\u003Cp\u003EAres I could have been saved, just don\u0027t cancel it! Fly it until the bugs are worked out.\u003C/p\u003E\n"},{"CreatedByName":"okan170","CreatedById":268,"CreatedDateTime":"2015-09-03T15:42:56Z","Content":"\n\u003Cp\u003EThe central question we need to ask about this hypothetical is \u0022when is it not Ares 1 anymore?\u0022 Is Ares 1 being considered anything with the ATK SRB (4 or 5 segment) and a liquid upper stage? If you\u0027re starting from scratch with the 4 segment, there are a few possibilities but none of them were really applicable to the Constellation era due the the requirement that Ares 1 use STS hardware.\u003C/p\u003E\u003Cp\u003EA nice little history of the design of \u0022The Stick\u0022:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.spacelaunchreport.com/ares1.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.spacelaunchreport.com/ares1.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-09-03T16:52:52Z","Content":"\n\u003Cp\u003EHeh \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ATK tried to sell to Nasa a modified version of ARES I with the Liberty rocket... Would have used a 5segment SRB \u002B an Ariane 5 EPC with it\u0027s vulcain engine instead of the J-2X 2nd stage - (though, they would have needed to make the vulcain able to start inflight)\u003C/p\u003E\n"},{"CreatedByName":"MajorLeaugeRocketScience","CreatedById":148889,"CreatedDateTime":"2015-09-05T22:22:56Z","Content":"\n\u003Cp\u003EEveryone realizes how stupid SRBs are right? Why did we invent them? And why would we try to save a manned launcher that is literally a SRB?\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-09-05T22:35:34Z","Content":"\n\u003Cp\u003ESRBs aren\u0027t stupid. Are you saying that the people who design and build practical launch vehicles are idiots ?\u003C/p\u003E\u003Cp\u003ESRBs have certain specific qualities which is why they are used to meet certain requirements.\u003C/p\u003E\u003Cp\u003EAres 1 was a dead-end design, not because it used an SRB, but because the fundamental architecture was flawed.\u003C/p\u003E\n"},{"CreatedByName":"MajorLeaugeRocketScience","CreatedById":148889,"CreatedDateTime":"2015-09-05T22:38:51Z","Content":"\n\u003Cp\u003EJeez all im saying is that SRBs are not safe. Challenger happened. And Nibb, pleas don\u0027t hate on everything I write\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-05T22:52:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sgt_flyer\u0022 data-cite=\u0022sgt_flyer\u0022\u003E\u003Cdiv\u003EHeh \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ATK tried to sell to Nasa a modified version of ARES I with the Liberty rocket... Would have used a 5segment SRB \u002B an Ariane 5 EPC with it\u0027s vulcain engine instead of the J-2X 2nd stage - (though, they would have needed to make the vulcain able to start inflight)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually preferred Liberty to Ares 1.\u003C/p\u003E\u003Cp\u003EBut why the hell would you propose something again that was a complete failure so soon?\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-09-05T22:52:50Z","Content":"\n\u003Cp\u003ENot hating. Just correcting your misunderstandings.\u003C/p\u003E\u003Cp\u003ESo Soyuz 1 crashed because of a parachute failure, so are you going to claim that parachutes are inherently unsafe too ?\u003C/p\u003E\u003Cp\u003EThe Challenger accident was due to NASA launching outside of the certified launch parameters. The temperature was below the specified operating limits of the SRB o-rings, and the o-rings failed. When you exceed limits, you are bound to have failures, whether you are using solid or liquid engines or any other complex system.\u003C/p\u003E\u003Cp\u003EIn the history of spaceflight, there have been more liquid engine failures than solid motor failures. Statistically, they are safer than liquid engines.\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-05T22:54:27Z","Content":"\n\u003Cp\u003ESo? LRBs have plenty of their own disasters too. I thibk the bigger problem during Challenger was not having a bail-out plan (since OBVIOUSLY something like the shuttle could never fail...)\u003C/p\u003E\u003Cp\u003EAlso, something tells me you have never played KSP Career Mode...\u003C/p\u003E\n"},{"CreatedByName":"MajorLeaugeRocketScience","CreatedById":148889,"CreatedDateTime":"2015-09-05T22:54:59Z","Content":"\n\u003Cp\u003EOk im sorry alright? I\u0027m done with the forums right now\u003C/p\u003E\n"}]}