{"TopicId":120586,"ForumId":44,"TopicTitle":"Alzheimer\u0026#039;s Might be Transmissible","CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-09-10T15:29:03Z","PageNum":1,"Articles":[{"CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-09-10T15:29:03Z","Content":"\n\u003Cp\u003EAn unusual topic in the day to day buzz of astronomy going on around here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nature.com/news/autopsies-reveal-signs-of-alzheimer-s-in-growth-hormone-patients-1.18331\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nature.com/news/autopsies-reveal-signs-of-alzheimer-s-in-growth-hormone-patients-1.18331\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe gist: Human Growth Hormone (hHG) recipients who died prematurely in CJD were found on biopsy to have beta amyloid plaques (characteristic of Alzheimer\u0027s disease) in their brains. While CJD - a prion disease - is known to be transmissible via contaminated hHG from human cadavers, it does not give rise to beta amyloid plaques. Instead, it appears that the hHG donator may have had Alzheimer\u0027s and unwittingly contaminated the extracted hHG with plaques, which then seeded the younger hHG recipients.\u003C/p\u003E\u003Cp\u003EThe implications: hHG is not really used anymore in growth hormone deficient patients. Instead, a recombinant form ensures maximum safety and does away with any chance of contamination by prions. However, if Alzheimer\u0027s may be transmissible in this way just like CJD, it is conceivable that it may be transmissible in another, similar way. CJD may arise after prion contaminated instruments are used in brain surgery. Proteins are much harder to remove than bacteria and viruses, so surgeries performed in those with amyloid plaques could potentially result in instrument contamination and transmission to the next patient.\u003C/p\u003E\u003Cp\u003ESome notes on Alzheimer\u0027s: a neurodegenerative disease usually presenting later in life (but possibly arising from insidious changes many years before the first symptoms). The cause of Alzheimer\u0027s is not completely understood, but appears to be related to beta amyloid protein, which forms toxic intraneural particles or large extracellular plaques. Amyloid spreads successively though the brain until cognitive function is severely impaired.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-09-10T15:50:16Z","Content":"\n\u003Cp\u003EWe\u0027ve been discussing this all morning. The \u0027fine print\u0027** involved is something which needs \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Egreater emphasis\u003C/span\u003E before people get carried away with envisions of plague.\u003C/p\u003E\u003Cp\u003E** \u0022CJD may arise after prion contaminated instruments are used in brain surgery. Proteins are much harder to remove than bacteria and viruses, so surgeries performed in those with amyloid plaques could potentially result in instrument contamination and transmission to the next patient.\u0022\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-09-10T16:57:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordFerret\u0022 data-cite=\u0022LordFerret\u0022\u003E\u003Cdiv\u003EWe\u0027ve been discussing this all morning. The \u0027fine print\u0027** involved is something which needs \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Egreater emphasis\u003C/span\u003E before people get carried away with envisions of plague.\u003Cp\u003E** \u0022CJD may arise after prion contaminated instruments are used in brain surgery. Proteins are much harder to remove than bacteria and viruses, so surgeries performed in those with amyloid plaques could potentially result in instrument contamination and transmission to the next patient.\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPrions are not proteins, they are a cleavage product of proteins. Autoclaving on metal can theoretically actually create prions, but chemical sterilization with dimethylforamide or acetonitrile in an organic salt like ammonium acetate at sufficiently ionic stregth can remove protiens or polypeptides. A prion is a bodily protein catabolite that for whatever reason has not undergone normal breakdown or clearance, and its presence provides a positive feedback loop resulting in increaingly more build-up. The brain unlike most other tissues does not undergo cellular turnover, and many proteins are expected to survive a lifetime once produced. It is not surprising that prions or alzheimers diseaes exist given the mean lifetime increase from the stone age to present, particulaly if we consider selective pressures during the medieval period and their equivilants in Asia, and all the nasty chemicals that firing and industry put on our food. Not interested in this topic, too much like work.\u003C/p\u003E\n"},{"CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-09-10T17:12:23Z","Content":"\n\u003Cp\u003EPrions are proteins. The prion protein (PrP) is the normal form which then undergoes misfolding into PrP(Sc), Sc for Scrapie. PrP(Sc) may directly convert normally folded prion proteins into the misfolded form, so there is no breakdown or cleavage involved here.\u003C/p\u003E\u003Cp\u003EBeta amyloid (in Alzheimer\u0027s) is an oligopeptide breakdown product through beta secretase of the amyloid precursor protein.\u003C/p\u003E\u003Cp\u003EBoth normal PRP and APP appear to have physiological roles in the body, and APP breakdown occurs in healthy people. Some people may live their entire lives without being struck by either disease (CJD certainly being very rare and occuring mostly spontaneously in a few unlucky people), but age is definitely a factor. In the case of Alzheimer\u0027s the brain does clear out APP breakdown products, but we know that f.e. a lack of sleep may impede this process, amongst other factors.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-09-10T17:31:59Z","Content":"\n\u003Cp\u003EWithout getting into the chemistry/biology of it, I\u0027ve dealt with an Alzheimer\u0027s patient in the past. I currently care for an aging family member with advanced dementia. Similar, but very different. None-the-less the affect of either is devastating to both the individual and those around them who have to care for and witness the progression and decline. We\u0027ll be watching this unfold with great interest.\u003C/p\u003E\n"}]}