{"TopicId":121747,"ForumId":44,"TopicTitle":"Rockets: How Do They Work?","CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2015-09-26T17:00:49Z","PageNum":1,"Articles":[{"CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2015-09-26T17:00:49Z","Content":"\n\u003Cp\u003EI \u003Cem\u003Ethink\u003C/em\u003E that I \u0022get\u0022 that the basic idea of a rocket is that accelerating a gas/gases, usually through combustion, produces a force in whatever direction the engine points, and that due to Newton\u0027s 3rd Law, an equal force of opposite magnitude is applied to the vehicle, causing \u003Cem\u003Eit\u003C/em\u003E to accelerate in a manner inversely proportional to its mass. My problem, I believe, is conceptualizing/visualizing the nature of the thrust force.\u003C/p\u003E\u003Cp\u003EHow does thrust, in the case of a rocket, work? I can\u0027t seem to visualize how a force is created through the acceleration of a gas. I get that there has to be a force because there\u0027s a mass being accelerated, but I don\u0027t get the mechanics behind how that acceleration is produced. How does the gas push the rocket if it is being ejected directly away from the engine? As I understand it, thrust is a contact force, so a push is somehow occurring.\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2015-09-26T17:15:24Z","Content":"\n\u003Cp\u003EThrust is NOT a contact force. Think about it this way:\u003C/p\u003E\u003Cp\u003EIf you\u0027re ice skating holding a bowling ball. then you throw it, you\u0027re going to fly backwards. You are pushing on the ball, yes, but the ball doesn\u0027t need to \u0022push\u0022 on the air. Now imagine that instead of bowling balls, they\u0027re tiny post combustion molecules, lots of them, LOTS of them. And what\u0027s \u0022pushing\u0022 them out is their final impact against the combustion chamber before flying out of the exhaust. You may think that it\u0027d be impossible to calculate all of these interactions, but rocket science simplifies it into thrust and nozzle physics.\u003C/p\u003E\u003Cp\u003ENow sure, that\u0027s for traditional gas exhaust rocketry, but all rockets more or less follow this principle (ion drives use ions pushed by electromagnetic fields, for instance).\u003C/p\u003E\u003Cp\u003EHope this helps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-09-26T17:17:22Z","Content":"\n\u003Cp\u003EThe way I see it, it\u0027s pressure, just like on the inside of a balloon.\u003C/p\u003E\u003Cp\u003EIf you had a sealed vessel and burned fuel and air in it, you\u0027d raise the pressure until it burst, same with a balloon if you keep pumping it up, the pressure increases until it pops.\u003C/p\u003E\u003Cp\u003EWhen you put a pin in a balloon the air escapes, but the moment that air leaves the balloon it cannot act on it anymore, what pushes the balloon is the pressure on the side opposite the hole.\u003C/p\u003E\u003Cp\u003ESame with a rocket engine combustion chamber, the gasses that leave the engine are effectively no longer anything to do with the rocket, it\u0027s the pressure on the opposite wall that drives the rocket forwards.\u003C/p\u003E\u003Cp\u003EThe wall isn\u0027t very large though so the pressure doesn\u0027t have a large area to push on, and the hot gasses are still expanding even after leaving the rocket chamber, that would be wasted energy but clever people realized that energy was also usable by fitting an extension, the engine bell, so the expanding gasses that left the chamber could fill the bell and push on its walls.\u003C/p\u003E\u003Cp\u003ESome of that push is just to the sides, but because of the sloped sides \u003Cem\u003Esome\u003C/em\u003E of it pushes the bell forwards as well, and that pushes the rocket, and the bells are optimised so when the gas finally leaves it\u0027s expanded about as much as it\u0027s going to.\u003C/p\u003E\u003Cp\u003ESteam engines actually work a bit like this, with bigger pistons able to extract useful work from the expanded steam that still has some expansion left to go.\u003C/p\u003E\u003Cp\u003EOnce it\u0027s gone past the end of the bell though it\u0027s gone, there\u0027s no further force in the exhaust pushing the rocket, it\u0027s no longer in contact with it to do any pushing.\u003C/p\u003E\u003Cp\u003EThink about when you throw a stone, while the stone is in your hand you exert a force on it and it resists that force, that\u0027s why it takes effort to throw, but once its left your hand neither you nor the stone can affect each other.\u003C/p\u003E\u003Cp\u003EAnd in a infinitesimal way, just as you put energy (inertia) into the stone, a little bit went into to, pushing you the other way.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-09-26T17:19:43Z","Content":"\n\u003Cp\u003EImagine a box, with one of the sides left open. Assume this open box is indestructible. Place an imaginary explosive inside the box, and detonate it.\u003C/p\u003E\u003Cp\u003EThe force of the expanding gases produced by the explosion will push on the sides of the box from the inside. In a closed box, the forces pushing on all 6 sides will exactly cancel out each other, resulting in the box not moving (if it doesn\u0027t disintegrate, but let\u0027s ignore that for now).\u003C/p\u003E\u003Cp\u003EIn a box where one side is open, the expanding gases pushes on the side directly opposite of the open side (in addition the the other 4 sides), but it cannot push on the missing side; there\u0027s nothing to push on. In effect, the force pushing on the side opposite of the open side isn\u0027t cancelled out, resulting in a net force in the direction directly opposite of the open side. Hence, thrust.\u003C/p\u003E\u003Cp\u003ENow, replace the open box with a rocket combustion chamber, the open side with a rocket nozzle opening, and the explosion with reacting rocket propellant.\u003C/p\u003E\n"},{"CreatedByName":"Steel","CreatedById":49317,"CreatedDateTime":"2015-09-26T17:21:33Z","Content":"\n\u003Cp\u003EEDIT: Ninja\u0027d, not once, not twice, but thrice\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-26T17:27:41Z\u0022 title=\u002209/26/2015 05:27  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 26, 2015\u003C/time\u003E by Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-09-26T18:03:05Z","Content":"\n\u003Cp\u003EImagine you\u0027re on a tiny boat on a perfectly flat and calm lake next to a fixed marker. You start throwing balls in one direction. The boat will go in the other direction.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-09-26T18:23:46Z","Content":"\n\u003Cp\u003EI officially dub this thread.. \u0022The Sea of Analogies.\u0022 \u003C/p\u003E\u003Cp\u003EJust think of it as a contained, directed explosion. All that pressure needs to go somewhere.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-09-26T18:38:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jodo42\u0022 data-cite=\u0022Jodo42\u0022\u003E\u003Cdiv\u003EHow does the gas push the rocket if it is being ejected directly away from the engine? As I understand it, thrust is a contact force, so a push is somehow occurring.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe expanding gas pushes against the engine bell, which is carefully shaped to convert as much of that push as is practical into forward force.\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-09-26T18:46:08Z","Content":"\n\u003Cp\u003EAre you interested in a technical explanation? Because I can give that. It\u0027s all a consequence of conservation of momentum. The system that involves the rocket and the fuel has the same momentum before the rocket tosses the fuel out the engine as it does afterward. So, given that the fuel afterward is travelling in one direction, the rocket (minus that amount of fuel) must be travelling in the other in order for the momentum of the whole to remain the same.\u003C/p\u003E\u003Cp\u003EYes, you can model this as a consequence of Newton\u0027s Third Law primarily, but it\u0027s easier to model it as conservation of momentum out of which Newton\u0027s Third Law emerges.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-09-26T19:57:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThe expanding gas pushes against the engine bell, which is carefully shaped to convert as much of that push as is practical into forward force.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat accounts for a small part of the thrust. Most of the force results from the conservation of momentum by direct throwing out of little balls called gas.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-09-26T19:59:56Z","Content":"\n\u003Cp\u003EPressure times surface area of choke. You get force. That\u0027s most of it, anyhow.\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-09-26T20:23:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jodo42\u0022 data-cite=\u0022Jodo42\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHow does thrust, in the case of a rocket, work? I can\u0027t seem to visualize how a force is created through the acceleration of a gas. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA fire hose has enough recoil to knock a human over. The phase of the mass being accelerated (solid, liquid, gas, plasma) doesn\u0027t matter-- mass is mass. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/eHXve23fCZw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-09-26T21:06:16Z","Content":"\n\u003Cp\u003EThink of how a bullet get propelled: explosion with gas expansion in a confined space with only 1 exit.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-09-26T21:14:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EThat accounts for a small part of the thrust. Most of the force results from the conservation of momentum by direct throwing out of little balls called gas.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, it\u0027s like a lens focusing the gas in the right direction. The expanding gas is pushing on the engine, though, which was the point I was trying to get across.\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2015-09-26T23:08:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThink about when you throw a stone, while the stone is in your hand you exert a force on it and it resists that force, that\u0027s why it takes effort to throw, but once its left your hand neither you nor the stone can affect each other.\u003C/p\u003E\u003Cp\u003EAnd in a infinitesimal way, just as you put energy (inertia) into the stone, a little bit went into to, pushing you the other way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot even in an infinitesimal way. The only reason you don\u0027t move when you throw a stone is that normal and frictional forces between your feet and the ground transfer the momentum to the Earth, which is so heavy its mass can usually be treated as infinite for those calculations. If you threw a stone on roller skates, you\u0027d start moving backwards: according to my calculations a 75 kg pitcher throwing a baseball at about 80 MPH (yes, I converted the units) would send himself backwards at about 7 cm/s. That isn\u0027t high, but you\u0027d definitely notice it. Throwing a baseball in space would also probably cause you to start spinning because the throw won\u0027t be aligned with your center of mass.\u003C/p\u003E\u003Cp\u003EIf we use a device to throw the object backwards even faster, you can get greater accelerations. For example, with a total mass of 75 kg a .22 rimfire cartridge will only send you backwards at 1.3 cm/s. A 30-06 rifle will send you backward at 12 cm/s, a .38 special will give you 4.5 cm/s, and a .50 BMG will send you backward at over 0.5 m/s. You could potentially get a full meter per second of delta-V by using a double-barreled 12 gauge shotgun with appropriate ammunition. Beyond that, the guns get so heavy they\u0027ll be a significant portion of your mass, making the calculations more complicated. XKCD did a \u0022what if\u0022 comic about using machine guns as jet packs, but that was more concerned with getting enough thrust to lift off the ground.\u003C/p\u003E\u003Cp\u003EUnfortunately, chemically-powered firearms rarely have muzzle velocities above about 1 km/s, which translates to an Isp of 100 s (assuming we\u0027re firing hundreds of bullets, treating them as a continuous flow of mass is a decent approximation). This is barely better than an Estes rocket motor, and can be beaten by homemade \u0022rocket candy\u0022 motors. Railguns are expected to have muzzle velocities of 2-3 km/s. At the low end, this is comparable to commercially available high-power rocket motors using solid fuels. At the high end, it\u0027s comparable to kerolox rocket engines.\u003C/p\u003E\u003Cp\u003EJust for fun, let\u0027s say our major league pitcher from the first example has a large magazine of balls, and throws until his arm gets tired. Typical pitch counts are about 100 pitches per game, so our pitcher will throw that many balls, with a velocity of about 90 MPH for an ISP of 4 s (ha!). The balls have a total mass of about 15 kg, so with a \u0022dry mass\u0022 of 75 kg, the pitcher\u0027s total dV is: 7.3 m/s. He could probably run faster than that, and that figure assumes no losses from friction.\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-09-26T23:20:03Z","Content":"\n\u003Cp\u003EForce can also be thought as change of momentum over finite moment of time, not just work divided by distance, or something that drags something along.\u003C/p\u003E\u003Cp\u003EThink of a cannon. When a cannon shoots, the cannon ball moves forward from still - a change in momentum. But momentum must be preserved, right ? So you get recoiling, the cannon sliightly moves backward. During the acceleration of cannonball, someone \u003Cem\u003Ecertainly\u003C/em\u003E can measure a force being applied at the cannonball - and the same thing in reverse for the cannon itself.\u003C/p\u003E\u003Cp\u003ERockets ? They\u0027re cannons with armament of hot gases. Force is attained during expansion in the combustion chamber, gas goes down and so the \u0022cannon\u0022 goes up. Think of gas is worthless ? Well, think of how party ballon can fly just from cold air escaping. Think of that you\u0027re now filling it with gasses hotter than steam...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-26T23:22:33Z\u0022 title=\u002209/26/2015 11:22  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 26, 2015\u003C/time\u003E by YNM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wizzlebippi","CreatedById":85324,"CreatedDateTime":"2015-09-27T18:33:25Z","Content":"\n\u003Cp\u003ESince everyone here is doing everything but explaining how a rocket works, here it is:\u003C/p\u003E\u003Cp\u003EForce = Mass * Acceleration\u003C/p\u003E\u003Cp\u003EForce = Thrust\u003C/p\u003E\u003Cp\u003EMass = Fuel and Oxidizer\u003C/p\u003E\u003Cp\u003EAcceleration is caused by burning fuel with oxidizer, creating heat and causing the resulting exhaust gas to expand. This pressure is contained within the combustion chamber and forced out the nozzle. The exhaust gas is accelerated through the nozzle, reaching Mach 1 at the throat and continuing to accelerate until it reaches the end of the exhaust bell. \u003C/p\u003E\u003Cp\u003ENewton\u0027s third law states that for every action there is an equal and opposite reaction. The rocket is accelerated with the same amount of force that expels the exhaust gas out the nozzle. \u003C/p\u003E\u003Cp\u003ENuclear rockets use the heat from a nuclear reactor to expand fuel within a pressure chamber and accelerate it out the nozzle. Ion engines use electricity to ionize a gas like xenon and use the resulting repulsive force to generate thrust.\u003C/p\u003E\n"},{"CreatedByName":"Chakat Firepaw","CreatedById":150121,"CreatedDateTime":"2015-09-29T17:12:55Z","Content":"\n\u003Cp\u003EYou\u0027re all going about this the hard way.\u003C/p\u003E\u003Cp\u003EConsider a rocket floating alone in empty space. Now, no matter what it does it cannot move its centre of mass, which means that if you move part of it something else has to move the other way.\u003C/p\u003E\u003Cp\u003EThe propellant is part of the rocket. If it goes left, everything else goes right.\u003C/p\u003E\n"}]}