{"TopicId":123456,"ForumId":44,"TopicTitle":"Software for calculating Drag Coefficient?","CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-10-20T22:08:06Z","PageNum":1,"Articles":[{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-10-20T22:08:06Z","Content":"\n\u003Cp\u003EHey everyone! I was curious if there was a software program that can calculate or estimate the drag coefficient of an object based on weight, cross-sectional area, air density, speed ect. \u003C/p\u003E\u003Cp\u003EI\u0027m working on a little project and I need to find the drag coefficient for a tiny capsule, but most equations I see need information I don\u0027t have. It seems the only way to find it is to do experiments or run software. It would be even cooler if there was software where you can import a 3D model and use that. \u003C/p\u003E\u003Cp\u003EI\u0027ve seen some SolidWorks demos and stuff, but those don\u0027t really give out mathematical numbers, just visuals, right?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-10-21T03:49:03Z","Content":"\n\u003Cp\u003Eas i understand it cd is something you have to determine experimentally. the old way you stick a part in a wind tunnel and see what it does, nowadays computer models are good enough to test design models. a coefficient is really just a fudge factor anyway. it represents everything we do not know about aerodynamics.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-10-21T04:04:23Z","Content":"\n\u003Cp\u003ESmall note: mass shouldnt have any effect on drag ( other than anything related to the effects of heat, anyway ).\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2015-10-21T07:11:42Z","Content":"\n\u003Cp\u003EI modeled gas flow with Comsol Multiphysics in one work project. It can calculate drag coefficients too, because it calculates pressure on surfaces. However, it is professional software and license is far too expensive for hobby use. It needs also some understanding in hydrodynamics and numerical solving of differential equations to select correct choices. Otherwise it gives just ........, sometimes nasty ........ which looks correct at first look. Whatever software you use to solve Navier Stokes equations, it will not be \u0022put model in and get simple correct number out\u0022 -task.\u003C/p\u003E\n"},{"CreatedByName":"wizzlebippi","CreatedById":85324,"CreatedDateTime":"2015-10-21T20:04:00Z","Content":"\n\u003Cp\u003EFor a more old school approach, as long as it can be broken down into simple shapes, your answer might be in Hoerner\u0027s Fluid Dynamic Drag.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-10-21T20:22:24Z","Content":"\n\u003Cp\u003EI think he is looking prolly at modeling dynamic force during flight of modeled parts, since this thread was ported here. \u003C/p\u003E\u003Cp\u003EFor simple fusiform shapes traveling at M0.8 or less its probably going to pretty strait forward, \u003C/p\u003E\u003Cp\u003EFor craft complex axial cross-sectional areas the equations above M0.8 get complicated very quickly. \u003C/p\u003E\u003Cp\u003EFor most craft of this type rather than calculating drag, the effort should be in sustaining climb of 0.8g to a pressure where drag is not a major concern at Mach speeds.\u003C/p\u003E\n"},{"CreatedByName":"wizzlebippi","CreatedById":85324,"CreatedDateTime":"2015-10-21T21:23:28Z","Content":"\n\u003Cp\u003ESorry, I forgot that we didn\u0027t manage to break the sound barrier or put a man on the moon without modern computers. \u003C/p\u003E\u003Cp\u003ESeriously, Hoerner Fluid Dynamic Drag (at least my 1965 edition) covers everything from low Reynolds number to hypersonic drag. Given your project and the likely extreme speed range, readily available software probably won\u0027t cover anything beyond Mach 1 because that\u0027s not where the majority of aircraft operate. Where given a quick search of a book from 1965, I was able to find:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v475/konfuzd/Hoerner.jpg\u0022 alt=\u0022Hoerner.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-21T21:26:04Z\u0022 title=\u002210/21/2015 09:26  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 21, 2015\u003C/time\u003E by wizzlebippi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}