{"TopicId":124522,"ForumId":44,"TopicTitle":"how can you create something from nothing ?","CreatedByName":"alpha tech","CreatedById":84978,"CreatedDateTime":"2015-11-05T21:31:09Z","PageNum":1,"Articles":[{"CreatedByName":"alpha tech","CreatedById":84978,"CreatedDateTime":"2015-11-05T21:31:09Z","Content":"\n\u003Cp\u003EHow does the laws of physics allow something to be created from nothing?\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2015-11-05T21:37:20Z","Content":"\n\u003Cp\u003EThey don\u0027t. Matter and energy can change forms, but they can\u0027t be created or destroyed.\u003C/p\u003E\n"},{"CreatedByName":"alpha tech","CreatedById":84978,"CreatedDateTime":"2015-11-05T21:40:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mitchz95\u0022 data-cite=\u0022Mitchz95\u0022\u003E\u003Cdiv\u003EThey don\u0027t. Matter and energy can change forms, but they can\u0027t be created or destroyed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E yes but before the big bang how could a singularity be created if no space and no time existed?\u003C/p\u003E\u003Cp\u003Ealso the laws of physics would have to change for the big bang be cause it created matter, space, and time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-05T21:42:13Z\u0022 title=\u002211/05/2015 09:42  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 5, 2015\u003C/time\u003E by alpha tech\u003C/strong\u003E\n\u003Cbr\u003EAdd on\n\u003C/span\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2015-11-05T21:42:49Z","Content":"\n\u003Cp\u003EThat\u0027s simple to answer: Nothing was never the state of affairs. There was always something, even \u0022before\u0022 time and space existed.\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-11-05T21:45:24Z","Content":"\n\u003Cp\u003EDepends on what you mean by \u0022nothing\u0022 and \u0022something\u0022:\u003C/p\u003E\u003Cp\u003EIf you mean creating mass, then use Einstein\u0027s mass-energy equivalency (E = mcÃ‚Â²) to convert from one to another. So yes it is possible.\u003C/p\u003E\u003Cp\u003EIf you mean creating energy from an empty vacuum, then again it is possible thanks to Heisenberg\u0027s uncertainty principle: basically, very small amounts of energy are allowed to exist for very short times. There are also other various effects allowing the same kind of stuff (eg: Zero-point energy), but they rely on quantum physics and are way too complicated for me, so you\u0027ll have to ask someone else for those.\u003C/p\u003E\u003Cp\u003EPrecising your question would allow to give a more complete and accurate answer.\u003C/p\u003E\n"},{"CreatedByName":"alpha tech","CreatedById":84978,"CreatedDateTime":"2015-11-05T21:50:15Z","Content":"\n\u003Cp\u003Ethe big bang was an explosion of space, time and matter. but how do you get the explosion? (think before the big bang.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-05T22:05:56Z\u0022 title=\u002211/05/2015 10:05  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 5, 2015\u003C/time\u003E by alpha tech\u003C/strong\u003E\n\u003Cbr\u003EAddon\n\u003C/span\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-11-05T21:50:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alpha tech\u0022 data-cite=\u0022alpha tech\u0022\u003E\u003Cdiv\u003Eyes but before the big bang how could a singularity be created if no space and no time existed?\u003Cp\u003Ealso the laws of physics would have to change for the big bang be cause it created matter, space, and time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe don\u0027t know. It is as simple as that.\u003C/p\u003E\u003Cp\u003EWe can\u0027t go further than Planck\u0027s time because that\u0027s when physics really start to do fuzzy things, and we cannot currently describe these fuzzy things, like really not at all. That is until we find a working theory of everything, and even then we might not be able to describe it properly.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-11-05T22:20:56Z","Content":"\n\u003Cp\u003EBecause the sum of everything is nothing.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-11-05T23:24:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alpha tech\u0022 data-cite=\u0022alpha tech\u0022\u003E\u003Cdiv\u003Eyes but before the big bang how could a singularity be created if no space and no time existed?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is no such thing as \u0022before\u0022 the big bang. Think of the big bang as the North Pole. The place from which you can only go South. What\u0027s North of North Pole? It\u0027s a bit of a silly question, isn\u0027t it? It\u0027s exactly the same way. The only time direction from Big Bang is forward. There is no such thing as time before Big Bang. Does that help?\u003C/p\u003E\n"},{"CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-11-06T01:25:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EThere is no such thing as \u0022before\u0022 the big bang. Think of the big bang as the North Pole. The place from which you can only go South. What\u0027s North of North Pole? It\u0027s a bit of a silly question, isn\u0027t it? It\u0027s exactly the same way. The only time direction from Big Bang is forward. There is no such thing as time before Big Bang. Does that help?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. K^2, you may be a well educated guy in physics, but your statement is nonsense. Within the universe we are in, something can\u0027t come from nothing, and something must always precede something else happening in time. In terms of what we know, the instant the big bang began something impossible happened. Inconveniently, we don\u0027t have any at hand means to resolve this paradox.\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-11-06T01:29:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SomeGuy12\u0022 data-cite=\u0022SomeGuy12\u0022\u003E\u003Cdiv\u003ENo. K^2, you may be a well educated guy in physics, but your statement is nonsense. Within the universe we are in, something can\u0027t come from nothing, and something must always precede something else happening in time. In terms of what we know, the instant the big bang began something impossible happened. Inconveniently, we don\u0027t have any at hand means to resolve this paradox.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn terms of what we know ?\u003C/p\u003E\u003Cp\u003EThing is, as I mentioned in my previous post, we don\u0027t know what happened at the instant t=0. Conventional physics, including the very notions of space and time, break down around Planck\u0027s time (~10\u003Csup\u003E-43\u003C/sup\u003E s after the Big Bang) and we need a new theory bringing together quantum field theory and general relativity to only \u003Cem\u003Ehope\u003C/em\u003E to know what happened back then.\u003C/p\u003E\u003Cp\u003EThis is very similar to the issue with black holes: describing a singularity requires using relativity and quantum mechanics together, which we can\u0027t today.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-06T01:32:21Z\u0022 title=\u002211/06/2015 01:32  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 6, 2015\u003C/time\u003E by Gaarst\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-11-06T02:13:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SomeGuy12\u0022 data-cite=\u0022SomeGuy12\u0022\u003E\u003Cdiv\u003ENo. K^2, you may be a well educated guy in physics, but your statement is nonsense. Within the universe we are in, something can\u0027t come from nothing, and something must always precede something else happening in time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s simply because you don\u0027t understand what time is. Go take a course in differential geometry. When you\u0027re done, we can chat and I\u0027ll get into the mathematics of it all. Until then, North Pole analogy is the best you\u0027re going to get. If you want to keep insisting that it\u0027s wrong without understanding anything about space-time, well, that\u0027s a really stupid thing to do. I\u0027m just going to leave it at that.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-11-06T02:19:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SomeGuy12\u0022 data-cite=\u0022SomeGuy12\u0022\u003E\u003Cdiv\u003ENo. K^2, you may be a well educated guy in physics, but your statement is nonsense. Within the universe we are in, something can\u0027t come from nothing, and something must always precede something else happening in time. In terms of what we know, the instant the big bang began something impossible happened. Inconveniently, we don\u0027t have any at hand means to resolve this paradox.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs strange as it may sound K^2 is probably right though i cannot agree with the way he said it. The basic problem is that when you say space or time, and we use our best definitions that are not QM we run into both as child processes of space time. Here is an example, suppose i say an apple fell and hit isaac on the noggin. But was its Isaacs nogging that hit the apple. The apple is falling is in the non-inertial reference frame, and the noggin was accelerated by earths surface to the apple. \u003C/p\u003E\u003Cp\u003EThis would appear to be random, but if we reverse time then all inertias appear to lead to a single point. No problem, our three space dimensions become a point particle, of course with massive particles this is unstable so we make mass disappear. Ok we have a infinite energy density state with no mass, hmmm, theoretically then relativistic gravity just also disappeared, oh damn, and so did space-time and time. So a free unassociated QM sigularity can do sci-fi like stuff, like be at any, all or no space-time all at once. One such state is our known universe. \u003C/p\u003E\u003Cp\u003EWhat happens before CMBR is speculation, before inflation moreso and i remind everyone that when you pull the cord on relativistic gravity, only the undefinable quantum gravity is left; left to act on a single point of infinite energy density. Things like time, space, temperature, polarity and charge become meaningless words. \u003C/p\u003E\u003Cp\u003ETo rephase what K2 said if you assume that the entire universe originated from a quantum singularity, then at the point quantum mechanics solely defines the state, time becomes meaningless.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-11-06T02:55:39Z","Content":"\n\u003Cp\u003EIt seems the real question here is \u0022how did the Big Bang occur if the law of conservation of energy / mass dictates that matter and energy cannot arise spontaneously in empty space?\u0022\u003C/p\u003E\u003Cp\u003ETo answer that is hard. The nature of the Big Bang is, and has for a while been, one of the hardest topics to study in all of science. Here\u0027s a few possibilities:\u003C/p\u003E\u003Cp\u003E- Time did not exist before the Big Bang, so in a sense there has always been the same amount of matter and energy for all of time.\u003C/p\u003E\u003Cp\u003E- The laws of physics only apply within the universe, so talking about boundary conditions at the edge of the universe, outside it, before the beginning, or after the end means throwing all known physical theorems into doubt.\u003C/p\u003E\u003Cp\u003E- Another universe existed before our own. Perhaps it collapsed into a Big Crunch and then rebounded; perhaps it moved through a higher dimension of space and collided with our own, transferring huge amounts of energy into it and causing a massive explosion; perhaps our universe was created from something that occurred in the previous universe, artificially or by a natural process.\u003C/p\u003E\u003Cp\u003E- Quantum Mechanics suggests that things CAN be created from nothing, if you\u0027re really sneaky about it, i.e. create only a little bit of stuff or get rid of it really quickly. And it has actually been calculated that the rough probability of a huge explosion of spontaneous matter and energy popping up out of empty space is such that it might happen once within all the known volume of the universe every 100 trillion years or so... so perhaps exactly that happened 14 billion years ago and the universe was essentially created by the Kraken.\u003C/p\u003E\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-11-06T02:59:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alpha tech\u0022 data-cite=\u0022alpha tech\u0022\u003E\u003Cdiv\u003EHow does the laws of physics allow something to be created from nothing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESimple: by separating positive from negative. \u002B1 \u002B -1 = 0. Take away the plus sign in the middle of the equation, and you\u0027ve got a positive on one part of the page, and a negative on another part of the page. Congratulations, you just created a Universe.....albeit a Universe that only has two particles in it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alpha tech\u0022 data-cite=\u0022alpha tech\u0022\u003E\u003Cdiv\u003Eyes but before the big bang how could a singularity be created if no space and no time existed?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the current hypothesis is that the Big Bang didn\u0027t actually come from a singularity. Also, keep in mind that from our viewpoint there are no actual singularities anywhere in our Universe. They\u0027re impossible. When an object (such as a star that\u0027s too big for its own good) collapses within its own event horizon to form a black hole, the collapse never actually finishes; from our viewpoint that would take an infinite amount of time, because time stops at the event horizon. Every black hole in existence, everywhere in this Universe, is still collapsing; the infalling matter appears to us to be frozen in time, just above the event horizon, falling towards it infinitely slowly.\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-11-06T03:13:46Z","Content":"\n\u003Cp\u003EK^2 analogy of poles is best for layman. For those interested in more logic, I\u0027ll just say this : even nothingness wasn\u0027t there, emptyness wasn\u0027t there, because there\u0027s no space and no time to (uh, spacetime) contain them. Even the term \u0022was\u0022 shouldn\u0027t really apply...\u003C/p\u003E\u003Cp\u003E... which is why the math is sooo hairy.\u003C/p\u003E\n"},{"CreatedByName":"Yourself","CreatedById":4465,"CreatedDateTime":"2015-11-06T03:15:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WedgeAntilles\u0022 data-cite=\u0022WedgeAntilles\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI think the current hypothesis is that the Big Bang didn\u0027t actually come from a singularity. Also, keep in mind that from our viewpoint there are no actual singularities anywhere in our Universe. They\u0027re impossible. When an object (such as a star that\u0027s too big for its own good) collapses within its own event horizon to form a black hole, the collapse never actually finishes; from our viewpoint that would take an infinite amount of time, because time stops at the event horizon. Every black hole in existence, everywhere in this Universe, is still collapsing; the infalling matter appears to us to be frozen in time, just above the event horizon, falling towards it infinitely slowly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is to say there are no naked singularities.\u003C/p\u003E\u003Cp\u003EAt least so long as you subscribe to the cosmic censorship hypothesis, anyway.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-06T03:20:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alpha tech\u0022 data-cite=\u0022alpha tech\u0022\u003E\u003Cdiv\u003Ebefore the big bang ... no space and no time existed?\u003C/div\u003E\u003C/blockquote\u003EThere\u0027s your problem - that\u0027s a contradiction. If the Big Bang is the earliest point in time then there was no \u0022before\u0022.\u003Cp\u003ENow causality that doesn\u0027t depend on time is possible, but we need to be careful when talking about it.\u003C/p\u003E\u003Cp\u003EBut my answer to the original question is that the Universe wasn\u0027t created or caused by anything. It just exists. And ultimately, no matter the scientific details, there has to be \u003Cem\u003Esomething\u003C/em\u003E that \u0022just is\u0022, that doesn\u0027t owe its existence to anything else. Whether that something is the universe we see, some larger multiverse, or even \u0027god\u0027 I don\u0027t know. So I choose to assume the simplest - that it\u0027s just the universe we see (and its expected extension beyond our visible horizon) - until I have evidence to the contrary.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-11-06T03:21:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EThere is no such thing as \u0022before\u0022 the big bang. Think of the big bang as the North Pole. The place from which you can only go South. What\u0027s North of North Pole? It\u0027s a bit of a silly question, isn\u0027t it? It\u0027s exactly the same way. The only time direction from Big Bang is forward. There is no such thing as time before Big Bang. Does that help?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut what, my friend(?), is time?\u003C/p\u003E\u003Cp\u003ETherein lies the question. Time is a human concept, describing the change of the universe. Not an inherent property of the universe. Things change, yes, but we only experience these changes in a specific order, even though it may be different.\u003C/p\u003E\u003Cp\u003ETo use a spherical analogy:\u003C/p\u003E\u003Cp\u003EA line on a map may be straight, but on the sphere it is curved.\u003C/p\u003E\u003Cp\u003EAnd going north at the North pole goes South. Also, which North pole?\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-11-06T04:07:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003EIt seems the real question here is \u0022how did the Big Bang occur if the law of conservation of energy / mass dictates that matter and energy cannot arise spontaneously in empty space?\u0022\u003Cp\u003ETo answer that is hard. The nature of the Big Bang is, and has for a while been, one of the hardest topics to study in all of science. Here\u0027s a few possibilities:\u003C/p\u003E\u003Cp\u003E- Time did not exist before the Big Bang, so in a sense there has always been the same amount of matter and energy for all of time.\u003C/p\u003E\u003Cp\u003E- The laws of physics only apply within the universe, so talking about boundary conditions at the edge of the universe, outside it, before the beginning, or after the end means throwing all known physical theorems into doubt.\u003C/p\u003E\u003Cp\u003E- Another universe existed before our own. Perhaps it collapsed into a Big Crunch and then rebounded; perhaps it moved through a higher dimension of space and collided with our own, transferring huge amounts of energy into it and causing a massive explosion; perhaps our universe was created from something that occurred in the previous universe, artificially or by a natural process.\u003C/p\u003E\u003Cp\u003E- Quantum Mechanics suggests that things CAN be created from nothing, if you\u0027re really sneaky about it, i.e. create only a little bit of stuff or get rid of it really quickly. And it has actually been calculated that the rough probability of a huge explosion of spontaneous matter and energy popping up out of empty space is such that it might happen once within all the known volume of the universe every 100 trillion years or so... so perhaps exactly that happened 14 billion years ago and the universe was essentially created by the Kraken.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst there is the suggestion that during inflation and the short period that followed that energy poured into our universe. I neither support or deny the pre CMBR suggestion.\u003C/p\u003E\u003Cp\u003ESecond, dark energy suggests that energy has poured into our universe. \u003C/p\u003E\u003Cp\u003EBoth of these may represent transition from energy states we do not understand tobstates we can deduce.\u003C/p\u003E\n"},{"CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-11-06T04:38:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EThat\u0027s simply because you don\u0027t understand what time is\u003C/div\u003E\u003C/blockquote\u003E What experimental evidence indicates that differential geometry is anything more than a hypothesis? I have read about precisely none, and in terms of factual validity, these theories are only slightly better than turtles all the way down.\u003Cp\u003EAnd even if you have a theory that time is a property that is related to the geometry of the universe, what about causality...\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-11-06T04:56:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alpha tech\u0022 data-cite=\u0022alpha tech\u0022\u003E\u003Cdiv\u003EHow does the laws of physics allow something to be created from nothing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESimple. Take a handful of bankers and add a lawyer or two. Be careful with adding politicians to the mix or you\u0027ll end up with way more than what you aimed for.\u003C/p\u003E\n"},{"CreatedByName":"Yourself","CreatedById":4465,"CreatedDateTime":"2015-11-06T05:28:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SomeGuy12\u0022 data-cite=\u0022SomeGuy12\u0022\u003E\u003Cdiv\u003EWhat experimental evidence indicates that differential geometry is anything more than a hypothesis? I have read about precisely none, and in terms of factual validity, these theories are only slightly better than turtles all the way down.\u003Cp\u003EAnd even if you have a theory that time is a property that is related to the geometry of the universe, what about causality...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Tests_of_general_relativity\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Tests_of_general_relativity\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you\u0027re looking for something more practical, the accuracy of GPS depends pretty critically on accurate predictions from GR. So, you know, that wouldn\u0027t work terribly well if GR weren\u0027t a good model of reality.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-11-06T06:19:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EBut what, my friend(?), is time?\u003Cp\u003ETherein lies the question. Time is a human concept, describing the change of the universe. Not an inherent property of the universe. Things change, yes, but we only experience these changes in a specific order, even though it may be different.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo the complication is that we actually say \u0022time\u0022 and can mean several of related, but distinct concepts.\u003C/p\u003E\u003Cp\u003E1) Time as a parameter in QM. We usually have proper time in mind when we talk about this one.\u003C/p\u003E\u003Cp\u003E2) Time as a coordinate in Relativity. This one can be strictly defined in terms of differential geometry.\u003C/p\u003E\u003Cp\u003E3) Time as casual ordering of events. This is the trickiest to define properly, and you have to drag entropy into it.\u003C/p\u003E\u003Cp\u003EAnd then you have various cross-disciplines. Relativistic Quantum Field Theory has to deal with both 1) and 2). Which gets really hairy. Statistical Mechanics deals with 1) and 3). There are only two realistic scenarios where you need to talk about all three. That\u0027s event horizon of a black hole and the Big Bang. If you have a good grasp of QCD, and Condensed Matter theory, you can have some idea of what\u0027s going on in such condition using mean field theory approximations. It\u0027s ugly, and our insight into exact physics of it is very limited to say the least.\u003C/p\u003E\u003Cp\u003EOn the other hand, the precise QM of what\u0027s going at these kinds of places isn\u0027t really relevant to the discussion. So once we take what we know about space-time geometry of these places, we can talk about time there purely in terms of differential geometry.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EAnd going north at the North pole goes South. Also, which North pole?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, if it only weren\u0027t for the dark energy... Having a \u0022South\u0022 pole in that analogy would imply a Big Crunch. Which isn\u0027t going to happen. I\u0027ve only used spherical geometry as a most familiar illustration. The \u0022North Pole\u0022 still behaves pretty much the same way. But there is no \u0022South Pole\u0022. It just stretches out to infinity as far as we can tell.\u003C/p\u003E\u003Cp\u003EWhich is very grim news. If universe is \u0022infinite\u0022 in time span, and we happen to live in its first 14by, this Universe won\u0027t be habitable for very long.\u003C/p\u003E\n"},{"CreatedByName":"Silver_Swift","CreatedById":123500,"CreatedDateTime":"2015-11-06T09:32:36Z","Content":"\n\u003Cp\u003EI think the question \u0022what was there before the big bang?\u0022 is valid, if worded confusingly. It\u0027s all good and well to say that time started at the big bang and there is no \u0022before\u0022 that for anything to be in, but that statement itself pre-supposes the laws of physics. Those laws have complexity, order, they can\u0027t just have poofed into existence at the start of time with no cause or explanation. If they did, there would be no reason we have this particular set of laws, rather than some arbitrary other set. \u003C/p\u003E\u003Cp\u003ENow this is a confusing question, because even if you did find a reason for why we have these specific laws of physics you could just follow the rabbit hole further down (eg. if we are living in a computer simulation, what laws is the computer running on?). There is probably always going to be some point where we are just going to have to admit that we don\u0027t know yet.\u003C/p\u003E\n"}]}