{"TopicId":124558,"ForumId":44,"TopicTitle":"Impact of solar panels on global climate","CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-11-06T07:46:00Z","PageNum":11,"Articles":[{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2015-11-18T21:06:40Z","Content":"\n[quote name=\u0027Stargate525\u0027]The proteins we need are made by the animals, not the plants said animals eat. It\u0026#39;s not like the grass we feed cattle has all the protein already. ;)[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nIt is still less nutritional value for the cattle. If that wouldn\u0026#39;t matter, we could just feed air balloons to the cows, after all ;-)\u003Cbr\u003E\nBut yeah, I do not have numbers. Might be that this is hust 1%. Maybe it is 50%. Maybe this is completely irrelevant.\u003Cbr\u003E\n\u003Cbr\u003E\nBut: think about the vegans. Or more economically oriented: on the impact/efficieny of cattle.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027WedgeAntilles\u0027]Bingo. There\u0026#39;s been a gigantic amount of research aimed at figuring out, by way of example, Fermat\u0026#39;s Last Theorem.\u003Cbr\u003E\n\u003Cbr\u003E\nHow many people did it take to finally prove Fermat\u0026#39;s Last Theorem? [B]One.[/B] Bravo to Andrew Wiles.[/QUOTE]\u003Cbr\u003E\nNow you were stupid enough to dabble into my area of expertise. You have not even any idea on how that one worked. Taniyama-Shimura conjecture, modularity, Taylor, not even speaking about the tons and tons of other people in the basics. It\u0026#39;s like claiming that the guy who laid the last stone built the entire pyramid. In this case he more or less built the entire king\u0026#39;s chamber, so surely is worthy of being praised, but saying that everything is his work is so very wrong. He built on so many conjecture, theorems, principles laid by others that this thread\u0026#39;s margin is too small to list them.\u003Cbr\u003E\nCome back to me if you know what a modular function is. Which is still very basic in regard to this.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-18T21:09:35Z\u0022 title=\u002211/18/2015 09:09  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 18, 2015\u003C/time\u003E by ZetaX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"micr0wave","CreatedById":136352,"CreatedDateTime":"2015-11-18T21:28:49Z","Content":"\nOrganic matter, animals, plants and all that stuff, is made mostly from Carbon, Nitrogen, Hydrogen and Oxygen. All those elements just get arranged in a different pattern. \u003Cbr\u003E\nThose proteins don\u0026#39;t spawn out of nowhere, but are the product of the involved metabolisms. Now when you raise the supply of one of the sources the metabolism needs it will show some increased growth, one of the reasons a lot of fertilizer is used in agriculture. The approach to show the good sides of COÃ‚Â² totally disregards that the increased level of COÃ‚Â² has some other effects than just providing some more fertilizer to boost growth. \u003Cbr\u003E\n\u003Cbr\u003E\nI have no idea if Wedge actually read the whole post where i tried to draw a rough, basic sketch of the involved mechanisms so it doesn\u0026#39;t include too much \u0026#39;technobabble\u0026#39;\u003Cbr\u003E\nWedge pretty much disqualified himself from this discussion by showing that there\u0026#39;s not really a solid basic knowledge about the whole matter he talks about (like .. you know, statistics, comparison of different sized entities)\u003Cbr\u003E\nI will not play some stupid wordtwisting games in a language i don\u0026#39;t speak with someone who fails to read/understand posts, then quotes a milifraction of a sentence to create some white noise and totally evading any arguments/questions. Spitting out things like \u0026#39;sucker\u0026#39;, \u0026#39;hysteric screams of horror\u0026#39; and then trying to accuse others of ad-homineming him because they just stated the obvious. Not the best behaviour to participate in a discussion if you ask me.\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-11-18T21:46:10Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027]Yourself. PB666. ZetaX. Micr0wave. Peadar.\u003Cbr\u003E\n[/quote]\u003Cbr\u003E\nNo, we listen to your counterpoints. Then we explain in detail why they are wrong. Then you repeat the exact same points.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote]\u003Cbr\u003E\nYou guys do realize that by talking about this in here, you\u0026#39;re giving away how other people can push your buttons....?\u003Cbr\u003E\n[/quote]\u003Cbr\u003E\nAnd who would want to \u0022push our buttons\u0022? I thought this was a debate about science, and not just trollish button-pushing.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote]\u003Cbr\u003E\nThat is a total lie. Everyone\u0026#39;s rebuttals were rebutted.\u003Cbr\u003E\n[/quote]\u003Cbr\u003E\nOh wow, if somebody said, or even implied, that you were a liar, you would be flinging the toys out of the pram, but it\u0026#39;s perfectly fine for you to accuse me?\u003Cbr\u003E\n\u003Cbr\u003E\nYou never refuted, or even acknowledged the significance of this graph in the last thread (except for your usual diversion tactics, nitpicking barely relevant details):\u003Cbr\u003E\n[IMG]http://eesc.columbia.edu/courses/ees/slides/climate/absorption.gif[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nDoes it, or does it not show that the absorption bands of CO2 are located primarily under the blackbody curve of the earth, as opposed to that of the sun?\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-11-18T22:28:22Z","Content":"\nWe have messed up ecological regions before. The dust bowl of the Depression is an example. It was caused by bad agricultural practice over many decades. Which led to the soil being loose since there were less of a certain type of plant(s) to hold them down.\u003Cbr\u003E\n\u003Cbr\u003E\nWe can cause major problems, it\u0026#39;s only a matter of when we will cause the next one.\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-11-19T00:01:19Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027]Yourself. PB666. ZetaX. Micr0wave. Peadar.\u003Cbr\u003E\n\u003Cbr\u003E\nThe reason you don\u0026#39;t see other people as stubborn as myself is because you\u0026#39;re not looking. Or, more likely, you overlook their sins because they\u0026#39;re on your side.....\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nYou guys do realize that by talking about this in here, you\u0026#39;re giving away how other people can push your buttons....?\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n....lying to the whole world and getting away with it. Their attempts to clean up their act are a sham. They are a closed society in which anybody who attempts to expose their shenanigans has a disturbing tendency to disappear. Pretty much the only thing we can do to verify China\u0026#39;s (alleged) compliance is spy on them with satellites, and there\u0026#39;s been nothing observed by that route that backs up your claims.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nThat is a total lie. Everyone\u0026#39;s rebuttals were rebutted.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nPrecisely. Thereby proving you [B]don\u0026#39;t[/B] understand how the system works, and that the scientific community\u0026#39;s (alleged) consensus on the issue is a consensus of the deluded.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nBingo. There\u0026#39;s been a gigantic amount of research aimed at figuring out, by way of example, Fermat\u0026#39;s Last Theorem.\u003Cbr\u003E\n\u003Cbr\u003E\nHow many people did it take to finally prove Fermat\u0026#39;s Last Theorem? [B]One.[/B] Bravo to Andrew Wiles.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nBTW the same could have been said about any large US city in 1970. Remember my grade school sitting out on the pickup, with 350 V8 engines belching out yellow fumes laden with lead oxides and unburnt hydrocarbons. Remember coming into houston, you could smell it about 50 miles before yo reached it. Took a couple of decades to clean up the air. It hits hard when a 200 mile region of interstate 10 is identifed as the cancer triangle, or the cancer capital of the US, there is a readon MD ANderson cancer hospital, one of the biggest cancer treatment centers is in Southeast Texas. \u003Cbr\u003E\n\u003Cbr\u003E\nRheumatoid arthritis, for example which has a huge link to poor air quality, its rate did not start dropping until a few years ago, the damage takes time to accumulate, and it takes time to repair, but i assure that the chinese are well on there way to start the remediation process, they have to, neccesity is the mother of invention.\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-11-19T03:15:43Z","Content":"\n[quote name=\u0027ZetaX\u0027]Now you were stupid enough to dabble into my area of expertise.[/QUOTE]\u003Cbr\u003E\n[B] LOL![/B] Literally. I genuinely busted a rib reading that. You just screwed up big time.\u003Cbr\u003E\n\u003Cbr\u003E\n\u0022WedgeAntilles\u0022 was not stupid enough to dabble into your area of expertise.\u003Cbr\u003E\n\u003Cbr\u003E\n[SIZE=3][B]Wikipedia was.[/B][/SIZE]\u003Cbr\u003E\n\u003Cbr\u003E\nIf you\u0026#39;re going to tell me you know better than Wikipedia? Forget it. That\u0026#39;s the ultimate peer-reviewed journal, and they trump you, every time. I read the history myself. Andrew Wiles pwn3d Fermat\u0026#39;s Last Theorem. In secret. [B]ONE MAN.[/B]\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]No, we listen to your counterpoints. Then we explain in detail why they are wrong. Then you repeat the exact same points.[/QUOTE]\u003Cbr\u003E\nNope. You got that third step wrong. I explain why your explanations that counter my counterpoints are wrong. Then your [B]fourth[/B] step is to tell the above lie.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]And who would want to \u0022push our buttons\u0022?[/QUOTE]\u003Cbr\u003E\nLots of people. Not necessarily for any discernible reason, either. Some people do it just for fun.\u003Cbr\u003E\n\u003Cbr\u003E\nCount your blessings, this little corner of the web right here is a bit of Nirvana.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]Oh wow, if somebody said, or even implied, that you were a liar[/QUOTE]\u003Cbr\u003E\nYou might want to read the thread again. I\u0026#39;ve already been accused many times. The accusations bore me. Oh, and you get negative rep for calling me immature with that \u0022throwing the toys out of the pram\u0022 bit.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]but it\u0026#39;s perfectly fine for you to accuse me?[/QUOTE]\u003Cbr\u003E\nYup. Do unto others as you would have others do unto you. You have done badly unto me. \u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]Does it, or does it not show that the absorption bands of CO2 are located primarily under the blackbody curve of the earth, as opposed to that of the sun?[/QUOTE]\u003Cbr\u003E\nOne band is. The other three are not. Here\u0026#39;s the real issue: the two leftmost absorption bands, within the Sun\u0026#39;s curve, are shorter wavelengths. Shorter wavelength = more energy. Shorter wavelength is incoming, longer wavelength is outgoing. Meaning stronger absorption of radiation on its way [B]IN.[/B] What your chart does [B]not[/B] show is the total energy absorbed by each band. No need to supply further info on that, I already know the answer. I\u0026#39;ve seen the solar radiation budget charts (Google) and they definitely show more getting absorbed on the way in.\u003Cbr\u003E\n\u003Cbr\u003E\nWhich I had already explained in that other thread. Evidently you missed it.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Bill Phil\u0027]We have messed up ecological regions before. The dust bowl of the Depression is an example. It was caused by bad agricultural practice over many decades.[/QUOTE]\u003Cbr\u003E\nOff-topic, but no biggie. I\u0026#39;ll run with it. You\u0026#39;re right. The above is entirely true. But that was not carbon dioxide. The real damage being done to Earth by humans (such as desertification) is not being committedy by greenhouse gases. It\u0026#39;s being committed by bulldozers.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027PB666\u0027]BTW the same could have been said about any large US city in 1970.[/QUOTE]\u003Cbr\u003E\nI know. I lived in one. China\u0026#39;s worst is a lot worse than the United States\u0026#39; worst. And, no: they don\u0026#39;t \u0022have to\u0022 clean up their act. They\u0026#39;re a totalitarian government and they consider their citizens expendable.\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-11-19T03:21:32Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027]\u003Cbr\u003E\nOff-topic, but no biggie. I\u0026#39;ll run with it. You\u0026#39;re right. The above is entirely true. But that was not carbon dioxide. The real damage being done to Earth by humans (such as desertification) is not being committedy by greenhouse gases. It\u0026#39;s being committed by bulldozers.\u003Cbr\u003E\n\u003Cbr\u003E\n[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThe point was that we [I][B]can[/B][/I] cause large scale ecological damage. As opposed to being unable to.\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2015-11-19T03:25:16Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027]\u003Cbr\u003E\nYup. Do unto others as you would have others do unto you. You have done badly unto me. [/QUOTE]\u003Cbr\u003E\nAnd you WOULD have, not as you HAVE had.\u003Cbr\u003E\n\u003Cbr\u003E\nStooping is never a good idea.\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-11-19T03:32:16Z","Content":"\nI disagree. Sometimes swinging back is necessary to remind the other guy that [B]they[/B] shouldn\u0026#39;t be stooping.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Bill Phil\u0027]The point was that we [I][B]can[/B][/I] cause large scale ecological damage. As opposed to being unable to.[/QUOTE]\u003Cbr\u003E\n\u0022Can cause\u0022 does not equal \u0022are causing\u0022.\u003Cbr\u003E\n\u003Cbr\u003E\nTell ya what, folks, I\u0026#39;m gonna nip this in the bud (not really for the alarmists, but for everybody else who gives a damn). If you wish to convince me (or anybody else) that greenhouse gases are a problem, you must prove (read this carefully!) that greenhouse gases are actually the cause of the warming trend we are (allegedly) experiencing. Merely showing that they\u0026#39;re happening at the same time is not enough (just because you always see a fire truck nearby when there\u0026#39;s a house on fire, doesn\u0026#39;t mean fire trucks cause fires). You have to show that the one is the cause of the other (and it\u0026#39;s entirely possible here that the OTHER is the cause of the ONE). And merely showing \u0022there\u0026#39;s no other explanation we know of\u0022 is also not enough, because there could be explanations you don\u0026#39;t know of. You have to show definitively that greenhouse gases are THE cause.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd let me be VERY clear: [B]NOTHING ELSE WILL DO.[/B] If you haven\u0026#39;t got the above, just don\u0026#39;t bother.\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-11-19T03:36:27Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027]I disagree. Sometimes swinging back is necessary to remind the other guy that [B]they[/B] shouldn\u0026#39;t be stooping.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n\u0022Can cause\u0022 does not equal \u0022are causing\u0022.\u003Cbr\u003E\n\u003Cbr\u003E\nTell ya what, folks, I\u0026#39;m gonna nip this in the bud (not really for the alarmists, but for everybody else who gives a damn). If you wish to convince me (or anybody else) that greenhouse gases are a problem, you must prove (read this carefully!) that greenhouse gases are actually the cause of the warming trend we are (allegedly) experiencing. Merely showing that they\u0026#39;re happening at the same time is not enough (just because you always see a fire truck nearby when there\u0026#39;s a house on fire, doesn\u0026#39;t mean fire trucks cause fires). You have to show that the one is the cause of the other (and it\u0026#39;s entirely possible here that the OTHER is the cause of the ONE). And merely showing \u0022there\u0026#39;s no other explanation we know of\u0022 is also not enough, because there could be explanations you don\u0026#39;t know of. You have to show definitively that greenhouse gases are THE cause.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd let me be VERY clear: [B]NOTHING ELSE WILL DO.[/B] If you haven\u0026#39;t got the above, just don\u0026#39;t bother.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nI never said that can = are. We simply are able to change the environment. That\u0026#39;s the point. That\u0026#39;s all.\u003Cbr\u003E\n\u003Cbr\u003E\nCan you please enlighten us as to what other causes there can be, or what ways we can prove that greenhouse gases are causing it.\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-11-19T03:51:35Z","Content":"\n[quote name=\u0027Bill Phil\u0027]I never said that can = are. We simply are able to change the environment. That\u0026#39;s the point. That\u0026#39;s all.[/QUOTE]\u003Cbr\u003E\nNot really productive. :P\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Bill Phil\u0027]Can you please enlighten us as to what other causes there can be[/QUOTE]\u003Cbr\u003E\nHeheh. I already did. In this thread. It was here:\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027WedgeAntilles from several pages back\u0027]In fact, here\u0026#39;s another one just for fun. \u0022Global dimming\u0022 is a known phenomenon: particulate pollution (i.e. soot) in the atmosphere reducing the amount of sunlight that reaches the Earth. Global dimming is known to have a net cooling effect on the planet. Now, for considerably longer than I\u0026#39;ve been alive, human beings have been trying to clean up \u0022pollution\u0022. The problem being that, for most of that time, \u0022pollution\u0022 meant soot and other particulate gunk--not carbon dioxide. For the last few decades, humans have been putting a lot more effort into cleaning up soot and smoke than carbon dioxide. Short version: global dimming causes planetary cooling. Human beings have been working hard to eliminate global dimming. What\u0026#39;s the end result? Warming. A source of global warming [B]that doesn\u0026#39;t involve greenhouse gases at all.[/B][/QUOTE]\u003Cbr\u003E\nWhat was a significant cause of global warming? Environmentalists, by way of eliminating global dimming. The above isn\u0026#39;t a \u0022maybe\u0022 either. Global dimming is a known phenomenon that has a significant impact on global temperatures. And it\u0026#39;s common fact that the early-on environmental movement didn\u0026#39;t even have carbon dioxide on their radar. It was particulates that were considered the problem.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Bill Phil\u0027]or what ways we can prove that greenhouse gases are causing it.[/QUOTE]\u003Cbr\u003E\nYou\u0026#39;re assuming there\u0026#39;s a way to prove that GHG\u0026#39;s are the culprit. If they\u0026#39;re not, then there [B]IS[/B] no way to prove that they are.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nOh, and just for kicks--a random snippet that\u0026#39;s actually about solar panels. :D Somebody in here posted a counter to my counter to their counter about the issue of whether or not solar panels contribute significantly to global warming by absorbing heat (the albedo thingy). Here\u0026#39;s the thing: nobody will contest the fact that pavement contributes measurably to warming; that\u0026#39;s been verified. Well, the United States has about 60,000 square miles of asphalt; that\u0026#39;s on the same order of magnitude as the amount of square mileage of solar panels needed to power the United States (40,000 to 200,000 square miles). Therefore the needed solar panels would contribute significantly to global warming by virtue of absorbing and emitting waste heat into the atmosphere, thereby nullifying the whole point of having solar panels in the first place.\u003Cbr\u003E\n\u003Cbr\u003E\nDebate over.\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-11-19T04:00:26Z","Content":"\nWow, you really are not that pleasant to discuss things with.... Although I don\u0026#39;t know about me...\u003Cbr\u003E\n\u003Cbr\u003E\nAnd how much soot was removed? If anything, more coal and other combustibles have been ignited since we started trying to reduce the solid waste from combustion. That means more soot, right? More of the stuff for global cooling... but it\u0026#39;s not cooling. At least not by current measurements and the measurements of the past decades.\u003Cbr\u003E\n\u003Cbr\u003E\nThat\u0026#39;s a fallacy. If they are not the cause, that should be provable. But that\u0026#39;s an if statement. A correct if statement, but only correct in that it\u0026#39;s true. If greenhouse gases are not the cause of global warming, then there is no way to prove it. Which is correct. But, it doesn\u0026#39;t mean anything relative to the argument.\u003Cbr\u003E\n\u003Cbr\u003E\nNow, if we can please move on to more important things...\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2015-11-19T10:15:32Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027][B] LOL![/B] Literally. I genuinely busted a rib reading that. You just screwed up big time.\u003Cbr\u003E\n\u003Cbr\u003E\n\u0022WedgeAntilles\u0022 was not stupid enough to dabble into your area of expertise.\u003Cbr\u003E\n\u003Cbr\u003E\n[SIZE=3][B]Wikipedia was.[/B][/SIZE]\u003Cbr\u003E\n\u003Cbr\u003E\nIf you\u0026#39;re going to tell me you know better than Wikipedia? Forget it. That\u0026#39;s the ultimate peer-reviewed journal, and they trump you, every time. I read the history myself. Andrew Wiles pwn3d Fermat\u0026#39;s Last Theorem. In secret. [B]ONE MAN.[/B]\u003Cbr\u003E\n[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nIt seems you cannot even read. Because Wikipedia very clearly gives a very long history of the proof.\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-11-19T10:29:06Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027]What was a significant cause of global warming? Environmentalists, by way of eliminating global dimming. The above isn\u0026#39;t a \u0022maybe\u0022 either. Global dimming is a known phenomenon that has a significant impact on global temperatures.[/QUOTE]\u003Cbr\u003E\nThat\u0026#39;s why Venus is such a chill place. All the dimming. Yup.\u003Cbr\u003E\n\u003Cbr\u003E\nExcept, of course, that\u0026#39;s not how thermodynamics works. Dimming can have short-term effect by reducing amount of radiation deposited to ground directly. Unfortunately, there is a slower process riding on top of that. If you\u0026#39;ve ever flown an airplane and payed attention to outside temperature reports, you might have noticed that it\u0026#39;s a hell of a lot colder up there. The reason for that is that the atmospheric circulation with higher pressure at the bottom and lower at the top works like a refrigerator. When you shift heat exchange to higher altitude, which is what really happens in \u0022global dimming\u0022, that works like turning the AC around and sitting on the hot side of it. It takes a [i]while[/i] to kick in, but by far the worst thing we could possibly do is make upper atmosphere opaque. Ground temperatures will eventually reach the same differential we observe now, resulting in global temperatures going up by tens of degrees. Might sound extreme, but there\u0026#39;s a reason why led melts on the surface of Venus.\u003Cbr\u003E\n\u003Cbr\u003E\nCO2 effect is far, far subtler, because it does [i]not[/i] block incoming radiation, allowing radiation equilibrium to establish at surface level, and it only blocks a small fraction of IR going up. And many of the models greatly exaggerate the impact of CO2, because they do not take into account altitude distributions and convection, but until we actually have better models to account for all the factors, it\u0026#39;s hard to say how much predictions are off by.\u003Cbr\u003E\n\u003Cbr\u003E\nOne thing\u0026#39;s for certain, though. If you think that humans are or ever have been causing the planet to get [i]cooler[/i], you are delusional. There is no scientific basis for it. Not a [i]single[/i] scientist, even a die-hard opponent of anthropogenic climate change, would ever tell you otherwise. We have a pretty wide pool of models and predictions, and they all vary from \u0022Humans make no impact,\u0022 to \u0022Humans are the only reason we aren\u0026#39;t in ice age yet.\u0022 The only people who think pollution can make planet colder are the ones who never took a real science class in their lives.\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-11-19T10:34:50Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027]\u003Cbr\u003E\nNope. You got that third step wrong. I explain why your explanations that counter my counterpoints are wrong. Then your [B]fourth[/B] step is to tell the above lie.\u003Cbr\u003E\n[/quote]\u003Cbr\u003E\nYou explain nothing, you just throw out more claims without backing them up.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote]\u003Cbr\u003E\nLots of people. Not necessarily for any discernible reason, either. Some people do it just for fun.\u003Cbr\u003E\n\u003Cbr\u003E\nCount your blessings, this little corner of the web right here is a bit of Nirvana.\u003Cbr\u003E\n[/quote]\u003Cbr\u003E\nSo are you trying to \u0022push my buttons\u0022 then?\u003Cbr\u003E\n\u003Cbr\u003E\n[quote]\u003Cbr\u003E\nYou might want to read the thread again. I\u0026#39;ve already been accused many times. The accusations bore me. Oh, and you get negative rep for calling me immature with that \u0022throwing the toys out of the pram\u0022 bit.\u003Cbr\u003E\n\u003Cbr\u003E\nYup. Do unto others as you would have others do unto you. You have done badly unto me. \u003Cbr\u003E\n[/quote]\u003Cbr\u003E\nBailing out of this before it turns into a flame war. Retracting nothing though.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote]\u003Cbr\u003E\nOne band is. The other three are not. Here\u0026#39;s the real issue: the two leftmost absorption bands, within the Sun\u0026#39;s curve, are shorter wavelengths. Shorter wavelength = more energy. Shorter wavelength is incoming, longer wavelength is outgoing. Meaning stronger absorption of radiation on its way [B]IN.[/B] What your chart does [B]not[/B] show is the total energy absorbed by each band. No need to supply further info on that, I already know the answer. I\u0026#39;ve seen the solar radiation budget charts (Google) and they definitely show more getting absorbed on the way in.\u003Cbr\u003E\n[/quote]\u003Cbr\u003E\nThe two curves are normalised for the amount of energy contained in each. Two bands at the very tail of the solar curve does not even come close to the band right smack in the middle of the earth\u0026#39;s curve. You are wilfully misinterpreting the data.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote]\u003Cbr\u003E\nWhich I had already explained in that other thread. Evidently you missed it.\u003Cbr\u003E\n[/quote]\u003Cbr\u003E\n\u003Cbr\u003E\nI posted the graph here: [url]http://forum.kerbalspaceprogram.com/threads/131291-Understanding-the-Greenhouse-%28Gas%29-Effect?p=2139127\u0026viewfull=1#post2139127[/url]\u003Cbr\u003E\n\u003Cbr\u003E\nAnd here: [url]http://forum.kerbalspaceprogram.com/threads/131291-Understanding-the-Greenhouse-%28Gas%29-Effect?p=2148239\u0026viewfull=1#post2148239[/url]\u003Cbr\u003E\n\u003Cbr\u003E\nNo response from you, apart from to nitpick about whether the sun\u0026#39;s output was mainly in the infra-red or the visible range, nothing about whether the absorptions bands actually lie under the parts of the spectrum containing the most energy.\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-11-19T13:13:10Z","Content":"\n[quote name=\u0027WedgeAntilles\u0027][B] LOL![/B] Literally. I genuinely busted a rib reading that. You just screwed up big time.\u003Cbr\u003E\n\u003Cbr\u003E\n\u0022WedgeAntilles\u0022 was not stupid enough to dabble into your area of expertise.\u003Cbr\u003E\n\u003Cbr\u003E\n[SIZE=3][B]Wikipedia was.[/B][/SIZE]\u003Cbr\u003E\n\u003Cbr\u003E\nIf you\u0026#39;re going to tell me you know better than Wikipedia? Forget it. That\u0026#39;s the ultimate peer-reviewed journal, and they trump you, every time. I read the history myself. Andrew Wiles pwn3d Fermat\u0026#39;s Last Theorem. In secret. [B]ONE MAN.[/B][/quote]\u003Cbr\u003E\n\u003Cbr\u003E\nLooks like you broke a perfectly good rib for nothing then. \u003Cbr\u003E\n\u003Cbr\u003E\nFirstly, I find your characterisation of Wikipedia to be distinctly optimistic. It\u0026#39;s a wonderful tool, it\u0026#39;s a marvelous way of getting an overview of almost any conceivable topic and for topics (such as Fermat\u0026#39;s last theorem) which aren\u0026#39;t particularly controversial, it\u0026#39;s probably a very good reference source. I would never use it as a sole reference and for anything remotely controversial, I would take its articles with the requisite grain of salt. The \u0026#39;ultimate peer reviewed journal\u0026#39; it is not.\u003Cbr\u003E\n\u003Cbr\u003E\nSecondly, I too read the Wikipedia history of Wiles\u0026#39; proof and I\u0026#39;m seeing exactly what ZetaX said. I draw your attention to the opening line of the Wikipedia article:\u003Cbr\u003E\n\u003Cbr\u003E\nAndrew Wiles\u0026#39; proof of Fermat\u0026#39;s Last Theorem is a proof of the modularity theorem for semistable elliptic curves released by Andrew Wiles, which, [B]together with Ribet\u0026#39;s theorem[/B], provides a proof for Fermat\u0026#39;s Last Theorem. (emphasis added)\u003Cbr\u003E\n\u003Cbr\u003E\nWiles fully deserves all the credit he got but he was also building on the work of many other mathematicians. He certainly didn\u0026#39;t \u0026#39;pwn Fermat\u0026#39;s last theorem in secret.\u0026#39;\u003Cbr\u003E\n\u003Cbr\u003E\nAnyway - back to climate change wrangling.\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-11-19T17:54:26Z","Content":"\n[quote name=\u0027Stargate525\u0027]Its certainly less economically expensive. All you need is mirrors and a water steam system.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nHow about efficiency, in terms of energy generated per surface area, and per deployment cost?\n"},{"CreatedByName":"Chakat Firepaw","CreatedById":150121,"CreatedDateTime":"2015-11-19T17:58:52Z","Content":"\n[quote name=\u0027Stargate525\u0027]Yup, I saw it. Slightly less nutritional value. But we don\u0026#39;t get protein primarily from plants anyway, and the nitrates don\u0026#39;t seem to affect anything but the pest insects who spray them.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nActually we do: Very few animals produce the amino acids themselves, instead we convent one amino acid to another with the original fixation being done by plants and soil bacteria.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Stargate525\u0027]And if it\u0026#39;s a 10% reduction in nutritional value but a 15% increase in yield, then it\u0026#39;s still a net positive.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nNot when eating enough to make up that 10% reduction in proteins and minerals means eating 12% more calories.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Stargate525\u0027]And I haven\u0026#39;t heard about these crop failures. Source please?[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nRice requires temperatures no higher than about 30 degrees to ripen and no higher than 40 to pollinate. I know of the failures because of a radio interview with a representative of the International Rice Research Institute, and thus far they have been local.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-19T17:59:30Z\u0022 title=\u002211/19/2015 05:59  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 19, 2015\u003C/time\u003E by Chakat Firepaw\u003C/strong\u003E\n\u003Cbr\u003EMarkup error\n\u003C/span\u003E\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-11-20T23:47:44Z","Content":"\n[quote name=\u0027Bill Phil\u0027]Wow, you really are not that pleasant to discuss things with.... Although I don\u0026#39;t know about me...[/QUOTE]\u003Cbr\u003E\nYou\u0026#39;re fine. And yes, I\u0026#39;m cranky. A decade of exposure to global warming alarmists is what made me that way.\u003Cbr\u003E\n\u003Cbr\u003E\nDo unto others as you would have others do unto you. Want me to play nice? Then play nice.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Bill Phil\u0027]The point was that we [I][B]can[/B][/I] cause large scale ecological damage. As opposed to being unable to.[/QUOTE]\u003Cbr\u003E\nAnd we can cause large scale improvement. Me, I\u0026#39;m keeping my house and my computer and my Doritos!\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;m with Just Jim on this; Earth\u0026#39;s past natural disasters completely dwarf all the damage human beings are capable of.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027ZetaX\u0027]It seems you cannot even read. Because Wikipedia very clearly gives a very long history of the proof.[/QUOTE]\u003Cbr\u003E\nThe proof\u0026#39;s history is irrelevant. What\u0026#39;s in the proof is irrelevant. All your talk about modularity and Taniyama-Shimura and the like is irrelevant. What matters is that it took [B]ONE[/B] person to put all the pieces together. The \u0022huge body of research\u0022 on climate change is a huge tower of papers waiting to fall over--if and when it topples, it will take [B]ONE[/B] person\u0026#39;s ideas to topple it.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027K^2\u0027]That\u0026#39;s why Venus is such a chill place. All the dimming. Yup.[/QUOTE]\u003Cbr\u003E\nVenus gets twice as much solar radiation as Earth does, and its atmosphere is only opaque in visible light. It\u0026#39;s partially transparent in infrared. (carbon dioxide only absorbs infrared at a few wavelengths)\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027K^2\u0027] Except, of course, that\u0026#39;s not how thermodynamics works. Dimming can have short-term effect by reducing amount of radiation deposited to ground directly. Unfortunately, there is a slower process riding on top of that. If you\u0026#39;ve ever flown an airplane and payed attention to outside temperature reports, you might have noticed that it\u0026#39;s a hell of a lot colder up there. The reason for that is that the atmospheric circulation with higher pressure at the bottom and lower at the top works like a refrigerator. When you shift heat exchange to higher altitude, which is what really happens in \u0022global dimming\u0022, that works like turning the AC around and sitting on the hot side of it.[/QUOTE]\u003Cbr\u003E\nNo, that works like turning the AC around so the hot side is pointing at outer space.\u003Cbr\u003E\n\u003Cbr\u003E\nSide note: when I was younger I did a lot of backpacking in the Sierras, and frequently got up to high altitudes. Yes, I felt the thing with the cold air. But I also noticed this: the side of me facing the Sun got uncomfortably hot on a clear day at ten thousand feet altitude. I often ended up doing a self-barbecue kind of thing, turning around every few moments because the sunny side of me was too hot and the other side of me was too cold. Bottom line: the Sun\u0026#39;s heat easily beat the cold air. At high altitude, reflection is the primary factor, and atmospheric convection runs a distant second. Outside the atmosphere, surfaces get real hot real fast.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]You explain nothing, you just throw out more claims without backing them up.[/QUOTE]\u003Cbr\u003E\nYeah......you said that already. So my reply is whatever I said last time.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]So are you trying to \u0022push my buttons\u0022 then?[/QUOTE]\u003Cbr\u003E\nNope. You know that old saying about how \u0022the truth hurts\u0022? In a global warming thread, somebody\u0026#39;s buttons are gonna get pushed, no matter what. This site already has a rule about \u0022no politics\u0022, maybe they should add a rule about \u0022no global warming discussions\u0022?\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]Retracting nothing though.[/QUOTE]\u003Cbr\u003E\nDitto.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027peadar1987\u0027]The two curves are normalised for the amount of energy contained in each.[/QUOTE]\u003Cbr\u003E\nThen the chart is bogus. The Sun\u0026#39;s emission spectrum is (reasonably) smooth, as most stars are. Earth\u0026#39;s is not. The Earth\u0026#39;s surface is a complex mishmash of surfaces, all of which have different albedos, different absorption spectra, and different emission spectra. Earth is [B]NOT[/B] a smooth curve.\u003Cbr\u003E\n\u003Cbr\u003E\nOh, and that part about [B]ONE[/B] absorption percentage line being used for multiple gases?? Seriously, that\u0026#39;s messed up. Go get a different chart.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027K^2\u0027]One thing\u0026#39;s for certain, though. If you think that humans are or ever have been causing the planet to get [I]cooler[/I], you are delusional. There is no scientific basis for it. Not a [I]single[/I] scientist, even a die-hard opponent of anthropogenic climate change, would ever tell you otherwise.[/QUOTE]\u003Cbr\u003E\nA number of scientists have.\u003Cbr\u003E\n\u003Cbr\u003E\nThe theory: that global warming will cause polar ice melting, causing fresh water to dump into the oceans and disrupt the trans-Atlantic currents that keep America and Europe warm, thereby causing cooling (possibly an Ice Age).\u003Cbr\u003E\n\u003Cbr\u003E\nI think that theory is malarkey, personally. But it is out there.\n"},{"CreatedByName":"Dieselpower","CreatedById":18995,"CreatedDateTime":"2015-11-21T00:09:16Z","Content":"\nPut aside the dodging of criticism, answering selectively and admitting that you just want to troll - can you explain to me once again why you think your believe is more valid than the articles written by thousands of scientists?\u003Cbr\u003E\nAre those who study climate for a living bought by solar panel producers?\u003Cbr\u003E\nOr is it the governments that want to limit your lifestyle?\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-11-21T00:27:25Z","Content":"\nI don\u0026#39;t know about you guys, but I\u0026#39;d rather breathe fresh air instead of smelling burnt cables and plastic bags every night during winter.\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-11-21T01:23:02Z","Content":"\nIt seems the argument here turned personal and nasty days ago. Time to move on to other discussions, folks.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-21T01:26:39Z\u0022 title=\u002211/21/2015 01:26  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 21, 2015\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"}]}