{"TopicId":129052,"ForumId":44,"TopicTitle":"Asparagus staging causing rotation? Weigh in here!","CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2016-01-01T19:22:04Z","PageNum":1,"Articles":[{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2016-01-01T19:22:04Z","Content":"\n\u003Cp\u003E\nSo there\u0027s a disagreement on the forums about whether the piping of rocket fuel in a circular direction before use would cause rotation in the launch stack.\n\u003C/p\u003E\n\u003Cp\u003E\n1 side says the cumulative mass of fuel piped in a circular fashion before being expelled would cause an equal and opposite reaction in the launcher.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other says that the only source of torque would be from the initial acceleration of fuel, but since it decelerates on the other side of the pipe, there is no net torque.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat do you think? Weigh in here.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\n\u003C/p\u003E\n\u003Cp\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2016-01-01T21:30:49Z","Content":"\n\u003Cp\u003E\nWhatever the reason is, wouldn\u0027t this problem (if there actually is a spin) be easily solved by a tiny amount of thrust vectoring ?\n\u003C/p\u003E\n"},{"CreatedByName":"SomeGuy123","CreatedById":154263,"CreatedDateTime":"2016-01-01T22:19:10Z","Content":"\n\u003Cp\u003E\nMomentum is conserved, both angular and rotational.  So if the fuel undergoes no \u003Cem\u003Enet \u003C/em\u003Echanges (it speeds up and then slows down), and the rocket engines at the bottom continue to aim their thrust vectors through the center of mass of the vehicle, there cannot be any change in angular momentum and thus there can be no rotation.\n\u003C/p\u003E\n\u003Cp\u003E\nEnd thread, that\u0027s the Laws of Physics and it\u0027s not a complex question.\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2016-01-01T22:21:35Z","Content":"\n\u003Cp\u003E\nHcube,\n\u003C/p\u003E\n\u003Cp\u003E\n I\u0027m sure there\u0027d be ways to counter it if it existed, but the puzzle is whether or not it would exist in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nMy thinking is that it would not. I think it would be like an Archimedes steam engine with the exhausts turned perpendicular to the plane of rotation. It doesn\u0027t really matter that the fuel is piped around in a half- circle before being used.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I don\u0027t know that...\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\n\u003C/p\u003E\n\u003Cp\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2016-01-01T22:39:34Z","Content":"\n\u003Cp\u003E\nI think I can admit to both being pro-\u0022no net torque\u0022 (after the fuel line is filled, at least) and the person who most needs to keep the xkcd \u0022someone is wrong on the internet\u0022 comic in mind on the topic.\n\u003C/p\u003E\n\u003Cp\u003E\nMy reasoning (the explanation of which may be fuzzy, I\u0027ve been having problems sleeping lately) is as follows.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is torque generated as the fuel is accelerated into the fuel line(s).  However, once the fuel line is full, the fuel has to go somewhere, and unless it\u0027s getting directly spewed out of the craft in the direction the fuel line is run, there will be a counterbalancing torque as the fuel either decelerates or gets diverted.  Deceleration would be the case of the fuel getting dumped into another fuel tank or combustion chamber, diverted would be the case if the fuel line makes a 90 degree turn, even if done gradually.\n\u003C/p\u003E\n\u003Cp\u003E\nEven if the combustion chamber doesn\u0027t absorb all of the lateral momentum of the fuel, the reaction mass is getting expelled at better than 2km/sec,  so it wouldn\u0027t take much engine gimballing to counter the remaining torque unless the fuel lines are setting some kind of speed record.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT:  the second point is off-topic according to GoSlash27\u0027s second post, which I didn\u0027t see because I fell asleep while composing the message.  Getting 4-5 hours of sleep a night for weeks at a time is far from optimal for me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-01T22:44:09Z\u0022 title=\u002201/01/2016 10:44  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 1, 2016\u003C/time\u003E by Eric S\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-01-02T12:06:36Z","Content":"\n\u003Cp\u003E\nI think I\u0027m understanding the difference in opinion here, after leaving the forum for a day and coming back (this weekend is my first real break from work since Thanksgiving and I decided to go Internet-free for the past 24 hours, and likely most of the next 24 as well. Nothing to do with this thread or those involved. I\u0027m actually enjoying the discussion, when I\u0027m not instead watching TV and spending time with RL friends!) so let me try to clear up my viewpoint. The misunderstanding may be entirely due to my lack of proper terms, and possible use of terms incorrectly. I apologize is this is the case, but in many cases I just don\u0027t know any better. I have what could be called \u0022street\u0022 education in many things; my learning was done on my own, using books and the Internet, and my (sometimes imperfect) personal deduction and experiment.\n\u003C/p\u003E\n\u003Cp\u003E\nI agree that the ship would not start rotating faster and faster. What I\u0027m saying is it WOULD rotate, while the fuel was being pumped around. I do not know by how much, but my gut (tempered only with experience, I\u0027ll admit) tells me it would be significant enough that it would require solving or at LEAST taking account of.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso I\u0027m totally okay being wrong. I just still think I\u0027m right. I\u0027ve actually given this some thought and think I may have a fairly simple test that will at least satisfy \u003Cstrong\u003EME\u003C/strong\u003E one way or another. If I get the means and opportunity (I have the motive) I\u0027ll give it a try and if possible I\u0027ll film it.\n\u003C/p\u003E\n\u003Cp\u003E\nThen everybody can either say they told me so, or why my test is invalid \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso, regarding whether or not this was valid in the other thread. I actually thought about that before my 2nd post (when it became obvious that this could derail the thread) and came to the conclusion that it was okay specifically because the OP wanted to remove Asparagus staging because it was unrealistic. This begs the question \u0022is Asparagus staging unrealistic?\u0022 which I was involved in answering.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-02T12:08:23Z\u0022 title=\u002201/02/2016 12:08  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 2, 2016\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2016-01-02T14:10:32Z","Content":"\n\u003Cp\u003E\nIs this question even mind-bending \u003Cem\u003Eenough\u003C/em\u003E?  So far we\u0027re only considering transfer from tank to tank (to tank, ...) to engine(s).  Should we take into account, in RL at least, the dynamics of the fuel within the tanks themselves?\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I\u0027m thinking about here is that fuel lines are not attached directly radially on tanks but are off-centre the fuel would swirl out or into them, with a rotation all its own.  How - if at all - would all those vortices around a vehicle affect it?  For full mind-twisting consider votices deliberately arranged in co-ordination (all clockwise or anti-clockwise) or alternately (clockwise to anti-clockwise, to clockwise, etc.).  I think I need to lie down, I\u0027m getting dizzy just thinking about it.\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-01-02T14:35:01Z","Content":"\n\u003Cp\u003E\nDoesn\u0027t matter. SomeGuy123 summarized it already. For angular momentum of the rocket to change, something must carry it away. Unless exhaust itself is angled and/or rotating, you can\u0027t come up with any sort of internal piping that will cause the rocket to rotate. This is no different than trying to accelerate a rocket without having some sort of an exhaust. Just like linear momentum, angular momentum has to go somewhere.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-01-02T14:39:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222345164\u0022 data-ipsquote-contentid=\u0022129052\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451687974\u0022 data-ipsquote-userid=\u002257117\u0022 data-ipsquote-username=\u0022Eric S\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Eric S said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think I can admit to both being pro-\u0022no net torque\u0022 (after the fuel line is filled, at least) and the person who most needs to keep the xkcd \u0022someone is wrong on the internet\u0022 comic in mind on the topic.\n\u003C/p\u003E\n\u003Cp\u003E\nMy reasoning (the explanation of which may be fuzzy, I\u0027ve been having problems sleeping lately) is as follows.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is torque generated as the fuel is accelerated into the fuel line(s).  However, once the fuel line is full, the fuel has to go somewhere, and unless it\u0027s getting directly spewed out of the craft in the direction the fuel line is run, there will be a counterbalancing torque as the fuel either decelerates or gets diverted.  Deceleration would be the case of the fuel getting dumped into another fuel tank or combustion chamber, diverted would be the case if the fuel line makes a 90 degree turn, even if done gradually.\n\u003C/p\u003E\n\u003Cp\u003E\nEven if the combustion chamber doesn\u0027t absorb all of the lateral momentum of the fuel, the reaction mass is getting expelled at better than 2km/sec,  so it wouldn\u0027t take much engine gimballing to counter the remaining torque unless the fuel lines are setting some kind of speed record.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT:  the second point is off-topic according to GoSlash27\u0027s second post, which I didn\u0027t see because I fell asleep while composing the message.  Getting 4-5 hours of sleep a night for weeks at a time is far from optimal for me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyou guys firgot one tiny detail, engines throttle up on the luanch pad and the fuel line exerts rotation against kerbal which resists and the outside tanks resist the turning force, when finally the outside tank goes empty kerbal is no longer attached,matmospheric pressurre is lower and the otsidectanks are lighter sonthere is alot less there to resist that force. Having said that a decent gimble and reaction wheel handkes the problem. \n\u003C/p\u003E\n\u003Cp\u003E\nyou guys argument should have begun with all things being held equal, but end with a rocket flight is a highly dynamic process in which all things do not remain equal in the process. \n\u003C/p\u003E\n"},{"CreatedByName":"Zoidos","CreatedById":133853,"CreatedDateTime":"2016-01-02T15:06:19Z","Content":"\n\u003Cp\u003E\nWow, a whole thread for this. Nice \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOf course I could be wrong, but I imagine it this way: If there is a circular hose floating in a vacuum, with a pump in the middle, as soon as the pump is activated, it creates momentum - and the hose starts to spin. It should be approximately the same principle with a big rocket with asparagus staging all around. But as mentioned in the original (hijacked) thread, even IF this force exists, it is very small compared to the mass of the rocket.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd again, I could be wrong of course.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the only way to solve this is for someone with a camera, a garden, a hose and temps over freezing point to create an experiment \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-01-02T15:11:58Z","Content":"\n\u003Cp\u003E\nMoving around large amounts of liquid fuel from tank to tank would cause some sloshing and wobbling (introducing potential catastrophic problems) but net rotation would be zero.\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2016-01-02T15:30:46Z","Content":"\n\u003Cp\u003E\nThe rotation of fuel have little effect on the rocket. Just like how a turbine engine push you forward from the exhaust and not rotate sideways from the turbines. If any effects happening, you have more than one engine, yes ? The thrust of those engines are ginourmous just to counteract the fuel flow. A different case lies in helicopters : the inertia (plus some horizontal force out of the air being pushed around) of those main blades rotating are large enough that you need something else to counteract it aand some mechanism to counteract your counteraction.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-02T15:34:42Z\u0022 title=\u002201/02/2016 03:34  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 2, 2016\u003C/time\u003E by YNM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-01-02T16:35:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222345886\u0022 data-ipsquote-contentid=\u0022129052\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451748646\u0022 data-ipsquote-userid=\u002298447\u0022 data-ipsquote-username=\u0022YNM\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, YNM said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust like how a turbine engine push you forward from the exhaust and not rotate sideways from the turbines.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTurbines have alternating stator and rotor stages, which cancel out the torque. Otherwise, torque would be quite significant. In propeller aircraft, there is no such mechanism, and torque from the prop has to be countered by control surfaces of the aircraft.\n\u003C/p\u003E\n\u003Cp\u003E\nBut as I pointed out above, the only reason this matters is because angular momentum is being passed to the outflow.\n\u003C/p\u003E\n"},{"CreatedByName":"SomeGuy123","CreatedById":154263,"CreatedDateTime":"2016-01-02T19:21:00Z","Content":"\n\u003Cp\u003E\nThere is one \u003Cem\u003Eslight \u003C/em\u003Eexception.  Angular momentum is conserved, right.  It adds to zero for a non-spinning rocket shaped object.  So if you began \u0022spinning\u0022 a mass internal to the rocket one way, angular momentum is \u003Cem\u003Estill \u003C/em\u003Econserved.  Something has to counteract it.  So the \u003Cstrong\u003Estructure of the rocket\u003C/strong\u003E (everything else besides the thing that is spinning) moves the \u003Cem\u003Eother \u003C/em\u003Edirection.  Angular momentum still adds to zero.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if you start accelerating fuel and then decelerating fuel to a stop in a different fuel tank, the process of beginning the fuel movement might cause the body of the rocket to begin to rotate a little bit.\n\u003C/p\u003E\n\u003Cp\u003E\nI suspect that things like tiny imbalances in wind and aerodynamic loads and asymmetries in the rocket itself and many other factors cause a larger effect.  In any case, the rocket\u0027s guidance system has to act against all of these forces by either keeping the main engines aligned with center of mass and using control thrusters, or using the main engines to apply counter-torques to keep the rocket aligned correctly with the programmed flight angle.  (pretty sure the main sensor you use here is an accelerometer that can sense gravity.  So your \u0022flight plan\u0022 actually is \u0022thrust with gravity \u0022straight down\u0022 with respect to the accelerometer mounting location until a certain amount of velocity has been gained, then it would have a series of calculated angles with respect to gravity as the new commanded flight angles in the memory of the rocket\u0027s computer)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2016-01-02T19:58:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222345750\u0022 data-ipsquote-contentid=\u0022129052\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451736396\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso I\u0027m totally okay being wrong. I just still think I\u0027m right. I\u0027ve actually given this some thought and think I may have a fairly simple test that will at least satisfy \u003Cstrong\u003EME\u003C/strong\u003E one way or another. If I get the means and opportunity (I have the motive) I\u0027ll give it a try and if possible I\u0027ll film it.\n\u003C/p\u003E\n\u003Cp\u003E\nThen everybody can either say they told me so, or why my test is invalid \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n5thHorseman,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m just interested in seeing how it turns out.\n\u003C/p\u003E\n\u003Cp\u003E\nYay SCIENCE!\n\u003C/p\u003E\n\u003Cp\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"PnDB","CreatedById":134433,"CreatedDateTime":"2016-01-03T15:33:39Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s do some more mental gymnastics.  Consider the following geometry:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 height=\u0022477\u0022 src=\u0022http://i.imgur.com/gk6LZvN.jpg\u0022 width=\u0022681\u0022 alt=\u0022gk6LZvN.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe two tanks hold fuel, with the bottom tank feeding an engine.  The top tank feeds the bottom tank by pumping fuel through two helical pipes.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen the engine is burning fuel, what happens?  Does this thing spin on its axis?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-01-03T16:08:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222346978\u0022 data-ipsquote-contentid=\u0022129052\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451835219\u0022 data-ipsquote-userid=\u0022134433\u0022 data-ipsquote-username=\u0022PnDB\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, PnDB said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s do some more mental gymnastics.  Consider the following geometry:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/gk6LZvN.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022gk6LZvN.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022477\u0022 src=\u0022http://i.imgur.com/gk6LZvN.jpg\u0022 width=\u0022681\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe two tanks hold fuel, with the bottom tank feeding an engine.  The top tank feeds the bottom tank by pumping fuel through two helical pipes.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen the engine is burning fuel, what happens?  Does this thing spin on its axis?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy gut says no in this case, as what I consider to be the important part (Before being ejected, fuel that starts in one place on the ship travels around it and ends up elsewhere, radially) does not exist. All caveats I expressed above still apply \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SomeGuy123","CreatedById":154263,"CreatedDateTime":"2016-01-03T17:46:59Z","Content":"\n\u003Cp\u003E\nIt would be easier to model if you made the pipes straight.  The thing is, when the fuel begins moving, there\u0027s now a difference in the total momentum of all the separate objects in the system.  Since both momentums must be conserved overall, the other pieces of the system have to counteract this so the sum equals zero.  This will happen without a rocket engine even on.  It may not rotate very fast, and it won\u0027t accelerate, just begin rotating to keep the angular momentum constant, but something will happen unless the pipes are made such there is no \u003Cem\u003Eangular \u003C/em\u003Emomentum change (but there is \u003Cem\u003Ea\u003C/em\u003E momentum change, it\u0027s just exclusive to the translational axes)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-03T17:47:36Z\u0022 title=\u002201/03/2016 05:47  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 3, 2016\u003C/time\u003E by SomeGuy123\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SomeGuy123","CreatedById":154263,"CreatedDateTime":"2016-01-03T18:03:15Z","Content":"\n\u003Cp\u003E\nLook, let me explain this in a way everyone can understand.  Let\u0027s again leave the rocket engine off for this.  Assume the whole rocket is floating in space, far from a planet, so no gravity and no air friction either.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore you turn on the fuel pump, assume the fuel lines are full of fuel, it just is not currently moving.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you turn on the fuel pump, assume the fuel reaches the flow rate instantly.\n\u003C/p\u003E\n\u003Cp\u003E\nSo now, in state 1, that mass, m, of fuel wasn\u0027t moving, and it state 2, it is.  You can subdivide the fuels into tiny segments, either using calculus or numerical integration, and each little fuel segment now mass m and velocity vector v.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ETotal \u003C/em\u003Emomentum is conserved.  So you cannot do this without the whole rocket responding.  What you have to do is figure out where each little segment is with respect to the center of mass of the rocket, and realize the rocket with respond with a velocity vector in the opposite direction but the magnitude is relative to the mass difference.\n\u003C/p\u003E\n\u003Cp\u003E\np = mv, momentum is conserved, so mass_fuel * velocity fuel = mass_rocket * velocity_rocket.\n\u003C/p\u003E\n\u003Cp\u003E\nAll those velocity_rocket vectors (there are either a few thousand if you use numerical integration or an infinite number with calculus but you can only do calculus if the problem fits the right conditions) sum to some larger vector that reflects what the rocket will do.\n\u003C/p\u003E\n\u003Cp\u003E\nMost \u0022stick a fuel pipe just anywhere and try this\u0022 examples you come up with, the rocket will respond with both angular and translational velocity components.  Only if the pipe is aligned with the center of mass of the rocket will it not begin to rotate at all.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, this would be straightforward to actually show if KSP were open source and well written.  Maybe there are other open source space games that are easy to modify to add this particular feature.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce you turn off the fuel pump, the rocket will cease moving.  You\u0027ve invented a poor man\u0027s gimbal system.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Luis","CreatedById":55075,"CreatedDateTime":"2016-01-05T07:59:39Z","Content":"\n\u003Cp\u003E\nThis is similar to the way that flywheels are used to control spacecraft attitude. You can rotate a craft in space simply by spnning a wheel inside the spacecraft and the laws of conservation of momentum are not violated. But the important thing to remember is that it\u0027s not the *movement* of fuel or the flywheels or anything else within the rocket that exerts a rotational force, it\u0027s the *acceleration* of the fuel or flywheels, because F=ma. So in the asparagus statging rocket, the fuel from the outer tanks exerts a torque on the rocket for as long as it takes to accelerate the fuel up to its steady flow speed in the pipe, and then the torque stops. This would create a small initial torque when the engines were first ignited (and the rocket is still on the launch pad) but none in normal flight.\n\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2016-01-05T17:03:24Z","Content":"\n\u003Cp\u003E\nOne argument I have not yet seen in this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nMoving the fuel from one tank to another has an influence on structure of the tanks, meaning the tanks change the direction they are facing.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen engines are mounted on the bottom of the tanks, the direction, they exhaust to, is changed. So unrelated to the question whether the fuel flow alone has an impact on the rotation of the rocket, the fuel-flow has indirectly an influence on the direction, the rocket is accellerating, meaning the shift of the engines could also cause the rocket to rotate.\n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2016-01-05T23:27:19Z","Content":"\n\u003Cp\u003E\nReminds me of the story in Feynman\u0027s first autobiography about the water jet sprinkler being pumped in reverse. His point there was that when in doubt about physics, you should do an experiment.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-05T23:28:00Z\u0022 title=\u002201/05/2016 11:28  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 5, 2016\u003C/time\u003E by mikegarrison\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"insert_name","CreatedById":150339,"CreatedDateTime":"2016-01-06T02:14:31Z","Content":"\n\u003Cp\u003E\nfrom what I understand, so long as the rocket is symmetrical radially it should not turn because the torque of the fuel on one side will be cancelled out by that on the other\n\u003C/p\u003E\n"},{"CreatedByName":"Archgeek","CreatedById":116048,"CreatedDateTime":"2016-01-08T21:06:12Z","Content":"\n\u003Cp\u003E\nI think this discussion has quietly revealed the real truth -- priming the lines induces a small torque, and most of us like to stage our clamps the moment we fire the main engines, or just sit the beast on its engine bells.  Now this will only introduce a small rotation, but the steady chant of \u0022momentum is conserved\u0022 has caused me to think of something -- the moment of inertia is changing, and very rapidly at first.\n\u003C/p\u003E\n\u003Cp\u003E\nThe priming of the lines puts a slight twist on the rocket, and then large amounts of mass are moved from the outside in, like the clasic ice skater pulling in their arms example (except then the mass just plain leaves, making the whole thing lighter).  As this happens, that little twist gets magnified very, very rapidly, and worsens a little bit more with each staging event as the moment of intertia keeps moving inwards (I wouldn\u0027t be surprised if the pump priming torque, if modeled, is repeated with each stage).  Ultimately, you get a ship that\u0027s very interested in spinning on its axis, beyond the level pod torque can counteract in severe examples.\n\u003C/p\u003E\n\u003Cp\u003E\nSee also Scott Manley\u0027s video of a craft with two fuel tanks moving around as fuel is pumped due to the system completely ignoring conservation of internal momentum.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-01-09T04:10:51Z","Content":"\n\u003Cp\u003E\nWeigh in... No pun intended...\n\u003C/p\u003E\n"}]}