{"TopicId":129053,"ForumId":44,"TopicTitle":"Who is more important mission controllers or Astronaut","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2016-01-01T19:23:47Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2016-01-01T19:23:47Z","Content":"\n\u003Cp\u003E\nI read interesting story about Apollo 7, apparently the astronauts not listened to controllers from houston and thus they not flown into space again  \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut the astronaut are more important than mission controllers, they are in space alone and controllers are far far away, and in future mission to Mars independent thinking would be even more important given the fact that lag in communication would be 10-15 minutes.   \n\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2016-01-01T20:29:19Z","Content":"\n\u003Cp\u003E\nThat was on Skylab I think.  They turned off the comms for a day and took a forced rest.  The story goes something like this, they were all rookies on their first flight.  They had every minute scheduled for them with no down time so that it was 80 something days of 16 hours work and 8 hours sleep.  Thing where scheduled so that they would eat and then have to exercise right after that.  They were not given the flexibility to move things around.  One astronaut got sick when he got into space and the schedule started to fall behind right from the get go.  The more experienced astronauts advised NASA that the schedule was unrealistic before the launch but NASA didn\u0027t listen.  The more experienced astronauts where able to keep up with a schedule like that before. (But not for that long, the 85 days I think it was, was a new record at the time.)  Basically the astronauts were treated like equipment and not people.  Finally they had their one day strike and after that NASA listened to them.  However NASA was not impressed and they were considered complainers and never flew again.   However NASA hasn\u0027t scheduled a mission like that, with every minute scheduled and no room for astronaut input, since then.\n\u003C/p\u003E\n\u003Cp\u003E\nIn regards to a mission to Mars this is not an issue.  Not just because NASA learned their lesson but because the flight would be very boring.  NASA\u0027s problem would be keeping the astronauts engaged, and other issues not fully understood yet.\n\u003C/p\u003E\n\u003Cp\u003E\nTo answer the question in the title, neither, if you loose either the mission is over.\n\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2016-01-01T21:02:12Z","Content":"\n\u003Cp\u003E\nThere was an issue with Apollo 7 as well. The crew had come down with colds, and after spending most of the mission arguing with Mission Control decided they would perform reentry without their helmets on. The helmets were a one piece \u0022fishbowl\u0022 design without a retractable visor, and the crew was concerned their congestion would cause their eardrums to rupture if they could not periodically blow their noses as the pressure changed. But the helmets had been designed as part of the restraint system, and controllers were worried they might suffer head or neck injuries. Ultimately the crew refused to put them on, and the two rookie astronauts never flew in space again. The commander, Wally Schirra, had already announced his retirement. \n\u003C/p\u003E\n\u003Cp\u003E\nOn the one hand, being weightless with a head cold for two weeks (and no bathroom) would be enough to ruin any one\u0027s mood. On the other hand, Apollo 7 was the first manned mission following the Apollo 1 fire, and there was a tremendous amount of pressure on Mission Control to make sure everything went perfectly. There was wrong on both sides.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-01T21:07:16Z\u0022 title=\u002201/01/2016 09:07  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 1, 2016\u003C/time\u003E by Ten Key\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-01-01T21:19:56Z","Content":"\n\u003Cp\u003E\nThere were a couple of \u0022mutinies\u0022 in the NASA space program. In all cases, the astronauts never flew again.\n\u003C/p\u003E\n"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2016-01-01T21:28:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222344915\u0022 data-ipsquote-contentid=\u0022129053\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451676227\u0022 data-ipsquote-userid=\u002235539\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Pawelk198604 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI read interesting story about Apollo 7, apparently the astronauts not listened to controllers from houston and thus they not flown into space again  \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut the astronaut are more important than mission controllers, they are in space alone and controllers are far far away, and in future mission to Mars independent thinking would be even more important given the fact that lag in communication would be 10-15 minutes.   \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m pretty sure that if any of them are down, the whole mission is over. There\u0027s no most important, they are both essential\n\u003C/p\u003E\n"},{"CreatedByName":"saabstory88","CreatedById":110598,"CreatedDateTime":"2016-01-01T21:32:16Z","Content":"\n\u003Cp\u003E\nTell that to the Russians and their pre-programmed automated spacecraft. \n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-01-01T22:24:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222345082\u0022 data-ipsquote-contentid=\u0022129053\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451683936\u0022 data-ipsquote-userid=\u0022110598\u0022 data-ipsquote-username=\u0022saabstory88\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, saabstory88 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTell that to the Russians and their pre-programmed automated spacecraft. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGordon Cooper and the crew of Apollo 13 would strongly disagree with this. When fecal matter hits the rotary device, your best bet is an experienced, fast-thinking, cool-headed guy able to take control and do something about the situation.\n\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2016-01-02T00:00:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222345141\u0022 data-ipsquote-contentid=\u0022129053\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451687063\u0022 data-ipsquote-userid=\u002257622\u0022 data-ipsquote-username=\u0022Scotius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Scotius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen fecal matter hits the rotary device, \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDid you mean: When s*** hits the fan?\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-01-02T00:16:00Z","Content":"\n\u003Cp\u003E\nSSSHhhhhhhHHHHHHssHHHHHHHH!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://cdn.meme.am/instances/55670552.jpg\u0022 alt=\u002255670552.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2016-01-02T00:51:20Z","Content":"\n\u003Cp\u003E\nI think that this is a bit like asking which is more important in an engine, a spark plug or a piston? Without either, the engine can\u0027t function. You need both for the whole thing to work (unless it\u0027s a diesel engine). And astronaut can make quick decisions that Mission Control might not have time to give input on. Mission Control can see the big picture and give the astronauts options that they couldn\u0027t have seen otherwise. Both are necessary on a manned mission. Without one, the other has can\u0027t function.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, the decision will ultimately come down to the astronauts whether Mission Control likes what they decide or not. What\u0027s Mission Control going to do? They\u0027re in space. Until they\u0027re on the ground, they\u0027re on their own.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-02T00:51:32Z\u0022 title=\u002201/02/2016 12:51  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 2, 2016\u003C/time\u003E by Vaporo\u003C/strong\u003E\n\u003C/span\u003E\n"}]}