{"TopicId":129254,"ForumId":44,"TopicTitle":"More accurately determining the size of [stars and] exoplanets","CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-01-04T21:24:41Z","PageNum":1,"Articles":[{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-01-04T21:24:41Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.bbc.com/news/science-environment-35205810\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.bbc.com/news/science-environment-35205810\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe article is pretty self-descriptive, though I am not convinced about the certainty of what they say. How in fact do they know that they are right, its not like you can go to a star 10000 ly away and measure the mass of a star.\n\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2016-01-04T22:36:55Z","Content":"\n\u003Cp\u003E\nThis article is useless, telling us nearly nothing. Are there any others?\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-01-05T05:10:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222348544\u0022 data-ipsquote-contentid=\u0022129254\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451942681\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow in fact do they know that they are right, its not like you can go to a star 10000 ly away and measure the mass of a star.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI haven\u0027t looked at the original article, but I can think of at least two ways. First, there is a pretty good pool of stars with precisely known masses. There are close binaries, where we can measure semi-major axis and period rather precisely, and there are some systems with enough exoplanet data to get a fine estimate on star\u0027s mass. These can be used to calibrate the model, but I don\u0027t know if there are enough such stars to get a good enough sigma on it.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond method is purely statistical. We have a set of estimates of stellar masses from their brightness. The variance is high, but the data set is huge. We also have measurements of periodical variations in brightness. This is a direct measurement, which is far, far more precise than our estimate of the masses. We now have a parametrized model that links the later to the former. Simple Bayesian analysis of our mass estimates with some large σ and the model gives us an estimate on model\u0027s parameters. Here is the kicker. Because the data set is huge, so long as the model is working, the variance on parameters is going to be far, far smaller. And for large data set, goes to a quantity related to the variance of indirect data. Plug that back into the model, and you get a new estimate for stars\u0027 brightness, which is far tighter than original σ. This gives you the new error bars.\n\u003C/p\u003E\n\u003Cp\u003E\nIf these guys did their homework, they have done both. Probably the statistical analysis first, since it gives better control of the errors, and then tests against known stars for better confidence.\n\u003C/p\u003E\n"}]}