{"TopicId":129471,"ForumId":44,"TopicTitle":"Intergalactic space","CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2016-01-07T17:18:38Z","PageNum":1,"Articles":[{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2016-01-07T17:18:38Z","Content":"\n\u003Cp\u003E\nWe\u0027re all aware that in space, everything is relative and you\u0027re always orbiting something. Things are naturally more complicated in reality than in KSP, with things such as Lagrangian points and decaying orbits. No matter where you go, some force is acting on you.\n\u003C/p\u003E\n\u003Cp\u003E\nFor reasons I cannot explain, I was thinking of \u003Cem\u003EHomeworld.\u003C/em\u003E While it does suffer from the common trope of space being three-dimensional water, it also made me ponder if it would in fact be possible to travel to a point so far out in Intergalactic space that the forces acting upon a vessel or station would be so minute as to be effectively stationary. I\u0027m aware than in the conventional sense this is impossible, since no matter how far one might go, there would still be force acting upon the ship/station changing it\u0027s relative position to Earth (or wherever one might be traveling from). Even at FTL travel so much time would pass that the ship or station would have moved a significant amount. But, let us assume drive technology such as in \u003Cem\u003EHomeworld\u003C/em\u003E is possible. Rather than FTL speeds, we develop engines capable of \u0022jumping\u0022 almost instantly from point-to-point through a sort of wormhole. With such a technology, the time scales of FTL speed would become irrelevant, bringing it down into an incredibly small scale we think of as a \u0022lifetime\u0022. Assuming all of this (and ignoring the likely impossibility of the tech), would it not be possible to have a construct that is stationary to our perception (within our minute scale of time) and relative to say, the galactic core, at some distance into intergalactic space?\n\u003C/p\u003E\n\u003Cp\u003E\nI realize that with the associated technology here, a stationary object would not even be necessary, I\u0027m just thinking of things like the stationary sort of deployment in the game itself.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-01-07T22:05:00Z","Content":"\n\u003Cp\u003E\nOn these scales, you have to drop Newtonian gravity and talk about General Relativity, which is a bit difficult without getting into jargon and mathematics of it, but I\u0027ll try.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the first thing to understand is that in GR there is no such thing as a force of gravity. It\u0027s like centrifugal force. It shows up as a force in a chosen reference frame because the frame of reference is accelerating. Thus it is called a fictitious or inertial force. If you aren\u0027t familiar with the concept, I strongly urge you to read the Wikipedia article on Centrifugal Force. It\u0027s one of the simplest fictitious forces, and one we are all familiar with, so it\u0027s very easy to get intuitive feel for it. Long story short, gravity in GR is also a fictitious force. So long as an object is in free fall, there is no net force acting on that object, according to GR.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich is where we get to the question of relative accelerations and relative velocities. When relativity is discussed, you\u0027ve probably heard people talking about velocities being relative. That there is no such thing as absolute frame of reference for velocity. An object stationary according to one observer is moving according to another, and neither is wrong. Well, things get a lot worse in GR. \u003Cem\u003ERelative\u003C/em\u003E velocity between two objects isn\u0027t really a solid concept anymore either. Rotation is a good example, again. Put two objects on a turntable. According to an observer standing on that same table, two objects are at rest, and so their relative velocity is always zero. An inertial observer standing nearby will watch two objects turn around each other, so their relative velocity is constantly changing. I.e, there is no way to select an inertial observer so that relative velocity is always the same as that for rotating observer.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, in Newtonian physics, the rotation example isn\u0027t a problem. You can always choose a global reference frame that\u0027s inertial everywhere. Not so in GR, because of space-time curvature. You can always pick a frame of reference that is \u003Cem\u003Elocally\u003C/em\u003E inertial, but if you try to extend that frame of reference, you quickly find that it\u0027s not inertial everywhere else. So there is no such thing as a \u0022non rotating\u0022 frame of reference.\n\u003C/p\u003E\n\u003Cp\u003E\nLacking such universal frame of reference, any frame of reference is as good as any other. I can take any collection of the objects buzzing through the universe, some of which in free fall, others accelerating, and simply declare that each one of them is stationary, regardless of any forces acting on them. I can them build a coordinate system in which this is true.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the question of two objects being stationary with respect to each other looses all meaning on intergalactic scale. You can always choose a frame of reference where it\u0027s true, and you can always choose a frame of reference where it\u0027s not.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-01-07T23:06:09Z","Content":"\n\u003Cp\u003E\nI\u0027m pretty sure that\u0027s possible, since other objects that are quite large appear stationary, but we know they\u0027re moving. Heck, even stars in the night sky appear stationary in a lifetime, for the most part, at least. \n\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-01-08T00:40:36Z","Content":"\n\u003Cp\u003E\nSure!\n\u003C/p\u003E\n\u003Cp\u003E\nBut don\u0027t forget about the Kraken.\n\u003C/p\u003E\n\u003Cp\u003E\nIn other words, measuring precision at huge distances is limited in real life just as it is in video games. While your station won\u0027t spontaneously break apart, it has no way of telling whether it\u0027s 100 million light-years from the galactic core or 100 million light years and 1 kilometer from the core. In fact it\u0027d be hard to tell even within several light-years.\u003Cbr\u003E\nThus you could send a ship on a deep-space voyage, and expect that on the grand scale the station will stay put. But when you try to return, even if it hasn\u0027t moved very far on the grand scale, it might have imperceptibly drifted many light-years away from where you left it. Likewise its velocity could be hundreds of kilometers per second without any noticeable change in its trajectory (or the red-shifting of distant stars), so when you come back, your \u0022stationary\u0022 station might well be zipping through space absurdly fast relative to you.\u003Cbr\u003E\nOver millions of years, such differences in position and velocity would of course become obvious, but on a human timescale they\u0027re unavoidable.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s just like how rendezvousing with a ship in Kerbolar orbit is surprisingly difficult, or how it was so hard to get New Horizons close to Pluto (and why they felt a need to include a whole day\u0027s worth of wiggle room for the arrival time).\n\u003C/p\u003E\n"}]}