{"TopicId":130560,"ForumId":44,"TopicTitle":"Question about Momentum and Orbit","CreatedByName":"Fez","CreatedById":157292,"CreatedDateTime":"2016-01-23T20:15:47Z","PageNum":1,"Articles":[{"CreatedByName":"Fez","CreatedById":157292,"CreatedDateTime":"2016-01-23T20:15:47Z","Content":"\n\u003Cp\u003E\nSo I know that the reason an orbit works is that while gravity is pulling on the spacecraft downwards, the ship\u0027s momentum pushes it out from the planet, so there\u0027s a constant tug-of-war.  I also know that the equation for momentum is mass * velocity.  Now, if you increase a ship\u0027s velocity, the momentum increases, and you can increase in altitude.  But here\u0027s the problem: the vis-viva equation (V=√GM(2/r-1/a)) for orbital velocity doesn\u0027t take into account the spacecraft\u0027s mass.  Say there\u0027s two spacecraft in circular orbit around Kerbin at 100 Km above the surface.  One is 90 tons, and the other is 200 tons.  Wouldn\u0027t the 200 ton spacecraft orbit at a lower velocity than the 90 ton one, because then their momentums are equal? Thank you in advance.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-01-23T20:21:23Z","Content":"\n\u003Cp\u003E\nTheir momentums are not equal, the heavier craft will have more momentum due to greater mass at the same speed.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reason vis-viva ignores ship mass is because the force of gravity is proportional to mass, it cancels out.\n\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2016-01-23T20:23:29Z","Content":"\n\u003Cp\u003E\nBecause when you actually work out the maths, the mass of the orbiting body gets cancelled (except if it is significant compared to the orbited body).\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not really momentum that makes you orbit, it\u0027s just the motion that is affected by gravity. It\u0027s the same kind of thing that make a 1kg thing fall as fast as a 1t object.\n\u003C/p\u003E\n\u003Cp\u003E\nIf vessel 2 is twice as heavy as vessel 1, then gravity will be 2x stronger than on vessel 1. But on the other hand, it will require twice as much force to get the same acceleration. In the end, as orbit are made possible by acceleration, the two cancel out each other and the two ships behave the same.\n\u003C/p\u003E\n"},{"CreatedByName":"Fez","CreatedById":157292,"CreatedDateTime":"2016-01-23T22:52:16Z","Content":"\n\u003Cp\u003E\nBut then what exactly is the force that cancels out gravity if it\u0027s not momentum?, that part i dont understand.  What keeps it from falling back?\n\u003C/p\u003E\n\u003Cp\u003E\nThis website says momentum is the reason it keeps from falling back, because the ship wants to travel out and away in a straight line.  At least to me, that makes sense, but it might not be the actual reason i guess. \u003Ca href=\u0022http://www.schoolsobservatory.org.uk/astro/esm/orbit\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.schoolsobservatory.org.uk/astro/esm/orbit\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-23T22:59:37Z\u0022 title=\u002201/23/2016 10:59  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 23, 2016\u003C/time\u003E by Fez\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-01-23T23:09:55Z","Content":"\n\u003Cp\u003E\nRight. So momentum is increasing with the mass of the ship, linearly. Double the mass of the ship and you double the momentum. The force of gravity is increasing with the mass of the ship, linearly. Double the mass of the ship and you double the force of gravity. These two factors cancel each other out, so that all that matters is speed.\n\u003C/p\u003E\n\u003Cp\u003E\nGravity\u0027s force isn\u0027t cancelled out, it\u0027s that force that curves the vessel\u0027s trajectory around the parent body. Gravity is constantly applying an acceleration to the vessel, though the direction of that force changes. Image worth a thousand words:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Kepler-second-law.gif\u0022 class=\u0022ipsImage\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/6/69/Kepler-second-law.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe green line represents the orbiting object\u0027s speed (and thus momentum as well). The center purple line represents the acceleration from gravity, with the two other purple lines being the perpendicular components of that force (one changing direction, the other changing speed). Edit: In a circular orbit, there would be no speed change, the force would always be perpendicular to the direction of travel and thus only change direction.\n\u003C/p\u003E\n"},{"CreatedByName":"Fez","CreatedById":157292,"CreatedDateTime":"2016-01-23T23:12:52Z","Content":"\n\u003Cp\u003E\nSo then the force of momentum is the force that keeps it from falling back? That\u0027s what i get from the image. Hope I\u0027m not being dense \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-01-23T23:18:56Z","Content":"\n\u003Cp\u003E\nMomentum isn\u0027t a force, but it is what keeps it from falling back. The acceleration from gravity can only bend the path so quickly, so if sufficient horizontal speed exists the direction of gravity changes faster than the ship can fall back down. Another useful image (visualizing Newton\u0027s classic cannon on top of a mountain thought experiment):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022https://tap.iop.org/fields/gravity/403/img_full_46835.gif\u0022 alt=\u0022img_full_46835.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe black lines are trajectories without enough speed to make gravity change direction quickly enough, they have insufficient momentum to stay in orbit. The blue line is an object going fast enough so that its trajectory bends at exactly the same rate that gravity\u0027s direction changes, so it stays up.\n\u003C/p\u003E\n"},{"CreatedByName":"Fez","CreatedById":157292,"CreatedDateTime":"2016-01-23T23:28:48Z","Content":"\n\u003Cp\u003E\nThank you for your help, I always wondered thought momentum is what kept it up, just wasn\u0027t sure\n\u003C/p\u003E\n"}]}