{"TopicId":140965,"ForumId":44,"TopicTitle":"Fermi Paradox","CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T18:23:36Z","PageNum":1,"Articles":[{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T18:23:36Z","Content":"\n\u003Cp\u003E\nSo doing alot of reading about space-time lately and ran across this very appropriate quote yesterday.\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/140626-how-do-quantum-possibilities-resolve/\u0026amp;do=embed\u0026amp;embedComment=2610067\u0026amp;embedDo=findComment#comment-2610067\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.householdgigs.com/2016/05/05/fermi-paradox/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.householdgigs.com/2016/05/05/fermi-paradox/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo the above is just coincidentally in my reddit stream this AM and I was reading down the list wondering why it was new science and I am reminded of the Ravolli quote, and I though if this is not an example of guessing then I don\u0027t know what is. How would I solve the problem. Before I got a few paragraphs down I realized that it was a dirty laundry list of guesses, many of them rather uninformed.\n\u003C/p\u003E\n\u003Cp\u003E\nSo here is it, we have 1 example of sentient life. And we have been looking all over the cosmos and not seeing any other examples of life, and have not even found examples comparable to earth after studying 2400 exoplanets. So we have a data set of 1 and a possibility of less than 1:2400 or more. So lets look and see what the density might be.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if life on planets is X below the probability of observing 1 in 2400 is y (remembering that our observation of ourselves has an acute observers bias)\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is there are no statistical tests that allow this. While most qualitative testing does not allow me to do this (to do it accurately I really need a \u0026gt;\u0026gt;32 bit computer), I can trick the fisher exact test into doing it by setting ratios like the actual is say billion over a million is roughly equal to 1000:1 odds.\n\u003C/p\u003E\n\u003Cp\u003E\nSo lets see were this takes us. lets start by saying there are for every 1000 planets we have 999 with sentient life and 1 without. and we will step this ratio down by 10 each time.\n\u003C/p\u003E\n\u003Cp\u003E\nSL:Not\u003Cbr\u003E\n999 :1 P = 0 to the calculation limit of a 32 bit computer.\u003Cbr\u003E\n99:1 P = 0 \u0022 \u0022\u003Cbr\u003E\n9:1 P = 0\u003Cbr\u003E\n1:1 P = 0\u003Cbr\u003E\n1:9 P \u0026lt; 1E-107\u003Cbr\u003E\n1:99 P \u0026lt; 1E-9\u003Cbr\u003E\u003Cstrong\u003E1:999 P \u0026lt; 0.4\u003Cbr\u003E\n1:9999 P \u0026lt; 0.3\u003C/strong\u003E\u003Cbr\u003E\n1:99999 P \u0026lt; 1E-3\u003Cbr\u003E\n1:999999 P \u0026lt; 1E-5 Note: the estimates below are not really accurate because they test the computational limits of the computer, I could reduce these, but  . . . . . .\u003Cbr\u003E\n1:9999999 P \u0026lt; 1E-7\u003Cbr\u003E\n1:9999999 P \u0026lt; 1E-9\u003Cbr\u003E\n1:9999999 P \u0026lt; 1E-11\n\u003C/p\u003E\n\u003Cp\u003E\nAs we can see the probabilities drop more slowly into the microscopic ranges on the low estimates relative to the high estimates of extraterrestrial life. What this means that if we have to entertaine a broad confidence interval, its going to stretch more quickly into the very low estimates of sentiency. Do we have to entertain such estimates? A historical analysis of the science suggests yes,the curve has been shifting down. First we examined ourselves and concluded it was 100%, then we discovered our 9 planets and it dropped to 1:9, then 100s of planets, now thousands of planets and the probability is falling each time, the reason it is falling is because of our bias.\n\u003C/p\u003E\n\u003Cp\u003E\nWhere does observers bias come from and what is it?\u003Cbr\u003E\nOur observations suffer from both observation and confirmation bias. The problem is only living sentients can be/create the observers can count sentient life, and there always has to be 1 observer an any observation of sentient life. In very crude sampling (such as 2400 planets out of galaxy that has a trillion planets), very low estimates can never exist because there would be no observer to observe a region that is devoid of life or sentient life. So lets say our observation limit is 100,000 light years, and the field of view has a 10,000,000 stars with transects and we pick up 3 planets with stars. If we do not see signs of life in 1:30,000,000 planets can never allow a statistic say 1000 times lower, even if that is the life\u0027s (or sentient life\u0027s) rate in the entire galaxy\n\u003C/p\u003E\n\u003Cp\u003E\nSo the base assumption of science is that a potential something is nothing until something. We can flip that to the opposite if we observe a strict pattern, such as all flying birds have wings, if want to test a new set of flying birds then the null hypothesis is that they should have wings. Having one earth and no observations of planets, we assume that all planets should have life. Moving to the next higher level of observation, having studied the moon and many planets, we have yet to observe life elsewhere (though predict that one or two have life). In observing the planets and all the moons of our solar system we do not see evidence of sentient life. The mistakes that are made here in the argument is that we assume the current knowledge suffices to create the appropriate argument, and the revelation of new technique reveals that it is not. Its historic ignorance, the question is whether we are above historic ignorance on not in our answers.\u003Cbr\u003E\u003Cbr\u003E\nFrom this perspective we should argue that the naive state of a planet is not to have life or sentient life, that is our null hypothesis that needs to be disproven. Some may argue the point but if they do we then have all kinds of subjective qualifiers. Do we count moons, do we count large asteroids, what should be counted in the assessment of life. So lets say we only count planets that have atmospheres. How many planets have we observed that have atmospheres,  . . .very few. What is the probability that life exists outside of earth, in this argument we can exclude earth, lets say we believe to be transplanted here by beings from another galaxy, an omniscient creature about intergalactic sentients and we know we are the only species in this galaxy from the next galaxy, we ask the question how many planets have evolved life in this galaxy.\n\u003C/p\u003E\n\u003Cp\u003E\nTo improve information of the low estimate statistics, there is another statistical method which is to remove 1 and then re-analyze, this is often done with data presents with a few outliers. Lets suppose we remove the earth from the analysis, because the observer creates the bias, what happens. Assuming no evidence of life or sentient life on 2400 worlds how can we estimate?\n\u003C/p\u003E\n\u003Cp\u003E\n1:9 P \u0026lt; 1E-109\u003Cbr\u003E\n1:99 P \u0026lt; 1E-10\u003Cbr\u003E\n1:999 P \u0026lt; 0.2\u003Cbr\u003E\n1:9999 P \u0026lt; 1.00\u003Cbr\u003E\n1:99999 P \u0026lt; 1.00\u003Cbr\u003E\nsince now earth is one of 2400, the lost estimates can of very rare life can never go below 1:2400 (0.0042) which means that our probability slow on the low estimate side and essentially stops at 0.0042 This is because although the probability is high at the low end, of the 2400 observations we have a 1:2400 chance of removing the one earth, removing any of the other planets does not matter much, they are pretty much the same statistic.\n\u003C/p\u003E\n\u003Cp\u003E\nSo this then gets into a qualitative sphere, how far could we observe life on other worlds if we could observer sentient life on other planets. Or to ask the basic question, do some of the observed planets have life and we simply cannot observe it, do some have sentient life and we are missing it? If another world has life did it evolve or did it commute? Asking these questions we can then ask how biased is the observations? Planet hunters are looking for earth like planets, not at all planets, what about moons around gas giants, don\u0027t they qualify, should not the total number of planets be more? And we cannot see all planets, only those that transect our Earth - star sight, many go unobserved. There is a size bias to the observation, certain stars cannot be observed because of solar flares during the observation window, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat have I done, I have improvised a confidence range containing 99.7 percent of estimate where there was none it runs from about 1:20 satellites (1:300 for sentients) to 1:1E23 for the observable universe. The number is sufficiently small to not require adjustment for the entire universe. There is some hideousness to the argument, because space-time obviates any considerations beyond about 2 billion light years. And in fact the observations constraint is limited to a pool about 1000 galaxies in our vicinity.\n\u003C/p\u003E\n\u003Cp\u003E\nThis statistical observation therefore epitomizes the problem that the data used to describe the Fermi paradox is a guess, it has a huge confidence range that is created by an observation bias and no other positive observations. The argument exists but the quantification does not. Some here might argue, why have such a wide and useless confidence range. A nice reason is that the Fermi paradox has bred a plethora of guesses that have each a very low probability of being correct. The confidence range therefore contains data for all of them and does not interfere greatly with the likelihood that any given one is wrong or right.\n\u003C/p\u003E\n\u003Cp\u003E\nSo for example how could you know if there are species wiping out upstart civilizations if, in fact, that sentients are so rare, such species would only have a space-time SOI of a few 100 million light years and you are outside of that range, they might exist, but you could never detect them. The correct answer to the Fermi paradox is that \u003Cem\u003Eit \u003C/em\u003E(the argument)\u003Cem\u003E exists\u003C/em\u003E. This may seem like a denigration of the paradox, its not meant to be, its meant to be a denigration of the solutions. Whenever we have an object where it can be inserted into an \u0027it exists\u0027 class, but the supporting data is minimal, we have to be wary of the answers/solutions. Who told us this? About 1000 years of theological philosophy went unresolved until Occam\u0027s razor. The simplest answer here is that life is rare and sentient life is even rarer, but we do not know what degree or why because our sampling is too poor. The sampling maybe poor because there is roughly nothing to sample......only statistics, however poor, are permissible at this point, nothing else has relevance.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2016-06-01T18:50:48Z","Content":"\n\u003Cp\u003E\nFrom what I understand, what you are saying is that \u002242\u0022 is as good an answer as any.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T19:05:18Z","Content":"\n\u003Cp\u003E\nWe have yet to build the machjnce capable of giving \u002242\u0022 as the answer. \n\u003C/p\u003E\n"},{"CreatedByName":"Basto","CreatedById":158312,"CreatedDateTime":"2016-06-01T19:08:06Z","Content":"\n\u003Cp\u003E\nTLDR...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut... \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://blogs.scientificamerican.com/guest-blog/the-fermi-paradox-is-not-fermi-s-and-it-is-not-a-paradox/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://blogs.scientificamerican.com/guest-blog/the-fermi-paradox-is-not-fermi-s-and-it-is-not-a-paradox/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2016-06-01T19:22:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222611664\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464805416\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n59 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n..we have been looking all over the cosmos and not seeing any other examples of life\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis isn\u0027t true.  Scientist now believe there are 300 billion stars in the Milky way.  My higher naivete tells me there are 400-700 billion. We have examined a few thousand stars for a few minutes at a time with telescopes that would have a difficult time finding a multi megawatt, non directional radio signal.  World wide, you could count on two hands the people who are looking for these signals.  It\u0027s tantamount to taking an 8 ounce glass of water from the ocean in a search for whales, and concluding that since there is no whale in your sample, that the ocean has no whales.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no paradox.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-01T19:24:51Z\u0022 title=\u002206/01/2016 07:24  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 1, 2016\u003C/time\u003E by Aethon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"benzman","CreatedById":82512,"CreatedDateTime":"2016-06-01T19:28:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222611693\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464807048\u0022 data-ipsquote-userid=\u002299185\u0022 data-ipsquote-username=\u0022justidutch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, justidutch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFrom what I understand, what you are saying is that \u002242\u0022 is as good an answer as any.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDouglas Adams may well have been more right than he knew!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://seedmagazine.com/content/article/prime_numbers_get_hitched/?utm_source=seedmag-main=rss\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://seedmagazine.com/content/article/prime_numbers_get_hitched/?utm_source=seedmag-main=rss\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T19:31:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222611752\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464808962\u0022 data-ipsquote-userid=\u0022110755\u0022 data-ipsquote-username=\u0022Aethon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Aethon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis isn\u0027t true.  Scientist now believe there are 300 billion stars in the Milky way.  My higher naivete tells me there are 400-700 billion. We have examined a few thousand stars for a few minutes at a time with telescopes that would have a difficult time finding a multi megawatt, non directional radio signal.  World wide, you could count on two hands the people who are looking for these signals.  It\u0027s tantamount to taking an 8 ounce glass of water from the ocean in a search for whales, and concluding that since there is no whale in your sample, that the ocean has no whales.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no paradox.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDid you read what I applied to the confidence range? read again you will find it. \n\u003C/p\u003E\n\u003Cp\u003E\nBut to be technically accurate the paradox begs the question why have we not yet experienced extraterrestrials, either remotely or locally, since there would likely be older worlds, my answer is if you read that the sampling is poor, and the confidence range is broad enough to include all possibilities. The qustion is not silly, only the answers are silly. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-01T19:39:26Z\u0022 title=\u002206/01/2016 07:39  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 1, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2016-06-01T19:52:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222611752\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464808962\u0022 data-ipsquote-userid=\u0022110755\u0022 data-ipsquote-username=\u0022Aethon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, Aethon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis isn\u0027t true.  Scientist now believe there are 300 billion stars in the Milky way.  My higher naivete tells me there are 400-700 billion. We have examined a few thousand stars for a few minutes at a time with telescopes that would have a difficult time finding a multi megawatt, non directional radio signal.  World wide, you could count on two hands the people who are looking for these signals.  It\u0027s tantamount to taking an 8 ounce glass of water from the ocean in a search for whales, and concluding that since there is no whale in your sample, that the ocean has no whales.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no paradox.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nToo right mate. The way we \u0027look\u0027 at these planets tells us next to nothing about them. There is no paradox at all, just a vast, vast universe and no way currently to know what the hell is out there.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T20:11:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222611796\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464810755\u0022 data-ipsquote-userid=\u002261954\u0022 data-ipsquote-username=\u0022Majorjim\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Majorjim said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nToo right mate. The way we \u0027look\u0027 at these planets tells us next to nothing about them. There is no paradox at all, just a vast, vast universe and no way currently to know what the hell is out there.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe way we look at them tells us that they are kargely dead worlds, but having said that alot of living world potentials are over looked. I apply the scientest should stop guessing rule howver, If you have to increase the pCO2 to 4.5 atmospheres to get your world to work, chances are it doesn\u0027t and you should stop guessing. \n\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2016-06-01T20:29:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222611831\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464811881\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe way we look at them tells us that they are kargely dead worlds\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot really. We see a graph showing a dip in starlight. Yes we can guess the distance and mass but even if we find 1000 worlds within what we believe to be the habitable zone we still know zero about the surface.\n\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2016-06-01T20:33:25Z","Content":"\n\u003Cp\u003E\nI read it.  I wish we could stop calling it a paradox.  It is more formally known as the Hart Tipler conjecture.\n\u003C/p\u003E\n\u003Cp\u003E\nAn Explanation for the Absence of Extraterrestrials on Earth.  Michael H. Hart\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://adsabs.harvard.edu/full/1975QJRAS..16..128H\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://adsabs.harvard.edu/full/1975QJRAS..16..128H\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nExtraterrestrial Intelligent Beings Do Not Exist.  Frank J. Tipler\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://adsabs.harvard.edu/full/1980QJRAS..21..267T\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://adsabs.harvard.edu/full/1980QJRAS..21..267T\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T20:46:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222611866\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464813205\u0022 data-ipsquote-userid=\u0022110755\u0022 data-ipsquote-username=\u0022Aethon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Aethon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI read it.  I wish we could stop calling it a paradox.  It is more formally known as the Hart Tipler conjecture.\n\u003C/p\u003E\n\u003Cp\u003E\nAn Explanation for the Absence of Extraterrestrials on Earth.  Michael H. Hart\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://adsabs.harvard.edu/full/1975QJRAS..16..128H\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://adsabs.harvard.edu/full/1975QJRAS..16..128H\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nExtraterrestrial Intelligent Beings Do Not Exist.  Frank J. Tipler\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://adsabs.harvard.edu/full/1980QJRAS..21..267T\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://adsabs.harvard.edu/full/1980QJRAS..21..267T\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSayings extraterrestrials do not exist is a leading argument, saying they don\u0027t is also leading. \n\u003C/p\u003E\n\u003Cp\u003E\nIf we don\u0027t get to stuck in superfluous details. Paradoxes always exist until you have an answers. As i pointed out to have visitors you must have life on other worlds, that\u0027s a logical requirement. Since we can\u0027t even detect life, let alone space traveling capable life, it means the visitors paradox remains valid, it just defers to the next level. \n\u003C/p\u003E\n\u003Cp\u003E\nWhy is there so much observed life in Earth and little or no observed life elsewhere. The Fermi paradox quietens, but the underlying paradox broadens as more world examples flow in, and no examples of living worlds flow forth. \n\u003C/p\u003E\n\u003Cp\u003E\nThe problem with the \u0022Fermi paradox\u0022 is that its is impossible to condition the argument, to many guesses. For the \u003Cem\u003Ewhy no other living worlds argument\u003C/em\u003E you can, at least, craft a confidence range, if Mars comes up positive then the range shrinks. \n\u003C/p\u003E\n\u003Cp\u003E\nBut as it stands at the moment the range is huge. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-01T21:46:23Z\u0022 title=\u002206/01/2016 09:46  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 1, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2016-06-01T20:52:29Z","Content":"\n\u003Cp\u003E\nI would love to discuss this.  It\u0027s my favorite subject in science and perhaps the most profound question in human history, but what I assume is your phone foo typing makes it difficult for me to follow your argument.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-01T20:53:25Z\u0022 title=\u002206/01/2016 08:53  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 1, 2016\u003C/time\u003E by Aethon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T21:43:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222611901\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464814349\u0022 data-ipsquote-userid=\u0022110755\u0022 data-ipsquote-username=\u0022Aethon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n54 minutes ago, Aethon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI would love to discuss this.  It\u0027s my favorite subject in science and perhaps the most profound question in human history, but what I assume is your phone foo typing makes it difficult for me to follow your argument.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s unfortunately the problem of typing on an IPAD, the fingertip recognition is awful. It also has a problem saving edits, and sometimes spontaneously submits posts.\n\u003C/p\u003E\n\u003Cp\u003E\nTo get rid of both outlyers if Mars life-exists results in a probability of selecting both, either first or second at the 2 * 1/2400 * 1/2400 which then creates a probability of P\u0026lt;1E-6, this assumes that the sun itself is not an outlyer star. We can argue that the near infinitely low rate of life would never exceed a probability of 1E-5. This pushes the chance closer to 1 in 2400.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think the question is that profound, because saying its profound leads the argument with data that simply does not exist. Should we look for life, certainly.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to one other point, when SETI was up and running many people participated, including myself, I had 2 T1 connected PCs that ran almost continually after hours SETI, a massive amount of PC power was applied for the search of ET signals, none were found. We may not have searched enough, but I would argue that unless the technology increases by 10s of magnitudes in both detection capability and resolution, the claim we just stopped trying is invalid, we stopped because there was, after years of trying no evidence of success.\n\u003C/p\u003E\n\u003Cp\u003E\nMy point is simple and irrefutable, with a complete dearth of information about alien sentients, speculating on why we never see aliens is fluffy speculative guessy science at best. I doubt my lower limit rate estimates are correct, but by the same token everyone higher limits are probably not correct. Them being wrong does not make me right, it makes the argument useless.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-01T22:00:39Z\u0022 title=\u002206/01/2016 10:00  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 1, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2016-06-01T23:18:35Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure I\u0027m following you.\n\u003C/p\u003E\n\u003Cp\u003E\nWe have a complete dearth of information on what makes up 96% of the mass of the universe.  Are you suggesting that we shouldn\u0027t be attempting to discover the nature of \u0022dark matter\u0022.  Isn\u0027t some degree of \u0022fluffy\u0022 speculation the way hypotheses are formed?\n\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2016-06-01T23:20:18Z","Content":"\n\u003Cp\u003E\n@PB666 \n\u003C/p\u003E\n\u003Cp\u003E\nYou can\u0027t seriously believe that there is no life out there? Even if it happens that we are the only sentient beings in the Milky Way did you even think about how many more galaxies are out there ? There will probably never be a way to detect any signals from them but that for sure doesn\u0027t mean that there is no life out there,\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T23:32:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222612141\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464823218\u0022 data-ipsquote-userid=\u0022107622\u0022 data-ipsquote-username=\u0022gpisic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, gpisic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n@PB666 \n\u003C/p\u003E\n\u003Cp\u003E\nYou can\u0027t seriously believe that there is no life out there? Even if it happens that we are the only sentient beings in the Milky Way did you even think about how many more galaxies are out there ? There will probably never be a way to detect any signals from them but that for sure doesn\u0027t mean that there is no life out there,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIts not the point, its the point that people are speculating on what it is, where it might be and why it has not reached earth, contacted earth or sent out signals in our direction without a smeg of evidence that it exists in a vicinity reasonable enough to do any of these things. It not an argument against ET life, its an argument against completely useless guessing, guessing which is not scientific, and arguing for observation in order to get that one unit of evidence whereby we ca say, this is not a sol bound outlyer.. otherwise our current statistcs include a  confidence range that does not include any other sentient life in our visible universe. ( which i do not believe, but belief is a wonspderfulnand myth filled thing). \n\u003C/p\u003E\n\u003Cp\u003E\nRead what a confidence interval, if you can understand this you can understand my POV, and if you cant, then have fun with your guessing game. \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-06-02T04:00:56Z","Content":"\n\u003Cp\u003E\nProblem one is that Kepler has an easier time finding large planets and planets at least not close to the star. \u003Cbr\u003E\nSee the lack of mars sized planets, the star movement method favor large planets even more. \u003Cbr\u003E\nI find this more likely than that smaller planets are rare, on the other hand copies of earth are probably rare. \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-06-02T05:24:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222612151\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464823933\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIts not the point, its the point that people are speculating on what it is, where it might be and why it has not reached earth, contacted earth or sent out signals in our direction without a smeg of evidence that it exists in a vicinity reasonable enough to do any of these things. It not an argument against ET life, its an argument against completely useless guessing, guessing which is not scientific, and arguing for observation in order to get that one unit of evidence whereby we ca say, this is not a sol bound outlyer.. otherwise our current statistcs include a  confidence range that does not include any other sentient life in our visible universe. ( which i do not believe, but belief is a wonspderfulnand myth filled thing). \n\u003C/p\u003E\n\u003Cp\u003E\nRead what a confidence interval, if you can understand this you can understand my POV, and if you cant, then have fun with your guessing game. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell beaming radio signals towards planets for billion of years in hope that somebody would detect it don\u0027t sounds like an good idea. \u003Cbr\u003E\nHow do we know they have not reached earth? We only knew they did not take it over. \u003Cbr\u003E\nAtmosphere was too thin is one good reason.\u003Cbr\u003E\u003Cbr\u003E\nI agree that advanced civilizations are rare, we however know nothing about intelligent life. \n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2016-06-02T05:45:06Z","Content":"\n\u003Cp\u003E\nIMHO it\u0027s still a paradox. You do not know, in any way, is it right or not. Olber\u0027s paradox is no longer a paradox because the assumptions are wrong. Twin paradox isn\u0027t a paradox as well - because it is right. Fermi\u0027s... Even with salt water \u0022flowing\u0022 on Mars, massive sea lying beneath Jovian Moons, clearly it\u0027s simply a paradox waiting to be solved. You don\u0027t even need to look at other worlds in distant systems - just look at the ones close to home, see whether our model for life is as universal as we have assumed.\n\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2016-06-02T06:47:25Z","Content":"\n\u003Cp\u003E\nI have a question I have never been able to find a good answer to.\n\u003C/p\u003E\n\u003Cp\u003E\nUsing our current or near future (50-ish years) technological capabilities, what is the maximum distance at which Earth clone (exact replica with all the radio emission exactly the same) would be detectable using broad search methods (wide enough field one would use to search for something when not knowing where to search) and what is the maximum distance of a tightly focused and pointed antenna (something one would use if he knew exactly where and what to look for)?\n\u003C/p\u003E\n\u003Cp\u003E\nAlmost all the radio emissions we make are directional and pointed at Earth, not sky. Even the omni directional antennas don\u0027t radiate up - they emit in a torus like pattern parallel to Earth surface.\n\u003C/p\u003E\n\u003Cp\u003E\nThose few exceptions that do point up, such as uplinks for communication satellites and coms with interplanetary probes are not only very focused and not particularly high intensity (only strong enough for the probe inside our solar system to receive the signal), but are also tracking the probe across the sky. Even if an alien searching for radio emissions happens to have an antenna pointed at Earth at the exact time the signal arrives and has it dialed to the exact frequency we are emitting our instructions to a probe, the signal received would last for only a fraction of a second before our transmitting antenna pans away from our alien to keep up with our own probe. On the receiving end, that very short spike in signal strength would be unrepeatable, too short to decode and possibly too degraded to even make out the ones and zeros.\n\u003C/p\u003E\n\u003Cp\u003E\nThat being said,\u003Cbr\u003E\u003Ca href=\u0022http://www.setileague.org/askdr/howmuch.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.setileague.org/askdr/howmuch.htm\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the existence of intelligent and technologically capable alien life, I have no problem accepting that it is exceedingly rare. It might be as common as millions of civilizations in each galaxy, but I see no problem in it being so rare that only one in a million galaxies have only one planet with Earth-like life on it.\n\u003C/p\u003E\n\u003Cp\u003E\nTo me, exoplanet search using transition method leaves out too many star systems that may not have planets orbiting in the plane that would bring them between their star and Earth, therefore undetectable.\n\u003C/p\u003E\n"},{"CreatedByName":"11of10","CreatedById":90592,"CreatedDateTime":"2016-06-02T07:22:43Z","Content":"\n\u003Cp\u003E\nA question: Would we even be able to recognize another sentient species, even if it was, for instance, on Titan?\n\u003C/p\u003E\n\u003Cp\u003E\nWhat if the technological difference is so large, and they took different approaches that we haven\u0027t even imagined possible, that we don\u0027t even realise they are there? \n\u003C/p\u003E\n\u003Cp\u003E\nAnd the same question in reverse, would they even be aware of us?\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-06-02T07:40:14Z","Content":"\n\u003Cp\u003E\nTo my imho, it isn\u0027t a \u0022paradox\u0022 at all, but \u0022Fermi\u0027s normality\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Sun system and Earth are not a usual place.\u003Cbr\u003E\nThey occupy probably the most optimal place for a life to appear and be, with almost ideal conditions for evolution.\n\u003C/p\u003E\n\u003Cp\u003E\nOptimal size, warm liquid water, N-O atmosphere, equator declination 23 degree, a large skimmer and balancer - Moon, and so on.\u003Cbr\u003E\nSo, not every dozen of standalone stars would provide such planet to live.\n\u003C/p\u003E\n\u003Cp\u003E\nA step aside — and you are either in radioactive hell or in a cold hydrogen abyss.\u003Cbr\u003E\nSo, not much places in galaxy: far from its center, but not outside of heavy elements; between galactic arms, with same orbital period (in corotation zone).\n\u003C/p\u003E\n\u003Cp\u003E\nSo, there should be just several spots (about 1000 l.y. in diameter) per spiral galaxy: between its large arms, on a corotation orbital radius.\n\u003C/p\u003E\n\u003Cp\u003E\nThis already means that there should be not more than several native civilizations per galaxy.\u003Cbr\u003E\nAnd looks unlikely if they appear simultaneously, while 1-2 million years gap between them - and they have no common themes to speak about.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, a sentient life should be a rare, galaxy-scale, event.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnother point: why they presume that a civilization should endlessly expand?\u003Cbr\u003E\nThere is a huge and critical technological gap between planetary activities and space colonization.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile there are less than several millions of beings, they have no need in progress, they just migrate and possess new places to harvest.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen population becomes enough dense, they begin to struggle against each other because: while population grow, it needs more place; to get more place you need your population to grow - a positive loopback.\u003Cbr\u003E\nNo one neither needs nor can anything more complex than a crossbow, maybe a cannon.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen a planet becomes overpopulated, military technological competition gives aviation, rockets and then - space.\u003Cbr\u003E\nPopulation still grows, but the higher is a country\u0027s technical level, the more urbanized is population, the higher is quality of life, the longer is lifespan, the more powerful is military defense.\n\u003C/p\u003E\n\u003Cp\u003E\nAs \u0022extraterrestrial colonization\u0022 requires titanical efforts with puny results, it stays a poor cousin because you need more military units.\n\u003C/p\u003E\n\u003Cp\u003E\nAt some point the population growth stops, somewhere by will, somewhere by force.\u003Cbr\u003E\nAnd stays more or less constant. And extraterrestrial colonization again stays a poor cousin because a portion of protein algae paste on Earth is much cheaper than a potato on Mars.\n\u003C/p\u003E\n\u003Cp\u003E\nLifespan grows (and probably at once to infinity, not progressively), frequency of births goes down.\u003Cbr\u003E\nSeveral millenia later the population stabilizes at much lower level (millions?)\u003Cbr\u003E\nThey live in superfortresses, with close technological loop, every joule registered and with water counters in toilets.\n\u003C/p\u003E\n\u003Cp\u003E\nAll what you can tell them they already know (\u0022Gentlemen, let\u0027s laugh on the joke #3587 in our catalog\u0022).\u003Cbr\u003E\nTheir social rules and priorities are inconceivable for you (until you live for 100000 years, too).\u003Cbr\u003E\nTheir overfortified habitats can be met everywhere - but you will see just a one more asteroid or mountain until they let you in.\u003Cbr\u003E\n(More probably they will just switch on their fumigator).\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the only significant source of radiosignals with TV shows are the intermediate civilization like the terrestrial: enough smart to waste energy, not enough - to keep.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd this state unlikely lasts long.\u003Cbr\u003E\n100 years ago they used 20 W electrical lamps. Now we again use electrical 20 W lamps, just of another construction.\u003Cbr\u003E\n1970s were the most radiating time, and this state takes about a century or less.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, a silent darkness is a natural state of civilizations.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-06-02T09:54:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222612626\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464853214\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n52 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTo my imho, it isn\u0027t a \u0022paradox\u0022 at all, but \u0022Fermi\u0027s normality\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Sun system and Earth are not a usual place.\u003Cbr\u003E\nThey occupy probably the most optimal place for a life to appear and be, with almost ideal conditions for evolution.\n\u003C/p\u003E\n\u003Cp\u003E\nOptimal size, warm liquid water, N-O atmosphere, equator declination 23 degree, a large skimmer and balancer - Moon, and so on.\u003Cbr\u003E\nSo, not every dozen of standalone stars would provide such planet to live.\n\u003C/p\u003E\n\u003Cp\u003E\nA step aside — and you are either in radioactive hell or in a cold hydrogen abyss.\u003Cbr\u003E\nSo, not much places in galaxy: far from its center, but not outside of heavy elements; between galactic arms, with same orbital period (in corotation zone).\n\u003C/p\u003E\n\u003Cp\u003E\nSo, there should be just several spots (about 1000 l.y. in diameter) per spiral galaxy: between its large arms, on a corotation orbital radius.\n\u003C/p\u003E\n\u003Cp\u003E\nThis already means that there should be not more than several native civilizations per galaxy.\u003Cbr\u003E\nAnd looks unlikely if they appear simultaneously, while 1-2 million years gap between them - and they have no common themes to speak about.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, a sentient life should be a rare, galaxy-scale, event.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnother point: why they presume that a civilization should endlessly expand?\u003Cbr\u003E\nThere is a huge and critical technological gap between planetary activities and space colonization.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile there are less than several millions of beings, they have no need in progress, they just migrate and possess new places to harvest.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen population becomes enough dense, they begin to struggle against each other because: while population grow, it needs more place; to get more place you need your population to grow - a positive loopback.\u003Cbr\u003E\nNo one neither needs nor can anything more complex than a crossbow, maybe a cannon.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen a planet becomes overpopulated, military technological competition gives aviation, rockets and then - space.\u003Cbr\u003E\nPopulation still grows, but the higher is a country\u0027s technical level, the more urbanized is population, the higher is quality of life, the longer is lifespan, the more powerful is military defense.\n\u003C/p\u003E\n\u003Cp\u003E\nAs \u0022extraterrestrial colonization\u0022 requires titanical efforts with puny results, it stays a poor cousin because you need more military units.\n\u003C/p\u003E\n\u003Cp\u003E\nAt some point the population growth stops, somewhere by will, somewhere by force.\u003Cbr\u003E\nAnd stays more or less constant. And extraterrestrial colonization again stays a poor cousin because a portion of protein algae paste on Earth is much cheaper than a potato on Mars.\n\u003C/p\u003E\n\u003Cp\u003E\nLifespan grows (and probably at once to infinity, not progressively), frequency of births goes down.\u003Cbr\u003E\nSeveral millenia later the population stabilizes at much lower level (millions?)\u003Cbr\u003E\nThey live in superfortresses, with close technological loop, every joule registered and with water counters in toilets.\n\u003C/p\u003E\n\u003Cp\u003E\nAll what you can tell them they already know (\u0022Gentlemen, let\u0027s laugh on the joke #3587 in our catalog\u0022).\u003Cbr\u003E\nTheir social rules and priorities are inconceivable for you (until you live for 100000 years, too).\u003Cbr\u003E\nTheir overfortified habitats can be met everywhere - but you will see just a one more asteroid or mountain until they let you in.\u003Cbr\u003E\n(More probably they will just switch on their fumigator).\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the only significant source of radiosignals with TV shows are the intermediate civilization like the terrestrial: enough smart to waste energy, not enough - to keep.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd this state unlikely lasts long.\u003Cbr\u003E\n100 years ago they used 20 W electrical lamps. Now we again use electrical 20 W lamps, just of another construction.\u003Cbr\u003E\n1970s were the most radiating time, and this state takes about a century or less.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, a silent darkness is a natural state of civilizations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t agree that Earth is optimal for life, its however optional for us. This will be important for interstellar colonization. \u003Cbr\u003E\nSay you colonized a few planets this is an important achievement who brings lots of prestige to the leadership, it also secure the species. \u003Cbr\u003E\nHowever will you continue doing it. making more colonies is not the milestone the first was, its also likely that you will raise the bar for how earth like the planets has to be. This increase the distance to the next planet, 40 light year is far, you will need an fast generation ship. \u003Cbr\u003E\u003Cbr\u003E\nSo its likely to stop, that is even if you have an solar system civilization with plenty of resources, if not you don\u0027t go interstellar.\u003Cbr\u003E\u003Cbr\u003E\nI also agree about radio signals, its an trend to go cell based with higher frequencies. For space lasers will probably take over a lot. \u003Cbr\u003E\nYou can not detect broadcasts from lots of lightyears away no matter the equipment, signal strength will be less than noise level. \u003Cbr\u003E\nYou could detect directed signals from an decent distance however they would be infrequent. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-02T10:48:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222612696\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464861271\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n53 minutes ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t agree that Earth is optimal for life, its however optional for us. This will be important for interstellar colonization. \u003Cbr\u003E\nSay you colonized a few planets this is an important achievement who brings lots of prestige to the leadership, it also secure the species. \u003Cbr\u003E\nHowever will you continue doing it. making more colonies is not the milestone the first was, its also likely that you will raise the bar for how earth like the planets has to be. This increase the distance to the next planet, 40 light year is far, you will need an fast generation ship. \u003Cbr\u003E\u003Cbr\u003E\nSo its likely to stop, that is even if you have an solar system civilization with plenty of resources, if not you don\u0027t go interstellar.\u003Cbr\u003E\u003Cbr\u003E\nI also agree about radio signals, its an trend to go cell based with higher frequencies. For space lasers will probably take over a lot. \u003Cbr\u003E\nYou can not detect broadcasts from lots of lightyears away no matter the equipment, signal strength will be less than noise level. \u003Cbr\u003E\nYou could detect directed signals from an decent distance however they would be infrequent. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep :-). Earth is not \u0022optimal\u0022 for us, organisms have adapted in a proper way to to the conditions. Not \u0022optimal\u0022, because then a small change would result in a distinction, just \u0022sufficient\u0022. And with the freedom of changing \u0022little things\u0022 every now and then so that changes in the conditions don\u0027t effect everyone. If we want to go interstellar (or even interplanetary) we have to take \u0022our\u0022 conditions with us, with the help of technology. In my opinion that step does not secure the species, when cut off of technological supply that technology will sooner or later fail, killing the travelers. I assume there are no \u0022replicators\u0022 that fabricate worn out hightec things and that the travelers cannot take the earths raw materials and fabrication chains with them).\n\u003C/p\u003E\n\u003Cp\u003E\nLet us assume that are not that many possibilities to create sentient/intelligent/mobile beings as a result of an evolution because the available elements are the same (i know life forms based on different bases are imaginable but not as effective as what earths evolution has breeded out, but i\u0027m prepared for being corrected). Let us further assume that any travel faster than light is pure fiction.\n\u003C/p\u003E\n\u003Cp\u003E\nIn this case i don\u0027t see any paradoxon: others, civilized or not, may exist (i think they do) but the distances between \u0022neighbors\u0022 are too far and too long. Technology will fail, radiation will kill the travelers or sterilize them.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe newly planned telescopes will tell us more in the next decades.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-02T10:49:21Z\u0022 title=\u002206/02/2016 10:49  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 2, 2016\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"}]}