{"TopicId":141229,"ForumId":44,"TopicTitle":"Arecibo to be mothballed?","CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-05T03:28:55Z","PageNum":1,"Articles":[{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-05T03:28:55Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022http://phenomena.nationalgeographic.com/2016/06/04/uncertain-future-for-earths-biggest-telescope/?mwhe=1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://phenomena.nationalgeographic.com/2016/06/04/uncertain-future-for-earths-biggest-telescope/?mwhe=1\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2016-06-05T14:48:56Z","Content":"\n\u003Cp\u003E\nWhy in the name of Kod would they close such a facility? Oh, right, money. $12M per year is chump change on government scales.\n\u003C/p\u003E\n"},{"CreatedByName":"ModZero","CreatedById":89470,"CreatedDateTime":"2016-06-05T16:24:02Z","Content":"\n\u003Cp\u003E\nAw. I don\u0027t consider myself equipped to thinking if that\u0027s the right decision (deciding things \u0027like\u0027 NSF should have more money is easy, whether a 47-year old telescope is still the best way to spend 12 mil - not so much), but Arecibo is quite symbolic. It would be really sad to see it go, on a purely emotional level.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2016-06-05T21:03:25Z","Content":"\n\u003Cp\u003E\nIt may be 47 years old, but it\u0027s still a really huge radio antenna. The parts that make it a really huge radio antenna aren\u0027t the parts that get outdated.\n\u003C/p\u003E\n\u003Cp\u003E\nThe parts that get outdated are the radio receivers and/or feed-horns at the focus of the dish. The dish itself (including cables to support equipment at the focus) doesn\u0027t go obsolete. It might become structurally unsound, but that\u0027s a different thing entirely.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d say refitting it with more modern radio equipment would be a good idea, if it hasn\u0027t been done already.\n\u003C/p\u003E\n\u003Cp\u003E\nMothballing this kind of facility makes no sense to me, and constructing something of similar capability \u0022again\u0022 would require significantly more than 12 million.\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-06-06T17:20:10Z","Content":"\n\u003Cp\u003E\nMaybe the boom \u0026amp; controls might have some cost to replace.  To put some perspective on the cost of the antenna \u002B radio equipment, SETI@home built its own copy of the radio equipment and put it on the boom\u0027s counterweight.  It would then pick up various parts from the sky, although something like the opposite end of the sky of whatever the radio astronomer of the day was looking at.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m guessing US politics.\n\u003C/p\u003E\n"}]}