{"TopicId":142527,"ForumId":44,"TopicTitle":"An essay i had to write for my english lesson","CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-06-26T11:25:59Z","PageNum":1,"Articles":[{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-06-26T11:25:59Z","Content":"\n\u003Cp\u003E\nWe have the task to write an essay in my class \u0022technical english\u0022 at university. For that we could select one fo 5 topics, after i read the topic \u0022Space exploration requires vast sums of money. Is this money pent on space research justifiable?\u0022 i didnt bother to check the other ones. While we were supposed to write only about 300 words i simply didnt manage to keep to that limit, since its not graded it shouldnt matter to much. While i think its good read worth sharing i would also ask for suggestions on what to improve:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EA lot of people argue that space exploration costs too much money, which could be spend better. In the following I want to point out why I disagree.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EFirst, the amount of money spend on space exploration isn’t as high as most people think. The combined budget of the worlds space agencies totals up to about 30 billion euros per year, while for example the total military budget is about 1.5 trillion €. Germanys funding for the ESA is about 800 million per year, about 0.25% of the federal budget.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003ESecondly, let’s have a look at the benefits of space-exploration for humans. Space agencies fund a lot of earth observing satellites, providing us with accurate weather information and data for environmental research. Often those data are made public for everyone to use, for example in the EU’s Copernicus Program. We also use a lot of space based services everyday like satellite-TV or GPS. While not directly funded by space agencies those only became possible after pioneering work paid for by governments.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EThirdly, the extreme conditions of space require top notch engineering and new, better materials. Thus space travel is a motor for innovations that will later find their way into everyday products. This includes solar cells or the thermal blankets included in first aid kits.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EOne could also point out the huge influence the space race had on students in the USA. While hard to nail down in numbers its widely believed that the Apollo program inspired a lot of young people to become engineers, later becoming the generation that made the digital revolution possible.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EBut there are other, subtler reasons to conduct space exploration. Humans always strived to explore the unknown, to widen their knowledge and borders. This trait is so common in human history; it’s for sure a part of what makes us human.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EAlso spaceflight is something which united humanity in the past and could do so in the future. The manned moon landing was probably the biggest media event of all time, watched by everyone with access to the live pictures. After that the Apollo-Soyuz project showed a rare cooperation between the cold war enemies. Due to the vast amount of resources required for a manned mars landing it could provide another opportunity to strengthen the bounds of human nations.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EAt last I want to ask: What would happen if humanity would stop its ambitions of leaving this planet? One day this small planet would become our grave, at the very latest when the sun becomes a red giant. With us everything humans every achieved would be gone. Every invention, every piece of art, everything people ever worked or fought for would become meaningless. If we stop space exploration, we can also stop to live at all.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-26T11:52:47Z\u0022 title=\u002206/26/2016 11:52  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 26, 2016\u003C/time\u003E by Elthy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-06-26T12:15:54Z","Content":"\n\u003Cp\u003E\nVery good essay \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Concise and to the point. You could add more pros - like medical and biology research onboard ISS and significant amount of workplaces space-related industries create across the world.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-26T13:34:06Z","Content":"\n\u003Cp\u003E\nStrictly speaking that\u0027s not technical English. \n\u003C/p\u003E\n\u003Cp\u003E\nSpent should be used instead of spend. Superlatives like \u0022too many\u0022, \u0022too much\u0022 or prejoratives are to be avoided. \u0022Isn\u0027t\u0022, \u0022as high as most people think\u0022. If i see more than one of these in a manuscript it gets sent back for a technical English rewrite. I\u0027m counting about two of these per paragraph. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-06-26T13:43:51Z","Content":"\n\u003Cp\u003E\nGreat, thats exactly the feedback i want.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-26T14:25:23Z\u0022 title=\u002206/26/2016 02:25  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 26, 2016\u003C/time\u003E by Elthy\u003C/strong\u003E\n\u003Cbr\u003ERemembered this thing can be found by google...\n\u003C/span\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2016-06-26T15:03:14Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003E\u0022...at the very latest when the \u003Cstrong\u003ES\u003C/strong\u003Eun becomes a red giant. With\u003Cstrong\u003Eout\u003C/strong\u003E us everything humans \u003Cstrong\u003Eever \u003C/strong\u003Eachieved would be gone...\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003EAll in all, if this was a Wikipedia article, it would receive a whole lot of [who| and [citation needed] tags.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003EOn top of it all, maybe you should try and find out some actual numbers regarding the amount of money that was saved by having, for example GPS available in a certain event, or by having access to an early warning about an incoming hurricane thanks to the weather sats.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003EFor example, \u003Ca href=\u0022http://www.srh.noaa.gov/lix/?n=katrina_anniversary\u0022 rel=\u0022external nofollow\u0022\u003ENOAA \u003C/a\u003E estimates that the hurricane Katrina caused more than $100 billion in damages. It would be interesting to know what would be the number if there were no satellites to provide advance warning.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-06-26T18:54:33Z","Content":"\n\u003Cp\u003E\nIm allready over the limit of words, so i cant add details. You cant expect someone to answer such a big question in 300 words with citations, i could have written ten times as much. But thanks for the corrections. Im not sure if the With -\u0026gt; Without is better, i meant to write that not only we would be gone, but everything else, too. Is the \u0022with\u0022 realy incorrect in english?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/107380-pb666/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022107380\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/107380-pb666/\u0022 rel=\u0022external\u0022\u003E@PB666\u003C/a\u003E, where do i use prejoratives? First time ive heard that word, not sure if i understood that correctly. About the \u0022isnt that high as most people think\u0022, im not sure how to rewrite that. It refers to the question that mentions \u0022vast sums\u0022 and the poll from the nasa-budget-wikipage, which i couldnt mention directly due to word limitations.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit2: Im also not realy satisfied with the \u0022\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EBut there are other, \u003Cu\u003E\u003Cstrong\u003Esubtler\u003C/strong\u003E\u003C/u\u003E reasons to conduct space exploration.\u003C/span\u003E\u0022. I want to point out that there are other reasons for spaceflight which cant be represented as a number on a invest/return calculation, but i dont even know a good word for that in german...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-26T19:44:12Z\u0022 title=\u002206/26/2016 07:44  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 26, 2016\u003C/time\u003E by Elthy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2016-06-26T20:18:27Z","Content":"\n\u003Cp\u003E\nIf you want to convince someone, you need to address the obvious and common counter arguments. Just the fact that spendings are not as high as people expect is covered, but that is quite meagre. The use of \u003Cem\u003Efirst, secondly and thirdly\u003C/em\u003E make it list-like and dry. Try replacing that with something more natural. Finally, there are many texts out there. You need to entice the reader by opening with something that creates interest. It does not have to be some clickbait-type title, but something with a little more draw than \u0027You think it is expensive, I think it is not\u0027 would probably help a lot.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-26T20:49:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222648542\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466967273\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIm allready over the limit of words, so i cant add details. You cant expect someone to answer such a big question in 300 words with citations, i could have written ten times as much. But thanks for the corrections. Im not sure if the With -\u0026gt; Without is better, i meant to write that not only we would be gone, but everything else, too. Is the \u0022with\u0022 realy incorrect in english?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/107380-pb666/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022107380\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/107380-pb666/\u0022 rel=\u0022external\u0022\u003E@PB666\u003C/a\u003E, where do i use prejoratives? First time ive heard that word, not sure if i understood that correctly. About the \u0022isnt that high as most people think\u0022, im not sure how to rewrite that. It refers to the question that mentions \u0022vast sums\u0022 and the poll from the nasa-budget-wikipage, which i couldnt mention directly due to word limitations.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit2: Im also not realy satisfied with the \u0022\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EBut there are other, \u003Cu\u003E\u003Cstrong\u003Esubtler\u003C/strong\u003E\u003C/u\u003E reasons to conduct space exploration.\u003C/span\u003E\u0022. I want to point out that there are other reasons for spaceflight which cant be represented as a number on a invest/return calculation, but i dont even know a good word for that in german...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThink of it this way you write an essay of 5000 words, now take that 5000 words and summarize each major section into a sentence or two in the abstract. i wrote a review that was 125 pages with references,  its abstract was less than 300 words. \n\u003C/p\u003E\n\u003Cp\u003E\nPerjorative words, you see how politicians  talk, that is perjorative or hyperbolic (this \u0027thing is the best thing in the world\u0027 or ,\u0027,such and such is the most corrupt candidate\u0027) Its taking basic facts and placing excessive superlative or derogatory slants on them. Its fine for conversational English, but not so good for technical English. When you start using perjoratives and hyperbole to scientist they turn off real quick. \n\u003C/p\u003E\n\u003Cp\u003E\nSo you have to state the problem. \n\u003C/p\u003E\n\u003Cp\u003E\nFor example .......\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently growth in many countries falls below expected levels by world bank and IMF. Weak spending in economy\u0027s contemporary growth sectors such as science, technology, engineering and medicine (STEM) are one of the causes. One of the problem these states face is a growth of national debt as a consequence of past spending on legacy programs that have not promoted globally competitive growth. STEM represents the types of growth that can derive income and tax revenue capable of fiscal remediation. Such increased incomes are driven by professional careers driven by international trade of high value goods or services and increased consumer descretionary spending, particularly in the high technology and premium household goods. \n\u003C/p\u003E\n\u003Cp\u003E\nWhile governments cannot often dictate competitve investment in private sector STEM industries, they can provide public grants for science and technology programs such as space industries. Increasing investment on these justifies the growth of public and higher educational programs that can motivate students from careers that give  low average return on public educational investment to educational plans that give consistently higher career incomes. \u003Cspan style=\u0022color:rgb(39,42,52);font-size:14px;background-color:rgb(255,255,255);\u0022\u003ETrained space-industry professionals\u003C/span\u003E\u003Cspan style=\u0022color:rgb(39,42,52);font-size:14px;background-color:rgb(255,255,255);\u0022\u003E \u003C/span\u003E\u003Cspan style=\u0022color:rgb(39,42,52);font-size:14px;background-color:rgb(255,255,255);\u0022\u003Ecan be fed into other industries carrying their expertise with them and helping those industries develope. Industries developed for space such as solar panels, light weight structural materials, and peripheral hardware automation can provide benefits to society making other industries more efficient and competitive. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn particular, space science offers advantages to public sector investment because it requires training of engineers, technicians  and scientist capable of promoting a demanding high technology industry. The benefit from these programs are international cooperation with well developed nations, descriptive science regarding water cycling, weather forcasting, climate science, and earthquake science. The more advanced science programs can promote leading edge theoretical science concerning particle behavior, many which benefit from studies in space. Space technologies also advance defense industies a give them more reliable monitoring of potential threats. \n\u003C/p\u003E\n\u003Cp\u003E\n----------\n\u003C/p\u003E\n\u003Cp\u003E\nNote how i avoided the biasing words,\n\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-06-26T21:12:15Z","Content":"\n\u003Cp\u003E\nThanks, this will help a lot!\n\u003C/p\u003E\n"},{"CreatedByName":"CSE","CreatedById":145588,"CreatedDateTime":"2016-06-26T21:43:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222648063\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466940359\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EWith us everything humans every achieved would be gone.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003E[...]\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIm not sure if the With -\u0026gt; Without is better, i meant to write that not only we would be gone, but everything else, too. Is the \u0022with\u0022 realy incorrect in english?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think you had it right, but ambiguous. A \u0022with\u0022 beginning can be used to introduce one of a number of joined or related things, which is what I think you intended. But a \u0022with\u0022 beginning can also be used to give background or context, setting the scene - which is how I think Shpaget read it. You could try moving it to the end:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\nEverything humans ever achieved would be gone with us.\n\u003C/p\u003E\n\u003Cp\u003E\nOr, if you can afford the extra words, to make it clear that the \u0022us\u0022 is doing the going:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\nAlong with us, everything humans ever achieved would be gone.\n\u003C/p\u003E\n\u003Cp\u003E\nBest of luck.\n\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2016-06-26T21:47:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222648542\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466967273\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIm also not realy satisfied with the \u0022\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EBut there are other, \u003Cu\u003E\u003Cstrong\u003Esubtler\u003C/strong\u003E\u003C/u\u003E reasons to conduct space exploration.\u003C/span\u003E\u0022. I want to point out that there are other reasons for spaceflight which cant be represented as a number on a invest/return calculation, but i dont even know a good word for that in german...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u0022But there are other, more subtle reasons to conduct space exploration.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nor\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022But there are other, less tangible reasons to conduct space exploration.\u0022\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222648063\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466940359\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhile hard to nail down in numbers its widely believed that. . .\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s tough to formulate an argument in 300 words, but then that\u0027s usually the point of the exercise. The limit forces you to use your words efficiently. Not only is the above vague and weak (you\u0027re backing away from your point before you\u0027ve even made it), you\u0027re burning eleven words here without any real effect. It would probably be beneficial for you to go back through this and see if you can bring the word count down by making your sentences shorter. \n\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2016-06-26T22:19:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222648797\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466977632\u0022 data-ipsquote-userid=\u0022123319\u0022 data-ipsquote-username=\u0022Ten Key\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, Ten Key said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s tough to formulate an argument in 300 words, but then that\u0027s usually the point of the exercise.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs a rule of thumb, you can eliminate over half to two thirds of a text without changing the meaning a lot. Kill your darlings is typically important for that - you need to be critical about what you wrote and cut those things you love, but are not essential.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-26T22:19:44Z\u0022 title=\u002206/26/2016 10:19  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 26, 2016\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MircoMars","CreatedById":61811,"CreatedDateTime":"2016-06-26T23:11:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222648063\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466940359\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...those data are made public...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022https://imgs.xkcd.com/comics/data.png\u0022 alt=\u0022data.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://xkcd.com/1429/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://xkcd.com/1429/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-06-27T01:46:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222648243\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466953394\u0022 data-ipsquote-userid=\u002245577\u0022 data-ipsquote-username=\u0022Shpaget\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Shpaget said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003EFor example, \u003Ca href=\u0022http://www.srh.noaa.gov/lix/?n=katrina_anniversary\u0022 rel=\u0022external nofollow\u0022\u003ENOAA \u003C/a\u003E estimates that the hurricane Katrina caused more than $100 billion in damages. It would be interesting to know what would be the number if there were no satellites to provide advance warning.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis, note that Karina was the one they screwed up, most others have low damage because of the early warnings, without them Katrina would be an forgotten average rather than the tragedy. \u003Cbr\u003E\nThe Beaufort scale only goes up to hurricane back in 19th century he saw no reason to go higher as you die at sea. \u003Cbr\u003E\nAnd yes its typical 100 years from the theory until practical use unless the practical use came first as in transistors. \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-27T03:00:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222649115\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466991974\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis, note that Karina was the one they screwed up, most others have low damage because of the early warnings, without them Katrina would be an forgotten average rather than the tragedy. \u003Cbr\u003E\nThe Beaufort scale only goes up to hurricane back in 19th century he saw no reason to go higher as you die at sea. \u003Cbr\u003E\nAnd yes its typical 100 years from the theory until practical use unless the practical use came first as in transistors. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKatrina, was a realatively large storm with a high integrated kinetic energy scale, this is not only a measure of maximum wind speed but also the energetic breath of the storm and energy in the water column. Satellites did not really protect the city, but satellites told the story of loss of barrier islands that protected the city, msking the lack of upgrades an even more serious problem. The levees were only rated for a low cat three storm with moderated IKE score. We have known since 1900 that high IKe storms can hit anywhere along the gulf coast, one hit houston area in 2008. Maximum wind speed predicts wind damage, IKe is a better predictor of stormsurge. \n\u003C/p\u003E\n\u003Cp\u003E\nAgain climate scoence studies have perdicted since around 1995 that cities between the rainfall levels of New orleans tonthose of about amarillo texas are in for periods of historic drought interrupted by historic fllods, decadal fllod plains will have to be shifted. This is one spect of the climate change models that has withstood the test of time and risk apoears to be increasing. Places that subject to constant rainfall, rainforests and very dry areas and very cold places are not likely to be as affected. \n\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2016-06-27T13:21:20Z","Content":"\n\u003Cp\u003E\nI can\u0027t help you much beyond what has already been pointed out, what with english not being my native language, but I just wanted to point out this:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222648063\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466940359\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/26/2016 at 1:25 PM, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nafter i read the topic \u0022Space exploration requires vast sums of money. Is this money pent on space research justifiable?\u0022 i didnt bother to check the other ones.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis right here (as well as the entire 300 word essay that follows) is why I love the KSP forum-dwellers \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-27T13:22:05Z\u0022 title=\u002206/27/2016 01:22  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 27, 2016\u003C/time\u003E by Cirocco\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-27T13:24:37Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://blogofthecosmos.com/2016/06/27/why-do-we-spend-very-little-on-science/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://blogofthecosmos.com/2016/06/27/why-do-we-spend-very-little-on-science/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-06-27T13:54:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003EAfter that the Apollo-Soyuz project showed a rare cooperation between the cold war enemies.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou didn\u0027t mention who the Cold War enemies were, and Cold War should be capitalized.\n\u003C/p\u003E\n\u003Cp\u003E\nLater during the Cold War the USA and Soviet Union collaborated on the Apollo-Soyuz project demonstrating the possibility of peace between the political enemies.\n\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-06-27T14:03:45Z","Content":"\n\u003Cp\u003E\nCapitalization in english is weird. I didnt think \u0022Cold War\u0022 was a name, but more that the \u0022Cold\u0022 described it as \u0022not hot\u0022. But i think its common knowledge who was confronting each other in the Cold War, so i rather save a few words. I started cutting down the word count, but i dont think i can save that much. Should i delete the examples of the Copernicus Program or the first aid blanket?\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-06-27T14:24:01Z","Content":"\n\u003Cp\u003E\nNice subject.\n\u003C/p\u003E\n\u003Cp\u003E\nI personally don\u0027t like using \u0022for example\u0022 too much, and I suspect this is a German (zB?) habit showing through. If you\u0027re connecting two phrases it\u0027s generally better to use \u0022such as\u0022 (imho).\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, though, I did like that \u0022\u003Cstrong\u003Esubtler\u003C/strong\u003E\u0022, and it is definitely correct to do that (and \u003Cstrong\u003E\u003Cu\u003Enot\u003C/u\u003E \u0022more subtle\u0022\u003C/strong\u003E which actually is a mistaken application of the \u0022two syllable\u0022 rule, since the comparative with \u0022-er\u0022 ends up staying with two syllables).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222649807\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467036225\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCapitalization in english is weird. I didnt think \u0022Cold War\u0022 was a name, but more that the \u0022Cold\u0022 described it as \u0022not hot\u0022. But i think its common knowledge who was confronting each other in the Cold War, so i rather save a few words. I started cutting down the word count, but i dont think i can save that much. Should i delete the examples of the Copernicus Program or the first aid blanket?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI liked the first aid blanket. Thought it was an interesting touch. In fact I liked that whole paragraph.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-27T16:03:46Z\u0022 title=\u002206/27/2016 04:03  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 27, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-06-27T14:37:50Z","Content":"\n\u003Cp\u003E\nThanks again! Ill soon upload the final version, managed to cut it down to 424 words without loosing any meaning.\n\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-06-27T14:41:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222649807\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467036225\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCapitalization in english is weird. I didnt think \u0022Cold War\u0022 was a name, but more that the \u0022Cold\u0022 described it as \u0022not hot\u0022. But i think its common knowledge who was confronting each other in the Cold War, so i rather save a few words. I started cutting down the word count, but i dont think i can save that much. Should i delete the examples of the Copernicus Program or the first aid blanket?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think examples of real world benefits are good to have- regarding Copernicus, really don\u0027t all space agencies share data, or at least NASA and the ESA? I think I would make that more wide reaching to give it even more impact.\n\u003C/p\u003E\n\u003Cp\u003E\n Also, everything in English is weird \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E I think you are doing well though, and since this is a simple short essay I wouldn\u0027t dwell on it too much.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, \u0022losing,\u0022 if you get lose and loose straight you will be doing better than half the internet \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-06-27T14:45:31Z","Content":"\n\u003Cp\u003E\nOne last question: Can i write \u0022\u003Cspan lang=\u0022en-us\u0022 style=\u0022font-size:11pt;line-height:107%;font-family:Calibri, sans-serif;\u0022 xml:lang=\u0022en-us\u0022\u003EE\u003C/span\u003E\u003Cspan\u003E\u003Cspan lang=\u0022en\u0022 style=\u0022font-size:11pt;line-height:107%;font-family:Calibri, sans-serif;\u0022 xml:lang=\u0022en\u0022\u003Expenditures on\u003C/span\u003E\u003C/span\u003E\u003Cspan lang=\u0022en-us\u0022 style=\u0022font-size:11pt;line-height:107%;font-family:Calibri, sans-serif;\u0022 xml:lang=\u0022en-us\u0022\u003E space exploration is lower than perceived by the public. \u003C/span\u003E \u0022? Or do i need \u0022The expenditures\u0022?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Ok, i have to print now, final version:\n\u003C/p\u003E\n\u003Cp\u003E\nA lot of people argue that space exploration costs too much money, which could be better spent. In the following I want to point out why I disagree.\n\u003C/p\u003E\n\u003Cp\u003E\nExpenditures on space exploration is lower than perceived by the public. The combined budget of the world’s space agencies totals up to about €30 billion annually, while the total military budget is about €1.5 trillion.\n\u003C/p\u003E\n\u003Cp\u003E\nLet’s have a look at the benefits of space exploration for humans. Space agencies fund a lot of earth observing satellites, providing us with weather information and data for environmental research. Often those data are made public for everyone to use, for example in the EU’s Copernicus Program. We also use a lot of space based services everyday like satellite-TV or GPS. While not directly funded by space agencies those only became possible after their pioneering work.\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, the extreme conditions of space require top notch engineering and new, better materials. Thus space travel is a motor for innovations that will later find their way into everyday products. This includes solar cells or the thermal blankets included in first aid kits.\n\u003C/p\u003E\n\u003Cp\u003E\nOne could also point out the huge influence the space race had on students in the USA. The Apollo program inspired a lot of young people to become engineers, later becoming the generation that enabled the digital revolution.\n\u003C/p\u003E\n\u003Cp\u003E\nBut there are other, subtler reasons to conduct space exploration. Humans always strived to explore the unknown, to widen their knowledge and borders. This trait is so common in human history; it’s for sure a part of what makes us human.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso spaceflight is something which united humanity in the past and could do so in the future. The manned moon landing was probably the biggest media event of all time, watched by everyone with access to the live pictures. After that the Apollo-Soyuz project showed a rare cooperation between the Cold War enemies. Due to the vast amount of resources required for a manned mars landing it could provide another opportunity to strengthen the bounds of human nations.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-27T14:54:27Z\u0022 title=\u002206/27/2016 02:54  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 27, 2016\u003C/time\u003E by Elthy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-06-27T14:59:01Z","Content":"\n\u003Cp\u003E\ntoo late - nvm!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-27T16:04:25Z\u0022 title=\u002206/27/2016 04:04  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 27, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-27T16:42:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222649864\u0022 data-ipsquote-contentid=\u0022142527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467038731\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EA lot\u003C/span\u003E\u003C/strong\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[Colloquial\u003C/span\u003E\u003C/strong\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E phrasing\u003C/span\u003E\u003C/strong\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E]\u003C/span\u003E\u003C/strong\u003E of people \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E[Weasel wording]\u003C/strong\u003E\u003C/span\u003E argue that space exploration {costs \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Etoo \u003C/strong\u003E\u003C/span\u003Emuch money \u003Cstrong\u003E- replace with\u003C/strong\u003E is expensive} that could be better spent. \u003Cspan style=\u0022color:#A52A2A;\u0022\u003E\u003Cstrong\u003EIn the following\u003C/strong\u003E\u003C/span\u003E [\u0022Below\u0022, -fewer words] \u003Cu\u003EI\u003C/u\u003E want to point out why \u003Cu\u003EI\u003C/u\u003E disagree\u003Cspan style=\u0022color:#FFA07A;\u0022\u003E [missing?]\u003C/span\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nExpenditures on space exploration is lower than\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E [\u003C/strong\u003E\u003C/span\u003E \u003Cspan style=\u0022color:#FFA07A;\u0022\u003Emissing?\u003C/span\u003E \u0022\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Ethat\u0022]\u003C/strong\u003E\u003C/span\u003E perceived by the public. The annual combined budget of the world’s space agencies \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Etotals up\u003C/strong\u003E\u003C/span\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[Colloquiallism]\u003C/span\u003E\u003C/strong\u003E \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Eto about \u003C/strong\u003E\u003C/span\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[Familiar]\u003C/span\u003E\u003C/strong\u003E billion {totals approximately €30 billion - fewer words}, while the \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[annual]\u003C/span\u003E\u003C/strong\u003E military budget \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E[totals] \u003C/strong\u003E\u003C/span\u003Eis annually about {replace between totals with} approximately trillion.\n\u003C/p\u003E\n\u003Cp\u003E\nNote I could rewrite this last sentence as. \u0022Comparing the approximate annual military and space agency budget reveals a ~50 fold difference (€1.5 trillion versus €30 billion, respectively) in allocation of resources. .\u0022 - \u003Cem\u003EMore information and less wording. BTW, this is not a logical proof of the first statement, the spending could be higher or lower than public expectation, that requires a different kind of proof. \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003ELet’\u003Cu\u003Es\u003C/u\u003E\u003C/strong\u003E\u003C/span\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FFA07A;\u0022\u003Ehave a look\u003C/span\u003E\u003C/strong\u003E  \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[Use of contractions, Familiar]\u003C/span\u003E\u003C/strong\u003E at the benefits of space exploration for humans. Space agencies fund a lot of \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Ee\u003C/strong\u003E\u003C/span\u003Earth observing satellites, providing \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cu\u003Eus\u003C/u\u003E \u003C/span\u003E\u003C/strong\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E[familiar]\u003C/span\u003E\u003C/strong\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E \u003C/span\u003E\u003C/strong\u003Ewith weather information and data for environmental research. Often  \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E[Weasel wording]\u003C/strong\u003E\u003C/span\u003E those\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E [unneccesary]\u003C/strong\u003E\u003C/span\u003E data \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Eare made public\u003C/strong\u003E\u003C/span\u003E [\u0022publicized\u0022 -fewer words ] for everyone to use\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E,[period or semicolon]\u003C/strong\u003E\u003C/span\u003E for example in the EU’s \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[Undefined abbreviation]\u003C/span\u003E\u003C/strong\u003E Copernicus Program. \u003Cu\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EWe\u003C/strong\u003E\u003C/span\u003E\u003C/u\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E[familiar]\u003C/span\u003E\u003C/strong\u003E also use \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003Ea lot\u003C/span\u003E\u003C/strong\u003E  \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[Colloquial phrasing]\u003C/span\u003E\u003C/strong\u003E of space based services everyday \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003Elike [Familiar - use \u0022such as\u0022]\u003C/span\u003E\u003C/strong\u003E satellite-TV\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[Undefined abbreviation]\u003C/span\u003E\u003C/strong\u003E or GPS \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[Undefined abbreviation]\u003C/span\u003E\u003C/strong\u003E. While\u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E [missing?]\u003C/span\u003E\u003C/strong\u003E not directly funded by space agencies \u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003Ethose\u003C/span\u003E\u003C/strong\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E[not clearly defined in context]\u003C/span\u003E\u003C/strong\u003E only \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E[unneccesary]\u003C/strong\u003E\u003C/span\u003E became possible after \u003Cu\u003Etheir\u003C/u\u003E pioneering work.\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, the extreme conditions of space require top notch engineering and new, better materials. Thus space travel is a \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Emotor [bad word choice less colloquial choices available]\u003C/strong\u003E\u003C/span\u003E for innovations that will \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E[logic - Space travel has no \u0027will\u0027]\u003C/strong\u003E\u003C/span\u003E later find \u003Cu\u003Etheir\u003C/u\u003E way into everyday products. This includes solar cells or the thermal blankets\u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E included in first aid kits\u003C/span\u003E\u003C/strong\u003E \u003Cspan style=\u0022color:#A52A2A;\u0022\u003E\u003Cstrong\u003E[trivial]\u003C/strong\u003E\u003C/span\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nOne could also point out the huge influence the space race had on \u003Cspan style=\u0022color:#A52A2A;\u0022\u003Estudents in the USA\u003C/span\u003E \u003Cspan style=\u0022color:#A52A2A;\u0022\u003E{better \u0022US students\u0022} [Missing object]\u003C/span\u003E. The Apollo program inspired \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Ea lot\u003C/strong\u003E\u003C/span\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003Eof [] \u003C/span\u003E\u003C/strong\u003Eyoung people to become engineers, later becoming the generation that enabled the \u003Cspan style=\u0022color:#A52A2A;\u0022\u003Edigital revolution {digital revolution is a proper noun}\u003C/span\u003E. \u003Ca href=\u0022http://www.urbandictionary.com/define.php?term=Digital%20Revolution\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.urbandictionary.com/define.php?term=Digital Revolution\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBut there are other, subtler reasons {\u0022Additionally, there are subtler reasons\u0022} to conduct space exploration {could be rewritten \u0022Additionally, space exploration has subtler benefits.\u0022} . Humans always \u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003Estrived [Wrong tense]\u003C/strong\u003E\u003C/span\u003E to explore the unknown, to widen \u003Cu\u003Etheir\u003C/u\u003E knowledge and borders. This trait is so common in human history; { \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Eit’s\u003C/strong\u003E\u003C/span\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E[bad choice]\u003C/span\u003E\u003C/strong\u003E \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003Efor sure\u003C/span\u003E [Colloquial phrase] not required between brackets}\u003C/strong\u003E a part of what makes \u003Cu\u003Eus\u003C/u\u003E human.\n\u003C/p\u003E\n\u003Cp\u003E\nRetaining the content I rewrite the last as \u0022A self-appreciated behavior of humans when confronted with barriers to the unknown is to explore, gain knowledge  and expand influence.\u0022. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso spaceflight \u003Cspan style=\u0022color:#A52A2A;\u0022\u003E\u003Cstrong\u003E{\u003C/strong\u003E\u003C/span\u003E is\u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E something [word choice- inexact]\u003C/span\u003E\u003C/strong\u003E which \u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E[Between \u0022{\u0022 \u0022}\u0022 not required]}\u003C/span\u003E\u003C/strong\u003E united humanity in the past and could do so in the future.\u003Cu\u003E{Could be rewritten as \u0022Also great space achievements (egs. first Apollo moon landing, Apollo-Soyuz project) previously united humanity and ISS and other joint ESA-NASA-RSA programs shows an ongoing international cooperation for peaceful space endeavors.\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E\u003Cstrong\u003E}\u003C/strong\u003E\u003C/span\u003E\u003C/u\u003EThe manned moon landing was a great media event of all time,\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E[Interpretive]\u003C/strong\u003E\u003C/span\u003E watched by everyone with access to the live pictures. After that the showed a rare cooperation between the Cold War enemies.\u003Cstrong\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E[Yes, but this did not eventually bring better cooperation, Chernobyl and Korean Air flight  007, 9-1-1983-best not to include]\u003C/span\u003E\u003C/strong\u003E Due to the vast amount of resources required for a manned mars landing it could provide another opportunity to strengthen the bounds of human nations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOther issues, you start the article in first person singular, the switch to use 1st person plural, then 3rd person plural and then switch to 3rd person singular, then back to 1st person singular. Tone is decidedly not Technical English, sorry. Note how you switch person (see underlined words) in the same paragraph. I, I, Let\u0027s (Let us), us, We, their, their, us. The only person you did not use was second person singular.\n\u003C/p\u003E\n\u003Cp\u003E\nYou need to reach \u003Cem\u003Emuch (replaced a lot)\u003C/em\u003E deeper and move away from an editorial tone toward a descriptive tone.\n\u003C/p\u003E\n\u003Cp\u003E\nA word about abbreviations, do not use them unless you are only going to use them three or more times, and they should be defined in context.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-27T16:47:17Z\u0022 title=\u002206/27/2016 04:47  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 27, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"}]}