{"TopicId":143779,"ForumId":44,"TopicTitle":"Absurdly inane BBC article","CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2016-07-14T11:13:05Z","PageNum":5,"Articles":[{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-07-27T14:12:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222693154\u0022 data-ipsquote-contentid=\u0022143779\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221469627393\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022you can put engine in the back of an long ship and only approach from front. \u0022\n\u003C/p\u003E\n\u003Cp\u003E\nYes, that\u0027s the whole point, because this started with someone saying \u0022NTRs would be even better, but come to them from the wrong side....\u0022 followed by someone implying that closed vs open cycle was relevant... ie they quote that and responded with \u0022Unless it\u0027s a closed-cycle design,\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSo in summary: you need to approach from behind the shadow shield, there won\u0027t be 360 degree shielding because Mass. Open vs closed cycle doesn\u0027t matter, you need to be behind the shadow shield\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTheoretically you could have a door that covers the nozzle when the rocket is not in use. \n\u003C/p\u003E\n\u003Cp\u003E\nI should just point out that gamma emmisions are not the major problem, slowing down two types of neutrons are.. The other problem is that when you crank up a fission reactor to full capacity and run it, it does not _simply_ cool down, So i would imagine that for long distance usage the bell itself would have an application radiator the mass itself would/could be designed to absorb neutron. So a shield disk might not be required. \n\u003C/p\u003E\n\u003Cp\u003E\nSo now the next problem, you are now drifting in space eventually slow energy neutrons are also drifting in space around your craft. The only way to avoid spurious interactions with solar winds is to push the the craft using something like an ion drive.\n\u003C/p\u003E\n\u003Cp\u003E\nIsn\u0027t this thread now really off-topic?\n\u003C/p\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-07-27T14:16:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222690751\u0022 data-ipsquote-contentid=\u0022143779\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221469474947\u0022 data-ipsquote-userid=\u0022164681\u0022 data-ipsquote-username=\u0022DaMachinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/25/2016 at 8:29 PM, DaMachinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf there are, they are military designs and therefore probably classified. You would have to design one from scratch. Which you would have to do anyways, because replacing engines on a precisely designed aircraft is no simple task. It might not be possible at all.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think you might be overestimating the complexity of ramjets, there is a reason that they are sometimes known as \u0022flying stovepipes\u0022. And there are plenty of declassified designs available to peruse, but calculating a new on from scratch, since we are talking the aerospace industry here, should be relatively trivial. Sure, if you want the engine to be a ramjet and \u003Cstrong\u003E\u003Cem\u003Esomething else as well\u003C/em\u003E\u003C/strong\u003E, things start to get tricky, but a plain old mach 2-3 ramjet should be easily attainable given any reasonable design effort. They are so simple the Nazis experimented with \u003Cstrong\u003E\u003Cem\u003Ecoal-fired\u003C/em\u003E\u003C/strong\u003E ones.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n*edit*\n\u003C/p\u003E\n\u003Cp\u003E\nFor some reading on the design process of a high-performance military ramjet, there is a ton of information on the development of the Talos missile here:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.okieboat.com/Talos%20history.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.okieboat.com/Talos history.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-27T14:18:04Z\u0022 title=\u002207/27/2016 02:18  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 27, 2016\u003C/time\u003E by p1t1o\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-07-27T14:31:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222693181\u0022 data-ipsquote-contentid=\u0022143779\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221469628773\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTheoretically you could have a door that covers the nozzle when the rocket is not in use. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNow you have 2 shadow shields... and still need to be careful what direction you approach from\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo now the next problem, you are now drifting in space eventually slow energy neutrons are also drifting in space around your craft. The only way to avoid spurious interactions with solar winds is to push the the craft using something like an ion drive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHuh? Even a slow neutron is going ot have vastly different orbital parameters, and very very low energy collisions aren\u0027t going to be a problem. I doubt even \u0022slow\u0022 neutrons would be travelling at less than escape velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nBut even ignoring all that:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Neutron#Free_neutron_decay\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Neutron#Free_neutron_decay\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022free neutrons are unstable and have a mean lifetime of 881.5±1.5 s (about 14 minutes, 42 seconds);\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThey won\u0027t be \u0022drifting in space around your craft\u0022 for long at all.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd whats this with the solar wind, what does that have to do with anything?\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-07-27T15:57:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222693200\u0022 data-ipsquote-contentid=\u0022143779\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221469629876\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNow you have 2 shadow shields... and still need to be careful what direction you approach from\n\u003C/p\u003E\n\u003Cp\u003E\nHuh? Even a slow neutron is going ot have vastly different orbital parameters, and very very low energy collisions aren\u0027t going to be a problem. I doubt even \u0022slow\u0022 neutrons would be travelling at less than escape velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nBut even ignoring all that:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Neutron#Free_neutron_decay\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Neutron#Free_neutron_decay\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022free neutrons are unstable and have a mean lifetime of 881.5±1.5 s (about 14 minutes, 42 seconds);\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThey won\u0027t be \u0022drifting in space around your craft\u0022 for long at all.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd whats this with the solar wind, what does that have to do with anything?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI mentioned that glancing collisions with solar wind can cause them to reflect back into the ship.\n\u003C/p\u003E\n\u003Cp\u003E\nHalf-lives work like this Lets say I pour a billion neutrons into a room. in 14 minutes half-billion remain, in 28 minutes a 250 million remain, in 42 minutes 125 million remain, in about an hour 50 million remain. In 2 hours 2.5 million remain, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nHalf-life is the least of the problems. if the neutrons are scattered back into the ship there is more than enough time traveling at a few hundred meters per second for them to reach targets in the ship all but fully conserved.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain if you are either in a situation where the solar wind blows in the nozzels direction, but the problem is that many ships will be pointed away from the star when the drives are fired, so the ambient particles can be directed back to the craft.\n\u003C/p\u003E\n\u003Cp\u003E\nLets take an example, a ship traveling to Mars is on a \u0026lt;150 day route, it leave earth traveling about 30\u0027 relative to the horizon of the sun. The neutron ejecta out the nozzle falls into a plane about 180 degrees, thus some of the neutrons are traveling forward with respect to the movement along the horizon, some are struck by the solar wind and travel in the direction of the capsule. If the capsule is accelerating forward this is not likely to happen because by the time it reaches the capsule is very well scattered and diffused. But of the capsule stops, the engine is still producing neutrons and the solar wind is still scattering them. In the event of a solar storm, this could make the problem even worse.\n\u003C/p\u003E\n\u003Ch1 lang=\u0022en\u0022 xml:lang=\u0022en\u0022\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Neutron_scattering\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Neutron_scattering\u003C/a\u003E\u003C/span\u003E\n\u003C/h1\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003ENeutrons can be scattered by anything, the hydrogen in water is particularly good, but they can be scattered by the shielding, scattering creates thermal neutrons, which travel at about 500 m/s. If you are moving away from the sources of the scattering you can avoid these but you have to be moving relatively fast that they are always at your backside not coming in from the side. \u003C/span\u003E\n\u003C/p\u003E\n\u003Ch3\u003E\n\u003Cspan\u003EMagnetic scattering\u003C/span\u003E\n\u003C/h3\u003E\n\u003Cp\u003E\nThe neutron has a net electric charge of zero, but has a significant \u003Ca href=\u0022https://en.wikipedia.org/wiki/Neutron_magnetic_moment\u0022 title=\u0022Neutron magnetic moment\u0022 rel=\u0022external nofollow\u0022\u003Emagnetic moment\u003C/a\u003E, although only about 0.1% of that of the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Electron\u0022 title=\u0022Electron\u0022 rel=\u0022external nofollow\u0022\u003Eelectron\u003C/a\u003E. Nevertheless, it is large enough to scatter from local magnetic fields inside condensed matter, providing a weakly interacting and hence penetrating probe of ordered magnetic structures and electron spin fluctuations.\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Neutron_scattering#cite_note-Zaliznyak-2\u0022 rel=\u0022external nofollow\u0022\u003E[2]\u003C/a\u003E\u003C/sup\u003E\u003C/p\u003E\n\u003Cp\u003E\nNeutrons can also be scattered by magnetic fields such as those found in solar flares, and can be scattered back to the ship.\u003Cbr\u003E\nMy point is that as a ship propels itself forward it propels its ejecta backwards (this does not preclude neutrons, but it influences their motion and the interactions of the ship with phenomena outside the ship) and itself forward, in the time that neutrons are traveling behind the shield relative to a neutron and a point on the side of the capsule, the capsule is protected. If the neutron is far enough away from the capsule at the time it is scattered, then the probability of it hitting the capsule is low. But if the ship is drifting in space, neutrons come of with a variety of speeds from fast neutrons that can be scattered by rapidly moving particles to slow thermal neutrons that can be scattered by magnetic phenomena, and the neutrons can end up on the other side of the shield.\n\u003C/p\u003E\n"}]}