{"TopicId":144081,"ForumId":44,"TopicTitle":"Darpa commissions a space launching plane","CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-07-18T17:48:17Z","PageNum":1,"Articles":[{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-07-18T17:48:17Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.nasaspaceflight.com/2016/07/darpa-pushing-experimental-spaceplane-xs-1/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.nasaspaceflight.com/2016/07/darpa-pushing-experimental-spaceplane-xs-1/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNot sure if this has anything to do with the recent \u0022DSTO\u0022 SABRE plan.  Initial goals are for staging at mach 2, with a goal of staging at mach 10.  I\u0027m strongly suspecting a \u0022me too\u0022 plan that will only pay for powerpoint slides.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that Lockheed\u0027s M-21 staged at similar levels, and included at least one fatality (the plan says \u0022traveling at mach 3, staging at mach 2\u0022, but presumably the SR-71 could fly whatever flight plan this could, and do some sort of \u0022parabolic travel into thinner atmosphere\u0022 to launch, if necessary).\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022mach 10\u0022 snippet implies skipping SABRE and going straight to the X-43\u0027s SCRAMJETS.  Note that the X-43 was nearly all solid rocket booster (staged before the X-43 took off), so it would take some impressive development to carry something to get to mach 4, the X-43 engines themselves, and then \u0026gt;900lbs of cargo (I\u0027m not sure the X-43 weighed 900lbs empty).\n\u003C/p\u003E\n\u003Cp\u003E\nI can only imagine what the Stratolaunch backers feel about this.  Apparently the DoD feels it can thumb its nose at them with impunity (or really is only planning on buying some expensive powerpoint slides).\n\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2016-07-18T17:58:56Z","Content":"\n\u003Cp\u003E\nThe requirement doesn\u0027t actually specify a need for some kind of aircraft, that\u0027s just the programme name; it\u0027s really a reusable booster programme. Also, the velocity requirement has been cut to Mach three for the next stage of the programme, as long as it can still meet the payload, cost, and crucially reusability requirements. \n\u003C/p\u003E\n\u003Cp\u003E\nAir-breathing engines would not be needed to meet these requirements, and none of the proposals that are publicly known include them.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-07-18T22:00:21Z","Content":"\n\u003Cp\u003E\nThis sounds like a bunch of optimistic hand waving.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOK you make an SR71 backbird at 10X scale. Modify it so that it can fly at 100,000 feet (20 miles) up and Mach 5. (3200 MPH) what have you obtained. You still have 15000 MPH of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E required for orbit and another 200,000 feet to climb to orbit. Sure you save on fuel, but the technology cost per unit is atrocious. (all of these numbers are outrageously optimistic, you would need a serious afterburner with O2 feed to get up to 100,000 feet and Mach 5 would require serious aerodynamic considerations).\n\u003C/p\u003E\n\u003Cp\u003E\nLets talk about the calving problem, eventually you have to release the orbital ascent vehicle, you are at 100,000 feet true atmosphere is at 1:100th or so surface atmosphere, but you are at Mach 5 and the recyclable and vehicle will have serious issues as they separate.\n\u003C/p\u003E\n\u003Cp\u003E\nSuppose we get to 80,000 feet, turn to 45 pitch and then rocket to say 300,000 meters and release. Right, no problem you release payload, but now the cycling craft is going to come back in, no retrorockets and aerodynamic as hell, and dead engines. Next is has to restart its engines and then find a way to slow down.\n\u003C/p\u003E\n\u003Cp\u003E\nLets talk about some problems with SR71, could not take off with a full load of fuel, had to be refueled in flight. Not particularly great climb engines. Gear could not sustain landing many failures.\n\u003C/p\u003E\n\u003Cp\u003E\n\u002B since you are not going around the world you can replace the fuel with payload.\u003Cbr\u003E\n- but you will also need payload for burners to achieve hideous altitudes, plus the weight of burners.\u003Cbr\u003E\n- still need retros to reduce the cavitation potential on reentry.\u003Cbr\u003E\n- payloads need a launch frame, this could be contained within the cargo bay of the cycler, but that has aerodynamic implications, because of the extreme speeds of low altitude SSTs (typically breaking Mach 1 below 20k feet). This will lessen the crosssectional area that can be fit into the cargo area.\u003Cbr\u003E\n\u002B but because the payload itself does not need to survive Max Q cost spent on nose cone and fairing can be removed.\u003Cbr\u003E\n\u002B means the payload will conform to sears-haack body\u003Cbr\u003E\n- since most of the flight vector is horizontal the entire structure is subject to much more drag, for a much longer period of time.\u003Cbr\u003E\n\u002B but because this is jet thrust versus \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E thrust the mass efficiency is much greater (unlike falcon 9 however, most of the weight is coming back to earth, thereforecost).\u003Cbr\u003E\n- but that has to be weighed against the fact you have only obtained a minimal orbital altitude, and nowhere the velocity to reach orbit. That means the payload need to carry 14000 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E of fuel (at the equator) required to reach orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nAll in all, F9 is the answer they are looking for.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-07-19T01:49:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222681682\u0022 data-ipsquote-contentid=\u0022144081\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468879221\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis sounds like a bunch of optimistic hand waving.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOK you make an SR71 backbird at 10X scale. Modify it so that it can fly at 100,000 feet (20 miles) up and Mach 5. (3200 MPH) what have you obtained. You still have 15000 MPH of \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E required for orbit and another 200,000 feet to climb to orbit. Sure you save on fuel, but the technology cost per unit is atrocious.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFrom what I\u0027ve heard JP-7 is sufficiently expensive to eat up any fuel savings (best quote was that it was similar in price to a \u0022fine scotch\u0022).  Not sure if they have to refill with JP-7 on the immediate fill up after launch.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the question comes down to any microsat launcher willing to build a micro-falcon (or similar lander) and operate it for $5M a pop (and get 10 launches in a row).  Coming down from a mach 2 stage ought to be far easier than what spacex does.\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder if blue origin is interested.  $50M for ten flights without having to risk passengers might be clearly worth it.\n\u003C/p\u003E\n"},{"CreatedByName":"Emperor of the Titan Squid","CreatedById":158183,"CreatedDateTime":"2016-07-20T20:20:26Z","Content":"\n\u003Cp\u003E\nThey still ought to try.\n\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2016-07-20T21:59:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222681682\u0022 data-ipsquote-contentid=\u0022144081\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468879221\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/18/2016 at 11:00 PM, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis sounds like a bunch of optimistic hand waving.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd this sounds like you made zero effort to even read the article. Again, there\u0027s no requirement for this thing to be air-breathing or to have wings. The only thing stopping F9 S1 being a viable programme entrant is the recycle time for reuse, and all of the known competitors are using conventional rocket propulsion and vertical take-off.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222681950\u0022 data-ipsquote-contentid=\u0022144081\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468892988\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/19/2016 at 2:49 AM, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI wonder if blue origin is interested.  $50M for ten flights without having to risk passengers might be clearly worth it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNew Shepard is too small if that\u0027s what you\u0027re thinking, but they wouldn\u0027t have to scale up much to meet the minimum requirement. But, we know that\u0027s not what they\u0027re doing; blue\u0027s entry, in partnership with Boeing, is a VTHL stubby-winged flyback booster, probably with Be-3 engines. The other two phase 1 competitors were Northrop Grumman/Virgin Galactic, with unknown engine (VG\u0027s kerolox GG engines probably aren\u0027t suitable for turnaround this rapid), and Masten space systems with a VTVL system with a new  methalox duel-expander cycle engine.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-07-21T08:22:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222681682\u0022 data-ipsquote-contentid=\u0022144081\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468879221\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/19/2016 at 0:00 AM, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLets talk about some problems with SR71, could not take off with a full load of fuel, had to be refueled in flight. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think the issue was that it couldn\u0027t take off with a full fuel load... but that it leaked when on the ground, because it was designed to accomodate thermal expansion, so you\u0027d want to fuel it up right before it begins its supercruise... ie when its already in the air flying close to mach 1 at 30,000 feet, where a tanker can fuel it up.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-07-21T14:58:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222684736\u0022 data-ipsquote-contentid=\u0022144081\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221469051982\u0022 data-ipsquote-userid=\u0022348\u0022 data-ipsquote-username=\u0022Kryten\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Kryten said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd this sounds like you made zero effort to even read the article. Again, there\u0027s no requirement for this thing to be air-breathing or to have wings. The only thing stopping F9 S1 being a viable programme entrant is the recycle time for reuse, and all of the known competitors are using conventional rocket propulsion and vertical take-off.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m responding to what has been said in this thread, not DARPA, I generally do not respond to handwaving proposal, otherwise I would have presented a thread on this myself. There is only so much Mars One and like stuff on the net one can intelligently deal with, the rest is psuedoscience and quasi-engineering. If people want to SERIOUSLY discuss means to get into space and recycle equipment, alot has been done by independent organizations, they should start from that and leave the handwaving arguments to sci.fi. As far as I am concerned there is no way to get to a \u0027few day\u0027 turn around cycles without going through SX or BO route . . . . . Start by doing what you have a reasonably good success of completing and make improvements. Thats how the Prius became the first really viable venture into electric car technology. Its not fully electric but those vehicles are not cost effective. Get the point. Improve on what works, don\u0027t handwave and guess.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}