{"TopicId":144431,"ForumId":44,"TopicTitle":"Looking for advice on using gravity assisted capture","CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2016-07-24T02:54:39Z","PageNum":1,"Articles":[{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2016-07-24T02:54:39Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to minimize the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E required for a return from Eeloo - not sure if this query should be somewhere else, but the principal is real world orbital science.\n\u003C/p\u003E\n\u003Cp\u003E\nI can easily setup a cheap Eeloo - Jool - Kerbin \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E trajectory. Then I\u0027d been using Kerbin to gravity assist drop the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E \u0026amp; \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E, and tuning it to give a resonant orbit with another Kerbin encounter in the future. The braking encounter also cranks the orbit outward (radial out \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E?), with the \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E drop this makes the next encounter angle a little more radial out. I could drop my Kerbin capture burn from 2200 to 1600 m/s - but it feels like \u0027I\u0027m doing it wrong\u0027 / \u0027I want more\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nJust from the luck of my Jool-Kerbin\u0027s orbit with \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E below Kerbin \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E my first Kerbin encounter was post \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E and so already not pre-retro aligned, and I just went with it. Seems like I could:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\ntake care to make Jool-Kerbin hit Kerbin \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E (and rely on timing to make this a Kerbin encounter / tune one from the \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E)\n\u003C/li\u003E\n\u003Cli\u003E\ngravity assist brake into a resonant orbit with lower \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E and lower \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E and radial out cranked\n\u003C/li\u003E\n\u003Cli\u003E\ndo some deep space maneuver to raise \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E back to Kerbin \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E and thus encounter Kerbin earlier in it\u0027s orbit where the radial twist will cancel out (might have to setup the braking encounter and dsm nodes together (but GUI might not show me two encounters with Kerbin at once? mode / focus?)) \n\u003C/li\u003E\n\u003Cli\u003E\nrepeat\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nIs that plan misguided?\n\u003C/p\u003E\n\u003Cp\u003E\nIs it practical to carry out?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyone have any idea what magnitude of final Kerbin capture burn I could achieve?\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe there is a bit thread somewhere talking about this? (I searched around a bit and couldn\u0027t find anything that goes into it deep enough)\n\u003C/p\u003E\n\u003Cp\u003E\nThanks in advance for any advice, ideas, or information you have.\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-07-24T09:30:45Z","Content":"\n\u003Cp\u003E\nLook up the profile for Rosetta Mission and do that in reverse. Their first boost was a self-assist from Earth using only a slightly eccentric orbit. That gives you very little delta-E, but significant delta-L, which gives you an orbit with \u003Cabbr title=\u0022Periapsis\u0022\u003E\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E\u003C/abbr\u003E bellow Earth and \u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E\u003C/abbr\u003E above, giving you opportunity for boost with Venus or Mars. I don\u0027t recall which one the mission actually went with, but both are viable.\n\u003C/p\u003E\n\u003Cp\u003E\nRunning this in reverse in KSP, you could use a gravity assist from Duna to bring you to a highly elliptical orbit that crosses Kerbin\u0027s path. You are looking for something with semi-major axis roughly that of Kerbin\u0027s own orbit. Use assist at Kerbin to bring you to a nearly circular orbit that intersects with Kerbin again almost exactly a year later. You can bring your \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E down to a few hundred m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nPlanning this is not easy, though. I don\u0027t know if you can do that with tools that KSP provides you. I\u0027d put simulation of the Kerbin system into something a bit more sophisticated, and crunch out the numbers in advance.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-24T09:31:55Z\u0022 title=\u002207/24/2016 09:31  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 24, 2016\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DBowman","CreatedById":122106,"CreatedDateTime":"2016-07-25T06:22:18Z","Content":"\n\u003Cp\u003E\nI could reduce a typical alex moon Eeloo-Kerbin from 3500 m/s to about 1370 m/s - so you can save a lot going \u0027the long way round\u0027. \n\u003C/p\u003E\n\u003Cp\u003E\nI tried my plan in the \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E. The initial Jool encounter (spent 440 m/s \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/104158-plad/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022104158\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/104158-plad/\u0022 rel=\u0022\u0022\u003E@PLAD\u003C/a\u003E fly-by-finder says should be able to do for 260) could get a capture for around 2200 m/s. I could get 2 Kerbin passes for 250m/s resulting in a 1380 m/s capture - I din\u0027t take that one. Then I spent 340 to set up a 340 m/s capture - I didn\u0027t take that one. Spent 320 to get the next with \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E at Kerbin and \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E below, 200 m/s to tweak up an encounter with 158 m/s capture. Something is a little off in my note taking because by mechjeb I spent 1000 m/s from Jool encounter to Kerbin highly eccentric, but if I add up the numbers I wrote down it\u0027s 1200-ish - maybe I double counted something. Also if I\u0027d taken the 340 capture it would have cost 930 m/s all up\n\u003C/p\u003E\n\u003Cp\u003E\nI made a cheat-sheet of resonant orbit periods and then eyeballed the \u002B/- Kerbin days due to the radial cranking by the encounter. I had to tune/tweak after the Kerbin encounter cause I couldn\u0027t get it to show two encounters on Kerbin. Also it\u0027s easy to let the encounters add \u002B/- normal without you noticing... It would be nice (for this task) if the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E/\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E rollover showed you the period also.\n\u003C/p\u003E\n"}]}