{"TopicId":145502,"ForumId":44,"TopicTitle":"My Exoplanet Discoveries [Formerly \u0026quot;KIC 7848638 - My First Solar System\u0026quot;]","CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-06T18:44:45Z","PageNum":1,"Articles":[{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-06T18:44:45Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:48px;\u0022\u003E\u003Cb\u003E\u003Cu\u003EBACKGROUND\u003C/u\u003E\u003C/b\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhile going through light curves on Planet Hunters on Tuesday, August 2nd, 2016, I found a set of data with something interesting. There was a dip in the light of this star (called \u003Cstrong\u003EKIC 7848638\u003C/strong\u003E) that happened on a very regular basis and barely changed at all, even with the stellar noise in the data. The sheer precision of the dips made me believe this was an exoplanet. \n\u003C/p\u003E\n\u003Cp\u003E\nI was the first person on Planet Hunters to notice any kind of transit in this data set, especially since it was new - only arriving to the site a few months ago. This new planet candidate was given a nickname: \u003Cstrong\u003EChantico\u003C/strong\u003E, after the Aztec deity of volcanoes and fire. I named the star \u003Cstrong\u003EKoyash\u003C/strong\u003E, which was a name I had reserved for a late K-type dwarf star (spectral type K4 to K0). The radius of Chantico was later calculated to be 0.895 Earth radii with an error of 0.09 Earth radii.\n\u003C/p\u003E\n\u003Cp\u003E\nOn Saturday, August 6th, I decided to go look through every single light curve of Koyash to see if I could spot the transits of Chantico in other sets of data. Turns out, I did! I also managed to pick out FOUR MORE CANDIDATES in the process. I was also able to, using serious math, prove the likelihood of the outermost planet having a moon. For months I had these candidates - named Chantico, Montu, Sethlans, Kupole, Apeliotes, and the moon Vajra - and many more which were being found. \n\u003C/p\u003E\n\u003Cp\u003E\nBy the end of 2016, I had been searching more and more for candidates and improved my planet-finding skills. However, I now had 34 candidates under my belt (many that I didn\u0027t reveal to the forums) and no professional scientist knew about them. So I finally sent an E-Mail to Debra Fisher, the exoplanet scientist at Yale University who founded Planet Hunters and was one of the many discoverers of HD 209458 b, also known as Osiris. I provided her with a large sheet of data regarding each system, planet, and star. About a week later she responded, finding my results very promising and forwarded the data over to graduate student Joseph Schmitt. \n\u003C/p\u003E\n\u003Cp\u003E\nStarting in the first few days of January 2017, Joseph began to analyze the data. I had to provide him with the specific dates of the planet transits for him to be able to see whether anything was there or not. On January 9th, 2017, the results came in. It was both disappointing yet interesting, as many of the 31 planets I reported were actually false positives. That included the potentially habitable worlds of Kupole, Feronia, Zemyna, and Kharybdis, along with the possible moons Vajra and Goliath-B. But the interesting part was that the fourth planet of the third system, KIC 7105665.04, seemed promising and could be a legitimate candidate. I then had to find the five MOST PROMISING planet possibilities to report to Joseph for further analysis.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I went on the search! Using some new transit identifying methods and the \u003Cstrong\u003EMikulski Archive for Space Telescopes (MAST)\u003C/strong\u003E to double-check my results, I went through a few of my systems to try and find anything else of interest. At the same time I went back to Planet Hunters to find the most promising transit events I could stumble across. Over 4 days I accumulated at least 40 transit possibilities for double-checking with MAST, and weeded out a few dozen false positives. What were left were 5 very promising candidates. However, later analysis only left one candidate left, the still-ambiguous KIC 8363450.01. Planet candidate KIC 7105665.04 (Septentrio) was left as well.\n\u003C/p\u003E\n\u003Cp\u003E\nI sent the new data over to Joseph. It was analyzed around February 2nd, 2017, and was sent over to Daryll LaCourse. It left KIC 7105665.04 in its dubious position, debunked KIC 6446029.01 and KIC 6312596.01, and kept KIC 8363450.01 undetermined. Daryll has suggested I inquire the developed of IcTools, a Kepler data analysis program, for use of the program for my studies. I did, and got the program. For the last month I\u0027ve been going through data of KIC and EPIC stars, looking for possible planets. In mid February, I found what I thought were two sub-Neptune sized planets orbiting the red dwarf EPIC 201377614.\n\u003C/p\u003E\n\u003Cp\u003E\nMore analysis turned up a few more possible planets - even what \u003Cem\u003Emight \u003C/em\u003Ebe a world orbiting an ultracool dwarf star. But when I went back to analyze them on March 13th, 2017, it looked like they were false positives. I had neglected the transit duration time, and it turns out that it was TOO LONG or too short for the candidates I thought I found. But that didn\u0027t stop me. I went deep into K2 Campaign 0 data and found more interesting signals. The more I looked, the more promising candidate transits I found. I even looked in Campaign 9 and found some more. Overall, I\u0027ve recorded around a dozen stars in both campaigns with possible transits, and they\u0027ve all been reported on the Planet Hunters chat page. After a while I turned to looking for transit variations of long-period exoplanets in the search for companion planets or even exomoons. I investigated Kepler-452b, 62e, 62f, 90h, and 409b, with the final two having incredibly interesting TTVs and TDVs. I found Kepler-409b to warrant more investigation, and recently I sent Kepler scientist David Kipping an E-Mail and set of data describing what I have found. Who knows what the data may reveal...\n\u003C/p\u003E\n\u003Cp\u003E\nI continued with K2 data analysis before finding something interesting: The site known as \u003Ca href=\u0022https://www.zooniverse.org/projects/ianc2/exoplanet-explorers\u0022 rel=\u0022external nofollow\u0022\u003EExoplanet Explorers\u003C/a\u003E. It\u0027s like the successor to Planet Hunters, chock full of K2 data in a much better format than on PH. All stellar data has gone through some processing to point out the likeliest transit events per set of data. While quite a lot of these are not transits, it\u0027s easier to analyze than Planet Hunters data. The site, while recent, has been seeing an explosion of activity. In just 2 days a four-planet system known as EE-1 was found. Things were slow at first, but in April 2017, me and the EE user Emberfire found what appeared to be a potentially habitable planet around the red dwarf EPIC 212525618. The planet candidate was nicknamed Iona, and the discovery led to me starting up the Red Dwarf Candidate Search. For months, me and several other citizen scientists - Vidar87, shutcheon, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/176924-cabbink/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022176924\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/176924-cabbink/\u0022 rel=\u0022\u0022\u003E@Cabbink\u003C/a\u003E, Libmar96, and more - scoured the provided data on EE to find dozens of possible candidates, with a good amount of much more likely candidate worlds. By summer of 2017, Exoplanet Explorers began to suffer an error where there were too many simulated transits and made it impossible to find any real planets on the site. This led me, Vidar, and shutcheon to do our searches entirely with LcViewer, while Libmar96 uses his own telescope to detect transits of candidate worlds already found by our group. Since April and May, we have found dozens of planets that are incredibly likely to be real, some potentially life supporting. Since December 2017, I\u0027ve been doing my own analyses of K2 Campaigns 14, 15, and (currently) 16. In total, I\u0027ve found a total of over 350 planet candidates, with over a dozen having been independently confirmed by other teams of scientists.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:48px;\u0022\u003EMY PLANET CANDIDATES\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EEPIC 220221272 System\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EEPIC 220221272 (Dagr)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.3469 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.3611 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 3453 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.01535 L\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: M3V\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Pisces\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 8\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: EPIC 220221272 is a small red dwarf star with a very compact system of five planets. The inner four are Earth to Super-Earth sized and likely rocky, but too hot for life. The fifth planet dwarfs all the others at over twice the size of Earth. This structure of four small planets inside the orbit of a a large temperate/warm Mini-Neptune is completely unique among red dwarf solar systems and indicates they all formed further out before migrating inwards. The four smaller worlds may have formed with water layers comprising 5-15% of their total masses. Planet b has likely completely lost its small water envelope due to tidal heating, stellar flares, and its small size and low gravity. Planets c, d, and e likely retained at least part of their water layers, with c having only a modest steam atmosphere left, but the other two managing to hold onto much thicker atmospheres. Planet d probably has a thick water vapor and carbon dioxide atmosphere with a powerful greenhouse effect, but planet e could be even worse, with an even thicker atmosphere and a more powerful runaway greenhouse effect. Planet f, once thought to straddle the inner edge of the habitable zone, turns out to be a warm Mini-Neptune with an average temperature of over 100 degrees Fahrenheit and likely retaining a significant water envelope (40-60% of its mass). However, the uncertainties in the stellar parameters are rather high, meaning that it\u0027s quite difficult to determine what these worlds are exactly like until better data is available. There also might be a sixth temperate, Earth-sized planet in a 3:2 resonance with planet f, but this is hard to confirm.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cimg alt=\u0022U5kY4G3.png\u0022 class=\u0022ipsImage\u0022 height=\u0022325\u0022 src=\u0022https://i.imgur.com/U5kY4G3.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E220221272 b (Vidar)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wPkYZfa.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/wPkYZfa.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.97 (±0.22) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 2.235 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.02383 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 581 K (586\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 27.031x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Vidar is an Earth-sized rocky planet closely orbiting its host star. Such proximity to billions of years of intense stellar flares have likely destroyed this world\u0027s original water content, but left a bit of an atmosphere left.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E220221272 c (Hermodr)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KHNcwCb.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/KHNcwCb.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.27 (±0.32) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 4.1937 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.03626 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 471 K (388\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 11.67x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Unlike Vidar, Hermodr has likely retained more of its original water content due to its lower irradiation and larger size. Its steam atmosphere is probably close to the thickness of Earth\u0027s and may provide a modest greenhouse effect.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E220221272 d (Gerth)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bOLaMZS.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/bOLaMZS.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.47 (±0.23) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 6.6796 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.04945 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 403 K (266\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 6.28x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The second-largest planet in the system, Gerth might have the right conditions -- large size and significant enough tidal forces -- to become the most volcanically active world around EPIC 220221272. It probably hosts a thick atmosphere of carbon dioxide and other volcanic gases, mixed with the steam left over from its original water content. However, stellar flares have probably kept this atmosphere from getting too big, and as a result it may not have a Venus-level runaway greenhouse effect, but the surface temperature is easily over 600-650 K. It has a similar irradiation to TRAPPIST-1b.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E220221272 e (Muspell)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lNY1e7l.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/lNY1e7l.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.33 (±0.27) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 9.718 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.06350 days\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 356 K (181\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 3.81x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Muspell is a likely Venus analogue, with a radius and insolation only slightly higher than our system\u0027s Venus. It likely migrated inwards with significant amounts of water, which would\u0027ve evaporated to form a crushing runaway greenhouse atmosphere, combined with the volcanic gases emitted by intense geologic activity. Like Gerth, Muspell is likely subjected to powerful tidal heating -- mainly provided by the nearby massive Freyr -- that would result in rampant volcanoes and plate tectonics. Its greenhouse effect might be so bad that parts of the surface could be molten. It was nicknamed after the Norse realm of fire by Vidar87, who first discovered this planet.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003E220221272 f (Freyr)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ggTSPVE.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/ggTSPVE.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 2.39 (±0.21) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 13.625 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.07954 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 318 K (113\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 2.40x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Freyr is a Mini-Neptune sized planet, possibly an ocean world, located within the system\u0027s Venus Zone. Because of its size, it has likely kept a significant water layer of about 40-60% of its total mass. Some of this has likely evaporated into a thick, cloudy, sauna-like atmosphere, while the rest would form a global ocean many miles deep above an Ice-VII mantle. Even though water could be liquid on the \u0022surface\u0022, this is an unconfirmed and dubious possibility, and the planet is likely too hot for most life to survive.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E220221272 g (Ithunn)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u00228CVK4cx.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/8CVK4cx.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.95 (±0.14) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 20.7846 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.1054 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 276 K (37\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 1.38x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: This is an unconfirmed and rather dubious planet candidate in a 3:2 resonance with Freyr. It orbits in the optimistic habitable zone with a stellar flux comparable to that of Ross 128b. However, despite its not-so-optimal position, if it does exist, it likely has a global ocean and a day-side storm system. The ocean would help distribute heat around, and the storm system would reflect light on the star-facing side and help cool the planet a bit. This could allow for Ithunn to maintain  a stable and balmy climate, potentially conductive to life. That sounds great, but since this is in no way a confirmed planet, don\u0027t get your hopes up.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-187 System\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-187 (Astria)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.92 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.98 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 5484 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.68684 L\n\u003C/li\u003E\n\u003Cli\u003E\nMetallicity: \u002B0.23 [Fe/H]\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: G\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Cancer\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 4\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The Sun-like star K2-187 has four confirmed planets; K2-187b and e were found by me, K2-187c was found by shutcheon, and K2-187d was first reported as a planet candidate all the way back in 2016. Its structure is very similar to the Campaign 15 systems EPIC 246061904 and EPIC 246471941 (the latter was confirmed in August 2018). K2-187b is one of the most hostile planets I\u0027ve ever found, with an average temperature hot enough to melt iron and a dayside temperature of over 3,000\u003Csup\u003Eo\u003C/sup\u003EF. All the planets likely migrated to their current locations, which means K2-187b and c were likely larger until increasing stellar radiation blew off their volatile envelopes. While K2-187b is likely a barren, molten rock, K2-187c has likely retained a thick atmosphere, likely made of steam and methane. K2-187d is a typical Hot Neptune that is almost identical to EPIC 246061904d and EPIC 246471941c, while K2-187e is a little understood planet on the transition from a water-rich to a gas-rich world.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003EK2-187b (Rhoeo)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022mJ8sEXj.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/mJ8sEXj.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.30 (±0.13) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 0.77392 days (18.57 hours)\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.01639 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 81.93\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 1,812 K (2,802\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nDayside Temperature: \u0026gt;2,100 K (3,320\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 2,556.804x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The hellish Super-Earth Rhoeo is one of the shortest-period planets I\u0027ve found, taking about 18.6 hours to complete a single orbit. Its average temperature is around or above the melting point of iron, and enormous tidal forces from the three other planets have likely turned this into a volanic hell. Its actual surface temperature is likely around 2,000 to 2,300 K -- so hot that a rock vapor atmosphere would start to form. It may also rain rocks and lava in some of the \u0022cooler\u0022 parts of the planet, mainly the night side.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003EK2-187c (Chyone)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022mWtBSqb.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/mWtBSqb.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.80 (±0.14) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 2.872042 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.03930 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 86.07\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 1,173 K (1,652\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 444.70x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Chyone is a Super-Earth above the 1.6 Earth radius transition between rocky and gaseous worlds. However, it could still be a terrestrial planet with a thick steam atmosphere. It likely formed further out and migrated inwards, which would have made it somewhat difficult for a hydrogen envelope to accumulate. Also, with an insolation almost 450 times that of Earth, Chyone is prone to rather significant atmospheric loss, which may have helped degrade its volatile layer a bit.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003EK2-187d (Hemithea)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022qcoBhY1.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/qcoBhY1.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 3.17 (±0.18) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 7.149210 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.07217 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 87.48\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 865 K (1,097\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 131.87x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Hemithea is a pretty standard Hot Neptune. However, what sets it apart from most is how it\u0027s in the middle of a compact planetary system, and is the largest of all its planetary siblings. The only system with such a planet and setup is EPIC 246061904, which is a near-twin of K2-187. Hemithea may look pink or purple due to a methane haze.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003EK2-187e (Erethusa)\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022YOMFFyl.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/YOMFFyl.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 2.38 (±0.18) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 13.609878 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.11086 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 88.97\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 698 K (797\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 55.886x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The Mini-Neptune Erethusa is a potential \u0022Ice-VII Planet\u0022, a world with a layer of water crushed into a solid surface by a thick atmosphere. It likely has a steam and methane atmosphere above its compressed surface. However, it could also be a gas-rich world instead.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149 System\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.568 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.595 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 3745 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.049 L\n\u003C/li\u003E\n\u003Cli\u003E\nMetallicity: \u002B0.11 [Fe/H]\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: M1.0V\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Pisces\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 8\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The large red dwarf star K2-149 has a single planet confirmed by Hirano et al in October 2017. However, just days after that paper was published, me, shutcheon, and Vidar87 on Exoplanet Explorers found that there were many more planets not accounted for. At the time of my most recent analysis in December 2018, there are a total of seven planets, all of which are Super-Earths. The first two are practically identical and both likely have thick steam atmospheres above rocky surfaces. The third, K2-149d, is the only one that is likely a Mini-Neptune with a volatile layer too thick for the surface to be accessible. K2-149e also likely has a composition similar to K2-149b and c, but its position in the Venus Zone makes it uncertain whether this is a Super-Venus or a steamy sauna-like world. K2-149f is a great potentially habitable ocean world candidate, and probably hasn\u0027t become a Super-Venus due to the likelihood of a day side storm system. K2-149g is both the smallest, coolest, and most promising planet of the system, being a potentially rocky large Super-Earth right in the middle of the conservative habitable zone. Finally, the recently discovered K2-149h appears to be a long-period, large ice planet beyond the habitable zone. Despite having six of its planets crammed in within the orbit of Mercury, K2-149 is one of the most \u0022spread-out\u0022 solar systems I\u0027ve found; the entire TRAPPIST-1 or EPIC 220221272 system could perfectly fit within the orbit of K2-149b.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149b\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022TZY4QlG.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/TZY4QlG.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.76 (±0.17) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 11.336890 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.08311 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 416 K (289\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 7.093x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The only planet so far to be confirmed in this system, K2-149b is a warm Super-Earth that likely hosts a thick water vapor atmosphere above a rocky surface. My most recent analysis suggests it could be a hellish Super-Venus with a suffocating steam atmosphere that\u0027s even thicker than initially thought.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149c\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022XVDuaNB.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/XVDuaNB.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.67 (±0.17) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 16.367583 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.10616 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 368 K (203\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 4.348x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-149c is nearly identical to K2-149e in terms of its radius, orbit, and temperature. It also likely has a very similar composition, with a water/steam layer comprising no more than 5-10% of its total mass.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149d\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222uKTo7g.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/2uKTo7g.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.81 (±0.18) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 21.393049 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.12691 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 336 K (145\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 3.042x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-149d, once thought to be a Mini-Neptune, is probably more similar in composition to the other planets. It probably has a volatile layer dominated by a water shell taking up ~20% of its mass, with an atmosphere containing significant amounts of methane.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149e\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u00222LNqwwa.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/2LNqwwa.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.69 (±0.17) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 28.750066 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.15455 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 305 K (89\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 2.051x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Very similar in size to K2-149c, K2-149e probably formed further out with a thicker water layer before migrating inwards with the rest of the planets. This would\u0027ve resulted in the formation of a thick, runaway greenhouse atmosphere, as it gets an almost identical amount of sunlight as Venus. This greenhouse effect might be so bad that parts of the surface could be molten.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149f (Pherusa)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022HxIeQQW.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/HxIeQQW.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.61 (±0.15) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 37.226523 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.18360 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 280 K (44\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 1.454x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-149f has a very similar radius, orbit, and temperature as the potentially habitable planet Kepler-296 Ae. It is about 61% larger than Earth and gets 45% more sunlight, too much for it to be in the conservative habitable zone, but with a large front side storm system and efficient heat distribution, it can easily resist a runaway greenhouse effect. K2-149f is a great example of a potentially life-friendly temperate ocean planet candidate, and probably has surface temperatures comparable to the tropical rain forests and equatorial regions on Earth.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149g (Dynamene)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Npsfn3k.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/Npsfn3k.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.47 (±0.15) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 69.743461 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.27903 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 227 K (-51\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 0.629x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Despite being the most dubious of the six planets, K2-149g is by far the most promising for life. Its 70-day orbit places it right within the conservative habitable zone, as it gets about two-thirds the amount of sunlight Earth does, comparable to planets like TRAPPIST-1e and Proxima b. However, it is much larger at 47% bigger than Earth. This is below the 1.6 Earth radius transition limit where Super-Earth sized planets start accumulating thick water and gas layers, so K2-149g could have a rocky surface with thin oceans and continents.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-149h\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gKKzoBw.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/gKKzoBw.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.73 (\u003Cspan style=\u0022background-color:#f8f9fa;color:#222222;font-size:14px;text-align:center;\u0022\u003E±\u003C/span\u003E0.17) \n\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: ~174.524 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-Major Axis: ~0.5143 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 167 K (-159\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 0.185x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-149h, found a year after the other six planets, is a candidate long-period Super-Earth orbiting out beyond the habitable zone. It likely has a water layer that\u0027s completely frozen due to the cold temperatures, and is one of only a few ice planet candidates I\u0027ve found.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 System\u003C/span\u003E\u003C/strong\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 A (Uryen)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.703 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.686 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 4285 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.1502 L\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: K\n\u003C/li\u003E\n\u003Cli\u003E\nAge: 8.0 billion years\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Leo\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 14\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: This is easily one of the weirdest systems I\u0027ve ever studied. Also designated EPIC 248435473, this small orange dwarf has an oddly structured system of six planets ranging in size from a little larger than Mars to the mass of Uranus. The innermost is a grazing Hot Neptune orbiting every 16 hours with an orbit tilted over 10 degrees from the plane of the other planets. No other exoplanet like this has been found, and because of the high error bars for its radius, it\u0027s hard to tell exactly what kind of world this is. The next two planets, K2-266 A.02 and K2-266 Ac, are between the size of Earth and Mars and orbit almost right on top of each other in a close 4:3 orbital resonance. Past those two are a pair of dense Mini-Neptunes, also in a 4:3 resonance. Unlike most other planets of their radii, these two are dense enough to either have a very thin hydrogen layer or none at all, and instead would have a mixed water-rock composition. In an even further out orbit is the pecuilar K2-266 A.06, around the size of Venus with an unusually eccentric orbit taking it in and out of the habitable zone. Over its 56-day year, it suffers significant temperature variations from below freezing to over 200 degrees Fahrenheit. \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 Ab (Gavida)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u002262Mflcs.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/62Mflcs.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 3.3 (\u003Csup\u003E\u002B1.8\u003C/sup\u003E\u003Csub\u003E-1.3\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 0.658524 days (15.80 hours)\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.01307 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 76.48\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 1,387 K (2,037\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 875.09x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Gavida is a poorly understood USP (Ultra Short Period) planet and potential COSSN (Closely Orbiting Scorched Sub-Neptune). Unlike all the other planets around K2-266 A, its orbit is misaligned by over ten degrees, meaning it only partially transits its star. This means it\u0027s difficult to accurately determine how large the planet is; it could be anything from a Super-Earth about twice the size of our home world, or a scorched ice giant larger than Neptune. Regardless of how big it is, its short orbital period and the brightness of the host star make Gavida an excellent target for radial velocity analysis. In addition, further studies could better determine its radius and orbital obliquity, allowing for a precise radius (and potentially composition) estimates.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 A.02 (Lludd)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022tlgNlYN.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/tlgNlYN.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.646 (\u003Csup\u003E\u002B0.099\u003C/sup\u003E\u003Csub\u003E-0.091\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 6.1002 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.05765 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 87.84\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0.051\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 661 K (730\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 44.979x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Lludd is a tiny, desolate, rocky planet not much larger than Mars, and the smallest planet of the K2-266 system. Intense heat has likely stripped off all but a tiny sliver of its atmosphere, leaving behind something that looks like a broiling Mercury-Mars hybrid.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 Ac (Nudd)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022GKrP4gw.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/GKrP4gw.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.705 (\u003Csup\u003E\u002B0.096\u003C/sup\u003E\u003Csub\u003E-0.085\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 7.8140 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.06800 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 88.28\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0.042\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 608 K (635\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 32.33x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Nudd, while also being not too much larger than Mars, is both larger and cooler than its twin Lludd, which could allow for a slightly thicker -- but still very thin -- atmosphere. Other than that, it likely looks very similar to the latter. It is also in a close 3:4 resonance with Lludd, orbiting every 3 times for every four orbits of its twin planet.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 Ad (Manawydan)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022eq7bOGF.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/eq7bOGF.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 2.93 (\u003Csup\u003E\u002B0.14\u003C/sup\u003E\u003Csub\u003E-0.12\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 8.9 (\u003Csup\u003E\u002B5.7\u003C/sup\u003E\u003Csub\u003E-3.8\u003C/sub\u003E) M\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nDensity: 1.95 g/cm\u003Csup\u003E3\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nGravity: 1.037g\n\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 14.69700 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.1036 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 89.46\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0.047\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 493 K (428\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 13.93x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Manawydan is a rather dense Mini-Neptune orbiting in a 4:3 resonance with its sibling Ilixo. While still volatile rich, this planet is denser than both of our system\u0027s ice giants, indicating that it has significantly less hydrogen and more water, methane, and silicates. It can almost be perfectly described as a larger, cooler version of GJ 1214b. Sadly, Manawydan\u0027s mass is rather poorly established because it was determined through Transit-Timing Variations (TTVs) with Ilixo, but radial velocity studies will likely get better estimates.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 Ae (Ilixo)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022X3AcPg2.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/X3AcPg2.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 2.73 (\u003Csup\u003E\u002B0.14\u003C/sup\u003E\u003Csub\u003E-0.11\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 14.3 (\u003Csup\u003E\u002B6.4\u003C/sup\u003E\u003Csub\u003E-5.0\u003C/sub\u003E) M\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nDensity: 3.88 g/cm\u003Csup\u003E3\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nGravity: 1.919g\n\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 19.4820 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.12503 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 89.45\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0.043\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 449 K (349\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 9.563x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Despite being smaller than its sibling Manawydan, Ilixo is significantly more massive at about 14 times the mass of Earth -- equivalent to that of Uranus. It is one of the densest Mini-Neptunes yet found, which can be explained by a rocky core and a giant water mantle taking up 50-80% of the planet\u0027s mass. A thick steam atmosphere is probably present as well, but a thin hydrogen envelope cannot be ruled out. Like Manawydan, its mass has high error ranges, but more precise estimates can be achieved through radial velocity studies of the system.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 A.06 (Nantosuelta)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022cgEx07e.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/cgEx07e.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.90 (\u003Csup\u003E\u002B0.14\u003C/sup\u003E\u003Csub\u003E-0.12\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 56.682 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.2548 AU\n\u003C/li\u003E\n\u003Cli\u003E\nPeriapsis: 0.1758 AU\n\u003C/li\u003E\n\u003Cli\u003E\nApoapsis: 0.3338 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 89.40\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0.31\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 314 K (106\u003Csup\u003Eo\u003C/sup\u003EF) at SMA; 378 K (221\u003Csup\u003Eo\u003C/sup\u003EF) at periapsis; 275 K (35\u003Csup\u003Eo\u003C/sup\u003EF) at apoapsis\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 2.303x Earth (average); 4.837 (periapsis); 1.34 (apoapsis)\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Nantosuelta was the only planet around K2-266 A that wasn\u0027t found by me or any other citizen scientist. Rather, the team that confirmed the system spotted this candidate in their analysis. It has by far the most eccentric known orbit of any small habitable zone planet, with an orbit swinging from about 0.176 to 0.334 AU. This causes massive temperature variations as well; its equilibrium temperature can exceed 200 degrees Fahrenheit, but fall to around freezing. The actual temperature variations on the surface would be even more extreme. As spring wanes and summer approaches, the oceans would evaporate into a reflective but heat-trapping water vapor atmosphere, possibly raising temperatures to 400 K or above. In autumn, all this water would rain down to the surface in a global flooding event with enormous storm systems. Almost all the surface could be under water as winter arrives, with polar regions freezing over. This could cause a runaway global cooling, coating the entire planet in ice as the albedo rises. This would not be broken until spring arrives, when the ice would melt and evaporate, forming massive Category 5 equivalent cyclones, as the cycle continues.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 B (Grannus)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.649 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.581 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 3570 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.0617 L\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: M/K\n\u003C/li\u003E\n\u003Cli\u003E\nAge: 12.4 billion years\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Leo\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 14\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Originally designated EPIC 248435395, this is a surprisingly large red-orange dwarf in a binary pair with K2-266 A, with the two stars orbiting each other every ~160,000 years at a distance of over 2,500 AU. When validating the K2-266 A system, Rodriguez et al found that this star had a potential planet of its own, a Warm Saturn in a grazing 8.5-day orbit.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-266 B.01\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022wTnv5Q2.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/wTnv5Q2.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 10.6 (\u003Csup\u003E\u002B2.7\u003C/sup\u003E\u003Csub\u003E-8.5\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 8.53467 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.0684 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 87.22\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: ~0\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 485 K (413\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 13.188x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: A potential grazing Warm Jupiter was discovered by the team who confirmed the K2-266 A system. It could be one of the largest planets found around a star this small and cool.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-158 System\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-158\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.95 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.92 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 5503 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.742 L\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: G\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Virgo\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 10\n\u003C/li\u003E\n\u003Cli\u003E\nAlternative Designation(s): EPIC 201132684\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The bright Sun-like star K2-158 is very similar to K2-187 and K2-183, both in terms of size and how they all have complex planetary systems. They were also all first validated by Mayo et al in February 2018. K2-158 has two confirmed planets and two likely candidates, the final of which is a Neptune-sized world in the inner part of the habitable zone. The inner three planets may be detectable by the radial velocity technique. While the inner two planets already have determined parameters, I\u0027ve calculated my own radius estimates for all four.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-158c\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u002286LGERz.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/86LGERz.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.31 (±0.03) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 5.90279 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.06220 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 948 K (1,247\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 191.789x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Confirmed several months after K2-158b, K2-158c is an intermediate hot Super-Earth in terms of radius (about 30% larger than Earth\u0027s) and temperature (around 950 K). It may have some of an atmosphere left and could be detected by current radial velocity equipment, although it would be challenging due to its likely small mass.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-158b\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022YKTPMhr.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/YKTPMhr.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 2.92 (±0.06) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 10.06049 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.08875 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 794 K (970\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 94.204x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-158b is a typical Hot Neptune orbiting every 10 days, near (but not exactly in) a 2:1 resonance with the smaller K2-158c. It\u0027s possible its mass could be determined through Transit Timing Variations, but so far it looks like an easy target for radial velocity analysis.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-158.03\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022dRFUnQP.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/dRFUnQP.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 3.29 (±0.07) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 25.468516 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.16484 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 582 K (588\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 27.307x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: A rather typical Warm Neptune candidate planet in a 5:2 resonance with K2-158b. Its mass could be determined either through TTVs or RV.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-158.04\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022XZgqOFx.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/XZgqOFx.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 3.98 (±0.09) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: ~223.819 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: ~0.702 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: ~282 K (48\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: ~1.5x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The fourth candidate planet of K2-158 was found from a single 10.79-hour long transit event, and appears to be a temperate Neptune-like planet within the habitable zone. It is highly unlikely to have an orbital period less than 200 days, and it could be longer than what I\u0027ve calculated if the planet\u0027s orbital inclination is further from 90 degrees. K2-158.04 likely migrated from where it originally formed and might have captured a small rocky planet on its way, meaning it could theoretically have a potentially habitable exomoon.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-183 System\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-183\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.97 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.93 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 5519 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.782 L\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: G\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Cancer\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 5\n\u003C/li\u003E\n\u003Cli\u003E\nAlternative Designation(s): EPIC 211562654\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-183 is a star slightly smaller and cooler than the Sun that\u0027s very similar to K2-158 and K2-187. It hosts a system of five hot planets: three scorched Super-Earths and two Hot Neptunes. The innermost planet is one of the hottest planets found by anyone on Exoplanet Explorers, with an average temperature far above the melting point of iron. All five planets were found by shutcheon, but only three have been confirmed as of November 2018. Like with K2-158, all radii presented here are my estimates. I nicknamed all the planets after different names for the Devil due to their hostile and hellish conditions.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-183b (Leviathan)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022rbximCo.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/rbximCo.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.40 (±0.03) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 0.469269 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.01154 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 2,230 K (3,554\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nDayside Temperature: \u0026gt;2,500 K (4,040\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 5,872.12x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-183b is one of the most hellish planets yet found, taking only about 11 hours to complete a single orbit at just 1.2% the distance between Earth and the Sun from its star. Its equilibrium temperature is over 2,200 K, but it\u0027s likely hotter due to the combination of a low albedo and extreme tidal forces. Some parts of the planet likely exceed 4,000\u003Csup\u003Eo\u003C/sup\u003EF -- hot enough to vaporize rock. K2-183b is so hot, it likely has an atmosphere of rock vapor and rains chunks of silicates and metals. Due to its presumably high density and short orbit, it is an ideal target for radial velocity analysis to determine its mass and composition.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-183.05 (Lucifer)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022FeoONTm.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/FeoONTm.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.25 (±0.03) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 2.152804 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.03186 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 1,342 K (1,956\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 770.4x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: The smallest planet of the system, K2-183.05 is a scorched Super-Earth with an average temperature around 2,000\u003Csup\u003Eo\u003C/sup\u003EF. It is likely rocky and volcanic with molten seas, but other than that, nothing much else is known.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-183.04 (Beelzebub)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022tLxAdTb.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/tLxAdTb.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.51 (±0.03) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 4.251238 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.05015 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 1,070 K (1,466\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 310.93x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-183.04 is the largest of the system\u0027s three Super-Earths, and likely has the thickest atmosphere of the trio due to its size and lower insolation. That atmosphere might be detectable with something like the James Webb Space Telescope, as the host star is rather bright and the atmosphere could be somewhat puffed up from the extreme heat the planet gets.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-183c (Asmodeus)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u00225wxGTaV.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/5wxGTaV.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 3.02 (±0.07) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 10.792635 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.09334 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 787 K (957\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 89.76x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: A typical Hot Neptune with a very similar radius, orbit, and temperature to K2-158b. It is the largest planet of the system.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-183d (Abaddon)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022hR5FlNz.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/hR5FlNz.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 2.76 (0.06) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 22.631964 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.15291 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 615 K (647\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 33.445x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Another typical Warm/Hot Neptune, very similar to K2-158.03 and near a 5:2 resonance with K2-183c.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-155 System\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-155\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.526 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.540 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 3919 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.059 L\n\u003C/li\u003E\n\u003Cli\u003E\nMetallicity: -0.42 [Fe/H]\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: M0V\n\u003C/li\u003E\n\u003Cli\u003E\nDistance: 62.3 parsecs\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Taurus\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 4\n\u003C/li\u003E\n\u003Cli\u003E\nAlternative Designation(s): EPIC 210897587\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-155 is a bright, metal-poor, high-end red dwarf with a system of three transiting Super-Earths. While two of them are very close to the rocky-gaseous planet transition of 1.6 Earth radii, the star\u0027s low metal content means the hydrogen in the planet-forming disk likely did not stay around long enough for these worlds to accumulate thick gaseous envelopes. As a result, they\u0027re likely mainly or entirely rocky. The middle planet probably has a significant water layer and is one of the best targets for atmospheric analysis. The final planet might be habitable; however, when the star was thought to be smaller, it was believed this planet was a near Earth analogue.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-155b (Wallace)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LWHsfyQ.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/LWHsfyQ.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.55 (\u003Csup\u003E\u002B0.20\u003C/sup\u003E\u003Csub\u003E-0.17\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 6.34365 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.0546 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 537 K (507\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 19.64x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: A warm Super-Earth near the terrestrial/gaseous planet boundary. It is likely rocky and very geologically active, maybe with a methane haze. Any atmosphere could be detectable with Hubble or JWST thanks to the star\u0027s brightness.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-155c (Lyell)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022F4rEmoF.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/F4rEmoF.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.95 (\u003Csup\u003E\u002B0.27\u003C/sup\u003E\u003Csub\u003E-0.22\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 13.85402 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.0920 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 414 K (286\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 7.00x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Lyell is a potential warm ocean world, at just under 2 Earth radii. Most of this world\u0027s water would be in the form of a steam layer, possibly with a supercritical ocean below. It may contain enough hydrogen and methane in its atmosphere to have impacts on its visible color.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-155d (Darwin)\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u00221ixjRzm.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/1ixjRzm.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.64 (\u003Csup\u003E\u002B0.18\u003C/sup\u003E\u003Csub\u003E-0.17\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 40.6835 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.1886 AU\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 289 K (61\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 1.67x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: Darwin orbits in the inner edge of the optimistic habitable zone. Its potential habitability is extremely precarious; if its actual stellar flux is around 1.50-1.55 times that of Earth or below, it will be able to resist a runaway greenhouse effect. It would likely be almost entirely covered in oceans (except for some parts of the equator) with a water-rich atmosphere high in moisture. Surface conditions would be comparable to the hot, moist tropics of Earth. However, if Darwin\u0027s actual stellar flux is above 1.5-1.55, it will be doomed to become a Venus-like world. Further studies will be needed to determine whether or not Darwin is capable of supporting liquid water and, possibly, life. Thankfully, the star is one of K2\u0027s brightest red dwarfs, and since it\u0027s currently visible from now until March, some researchers may already be observing it right now.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-229 System\u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-229\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 0.793 R\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 0.837 M\u003Csub\u003E☉\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nTemperature: 5185 K\n\u003C/li\u003E\n\u003Cli\u003E\nLuminosity: 0.407 L\n\u003C/li\u003E\n\u003Cli\u003E\nSpectral Type: K2V\n\u003C/li\u003E\n\u003Cli\u003E\nMetallicity: -0.06 [Fe/H]\n\u003C/li\u003E\n\u003Cli\u003E\nRotation Period: 18.1 days\n\u003C/li\u003E\n\u003Cli\u003E\nAge: ~5.4 billion years\n\u003C/li\u003E\n\u003Cli\u003E\nConstellation: Virgo\n\u003C/li\u003E\n\u003Cli\u003E\nK2 Campaign #: 10\n\u003C/li\u003E\n\u003Cli\u003E\nAlternative Designation(s): EPIC 228801451, TYC 4947-834-1\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-229 is an early K dwarf around a billion years older than the Sun in the constellation Virgo. It is one of K2\u0027s brightest planet-hosting stars and was an interesting target for radial velocity analysis. This proved to be fruitful, as a study published in February 2018 was able to accurately measure the mass and composition of the innermost transiting planet, and provide hints at the masses of the next two planets.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-229b\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022iTvSjyH.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/iTvSjyH.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 1.165 (\u003Csup\u003E\u002B0.066\u003C/sup\u003E\u003Csub\u003E-0.044\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 2.59 (±0.43) M\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nDensity: 8.9 (±2.1) g/cm\u003Csup\u003E3\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nGravity: 1.91 (\u003Csup\u003E\u002B0.59\u003C/sup\u003E\u003Csub\u003E-0.48\u003C/sub\u003E)g\n\u003C/li\u003E\n\u003Cli\u003E\nComposition: 68% iron, 32% silicates\n\u003C/li\u003E\n\u003Cli\u003E\nAtmosphere: Rock vapor, assorted volcanic gases\n\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 0.584249 days (14.02 hours)\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.012888 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 83.9\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 1,960 K (3,068\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nDayside Temperature: 2,332 K (3,738\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 2,455x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: One of the best-studied planets of the K2 mission so far, K2-229b is also one of the weirdest. It\u0027s only 17% larger than Earth but over two-and-a-half times the mass, resulting in an extremely high density and a powerful gravitational pull of 1.9 gees. This high density is a result of an iron rich composition; two-thirds of the planet is made of an iron core. The only possible way this came to be is if K2-229b started out as a much larger planet -- possibly as large as 5-6 Earth masses -- and smashed into another planet, tearing off the crust and most of the mantle. What would\u0027ve been left is a little bit of silicates on top of an iron core more massive than Earth and Venus combined. K2-229b continues to be destroyed, as the intense stellar radiation has stripped off an estimated 1-5% of the planet\u0027s mass over its 5.4 billion year history. The day side has a temperature of 2,000 degrees Celsius and is hot enough to vaporize rock. The rest of the planet is nearly as hot, as well as extremely volcanic from tidal forces and probably entirely covered in molten iron. As a result of these hostile conditions, K2-229b likely has a thin atmosphere of rock vapor and volcanic gases like carbon dioxide, methane, sulfur, and more. It may also have a powerful magnetic field from its giant core and quick rotation period (the same as its year, 14 hours), which would give it bright global auroras. \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-229c\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022utoBIXz.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/utoBIXz.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 2.12 (\u003Csup\u003E\u002B0.11\u003C/sup\u003E\u003Csub\u003E-0.08\u003C/sub\u003E) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: 9.3 (±2.4) M\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nDensity: 5.38 (\u003Csup\u003E\u002B2.22\u003C/sup\u003E\u003Csub\u003E-1.95\u003C/sub\u003E) g/cm\u003Csup\u003E3\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nGravity: 2.07 (\u003Csup\u003E\u002B0.74\u003C/sup\u003E\u003Csub\u003E-0.68\u003C/sub\u003E)g\n\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 8.32834 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.07577 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 87.94\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 800 K (980\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nDayside Temperature: 962 K (1,272\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 70.89x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-229c is a Mini-Neptune that, according to one method of radial velocity data interpretation, is shockingly dense for its size. At over 9 Earth masses, it is almost as dense as Earth, meaning it would have a primarily rocky composition with a thick layer of water. This water would likely be in the form of a steam layer and pressurized Ice-VII, similar to K2-187e. More radial velocity analysis is needed to accurately determine the exact mass and composition of K2-229c.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EK2-229d\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022sXHBGLM.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022542\u0022 src=\u0022https://i.imgur.com/sXHBGLM.jpg\u0022 width=\u00221024\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRadius: 2.64 (±0.24) R\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nMass: \u0026lt;25.1 M\u003Csub\u003E⊕\u003C/sub\u003E\u003C/li\u003E\n\u003Cli\u003E\nOrbital Period: 31.0 days\n\u003C/li\u003E\n\u003Cli\u003E\nSemi-major Axis: 0.1820 AU\n\u003C/li\u003E\n\u003Cli\u003E\nInclination: 88.92\u003Csup\u003Eo\u003C/sup\u003E\u003C/li\u003E\n\u003Cli\u003E\nEccentricity: 0.39 (±0.29)\n\u003C/li\u003E\n\u003Cli\u003E\nEquilibrium Temperature: 522 K (480\u003Csup\u003Eo\u003C/sup\u003EF)\n\u003C/li\u003E\n\u003Cli\u003E\nStellar Flux: 12.29x Earth\n\u003C/li\u003E\n\u003Cli\u003E\nDescription: K2-229d is a classic warm Mini-Neptune with only one transit visible seen by K2; the other transit happened during a brief time when Kepler was busy transmitting data back to Earth. The orbital period of the planet was estimated using a weak radial velocity signature, the one transit\u0027s duration, and stability analyses. A 31-day orbit with a moderate or low eccentricity was the best option. The alternative was a \u0026gt;50 day orbit with an eccentricity so high, K2-229d would intersect to orbit of K2-229c and destabilize the system.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cem\u003ESECTION IS A WORK-IN-PROGRESS, MORE SYSTEMS WILL BE ADDED LATER\u003C/em\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNow, it\u0027s time for some shout-outs to those who have supported and/or helped me with these candidates since KIC 7848638:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152800-spaceception/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152800\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152800-spaceception/\u0022 rel=\u0022\u0022\u003E@Spaceception\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/147982-kunok/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022147982\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/147982-kunok/\u0022 rel=\u0022\u0022\u003E@kunok\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/115084-_augustus_/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022115084\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/115084-_augustus_/\u0022 rel=\u0022\u0022\u003E@_Augustus_\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/159377-letsgotomars/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022159377\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/159377-letsgotomars/\u0022 rel=\u0022\u0022\u003E@LetsGoToMars!\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57622-scotius/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257622\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57622-scotius/\u0022 rel=\u0022\u0022\u003E@Scotius\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110755-aethon/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110755\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110755-aethon/\u0022 rel=\u0022\u0022\u003E@Aethon\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156312-andrewdrawsprettypictures/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022156312\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156312-andrewdrawsprettypictures/\u0022 rel=\u0022\u0022\u003E@AndrewDrawsPrettyPictures\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/164377-the-raging-sandwich/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022164377\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/164377-the-raging-sandwich/\u0022 rel=\u0022\u0022\u003E@The Raging Sandwich\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nDebra Fisher\n\u003C/li\u003E\n\u003Cli\u003E\nJoseph Schmitt\n\u003C/li\u003E\n\u003Cli\u003E\nAl Schmitt\n\u003C/li\u003E\n\u003Cli\u003E\nDaryll LaCourse\n\u003C/li\u003E\n\u003Cli\u003E\nDavid Kipping\n\u003C/li\u003E\n\u003Cli\u003E\nJessie Christiansen\n\u003C/li\u003E\n\u003Cli\u003E\nVidar87\n\u003C/li\u003E\n\u003Cli\u003E\nshutcheon\n\u003C/li\u003E\n\u003Cli\u003E\nLibmar96\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/176924-cabbink/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022176924\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/176924-cabbink/\u0022 rel=\u0022\u0022\u003E@Cabbink\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nAnd SO many more!\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-24T19:17:57Z\u0022 title=\u002212/24/2018 07:17  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 24, 2018\u003C/time\u003E by ProtoJeb21\u003C/strong\u003E\n\u003Cbr\u003EK2-149 updates\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-08-06T19:00:12Z","Content":"\n\u003Cp\u003E\nCongratulations \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I spent a lot of time looking at lightcurves, but every possible candidate i found was already reported earlier. I hope you will have more luck \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2016-08-06T21:23:24Z","Content":"\n\u003Cp\u003E\nCongrats!\n\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2016-08-06T21:38:21Z","Content":"\n\u003Cp\u003E\nSuper cool!  Unfortunately I was never the first to find a system, but it must be a thrill.  Keep up the great work!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2016-08-06T22:24:39Z","Content":"\n\u003Cp\u003E\nAwesome! Why not ask for the names to be tributes to SQUAD staff?\n\u003C/p\u003E\n"},{"CreatedByName":"OrbitalBuzzsaw","CreatedById":158329,"CreatedDateTime":"2016-08-06T22:49:21Z","Content":"\n\u003Cp\u003E\nThat\u0027s an amazing idea!!\n\u003C/p\u003E\n"},{"CreatedByName":"insert_name","CreatedById":150339,"CreatedDateTime":"2016-08-06T23:11:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222707492\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470522279\u0022 data-ipsquote-userid=\u0022142607\u0022 data-ipsquote-username=\u0022legoclone09\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n49 minutes ago, legoclone09 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAwesome! Why not ask for the names to be tributes to SQUAD staff?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nor name them after ksp planets. Also, when will the results be published, and where can I find info on the star?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-06T23:15:00Z\u0022 title=\u002208/06/2016 11:15  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 6, 2016\u003C/time\u003E by insert_name\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ozymandias_the_Goat","CreatedById":159377,"CreatedDateTime":"2016-08-06T23:18:32Z","Content":"\n\u003Cp\u003E\nNice! I should probably do more interesting stuff like that. \n\u003C/p\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-07T01:33:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222707492\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470522279\u0022 data-ipsquote-userid=\u0022142607\u0022 data-ipsquote-username=\u0022legoclone09\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, legoclone09 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAwesome! Why not ask for the names to be tributes to SQUAD staff?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI didn\u0027t think of that...maybe I\u0027ll do that for another find.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222707531\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470525103\u0022 data-ipsquote-userid=\u0022150339\u0022 data-ipsquote-username=\u0022insert_name\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, insert_name said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nor name them after ksp planets. Also, when will the results be published, and where can I find info on the star?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA system I would name after KSP planets would be something like the K2-72 solar system. Other than that, maybe the name Jool to a green gas giant?\n\u003C/p\u003E\n\u003Cp\u003E\nData on this star can only be found in Planet Hunters. If you\u0027re lucky, you may get one of its light curves to analyse. Keep an eye out for relatively small transit-like events and comment on it. Then, if you go to your Zooniverse profile, you\u0027ll be able to see what star you commented on. Planet Hunters has this odd designation method it uses. Koyash\u0027s Planet Hunters designation is APH00015me.\n\u003C/p\u003E\n\u003Cp\u003E\nIf anyone manages to find Koyash and its transits in Planet Hunters, I would like to know. Multiple people seeing the transits will probably boost the probability of these candidates not being false positives.\n\u003C/p\u003E\n"},{"CreatedByName":"The Raging Sandwich","CreatedById":164377,"CreatedDateTime":"2016-08-07T02:31:28Z","Content":"\n\u003Cp\u003E\nAt first I thought you made up a solar system or something, but then I started actually reading your post!\n\u003C/p\u003E\n\u003Cp\u003E\nCongratulations, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153551-protojeb21/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022153551\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153551-protojeb21/\u0022 rel=\u0022\u0022\u003E@ProtoJeb21\u003C/a\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\nHow did you even monitor the light curves, though? Just currious. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-07T02:33:57Z\u0022 title=\u002208/07/2016 02:33  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 7, 2016\u003C/time\u003E by The Raging Sandwich\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-07T13:12:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222707768\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470537088\u0022 data-ipsquote-userid=\u0022164377\u0022 data-ipsquote-username=\u0022The Raging Sandwich\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, The Raging Sandwich said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAt first I thought you made up a solar system or something, but then I started actually reading your post!\n\u003C/p\u003E\n\u003Cp\u003E\nCongratulations, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153551-protojeb21/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022153551\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153551-protojeb21/\u0022 rel=\u0022\u0022\u003E@ProtoJeb21\u003C/a\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\nHow did you even monitor the light curves, though? Just currious. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m actually planning to make a planet pack with this solar system in it. Chantico is nearing completion, because I started it before finding these 4 extra candidates.\n\u003C/p\u003E\n\u003Cp\u003E\nOn Planet Hunters, I looked through every single light curve of Koyash, aka \u003Cstrong\u003EAPH00015me\u003C/strong\u003E. I think you could search it up on the Talk page. Keep in mind that there were over TWO DOZEN sets of data for this star captured in a period of over 1,500 days. It took me at least 2 hours to go through them all. If you do decide to try and spot these planets yourself, keep your eyes VERY peeled. Even the largest planet is rather difficult to find.\n\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2016-08-07T17:56:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222707768\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470537088\u0022 data-ipsquote-userid=\u0022164377\u0022 data-ipsquote-username=\u0022The Raging Sandwich\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, The Raging Sandwich said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHow did you even monitor the light curves, though? Just currious. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor anyone interested in actually contributing to science, Planet Hunters is citizen science project from Zooniverse that uses the unique skills of humans to crowd search data.\n\u003C/p\u003E\n\u003Cp\u003E\nI advise everyone to start an account.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.zooniverse.org/projects\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.zooniverse.org/projects\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-08T01:07:44Z\u0022 title=\u002208/08/2016 01:07  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 8, 2016\u003C/time\u003E by Aethon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2016-08-08T11:52:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222707228\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470509085\u0022 data-ipsquote-userid=\u0022153551\u0022 data-ipsquote-username=\u0022ProtoJeb21\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/6/2016 at 11:44 AM, ProtoJeb21 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EKIC 7848638 e (Eingana)\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nFirst spotted on 8/6/16\n\u003C/li\u003E\n\u003Cli\u003E\n1.63 Earth radii (error between 0.11 and 0.08 Earth radii).\n\u003C/li\u003E\n\u003Cli\u003E\nYear of 201 days.\n\u003C/li\u003E\n\u003Cli\u003E\nTemperature no greater than 320 kelvin (116 Fahrenheit).\n\u003C/li\u003E\n\u003Cli\u003E\nPotentially habitable Super-Earth!\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOut of curiosity, is your data detailed enough to rule out an earth-moon pairing over a single super-earth?\n\u003C/p\u003E\n\u003Cp\u003E\nA quick look at Wolfram Alpha suggests that adding Luna cross section to Earth\u0027s would make Earth\u0027s light dip ~6% stronger, creating the false impression that Earth would be bigger than it is.\n\u003C/p\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-08T11:57:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222709297\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470657150\u0022 data-ipsquote-userid=\u0022101988\u0022 data-ipsquote-username=\u0022Rakaydos\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Rakaydos said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOut of curiosity, is your data detailed enough to rule out an earth-moon pairing over a single super-earth?\n\u003C/p\u003E\n\u003Cp\u003E\nA quick look at Wolfram Alpha suggests that adding Luna cross section to Earth\u0027s would make Earth\u0027s light dip ~6% stronger, creating the false impression that Earth would be bigger than it is.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nProbably not, because I only spotted 3 transits of this planet. I don\u0027t think I will be able to find hints of a moon anytime soon. Maybe once it\u0027s confirmed, though.\n\u003C/p\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-08T13:03:11Z","Content":"\n\u003Cp\u003E\nI\u0027ve got a lot of stuff relating to the Koyash System.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst off, here is work-in-progress \u003Cstrong\u003EChantico\u003C/strong\u003E in KSP! Special guest star: \u003Cem\u003E\u003Cstrong\u003Ethe Kraken!\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/ZAaDJ\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/ZAaDJ\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Did I mention it was work-in-progress?)\n\u003C/p\u003E\n\u003Cp\u003E\nSecondly, I created and tested the Koyash system in Universe Sandbox 2. I gave Koyash 0.85 times the Sun\u0027s mass, which is what I think the upper limit will be. Look at where the outer two planets are:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hj5IUyw.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/hj5IUyw.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSurprisingly,\u003Cstrong\u003E Indra\u003C/strong\u003E is in the habitable zone too! I made it into a gas dwarf mostly made of water with something like 5% hydrogen/helium. I let the simulation run for exactly 100 years and got this as an end result:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YCJyPQp.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/YCJyPQp.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt turns out that \u003Cstrong\u003EChantico\u003C/strong\u003E,\u003Cstrong\u003E Montu\u003C/strong\u003E, and \u003Cstrong\u003ESethlans\u003C/strong\u003E have a pretty large gravitational impact on each other. This leads me to believe that there should be pretty large \u003Cstrong\u003ETransit Timing Variations\u003C/strong\u003E with the three inner planets, possibly revealing their masses and also their densities and surface gravity. I was also able to get better estimates of the planets\u0027 temperatures with US2, too. They aren\u0027t as high as I though. Both Chantico and Montu reach about \u003Cstrong\u003E650 kelvin\u003C/strong\u003E, while Sethlans only gets to about \u003Cstrong\u003E470 kelvin\u003C/strong\u003E. \u003Cstrong\u003EEingana\u003C/strong\u003E, without an atmosphere, would be around\u003Cstrong\u003E 260 kelvin\u003C/strong\u003E, and\u003Cstrong\u003E Indra\u003C/strong\u003E can reach close to \u003Cstrong\u003E220 kelvin\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nSpeaking of Indra, I was able to rule out a water-rich gas dwarf structure, because after only 1 century, all the hydrogen and helium evaporated away. A composition like that only gave it about 45 times the mass of our moon, making to too lightweight. Since it cannot be mostly made of ice and water, this suggests that Indra is either a Mega-Earth or a gas dwarf with a much larger iron-silicate core.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PQ9LbH3.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/PQ9LbH3.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI will do more composition models of Indra and the other planets later on. There\u0027s also the possibility of both Eingana and Indra having at least one moon. In fact, the two transits of Indra may have proof that it does have a large satellite!\n\u003C/p\u003E\n"},{"CreatedByName":"The Raging Sandwich","CreatedById":164377,"CreatedDateTime":"2016-08-08T15:19:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222709347\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470661391\u0022 data-ipsquote-userid=\u0022153551\u0022 data-ipsquote-username=\u0022ProtoJeb21\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, ProtoJeb21 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve got a lot of stuff relating to the Koyash System.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst off, here is work-in-progress \u003Cstrong\u003EChantico\u003C/strong\u003E in KSP! Special guest star: \u003Cem\u003E\u003Cstrong\u003Ethe Kraken!\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/ZAaDJ\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/ZAaDJ\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n9/10 would download! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2016-08-09T01:50:15Z","Content":"\n\u003Cp\u003E\nLooking cool! Can\u0027t wait for more data!\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2016-08-09T02:19:15Z","Content":"\n\u003Cp\u003E\nThat planet texture looks awesome, mate.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2016-08-09T13:35:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222709347\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470661391\u0022 data-ipsquote-userid=\u0022153551\u0022 data-ipsquote-username=\u0022ProtoJeb21\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, ProtoJeb21 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSnippity\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou should put this in your sig, also, did you make Eingana habitable? What was the ESI for it?\n\u003C/p\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-09T15:40:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222710660\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470749752\u0022 data-ipsquote-userid=\u0022152800\u0022 data-ipsquote-username=\u0022Spaceception\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Spaceception said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou should put this in your sig, also, did you make Eingana habitable? What was the ESI for it?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI might put it in my signature. Also, I may be going out on a limb here, but I\u0027m estimating an ESI of\u003Cstrong\u003E 0.84\u003C/strong\u003E for \u003Cstrong\u003EEingana\u003C/strong\u003E. Why? I just realized that it is nearly identical to \u003Cstrong\u003EKepler-452b\u003C/strong\u003E with its size, temperature, and placement in the habitable zone. The only thing that sparks some differences is the host star, \u003Cstrong\u003EKoyash\u003C/strong\u003E. In fact, I\u0027m going to rename this planet! It will no longer be named after some random Aussie deity; Koyash e will now be known as \u003Cstrong\u003EKupole\u003C/strong\u003E. This was one of my 20\u002B names I reserved for extrasolar and stellar objects I find. Kupole was reserved for something very similar to Kepler-452b. And, most importantly, it begins with \u0022K\u0022! I like to name habitable worlds with a \u0022K\u0022 because, well, Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nI expect Kupole to be mostly covered in oceans with a few large islands (or mini-continents) and ice caps reaching to about 60-70 degrees in each hemisphere. A mass of about 4.9 to 5.1 Earth masses is expected if Kupole is rocky.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2016-08-09T17:12:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222710787\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470757252\u0022 data-ipsquote-userid=\u0022153551\u0022 data-ipsquote-username=\u0022ProtoJeb21\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, ProtoJeb21 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI might put it in my signature. Also, I may be going out on a limb here, but I\u0027m estimating an ESI of\u003Cstrong\u003E 0.84\u003C/strong\u003E for \u003Cstrong\u003EEingana\u003C/strong\u003E. Why? I just realized that it is nearly identical to \u003Cstrong\u003EKepler-452b\u003C/strong\u003E with its size, temperature, and placement in the habitable zone. The only thing that sparks some differences is the host star, \u003Cstrong\u003EKoyash\u003C/strong\u003E. In fact, I\u0027m going to rename this planet! It will no longer be named after some random Aussie deity; Koyash e will now be known as \u003Cstrong\u003EKupole\u003C/strong\u003E. This was one of my 20\u002B names I reserved for extrasolar and stellar objects I find. Kupole was reserved for something very similar to Kepler-452b. And, most importantly, it begins with \u0022K\u0022! I like to name habitable worlds with a \u0022K\u0022 because, well, Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nI expect Kupole to be mostly covered in oceans with a few large islands (or mini-continents) and ice caps reaching to about 60-70 degrees in each hemisphere. A mass of about 4.9 to 5.1 Earth masses is expected if Kupole is rocky.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow many more transits do you need to confirm this planet? And is there enough data to confirm it? I\u0027m guessing the inner three planets are confirmed.\n\u003C/p\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-09T19:45:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222710921\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470762723\u0022 data-ipsquote-userid=\u0022152800\u0022 data-ipsquote-username=\u0022Spaceception\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Spaceception said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow many more transits do you need to confirm this planet? And is there enough data to confirm it? I\u0027m guessing the inner three planets are confirmed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe inner three aren\u0027t confirmed yet, but they seem likely to be planets. I would need a statistical analysis of Kupole and Indra in order to either confirm of disprove them.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2016-08-10T16:24:46Z","Content":"\n\u003Cp\u003E\nHow far away is the star from Earth? \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153551-protojeb21/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022153551\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153551-protojeb21/\u0022 rel=\u0022\u0022\u003E@ProtoJeb21\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0026amp;do=hovercard\u0022 data-mentionid=\u002216426\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0022 rel=\u0022\u0022\u003E@sal_vager\u003C/a\u003E Again, this needs to be auto pinned, this is bigger than any Kraken calling machine we\u0027ve built.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-10T16:28:45Z\u0022 title=\u002208/10/2016 04:28  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 10, 2016\u003C/time\u003E by Spaceception\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ProtoJeb21","CreatedById":153551,"CreatedDateTime":"2016-08-10T16:32:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222712053\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470846286\u0022 data-ipsquote-userid=\u0022152800\u0022 data-ipsquote-username=\u0022Spaceception\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Spaceception said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow far away is the star from Earth? \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153551-protojeb21/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022153551\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153551-protojeb21/\u0022 rel=\u0022\u0022\u003E@ProtoJeb21\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0026amp;do=hovercard\u0022 data-mentionid=\u002216426\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/16426-sal_vager/\u0022 rel=\u0022\u0022\u003E@sal_vager\u003C/a\u003E Again, this needs to be auto pinned, this is bigger than any Kraken calling machine we\u0027ve built.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know it\u0027s distance, because it didn\u0027t say in Planet Hunters. I\u0027m estimating at least 500 light years.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, this system is kind of a Kraken-calling machine. Just look at what happened on Chantico when I went to test it in KSP!\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2016-08-10T16:38:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222712070\u0022 data-ipsquote-contentid=\u0022145502\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470846768\u0022 data-ipsquote-userid=\u0022153551\u0022 data-ipsquote-username=\u0022ProtoJeb21\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, ProtoJeb21 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t know it\u0027s distance, because it didn\u0027t say in Planet Hunters. I\u0027m estimating at least 500 light years.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, this system is kind of a Kraken-calling machine. Just look at what happened on Chantico when I went to test it in KSP!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEmail this guy, he might be able to tell you.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://twitter.com/ProfAbelMendez\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://twitter.com/ProfAbelMendez\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEmail: \u003Ca href=\u0022/cdn-cgi/l/email-protection\u0022 class=\u0022__cf_email__\u0022 data-cfemail=\u00222b4a494e4705464e454f4e516b5e5b59054e4f5e\u0022\u003E[email\u0026#160;protected]\u003C/a\u003E\n\u003C/p\u003E\n"}]}