{"TopicId":146058,"ForumId":44,"TopicTitle":"Bull-Manure detection, and a pretty funny example","CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-08-17T10:36:12Z","PageNum":1,"Articles":[{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-08-17T10:36:12Z","Content":"\n\u003Cp\u003E\nLets be clear, I am NOT posting this as a \u0022Is this legit?\u0022 kind of manner, this is DEFINITELY a scam/hoax/joke.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the sheer density of this one, the almost tangible effort that exudes from the material, is quite unusually high. As if a chemistry/physics textbook, a thesaurus and a particularly heavy brick collided at high speed with a financially embattled Nigerian Prince.\n\u003C/p\u003E\n\u003Cp\u003E\nBehold, Phoenix Energy:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.freeenergynews.com/Directory/Induction/PENV/PENV_Rev-4_Induction-Energy_Re-Heat_Stm-Waste-Ht-Energy-Recov-Electric-Pwr-Plant_11-1-2015.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.freeenergynews.com/Directory/Induction/PENV/PENV_Rev-4_Induction-Energy_Re-Heat_Stm-Waste-Ht-Energy-Recov-Electric-Pwr-Plant_11-1-2015.pdf\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://phoenixenergynv.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://phoenixenergynv.com/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\ntl;dr - Heat water to make steam, use steam to power turbine generator, use a bit of the generated electricity to heat water to make steam...\n\u003C/p\u003E\n\u003Cp\u003E\nOr, as they put it:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Phoenix Energy of Nevada (PENV) has developed and is prepared to field a new extremely innovative,\u003Cbr\u003E\nevolutionary, revolutionary, disruptive and transformational cutting-edge electric power plant design and\u003Cbr\u003E\ntechnology known and described as the PENV Steam Waste Heat Energy Recovery Dry Cooling Reverse\u003Cbr\u003E\nCondenser Induction Energy Induced Feed Water Re-Heat Electric Power Generation Plant.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere are plenty of people out there who, for one reason or another, do not have the tools to tell this kind of material apart from real work, and the drag that this exerts on all manner of things (from bona-fide scientific research to school curricula) can be felt by all. We should be showing stuff like this to schoolkids, along with real research, and explain to them why \u0022pseudoscience\u0022 exists and how to spot it - although a decent scientific education would do this automatically, not everyone is, or can be expected to be, scientifically-minded. It is the non-scientifically minded that are most vulnerable to this, and since the actually-scientifically-minded do not appear to get a larger say in these matters, teaching these things to otherwise-skilled people is incredibly important if we want to live in a science-enabled world, and not one of arbitrary, emotional choices.\n\u003C/p\u003E\n\u003Cp\u003E\nThe above should not be taken as derogatory to those mentioned that are not-scientifically-minded, equal merit goes to people of all types of intelligence. People cannot be expected to be experts in every field, we must specialize, and there are very many non-scientific disciplines worthy of a lifetimes effort. For example, I wish very much that I was taught more about finances and economics at school (inb4 \u0022economics IS science\u0022, sure, maybe, but you know what I mean!). However, the scientific disciplines underpin a great deal of our current society (drugs, cars, safety, lighting, utilities, global climate change, recycling etc etc.), so deserve special attention from everybody.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2016-08-17T13:26:09Z","Content":"\n\u003Cp\u003E\nI humbly submit that Phoenix Energy of Nevada Innovative Systems Inc. would be an appropriate company name for this lot. Would make for a lovely letterhead. \n\u003C/p\u003E\n\u003Cp\u003E\nOn a more serious note, agree that whilst \u0027science\u0027 in the sense of a body of specialised knowledge isn\u0027t (and doesn\u0027t need to be) for everyone, a bit of scientific, or more accurately scholarly training \u003Ci\u003Ewould\u003C/i\u003E be useful for a lot of people. \n\u003C/p\u003E\n\u003Cp\u003E\nAre you getting information from a reputable source?\n\u003C/p\u003E\n\u003Cp\u003E\nIf somebody is trying to sell you something that seems too good to be true - get a second opinion on it before buying.\n\u003C/p\u003E\n\u003Cp\u003E\nNot everything is a conspiracy - if 95% of informed opinion on a topic points in one direction then it\u0027s probably time to take that direction seriously. How do I decide what informed opinion is, if I don\u0027t know anything about the topic myself?\n\u003C/p\u003E\n\u003Cp\u003E\nThat sort of stuff. Skepticism in its original and proper sense.\n\u003C/p\u003E\n\u003Cp\u003E\nedit. Having had a quick look on Wikipedia, I think Scientific skepticism is closest to what I have in mind. Please ignore my comment on \u0027the original and proper\u0027 meaning of skepticism - it looks a lot more complicated than I thought!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-17T14:04:26Z\u0022 title=\u002208/17/2016 02:04  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 17, 2016\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003Cbr\u003EAdding non-snark content.\n\u003C/span\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-08-17T15:02:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222720087\u0022 data-ipsquote-contentid=\u0022146058\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471440369\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI humbly submit that Phoenix Energy of Nevada Innovative Systems Inc. would be an appropriate company name for this lot. Would make for a lovely letterhead. \n\u003C/p\u003E\n\u003Cp\u003E\nOn a more serious note, agree that whilst \u0027science\u0027 in the sense of a body of specialised knowledge isn\u0027t (and doesn\u0027t need to be) for everyone, a bit of scientific, or more accurately scholarly training \u003Ci\u003Ewould\u003C/i\u003E be useful for a lot of people. \n\u003C/p\u003E\n\u003Cp\u003E\nAre you getting information from a reputable source?\n\u003C/p\u003E\n\u003Cp\u003E\nIf somebody is trying to sell you something that seems too good to be true - get a second opinion on it before buying.\n\u003C/p\u003E\n\u003Cp\u003E\nNot everything is a conspiracy - if 95% of informed opinion on a topic points in one direction then it\u0027s probably time to take that direction seriously. How do I decide what informed opinion is, if I don\u0027t know anything about the topic myself?\n\u003C/p\u003E\n\u003Cp\u003E\nThat sort of stuff. Skepticism in its original and proper sense.\n\u003C/p\u003E\n\u003Cp\u003E\nedit. Having had a quick look on Wikipedia, I think Scientific skepticism is closest to what I have in mind. Please ignore my comment on \u0027the original and proper\u0027 meaning of skepticism - it looks a lot more complicated than I thought!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly what I was getting at, this guy gets it.\n\u003C/p\u003E\n\u003Cp\u003E\nIt really affects almost every facet of everyday life, regardless of your vocation.\n\u003C/p\u003E\n\u003Cp\u003E\nIts not like you have to teach artists to solve hamiltonians, just some pointers on judging data quality, be it numerical data or verbal opinion or anything in between.\n\u003C/p\u003E\n\u003Cp\u003E\nLesson 1 could easily be \u0022How to have a conversation with someone who *also* thinks they are right.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-08-17T16:19:02Z","Content":"\n\u003Cp\u003E\nPsuedoscientific jargon - one of the 12 basic forms of propaganda.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt works like this basically\n\u003C/p\u003E\n\u003Cp\u003E\nYou -------Life-----------Choices\n\u003C/p\u003E\n\u003Cp\u003E\nChoice one - you ignore science and treat science and technology with suspicion or respect depending on the how the package is wrapped, not what is inside. (For you science and sci-fantasy have few distinguishing features)\n\u003C/p\u003E\n\u003Cp\u003E\nChoice two - you engage technology and science and you are skeptical of packages, period.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I would say in the typical human with moderate amount of wealth in their 40s and 50s are of catagory A, which means some nepharious individual can repackage poof into glittering mounds of valuable fertilizer and can get people to invest.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLets take an example I have a battery and a DC motor, I can use it to turn an aquarium pump impellar to generate DC to run a plasma capaciter, magrav system which oddly has both properties of a 120VAC 60hz and 12/6 VDC circuit at the same time, depending on which peice of equipment is on it. The equipment magically interpret what it needs to use and runs that device, it feeds enough power back to charge the system, run a refridgerator compressor and fan  and provide additonal power at 120VAC, amazingly to any device that plugs into it. Now a certified electrician would probably give you a snicker, but if you were ignorant to all these things you might invest in this all but obvious perpetual motion machine only to be given the Ponzi treatment.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2016-08-17T23:30:05Z","Content":"\n\u003Cp\u003E\nI kindly put that most people do in fact know that a perpetual motion machine cannot possibly work, even if the majority would be hard put to explain why. (Not sure if I could give a convincing explanation, btw.) The problem is more that they may not recognize it when the concept is made complex enough.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222720242\u0022 data-ipsquote-contentid=\u0022146058\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471450742\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nChoice one - you ignore science and treat science and technology with suspicion or respect depending on the how the package is wrapped, not what is inside. (For you science and sci-fantasy have few distinguishing features)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s not that easy. The way physics was taught at my school, I cannot really blame the girls and the artsy types and most everyone who wasn\u0027t a geek to begin with for basically shutting down, engaging with the material just enough to pass a test and then forget all about the loathed subject.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-08-18T02:08:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222720679\u0022 data-ipsquote-contentid=\u0022146058\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471476605\u0022 data-ipsquote-userid=\u0022110461\u0022 data-ipsquote-username=\u0022Laie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Laie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI kindly put that most people do in fact know that a perpetual motion machine cannot possibly work, even if the majority would be hard put to explain why.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUh, enthropy. Seriously.\n\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2016-08-18T06:26:13Z","Content":"\n\u003Cp\u003E\nLet\u0027s all sing the Carnot efficiency song!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSadly I can\u0027t find it.\n\u003C/p\u003E\n"}]}