{"TopicId":154623,"ForumId":44,"TopicTitle":"Do stars have L1 \u0026amp; L2 points, and Trojans?","CreatedByName":"SgtSomeone","CreatedById":151722,"CreatedDateTime":"2017-01-07T07:41:04Z","PageNum":1,"Articles":[{"CreatedByName":"SgtSomeone","CreatedById":151722,"CreatedDateTime":"2017-01-07T07:41:04Z","Content":"\n\u003Cp\u003E\nSo NASA recently announced a mission to investigate Jupiter\u0027s Trojans, which made me wonder: do stars have L1 and L2 points? And thus potentially also Trojans, which scaled up could be entire Trojan systems?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if theoretically possible, what would be the challenges to discovering those Trojans?\n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2017-01-07T09:02:31Z","Content":"\n\u003Cp\u003E\nLagrange points are not a thing of a single body, they result from the \u003Cem\u003Emutual cancellation\u003C/em\u003E of the effects of gravity and orbit forces (centripetal/-fugal) of two bodies, where one of them orbits the other. Both masses can be assumed to be concentrated at a single point. That is approximately the case with a sun/a planet or a (dwarf) planet/a moon. The resulting langrange points of such systems are a place that over time attracts small bodies/satellites or provide a place for keeping artificial satellites at low manoeuver cost.\n\u003C/p\u003E\n\u003Cp\u003E\nThe galaxy where the sun is part of is not a single mass concentrated at the center. There are other forces of gravity all around where one would expect a Lagrange point. Also Lagrange \u0022points\u0022 are no points but more or less stretched volumes of space with a peak where things must be balanced \u003Cs\u003Eor valleys where things drop and stay\u003C/s\u003E. Edit: not sure about the latter and no time to look it up ...\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the answer is, nope, no Lagrange points in the system Galaxy-Sun.\n\u003C/p\u003E\n\u003Cp\u003E\nEditedit: i did look it up, L4 and L5 are stable, that is why these points attract Trojans. L1, L2 and L3 are labile, they do not attract Trojans.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-07T09:31:52Z\u0022 title=\u002201/07/2017 09:31  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 7, 2017\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"radonek","CreatedById":84077,"CreatedDateTime":"2017-01-07T10:48:31Z","Content":"\n\u003Cp\u003E\nMost stars come in pairs and such systems may have stable points. I kinda doubt they would be able to hold a planet though.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2017-01-07T12:53:50Z","Content":"\n\u003Cp\u003E\nBinary star systems could very well have them though, no?\n\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2017-01-07T13:20:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222913412\u0022 data-ipsquote-contentid=\u0022154623\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483786111\u0022 data-ipsquote-userid=\u002284077\u0022 data-ipsquote-username=\u0022radonek\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, radonek said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMost stars come in pairs and such systems may have stable points. I kinda doubt they would be able to hold a planet though.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222913482\u0022 data-ipsquote-contentid=\u0022154623\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483793630\u0022 data-ipsquote-userid=\u002281207\u0022 data-ipsquote-username=\u0022peadar1987\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, peadar1987 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBinary star systems could very well have them though, no?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat would depend on the size difference and distance between the two. But in theory I do not see why this would not be possible.\n\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2017-01-07T13:25:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222913495\u0022 data-ipsquote-contentid=\u0022154623\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483795221\u0022 data-ipsquote-userid=\u002258254\u0022 data-ipsquote-username=\u0022Tex_NL\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Tex_NL said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat would depend on the size difference and distance between the two. But in theory I do not see why this would not be possible.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, that\u0027s what I was thinking. I don\u0027t know too much about binary systems, I don\u0027t know if they ever form far enough apart or have the right size difference to have stable L4 and L5 points\n\u003C/p\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2017-01-08T02:03:26Z","Content":"\n\u003Cp\u003E\nBinary pairs come in a wide variety of size ratios and distances. There are bound to be some with Lagrange points even within just this galaxy, likely all with capured bodies of one size or another.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the galaxy at large, it\u0027s more of a \u0022gravity soup\u0022 than isolated point masses,  and orits as we know them don\u0027t really happen.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-01-08T05:29:00Z","Content":"\n\u003Cp\u003E\nLangrange points make practical sense in near-circle orbits, but do many of binary stars have this?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-08T05:29:25Z\u0022 title=\u002201/08/2017 05:29  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 8, 2017\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2017-01-08T09:25:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222913482\u0022 data-ipsquote-contentid=\u0022154623\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483793630\u0022 data-ipsquote-userid=\u002281207\u0022 data-ipsquote-username=\u0022peadar1987\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, peadar1987 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBinary star systems could very well have them though, no?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaybe i misunderstood ops question \u0022do stars have L1 and L2 points\u0022 for \u0022do stars in orbit around the galaxy have Trojans\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nSure, binary star-systems could theoretically have all sorts of L-points, depending on mass and distance and Trojans might be possible in the corresponding L4 or L5. I doubt anyone can give us a serious estimate on the probability of such a configuration.\n\u003C/p\u003E\n\u003Cp\u003E\nI shortly read a paper about possible Trojans in a system with a gas giant and a sun. The gas giant transits the sun and there was a very weak periodic signal in front of and behind it, that could probably/maybe/nobody knows/let us speculate be interpreted as Trojans. Achilles in outer space :-)\n\u003C/p\u003E\n\u003Cp\u003E\nIf you search \u0022extrasolar trojans\u0022 you get a stack of noise and maybe a few serious articles. I recommend not to use google but one of the many alternative search engines (i use duckduckgo but there are others, independent ones).\n\u003C/p\u003E\n\u003Cp\u003E\nThese signals, measurement and interpretation, is at the limit or slightly beyond what the current generation of instruments can do. A new generation is under construction and i am sure that 10 years from now we\u0027ll have many more \u0022insights\u0022 :-)\n\u003C/p\u003E\n\u003Cp\u003E\ngb\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-08T09:27:09Z\u0022 title=\u002201/08/2017 09:27  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 8, 2017\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2017-01-08T11:28:55Z","Content":"\n\u003Cp\u003E\nWell, as other forum members have pointed out, Lagrange points are special points dictated by their lack of \u0022net forces\u0022 (bear with me on this one below)* with respect to \u003Cem\u003Etwo\u003C/em\u003E bodies. Trojans and such are tiny bodies (wrt to the other two) that is located at L4 (or is it L5 ? Forgot).\n\u003C/p\u003E\n\u003Cp\u003E\nIs there anything of the sorts with a star orbiting a talaxy ? Unluckily, the answer is no - galactic movement of stars are based on the interactions between billions of stars and other things in it. The same applies to clusters of stars.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat about within a binary (or anything of higher order) star system ? Well in theory you could have one. But stars within a star system tends to be similarly massive, unlike a planet wrt it\u0027s parent stars. This unluckily means that instead of able to be modelled as one orbits the other, both are orbiting each other, and so the solution may or may not exist.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat about an exoplanet wrt it\u0027s parent star ? Definitely possible. So I suppose just wait for those very detailed pictures coming in inthe next decades.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n* regarding \u0022net forces\u0022 : the point is, a limited (ie. have meaningless mass to be included in the whole calculation) third body, orbiting the parent body, perturbed by the second body, would have it\u0027s net gravitational forces aligned just so at that place, the centrifugal force (equal net gravitational force here, amd we\u0027re looking from outside the system) is just enough for that body to orbit (often assumed as circularly) the parent body with the same period as of the second body. tl;dr Yes it\u0027s wrong to assume Lagrange points as a place where the forces cancel out.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}