{"TopicId":166919,"ForumId":44,"TopicTitle":"Interstellar Interloper (A/2017 U1)","CreatedByName":"Nikolai","CreatedById":23085,"CreatedDateTime":"2017-10-27T14:24:51Z","PageNum":1,"Articles":[{"CreatedByName":"Nikolai","CreatedById":23085,"CreatedDateTime":"2017-10-27T14:24:51Z","Content":"\n\u003Cp style=\u0022background-color:#ffffff;color:#1d2129;font-size:14px;\u0022\u003E\nLast week, an asteroid was discovered with the provisional designation A/2017 U1. It\u0027s about 400 meters wide.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#1d2129;font-size:14px;\u0022\u003E\nWhat makes this exceptional is that it\u0027s an asteroid from another star.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#1d2129;font-size:14px;\u0022\u003E\nThere are plans to measure its composition as it goes by. (It\u0027s moving too fast to be bound to the Sun.)\n\u003C/p\u003E\n\u003Cdiv style=\u0022background-color:#ffffff;color:#1d2129;font-size:14px;\u0022\u003E\n\u003Cp\u003E\nWe don\u0027t know \u003Cstrong\u003Ewhich\u003C/strong\u003E star it came from, exactly, but its angle of approach shows it coming from the galactic plane -- where most of the stars in the area are located. It probably spent millions or even billions of years in the interstellar dark before coming close to us, and after swinging by, will be consigned to interstellar space for millions of years more.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.ifa.hawaii.edu/info/press-releases/interstellar/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.ifa.hawaii.edu/info/press-releases/interstellar/\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2017-10-27T14:48:15Z","Content":"\n\u003Cp\u003E\nI cant say asteroid are an area of expertice for me, is it possible for asteroids to be formed without being related to a star? A truly interstellar object? Can you get accretion like that without it being the ashes left over from star formation? Like if a cloud of gas/dust collapsed but did not have enough material to form a star? Im guessing not but ???\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-10-27T15:44:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223204682\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509115695\u0022 data-ipsquote-userid=\u002274091\u0022 data-ipsquote-username=\u0022p1t1o\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n55 minutes ago, p1t1o said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nis it possible for asteroids to be formed without being related to a star?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe interstellar medium average density is ~1000 atoms/cm\u003Csup\u003E3\u003C/sup\u003E, so very unlikely.\n\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2017-10-27T17:40:58Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedid=\u0022embed35599220\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=https://twitter.com/FitzsimmonsAlan/status/923928561722982400\u0022 style=\u0022height:576px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2017-10-27T17:50:40Z","Content":"\n\u003Cp\u003E\nToo small to be Rama...\n\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2017-10-27T18:26:40Z","Content":"\n\u003Cp\u003E\nThis is actually really interesting. The article confirms my recollection that we have never before observed an extra-solar object transiting our system. This is the first time we\u0027ve ever seen one go by.\n\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2017-10-27T19:14:03Z","Content":"\n\u003Cp\u003E\nShame that it\u0027s already passed us. A little more warning and we could\u0027ve pointed some more telescopes at it as it went by.\n\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2017-10-27T19:47:31Z","Content":"\n\u003Cp\u003E\nI had a moment to read the articles more carefully and some of what is written about the orbital characteristics didn\u0027t make sense. Like the orbital speed being 44 km/s - where? At perihelion inside of Mercury\u0027s orbit? It wouldn\u0027t  be on an escape trajectory then? Or was that supposed to be the hyperbolic excess velocity, in which case \u0022wow\u0022!? I really wish they weren\u0027t so vague. They could have quoted the orbital eccentricity, etc, and eliminated a lot of questions...\n\u003C/p\u003E\n\u003Cp\u003E\nFortunately there is already a Wikipedia article on it though:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/A/2017_U1\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.m.wikipedia.org/wiki/A/2017_U1\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt includes more useful information.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:\n\u003C/p\u003E\n\u003Cp\u003E\nThe fact that it is moving very roughly perpendicular to the ecliptic is also consistent with it coming from interstellar space, but does anyone know if \u0022we overtook it\u0022 or if \u0022it overtook us\u0022? In other words, was it moving faster or slower about the galactic center than us? And as it passed relatively close to the Sun, will it now have a larger or smaller mean orbital radius about the galactic center? \n\u003C/p\u003E\n\u003Cp\u003E\nP.S. \n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s a video showing how the Earth moves, including a segment about how the solar system moves around the galactic center. I\u0027ll leave the link because it is somewhat relevant to this discussion:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/IJhgZBn-LHg?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-27T20:13:11Z\u0022 title=\u002210/27/2017 08:13  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 27, 2017\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003Cbr\u003EUpdated with more questions and added a video\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2017-10-27T21:37:27Z","Content":"\n\u003Cp\u003E\nFrom the news I saw, its coming from the direction of Vega, which has a large debris disk around it, and based on its speed it would take 1.7 million years to get from Vega to here.... so Vega seems to be the best candidate for its origin.\n\u003C/p\u003E\n"},{"CreatedByName":"Josh IN SPACE","CreatedById":167041,"CreatedDateTime":"2017-10-27T22:53:06Z","Content":"\n\u003Cp\u003E\nJust a warning shot from the people of Vega. We would best take care not to go anywhere near the system, or else start a conflict with these people. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2017-10-27T23:07:38Z","Content":"\n\u003Cp\u003E\nI\u0027m amazed that an interstellar Asteroid comes so close to the sun. I mean what are the chances? It makes you wonder how often one of these comes around without being detected. Also a weird coincidence that i just read Rendezvous with Rama a month ago.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-27T23:10:43Z\u0022 title=\u002210/27/2017 11:10  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 27, 2017\u003C/time\u003E by Canopus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2017-10-28T06:53:02Z","Content":"\n\u003Cp\u003E\nJust some highlights about its likely star of origin:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Vega\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Vega\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nVega, also designated Alpha Lyrae (α Lyrae, abbreviated Alpha Lyr or α Lyr), is the brightest star in the constellation of Lyra, the fifth-brightest star in the night sky, and the second-brightest star in the northern celestial hemisphere, after Arcturus. \u003Cstrong\u003EIt is relatively close at only 25 light-years from the Sun\u003C/strong\u003E .... Vega was the first star other than the Sun to be photographed and the first to have its spectrum recorded. It was one of the first stars whose distance was estimated through parallax measurements ... Vega is only about a tenth of the age of the Sun, but since it is 2.1 times as massive its expected lifetime is also one tenth of that of the Sun; both stars are at present approaching the midpoint of their life expectancies. Vega has an unusually low abundance of the elements with a higher atomic number than that of helium. Vega is also a variable star that varies slightly in brightness ... \u003Cstrong\u003EBased on an observed excess emission of infrared radiation, Vega appears to have a circumstellar disk of dust. This dust is likely to be the result of collisions between objects in an orbiting debris disk, \u003C/strong\u003Ewhich is analogous to the Kuiper belt in the Solar System. Stars that display an infrared excess because of dust emission are termed Vega-like stars.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Vega#Planetary_system\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Vega#Planetary_system\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne of the early results from the Infrared Astronomy Satellite (IRAS) was the discovery of excess infrared flux coming from Vega, beyond what would be expected from the star alone ... It was proposed that this radiation came from a field of orbiting particles with a dimension on the order of a millimeter, as anything smaller would eventually be removed from the system by radiation pressure or drawn into the star by means of Poynting–Robertson drag ... To maintain this amount of dust in orbit around Vega, a continual source of replenishment would be required. \u003Cstrong\u003EA proposed mechanism for maintaining the dust was a disk of coalesced bodies that were in the process of collapsing to form a planet.\u003C/strong\u003E Models fitted to the dust distribution around Vega indicate that it is a 120 AU-radius circular disk viewed from nearly pole-on. In addition,\u003Cstrong\u003E there is a hole in the center of the disk\u003C/strong\u003E with a radius of no less than 80 AU ... It is believed that these may provide clues to the origin of the Solar System.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Vega#Debris_disks\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Vega#Debris_disks\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBy 2005, the Spitzer Space Telescope had produced high-resolution infrared images of the dust around Vega. It was shown to extend out to 43″ (330 AU) at a wavelength of 24 μm, 70″ (543 AU) at 70 μm and 105″ (815 AU) at 160 μm. These much wider disks were found to be circular and free of clumps, with dust particles ranging from 1–50 μm in size. The estimated total mass of this dust is 3×10−3 times the mass of the Earth. \u003Cstrong\u003EProduction of the dust would require collisions between asteroids\u003C/strong\u003E in a population corresponding to the Kuiper Belt around the Sun. Thus \u003Cstrong\u003Ethe dust is more likely created by a debris disk around Vega, rather than from a protoplanetary disk\u003C/strong\u003E as was earlier thought.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Vega#Possible_planets\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Vega#Possible_planets\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUsing a coronagraph on the Subaru telescope in Hawaii in 2005, astronomers were able to further constrain the size of a planet orbiting Vega to no more than 5–10 times the mass of Jupiter.[88] The issue of possible clumps in the debris disc was revisited in 2007 using newer, more sensitive instrumentation on the Plateau de Bure Interferometer. The observations showed that the debris ring is smooth and symmetric. No evidence was found of the blobs reported earlier, casting doubts on the hypothesized giant planet.[89] The smooth structure has been confirmed in follow-up observations by Hughes et al. (2012)[90] and the Herschel Space Telescope\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo Vega is one of the closest stars, its got a huge debris disk that probably results from collisions as opposed to a protoplanetary disk. Its a young star at only ~half a billion years old, and it seems the system is still in a bit of chaos. It may or may not have some large giant planets like Jupiter and Neptune, which may or may not be undergoing migration as our gas giants were believed to have done, which could be really good for flinging things out of the system.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile the site from which I read about Vega as a possible origin is not always the most reliable (it was linked to by yahoo news \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E ) the details of the Vega system seem consistent with the sort of system that would be more likely to have produced this visitor.\n\u003C/p\u003E\n\u003Cp\u003E\nIts a shame we didn\u0027t see it earlier and get more data on it.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2017-10-28T08:53:37Z","Content":"\n\u003Cp\u003E\nHey, i\u0027d say we were quite lucky \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Considering very small size of average star system to the vastness of interstellar distances, and the fact that our telescopes do not monitor the entirety of sky 24\\7 we did hit the jackpot getting even such brief look at this wanderer.\n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2017-10-28T09:06:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223204983\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509133651\u0022 data-ipsquote-userid=\u00228059\u0022 data-ipsquote-username=\u0022PakledHostage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, PakledHostage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI had a moment to read the articles more carefully and some of what is written about the orbital characteristics didn\u0027t make sense. Like the orbital speed being 44 km/s - where?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe Nasa text says the 44km/s is the speed now (at observation) a little above earths orbit. That is, if i am not wrong, 2km/s more than escape (parabolic) velocity. But my math knowledge is limited :-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2017-10-28T15:41:52Z","Content":"\n\u003Cp\u003E\nSo there\u0027s enough information floating around now that I can come up with some ballpark estimates for the questions that I posed above: \n\u003C/p\u003E\n\u003Cp\u003E\nIt came from the Sun\u0027s prograde direction about the galactic center with a hyperbolic excess velocity of about 20 km/s. We are orbiting the galactic center at about 220 km/s, so that means it was orbiting the galactic center at roughly 200 km/s before the encounter. It has a relatively small hyperbolic eccentricity of about 1.19, so it pretty much did a U-turn, when viewed from within our frame of reference. As a result, it will leave our system going about 20 km/s faster than the Solar system about the galactic center, meaning it has been boosted into a higher orbit, with a net increase in orbital speed of (very roughly) 40 km/s as a result of the encounter with our Sun. And out of curiosity, I looked up the galactic escape velocity for our region of the Milky Way: it is about 537 km/s. An object would have to have a hyperbolic excess velocity greater than ~320 km/s in the Sun\u0027s prograde direction about the galactic center to escape, so there\u0027s no risk of this thing escaping.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2017-10-28T19:17:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223204857\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509126058\u0022 data-ipsquote-userid=\u002282292\u0022 data-ipsquote-username=\u0022Mitchz95\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/27/2017 at 12:40 PM, Mitchz95 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedid=\u0022embed4882093695\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=https://twitter.com/FitzsimmonsAlan/status/923928561722982400\u0022 style=\u0022height:576px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIts been accumulating space dust (frozen volatiles) as it has been traveling.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223205617\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509205312\u0022 data-ipsquote-userid=\u00228059\u0022 data-ipsquote-username=\u0022PakledHostage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, PakledHostage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo there\u0027s enough information floating around now that I can come up with some ballpark estimates for the questions that I posed above: \n\u003C/p\u003E\n\u003Cp\u003E\nIt came from the Sun\u0027s prograde direction about the galactic center with a hyperbolic excess velocity of about 20 km/s. We are orbiting the galactic center at about 220 km/s, so that means it was orbiting the galactic center at roughly 200 km/s before the encounter. It has a relatively small hyperbolic eccentricity of about 1.19, so it pretty much did a U-turn, when viewed from within our frame of reference. As a result, it will leave our system going about 20 km/s faster than the Solar system about the galactic center, meaning it has been boosted into a higher orbit, with a net increase in orbital speed of (very roughly) 40 km/s as a result of the encounter with our Sun. And out of curiosity, I looked up the galactic escape velocity for our region of the Milky Way: it is about 537 km/s. An object would have to have a hyperbolic excess velocity greater than ~320 km/s in the Sun\u0027s prograde direction about the galactic center to escape, so there\u0027s no risk of this thing escaping.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n42122 m/sec\n\u003C/p\u003E\n\u003Cp\u003E\nBTW. I think there are little green space aliens inside spying on us.\n\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2017-10-28T22:34:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223205784\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509218273\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n42122 m/sec\n\u003C/p\u003E\n\u003Cp\u003E\nBTW. I think there are little green space aliens inside spying on us.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat\u0027s that? The net increase in orbital speed about the galactic center? If so, then my 40 km/s estimation based on nothing more than mental math using small angle approximations  isn\u0027t bad... And possibly also a sign that I\u0027ve played too much KSP?\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2017-10-29T03:51:14Z","Content":"\n\u003Cp\u003E\n42122 is the average escape velocity of an earth for sol at \u003Cem\u003Ea\u003C/em\u003E (which we are approximate to).   29785 would be the velocity relative to the sun of earth. If the artifact was traveling 20000 m/s faster along the prograde, then we can see that its total velocity should be 49785. The SKE of that is 1239273112.2 J/kg the SPE of earths current position is  887130066 J/kg  and the difference is 350,000,000 J/kg. But because of its tilt and angle I will shave this down to 300,000,000. Remember that any energy you leave a system with in excess of the integral of gh, deprecating m, you must keep as potential energy relative to the systems center. The V\u003Csub\u003Eexit\u003C/sub\u003E \u0026gt; SQRT (2 * 300000) then V\u003Csub\u003Eexit\u003C/sub\u003E \u0026gt;= 24942 m/s (about 54,000 miles per hour).\n\u003C/p\u003E\n\u003Cp\u003E\nThis is actually a relatively slow differential velocity, and it could simply be an object tossed by a jovian sized planet in a nearby star system. There are probably  a great many objects that travel to us along the polar angles that are traveling so fast we only have time to track them when they streak through our atmosphere or collide with something. I read one article that a typical interstellar differential velocity would be something 100,000 to 500,000 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nJust to give you an idea how fast this is relative to natural objects we are familiar with.\n\u003C/p\u003E\n\u003Cp\u003E\nThe surface of jupiter -- 12600 m/s, relative to the sun at angle to prograde 90. 25,665 m/s.\u003Cbr\u003E\nThe horizontal component of motion of the surface of the surface of the Sun - 1,995,000 m/s\u003Cbr\u003E\nIf you sent a spacecraft to Mercury (Vintercept = 50,912 m/s) and as you cycled close to Mercury applied ~10,000 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E of thrust prograde relative to mercury and the sun, you could create a similar hermit.\n\u003C/p\u003E\n\u003Cp\u003E\nWe live in squishy little bodies on a fairly squishy planet in a rather gentle part of the solar system in a relatively quite corner of our galaxy, lucky for us.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Nikolai","CreatedById":23085,"CreatedDateTime":"2017-11-08T19:02:29Z","Content":"\n\u003Cp\u003E\nThis interloper has been dubbed Oumuamua, which means \u0022first messenger\u0022 in Hawaiian.  We also think we know roughly where it came from (the Carina and Columba Associations), meaning that we have some idea of how long it\u0027s spent in interstellar space (40 million years) and can constrain the mass of the planet that flung it our way in the first place (from a \u0022super-Earth\u0022 to a gas giant 20 or 30 times the mass of Earth).\n\u003C/p\u003E\n\u003Cp\u003E\nIt is expected that when we finish the Large Synoptic Survey Telescope in Chile, we will discover objects like this at a rate of one per year or so.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://arxiv.org/abs/1711.01300\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://arxiv.org/abs/1711.01300\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://arxiv.org/abs/1711.01344\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://arxiv.org/abs/1711.01344\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"DAL59","CreatedById":180784,"CreatedDateTime":"2017-11-09T00:57:22Z","Content":"\n\u003Cp\u003E\nIs it rotating every 4 minutes? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2017-11-09T01:08:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223204983\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221509133651\u0022 data-ipsquote-userid=\u00228059\u0022 data-ipsquote-username=\u0022PakledHostage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/27/2017 at 11:47 AM, PakledHostage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n-video-\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nwasn\u0027t this video refuted some time ago? the orientation of the galactic disk as seen in the night sky is all wrong for this to be accurate. \n\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2017-11-09T01:55:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223214476\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510189702\u0022 data-ipsquote-userid=\u002210883\u0022 data-ipsquote-username=\u0022Nuke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, Nuke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwasn\u0027t this video refuted some time ago? the orientation of the galactic disk as seen in the night sky is all wrong for this to be accurate. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf it is, then it is news to me. Everything I have read (independent of the video) says that we are moving roughly in the direction of Vega at about 220 km/s. Making a sanity check by looking up the current night sky in Stellarium shows Vega in sufficiently close proximity to the galactic plane for this to be believable? But feel free to educate me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2017-11-09T01:57:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223214522\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510192518\u0022 data-ipsquote-userid=\u00228059\u0022 data-ipsquote-username=\u0022PakledHostage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, PakledHostage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf it is, then it is news to me. Everything I have read (independent of the video) says that we are moving roughly in the direction of Vega at about 220 km/s. Making a sanity check by looking up the current night sky in Stellarium shows Vega in sufficiently close proximity to the galactic plane for this to be believable? But feel free to educate me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nit was just something i picked op on hearsay. i was just doing some transformations in my head and before it gave me a headache i figured it looked fishy. you know, dubious science.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-09T01:57:58Z\u0022 title=\u002211/09/2017 01:57  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 9, 2017\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nikolai","CreatedById":23085,"CreatedDateTime":"2017-11-09T16:20:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223214458\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510189042\u0022 data-ipsquote-userid=\u0022180784\u0022 data-ipsquote-username=\u0022DAL59\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, DAL59 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs it rotating every 4 minutes?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEvery five hours, actually.  But still, very cute, Mr. Clarke.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2017-11-12T16:41:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223214525\u0022 data-ipsquote-contentid=\u0022166919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510192627\u0022 data-ipsquote-userid=\u002210883\u0022 data-ipsquote-username=\u0022Nuke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/9/2017 at 2:57 AM, Nuke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nit was just something i picked op on hearsay. i was just doing some transformations in my head and before it gave me a headache i figured it looked fishy. you know, dubious science.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell sort of. The first time I saw an animation like that, it came from a bad source and had some inaccuracies that I\u0027m not noticing in that video. The video that you are probably thinking of was debunked. The original animation that looked sort of like that was about some pseudoscience rubbish about spirals and vortexs and living things and blah blah...\n\u003C/p\u003E\n\u003Cp\u003E\nThis junk is probably what you were thinking of: \u003Ca href=\u0022https://www.youtube.com/watch?v=0jHsq36_NTU\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=0jHsq36_NTU\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-12T16:44:43Z\u0022 title=\u002211/12/2017 04:44  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 12, 2017\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"}]}