{"TopicId":167418,"ForumId":44,"TopicTitle":"If the Soviet manned lunar program succeeded, how would the missions be designated?","CreatedByName":"Grant Exploit","CreatedById":178221,"CreatedDateTime":"2017-11-11T03:16:10Z","PageNum":1,"Articles":[{"CreatedByName":"Grant Exploit","CreatedById":178221,"CreatedDateTime":"2017-11-11T03:16:10Z","Content":"\n\u003Cp\u003E\nThis is an effective repost of my question \u003Ca href=\u0022https://www.quora.com/If-the-Soviet-manned-lunar-program-succeeded-how-would-the-missions-be-designated\u0022 rel=\u0022external nofollow\u0022\u003EIf the Soviet manned lunar program succeeded, how would the missions be designated?\u003C/a\u003E on Quora. The \u003Ca href=\u0022https://www.quora.com/If-the-Soviet-manned-lunar-program-succeeded-how-would-the-missions-be-designated/answer/Eugene-Miya\u0022 rel=\u0022external nofollow\u0022\u003Eonly answer\u003C/a\u003E suggested I ask Roscosmos people. Unfortunately, there seems to be literally no Soviet space program/Roscosmos employees, present or former, on Quora. Hence, I re-ask this question here to show it to a wider audience, including people who may be super duper knowledgeable about the Russian Space Program. \n\u003C/p\u003E\n\u003Cp\u003E\nComment in question source: \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFormer question source: \u003Cspan\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Soviet_crewed_lunar_programs#Moon_landing_N1.2FL3_program\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cu\u003E\u003Cfont color=\u0022#0066cc\u0022\u003ESoviet crewed lunar programs - Wikipedia\u003C/font\u003E\u003C/u\u003E\u003C/a\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESoyuz [x]? N1-L3 [x]? LK/LOK [x]? Something else?\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Pand5461","CreatedById":172084,"CreatedDateTime":"2017-11-11T03:34:28Z","Content":"\n\u003Cp\u003E\nEither Soyuz, or they were going to come up with the name later when all is ready. The whole program was secret, so there was no need for nice-sounding name for public, such as Apollo.\n\u003C/p\u003E\n"},{"CreatedByName":"Grant Exploit","CreatedById":178221,"CreatedDateTime":"2017-11-11T04:00:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216368\u0022 data-ipsquote-contentid=\u0022167418\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510371268\u0022 data-ipsquote-userid=\u0022172084\u0022 data-ipsquote-username=\u0022Pand5461\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, Pand5461 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEither Soyuz, or they were going to come up with the name later when all is ready. The whole program was secret, so there was no need for nice-sounding name for public, such as Apollo.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI just sent \u003Ca href=\u0022http://www.russianspaceweb.com/zak.html\u0022 rel=\u0022external nofollow\u0022\u003EAnatoly Zak\u003C/a\u003E this question in email form. Let\u0027s see what he thinks of it... \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2017-11-11T05:30:15Z","Content":"\n\u003Cp\u003E\nI don\u0027t remember where I read this, but IIRC the idea was that there would be 12 unmanned N1 flights to work out the kinks (of which four flew - all failures) and two manned missions.\n\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2017-11-11T08:41:14Z","Content":"\n\u003Cp\u003E\nSoviet program names tended to be rather prosaic\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nVostok = East/Orient (mission: orbit)\n\u003C/li\u003E\n\u003Cli\u003E\nVoskhod = Ascent/Dawn (mission: go higher and fly longer)\n\u003C/li\u003E\n\u003Cli\u003E\nSoyuz = Union (mission: RV and docking)\n\u003C/li\u003E\n\u003Cli\u003E\nSalyut = Salute (mission: ambiguously civilian/military station)\n\u003C/li\u003E\n\u003Cli\u003E\nMir = Peace/World (mission: to become a peaceful space station)\n\u003C/li\u003E\n\u003Cli\u003E\nZond = Probe (mission: to probe)\n\u003C/li\u003E\n\u003Cli\u003E\nLuna = Moon (mission: to land on the Moon)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSimilarly, the Mir science modules were pretty much self-explanatory: Kvant  (Quantum) 1 and 2 for physics, Kristall for material science, Priroda (Nature) for bio science, Spektr for a big spectrometer, etc...\n\u003C/p\u003E\n\u003Cp\u003E\nSo pick something in the same vein...  In the Russian program, only successful launches got an actual mission name. Maybe the lunar landings could have been called Mir (mission: exploring a new world).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, Soviet rockets tended to end up with the name of their first successful payload(Vostok, Soyuz, Proton,  ), so the N-1 would probably have been given the name of whatever the 7K-LOK spacecraft was going to be called.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-11T08:57:52Z\u0022 title=\u002211/11/2017 08:57  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 11, 2017\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2017-11-11T10:08:55Z","Content":"\n\u003Cp\u003E\nN-1 has been, in various sources, named “Nauka” (Science) or “Hercules”.\n\u003C/p\u003E\n\u003Cp\u003E\nProbably the person to ask is Alexei Leonov, designated lander crew for the first manned L3 mission.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-11-11T13:38:35Z","Content":"\n\u003Cp\u003E\n\u0022Hercules\u0022and \u0022Atlant\u0022 are mentioned as original Proton (nee UR-500) names.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022N\u0022 is supposedly \u0022Nositel\u0027\u0022 (\u0022Launch Vehicle\u0022) or \u0022Nauka\u0022 (\u0022Science\u0022).\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nR-7 versions were named after the projects. Every new project required another version of R-7.\u003Cbr\u003E\nSo, \u0022Soyuz\u0022 (\u0022Union\u0022), \u0022Vostok\u0022 (\u0022East/Orient\u0022), \u0022Voskhod\u0022 (\u0022Sunrise\u0022), \u0022Molniya\u0022 (\u0022Lightning\u0022), \u0022Luna\u0022 (\u0022Moon\u0022)\u003Cbr\u003E\nLV \u0022Kosmos\u0022 was being used to launch numerous noname satellites under default designation \u0022Kosmos\u0022.\u003Cbr\u003E\nSo, they are named not after their payload, but after the projects of their payload development.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Proton\u0022, afaik, was named after its first payload just because it was ICBM and didn\u0027t have a commonly known name, so they just named it as \u0022that \u0022Proton\u0022 who got into space\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Energia\u0022 (\u0022Energy\u0022), \u0022Zenit\u0022 (\u0022Zenith\u0022) have their own names, not corresponding to some program except their own.\n\u003C/p\u003E\n\u003Cp\u003E\nSpaceships \u0022Buran\u0022 (\u0022Snowstorm\u0022), \u0022Zarya\u0022 (\u0022Dawn\u0022), \u0022Kliper\u0022 (\u0022Clipper\u0022, a sailship) didn\u0027t give a name to any rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nAccording to \u0022Battle for the Stars\u0022(?) by Anton Pervushin (Первушин Антон, \u0022Битва за звёзды\u0022), vol.1.\u003Cbr\u003E\n(Can\u0027t find if this very informative and interesting book is in English).\u003Cbr\u003E\nBriefly:\n\u003C/p\u003E\n\u003Cp\u003E\nOriginally (1956) Korolev was unofficially planning an ICBM next to R-7.\u003Cbr\u003E\nIt had 3 variants:\u003Cbr\u003E\n- kinda R-7 on steroids, with 6 side blocks, with a nuclear 2nd stage, up to 40 t payload, used as ICBM and LV.\u003Cbr\u003E\n- \u0026lt;=100 t start mass (not payload!) pure ICBM\u003Cbr\u003E\n- like N-1, but not \u0022N-1\u0022 (I guess, nameless, due to the next phase)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nIn 1960 there was officially adopted an official program of space exploration and everything for 1960..1967:\u003Cbr\u003E\nBetween others it contained these ones to be built in 1960..1963:\u003Cbr\u003E\n\u0022N-1\u0022 - 40..50 t to LEO, 10..20 t to escape.\u003Cbr\u003E\n\u0022N-2\u0022 - 60..80 t to LEO, 20..40 t to escape.\u003Cbr\u003E\nAs the escape speed is mentioned, probably they were mentioned also as LV, not ICBM.\u003Cbr\u003E\n(My own guess, unlikely it\u0027s \u0022Nauka\u0022 here, more probably \u0022Nositel\u0027\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\nThen after the conflict between Korolev and Glushko, Glushko has left the project before it had really started. Chelomei and Yangel were opposing to it with their own projects.\u003Cbr\u003E\nSo, in 1962 the \u0022N-(whatever)\u0022 program was reduced to a schematic design and financial estimations by a decision on \u0022ICBM, global (combat) rockets and launch vehicles for heavy space objects\u0022 development.\n\u003C/p\u003E\n\u003Cp\u003E\nThe result was the early design of N-1 as we know it, named \u0022N-1\u0022. It was more lightweight, with 75 t payload to LEO (i.e. like \u0022N-2\u0022 should have earlier, but named \u0022N-1\u0022).\u003Cbr\u003E\nSo, looks like the early project adopted the later designation.\u003Cbr\u003E\n(My own guess, as after 1962 Korolev didn\u0027t design ICBMs, and the rocket was designed mostly for space, probably at this moment \u0022N\u0022 could be rethought as \u0022Nauka\u0022.\u003Cbr\u003E\nBut all parts of the lunar complex were designated by functional letters: rocket blocks A,B,V,G,D,E (alphabet)...,  spaceships K (\u0022korabl\u0027\u0022, \u0022ship\u0022), probably \u0022N\u0022 really means \u0022Nositel\u0027\u0022 , and \u0022Nauka\u0022 looks like a folk etymology between the developers.\u003Cbr\u003E\nBut this is just my guess).\u003Cbr\u003E\nThe final Korolev\u0027s project (1963) on 1965..1975 lunar program included:\u003Cbr\u003E\n- L1 assembly. Crewed lunar flyby or orbiter. Consists of: 7K (Soyuz\u0027s capsule and service module), 9K (booster), NK. Makes lunar maps. To be assembled in LEO.\u003Cbr\u003E\n- L2 assembly. Teleoperated rover. Nuclear powered, on tracks, range 2500 km. To be delivered as an assembly L2 (rover) \u002B 13K (lander) \u002B 9K. To be assembled in LEO and fueled by PK tankers Required 6 R-7 launches. \u003Csub\u003E(2500 km? Needs not tracks, but anti-grav repulsors)\u003C/sub\u003E\u003Cbr\u003E\n- L3 assembly. Crewed ship with a lander, 200 t heavy. To be assembled in LEO, requires 3 N-1 \u002B R-7 (one with the ship, two with tankers, R-7 with crew). Consists of: orbiter LOK  \u002B lander LK \u002B booster. Crew 2..3.\u003Cbr\u003E\n- L4 assembly. Lunar orbital mini-station based on 7K (looks like Soyuz, but with a cylinder instead of the sphere). Requires N-1. Consists of the minin-station itself and 3 9K boosters.\u003Cbr\u003E\n- L5 assembly. Crewable rover with cabin and snacks. Its lander, too.\n\u003C/p\u003E\n\u003Cp\u003E\nThe crewed *assembly* was originally named Soyuz (literally - Union, probably for both political reasons and because it\u0027s an asssembly, joint, union).\u003Cbr\u003E\nThough the 7K ship itself was originally designed under project codename \u0022Sever\u0022 (\u0022North\u0022).\u003Cbr\u003E\nLater the 7K descendants inherited the assembly name \u0022Soyuz\u0022 (\u0022Union\u0022) (My own guess, just for political reasons, as its assemblies weren\u0027t anymore in trend).\n\u003C/p\u003E\n\u003Cp\u003E\n~1964. The program is totally reduced, \u0022N-1\u0022 redesigned again. Payload was increased from 75 to 93 t. Total mass increased to 2750 t. That \u0022N-1\u0022 which we have seen.\u003Cbr\u003E\nL1,L2,L3,L4,L5 were replaced with LRK consisting of LOK (Soyuz without the sphere, but with bigger fuel tanks) \u002B LK (lander). (LRK was several times implemented in KSP.)\n\u003C/p\u003E\n\u003Cp\u003E\n(My own guess, at this moment nobody more cared if \u0022N\u0022 is \u0022Nauka\u0022 or \u0022Nositel\u0022).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nIn 1962 Korolev initiated the lunar base project known as DLB or inner name \u0022Zvezda\u0022 (\u0022Star\u0022).\u003Cbr\u003E\nProbably, \u0022N-1\u0022 would be used to deliver it.\u003Cbr\u003E\nIn 1971 the lunar base project was cancelled due to its estimated cost (80 bln USD).\n\u003C/p\u003E\n\u003Cp\u003E\nSo, looks like the lunar project was far from necessity to give it its own name.\u003Cbr\u003E\n(Though, of course, it maybe had some names in official documentation, but looks like mostly they were \u0022the works in compiance with the government decision from (date) on a heavy launch vehicle creation\u0022 or so).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223216468\u0022 data-ipsquote-contentid=\u0022167418\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221510389674\u0022 data-ipsquote-userid=\u00227272\u0022 data-ipsquote-username=\u0022Nibb31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Nibb31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKvant  (Quantum) 1 and 2 for physics, Kristall for material science, Priroda (Nature) for bio science, Spektr for a big spectrometer, etc.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKvant originally was a name for all Mir additional modules.\u003Cbr\u003E\nBut according to \u0022World manned cosmonautics\u0022 (\u0022Мировая пилотируемая космонавтика\u0022), due to the troubles with the first two ones\u0027 docking, others got other personal names.\n\u003C/p\u003E\n\u003Cp\u003E\nKristall is an optical observer (a huge block of telescopes), additionally a docking module and with crystall growing equipment inside. Crystal in both senses (lenses and grown crystals)\u003Cbr\u003E\nPriroda is a radiolocation (meteo)observer with huge antenna on its side, with bioscience equipment inside. Nature in both senses (meteorological radiolocation and terrariums)\u003Cbr\u003E\nSpektr is a spectrometric observer, modified a little,but with an airlock.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Mir\u0022 here is \u0022Peace\u0022, not \u0022World\u0022.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-11T14:38:02Z\u0022 title=\u002211/11/2017 02:38  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 11, 2017\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Urses","CreatedById":175990,"CreatedDateTime":"2017-11-11T14:27:18Z","Content":"\n\u003Cp\u003E\n^^ \u0022Miru mir\u0022 \u0022peace for the world\u0022 (will mostly be translated as \u0022Worldpeace\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\nI personaly think \u0022Nositel\u0022 have to be translated as \u0022carrier\u0022 not only LV. As far as i remember they where planned in typical russian manner, get a hammer and a wire and you can use this thing in multiple functions, as LV or ICBM. Somewhere i read they would be used as suborbital payload Carriers for otherwise unsupportable or complicated otherwise missions like polar regions.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-11T14:27:47Z\u0022 title=\u002211/11/2017 02:27  PM\u0022 data-short=\u00226 yr\u0022\u003ENovember 11, 2017\u003C/time\u003E by Urses\u003C/strong\u003E\n\u003C/span\u003E\n"}]}