{"TopicId":169590,"ForumId":44,"TopicTitle":"STS Shuttle discussion thread","CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-01-15T00:24:01Z","PageNum":3,"Articles":[{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-01-15T14:36:54Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268436\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516026136\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEverything \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/7272-nibb31/\u0026amp;do=hovercard\u0022 data-mentionid=\u00227272\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/7272-nibb31/\u0022 rel=\u0022\u0022\u003E@Nibb31\u003C/a\u003E said was spot-on. Shuttle was a great accomplishment, and the idea of it as an x-vehicle, with substantially improved follow on vehicles would have been a far, far better use of resources. In that counterfactual history, we\u0027d still be flying an ancestor of it now I\u0027m sure.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDescendant, I believe... /pedant\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-15T14:37:29Z\u0022 title=\u002201/15/2018 02:37  PM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 15, 2018\u003C/time\u003E by sevenperforce\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2018-01-15T14:39:30Z","Content":"\n\u003Cp\u003E\nOoops. Drinking decaf this morning (ran out of regular).\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-01-15T15:27:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268426\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516024794\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf we actually needed the large cargo delivery capabilities of the Shuttle, then surely some agency would have paid for the development of an expendable hypergolic-equipped orbital maneuvering bus that could fly on a Delta IV Heavy or other MHLV along with a high-volume cargo. We have the technology; you basically just need a service module with extra fuel tanks, or something like the Dragon 1 without the internal cargo space or the re-entry shell.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd five years after you would have the same thing on a shuttle already in space.  Siiting there watching the DIV launch the other day I could not help but note the QC in their prelaunch setup.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe fact that NO money has gone toward development of something like this is a pretty good indication that the Shuttle\u0027s \u0022payload delivery\u0022 capabilities were not really that necessary.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is mostly oxymoronic. \u003Cem\u003EIF we needed\u003C/em\u003E, the problem is since the shuttle what we have are not trustable entities and particularly reserved for the highest dollar players. In fact the whole discussion here is rather oxymoronic in the abstract. The point is functionality, either you are improving or you are not you cant call the shuttle an improvement vampire. That improvement can come in two ways  you are either increasing performance or lowering cost. The problem is the STS spawns do neither. . . .so who the hell is going to buy into these systems . . . . and so we have a bunch of companies now saying . . . I can do that (true) . . .and do more of that (maybe) . . . . and I/we will have more customers (likely).\n\u003C/p\u003E\n\u003Cp\u003E\nIf you tell me . . . . .I can get 60 kT into LEO  bbbbuuuuttttttt   its going to cost you 2 billion dollars only US pork can pay for that and thats it, that is a closed market.\u003Cbr\u003E\nIf you tell me . . . .  I can get 60 kT into LEO but its going to cost you 300 million, then that market expands, but then your competitor comes back and says\u003Cbr\u003E\n . . . .  .. . . . . . . . . . .I can get 60 kT into LEO for the same price that ^he^ can do for 22 kT . . . .\u003Cbr\u003E\nAnd then you have a market and\u003Cu\u003E people \u003C/u\u003Ecan start doing things.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second oxymoronic statements surround the faux debate. First that the shuttle was old and it was great back then, but became  a space Vampire sucking the blood out of everything, and the reason we are so far behind now because while the shuttle was building the ISS it was sucking the blood out of space (other than it extended the life of hubble by 15-20 years the most productive scientific experiment in the history of science, but that has very little value to the wanted ignorant). Space doesn\u0027t have blood and shuttle has no control of ESA and RSA or Japanese space agency. Their economies together are double the size of US, so why aren\u0027t they offering cheap or modernesque alternatives. OK so SpaceX comes in and revolutionizes the economy, but SpaceX success was also not crushed by shuttle, SX has been in development for many years and had many problems to overcome while the shuttle was still flying and after it stopped flying. SpaceX proves the point, these agencies have rampant inefficiencies in their procurement.\n\u003C/p\u003E\n\u003Cp\u003E\nIndependent of the Shuttle, SX was showing the dis-economies in both Shuttle industries and post-shuttle industries. The fact that these persisted despite the fact the shuttle was gone is notable. So part of it was not that shuttles were inefficient, but that NASA and US Govt does a poor job managing contractors and cost overruns. This has always been true in the defense industry, and Harry Truman probably would have never been president had he not repeatedly pointed this out. So that part \u003Cem\u003Ein and of itself\u003C/em\u003E is a Space vampire. Likewise this is going on in Europe and I\u0027m sure Japan. RSA simply lacks resources but we can see corruption there in the innovation. One can look at it a different way, given the rapidly falling budget and the inefficient procurement system we were damn lucky to get 132 shuttle missions to space and back again.\n\u003C/p\u003E\n\u003Cp\u003E\nThe third sort of oxymoronic comes out of the second and the fact the budget from NASA/gdp had been almost half of that 15 years previous, the budget was falling, and this was the biggest black eye because they are looking at the contractors and wondering why NASA couldn\u0027t negotiate contracts better when it was the US Gov\u0027t that built the inefficient military procurement system. OK so the big red-tanked  vampire was sucking the blood out of NASA R\u0026amp;D budget. While there is a grain of truth, if the administration was asking the proper question it would be \u0027while understanding the need for a shuttle to complete ISS, how are we going to revolutionize and improve PL and naut to Orbit functionality while retaining the best part. There is nothing about Shuttle being a Space Vampire that would have stopped any administration from insisting on progress reports toward this (at the time of the addition of the unity module) that NASA extend itself into the study of functional replacements. In sports this is called an unforced error. That\u0027s what is is, the guidance of NASA did not do its job. . . . that\u0027s why we don\u0027t have a crew carrier, that\u0027s why we can\u0027t fix the Hubble. . . .no evil shuttle Vampires needed to explain this. \n\u003C/p\u003E\n\u003Cp\u003E\nWe keep acting here like the structure of the Shuttle and its function are tied at the hip, they are not, shuttle should have evolved and could have been significantly replaced, the fact that it wasn\u0027t done appropriately was an error, plain and simple. While the shuttle was overpriced, IMHO, it was better to have it than replacements lacking in performance.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-15T16:53:32Z\u0022 title=\u002201/15/2018 04:53  PM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 15, 2018\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2018-01-15T17:34:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268394\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516020231\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is an artificial argument, why the first two minutes. And what exactly does the Soyuz do that SpaceX will not be able to do cheaper, the capabilities are not moderness, they are basically primative.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBecause as long as the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E’s are burning, all they can do if something fails is hold on \u0026amp; pray. Y’know, like \u003Cem\u003EChallenger\u003C/em\u003E...\n\u003C/p\u003E\n\u003Cp\u003E\nI wasn’t comparing Soyuz \u0026amp; SpaceX, I was comparing abort modes for Soyuz and the shuttle. A Soyuz-style abort tower with capsule on \u003Cem\u003Etop\u003C/em\u003E of the stack would have saved the \u003Cem\u003EChallenger\u003C/em\u003E crew. Like SLS. Which could conceivably fail in exactly the same way as \u003Cem\u003EChallenger\u003C/em\u003E. \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-01-15T18:21:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268594\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516037693\u0022 data-ipsquote-userid=\u002257438\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, CatastrophicFailure said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBecause as long as the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E’s are burning, all they can do if something fails is hold on \u0026amp; pray. Y’know, like \u003Cem\u003EChallenger\u003C/em\u003E...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhich rapidly disintegrated due to overwhelming aerodynamic forces.-wikiepdia\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n I would not use SRBs above max Q, it seems like a waste.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI was comparing abort modes for Soyuz and the shuttle. A Soyuz-style abort tower with capsule on \u003Cem\u003Etop\u003C/em\u003E of the stack would have saved the \u003Cem\u003EChallenger\u003C/em\u003E crew.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWishful thinking, think 90,000 feet and explosive decompression and followed by at least complete loss of consciousness in 15 seconds. The logic here is that if the orbiter had survived structurally  . . . . .x, y, z could have happened. Orbiter did not survive.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe launch had been approved \u003Cstrong\u003Edespite a predicted ambient temperature of −3 °C (27 °F), well below the qualification limit of major components such as the SRBs, which had been certified for use only at temperatures above 4 °C (39 °F)\u003C/strong\u003E.\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/STS-51-L#cite_note-5\u0022 rel=\u0022external nofollow\u0022\u003E[5]\u003C/a\u003E\u003C/sup\u003E Evidence found in the remnants of the crew cabin showed that several of the emergency air supplies (PEAPs) carried by the astronauts had been manually activated, suggesting that forces experienced inside the cabin during breakup of the orbiter were not inherently fatal, and that at least three crew members were alive and capable of conscious action for a period following vehicle breakup.\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/STS-51-L#cite_note-6\u0022 rel=\u0022external nofollow\u0022\u003E[\u003C/a\u003E\u003C/sup\u003E - wikipedia\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEnough said. Using a system intentionally outside its rating is a primary error of negligence. Revisionist history is such an entertaining sport.\n\u003C/p\u003E\n\u003Cp\u003E\nThe boosters, as I mentioned in the other post would not survive my redesign, and certainly I would not let DoD officials tinker in my launch safety timing, that was stupid.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-01-15T19:21:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268647\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516040470\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268594\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516037693\u0022 data-ipsquote-userid=\u002257438\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, CatastrophicFailure said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBecause as long as the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E’s are burning, all they can do if something fails is hold on \u0026amp; pray. Y’know, like \u003Cem\u003EChallenger\u003C/em\u003E...\n\u003C/p\u003E\n\u003Cp\u003E\nI wasn’t comparing Soyuz \u0026amp; SpaceX, I was comparing abort modes for Soyuz and the shuttle. A Soyuz-style abort tower with capsule on \u003Cem\u003Etop\u003C/em\u003E of the stack would have saved the \u003Cem\u003EChallenger\u003C/em\u003E crew. Like SLS. Which could conceivably fail in exactly the same way as \u003Cem\u003EChallenger\u003C/em\u003E. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWishful thinking, think 90,000 feet and explosive decompression and followed by at least complete loss of consciousness in 15 seconds. The logic here is that if the orbiter had survived structurally  . . . . .x, y, z could have happened. Orbiter did not survive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExplosive decompression? On \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E burn-through and start of vehicle breakup, Soyuz-style abort tower motor is triggered. Capsule is pulled free, maintains passive aerodynamic stability up to skirt jettison, enters under harsh but not dangerous ballistic trajectory, chutes deploy. What more do you need?\n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2018-01-15T19:35:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268647\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516040470\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWishful thinking, think 90,000 feet and explosive decompression and followed by at least complete loss of consciousness in 15 seconds. The logic here is that if the orbiter had survived structurally  . . . . .x, y, z could have happened. Orbiter did not survive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou are misrepresenting his point here. He\u0027s not claiming the astronauts could have survived the Challenger disaster with the Space Shuttle as it was.\n\u003C/p\u003E\n\u003Cp\u003E\nThe logic is that if the Orbiter had been replaced by a conventional capsule-with-LAS design, that capsule would have stood a great chance of getting out intact. The Orbiter was doomed by its design, which put the crewed vehicle on the side of its propellant and two SRBs, and had no abort mode for failing SRBs. Had the ground crew or Shuttle crew decided \u0022okay, we need to abort now\u0022... they could not have aborted until the SRBs burned out, because the earliest abort past a pad abort was an RTLS after \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E burnout.\n\u003C/p\u003E\n\u003Cp\u003E\nA conventional stack, on the other hand, the LAS could have been fired off, separating the crew from the failing \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E. The exact same \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E with the exact same circumstances and exact same launch pressures would not have doomed Challenger\u0027s crew \u003Cem\u003Eif there was a functional abort mode\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s the advantage of the conventional pod-with-LAS: no matter what happens to the extremely complicated launch vehicle, the crew is still alright if a much smaller and simpler abort system functions. The Shuttle didn\u0027t have that, and that killed several astronauts.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile a LAS would not have saved Columbia\u0027s crew (as the foamstrike damage was not discovered during launch), it too was the fault of putting the crewed vehicle on the side of the propellant tank. Debris from the launch vehicle itself caused critical damage to the Orbiter, something that would have been physically impossible if the crew vehicle was on top of the launch vehicle.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-01-15T19:59:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268700\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516044933\u0022 data-ipsquote-userid=\u0022122674\u0022 data-ipsquote-username=\u0022Starman4308\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Starman4308 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe logic is that if the Orbiter had been replaced by a conventional capsule-with-LAS design, that capsule would have stood a great chance of getting out intact. The Orbiter was doomed by its design, which put the crewed vehicle on the side of its propellant and two SRBs, and had no abort mode for failing SRBs. Had the ground crew or Shuttle crew decided \u0022okay, we need to abort now\u0022... they could not have aborted until the SRBs burned out, because the earliest abort past a pad abort was an RTLS after \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E burnout.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s the advantage of the conventional pod-with-LAS: no matter what happens to the extremely complicated launch vehicle, the crew is still alright if a much smaller and simpler abort system functions. The Shuttle didn\u0027t have that, and that killed several astronauts.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile a LAS would not have saved Columbia\u0027s crew (as the foamstrike damage was not discovered during launch), it too was the fault of putting the crewed vehicle on the side of the propellant tank. Debris from the launch vehicle itself caused critical damage to the Orbiter, something that would have been physically impossible if the crew vehicle was on top of the launch vehicle.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, it\u0027s hard to beat the inherent safety factor of a capsule-on-top design. That being said, the attractiveness of parallel staging, both from a thrust\u002B\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E perspective and from a structural perspective, is obvious. The structural aspect is particularly apparent when you\u0027re talking about a large reusable cargo bay; you have to have a HUGE first stage (e.g., BFR) to get a cargo bay up on top of a serially-staged LV.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is really no good way to combine crew safety and parallel staging. \n\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2018-01-15T20:04:00Z","Content":"\n\u003Cp\u003E\nOther guys beat me to my own point. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYes, if SLS were to suffer the exact same failure as Challenger, the crew would likely survive. Even if the abort motor \u003Ci\u003Edidn’t\u003C/i\u003E fire (and in the case of Challenger they knew for a while there was a problem, the plume from the booster was visible for nearly 20 seconds), the capsule would most likely survive much as the Dragon capsule survived the initial breakup of that CRS flight. \n\u003C/p\u003E\n\u003Cp\u003E\nPutting a crew on the \u003Ci\u003Eside\u003C/i\u003E of the rocket where they \u003Ci\u003Ecannot\u003C/i\u003E abort (and their heat shield is completely unprotected) was the critical safety design flaw of the shuttle. \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2018-01-15T20:28:03Z","Content":"\n\u003Cp\u003E\nThis site has an interesting history of early space shuttle proposals:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.pmview.com/spaceodysseytwo/spacelvs/sld001.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.pmview.com/spaceodysseytwo/spacelvs/sld001.htm\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-01-15T20:38:24Z","Content":"\n\u003Cp\u003E\nAlso, because I apparently can\u0027t keep myself from derailing threads....\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSLS has three stages: Boosters, Core, Upper Stage. The following numbers are for Block IB and LEO throw, assuming that with hydrolox upper stages the BLEO performance will be comparable:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EPayload: \u003C/strong\u003E100 tonnes\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nEUS: 440 kN thrust, 465s, 130 tonnes propellant, est. dry mass 16.5 tonnes.\n\u003Cul\u003E\u003Cli\u003E\n\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E: 3.4 km/s\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E: 0.2\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nCore: 9116 kN thrust, 366s, 894 tonnes propellant, dry mass 85.3 tonnes.\n\u003Cul\u003E\u003Cli\u003E\n\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E (central stack): 5.97 km/s\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E (central stack): 0.76\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nBoosters (each): 16,000 kN thrust, 242s, 625 tonnes propellant, est. dry mass 114 tonnes.\n\u003Cul\u003E\u003Cli\u003E\n\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E (whole stack): 1.47 km/s\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E (whole stack): 1.2\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSo let\u0027s say we want to match this with a vacuum-expanded BE-3 on the upper stage, a cluster of Raptors on the core, and clustered Merlins on the boosters, with optional LOX crossfeed from the boosters to the raptors. That\u0027s just about the ideal liquid-fueled LV, from a thrust-and-isp standpoint, even though obviously we would never see SpaceX and BO engines on the same vehicle (or any SpaceX engines on a non-SpaceX vehicle).\n\u003C/p\u003E\n\u003Cp\u003E\nAny estimates of the isp or mass of a vacuum-expanded BE-3?\n\u003C/p\u003E\n\u003Cp\u003E\nIf not, we can just skip this and go straight to the Raptor core and Merlin boosters.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2018-01-15T20:46:17Z","Content":"\n\u003Cp\u003E\nActually, as a non \u0022commercial XXX\u0022 vehicle, any true NASA vehicle would indeed be exactly such a hybrid of company A core, company B, US, etc. That\u0027s how NASA rolls.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2018-01-15T20:48:24Z","Content":"\n\u003Cp\u003E\nI like that the Shuttle did something different and ambitious and made it work*. Vertically oriented pods are overall the better choice, but if that was \u003Cem\u003Eall\u003C/em\u003E anyone had ever launched to orbit, the world would be a more boring place. I learned a lot from building asymmetric thrust vehicles in KSP, and I have the Shuttle to thank for that.\n\u003C/p\u003E\n\u003Cp\u003E\nWasn\u0027t there some NASA messaging at the time about the Shuttle making spaceflight routine? I think that affected how it is seen. Mercury and Apollo were over and everybody wanted/expected the risks to end as well, because time and technology. Apollo killed a crew \u003Cem\u003Eon the pad\u003C/em\u003E, and nearly suffocated another in space due to multiple flaws with a complex chain of causes not unlike the O-ring disaster. But the successes outshine those failures. I think the Shuttle also deserves some of that forgiveness.\n\u003C/p\u003E\n\u003Cp\u003E\nI also find the Shuttle had the coolest looking launches. But I couldn\u0027t ask the taxpayer to keep flying it just to entertain me (or for any of the other above reasons).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n* Yes, I know, two crews lost...\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nChallenger was more of an indictment of the program\u0027s management than the vehicle; they were told it was too cold to launch safely and they went ahead anyway because they thought they could squeak by while God was looking the other way. Any rocket could fail if it was subjected to that kind of \u0022go-fever\u0022 decision making. (\u0022Yes, I know there was a problem with yesterday\u0027s static fire test, but this Commercial Crew is due at the ISS tomorrow and we only have the pad reserved for this week. Let\u0027s just go for it.\u0022)\n\u003C/li\u003E\n\u003Cli\u003E\nColumbia is a legit indictment of both in my book. You knew there was stuff falling off the tank and you knew the crew module was in the way of that stuff. Orbital repair capability? \u0022Physician, heal thyself.\u0022\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-01-15T21:21:34Z","Content":"\n\u003Cp\u003E\nWas looking at the old Shuttle-C designs. Hard to imagine that NASA was so sold on maintaining the ET\u002B\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E design that they\u0027d consider a vehicle which pushed three useless SSMEs into orbit using OMS engines with NO recovery plan. Like, at that point, just design the whole aft end to break off before kicking on the OMS system!\n\u003C/p\u003E\n\u003Cp\u003E\nI believe the only way to combine parallel staging with actual crew safety would be to do something like a scaled-down BFS, crossfed from a pair of parallel boosters, with a capsule-shaped crew cabin\u002BOMS that could re-enter independently. OMS acts as \u003Cabbr title=\u0022Launch Escape System\u0022\u003ELES\u003C/abbr\u003E in an abort scenario.\n\u003C/p\u003E\n\u003Cp\u003E\nCrossfeed is necessary because that\u0027s the only way to get volume in the core for a cargo bay.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-01-15T21:33:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268700\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516044933\u0022 data-ipsquote-userid=\u0022122674\u0022 data-ipsquote-username=\u0022Starman4308\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Starman4308 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe logic is that if the Orbiter had been replaced by a conventional capsule-with-LAS design, that capsule would have stood a great chance of getting out intact. The Orbiter was doomed by its design, which put the crewed vehicle on the side of its propellant and two SRBs, and had no abort mode for failing SRBs. Had the ground crew or Shuttle crew decided \u0022okay, we need to abort now\u0022... they could not have aborted until the SRBs burned out, because the earliest abort past a pad abort was an RTLS after \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E burnout.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou proport a solution, and you are pushing thats what I understand.\n\u003C/p\u003E\n\u003Cp\u003E\nIf that booster were the same distance from the failing of the seal to the bottom of the Soyuz capsule everyone on the soyuz capsule would have died also and no-one would of escaped.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are two risk management logics here\u0026gt;\u003Cbr\u003E\n1. That the defense department should not have been trying to stick a launch time on a civilian space craft (the person who made this decision should have been prosecuted).\u003Cbr\u003E\n2. That the failing of the SRBs, its potential weaknesses,the fact that its \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E was low and really was not economically recyclable should have seen an opting for a more safe and effective booster.\n\u003C/p\u003E\n\u003Cp\u003E\nI know, for fact, for instance if there is a complete engine failure (such as an ash cloud passing or a flock of ducks) shortly after a 747 takes off, it will unlikely land safely, thats a risk you take when you fly.\u003Cbr\u003E\nThe same was more so true for a Concorde.\n\u003C/p\u003E\n\u003Cp\u003E\nMy suggestion here is if you want to do risky stuff in risky space, you have to crawl out of your momma\u0027s bossom a bit.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268723\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516046640\u0022 data-ipsquote-userid=\u002257438\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, CatastrophicFailure said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOther guys beat me to my own point. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYes, if SLS were to suffer the exact same failure as Challenger, the crew would likely survive. Even if the abort motor \u003Ci\u003Edidn’t\u003C/i\u003E fire (and in the case of Challenger they knew for a while there was a problem, the plume from the booster was visible for nearly 20 seconds), the capsule would most likely survive much as the Dragon capsule survived the initial breakup of that CRS flight. \n\u003C/p\u003E\n\u003Cp\u003E\nPutting a crew on the \u003Ci\u003Eside\u003C/i\u003E of the rocket where they \u003Ci\u003Ecannot\u003C/i\u003E abort (and their heat shield is completely unprotected) was the critical safety design flaw of the shuttle. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf the SLS would ever get a crew in space (next 5 years) we can discuss that. IF wishes were horses beggars would ride.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2018-01-15T21:43:16Z","Content":"\n\u003Cp\u003E\nSome of the early shuttle concepts in that link I posted used drop tanks, and all the rocket engines were on the reusable shuttle. A couple look a lot like 2 shuttle external tanks with the shuttle in the center. \n\u003C/p\u003E\n\u003Cp\u003E\nI’m still in he camp of mostly keeping crew and cargo separate. Cost savings can be had the F9 way (recovering parts of the LV), or simply by lofting large payloads in fewer launches that are less expensive. Shuttle flights were so incredibly expensive. Once D2 or cst-100 are flying, what could you launch for the 1.whatever billion price tag of just a single shuttle launch?\n\u003C/p\u003E\n\u003Cp\u003E\nCrew and assembly? Launch either crew capsule, AND a hub/airlock module with a robotic arm (another launch). You still have 10 launches to play with to equal shuttle in cost.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-15T21:44:04Z\u0022 title=\u002201/15/2018 09:44  PM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 15, 2018\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2018-01-15T22:31:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268788\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516052021\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nf that booster were the same distance from the failing of the seal to the bottom of the Soyuz capsule everyone on the soyuz capsule would have died also and no-one would of escaped\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n Not sure what you’re trying to say here? The crew module of the shuttle wasn’t anywhere near the failed seal, either. The jet from the seal cut through an \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E strut, the \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E shifted and hit the ET, and the whole mess crumbled. It didn’t \u003Ci\u003Eexplode\u003C/i\u003E, it broke up, mostly from aerodynamic, forces. We know the crew compartment of the shuttle \u003Ci\u003Edid\u003C/i\u003E survive the breakup. A space capsule likely would too, as they’re built incredibly strong (see: Dragon in failed CRS launch again).\n\u003C/p\u003E\n\u003Cp\u003E\nBut Anyway, my friend, you seem to be missing the point that they \u003Ci\u003Eknew\u003C/i\u003E Challenger was failing for a good long time, \u003Ci\u003Emore\u003C/i\u003E than enough to activate an abort system had one been present, but the inherent design prevented this.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268788\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516052021\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n57 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nf the SLS would ever get a crew in space (next 5 years) we can discuss that. IF wishes were horses beggars would ride\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUm... whether SLS will ever fly isn’t the point, the point is, that if it \u003Ci\u003Edid\u003C/i\u003E suffer the same failure as Challenger, the crew would most likely abort and survive...\n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2018-01-15T23:13:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268788\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516052021\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI know, for fact, for instance if there is a complete engine failure (such as an ash cloud passing or a flock of ducks) shortly after a 747 takes off, it will unlikely land safely, thats a risk you take when you fly.\u003Cbr\u003E\nThe same was more so true for a Concorde.\n\u003C/p\u003E\n\u003Cp\u003E\nMy suggestion here is if you want to do risky stuff in risky space, you have to crawl out of your momma\u0027s bossom a bit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, something that clearly happens all the time, because we know air travel is the most dangerous form of transportation out there.\n\u003C/p\u003E\n\u003Cp\u003E\nOh, no wait, it\u0027s the \u003Cem\u003Esafest \u003C/em\u003Eper passenger-mile.\n\u003C/p\u003E\n\u003Cp\u003E\nYour disingenuous insult is also very easy to say when you\u0027re not the one climbing into a vehicle with a 2/135 failure rate, when you\u0027re not the one authorizing those launches, when you\u0027re not even the guy inspecting the heatshield for defects.\n\u003C/p\u003E\n\u003Cp\u003E\nWe know space travel is risky, but that\u0027s no excuse for asking astronauts to fly in inherently flawed vehicles, nor is it an excuse for asking the American public to pay for disproportionately expensive orbital launch vehicles. You seem obsessed with the fact that there\u0027s been a gap in US orbital capabilities imposed by cancellation of the Space Shuttle program, and ignore, twist, or misrepresent all other factors towards that singular fact.\n\u003C/p\u003E\n\u003Cp\u003E\nThe gap itself was caused when the federal government approved an inherently flawed and overly ambitious space transport plan, and it lasted so long because the federal government couldn\u0027t make up its mind on how to replace it, with the Ares program followed by SLS, with a few bucks thrown towards actually reasonable proposals to restore LEO manned capability.\n\u003C/p\u003E\n\u003Cp\u003E\nHad there been actual determination to restore manned spaceflight capacity, there would have been essentially no gap. The underfunded commercial crew delivery program will almost certainly be sending up astronauts either late this year or early 2019, and was started in 2010. 9 years from the Columbia disaster gets you to 2010, a year before the Space Shuttle was retired.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022My God, Thiokol, when do you want me to launch - April?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nYes, I want you to launch in April, if that\u0027s what it takes for the mission to succeed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: On a much lighter note, the sheer absurdity of the Armageddon scene made me do the math: even with a cargo bay filled with extra OMS fuel, I\u0027m pretty sure they couldn\u0027t have managed more than 1400 m/sec of delta-V out of the OMS, which would be nowhere near enough to hit Earth escape velocity, nevermind turn back around and manage a 0-velocity rendezvous with an asteroid. This, I\u0027m sure, is the only glaring inaccuracy in the entire movie.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-15T23:44:44Z\u0022 title=\u002201/15/2018 11:44  PM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 15, 2018\u003C/time\u003E by Starman4308\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-01-16T00:49:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268788\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516052021\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf that booster were the same distance from the failing of the seal to the bottom of the Soyuz capsule everyone on the soyuz capsule would have died also and no-one would of escaped.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow would that happen? There\u0027s no way for a top mounted capsule to be anywhere near a failing \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E seal. *Especially* not a Soyuz.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-16T00:54:58Z\u0022 title=\u002201/16/2018 12:54  AM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 16, 2018\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2018-01-16T00:54:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268839\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516057995\u0022 data-ipsquote-userid=\u0022122674\u0022 data-ipsquote-username=\u0022Starman4308\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Starman4308 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEDIT: On a much lighter note, the sheer absurdity of the Armageddon scene made me do the math: even with a cargo bay filled with extra OMS fuel, I\u0027m pretty sure they couldn\u0027t have managed more than 1400 m/sec of delta-V out of the OMS, which would be nowhere near enough to hit Earth escape velocity, nevermind turn back around and manage a 0-velocity rendezvous with an asteroid. This, I\u0027m sure, is the only glaring inaccuracy in the entire movie.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks, I always wondered this. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat about with big silly boosters strapped to the sides?\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-01-16T00:55:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268839\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516057995\u0022 data-ipsquote-userid=\u0022122674\u0022 data-ipsquote-username=\u0022Starman4308\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, Starman4308 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, something that clearly happens all the time, because we know air travel is the most dangerous form of transportation out there.\n\u003C/p\u003E\n\u003Cp\u003E\nOh, no wait, it\u0027s the \u003Cem\u003Esafest \u003C/em\u003Eper passenger-mile.\n\u003C/p\u003E\n\u003Cp\u003E\nYour disingenuous insult is also very easy to say when you\u0027re not the one climbing into a vehicle with a 2/135 failure rate, when you\u0027re not the one authorizing those launches, when you\u0027re not even the guy inspecting the heatshield for defects.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGo back to the 1920s and 1930s. I will address all of your comments in a second but I will address this specifically. The reason Air-travel is the safest per mile is a whole lot of things have to be correct before it takes off. You don\u0027t think of it now, but in the mid-1970s no one thought about vertical windsheer, in the mid to late 70s there were a few incidences where planes taking off and then engine loses power and it drops from the sky, nothing really wrong with the craft but people on the ground reported something about the air. Its was researched and found the aircraft was experiencing windsheer because the airport was close to a cell at the time the plane takes off. So they add windsheer detectors at the airport. There are other things, a plane flying across South America disappears, another pilot says geeze its interesting that I was 60 miles off course, and so high altitude winds become part of the weather estimates. This type of thing.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the shuttle or any spacecraft is no different, Apollo 13 was hit by cloud lightning, the shuttles seal failed because of excessive cold. And so by flying we learned more parameters that constitute good flight. And these things are context specific, bad weather for a blimp is not the same as bad weather for a Concorde or the same as bad weather for the shuttle. That is not disingenuine, its just the way humans learn.\u003Cbr\u003E\nMany of the major pioneers of flight died while flying, dare to use the word hero, but of course if you are flying today your safety comes from lessons they taught us in their activities. This is what is, this is what happened. Of the 144  flights of the shuttle their was one upper atmospheric failure, so it was not common, the flaw was researched and it was found to be a judgement error, not specifically a vehicle malfunction. There is no rationalization of judgement errors, depending on how severe the error any system can be compromised . . . . from confusion about the trustability of pitot-tubes on AF447 to the downing of the commercial plane to the disappearance of MH370. The STS-51-L vehicle did perform as rated or more correctly it failed when performing outside of its predetermined rating. This is physics plain and simple. So engineer looked at the thermal expansion of a rubber ring in manifold and determined that if the temperature fell below X, its position may not be fixed and it may move, and during the flight this happened and there was a highly predictable accident. It was not clear that the orbiter would suffer catastrophic damage but it did and people died, it was not the orbiters fault, the boosters fault per-say or the engineers fault since its limitation was known. But in these accidents we still learn things that result in improvements, we ask questions about safety margins, etc. . . . . we learn.\n\u003C/p\u003E\n\u003Cp\u003E\nI am not questioning the concept you present I am wholy questioning your focus.\u003Cbr\u003E\nThe point is that the shuttle launched, other than the ISS living portions about a dozen science missions, including one it left in space and then retrieved to study the damage of space on a number of materials (the so called materials science test in KSP).  OK, so we have to conceptualize what we are doing in a valid context, borrowing from above we ask the question what was the Wright brothers doing, it was certainly dangerous, but what was it. They are testing the engineering model as free standing aerodynamic system. The system is very crude, but we know very little about the dynamic, so that is OK, it is because they began the first serious model then today we have very safe models and we know magnitudes more about aerodynamics than they did. But that is what had to happen  for us to have flight safety. Hubble was a model space telescope, it was found to  be incorrect, the shuttle allowed us to test a repair, it worked, and more modifications were made and now Hubble is a historical science platform.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the focus, so you know how to better use space you have to learn about space just like the writght borthers learned about aerodynamics\n\u003C/p\u003E\n\u003Cp\u003E\n11. Rescue of the\u003Cstrong\u003E Solar Max\u003C/strong\u003E Solar observation satellite.\u003Cbr\u003E\n13. Earth radiation budget satellite.\u003Cbr\u003E\n15. First retrieving and recycling of a satellite (2) \u003Ca href=\u0022https://en.wikipedia.org/wiki/Palapa\u0022 title=\u0022Palapa\u0022 rel=\u0022external nofollow\u0022\u003EPalapa\u003C/a\u003E B2 and \u003Ca href=\u0022https://en.wikipedia.org/wiki/Westar\u0022 title=\u0022Westar\u0022 rel=\u0022external nofollow\u0022\u003EWestar\u003C/a\u003E VI\u003Cbr\u003E\n16. First repair of  a commercial satellite in space.\u003Cbr\u003E\n17. Microgravity experiments\u003Cbr\u003E\n22. Spacelab\u003Cbr\u003E\n29 \u003Cstrong\u003EMagellan\u003C/strong\u003E Venus probe.  ( September 19th 1990 - \u003Ci\u003ESeptember 14, 1994)\u003C/i\u003E\u003Cbr\u003E\n31 \u003Cstrong\u003EGalileo\u003C/strong\u003E Jupiter probe deployment ( 14 years in space and 8 years in the Jovian system )\u003Cbr\u003E\n36 \u003Cstrong\u003EUlysses\u003C/strong\u003E intertial upper stage\u003Cbr\u003E\n38 ASTRO-1 observatory\u003Cbr\u003E\n39 \u003Cstrong\u003ECompton\u003C/strong\u003E Gamma ray observatory \u0026lt;========\u0022 the heaviest astrophysical payload ever flown at that time at 17,000 kilograms \u0022\u003Cbr\u003E\n43 Upper atmosphere research satellite\u003Cbr\u003E\n46 ATLAS-1 deployment\u003Cbr\u003E\n51 LAGEOS geodescic radar study.\u003Cbr\u003E\n54 ATLAS-2 deployment \u003Cbr\u003E\n66- Atlas-3 science platform\u003Cbr\u003E\n74 Japan flyer mission retrieved.\u003Cbr\u003E\n75 Tethered satellite testing\u003Cbr\u003E\n80 Wake shield testing, \u003Cbr\u003E\n80 Retrievable UV experiment launch\u003Cbr\u003E\n95 Chandra X-ray observatory\u003Cbr\u003E\n97 Shuttle radar topography mission\u003Cbr\u003E\n108 hubble servicing and performance upgrade\u003Cbr\u003E\n126-  last hubble servicing and performance upgrade.\u003Cbr\u003E\n134 - alpha-magetic spectrometer\n\u003C/p\u003E\n\u003Cp\u003E\nSo the abstract problem I have with you is that you think all risk is equal and so minimize risk no matter the other cost. So why Wright brothers take risk and why be benefit, to learn how for humans to fly. And why shuttle takes risk to learn how to do space in a different way an learn. If you can\u0027t understand that some risks are worth taking and some are not we have nothing to talk about. But I would say the Wright brothers would disagree with you, so would Galileo, so would Neil Armstrong, so would most of the astronauts. And that\u0027s the point, its their risk to take, not yours.\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-01-16T01:01:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268903\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516064121\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you can\u0027t understand that some risks are worth taking and some are not we have nothing to talk about.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAll due respect, but I believe you are the one who is struggling with this concept. If you have a choice of ways to complete a job and one is inherently safer and more economical, then that\u0027s what you go with. You don\u0027t just shrug off the unnecessary hazard and cost by shrugging and saying \u0022life is hard, suck it up\u0022. I find this argument completely unpersuasive and more than a little callous.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"Jaff","CreatedById":172505,"CreatedDateTime":"2018-01-16T01:05:46Z","Content":"\n\u003Cp\u003E\nSatisfy a question if you would guys, \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nchallenger - if they knew the booster was goosed 20 seconds before it went bang, why not separate them and abort the mission? \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-01-16T01:07:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268907\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516064517\u0022 data-ipsquote-userid=\u0022111526\u0022 data-ipsquote-username=\u0022GoSlash27\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, GoSlash27 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAll due respect, but I believe you are the one who is struggling with this concept. If you have a choice of ways to complete a job and one is inherently safer and more economical, then that\u0027s what you go with. You don\u0027t just shrug off the unnecessary hazard and cost by shrugging and saying \u0022life is hard, suck it up\u0022. I find this argument completely unpersuasive and more than a little callous.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSometimes it is and you have to suck it up\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-01-16T01:10:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268915\u0022 data-ipsquote-contentid=\u0022169590\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516064847\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSometimes it is and you have to suck it up\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, and sometimes it doesn\u0027t have to be and you make it easier when you can. Still not a persuasive argument.\n\u003C/p\u003E\n"}]}