{"TopicId":170840,"ForumId":44,"TopicTitle":"Student contest for designing a 10t payload Mars Lander","CreatedByName":"Jirokoh","CreatedById":182820,"CreatedDateTime":"2018-02-12T17:40:47Z","PageNum":1,"Articles":[{"CreatedByName":"Jirokoh","CreatedById":182820,"CreatedDateTime":"2018-02-12T17:40:47Z","Content":"\n\u003Cp\u003E\nHello everybody !\n\u003C/p\u003E\n\u003Cp\u003E\nFirst of all, if this is inappropriate, well let me know, and sorry if it is, I just hope it\u0027s not\n\u003C/p\u003E\n\u003Cp\u003E\nSo here\u0027s the deal: I\u0027m an aerospace engineering student, and with some friends we decided to take part in a student contest held by The Mars Society. the aim is to design a lander capable of landing a 10t payload on Mars. So, that\u0027s not really an easy task, considering the most that ever was landed was the MSL, Curiosity, which is less than 1t.\u003Cbr\u003E\u003Cbr\u003E\nSo, I\u0027m calling for some help amongst you all! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E We are students, and we are seeking for all the help we could get, so I figured I might try asking on the KSP forums, after all we all love this kind of challenges in game, so why not in real life?\u003Cbr\u003E\u003Cbr\u003E\nWe have a bunch of ideas, but we do not really know to what extend those might be possible, and this is why I\u0027m asking for a little help\u003Cbr\u003E\nSo would any of you be willing to help a few students designing a heavy sized Martian lander? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nThanks a lot! And again, if this is inappropriate, please tell me, and I apologize if it\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-02-12T18:21:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223293260\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518457247\u0022 data-ipsquote-userid=\u0022182820\u0022 data-ipsquote-username=\u0022Jirokoh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Jirokoh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHello everybody !\n\u003C/p\u003E\n\u003Cp\u003E\nFirst of all, if this is inappropriate, well let me know, and sorry if it is, I just hope it\u0027s not\n\u003C/p\u003E\n\u003Cp\u003E\nSo here\u0027s the deal: I\u0027m an aerospace engineering student, and with some friends we decided to take part in a student contest held by The Mars Society. the aim is to design a lander capable of landing a 10t payload on Mars. So, that\u0027s not really an easy task, considering the most that ever was landed was the MSL, Curiosity, which is less than 1t.\u003Cbr\u003E\u003Cbr\u003E\nSo, I\u0027m calling for some help amongst you all! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E We are students, and we are seeking for all the help we could get, so I figured I might try asking on the KSP forums, after all we all love this kind of challenges in game, so why not in real life?\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n10t = 10,000 kg. Atmosphere density on Mars is like 0.6/101 what it is on earth g-forces are about a 3rd. If terminal velocity is say 40-50 meters per second  on Earth then on Mars it will be over the speed of sound for an object of density 1, a length of about 2 meters and however wide it is (say 1.2 meters in diameter).  400 m/s and if you account for Mach shock say 0.95 whatever the speed of sound is. Its a lower speed if you choose a higher elevation, higher speed if you choose a lower elevation. If you set the landing velocity maximum to 10 m/s then you would need a parachute roughly 500 m in radius to slow you down (you wont be able to do this), at minumum (without parachute) you would have to burn 500 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E of fuel. Another method is to aerodynamically load surfaces for example a wing, this then allows the craft to fight gravity at the same time conserving lift and providing a horizontal direction of motion which to create drag in, BFR. A particle traveling to its perigee achieves a flat trajectory at PE and there after rises, it momentum is horizontal, and the drag it creates is in the horizontal direction, if lift or thrust is provided in the verticle direction the craft can stay alot long enough to dissipate much of its speed, while eventually letting g-v\u003Csup\u003E2\u003C/sup\u003E/r to craft intercept the ground. With a properly designed entry and lift surface this can get you optimistically down to 200 m/s after which you will need \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to land.\n\u003C/p\u003E\n\u003Cp\u003E\nDropping vertically from space is a bad idea, because integral of drag forces with respect to distance is dominated by proximity to the ground, the craft will never reach terminal velocity before engines would need to fire to burn off speed and that negates most of the drag loses from energy. \n\u003C/p\u003E\n\u003Cp\u003E\nDownload \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E (real solar systems). There is a Mars there and you can practice making structures and see which structures need the least \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to land. Be aware that Mars have no ocean, elevation is measured from the lowest point on Mars, which would be the equivilent of measure altitude on the Earth from the bottom of the Mariannas trench. As a consequence your target altitudes are going to be higher than you think. I made a WWI styles triplane that was very effective of dissipating drag forces continuously (sort of), but KSP is not good at modeling mach forces at high altitude. And basically once you get close to M=1 \u0026lt;350 m/s you need to abandon the wing and retrofire the rockets. Remember that the wing that provides lift below Mach 1 does not work the same above Mach 1. Below Mach 1 a wing tilt above 14\u0027 to \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E is generally a stall that provided no lift. In space Wings act as a particle deflector if you assume elastic collisions, it means that a tilte between 30 and 45 may be more effective until atmosphere thickens.\n\u003C/p\u003E\n\u003Cp\u003E\nGuidelines\u003Cbr\u003E\nFuel enough to burn off 500 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003Cbr\u003E\nSome sort of Engine capable of producing a multiple of the crafts weight 10kt * g: e.g. 3 x 10,000 x 3.8 m/s = 114,000 N of thrust (RL10b-2 has 110,000 but you cannot carry the fuel to mars, too volatile).\u003Cbr\u003E\nSome sort of Carriage that provides lift and drag (expendable)\u003Cbr\u003E\nSome sort of technology to avert the effects of re-entry (an ablatable surface)\u003Cbr\u003E\nSome sort of landing struts. (on some of my craft I just us piping, the piping can be assembled as the lunar model, the more bends in the piping from the verticle access the more cushion it can give).\u003Cbr\u003E\nSome sort of steering engines (landing generally works best with main engine pointing down)\u003Cbr\u003E\nSome sort of guidance system (knows direction of ground and space).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Steel","CreatedById":49317,"CreatedDateTime":"2018-02-12T20:10:28Z","Content":"\n\u003Cp\u003E\nIs there a link to the contest?\n\u003C/p\u003E\n"},{"CreatedByName":"DAL59","CreatedById":180784,"CreatedDateTime":"2018-02-12T20:25:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223293375\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518466228\u0022 data-ipsquote-userid=\u002249317\u0022 data-ipsquote-username=\u0022Steel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Steel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there a link to the contest?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.marssociety.org/mars-society-announces-red-eagle-international-student-engineering-contest-design-mars-lander/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.marssociety.org/mars-society-announces-red-eagle-international-student-engineering-contest-design-mars-lander/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Human Person","CreatedById":174876,"CreatedDateTime":"2018-02-13T00:51:24Z","Content":"\n\u003Cp\u003E\nvery interesting! I have a Mars lander that can carry a 2t rover (in a 4m payload bay). I could try to scale it up.\n\u003C/p\u003E\n"},{"CreatedByName":"Jirokoh","CreatedById":182820,"CreatedDateTime":"2018-02-13T09:58:19Z","Content":"\n\u003Cp\u003E\nThanks for the answer! Actually for slowling down we were thinking of using aerobraking, just like the Mars Reconnaissance Orbiter. This has been done on multiple probe,s but was never used for landers.\u003Cbr\u003E\nDO you guys know why this is the case? I know aerobraking is pretty tough, and very long, but we don\u0027t care because this is not a manned craft, so we can take all the time we want.\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing that is important is that the craft must be designed, build and certified before 2026, so no crazy new tech should be used, that\u0027s why we thought of aerobraking, because it\u0027s a known technology and method\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2018-02-13T10:37:02Z","Content":"\n\u003Cp\u003E\nI will see what i can do. shouldn\u0027t be too hard right? Ok, its not going to be easy lol.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-13T10:37:15Z\u0022 title=\u002202/13/2018 10:37  AM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 13, 2018\u003C/time\u003E by NSEP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-02-13T12:56:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223293922\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518515899\u0022 data-ipsquote-userid=\u0022182820\u0022 data-ipsquote-username=\u0022Jirokoh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Jirokoh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks for the answer! Actually for slowling down we were thinking of using aerobraking, just like the Mars Reconnaissance Orbiter. This has been done on multiple probe,s but was never used for landers.\u003Cbr\u003E\nDO you guys know why this is the case? I know aerobraking is pretty tough, and very long, but we don\u0027t care because this is not a manned craft, so we can take all the time we want.\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing that is important is that the craft must be designed, build and certified before 2026, so no crazy new tech should be used, that\u0027s why we thought of aerobraking, because it\u0027s a known technology and method\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOn March 30, 2006, MRO began the process of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Aerobraking\u0022 rel=\u0022external nofollow\u0022 title=\u0022Aerobraking\u0022\u003Eaerobraking\u003C/a\u003E, a three-step procedure that cuts in half the fuel needed to achieve a lower, more circular orbit with a shorter period. First, during its first five orbits of the planet (one Earth week), MRO used its thrusters to drop the periapsis of its orbit into aerobraking altitude. This altitude depends on the thickness of the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Atmosphere_of_Mars\u0022 rel=\u0022external nofollow\u0022 title=\u0022Atmosphere of Mars\u0022\u003Eatmosphere\u003C/a\u003E because Martian atmospheric density changes with its seasons. Second, while using its thrusters to make minor corrections to its periapsis altitude, MRO maintained aerobraking altitude for 445 planetary orbits (about five Earth months) to reduce the apoapsis of the orbit to 450 kilometers (280 mi). -wikipedia Mars recon . . . .\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe first question to ask is what they did. They had a orbit at ~50,000 km from the surface (for reference the moon is ~300,000 km from Earth) and they need  an orbit much smaller.\n\u003C/p\u003E\n\u003Cp\u003E\nThey started with an orbit that was (surface-radius \u002B 426 km) X (surface radius \u002B 44,500km) to understand what they did and why you need to study Keplar\u0027s laws of Plantary motion. The equations that you want to use are the definition of a (semi-major axis) and the vis-visa equation. To avoid confusing radius (e.g. a circle) with radial distance, imagine that \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E as a vector point from the planets center of mass to the point of lowest orbit, this is called a position vector, the length is the magnitude of that vector, so we are not referring to a radius of r but the magnitude of the position vector, the orbital maneuvers change the position of the vectors. \n\u003C/p\u003E\n\u003Cp\u003E\nStep\u003Cbr\u003E\none:     convert altitudes to radial distances. \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E = 3,806,000 meters, Apo = 47,972,000\u003Cbr\u003E\ntwo:     \u003Cem\u003Ea\u003C/em\u003E =  Average the two . . . . 25,889,000\u003Cbr\u003E\nthree:   calculate the velocity at apoapsis. SQRT( µ * (2/a - 1/r)) = 362.28 m/s\u003Cbr\u003E\nfour:     the desired orbit (braking orbit); although they did not say what this was, lets assume that orbits \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E was altitude = 50 km (r = 3430000). the velocity at apo = 345.14. \u003Cbr\u003E\nfive:      at apoapsis burn retrograde (362.28 - 345.14) =   17.034 m/s       This manuever now puts the spacecrafts motion into the upper atmosphere of Mars. It would be equivalent approximately to placing a spacecraft periapsis about 90km from the surface of Earth, such an orbit would decay quickly.\u003Cbr\u003E\nsix:      Lets say that during each pass at the periapsis the spacecraft looses 100 m/s of velocity, how many passes would it need to place the apoapsis at altitude  =  450 km. This is not what they did, what they did was more compllicated, they started at a higher altitude to bleed off peak velocity and let the orbit decay, what I will do is just simplify. The r-vector is 3,430,000, this then needs a velocity of 3250 at the Apogee. But this is not what we want we want the difference of the velocity at the perigee. So for that we have to apply the vis-visa equation to the perigee.  The original velocity of \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E (That is the speed of the craft at \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E) = \u003Cstrong\u003E4,827\u003C/strong\u003E m/s and we want to drop that speed to 3,629 which means we a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E of 1129 m/s\u003Cbr\u003E\nseven:  After a dozen passes in the atmosphere, prior to the last pass we raise the perigee slightly and then at Apo we burn prograde to put the perigee at 450 km.\u003Cbr\u003E\nby doing this they reduced an amount of fuel that results in 1130 m/s of velocity, and the cost was only 17.034 and the cost of correcting \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E by 400 km (3,430,000 to 3,830,000)\n\u003C/p\u003E\n\u003Cp\u003E\nSo this is not a re-entry aerobraking procedure, this is an orbital correction aerobraking procedure. Its a form of a hohmann transfer. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Hohmann_transfer_orbit\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Hohmann_transfer_orbit\u003C/a\u003E  but instead of correcting at \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E, the first burn (a little longer) is a lower than desired \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E, and aerobraking replaces the second burn, and finally a correction is applied. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nFor a lander you will be coming in upwards of 5,000 m/s . . . and you will not have a delicate satellite. You will have some sort of ablative shield and your perigee will be much lower, if you pass as MRO passed you will fly through the martian atmosphere and back into heliocentric orbit. Because your craft is 10t (very close to the limit of what Earth can launch to mars currently) you will not likely have the fuel on board to slow down 5,500 m/s of velocity to land (which would triple the size of your craft). In this case you need to use the Martian atmosphere to bleed off alot of speed and do it rather quickly. If you have unlimited resources from Earth place a refueling depot in orbit around Mars. In this case you could use the procedure above to place your craft in a parking orbit, refuel, and then proceed to land on Mars.\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the problem, you need about 4400 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to land. So the choice fuel outside of Earth are hypoglolics, they have ISPs of around 250 (2500 m/s exhaust velocity). Why am i mentioning this, many rockets you see launched from Earth are using cryogenic or semi-cryogenic engines (sometimes with sloppy boosters of \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E). These can produce \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E up to 466, twice that of a hypoglolic. In fact, your LEO\u0026gt;Mars injection was probably the result of a Hydrolox or Metholox fuel system.\u003Cbr\u003E\nThe rocket equation specifies \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E = \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E*g*ln(Starting mass/Final Mass). We can calcuate a starting mass for a final mass of 10t. The starting mass of rocket in LMO required to retrograde burn down to the planet is 58t. If we assume that 1/10th of that is engines and fuel tanks, that leaves your lander with 42% of its original mass. To correct we need to increase starting mass to 138t. Right now we cannot even place 138t of mass in LEO, let alone send to Mars. So lets imagine we can send 20t of ship to LMO at a time, each ship having 5t of fuel. That would take 20 deliveries. A very slow ION drive type tug could \u0027handwaving away the power-production issue\u0027 deliver 20t to orbit, but that tug would take 20 years to deliver the fuel required, you would need 5 @ 200t tugs to reduce this to a 2 years, so even that is a non-starter. You could have a solar paneled cryogenic refueling station, metholox (\u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E 375), you probably could get away with a 35t lander at the LMO station resulting in a 12t lander on Mars (less if it uses drop tanks). In the most speculative mid-far future range is hydrolox refueling station. Potentially \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E of 475. This is a spacecraft at LMO of 29t (again you can lower with drop tanks).  Left without choices you end up mulling over the aerodynamics of re-entry.\n\u003C/p\u003E\n\u003Cp\u003E\nThe aerodynamics of re-entry is about as difficult as the rocket science required to get into orbit. This is complex math. The density, temperature and composition of the gas changes with altitude. PV=nRt, but there are particle behaviors, supersonic, transsonic and subsonic dynamics that need to be dealt with. But the ideal situation is that you aim for a \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E in which your KE at \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E (drag losses included) is slightly higher than µ/2r which gives a slight vertical velocity allowing you increase breaking time. This is very difficult to nail down. At this point velocity erodes quickly and then radial velocity starts to decrease rapidly in the direction of -3.8 m/s\u003Csup\u003E2\u003C/sup\u003E. Believe it or not, the higher the initial reentry velocity the easier this is. The reason is that circular orbits degrade by spiraling through the atmosphere, and by definition increase the loss of altitude as a function of time. So really fast entries are a balance between escape velocities, capture braking (MRO-like) and reentry braking procedure and what is idea (provided a great shield) is something between reentry breaking (mostly) and capture braking (a little). At the point that velocity is below Mach 5.0 the shields need to come off and the craft needs to start burning to land. Anything that the craft can provide to keep its radial/verticle velocity closer to zero means more time spent dragging down the speed. But at some point wings will not provide significant lift because of the thinness of the martian atmosphere, at that point they only add weight and should be discarded.  This is the point to burn off horizontal and some vertical velocity. If you are doing this right at the end of your re-entry procedure you will have about 400 m/s of residual velocity. This means you have saved 4400-500 = 3900 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E . . . . . .in the best case scenario you save 17t, in the worst case 100t. So prepare yourself to do some hairy math.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you really want to be a rocket guru, figure out a way to get your ship down to the surface and back to a refueling station (or Earths atmosphere) without using \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E or the like. I think if you can do that and prove it can be done you will have alot of job offers coming in.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-13T20:07:25Z\u0022 title=\u002202/13/2018 08:07  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 13, 2018\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jirokoh","CreatedById":182820,"CreatedDateTime":"2018-02-13T13:39:32Z","Content":"\n\u003Cp\u003E\nWow thanks a lot for the long reply! \u003Cbr\u003E\nJust a few things to mention: I think I didn\u0027t express myself correctly, I should have said it more accurately. Actually 10t is the payload mass, so we need a lander that can carry 10t. The whole lander might be 15, or 20t in total.\u003Cbr\u003E\u003Cbr\u003E\nThen, for the aerobraking, the idea is actually to do a hohmann transfer, because we are going to need to do it anyways. But this has never been done before for a lander, hence my question. Because the conditions of the contest are that we are approaching Mars from interplanetary space with a hyperbolic velocity of 3km/s.\u003Cbr\u003E\nSo we are going to need to slow down a lot. One of our idea was to do a Hohmann transfer to a lower orbit, and also reduce our DeltaV required for landing.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, we can\u0027t do any refuleling in ornit, this is something that we can\u0027t do know, so this is too much in the future for the rules of this contest, even if I agree this looks like a very interesting idea, but just not for us\n\u003C/p\u003E\n\u003Cp\u003E\nBut yeah, one thing is for sure, we are going to be doing quite a lot of maths \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-02-13T16:58:24Z","Content":"\n\u003Cp\u003E\nAre you able to use an inflatable heat shield like HIAD?\n\u003C/p\u003E\n\u003Cp\u003E\nProperly oriented, an inflatable shield could both provide aerobraking on entry and a shuttlecock effect on descent.\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2018-02-13T18:42:28Z","Content":"\n\u003Cp\u003E\nIm going to try out Aerobraking on Mars, in KSP Realism Overhaul. I will livestream the event.\n\u003C/p\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-02-14T01:09:31Z","Content":"\n\u003Cp\u003E\nWould it be at all possible to make better use of the mass of the atmosphere the spacecraft passes through on the way to the surface?  Could it somehow be scooped up and redirected forward, maybe somehow added to the rocket exhaust that is slowing the vehicle down?  \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-02-14T02:46:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223294447\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518570571\u0022 data-ipsquote-userid=\u0022182951\u0022 data-ipsquote-username=\u0022KG3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KG3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWould it be at all possible to make better use of the mass of the atmosphere the spacecraft passes through on the way to the surface?  Could it somehow be scooped up and redirected forward, maybe somehow added to the rocket exhaust that is slowing the vehicle down?  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThats what BFR appears to do, by channeling the atmosphere mass into channels you force it to accelerate and compress (at that velocity gas has alot of momentum so the momentum itself creates significant pressure at any speed greater than mach due to boundary effects. This forces gas into the boundary layer and it becomes part of the ships skin and then is released . . . . . .this is work... you are performing work on the gas. But there is only so much work you can do, once the gases mass is the same speed as the ships, thats the most work than you can do, and it needs to be released so that it can be repeated. So there is a theoretical 2 fold possible improvement over a single wing which is less if you consider to channel more gas you have to move gas along the channel.\u003Cbr\u003E\u003Cbr\u003E\nA parachute does essentially the same thing, it has holes to channel air thought the chute, but above Mach Speed you need a rigid structure, flimsy plastics will not suffice. Thats the Mars problem in a nutshell, on Earth terminal velocities are in the 10s of meters per second range, on Mars terminal velocities are in the 100s of meters per second range.\n\u003C/p\u003E\n"},{"CreatedByName":"Jirokoh","CreatedById":182820,"CreatedDateTime":"2018-02-14T12:14:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223294529\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518576388\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThats what BFR appears to do, by channeling the atmosphere mass into channels you force it to accelerate and compress (at that velocity gas has alot of momentum so the momentum itself creates significant pressure at any speed greater than mach due to boundary effects. This forces gas into the boundary layer and it becomes part of the ships skin and then is released . . . . . .this is work... you are performing work on the gas. But there is only so much work you can do, once the gases mass is the same speed as the ships, thats the most work than you can do, and it needs to be released so that it can be repeated. So there is a theoretical 2 fold possible improvement over a single wing which is less if you consider to channel more gas you have to move gas along the channel.\u003Cbr\u003E\u003Cbr\u003E\nA parachute does essentially the same thing, it has holes to channel air thought the chute, but above Mach Speed you need a rigid structure, flimsy plastics will not suffice. Thats the Mars problem in a nutshell, on Earth terminal velocities are in the 10s of meters per second range, on Mars terminal velocities are in the 100s of meters per second range.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think I understand this tech, how does it actually work?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd for parachutes, we don\u0027t yet have the tech to make strong enough parachutes to hold such mass going at such speeds. So I think we are going to pass on that one\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-02-14T12:37:13Z","Content":"\n\u003Cp\u003E\nBtw, a Martian atmosphere\u003Cbr\u003E\u003Ca href=\u0022https://www.grc.nasa.gov/www/k-12/airplane/atmosmrm.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.grc.nasa.gov/www/k-12/airplane/atmosmrm.html\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-02-14T13:53:59Z","Content":"\n\u003Cp\u003E\nOne of the things you\u0027ll want to consider is your payload. Do you want your payload to be protected from high gee-loading? Do you want it to be protected from exhaust plume impingement and landing debris? These questions are going to force a lot of your design criteria.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m assuming the contest doesn\u0027t have any specific requirements in those areas, but placing those requirements on your own project can add realism, give you more advantages, and help guide you to a solution.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-14T13:54:09Z\u0022 title=\u002202/14/2018 01:54  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 14, 2018\u003C/time\u003E by sevenperforce\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-02-14T13:59:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223294751\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518611833\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBtw, a Martian atmosphere\u003Cbr\u003E\u003Ca href=\u0022https://www.grc.nasa.gov/www/k-12/airplane/atmosmrm.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.grc.nasa.gov/www/k-12/airplane/atmosmrm.html\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo where do you suppose the wiggle room is for making your design stick out from all the others?  I mean are there any innovations possible to the heat shields, parachutes, rockets, or how the craft hits the ground that have been used before?  Or is this a packaging/materials problem?   Are most of these entries going to be a scaled up  version of the Viking landers?    Or just allot of very fine tweaking of all of the above? \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-14T14:01:23Z\u0022 title=\u002202/14/2018 02:01  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 14, 2018\u003C/time\u003E by KG3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-02-14T14:23:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223294806\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518616798\u0022 data-ipsquote-userid=\u0022182951\u0022 data-ipsquote-username=\u0022KG3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, KG3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo where do you suppose the wiggle room is for making your design stick out from all the others?  I mean are there any innovations possible to the heat shields, parachutes, rockets, or how the craft hits the ground that have been used before?  Or is this a packaging/materials problem?   Are most of these entries going to be a scaled up  version of the Viking landers?    Or just allot of very fine tweaking of all of the above? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n?\u003Cbr\u003E\nI have no design, I just left the link here.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-02-14T15:44:13Z","Content":"\n\u003Cp\u003E\nA stand-out entry is going to use existing engines, power, and heat shields and tank designs. It\u0027s going to address ullage, tank pressurization, separation events, boil-off (if applicable), fairing integration, and communications. It\u0027s going to state assumptions and justify them. It\u0027s going to address power generation, hibernation, and so forth.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s also going to have some decent graphics, so see if anyone on your team has access to CAD or is good at working with SketchUp.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-02-14T16:23:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223294740\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518610470\u0022 data-ipsquote-userid=\u0022182820\u0022 data-ipsquote-username=\u0022Jirokoh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Jirokoh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think I understand this tech, how does it actually work?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd for parachutes, we don\u0027t yet have the tech to make strong enough parachutes to hold such mass going at such speeds. So I think we are going to pass on that one\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe basic theory behind this idea is that at low speed a moving object experiences frictional flow as the mass of the gas a vehicle travels through an atmosphere. If we look at the gas at any moment all molecules are moving around an aerodynamic devise with some velocity in accordance with its distance. The faster an object goes the more turbulent some of those flow elements become.\n\u003C/p\u003E\n\u003Cp\u003E\nStarting at about Mach 0.85 this starts to change around the less aerodynamic parts, there is a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Boundary_layer\u0022 rel=\u0022external nofollow\u0022\u003Eboundary layer\u003C/a\u003E that develops and in particular when and \u003Ca href=\u0022https://en.wikipedia.org/wiki/Thermodynamic_system#Boundary\u0022 rel=\u0022external nofollow\u0022\u003Eobject does not conform\u003C/a\u003E to the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Sears%E2%80%93Haack_body\u0022 rel=\u0022external nofollow\u0022\u003ESears-Haack\u003C/a\u003E shape. At about this speed a layer of higher density of gas is found around non-conformant layers at even higher speeds that layer separates. If you watch the F9 launch videos and the humidity of the atmosphere is just right you can see this layer separate from the nose cone and the cone broadens. At the same moment you may see flame from the rocket going the wrong direction, sooting up the side of the rocket. This is cause by supersonic boundary layer separation, In side the boundary the vehicle is basically clinging onto the mass and the flow is non-laminar out some distance.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022330px-Bowshock_example_-_blunt_body.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022267\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Bowshock_example_-_blunt_body.jpg/330px-Bowshock_example_-_blunt_body.jpg\u0022 width=\u0022330\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBow shock off of  a blunt body\n\u003C/p\u003E\n\u003Cp\u003E\nWhat you don\u0027t see is that on the nose cone itself air mass is also accumulating. Air molecules travel at the speed of sound, this is basically the absolute value mean moment of air motion at a given temperature. This means that at any given temperature an air molecule can only accelerate so rapidly. I an attempt to move around the rockets nose cone the gas trys to accelerate but at the speed of sound relative to other local air molecules it cannot. At which point its flow becomes inelastic and it basically piles up as a dense layer on the nose cone. The tip of that layer builds verticle mass on the nose cone with speed. If you build a triangle pointing vertically with on point up the axis, another point touching the side of the rocket at the base of the curvature and the third point touching the curvature, then the sin of angle x hypotenuse(velocity * time) = Mach * time or if speed in is Mach its Sin Θ = 1/S\u003Csub\u003EMach\u003C/sub\u003E  . . . . . .\u003Ca href=\u0022https://en.wikipedia.org/wiki/Compressible_flow#Mach_number,_wave_motion,_and_sonic_speed\u0022 rel=\u0022external nofollow\u0022\u003EΘ = ArcSin 1/S\u003C/a\u003E roughly. And everything below the cone created by the hypotenuse gets compacted into the nose cones mass (under the boundary layer), as the layer builds upward molecules accelerate more fluidly outside the layer. If the structure is not designed to take the force (such as the engine on an airliner) the structure will undergo cavitation.  In the Sears Haack shape the object has a shape that minimizes the distance of the triangles vertex (verticle) from the skin of the rocket, this causes the flow to become more laminar around the rocket. I should note that there are also oblique shockwaves, but at the altitude on Mars which you will be decelerating through you should not have to worry about these.\u003Cbr\u003E\u003Cbr\u003E\nWe can think of it like this, at a certain speed the air behaves like a gas around a structure, above that speed the air starts behaving more like a dense liquid; the degree that it behaves like a liquid is a function of speed and structural design. A liquid has more cohesion than air (you see rain drops stick to the window of a cockpit window) and that liquid has more affection for the object than the air outside of the boundary layer. But as its a liquid if the layer is high enough it can slide off.\u003Cbr\u003E\nHowever, if the object is high enough the \u0027stuck\u0027 gases can slide off before the next gas molecule hits. . . .this is space.\n\u003C/p\u003E\n\u003Cp\u003E\nSo what it means is that as you travel in from space particles are hitting the object and immediately moving out of the way, the layer, if any is very thin. When two molecules stike each other they knock eletrons out of orbitals and create a momentary plasma that glows, these \u0027chew\u0027 at the surface. So that the surface needs a material that sloughs off with these impacts.\n\u003C/p\u003E\n\u003Cp\u003E\nThese molecules can provide lift but that lift is not aerodynamic, there is no Bernoulli\u0027s force involved, its like billiard balls striking and reflecting. \n\u003C/p\u003E\n\u003Cp\u003E\nIn this situation if the structural plane is facing the gas flow, it will create maximum drag, but no lift (Imagine the Apollo capsule traveling horizontally, heat shield facing the air flow, as if it is orbiting but inside earths troposphere). If you rotate the plane to 45\u0027  (Gasflow ---\u0026gt;  \\ object) there will be as much lift as drag. The spacecraft will fall less rapidly compared to the verticle plane. If the plane it facing but 30\u0027 then it has less that half the drag but most of the force is in lift, so this falls the least slowly. But in horizontal flow through the subMach airspeed you don\u0027t want to have the plane of the wing much above 15\u0027 because of turbulent flow. Between these  (subMach and Orbital speeds at space altitudes) two circumstances the plane can trap gas momentarily and cause the gas (or plasma) to do funny things. For example the plane facing the flow of gas causes the gas to reflect backwards increasing the risk that another gas strikes it, sending it back. That flat plane is expected to build a hot and thicker of layer of gas on its surface (a fire ball). If one grooves the surface like the skirt of a womans dress, the fireballs will flow through the channels. We can constuct the surface (imagine a collection of funnels and tubes)  to force the fire ball downward toward the ground and as the fire traveled down the spacecraft would experience an upward force. This behavior would be expected to continue while the spacecraft was above Mach 0.85. Of course you would not want to have funnels and tubes as the increase and mass and the shock forces on the craft would give your engineers nightmares. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022i1ZQmyJ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://i.imgur.com/i1ZQmyJ.png\u0022 width=\u0022472\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis image shows that both inelastic and elastic collisions are contributing to the forces. The inelastic collisions create the red glow that is directed by the winglets down the space craft, channelling some of the flow to increase lift. As the static pressure of the atmosphere increases individual particle collisions contribute less and flow dynamics contribute more. This results in the appearance of shock boundaries.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-14T17:02:08Z\u0022 title=\u002202/14/2018 05:02  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 14, 2018\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-02-14T19:29:48Z","Content":"\n\u003Cp\u003E\nDo not forget about the inflatable ballutes\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed4557869950\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/121162-130-inline-ballutes-ib-v128-30052017/\u0026amp;do=embed\u0022 style=\u0022height:212px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KG3","CreatedById":182951,"CreatedDateTime":"2018-02-14T19:58:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223294895\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518625412\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStarting at about Mach 0.85 this starts to change around the less aerodynamic parts, there is a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Boundary_layer\u0022 rel=\u0022external nofollow\u0022\u003Eboundary layer\u003C/a\u003E that develops and in particular when and \u003Ca href=\u0022https://en.wikipedia.org/wiki/Thermodynamic_system#Boundary\u0022 rel=\u0022external nofollow\u0022\u003Eobject does not conform\u003C/a\u003E to the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Sears%E2%80%93Haack_body\u0022 rel=\u0022external nofollow\u0022\u003ESears-Haack\u003C/a\u003E shape. At about this speed a layer of higher density of gas is found around non-conformant layers at even higher speeds that layer separates. If you watch the F9 launch videos and the humidity of the atmosphere is just right you can see this layer separate from the nose cone and the cone broadens. At the same moment you may see flame from the rocket going the wrong direction, sooting up the side of the rocket. This is cause by supersonic boundary layer separation, In side the boundary the vehicle is basically clinging onto the mass and the flow is non-laminar out some distance.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022330px-Bowshock_example_-_blunt_body.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022267\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Bowshock_example_-_blunt_body.jpg/330px-Bowshock_example_-_blunt_body.jpg\u0022 width=\u0022330\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBow shock off of  a blunt body\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo what happens when you fire an engine to slow your craft down from a super sonic speed?  I\u0027m thinking like when the first stage of a Falcon 9 reenters the atmosphere.  Does the exhaust distort or even punch through this bow shock or somehow become part of the boundary layer around the rocket?  Can they even fire the engines into a super sonic head wind or do those waffle fins slow it down to subsonic first?  I just ask because I\u0027ve read there is some consideration of atmospheric pressure when it comes to rocket nozzle design.    \n\u003C/p\u003E\n"},{"CreatedByName":"Human Person","CreatedById":174876,"CreatedDateTime":"2018-02-14T21:57:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223295069\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518638290\u0022 data-ipsquote-userid=\u0022182951\u0022 data-ipsquote-username=\u0022KG3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, KG3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo what happens when you fire an engine to slow your craft down from a super sonic speed?  I\u0027m thinking like when the first stage of a Falcon 9 reenters the atmosphere.  Does the exhaust distort or even punch through this bow shock or somehow become part of the boundary layer around the rocket?  Can they even fire the engines into a super sonic head wind or do those waffle fins slow it down to subsonic first?  I just ask because I\u0027ve read there is some consideration of atmospheric pressure when it comes to rocket nozzle design.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nthe exhaust plume pushes this shock wave further away from the rocket (on the reentry burn). it\u0027s still supersonic even \u003Cstrong\u003Eafter\u003C/strong\u003E the reenty burn and the landing burn starts at least in the transonic regime.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-02-14T21:58:40Z\u0022 title=\u002202/14/2018 09:58  PM\u0022 data-short=\u00226 yr\u0022\u003EFebruary 14, 2018\u003C/time\u003E by Human Person\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-02-14T21:58:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223295035\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518636588\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo not forget about the inflatable ballutes\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed659858039\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/121162-130-inline-ballutes-ib-v128-30052017/\u0026amp;do=embed\u0022 style=\u0022height:214px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know how these ablate or how much structural rigidity they have, you probably would only need a few hundred Pa to inflate them, a light gas like hydrogen would do.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2018-02-14T22:08:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223295069\u0022 data-ipsquote-contentid=\u0022170840\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221518638290\u0022 data-ipsquote-userid=\u0022182951\u0022 data-ipsquote-username=\u0022KG3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, KG3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo what happens when you fire an engine to slow your craft down from a super sonic speed?  I\u0027m thinking like when the first stage of a Falcon 9 reenters the atmosphere.  Does the exhaust distort or even punch through this bow shock or somehow become part of the boundary layer around the rocket?  Can they even fire the engines into a super sonic head wind or do those waffle fins slow it down to subsonic first?  I just ask because I\u0027ve read there is some consideration of atmospheric pressure when it comes to rocket nozzle design.    \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere first firing takes out horizontal velocity but is at high altitude. The bell of the M1D engines are engineered, obviously, to withstand the pressure, I have never looked at the speed versus altitude profile of the F9 on return, only on two rockets to first stage separation, so I could not even estimate the horizontal or vertical components of their velocities. Most however separate around 100 km which means at the 2400 to 3000 m/s they are traveling its more space like than atmosphere like. The majorit of their energy is in motion away from the launch pad, to return they have to zero this energy and develope a horizontal component in the direction of the pad. Letting gravity handle the verticle components. The do at least one more supersonic burn and then go transonic before the last burn. In someway the atmosphere helps, fuel rich mixtures are more likely to explode under highpressures in the presence of O2. If they are experiencing very high kPA inside the nozzel and the fuel pump can load the nozzel, it should fire.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}