{"TopicId":175525,"ForumId":44,"TopicTitle":"Leave a Legacy","CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-06-01T12:00:48Z","PageNum":1,"Articles":[{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-06-01T12:00:48Z","Content":"\n\u003Cp\u003E\nHere\u0027s a thought experiment.\n\u003C/p\u003E\n\u003Cp\u003E\nImagine you suddenly found yourself transported back in time thousands of years, to an arbitrary stone age or early bronze age civilization (dynastic Egypt, ancient Mesopotamia, druidic Britain, etc.). Fortunately, you quickly learn the language and culture, and in true Connecticut Yankee style you make your ascent to a position of power within the society. You cannot, of course, manage to effect full industrialization since that infrastructure would take a few hundred years to get up and running, but you make enough contributions to agriculture and astrology and military tech that you\u0027re sure to be remembered as a great leader.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s at this point that a thought occurs to you...what if you could be remembered as \u003Cem\u003Emore\u003C/em\u003E than a great leader? By now, you\u0027ve already reached the conclusion that the future you remember is gone forever. You\u0027ve already changed history enough to ensure that. But you can guess that thousands of years in the future, archaeologists will dig up your civilization, and you want to give them something to really blow their minds.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat do you do?\n\u003C/p\u003E\n\u003Cp\u003E\nYou can write down your story -- \u0022I\u0027m a time traveler who came back from the year 2018 and used my knowledge to become powerful\u0022 -- but that\u0027s hit or miss. For one thing, you can\u0027t write in English, because English probably won\u0027t evolve in the same way, and if you write in the language of your civilization then you\u0027re more likely to create a new religion than anything else. Plus, written texts don\u0027t really survive very long, and in any case you can\u0027t make predictions about the future, because you don\u0027t \u003Cem\u003Eknow\u003C/em\u003E the future any more.\n\u003C/p\u003E\n\u003Cp\u003E\nYou do, however, know that certain things don\u0027t change. Like the value of pi or the mass of an electron or the speed of light.\n\u003C/p\u003E\n\u003Cp\u003E\nHow would you encode advanced scientific knowledge in monuments or other relics to give future archaeologists the shock of their lives?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Csub\u003EMy own idea, spoiler\u0027d:\u003C/sub\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThe ideal relic, in my opinion, would encode information that the ancients absolutely would not be able to determine on their own, but which would be easy to correlate to reality without needing to speak the language or translate equations. Bonus if the information could potentially be explained to the ancients.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat could the ancients have guessed at, but never accurately known? How about the relative distances, radii, and masses of the major planets and their largest moons? The ancients could not have observed Neptune or Uranus with the naked eye and certainly would not have known detailed information about the moons of Saturn, Jupiter, or Mars. And they definitely would not have been able to guess the semimajor axes of all the orbits.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d have them build a sprawling citadel with eight monoliths surrounding a central tomb. The relative distances between the monoliths and the tomb would correlate to the semimajor axes of the planetary orbits. Each monolith would rest on a cylindrical base such that the masses of the bases form ratios matching the ratios of the masses of the planets. The height of each monolith would be in ratio of the radii of the actual planets. Obviously, heights of the monoliths would not be to scale with the distances between the monoliths, but it could use a ratio like the fine structure constant. The monoliths representing Mars, Earth, Jupiter, Saturn, Uranus, and Neptune would all have satellite monoliths (or at least pillars) representing the arrangement of moons around that planet.\n\u003C/p\u003E\n\u003Cp\u003E\nThe specific locations of the monoliths would match the conjunction and alignment of the planets as of the date I woke up in the ancient world.\n\u003C/p\u003E\n\u003Cp\u003E\nInside my tomb, I\u0027d also have 14 spheres in mass-ratio to the masses of the non-massless elementary particles (excepting the electron neutrino because it\u0027s just too small).\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nRadii ratios:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nelectron: 1\n\u003C/li\u003E\n\u003Cli\u003E\nup quark: 1.6\n\u003C/li\u003E\n\u003Cli\u003E\ndown quark: 2.1\n\u003C/li\u003E\n\u003Cli\u003E\ntau neutrino: 3.1\n\u003C/li\u003E\n\u003Cli\u003E\nstrange quark: 5.7\n\u003C/li\u003E\n\u003Cli\u003E\nmuon: 5.9\n\u003C/li\u003E\n\u003Cli\u003E\ncharm quark: 13.6\n\u003C/li\u003E\n\u003Cli\u003E\ntau: 15.1\n\u003C/li\u003E\n\u003Cli\u003E\nbottom quark: 20.1\n\u003C/li\u003E\n\u003Cli\u003E\nW boson: 53.9\n\u003C/li\u003E\n\u003Cli\u003E\nZ boson: 56.3\n\u003C/li\u003E\n\u003Cli\u003E\nHiggs boson: 62.5\n\u003C/li\u003E\n\u003Cli\u003E\ntop quark: 69.7\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThis of course assumes radii is taken to represent volume, and volume correlates to mass. Volume does not actually correlate to mass in dealing with elementary particles, but it\u0027s the easiest way to represent it.\n\u003C/p\u003E\n\u003Cp\u003E\nIf there was space for inscriptions in my crypt, I could use engraved circles with relative radii of 1, 1.6, and 2.1 to show the interactions of quarks and how protons and neutrons are formed, building up to the point of being able to show the structure of water.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T13:54:55Z\u0022 title=\u002206/01/2018 01:54  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by sevenperforce\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2018-06-01T12:48:57Z","Content":"\n\u003Cp\u003E\nMinor nitpick - I\u0027d prefer to be remembered as a leader who contributed to astronomy rather than astrology. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI think I\u0027d choose either a derivation of E=MC\u003Csup\u003E2\u003C/sup\u003E or a derivation of whatever theory underpinned my ability to time-travel, as the advanced knowledge to encode. The first is so iconic and the second - well we may as well go full-on time loop paradox here!\n\u003C/p\u003E\n\u003Cp\u003E\nHow to encode the information? Good question, and to my mind the real trick would be encoding it in a way that it really couldn\u0027t be called out as a fake. Sure, I could (and probably would) leave the derivation on a papyrus in a sealed jar in my tomb, but I think it would be too easy to disregard that as a hoax. We need something more obvious and much harder to fake, that ties in with the detailed derivation in my tomb\n\u003C/p\u003E\n\u003Cp\u003E\nI guess the obvious answer is to spell out E=MC\u003Csup\u003E2\u003C/sup\u003E in buildings (pyramids, temples or whatever) so that the equation is only apparent from the air. Buildings have a tendency to fall down, wear away or be vandalised / dismantled to build other buildings though, so we need redundancy. I think I\u0027d write my E=MC\u003Csup\u003E2\u003C/sup\u003E into the shape of the building foundations  too. Then, I would build a highlighter structure beneath and around the foundations (think a moat around a castle). Ideally the highlighter would have the following properties:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nBe made out of an economically valueless material to discourage looters.\n\u003C/li\u003E\n\u003Cli\u003E\nBe made out of a material that stands out well on a multispectral image.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nSo, even if my enormous ego-boosting tomb complex doesn\u0027t stand the test of time (or at least not enough of it to be readable), then hopefully the foundations will be. And if they\u0027re not, then hopefully the highlighter will be - and will only be visible by satellite to boot.\n\u003C/p\u003E\n\u003Cp\u003E\nOh - as a final touch, I would leave multiple copies of a Rosetta Stone in, under and around my tomb. The Stone would be a personal letter from me to the future written in at least two contemporary languages and also in English. The letter would further include the digits 0-9 expressed as a simple tally. It would include a guide to arithmetic symbols\n\u003C/p\u003E\n\u003Cp\u003E\nI  =  I\u003Cbr\u003E\n2=  II\u003Cbr\u003E\n3 = III\n\u003C/p\u003E\n\u003Cp\u003E\n3x2 = III x II = IIIIII\n\u003C/p\u003E\n\u003Cp\u003E\nthat sort of thing. It would also include the equation weight/9.81 = mass and the note that mass = M.  My reasoning here is that weight is a fairly general concept that may appear in other archaeological texts but mass is quite a specific concept that probably wouldn\u0027t be. I would need to think of some other way of describing what the E in E=MC\u003Csup\u003E2\u003C/sup\u003E signifies\n\u003C/p\u003E\n\u003Cp\u003E\nThat way, even if the shape of my \u003Cs\u003Eego\u003C/s\u003E tomb complex means absolutely nothing to the future archaeologists, they at least have the means to decode it. Or, if they\u0027re excavating my tomb before relativity has been discovered, it\u0027s clearly an important equation given the amount of effort I\u0027ve put into making sure it\u0027s understandable.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T12:51:09Z\u0022 title=\u002206/01/2018 12:51  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-06-01T12:59:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390673\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527857337\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMinor nitpick - I\u0027d prefer to be remembered as a leader who contributed to astronomy rather than astrology. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs would I, but you\u0027re much more likely to gain critical acclaim in a stone age society through the avenue of astrology (simply because you\u0027ll be able to accurately predict star alignments, planetary conjunctions, etc.) than through astronomy, which wouldn\u0027t yet exist.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow to encode the information? Good question, and to my mind the real trick would be encoding it in a way that it really couldn\u0027t be called out as a fake. Sure, I could (and probably would) leave the derivation on a papyrus in a sealed jar in my tomb, but I think it would be too easy to disregard that as a hoax.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, this is a big element. Which is why I think that what you encode has to be BIG. If it\u0027s big and everyone knows it\u0027s been there for thousands of years, it\u0027s obviously not fake.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI guess the obvious answer is to spell out E=MC\u003Csup\u003E2\u003C/sup\u003E in buildings (pyramids, temples or whatever) so that the equation is only apparent from the air.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would also include the equation weight/9.81 = mass and the note that mass = M.  My reasoning here is that weight is a fairly general concept that may appear in other archaeological texts but mass is quite a specific concept that probably wouldn\u0027t be. I would need to think of some other way of describing what the E in E=MC\u003Csup\u003E2\u003C/sup\u003E signifies\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow would you signify E = energy, M = mass, C = the speed of light, and n\u003Csup\u003E2\u003C/sup\u003E means exponentiation? For that matter, how do you signify that \u0022=\u0022 means \u0022equals\u0022 or that mushing two things together means multiplication?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, \u00229.81\u0022 is not meaningful unless you can also define meters and seconds.\n\u003C/p\u003E\n\u003Cp\u003E\n(not to nitpick; this is just a question I\u0027ve thought about for a while so I\u0027m curious to see what people come up with)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T13:55:48Z\u0022 title=\u002206/01/2018 01:55  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by sevenperforce\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2018-06-01T13:44:54Z","Content":"\n\u003Cp\u003E\nYeah that last part is the flaw. The Rosetta Stone idea works (I think) but depends on the Stone surviving and being found.\n\u003C/p\u003E\n\u003Cp\u003E\nI’m trying to think of a shape that is simultaneously indicative of advanced knowledge, unlikely to be dismissed as a coincidence and simple enough to withstand the elements for a couple of thousand years.\n\u003C/p\u003E\n\u003Cp\u003E\nSo far I’m drawing a blank.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-06-01T13:57:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390695\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527860694\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Rosetta Stone idea works (I think) but depends on the Stone surviving and being found.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe Rosetta Stone idea also runs into the question of legitimacy. Even if the stone survives, is found, and is decoded, how do future archaeologists know that it is truly the writing of a time traveler and not just a proto-science-fiction novel written by a particularly inventive pharaoh?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390695\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527860694\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI’m trying to think of a shape that is simultaneously indicative of advanced knowledge, unlikely to be dismissed as a coincidence and simple enough to withstand the elements for a couple of thousand years.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis question was inspired by all the \u0022ancient aliens\u0022 and \u0022Golden ratio\u0022 nonsense out there...I started wondering what actually WOULD be considered valid evidence of advanced scientific knowledge in the ancient world.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-01T14:27:43Z","Content":"\n\u003Cp\u003E\nSo I see I\u0027m not the only one thinking about this kind of stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nI wouldn\u0027t experiment with some new language, that\u0027s for sure. Just a key for encoding the rest of the message: 1=I, 2=II, ... ,10=IIIIIIIIII, 11=IIIIIIIIIII, 21=IIIIIIIIIIIIIIIIIIIII and so on. Then speed (with m/s because the lenght of the day wouldn\u0027t change) by writing some sort of equation involving speed and distance. Then from distance I could show them how much is 1 kg (1 litre of water is 1 kilogram) and that would give them the symbol of mass (m). Then eventually I would go for the E=mc^2 or some other recent discovery.\n\u003C/p\u003E\n\u003Cp\u003E\nEither that or memorize the whole content of the Voyager plate and leave that instead.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Also, I would try to tell as many stories of my timeline as possible, like WW2, nuclear bomb, Moon landing and other important stuff. So yeah, pretty much a Rosetta stone \u002Bpictures.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T14:38:59Z\u0022 title=\u002206/01/2018 02:38  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by Wjolcz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-01T14:29:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390695\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527860694\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo far I’m drawing a blan\u003Cspan\u003E﻿\u003C/span\u003Ek.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022declaracia-po-nds-07-11-2006.gif\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022http://blankinew.narod.ru/nds/declaracia-po-nds-07-11-2006.gif\u0022 width=\u0022532\u0022\u003E\u003Cimg alt=\u0022schet-faktura.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022725\u0022 src=\u0022https://lugasoft.ru/files/blank/schet-faktura/schet-faktura.jpg\u0022 width=\u00221024\u0022\u003E\u003Cimg alt=\u0022ko-1-prihodnyj-kassovyj-order.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022571\u0022 src=\u0022https://lugasoft.ru/files/blank/ko-1-prihodnyj-kassovyj-order/ko-1-prihodnyj-kassovyj-order.jpg\u0022 width=\u0022798\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u002B1!\u003Cbr\u003E\nImagine, you don\u0027t know this language.\u003Cbr\u003E\nBut don\u0027t you see that this is an artifact of a civilization at least of your XX/XXI century level?\n\u003C/p\u003E\n\u003Cp\u003E\nPay special attention on barcodes.\u003Cbr\u003E\nOf course, unlikely EAN13 could be the same, but the idea of bar-code just can\u0027t change.\u003Cbr\u003E\nQR and 2d barcodes would anyway appear after plain 1d barcode.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T14:30:40Z\u0022 title=\u002206/01/2018 02:30  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-01T14:50:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390678\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527857976\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow would you signify E = energy, M = mass, C = the speed of light, and n\u003Csup\u003E2\u003C/sup\u003E means exponentiation? For that matter, how do you signify that \u0022=\u0022 means \u0022equals\u0022 or that mushing two things together means multiplication?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUse things that don\u0027t change. Density and mass of water/air, day length, atomic decay, etc. to point out which symbol signifies what.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe spell out with buildings/monoliths something that happened even before the time you got transported to but was discovered only recently. Like zircon crystals with biogenic carbon or the number and distances to the nearest confirmed exoplanets. The last one would almost definitely point out to aliens and you would ensure the creation of History Channel\u0027s \u0027Ancient Aliens\u0027 series. You could probably encode that too. I probably would put some funny message in that just to screw with the researchers, like \u0022No, it\u0027s not Aliens. It\u0027s never Aliens. Even around that odd star over 1000 light years away.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Anyway, I agree it\u0027s a good idea for the message to be big and easy to discover as soon as possible.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T14:56:43Z\u0022 title=\u002206/01/2018 02:56  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by Wjolcz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-01T14:59:23Z","Content":"\n\u003Cp\u003E\nLifehack: arrive there just before the Santorini eruption.\u003Cbr\u003E\nExplain them that they are sinners, and unless they follow you, the sea will explode to punish them.\n\u003C/p\u003E\n\u003Cp\u003E\nBetter say this from a ship, to escape fast before they catch you.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t forget to make a selfie with exploding Santorini on your palm (as usual, you know).\n\u003C/p\u003E\n\u003Cp\u003E\nReturn and ask them again: do they want sinking mountains.\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2018-06-01T15:09:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390645\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527854448\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor one thing, you can\u0027t write in English, because English probably won\u0027t evolve in the same way...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Voynich_manuscript\u0022 rel=\u0022external nofollow\u0022\u003EAn\u003C/a\u003E \u003Ca href=\u0022https://en.wikipedia.org/wiki/Linear_A\u0022 rel=\u0022external nofollow\u0022\u003Einteresting\u003C/a\u003E \u003Ca href=\u0022https://en.wikipedia.org/wiki/Undeciphered_writing_systems\u0022 rel=\u0022external nofollow\u0022\u003Ethought\u003C/a\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"Fraston","CreatedById":188565,"CreatedDateTime":"2018-06-01T15:11:52Z","Content":"\n\u003Cp\u003E\nUgggghh this is making my head explode, haha!\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2018-06-01T15:55:15Z","Content":"\n\u003Cp\u003E\nTerry Pratchett had an interesting take on this type of thing.  He had a group of teens (maybe slightly younger) travel back and forth in time (to WWII).  During one of the stops, one is left behind.\n\u003C/p\u003E\n\u003Cp\u003E\nBack in their own time, the much older boy meets up with them.  They assume he built computers or such, but he asks them to describe (using only 1940s tech) how to build a computer.  Or even how to make a plastic spoon.  None have any idea.  What thy boy did was come up with something he *did* understand (and could work out his misconceptions): a hamburger stand.  Of course once he had a nest egg, he had a huge advantage in investing.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d be curious how many of us have skills that could be used in the bronze age (or before) to rise to power?  Presumably you have to first prove yourself as an individual, and be able to build your technology base as your followers increased.  I think you\u0027d be surprised how adapted each time period\u0027s technology would be to its infrastructure.  Building a superior infrastructure for you barely more advanced technology will be a Herculean task.  I\u0027m guessing a blacksmith would go a long way.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve studied history and technology (as an enthusiast, not at all an academic aside from an undergraduate class long ago) for a long time and as far as I can tell: technology *is* infrastructure.  You aren\u0027t going anywhere until you build that infrastructure.\n\u003C/p\u003E\n\u003Cp\u003E\nSome \u0022inventions\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n- the horse collar is the biggest \u0022why didn\u0027t they think of that\u0022.  Requires a lot more leather than an ox collar, but allows you to get a full horsepower out of each horse (without this you basically strangle the horse.  Yes, chariot races were a lot slower than you\u0027d think, largely because they were strangling the horses.\n\u003C/p\u003E\n\u003Cp\u003E\n- mouldboard plough would be the next: you need iron and probably the horse collar (you could do it with oxen, but get the horse collar first).\n\u003C/p\u003E\n\u003Cp\u003E\n- building hotter and hotter forges would be an amazing trick.  Start with producing iron, and work your way up to steel, pig iron, and hopefully even crucible steel.  Hope you know where historical iron and coal deposits are!\n\u003C/p\u003E\n\u003Cp\u003E\n- remember that while the katana was an amazing performer made out of questionable ore (lots of swords were far better, but almost certainly used better ore), samurai were far more likely to fight with spears on the battlefield.  Forging something like a katana might get the attention of kings (for good or ill), but don\u0027t expect to change the course of a battle with them.\n\u003C/p\u003E\n\u003Cp\u003E\n- could you make a compound bow?  Sounds hard, and I\u0027d hate to imagine all the technology needed for it (maybe you could lathe hard wood/iron roller bearings instead of ball bearings), but it would probably become the \u0022super weapon\u0022 of anything before gunpowder (you need hardened steel plates to even think of stopping it).  And even if you can make gunpowder, can you make the steel barrel needed to contain the explosive (sure, you could probably use it to sack walled cities, but that doesn\u0027t sound like a long-term thinking that goes into leaving a legacy).  Again, infrastructure is key.\n\u003C/p\u003E\n\u003Cp\u003E\n- there is likely a huge difference between a horse riding nomadic band and the same band with stirrups as cavalry.  Expect amazing pushback from the tribe who learned to stay on a horse the hard way and insist that anyone who can\u0027t isn\u0027t part of their tribe.  Don\u0027t be too surprised if the local cavalry have weird systems that work almost as well (the Romans had some weird circular stablizer).\n\u003C/p\u003E\n\u003Cp\u003E\nFinally: on writing systems:\n\u003C/p\u003E\n\u003Cp\u003E\nWe all know that finding the Rosetta Stone meant that someone merely looked at the Greek text and was able to transcribe the Egyptian pictograms into Greek.  Except it didn\u0027t happen that way at all.  Certainly papers were written at the time that said as much, but it took another 20 years before Champollion finally got around to doing the hard work of matching up the text.  Champollion was one of the few westerners (and probably few people altogether) who was fluent in Coptic.  He was able to show that hieroglyphics were essentially Coptic, typically with stylized pictures to replace Coptic sounds (note that classical hieroglypics were often meant to be visually impressive to illiterates on temples and tombs and even if you could read them were often propaganda, so accuracy wasn\u0027t a big thing.  Scribes had a separate simplified writing system for keeping records).  A similar method was used with Linear B, and that had to be done without the aid of a Rosetta Stone: Alice Kober was able to show that it was an archaic form of Greek, using an ancient syllabary (each symbol meant an entire syllable, not just a sound).\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027ll need a lot of copies of a complete explanation of your language and writing system, and even then they don\u0027t have a great chance of being decoded.  So far, unknown writing systems have relied on knowing the underlying language, but there is always hope.  Recently, there may have been advances in decoding the Incan knot system, but the actual advances are far less than the clickbait  titles may indicate.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-01T16:41:01Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133850-wumpus/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133850\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133850-wumpus/\u0022 rel=\u0022\u0022\u003E@wumpus\u003C/a\u003E the problem with Rosetta Stone and Incan knots is that each document (I guess you could call it that) doesn\u0027t contain the key left there for someone to decipher it. If you include a simple and logical key the job becomes much easier. Leave the key and people will be able to read it. Just like the dotted equations in \u0027Contact\u0027. Rosetta Stone was built to tell a story, not as a time capsule.\n\u003C/p\u003E\n\u003Cp\u003E\nAbout infrastructure: I thought about it too. The \u0022easiest\u0022 way of doing this is going to someone influencial and asking them to finance your steam engine based on your plans. And you would most likely have to hinge it on a good military-based argument. Building an empire from scratch would be pretty much impossible.\n\u003C/p\u003E\n\u003Cp\u003E\nBuild a twentieth century invention on your own and you will most likely either run out of resources fast or get stabbed for either heresy or profit.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T16:42:04Z\u0022 title=\u002206/01/2018 04:42  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by Wjolcz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-06-01T16:56:37Z","Content":"\n\u003Cp\u003E\n\u0022Technology is infrastructure\u0022 is the truest thing on this thread so far. That\u0027s why the actual \u003Cem\u003EConnecticut Yankee\u003C/em\u003E is so preposterous.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are a lot of advances to be had in the realm of agriculture. Irrigation (e.g. water screws) and planting cycles and crop density. You can\u0027t manage industrialized farming, of course, but you can move in that general direction.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the military side of things, you can readily build seige engines with exploding projectiles. A wagon-mounted trebuchet that can accurately lob grapeshot into tight enemy formations well behind the front line would turn the tide of literally any pitched battle before the 1500s.\n\u003C/p\u003E\n\u003Cp\u003E\nThe biggest challenge, of course, is to not die before you learn the language.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd on the subject of actually leaving something for the future.....\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390720\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527863263\u0022 data-ipsquote-userid=\u002239636\u0022 data-ipsquote-username=\u0022Wjolcz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Wjolcz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI wouldn\u0027t experiment with some new language, that\u0027s for sure. Just a key for encoding the rest of the message: 1=I, 2=II, ... ,10=IIIIIIIIII, 11=IIIIIIIIIII, 21=IIIIIIIIIIIIIIIIIIIII and so on. Then speed (with m/s because the lenght of the day wouldn\u0027t change) by writing some sort of equation involving speed and distance. Then from distance I could show them how much is 1 kg (1 litre of water is 1 kilogram) and that would give them the symbol of mass (m). Then eventually I would go for the E=mc^2 or some other recent discovery.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAll this depends on your inscriptions lasting, and not being looted/sacked/destroyed.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is the most advanced (and obviously non-coincidental) idea that could be expressed with something as simple as the stonehenge?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nWe know the Stonehenge was built to align with the rising and setting of the sun, and probably had some function as an astronomical or astrological observatory. But what if we discovered tomorrow that the stones in the Stonehenge are placed in such a way that they exactly match the arrangement and surface area of the world\u0027s continents?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Wjolcz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEither that or memorize the whole content of the Voyager plate and leave that instead.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Also, I would try to tell as many stories of my timeline as possible, like WW2, nuclear bomb, Moon landing and other important stuff. So yeah, pretty much a Rosetta stone \u002Bpictures.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, WW2 would never happen. Nuclear weapons and moon landings might, but the details would be different.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390741\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527864614\u0022 data-ipsquote-userid=\u002239636\u0022 data-ipsquote-username=\u0022Wjolcz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Wjolcz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUse things that don\u0027t change. Density and mass of water/air, day length, atomic decay, etc. to point out which symbol signifies what.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTrying to think how I\u0027d engrave that on a blank sheet without using an established language.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Wjolcz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaybe spell out with buildings/monoliths something that happened even before the time you got transported to but was discovered only recently. Like zircon crystals with biogenic carbon or the number and distances to the nearest confirmed exoplanets.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEven a list of planets and moons within our solar system points beyond ancient tech.\n\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2018-06-01T17:02:58Z","Content":"\n\u003Cp\u003E\nActually I\u0027m well ahead of you. I already have the time machine set up and I\u0027m ready to jump. I have the project in mind. It will be an orrery as well as a device to calculate long term solar and lunar eclipses as well as moon phases. The deployment is rather tricky, though. I need to fetch a specific ship that will sink on a specific day and its wreck found thousands of years later.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I\u0027m basically ready to go, I\u0027m just waiting for that Chris guy to show me how to build the darned thing.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-01T17:14:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390645\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527854448\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRadii ratios:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nelectron: 1\n\u003C/li\u003E\n\u003Cli\u003E\nup quark: 1.6\n\u003C/li\u003E\n\u003Cli\u003E\ndown quark: 2.1\n\u003C/li\u003E\n\u003Cli\u003E\ntau neutrino: 3.1\n\u003C/li\u003E\n\u003Cli\u003E\nstrange quark: 5.7\n\u003C/li\u003E\n\u003Cli\u003E\nmuon: 5.9\n\u003C/li\u003E\n\u003Cli\u003E\ncharm quark: 13.6\n\u003C/li\u003E\n\u003Cli\u003E\ntau: 15.1\n\u003C/li\u003E\n\u003Cli\u003E\nbottom quark: 20.1\n\u003C/li\u003E\n\u003Cli\u003E\nW boson: 53.9\n\u003C/li\u003E\n\u003Cli\u003E\nZ boson: 56.3\n\u003C/li\u003E\n\u003Cli\u003E\nHiggs boson: 62.5\n\u003C/li\u003E\n\u003Cli\u003E\ntop quark: 69.7\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou should translate these magic terms to the archaeologists.\u003Cbr\u003E\nOtherwise they, as usually, will explain to everybody that this is a magic inscription, and your lab is obviously a temple (because what else it could be?).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390835\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527872197\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOn the military side of things, you can readily build seige engines with exploding projectiles.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAfter you have learned how to brew saltpeter out of straw and manure.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390835\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527872197\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA wagon-mounted trebuc\u003Cspan\u003E﻿\u003C/span\u003Ehet that can accurately lob grapeshot into tight enemy formations well behind the front line would turn the tide of literally any pitched battle before the 1500s.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSea robbery, that\u0027s the key. Or thalassocracy, if you prefer.\u003Cbr\u003E\nNeeds less people, allows to choose weak enemies instead of big armies and run away after robbing.\u003Cbr\u003E\nBreak the sea routes between Crete and the continents, raise your price and sell your cannon.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T17:14:37Z\u0022 title=\u002206/01/2018 05:14  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-01T17:14:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390835\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527872197\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTrying to think how I\u0027d engrave that on a blank sheet without using an established language.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe simplest way I can imagine is a combo of language (edit: all they need is a couple of letters), math and pictures. If you are not sure if someone will understand something just draw it.\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s assume the key to arabic digits is the first thing you leave there and the researchers already know it. What I would do is probably this:\n\u003C/p\u003E\n\u003Cp\u003E\nStart with the length of the day in seconds (so they know how many seconds are in one day) \u002Ba simple drawing of day and night cycle -\u0026gt; equation for an object going 1m/s (now they know how much 1 meter is) -\u0026gt; using meters I can now write down how much 1 kg of water is \u002Ba drawing of a wave to indicate it\u0027s water/drawing of a molecule of water (I actually know this one) -\u0026gt; Now they would be able to figure out what mass is since kilograms and speed are there (edit: from the mass formula).\n\u003C/p\u003E\n\u003Cp\u003E\nThis alone gives them symbols for mass and speed and since they know how much 1 meter is and how long is one second you just write down the speed of light with arabic digits and mark it as \u0027c\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure about how to introduce energy (E) tho. I\u0027m really bad at physics.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: BTW I don\u0027t know if you can already tell but I really rushed this post and it\u0027s a complete mess. If I sat down and researched a couple of things I definitely could write down a key to encode E=mc^2.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T17:34:44Z\u0022 title=\u002206/01/2018 05:34  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by Wjolcz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2018-06-01T17:33:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390835\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527872197\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOn the military side of things, you can readily build seige engines with exploding projectiles. A wagon-mounted trebuchet that can accurately lob grapeshot into tight enemy formations well behind the front line would turn the tide of literally any pitched battle before the 1500s.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs far as I know, trebuchets were never used in pitched battles (although grapeshot might have changed things).  Grenadiers were a thing (throwing them by hand), and I imagine grenadiers could achieve archery range (which is close enough to destroy a formation).  I still think compound bows would be easier to teach people to make, and cheaper than handing grapeshot to your enemy (how many man-hours does it take to make shot in a medieval economy?  Then again, arrow manufacture was a real pain).\n\u003C/p\u003E\n\u003Cp\u003E\nIf you really want to defeat an enemy on the battlefield, maps and a compass will probably help more than any other tech.  Part of the reason Hannibal was so effective was he did a lot of his own scouting.  This allowed him to pick ideal battlefields.  Prior to the telegraph, wars often involved armies groping around for each other until they finally collided.  Get the maps first, then go to war.  And yes, map generation will be hugely expensive.  Might be justified if you have a merchant operation (you know double-entry accounting? that\u0027s a huge step up against anyone before 1000CE or so.  Pen, paper [or clay and stylus], and money are the only infrastructure you need).\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m also drawing a blank on the means to a rise to power.  Most of these skills are pretty obscure, requiring fairly old kerbanauts to have picked up enough.  But your ideal time traveler is pre-teen, in order to learn the language.  However you learn the language, I\u0027d recommend trying to become a brewer if you can find the means to build a still (also knowing about yeast and sanitation should give you a huge leg up, but your competition has done it all their lives, and learned from guys who did it all their lives...).  Becoming a drug lord has always been a great means to power, and if you\u0027re the only one who can distill alcohol [and again, infrastructure is everything: distilled alcohol is only great if you have the means to grow more food than you can easily transport as food/beer].  Maybe living just outside a big city (modern people can\u0027t expect to get used to the smell of a large ancient city).\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-01T17:39:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390852\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527874392\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n[snip]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIsn\u0027t this thread about how and what to do in order to give people of the future a hint that you had that kind of knowledge? I thought the assumed rise to power is already done and we are focusing on building that one ultimate time traveler\u0027s relic?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T17:49:22Z\u0022 title=\u002206/01/2018 05:49  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by Wjolcz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-01T17:53:24Z","Content":"\n\u003Cp\u003E\nBe sure, whatever you suggest, archaeologists will explain this as an occasion or a ritual thing/temple/magic.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2018-06-01T17:57:57Z","Content":"\n\u003Cp\u003E\nThen map of the Solar system is a good start. Also making clay orbs and engraving them with silhouettes of all continents and biggest islands(more or less acurately LOL). Make sure your orbs are properly fired before burying them everywhere around.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2018-06-01T17:59:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390866\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527875604\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBe sure, whatever you suggest, archaeologists will explain this as an occasion or a ritual thing/temple/magic.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAssuming they are the only ones looking at the evidence. If there\u0027s some alien theorist that thinks it\u0027s aliens he or she will do everything to prove it. By doing so he/she will confirm that in fact it\u0027s knowledge ancients couldn\u0027t obtain and still call it aliens and then everyone would freak out because going back in time is impossible.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T18:29:50Z\u0022 title=\u002206/01/2018 06:29  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by Wjolcz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-01T18:13:39Z","Content":"\n\u003Cp\u003E\nJonathan Swift left description of both Mars moons. But nobody takes it serious.\n\u003C/p\u003E\n\u003Cp\u003E\nBetter use John Dee as a beacon.\n\u003C/p\u003E\n\u003Cp\u003E\nBtw about writing systems. Tolkien\u0027s main ones are phonetically logical, compact and more or less easy to use. At least not worse than other ones.\u003Cbr\u003E\n(I mean both cirth and tengwar. Probably, you would mostly use tengwar, as it\u0027s hard to write something on bones/stones/wood.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T18:19:56Z\u0022 title=\u002206/01/2018 06:19  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-06-01T18:20:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390858\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527874771\u0022 data-ipsquote-userid=\u002239636\u0022 data-ipsquote-username=\u0022Wjolcz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, Wjolcz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIsn\u0027t this thread about how and what to do in order to give people of the future a hint that you had that kind of knowledge? I thought the assumed rise to power is already done and you are focusing on building that one ultimate time traveler\u0027s relic?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, the point of the thread is to figure out how to pass a message on to the future. But apparently some people also thought the \u0022how would one rise to power?\u0022 question was equally interesting, and the rest was history.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390852\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527874392\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI still think compound bows would be easier to teach people to make, and cheaper than handing grapeshot to your enemy (how many man-hours does it take to make shot in a medieval economy?  Then again, arrow manufacture was a real pain).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMore canister than grapeshot. You can pack it with stones, nails, whatever. Compound bows are challenging because they require carefully machined cams that must withstand tremendous forces. Machined pig iron might be good enough to build compound bow cams but I\u0027m not sure. Anything weaker than pig iron is a complete non-starter.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you really want to defeat an enemy on the battlefield, maps and a compass will probably help more than any other tech.  Part of the reason Hannibal was so effective was he did a lot of his own scouting.  This allowed him to pick ideal battlefields. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you have sufficient historical knowledge, you don\u0027t even have to do the scouting.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390845\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527873257\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390645\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527854448\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf there was space for inscriptions in my crypt, I could use engraved circles with relative radii of 1, 1.6, and 2.1 to show the interactions of quarks and how protons and neutrons are formed, building up to the point of being able to show the structure of water.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou should translate these magic terms to the archaeologists.\u003Cbr\u003E\nOtherwise they, as usually, will explain to everybody that this is a magic inscription, and your lab is obviously a temple (because what else it could be?).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you do a big complex with the inscriptions in the center of the temple, then they will be studied and published and someone will realize it\u0027s unique. Especially if the rest of the monolith complex has obvious advanced knowledge encoded in it.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390871\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527875877\u0022 data-ipsquote-userid=\u002257622\u0022 data-ipsquote-username=\u0022Scotius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, Scotius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThen map of the Solar system is a good start. Also making clay orbs and engraving them with silhouettes of all continents and biggest islands(more or less acurately LOL). Make sure your orbs are properly fired before burying them everywhere around.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, maps would be readily recognizable, and maps that show the whole globe would be obviously non-ancient.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2018-06-01T18:23:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223390881\u0022 data-ipsquote-contentid=\u0022175525\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221527877212\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you do a big complex with the inscriptions in the center of the temple,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nit will burn together with temple. Sooner or later.\u003Cbr\u003E\nNot an artifact, but a mental system can survive. Ritual systems, superstitions, sacred systems enough easy to understand. Games for money. Enochian writing.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-01T18:24:30Z\u0022 title=\u002206/01/2018 06:24  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 1, 2018\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"}]}