{"TopicId":184191,"ForumId":44,"TopicTitle":"Should our next crewed landings be on Mars or the Moon?","CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-05-02T23:39:30Z","PageNum":1,"Articles":[{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-05-02T23:39:30Z","Content":"\n\u003Cp\u003E\nWith so much talk going on about SpaceX planning to colonize Mars and NASA planning to go to back the Moon, I\u0027ve gotten thinking about some things - which one should we really put our bets in?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m somewhat biased towards going to the Moon by now, but it just seems logical to me: it\u0027s waay closer to Earth (2-3 days of space travel compared to 3-9 months), we\u0027ve already got a bit of experience sending people there (we know what the dangers are), weaker gravity (easier to land on, launch from and build on), no atmosphere, there\u0027s areas with permanent sunlight (and lack thereof), the use of its Far Side to place radio telescopes with very little interference, not to mention the potential for mining (helium-3, iron, aluminium) and the confirmed presence of water.\n\u003C/p\u003E\n\u003Cp\u003E\nMars, on the other hand, what advantages does it have? Most of the arguments for colonizing it I see can be reduced to \u0022for the sake of it\u0022 (we don\u0027t exactly have the need to be an interplanetary species \u0022to guarantee our future\u0022, it may even be more dangerous to be such thing, as off-Earth people may claim independence from Earth; colonies on the Moon are just as equally \u0022interplanetary\u0022 as colonies on Mars; there doesn\u0027t seem to be any economic reason to, for instance mining on Mars and sending materials back to Earth is more challenging than doing so on the Moon - you\u0027re just sending people there because you can)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt feels like that old fan-made KSP video, \u003Ca href=\u0022https://www.youtube.com/watch?v=Y1XdMLUcd_c\u0022 rel=\u0022external nofollow\u0022\u003E\u0022Evacuate Kerbin!\u0022\u003C/a\u003E, where everyone is somehow convinced they should evacuate to Tylo, even though Laythe would obviously be a better option.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAny thoughts on this?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-03T18:34:31Z\u0022 title=\u002205/03/2019 06:34  PM\u0022 data-short=\u00225 yr\u0022\u003EMay 3, 2019\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2019-05-03T00:56:29Z","Content":"\n\u003Cp\u003E\nOld school me likes to think that the Moon is a conveniently located playground; it makes sense to me that one should first build a lunar base before trying the same on Mars, if only because the crew won\u0027t be commited to a full 2\u002B years, it will be easier to send additional supplies or evacuate sick people, and so on.\n\u003C/p\u003E\n\u003Cp\u003E\nMars seems like a better home because terraforming might be possible. Okay, so there\u0027s any amount of asterisks next to that statement, but at least it can be imagined. Even if possible, it won\u0027t happen until you have many thousands of people over there, or even a few million. I can\u0027t really think that far, I\u0027m more concerned about the first hundred, which will live in circumstances very similar to what you\u0027d need on the Moon as well.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, proper colonization or base-building doesn\u0027t seem to be in the cards just yet. All we can expect in the next decade or so will be flags-and-footprints; and for that, Mars is far more interesting than a return to the Moon. Also more ambitious, perhaps even reckless.\n\u003C/p\u003E\n\u003Cp\u003E\nQuestion is \u0022where should or \u003Cem\u003Enext\u003C/em\u003E crewed landings be\u0022 and I can\u0027t really make up my mind. To some degree, i don\u0027t even care. For the long run, see above.\n\u003C/p\u003E\n"},{"CreatedByName":"Brownie352","CreatedById":166604,"CreatedDateTime":"2019-05-03T02:20:20Z","Content":"\n\u003Cp\u003E\nGoing to mars without a camp building experience doesn\u0027t sound right to me.   In such a complex mission the odds of something going kapoot aren\u0027t low (parts breaking,people needing surgery etc),so mars doesn\u0027t look good on that.   To land on mars you need to have solved the refueling on the surface of mars issue which i doubt we will have solved as early as the first crewed mission on either bodies.If you were to ask me i would call for a Venusian Flyby the main issue with that being the increased radiation from the sun.  \n\u003C/p\u003E\n"},{"CreatedByName":"Lisias","CreatedById":187168,"CreatedDateTime":"2019-05-03T02:22:44Z","Content":"\n\u003Cp\u003E\nIMHO, Moon. And by plain practical reasons.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a lot to be learnt and relearnt about space travelling. We have a lot of more knowledge about staying at space than before , but we lost something on landings - see the mishap on Beresheet.\n\u003C/p\u003E\n\u003Cp\u003E\nOr even SpaceX recently.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd not to mention the human condition, see Boeing and the utter fiasco called MCAS, and the recent news about NASA wasting two rockets 10 years ago due falsified quality reports from a supplier - that were doing that for 10 years!!\n\u003C/p\u003E\n\u003Cp\u003E\nAll that\u0027s needed are two generations to definitively loose a technology for good. And it will be exactly these two by the time we land on moon with our own feet once more.\n\u003C/p\u003E\n\u003Cp\u003E\nWe have to start all over from scratch. Again.\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2019-05-03T03:19:57Z","Content":"\n\u003Cp\u003E\nMars.\n\u003C/p\u003E\n\u003Cp\u003E\nNo, Europa. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHell, why not Alpha Centauri!\n\u003C/p\u003E\n\u003Cp\u003E\nAs long as we\u0027re dreaming, why not dream big?\n\u003C/p\u003E\n"},{"CreatedByName":"SlamduncAZ","CreatedById":194909,"CreatedDateTime":"2019-05-03T03:24:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592512\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556853597\u0022 data-ipsquote-userid=\u002232993\u0022 data-ipsquote-username=\u0022razark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, razark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMars.\n\u003C/p\u003E\n\u003Cp\u003E\nNo, Europa. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHell, why not Alpha Centauri!\n\u003C/p\u003E\n\u003Cp\u003E\nAs long as we\u0027re dreaming, why not dream big?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree with my life’s dedication, except for one thing: Alpha Centauri is the star system. Is Proxima Centauri b (an exoplanet orbiting Proxima Centauri) what you’re looking for?\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2019-05-03T03:27:41Z","Content":"\n\u003Cp\u003E\nI stand by what I said.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2019-05-03T05:07:50Z","Content":"\n\u003Cp\u003E\nMoon base first, supported by space station(s) in Earth\u0027s orbit. We need to learn how to deal with environment beyond relatively safe LEO. We need to learn how to build and maintain long - term habitats. We need to learn how to do \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E properly. Building proper space industry would go a long way towards making sure, this time we\u0027ll plant more than just couple of flags outside of Earth too \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2019-05-03T07:40:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592428\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556840370\u0022 data-ipsquote-userid=\u0022152223\u0022 data-ipsquote-username=\u0022Aperture Science\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Aperture Science said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhich\u003Cspan\u003E﻿\u003C/span\u003E one should we really put our bets in?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhichever one has the money... And so far, there\u0027s more money being put on the Moon than Mars, due to nations and companies expressing their plans for it (NASA/US is one, but I know China is planning theirs too. Russia is a bit of open question at the moment).\n\u003C/p\u003E\n"},{"CreatedByName":"Orc","CreatedById":154404,"CreatedDateTime":"2019-05-03T08:01:44Z","Content":"\n\u003Cp\u003E\nHi all,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe answer to the question depends on what your priorities are. Hunt down a copy of Robert Zubrin\u0027s Case for Mars. It clearly outlines why a Mars-First program is the only one that is going to lead to a sustainable program and one that yields real amounts of useful science.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe arguments are (and I am paraphrasing from stuff I haven\u0027t read in a decade):\n\u003C/p\u003E\n\u003Cp\u003E\n(a) Mars is the safest place in the inner solar system. The Moon\u0027s surface might as well have a bull-eye painted on it when considering solar storms. LEO is only safe because of the Earth\u0027s magnetic field, and the opinion for crews to abandon their space station before any really big solar storms hit.\n\u003C/p\u003E\n\u003Cp\u003E\n(b) Mars has the biggest bundle of resources that can be used relatively easily. Mars atmosphere and regolith contains practically all the minerals and elements we need to build a permanent civilization, including water, oxygen, nitrogen, sulfur, phosphorus, iron, aluminium, carbon, silicon and uranium. The Moon has diddly-squat. The ice in the polar craters is quite inadequate for supporting a growing civilization (though it might do for a short term science base). The grand scheme to use the polar ice as fuel (H2 and O2 or as ALICE) would deplete the resource even faster than a growing colony.The rest of the moon is basically iron and aluminium with some trace contaminants.\n\u003C/p\u003E\n\u003Cp\u003E\n(c) Mars has gravity that is much closer to Earth\u0027s (about 40%). Humans can probably live healthy lives there without resorting to multi-hour workouts each day, and exotic pharmacology. The Moon has only 16.6% Earth gravity. LEO has nothing, unless you plan to use artificial gravity.\n\u003C/p\u003E\n\u003Cp\u003E\n(d) Because Mars has an atmosphere (for aero-braking and aero-capture) it is actually CLOSER to Earth in terms of delta-V than the Moon (not by much but it is). That means the same vehicle can deliver more mass to the surface of Mars.\n\u003C/p\u003E\n\u003Cp\u003E\n(e) Mars has a variety of energy sources, including 12 hours a day of sunshine, geo-thermal, and wind. On the moon you have 14 days of sunlight out of every 28. For the rest of the 28 days you had better hope your batteries hold out.\n\u003C/p\u003E\n\u003Cp\u003E\n(f) Mars is a whole new world of geography to explore and research. The Moon is just an overgrown asteroid with about enough geological interest as a square kilometer of the Grand Canyon National Park.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOf cause if your goal is not to establish a meaningful long term program, and instead go for another Flags\u0026amp;Footprints Photo-op then none of the above matters. The Moon is a resource sink for politicians forwarding the interests of their constituents (which mostly don\u0027t including the humans that voted  for them but rather the corporations that paid for their campaigns).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf your motivation for Space travel is not creating the next stage of human civilization then you are in the wrong business and wasting your time and other people\u0027s money.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards\n\u003C/p\u003E\n\u003Cp\u003E\nOrc\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2019-05-03T09:55:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592598\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556870504\u0022 data-ipsquote-userid=\u0022154404\u0022 data-ipsquote-username=\u0022Orc\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Orc said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n... Motivation\u003Cspan\u003E﻿\u003C/span\u003E for Space travel ... creating the next stage of human civilization\u003Cspan\u003E﻿\u003Cspan\u003E﻿ ...\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn that case then a colony on the surface of *anything* is stupid. There\u0027s a reason the most advanced civilizations are those who can mobilize the easiest.\n\u003C/p\u003E\n"},{"CreatedByName":"DNKKING","CreatedById":197084,"CreatedDateTime":"2019-05-03T10:04:33Z","Content":"\n\u003Cp\u003E\nThe man do go to Mars, because, Mars is bigger than the moon and she is not more dangerous than Moon. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-03T10:05:06Z\u0022 title=\u002205/03/2019 10:05  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 3, 2019\u003C/time\u003E by DNKKING\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2019-05-03T12:24:27Z","Content":"\n\u003Cp\u003E\nMoon primarily because its closer, this make build up, supply and evacuation far easier. \u003Cbr\u003E\nYou can evacuated directly from Moon surface or by Moon orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nYes its an more hostile place than Mars and is an less juicy target but ease of access makes its an winner in my view. \n\u003C/p\u003E\n"},{"CreatedByName":"DNKKING","CreatedById":197084,"CreatedDateTime":"2019-05-03T12:31:25Z","Content":"\n\u003Cp\u003E\nThis is the argument. By Orc.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\nThe arguments are (and I am paraphrasing from stuff I haven\u0027t read in a decade):\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n(a) Mars is the safest place in the inner solar system. The Moon\u0027s surface might as well have a bull-eye painted on it when considering solar storms. LEO is only safe because of the Earth\u0027s magnetic field, and the opinion for crews to abandon their space station before any really big solar storms hit.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n(b) Mars has the biggest bundle of resources that can be used relatively easily. Mars atmosphere and regolith contains practically all the minerals and elements we need to build a permanent civilization, including water, oxygen, nitrogen, sulfur, phosphorus, iron, aluminium, carbon, silicon and uranium. The Moon has diddly-squat. The ice in the polar craters is quite inadequate for supporting a growing civilization (though it might do for a short term science base). The grand scheme to use the polar ice as fuel (H2 and O2 or as ALICE) would deplete the resource even faster than a growing colony.The rest of the moon is basically iron and aluminium with some trace contaminants.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n(c) Mars has gravity that is much closer to Earth\u0027s (about 40%). Humans can probably live healthy lives there without resorting to multi-hour workouts each day, and exotic pharmacology. The Moon has only 16.6% Earth gravity. LEO has nothing, unless you plan to use artificial gravity.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n(d) Because Mars has an atmosphere (for aero-braking and aero-capture) it is actually CLOSER to Earth in terms of delta-V than the Moon (not by much but it is). That means the same vehicle can deliver more mass to the surface of Mars.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n(e) Mars has a variety of energy sources, including 12 hours a day of sunshine, geo-thermal, and wind. On the moon you have 14 days of sunlight out of every 28. For the rest of the 28 days you had better hope your batteries hold out.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n(f) Mars is a whole new world of geography to explore and research. The Moon is just an overgrown asteroid with about enough geological interest as a square kilometer of the Grand Canyon National Park.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:#ffffff;color:#353c41;font-size:14px;\u0022\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2019-05-03T12:34:43Z","Content":"\n\u003Cp\u003E\nMars is easier to get to, and is easier to make a non-closed life support system work. It has a lower than earth gravity, which makes it a step toward the stars, but no so little gravity that we will need to bring our own gravity.\u003Cbr\u003E\nAnd it\u0027s far enough from earth that there\u0027s a natural 4-6 month quarantine in place, all but eliminating the possibility of a single cause of extinction hitting both places at once.\n\u003C/p\u003E\n"},{"CreatedByName":"DNKKING","CreatedById":197084,"CreatedDateTime":"2019-05-03T12:48:51Z","Content":"\n\u003Cp\u003E\nMars. Because:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\nMars is better than the moon.\n\u003C/li\u003E\n\u003Cli\u003E\nMars is not more dangerous than the moon.\n\u003C/li\u003E\n\u003Cli\u003E\nMars is bigger than the moon.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\nMars is the futur of humanity.\n\u003C/li\u003E\n\u003Cli\u003E\nMars have a lot of resource.\n\u003C/li\u003E\n\u003Cli\u003E\nThe gravity of March is almost similar to ours.\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\nMars is more beautiful than the moon.\n\u003C/li\u003E\n\u003Cli\u003E\nThe moon is too small.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Moon is \u003Cstrong\u003Every\u003Csup\u003E1000\u003C/sup\u003E\u003C/strong\u003E  Dangerous.\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nRegards\n\u003C/p\u003E\n\u003Cp\u003E\nDNKKING.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-03T12:50:09Z\u0022 title=\u002205/03/2019 12:50  PM\u0022 data-short=\u00225 yr\u0022\u003EMay 3, 2019\u003C/time\u003E by DNKKING\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":".50calBMG","CreatedById":150444,"CreatedDateTime":"2019-05-03T13:02:22Z","Content":"\n\u003Cp\u003E\nOnly problems with your logic is that the moon is much easier to get to, and at certain times Mars is far more dangerous, like the EDL phase, or the journey there. I agree that Mars is humanities future, but we just aren\u0027t ready yet. We can easily set something up on the moon at this point, but we don\u0027t have the experience in landing anything larger than the curiosity rover on Mars yet, so it is a good idea to take baby steps for now. \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2019-05-03T13:18:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592668\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556888542\u0022 data-ipsquote-userid=\u0022150444\u0022 data-ipsquote-username=\u0022.50calBMG\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, .50calBMG said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOnly problems with your logic is that the moon is much easier to get to, and at certain times Mars is far more dangerous, like the EDL phase, or the journey there. I agree that Mars is humanities future, but we just aren\u0027t ready yet. We can easily set something up on the moon at this point, but we don\u0027t have the experience in landing anything larger than the curiosity rover on Mars yet, so it is a good idea to take baby steps for now. \u003Cspan\u003E﻿\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMars is cheaper to get to in \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, Moon is faster, adding return trip it cancel out a bit expect with \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, not that this is an requirement for mars. \u003Cbr\u003E\nIt also is for an long term Moon base. \u003Cbr\u003E\nMars is not safe in any way simply as its very limited abort options. You can very easy end up in an way you will run out of resources and die setting like the old polar explorers however live in 4K. \u003Cbr\u003E\nMoon failure modes tend to create craters, as you can abort from surface and rescue missions is plausible. \u003Cbr\u003E\u003Cbr\u003E\nMoon also have the benefit of being an revenue source because  of tourism and resources down the line.\u003Cbr\u003E\nLong term Mars is more interesting, but 25 year is not long term \n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2019-05-03T13:39:03Z","Content":"\n\u003Cp\u003E\nSafety is good to keep in mind, but we\u0027re talking about putting humans on the surface of another world.  People are going to die doing it, whether we go to the Moon or Mars.  While the moon is much closer, the chances of a problem coming up where it makes that much of a difference are pretty small.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-03T13:39:28Z\u0022 title=\u002205/03/2019 01:39  PM\u0022 data-short=\u00225 yr\u0022\u003EMay 3, 2019\u003C/time\u003E by razark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DNKKING","CreatedById":197084,"CreatedDateTime":"2019-05-03T14:15:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592690\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556890743\u0022 data-ipsquote-userid=\u002232993\u0022 data-ipsquote-username=\u0022razark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, razark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cfont style=\u0022vertical-align:inherit;\u0022\u003E\u003Cfont style=\u0022vertical-align:inherit;\u0022\u003EIl est bon de garder à l’esprit la sécurité, mais nous parlons de mettre \u003Cabbr title=\u0022Launch Escape System\u0022\u003Eles\u003C/abbr\u003E humains à la surface d’un autre monde. \u003C/font\u003E\u003Cfont style=\u0022vertical-align:inherit;\u0022\u003E\u003Cabbr title=\u0022Launch Escape System\u0022\u003ELes\u003C/abbr\u003E gens vont mourir en le faisant, que nous allions sur la Lune ou sur Mars. \u003C/font\u003E\u003Cfont style=\u0022vertical-align:inherit;\u0022\u003EBien que la lune soit beaucoup plus proche, \u003Cabbr title=\u0022Launch Escape System\u0022\u003Eles\u003C/abbr\u003E chances qu\u0027un problème se pose là où il fait une telle différence sont plutôt minimes. \u003C/font\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe moon is very\u003Csup\u003E10\u003C/sup\u003E  dangerous.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.astrosurf.com/luxorion/toxicite-poussiere-lunaire.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.a\u003C/a\u003E\u003Ca href=\u0022http://www.astrosurf.com/luxorion/toxicite-poussiere-lunaire.htm\u0022 rel=\u0022external nofollow\u0022\u003Estrosurf.com/luxorion/toxicite-poussiere-lunaire.htm\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2019-05-03T14:28:41Z","Content":"\n\u003Cp\u003E\nI‘m on #teammoon, it‘s closer therefore safer for the foreseeable future, it‘s got resources  to base an economy around while also benefiting the earth thanks to it‘s proximity.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to have something permanent in space that may drive an eventual expansion beyond, you want a cislunar industry. There won‘t be an exodus to mars anyway even if it got anything you need to live, simply because it is much more unpleasant than any of the empty places on earth. \n\u003C/p\u003E\n\u003Cp\u003E\nBonus point: you can stand on the surface of the moon and admire our blue planet.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-03T14:30:33Z\u0022 title=\u002205/03/2019 02:30  PM\u0022 data-short=\u00225 yr\u0022\u003EMay 3, 2019\u003C/time\u003E by Canopus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2019-05-03T14:44:09Z","Content":"\n\u003Cp\u003E\nYes.\n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2019-05-03T14:54:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592598\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556870504\u0022 data-ipsquote-userid=\u0022154404\u0022 data-ipsquote-username=\u0022Orc\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Orc said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n(f) Mars is a whole new world of geography to explore and research. The Moon is just an overgrown asteroid with about enough geological interest as a square kilometer of the Grand Canyon National Park.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis. The only thing the Moon has to recommend it is its proximity in travel time. Place it anywhere else in the Solar System, and it drops to the very bottom of the list of places that would be interesting to visit. Even by the standards of other minor rocky bodies it\u0027s a bone-dry carcinogenic ball of silicates and dust. You can\u0027t even use the \u0022preparing for a Mars mission\u0022 argument, since there\u0027s going to be nearly no common technologies. The environment on the surface of the Moon almost completely fails to resemble the environment on Mars, and designs for dedicated lunar habs, landers, rovers, power systems, etc. are all going to be very poorly designed or straight up unusable for a Mars mission.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592712\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556893721\u0022 data-ipsquote-userid=\u002257774\u0022 data-ipsquote-username=\u0022Canopus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Canopus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nit‘s got resources  to base an economy around while also benefiting the earth thanks to it‘s proximity.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd what resources would these be, exactly? There\u0027s some water, but not nearly enough for industry, especially if it\u0027s being used as fuel. Everything else it\u0027s got is also stuff that\u0027s as common as dirt on Earth. Plus, even if you did start mining stuff on the Moon, your proposed lunar industry is still going to be dependent on Earth for anything not made exclusively of a common metal. Any industry on the Moon is going to produce exclusively such things as are made only of metal and have reason to specifically be in lunar space, and that\u0027s not enough to support more than a small mining settlement.\n\u003C/p\u003E\n\u003Cp\u003E\nOne of the big things recommending Mars on the industry front is that it does have resources. Lots of them, in usable quantities. Martian civilization can, in principle, become self-sufficient and bootstrapping. A lunar civilization simply can\u0027t, because it lacks the resources. Sending stuff into space is expensive, and a goal of any plan for long-term activity should be to make that activity as independent of support from Earth as possible. High dependence on trade is all well and good from an economics standpoint, but it\u0027s not very useful in times of crisis.\n\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2019-05-03T15:38:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592723\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556895283\u0022 data-ipsquote-userid=\u0022157062\u0022 data-ipsquote-username=\u0022IncongruousGoat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, IncongruousGoat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis. The only thing the Moon has to recommend it is its proximity in travel time. Place it anywhere else in the Solar System, and it drops to the very bottom of the list of places that would be interesting to visit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt isn\u0027t though. It sits right on our doorstep and thats what makes it one of the most important bodies in our solar system\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592723\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556895283\u0022 data-ipsquote-userid=\u0022157062\u0022 data-ipsquote-username=\u0022IncongruousGoat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n38 minutes ago, IncongruousGoat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd what resources would these be, exactly? There\u0027s some water, but not nearly enough for industry, especially if it\u0027s being used as fuel. Everything else it\u0027s got is also stuff that\u0027s as common as dirt on Earth. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut they are at the bottom of earths steep gravity well and bringing them on mass into orbit is complicated and expensive. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592723\u0022 data-ipsquote-contentid=\u0022184191\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556895283\u0022 data-ipsquote-userid=\u0022157062\u0022 data-ipsquote-username=\u0022IncongruousGoat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n40 minutes ago, IncongruousGoat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPlus, even if you did start mining stuff on the Moon, your proposed lunar industry is still going to be dependent on Earth for anything not made exclusively of a common metal. Any industry on the Moon is going to produce exclusively such things as are made only of metal and have reason to specifically be in lunar space, and that\u0027s not enough to support more than a small mining settlement.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhen you can bring the bulk of raw materials you need from the moon, it\u0027s not going to hurt you to bring the small rest from the earth. \n\u003C/p\u003E\n"},{"CreatedByName":"DNKKING","CreatedById":197084,"CreatedDateTime":"2019-05-03T15:56:05Z","Content":"\n\u003Ctable border=\u00221\u0022 cellpadding=\u00221\u0022 cellspacing=\u00221\u0022 style=\u0022width:500px;\u0022\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd style=\u0022text-align:center;\u0022\u003E\n\u003Cb\u003ECHOICE\u003C/b\u003E\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n\u003Cb\u003EADVANTAGE\u003C/b\u003E\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n\u003Cb\u003EDANGER      \u003C/b\u003E\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd style=\u0022text-align:center;\u0022\u003E\n\u003Cp\u003E\nMARS\n\u003C/p\u003E\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n COLONIZATION, EXPLORATION, NEW RESOURCE, TRAVEL, AGRICULTURE, TOURISM AND PROSPERITY\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n Weightlessness during travel, Weather, Radiation and Neurological disorder ( stress, depression est... )\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd style=\u0022text-align:center;\u0022\u003E\n\u003Cp\u003E\nMOON\n\u003C/p\u003E\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\nENERGY,  TRAVEL, EXPLORATION, NEW RESSOURCE, AND TOURISM \n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n Disease and Radiation\n\u003C/td\u003E\n\u003C/tr\u003E\u003C/tbody\u003E\u003C/table\u003E\u003Cp\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n"}]}