{"TopicId":190760,"ForumId":44,"TopicTitle":"Why Nasa Mission control from Apollo area look so modern even by today standard? and what do you think about \u0026quot;For all mankind\u0026quot; miniseries?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2020-01-01T18:28:19Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2020-01-01T18:28:19Z","Content":"\n\u003Cp\u003E\nI love everything related to Space that why i bought KSP all that years ago \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERecently i watched fragment of new Episode of Vintage Space by Amy Shira Teitel, it was about new Apple TV alternative history where Soviets/Russian landed on Mun before American, my computer went into BSOD state when she announced that it would be spoilers so o decided that it\u0027s sign from heaven to watch series first \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003EFrom time perspective i think it maybe it would be good if Soviets, not American landed there first, you see I see American(and Brits too \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E )\u003C/span\u003E\u003C/span\u003E as very hard working smart people, but they do their best only if someone hurt their pride, so if Russian landed first maybe President Nixon would not call off Apollo 18,19 and 20, but instead go \u0022All in\u0022 and to show that NASA is better than Soviet Space Program and chose to land people on Mars\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EBefore this century (XX century) will end we will send people to Mars, because it even harder than Moon .\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for original question when i watch old NASA videos from 60\u0027s mission control look so modern all those flat screen in 60\u0027s and mission controller consoles have actual GUI (Graphical User Interface) wile even in late  90\u0027s in Polish schools we had computers run under MS-DOS and command line \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2020-01-02T00:56:16Z","Content":"\n\u003Cp\u003E\nBack in the 1990s I had a job at a company that made a lot of RADAR consoles for the US Navy.   Those consoles would not have looked out of place at NASA during an Apollo launch: some rather basically shaped sheet metal* supporting CRTs and plenty of switches.  I suspect that modern consoles are rather similar, with LCDs replacing any display surface, and possibly touchscreens being used.\n\u003C/p\u003E\n\u003Cp\u003E\nThe key point here is that aerospace is a conservative field.  And those old control panels *worked* (actually I suspect they are still in use).  10 years ago putting touch surfaces for control would have been asking for a launch failure when one of your critical engineers kept having to cycle through screens because his touchscreen insisted on \u0022interpreting\u0022 his touch instead of showing him the data he needed.  Even now there is always the danger of the screen being dirty or the new software being buggy in ways that the old wasn\u0027t, and all to change something that wasn\u0027t broken or even adding mass to the rocket...\n\u003C/p\u003E\n\u003Cp\u003E\nI doubt that 1960s had anything resembling a GUI as the idea is typically credited as being introduced in 1968 (the mother of all demos by Douglas Englebart).  Much of those fancy screens were showing little more than simple slides, although often subtly moved in ways that transmitted important information well (plus a few TVs that were really fancy at the time.  Although creating a display on them must have pushed several computers to their limits).\n\u003C/p\u003E\n\u003Cp\u003E\n* \u0022bent sheet metal\u0022 was typically only used for shore duty, while the consoles on ships were milled from a solid block of aluminum.  Plenty of business designing entire consoles just for shore duty that could be built for lower costs.\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2020-01-02T04:11:10Z","Content":"\n\u003Cp\u003E\nRecent post that might be of some interest:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u002276452\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5269403926\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/91282-for-questions-that-dont-merit-their-own-thread/page/141/\u0026amp;tab=comments\u0026amp;do=embed\u0026amp;comment=3722621\u0026amp;embedComment=3722621\u0026amp;embedDo=findComment#comment-3722621\u0022 style=\u0022height:276px;max-width:500px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2020-01-02T17:46:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223723570\u0022 data-ipsquote-contentid=\u0022190760\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221577926576\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBack in the 1990s I had a job at a company that made a lot of RADAR consoles for the US Navy.   Those consoles would not have looked out of place at NASA during an Apollo launch: some rather basically shaped sheet metal* supporting CRTs and plenty of switches.  I suspect that modern consoles are rather similar, with LCDs replacing any display surface, and possibly touchscreens being used.\n\u003C/p\u003E\n\u003Cp\u003E\nThe key point here is that aerospace is a conservative field.  And those old control panels *worked* (actually I suspect they are still in use).  10 years ago putting touch surfaces for control would have been asking for a launch failure when one of your critical engineers kept having to cycle through screens because his touchscreen insisted on \u0022interpreting\u0022 his touch instead of showing him the data he needed.  Even now there is always the danger of the screen being dirty or the new software being buggy in ways that the old wasn\u0027t, and all to change something that wasn\u0027t broken or even adding mass to the rocket...\n\u003C/p\u003E\n\u003Cp\u003E\nI doubt that 1960s had anything resembling a GUI as the idea is typically credited as being introduced in 1968 (the mother of all demos by Douglas Englebart).  Much of those fancy screens were showing little more than simple slides, although often subtly moved in ways that transmitted important information well (plus a few TVs that were really fancy at the time.  Although creating a display on them must have pushed several computers to their limits).\n\u003C/p\u003E\n\u003Cp\u003E\n* \u0022bent sheet metal\u0022 was typically only used for shore duty, while the consoles on ships were milled from a solid block of aluminum.  Plenty of business designing entire consoles just for shore duty that could be built for lower costs.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis, and no back in the 60s it was no GUI, if lucky you could change who dataset to show. Design stayed as it worked, however guess SpaceX does it much more in software. However switches tend to be faster for an trained operator.\u003Cbr\u003E\nFor ships you also have lots of overrides, you don\u0027t want to relay on software as only arming of an close in weapon system who can fire automatically at close targets. \u003Cbr\u003E\u003Cbr\u003E\nAlso various overrides if something fails, this is also true in industry. Worked one place they had an robotic pallet warehouse for books, some stuff fell off the pallet and the operator stopped the crane with software and went down to pick up the books. \u003Cbr\u003E\nSome other thought the stopped crane was an bug and reset it, correct procedure was to remove the key powering the crane, yes he managed to run to safety. \u003Cbr\u003E\u003Cbr\u003E\nHowever the big projector screen still looks cool. Guess that one is replaced with an modern projector setup however. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-02T17:47:35Z\u0022 title=\u002201/02/2020 05:47  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 2, 2020\u003C/time\u003E by magnemoe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2020-01-03T15:17:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223723769\u0022 data-ipsquote-contentid=\u0022190760\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221577987176\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis, and no back in the 60s it was no GUI, if lucky you could change who dataset to show. Design stayed as it worked, however guess SpaceX does it much more in software. However switches tend to be faster for an trained operator.\u003Cbr\u003E\nFor ships you also have lots of overrides, you don\u0027t want to relay on software as only arming of an close in weapon system who can fire automatically at close targets. \u003Cbr\u003E\u003Cbr\u003E\nAlso various overrides if something fails, this is also true in industry. Worked one place they had an robotic pallet warehouse for books, some stuff fell off the pallet and the operator stopped the crane with software and went down to pick up the books. \u003Cbr\u003E\nSome other thought the stopped crane was an bug and reset it, correct procedure was to remove the key powering the crane, yes he managed to run to safety. \u003Cbr\u003E\u003Cbr\u003E\nHowever the big projector screen still looks cool. Guess that one is replaced with an modern projector setup however. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut all those Apollo looks like GUI.\n\u003C/p\u003E\n"},{"CreatedByName":"Akela","CreatedById":202196,"CreatedDateTime":"2020-01-07T15:22:51Z","Content":"\n\u003Cp\u003E\nThis was something that confused me for the longest time, but it turns out those screens aren\u0027t what you think they are - the mission control consoles and the large projection screen back in the Apollo era weren\u0027t really computers in the modern sense of the word, but rather more align to television monitors that could be set to different channels. The images themselves were actually a composite of raw points plotted and rendered on a mainframe, then overlaid with \u003Cem\u003Ephysical slides\u003C/em\u003E containing the graphics that you\u0027re probably thinking as being similar to a GUI - all having to be preformatted for the different types of data the mainframe could display of course, with the combined image filmed with a video camera and essentially broadcast through closed circuit television. There was actually a complicated mechanical system in place that would pick from a large bank of slides when a person on one of the consoles requested different information. \u003Cbr\u003E\u003Cbr\u003E\nSo yeah, if the displays looked decades more advanced then anything that was possible at the time, it\u0027s because in reality it was more of an electromechanical system that appears way more advanced then it actually was. It was also mostly passive - other then requesting new data, users at the consoles couldn\u0027t really interact with the system like you would a computer, not in the way that movies tend to suggest. Again, imagine the consoles as being more like TVs with a set of closed circuit television channels broadcasting various data.\u003Cbr\u003E\u003Cbr\u003E\nSource: \u003Ca href=\u0022https://arstechnica.com/science/2012/10/going-boldly-what-it-was-like-to-be-an-apollo-flight-controller/2/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://arstechnica.com/science/2012/10/going-boldly-what-it-was-like-to-be-an-apollo-flight-controller/2/\u003C/a\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe computers downstairs in the RTCC [Real Time Computing Complex] were responsible for producing the actual data, which could be numbers, a series of plotted points, or a single projected moving point. The System/360 mainframes generated the requested data on a CRT screen using dedicated digital-to-television display generators; positioned over the CRT in turn was a video camera, watching the screen. For the oxygen status display example above, the mainframe would produce a series of numerical columns and print them on the CRT.\n\u003C/p\u003E\n\u003Cp\u003E\nThe numbers were just that, though. No column headings, no labels, no descriptive text, no formatting, no cell outlines, no nothing—bare, unadorned columns of numbers. In order to make them more understandable, an automated mechanical system would retrieve an actual physical slide containing printed column headings and other formatting reference information from a huge bank of such slides, and place the slide over a light source and project it through a series of lenses into the video camera positioned above the CRT. The mixed image, made up of the CRT\u0027s bare columns and the slide containing the formatting, was then transmitted to the controller\u0027s console screen as a single video stream.\u003Cbr\u003E\u003Cbr\u003E\nThis process was necessary to dress up and clarify the mainframes\u0027 sparse output, since the modern concept of a single unified graphical display consisting of mixed static and dynamic elements was impossible with the era\u0027s technology. The mainframe produced the naked numbers or the moving dot, the slide provided the formatting or the background image, and a video camera transmitted the two separate elements sandwiched together for display on the controllers\u0027 console screens or for projection up on the big front 10\u0027×20\u0027 screen or one of its smaller flanking companions.\u003Cbr\u003E\u003Cbr\u003E\nIf graphs were needed—if, for example, a controller needed to see how a certain spacecraft parameter was varying over time—controllers could call up snapshots of data using a panel called a SMEK—a Summary Message Keyboard. A SMEK keypress would summon a column of data about a spacecraft subsystem onto the controller\u0027s display. Additional keypresses would add additional columns of data for the subsystem, building a set of successive subsystem measurements in order, so that the controller could get a picture of how a parameter was changing over time. Even with the SMEK, though, there was nothing even vaguely resembling Excel with which to construct a graph. Controllers would write down the information on the screen and then pull out the slide rules and graph paper. Or they could summon a hard copy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAs for the large screens, since they were back projected there\u0027s actually a large, blacked out projection room directly in front of the mission control room, apparently called the \u003Ca href=\u0022https://spacecenter.org/restoring-apollo-mission-control-center/\u0022 rel=\u0022external nofollow\u0022\u003E\u0022Bat Cave\u0022\u003C/a\u003E, which is weird to think about. I wonder if they still use back projection for those screens?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-01-07T15:23:43Z\u0022 title=\u002201/07/2020 03:23  PM\u0022 data-short=\u00224 yr\u0022\u003EJanuary 7, 2020\u003C/time\u003E by Akela\u003C/strong\u003E\n\u003C/span\u003E\n"}]}