{"TopicId":193828,"ForumId":44,"TopicTitle":"Airships","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2020-05-13T06:29:57Z","PageNum":1,"Articles":[{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2020-05-13T06:29:57Z","Content":"\n\u003Cp\u003E\nSo, a while ago I started this discussion off:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u002291005\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5378067833\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/157767-giant-airships-awesome/\u0026amp;do=embed\u0022 style=\u0022height:214px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nAnd then didn\u0027t really have time to participate in it.  Plus, it timed out after a while, so replying to it now would be necro\u0027ing.\n\u003C/p\u003E\n\u003Cp\u003E\nGiving credence to some of the interesting thoughts there (why I\u0027m linking it), I thought I\u0027d bring back up the subject of airships...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEspecially now with SpaceX making the possibility of a Mars colony (and thus regular lifts to Mars) a real thing, developing more efficient ways to get to orbit than rockets is becoming ever more imperative...\n\u003C/p\u003E\n\u003Cp\u003E\nInterestingly, orbital airships could work *even better* on Mars.  That\u0027s because:\n\u003C/p\u003E\n\u003Cp\u003E\n- The atmosphere on Mars is mostly composed of CO2, in comparison to which even a breathable N2/O2 mix is a lifting gas (and other, lighter gasses even more effective)\n\u003C/p\u003E\n\u003Cp\u003E\n- The gravity on Mars is much lower than Earth\u0027s, reducing the weight an airship needs to fight against when lifting a payload.\n\u003C/p\u003E\n\u003Cp\u003E\n- The air on mars is extremely thin, even near the surface- so it packs very little force, even in 100 km/hour winds.  This means that strong winds ripping apart an airship are less of a concern, and you don\u0027t need 2 separate \u0022stages\u0022 (a sturdy airship to take you to a \u0022Dark Sky\u0022 platform, where you transfer cargo/people to a lighter, larger airship designed for the calmer upper atmosphere of Earth...)  A single very large/weak airship could take you from the surface all the way to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n- Orbital Velocity on Mars is less than Earth.\n\u003C/p\u003E\n\u003Cp\u003E\n- Payloads returning from Mars to Earth are likely to have very high value for their weight, and be relatively small in total mass (mostly, people making a return trip).  This is the optimal niche for orbital airships- which would be EXTREMELY safe (not explosive, very easy to bail out of if things go south) and even at very large sizes have extremely limited cargo capacity...  An airship that takes you to orbit, where a specialized orbit-to-orbit only spacecraft takes you back to Earth, and a reusable reentry vehicle/pod takes you to the surface, would be ideal at high annual volumes of traffic I would think...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, this thread is for discussion of airships, orbital airships, and airships on Mars.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne misconception I wanted to clear up, by the way: envelope mass of an airship does NOT scale linearly with volume, because it\u0027s not a pressure vessel.  It operates at ambient (or close to ambient) pressure- indeed one of the design constraints of an orbital airship is that its volume needs to expand quite significantly on the way up, until the internal pressure is very low (and shrinks on the way back down).  Therefore, it really DOES benefit from the Square-Cube Law for envelope mass.\n\u003C/p\u003E\n\u003Cp\u003E\nMore importantly, an orbital airship also benefits from the Square-Cube Law when it comes to Drag: an orbital airship with 2x the dimensions in every axis has 8x the volume, but only 4x the cross-sectional and total surface areas...  So, 4x the Drag but 8x the volume to provide lifting capacity- adding up to MORE than 8x the payload capacity for 8x the size...  At small sizes, aerodynamic Drag is the major obstacle to achieving orbit: so bigger is definitely better for an orbital airship.\n\u003C/p\u003E\n"},{"CreatedByName":"Piscator","CreatedById":107202,"CreatedDateTime":"2020-05-13T07:00:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223784523\u0022 data-ipsquote-contentid=\u0022193828\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221589351397\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nInterestingly, orbital airships could work *even better* on Mars.  That\u0027s because:\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually, you probably wouldn\u0027t get an airship to work on Mars at all. As you mentioned, the Martian air is really thin. Since the lift depends on the mass of the displaced air, your lift/volume ratio would be a hundred times lower than on Earth.\n\u003C/p\u003E\n\u003Cp\u003E\n(I also don\u0027t think that the lower gravity would actually help, since the lift more accurately depends on the \u003Cem\u003Eweight\u003C/em\u003E of the displaced air, rather than its mass.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-13T07:01:23Z\u0022 title=\u002205/13/2020 07:01  AM\u0022 data-short=\u00224 yr\u0022\u003EMay 13, 2020\u003C/time\u003E by Piscator\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2020-05-13T07:09:16Z","Content":"\n\u003Cp\u003E\nIt seems to me that the low gravity on Mars is already an advantage for rockets (less delta-v required) and the thinner atmosphere would make electromagnetic launchers more practical than on Earth. The hard part would probably be the landing.\n\u003C/p\u003E\n\u003Cp\u003E\nAirships operating in that environment may not be all that useful at conventional sizes. So they\u0027ll have to be much larger than Earth airships for the same payloads. The density is just so low that the lift force will be small. \n\u003C/p\u003E\n\u003Cp\u003E\nAssuming Mars average surface pressure is 610 pascals and the average surface temperature is 215 Kelvin, then the density will be around 0.015 kg/m^3 for CO2. Normal air under the same conditions would have a density of 0.0099 kg/m^3. The difference is about 0.005 kg/m^3. So for every cubic meter of displacement you can lift 5 grams. You\u0027d need 200 m^3 to lift 1 kg. To lift 50 tonnes you\u0027d need 10 million m^3. Assuming a length to radius ratio of 20 you\u0027d need a cylinder 54 meters in radius and over one km long. And keep in mind that 50 tonnes has to include the structural mass for all that - something on the order of 406 thousand m^2. To make this fly at all you\u0027d need a structural area density of less than 0.123 kg per m^2. Probably doable. But if you want any performance margin you\u0027re going to want much less structural density. Or you have to build the vehicle much, much larger. And we haven\u0027t even considered the change in volume required as the vehicle gains altitude. But you also need a lot of ground infrastructure for such a beast. We\u0027re talking airships that are kilometers long. \n\u003C/p\u003E\n\u003Cp\u003E\nRather than trying to push airships to the limits of their performance, Mars lets us build rockets that can operate well below the limits of their performance. A mass ratio of 4 would be more than enough to put a vehicle into orbit from Mars\u0027s surface using Methalox. SSTOs are practical, even desirable, on Mars. \n\u003C/p\u003E\n\u003Cp\u003E\nTitan, on the other hand... with a denser atmosphere and even lower gravity, the lift from even a hot \u0022air\u0022 balloon could be quite significant.\n\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2020-05-13T07:12:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223784531\u0022 data-ipsquote-contentid=\u0022193828\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221589353239\u0022 data-ipsquote-userid=\u0022107202\u0022 data-ipsquote-username=\u0022Piscator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, Piscator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nActually, you probably wouldn\u0027t get an airship to work on Mars at all. As you mentioned, the Martian air is really thin. Since the lift depends on the mass of the displaced air, your lift/volume ratio would be a hundred times lower than on Earth.\n\u003C/p\u003E\n\u003Cp\u003E\n(I also don\u0027t think that the lower gravity would actually help, since the lift more accurately depends on the \u003Cem\u003Eweight\u003C/em\u003E of the displaced air, rather than its mass.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou are correct that you need 100x the volume of displacement per unit mass to even get off the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nBut orbital airships are already being designed to exceed this threshold many times over, here on Earth (see discussion of the \u0022Dark Sky\u0022 platform).  The upper stage would become the ONLY stage on Mars (the lower stage is designed for dense/turbulent air, and wouldn\u0027t be light enough for Mars.  Luckily, it wouldn\u0027t be needed either).\n\u003C/p\u003E\n\u003Cp\u003E\nThe lower gravity kicks in because if you need to displace 10 million cubic meters of air to get 10 tons to orbit on Earth, you could get more than 30 tons to orbit in Mars\u0027 lower gravity.\n\u003C/p\u003E\n\u003Cp\u003E\nThe denser gas mix on Mars (CO2 instead of M2/O2) also means you don\u0027t have to displace *quite* 100x as much air.  But the 1% density is analogous to operating high in Earth\u0027s atmosphere: which is something orbital airships ARE already being designed to do.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223784534\u0022 data-ipsquote-contentid=\u0022193828\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221589353756\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAirships operating in that environment may not be all that useful at conventional sizes. So they\u0027ll have to be much larger than Earth airships for the same payloads. The density is just so low that the lift force will be small. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo they won\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re thinking Goodyear Blimp.  I\u0027m talking JO Aerospace type airships- already designed to lift in less than 1% Earth sea level density air (in fact, less than 0.1% sea level density) and several dozen kilometers long.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it can fly at 0.1% sea level pressure on Earth, it can fly at 1% sea level pressure on Mars.  In fact, due to the lifting-gas issue I described in the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E (CO2 is denser than N2), it can fly at *lower* pressure on Mars.\n\u003C/p\u003E\n\u003Cp\u003E\nGravity comes into play only because an airship of a certain size can lift a certain WEIGHT off the ground.  That same weight equals more MASS in a low-gravity environment.  It\u0027s just like how you don\u0027t need as much Thrust:Mass ratio to lift off on Mun as you do on Kerbin...\n\u003C/p\u003E\n\u003Cp\u003E\nThe rest of your discussion is irrelevant, because nobody\u0027s talking of using breathing air as a lifting-gas on Mars (it would differ if I were talking of floating Landis-Land style cities there: which would be impractical).  My point is that even breathing-air lifts there, and gases like Helium or Argon that lift on Earth, are even MORE effective on Mars...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-13T07:21:55Z\u0022 title=\u002205/13/2020 07:21  AM\u0022 data-short=\u00224 yr\u0022\u003EMay 13, 2020\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2020-05-13T07:39:33Z","Content":"\n\u003Cp\u003E\nSo, we are talking about gas bags several kilometers long? Yeah, not going to happen. I can\u0027t even imagine the nightmare that would be maintenance of such monster. Forget people - you would need a fleet of drones just to check the covering for tears and holes. Or the size of any facility needed to perform any serious repairs - like changing damaged section of said covering.\n\u003C/p\u003E\n\u003Cp\u003E\nNobody will bother.\n\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2020-05-13T10:00:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223784540\u0022 data-ipsquote-contentid=\u0022193828\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221589355573\u0022 data-ipsquote-userid=\u002257622\u0022 data-ipsquote-username=\u0022Scotius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Scotius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo, we are talking about gas bags several kilometers long? Yeah, not going to happen. I can\u0027t even imagine the nightmare that would be maintenance of such monster. Forget people - you would need a fleet of drones just to check the covering for tears and holes. Or the size of any facility needed to perform any serious repairs - like changing damaged section of said covering.\n\u003C/p\u003E\n\u003Cp\u003E\nNobody will bother.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf it provides extremely low-cost access to orbit, it\u0027s worth it.\n\u003C/p\u003E\n\u003Cp\u003E\nKeep in mind there are Economies of Scale.  It isn\u0027t nearly 10x as expensive to check a 1.2 km long airship (a good starter size for carrying small to mid-sized cargos to orbit) for tears as it is a 120 meter rocket.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the cost of doing so PALES in comparison to the cost of refurbishing even a couple rocket engines... Which an orbiral airship doesn\u0027t have to worry about: as it uses clusters of ion thrusters (which typically are designed for very long service-lives) instead of rockets, to ascend to orbit over more than a week (the thrusters are powered by thin-film solar panels over part of the blimp surface).  And a failure of one or more ion engines won\u0027t cause loss of the airship or cargo: just a very, very slow (hours-long) drift back to ground-level where they can be repaired (remaining engines get it back to base).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-13T10:08:05Z\u0022 title=\u002205/13/2020 10:08  AM\u0022 data-short=\u00224 yr\u0022\u003EMay 13, 2020\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Piscator","CreatedById":107202,"CreatedDateTime":"2020-05-13T10:40:57Z","Content":"\n\u003Cp\u003E\nCould you perhaps give (or link to) a short summary on how an \u003Cem\u003Eorbital \u003C/em\u003Eairship would work (especially how you would get it to orbital velocities) and why it would be more cost-effective than conventional alternatives? I get the impression we\u0027re not all on the same page here.\n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2020-05-13T11:06:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223784576\u0022 data-ipsquote-contentid=\u0022193828\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221589366457\u0022 data-ipsquote-userid=\u0022107202\u0022 data-ipsquote-username=\u0022Piscator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, Piscator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nespecially how you would get it to orbital velocities\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe first stage of ATO is a conventional airship filled with helium.  V-shaped for the purpose of being aerodynamic, it is labeled the Ascender.  The orbital airship ascends to about 25 miles (40 km), then docks with stage two, a permanent, crewed platform called Dark Sky Station (DSS).\n\u003C/p\u003E\n\u003Cp\u003E\nLike the Ascender, the Dark Sky Station is an inflated structure without a rigid shell.  The first stage is prevented from ascending beyond 25 miles (40 km) because any orbital airship capable of surviving atmospheric winds would unfortunately be too heavy to make the trip into space.  Several prototypes of both the Ascender and the Dark Sky Station have already been created.\n\u003C/p\u003E\n\u003Cp\u003E\nThe third stage of ATO is the Orbital Ascender, a 6,000 foot (1.8 km) long air/spaceship designed to make the trip from the DSS to 93 miles (150 km), or low Earth orbit.  Although helium is still lighter than air at 25 miles (40 km), this effect diminishes and eventually halts, making the craft heavier than its surroundings. At 93 miles (150 km) the density of air is only three billionths of what it is at sea level.\n\u003C/p\u003E\n\u003Cp\u003E\nJP Aerospace has proposed covering this massive Ascender in solar panels and using ion engines to accelerate the craft to approximately 5 miles per second (8,000 meters per second), the required speed for any object to reach orbit.  It has been claimed that this process would take around five days.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003EUnfortunately, some simple calculations show that ion engines coupled with solar panels would not provide sufficient thrust to propel the massive envelope of gas to the speed required for atmospheric exit.\u003C/b\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\u003Cp\u003E\nIt\u0027s the old failed Rocket on a Balloon concept, but with more... \u003Cem\u003Ebloat\u003C/em\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2020-05-13T12:25:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223784572\u0022 data-ipsquote-contentid=\u0022193828\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221589364053\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd the cost of doing so PALES in comparison to the cost of refurbishing even a couple rocket engines...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCitation needed.\n\u003C/p\u003E\n"},{"CreatedByName":"Nightside","CreatedById":150244,"CreatedDateTime":"2020-05-13T18:24:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223784576\u0022 data-ipsquote-contentid=\u0022193828\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221589366457\u0022 data-ipsquote-userid=\u0022107202\u0022 data-ipsquote-username=\u0022Piscator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Piscator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCould you perhaps give (or link to) a short summary on how an \u003Cem\u003Eorbital \u003C/em\u003Eairship would work (especially how you would get it to orbital velocities) and why it would be more cost-effective than conventional alternatives? I get the impression we\u0027re not all on the same page here.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAirship-to-orbit (ATO) concept by JP Aerospace.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.jpaerospace.com/ATO/ATO.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.jpaerospace.com/ATO/ATO.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ascender6000_BG.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022http://www.jpaerospace.com/ascender/Ascender6000_BG.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ascender3.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002257.94\u0022 height=\u0022248\u0022 width=\u0022428\u0022 src=\u0022http://www.jpaerospace.com/ascender/ascender3.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2020-05-13T19:08:56Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022methane-flammability.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002280.78\u0022 height=\u0022475\u0022 width=\u0022588\u0022 src=\u0022https://www.av8n.com/physics/img48/methane-flammability.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSteam and methane could be the workhorses of buoyant gasses on Earth and Venus.  These give half the lifting performance of hydrogen and helium, even though they have six times the mass, because they displace half the weight of the air.  \n\u003C/p\u003E\n\u003Cp\u003E\nFuel cells could be the key for using methane to maintain steam. \n\u003C/p\u003E\n\u003Cp\u003E\nI think manned flight using flammable gas airships should not be banned forever.  A steam balloon needs insulation.  Methane could provide that insulation.  The possibility of methane ignition is eliminated if the shielding gas is less than 13% oxygen.  So if the outmost layer of the airship were simply hot air enriched with extra nitrogen, then the airship could not ignite even if penetrated by bullets and struck by lightning at the same time.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOn Venus of course the ignition risk is something else.  In that case you would want to store up some available oxygen, so a similar design works for a different reason.  \n\u003C/p\u003E\n\u003Cp\u003E\nAnother huge advantage you get with steam and hot air that you do not get with hydrogen and helium, is leak intolerance.  A hot air balloon that leaks .01% of its air per second and has cool atmosphere flow in works fine.  It can operate with near zero pressure gradient to outside at all times.  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-13T19:18:29Z\u0022 title=\u002205/13/2020 07:18  PM\u0022 data-short=\u00224 yr\u0022\u003EMay 13, 2020\u003C/time\u003E by farmerben\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2020-05-14T08:18:55Z","Content":"\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nAirship-to-orbit (and even glider-to-orbit) was rather possible in the early KSP versions. Until they \u003Cs\u003Ecrashed\u003C/s\u003E repaired the aerial part of API.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}