{"TopicId":203545,"ForumId":44,"TopicTitle":"Spaceflight? but why tho theres ...... on earth!!!","CreatedByName":"TheGuyNamedAlan","CreatedById":162058,"CreatedDateTime":"2021-07-02T06:30:49Z","PageNum":1,"Articles":[{"CreatedByName":"TheGuyNamedAlan","CreatedById":162058,"CreatedDateTime":"2021-07-02T06:30:49Z","Content":"\n\u003Cp\u003E\nI\u0027ve had the pleasent surprise of going on twitter for the first time in ages and finding out the ammount of people that reckons space exploration is total hot garbage, with reasons ranging from the \u0022pollution\u0022 to literally anything you could think of. \n\u003C/p\u003E\n\u003Cp\u003E\nThis got me thinking, how would you provide a comprehensive explanation of the importance of investing in the aerospace industry and space travel in general? Like it\u0027s always occured to me that the average joe really doesn\u0027t think much of it. I\u0027m sure you\u0027re all as passionate about space as I am so I challenge you all, discuss what part of space travel you think is objectivly the most important/inspiring to you and how on earth would you explain it to say your mother, who unlike us nerds really have 0 clue on what\u0027s going on! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2021-07-02T06:41:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998805\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625207449\u0022 data-ipsquote-userid=\u0022162058\u0022 data-ipsquote-username=\u0022TheGuyNamedAlan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, TheGuyNamedAlan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve had the pleasent surprise of going on twitter\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat was your first mistake.\n\u003C/p\u003E\n\u003Cp\u003E\nr/space on Reddit also gets this question asked a lot.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998805\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625207449\u0022 data-ipsquote-userid=\u0022162058\u0022 data-ipsquote-username=\u0022TheGuyNamedAlan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, TheGuyNamedAlan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis got me thinking, how would you provide a comprehensive explanation of the importance of investing in the aerospace industry and space travel in general?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPeaceful material applications: communication, navigation, meteorology.\n\u003C/p\u003E\n\u003Cp\u003E\nMilitary application: communication, reconnaissance, missile early warning.\n\u003C/p\u003E\n\u003Cp\u003E\nImmaterial benefits: inspiration.\n\u003C/p\u003E\n\u003Cp\u003E\nAvoid the \u0022NASA spinoff technology\u0022 argument, it\u0027s full of holes. I know the \u0022inspiration\u0022 counterargument has been attacked as well, but at least it\u0027s not based on utter logical fallacy.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-07-02T07:33:44Z","Content":"\n\u003Cp\u003E\nJust calcukate the total income of sci-fi movies, space fighter toys, and T-shirts manufacturers.\n\u003C/p\u003E\n\u003Cp\u003E\nCompare this to that tiny money which the actual space requires.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2021-07-02T08:14:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998817\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625211224\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n39 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust calcukate the total income of sci-fi movies, space fighter toys, and T-shirts manufacturers.\n\u003C/p\u003E\n\u003Cp\u003E\nCompare this to that tiny money which the actual space requires.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood point LOL Here\u0027s what i found on the Interwebz:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E\u0022The Disney \u003Cb\u003EStar Wars\u003C/b\u003E trilogy \u003Cb\u003Eearned\u003C/b\u003E $4.475 billion on a combined budget of around $720 million while the Prequel \u003Cb\u003EStar Wars\u003C/b\u003E trilogy \u003Cb\u003Eearned\u003C/b\u003E (not counting reissues) $2.437 billion on a combined $345 million budget.\u0022\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SOXBLOX","CreatedById":204106,"CreatedDateTime":"2021-07-02T15:22:15Z","Content":"\n\u003Cp\u003E\nI\u0027m glad you asked. \u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMy favorite resource for this which I\u0027ve found so far is Günter Paul\u0027s \u003Cem\u003EThe Satellite Spinoff\u003C/em\u003E, a translation of the original work, \u003Cem\u003EDie dritte Entdeckung der Erde\u003C/em\u003E, translated by Alan and Barbara Lacy. My edition was published 1980-ish. I got it from my library, which had pulled it from circulation.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETelecommunications:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHe starts off asking what use space exploration is to humanity. He begins with the field of telecommunications. Trans-Atlantic cables were expensive, and could only handle a low volume of messages. The communication satellites changed all that by making Trans-Atlantic calls and faxes cheaper and more abundant. This has economic ramifications, improving trade, besides the human factor of someone being able to speak to their family from a distant place.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Westinghouse Corporation was getting tired of paying for its employees to fly everywhere for their business meetings. They began using telecommunications equipment, and the number of their people flying was reduced by 20%. That reduces pollution.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EGeology and Cartography:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNext, geography. How do you think they made maps before satellites? Were they probably very accurate? No, especially in remote locations. French scientists used Echo I (1950s) to determine the distance between Europe and North Africa to an accuracy of 12 meters.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEDIT: \u003C/strong\u003EIn Brazil, scientists at the Brazilian Space Exploration Office reported that, by comparing a satellite image and the best existing maps at the time, they had found striking results. The Amazon was drawn on the maps with an error, in some places, of over 20 miles. Several tributaries were found to flow in entirely different directions than previously thought. In some cases, the differences approached 90°. \n\u003C/p\u003E\n\u003Cp\u003E\nThe sad thing is, the pictures revealed that several dozen bridges built as part of an Amazon superhighway were completely superfluous. Were the satellite pictures available earlier, much money could have been saved.\n\u003C/p\u003E\n\u003Cp\u003E\nSatellites are used to watch and study tectonic plates. They give advance warnings for volcanic eruptions, and other natural disasters, but we\u0027ll get to meteorology later.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EResource Management:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then, look at an atlas from the time he wrote this. There were still areas of low detail, where cartographers had little data. Yet, in future, he points out, we will have to develop new centers of agriculture to fight world hunger. Resource management is a very important area of satellite usage today. A satellite can tell you exactly what kinds of trees are in a forest, or what kind of rock a range of mountains includes. It can measure soil types and gather data which helps humans efficiently use only what land they need, instead of older, more wasteful methods.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAtmospherics:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, satellites play a role in studying the atmosphere. I believe the ozone hole was discovered with satellite data.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENavigation:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAaaaand then there\u0027s navigation. GPS is of unlimited utility. It helps shipping, airliners, etc. in massive ways, every day. Using GPS to optimize air traffic over the North Atlantic saved $46.5 million dollars (1976) a year. The benefits are greater to shipping. By saving one percent in the areas of both astronomical navigation and fuel usage, the industry would save $150 million a year. I\u0027m certain it is waaay higher today.\n\u003C/p\u003E\n\u003Cp\u003E\nNOTE: I\u0027ll edit this post to add the rest of the summary later; I\u0027ve gotta put this down now...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMeteorology:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEDIT: \u003C/strong\u003EIn August 1969, pictures from the new Essa satellites arrive. The weathermen noted a cloud formation similar to those from which hurricanes were known to develop. As they watched, hour by hour, \u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Hurricane_Camille\u0022 rel=\u0022external nofollow\u0022\u003EHurricane Camille\u003C/a\u003E grew and moved across the Caribbean. On the night of August 17, it hit.  The Mississippi overflowed its banks, and Pass Christian registered a stormtide 26 feet above normal. It had the second-lowest air pressure of any hurricane in the United States. It flattened 6,000 houses, and severely damaged 50,000 more. Property damages amounted to more than 10 billion 2020 USD.\n\u003C/p\u003E\n\u003Cp\u003E\nOnly ~260 people died. The satellite data, by providing advance warning, had saved more than 50,000 lives. I dare anyone to put a price on that.\n\u003C/p\u003E\n\u003Cp\u003E\nHay, after being mowed, needs to dry for three days before being collected. If it rains on the hay in that time, it rots and becomes much less valuable. Weather satellites predict these three-day windows. According to the book, at the time of publication, that capability would save ~$28 million per harvest, per state. That number is surely much higher today.\n\u003C/p\u003E\n\u003Cp\u003E\n-----------\n\u003C/p\u003E\n\u003Cp\u003E\nSo, space exploration has saved billions of dollars, created an industry, and inspired tens of thousands of people. I think it is safe to say that the savings to the economy from space exploration have \u003Cem\u003Emore than paid\u003C/em\u003E for all space activities, scientific or otherwise.\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition, we have used the vantage point of space to save countless lives. And that is priceless.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-03T02:09:47Z\u0022 title=\u002207/03/2021 02:09  AM\u0022 data-short=\u00223 yr\u0022\u003EJuly 3, 2021\u003C/time\u003E by SOXBLOX\u003C/strong\u003E\n\u003Cbr\u003ERedundancy Department of Redundancy\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2021-07-02T15:52:34Z","Content":"\n\u003Cp\u003E\nMy response to them would be if they don\u0027t like space exploration, then don\u0027t explore space.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same would go for concerns about spending on space exploration, they\u0027re free to not spend the billions they have on rockets, too. Some might come back with \u0022muh taxes!\u0022 but the reality is that many coming up with those arguments likely don\u0027t pay meaningful taxes anyway. If they are in the top 1% of wage earners NASA might cost them a few hundred bucks. For nearly half the pop NASA costs them exactly $0 (since they don\u0027t pay net income tax). Median income family pays ~$15 a year for NASA. Note that some of that goes for aircraft related stuff that they likely use (commercial airliners), and the space agency was instrumental in weather satellites that save countless lives and billions of dollars in the US, so that\u0027s a net benefit as well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2021-07-02T16:04:22Z","Content":"\n\u003Cp\u003E\nTwo possible futures exist for humanity. In one, we decide to stay here on Earth. In this future, we will live our traditional lives on our rightful home. Maybe we will go extinct soon, maybe later. Maybe other intelligent species will arise, maybe they will not.\n\u003C/p\u003E\n\u003Cp\u003E\nThe oceans will boil away in one billion years. All life will burn. We will never know if we were the only manifestations of consciousness and life in the Universe. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn the other future, we build rockets and satellites today. We step on the Moon. We learn how to grow food in space and use the scarce resources on other planets. We make spaceships that can refuel and fly again and again. We go to Mars and build a base, then a city there. We float in Venus\u0027 sky. We learn how to exploit the precious metals in the Asteroid belt to build even larger spaceships in space. We create new kinds of rockets, and...We blast off to the next star. We will find worlds similar to the Earth that we can live on. It will be different than living on Earth, and it won\u0027t be perfect, but we will be there. In five million years, we will be everywhere in the entire Milky Way, as our ancestors five million years ago dreamed of when they looked up at the sky. \n\u003C/p\u003E\n\u003Cp\u003E\nThe oceans will boil away in one billion years. It will be no matter to us, because we will have our other homes by then. We will not be limited to the Earth. Our home will be the Milky Way. Life will persist in the Universe for billions of years to come.\n\u003C/p\u003E\n\u003Cp\u003E\nThe diverging point between these two futures is in the current century; it lies in our efforts to pursue human exploration of Mars. Decisions we make today will definitively decide the future of the entire Milky Way galaxy for the next several billion years. That is why space exploration is important, and that is how I remind people of the true magnitude of its effects.\n\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2021-07-02T16:21:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998805\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625207449\u0022 data-ipsquote-userid=\u0022162058\u0022 data-ipsquote-username=\u0022TheGuyNamedAlan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, TheGuyNamedAlan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis got me thinking, how would you provide a comprehensive explanation of the importance of investing in the aerospace industry and space travel in general? Like it\u0027s always occured to me that the average joe really doesn\u0027t think much of it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have a very short, simple, but harsh reason as to why we should invest more into space and science in general.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EPerspective\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe average joe doesn\u0027t think that much about it, and I personally think that is a problem. That average joe might believe in something, spend their whole life fighting over it or for it, possibly even succeed, or fail, or even possibly die fighting for what they believe in. It doesn\u0027t matter what they originally believed in, what they did, what they made their life out of, because with the right perspective, they are a small spec on the surface of a small spec in a small dot, within another smaller dot in the cosmos itself. \n\u003C/p\u003E\n\u003Cp\u003E\nIt can make one \u003Cstrong\u003Emad\u003C/strong\u003E with how insignificant they are in the grand scheme of things, that inflated ego of \u003Cstrong\u003Eself\u003C/strong\u003E can create problems as its a powerful feeling, as that ego is required to keep you humming along. But focusing on that ego of a small spec on a small dot, is what I consider an incredible waste when there is so much to explore, find, learn and experience.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EImagine you were given the keys to heaven itself, infinities of infinites available to you,\u003C/strong\u003E and you said \u003Cstrong\u003EI just wanna focus on my little spec instead just outside its gates. \u003C/strong\u003ERegardless of religious connotations, it would be easy to find this incredibly selfish, ignorant and hubris.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENow imagine your the only one with the keys and heaven itself is entirely empty\u003C/strong\u003E, if you don\u0027t walk through it may stay empty forever. Now not stepping through is not only still selfish, but now all of those that came before you would want you to finally get in, break free and go beyond that \u0022small spec\u0022 they have been on. This again would be a crime committed by ones ego.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENow imagine, your the one with the key that opens the door, but its not you who goes through, you only get to open the gate, to let some future person walk through it, to enjoy the infinities of infinities abound\u003C/strong\u003E. Again you don\u0027t need to be religious to realize it would be a crime to not try to take that key, to open that gate, even if you can never step 1 foot in it. Its almost a moral responsibility to do what you can to open that door.\n\u003C/p\u003E\n\u003Cp\u003E\nIts incredibly easy to continue focusing on that single spec, never looking up to the gates of heaven and let them be closed, possibly forever.\n\u003C/p\u003E\n\u003Cp\u003E\nThat is the purpose of space and science, its perspective. Its to make people realize there is that door (the universe), and we have the key in our hand (consciousness) and that we may never personally walk through that door, but should do everything in our power so someone can. Otherwise, we can sit outside of heavens gate, caring about our small spec, on the surface of a small spec in a small dot within another small dot and stop looking up, for many that seems like a life now and forever, except I see it as a massive irresponsible waste of what is the universe, and our conscious knowledge that all of it exists. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SOXBLOX","CreatedById":204106,"CreatedDateTime":"2021-07-02T17:20:27Z","Content":"\n\u003Cp\u003E\nI think it would be worthwhile to point out to anyone who thinks exploring space is a waste how small NASA\u0027s budget truly is. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022119411\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/\u0022 rel=\u0022\u0022\u003E@tater\u003C/a\u003E showed in a different thread that it\u0027s actually (a lot) less than the New York City public school system\u0027s budget.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-07-02T17:28:21Z","Content":"\n\u003Cp\u003E\nTo buy the goods, you need to produce them.\n\u003C/p\u003E\n\u003Cp\u003E\nTo produce the goods, you need industry.\n\u003C/p\u003E\n\u003Cp\u003E\nTo keep the industry running, you need engineers.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have the engineers, you need to give them a \u003Cs\u003Egreencard and hostel\u003C/s\u003E education.\n\u003C/p\u003E\n\u003Cp\u003E\nTo upgrade the \u003Cs\u003Elemmings\u003C/s\u003E students to the engineers, you need \u003Cs\u003Eyoutube course \u0022Become an engineer in 21 day\u0022\u003C/s\u003E a university.\n\u003C/p\u003E\n\u003Cp\u003E\nTo keep the university teaching, you need professors.\n\u003C/p\u003E\n\u003Cp\u003E\nTo educate the professors, you need an applied scientific school which \u003Cs\u003Emakes\u003C/s\u003E lets them \u003Cs\u003Efeel their ignorance and\u003C/s\u003E get learnt in turn.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have an applied scientific school, you need applied science.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have the applied science, you need the applied scientists, who run the applied studies.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have the applied scientists, you should teach them.\n\u003C/p\u003E\n\u003Cp\u003E\nTo teach the applied scientists, you need a fundamental scientific school.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have the fundamental scientific school, you need fundamental scientists.\n\u003C/p\u003E\n\u003Cp\u003E\nTo make them busy and let them learn each other, you need fundamental studies.\n\u003C/p\u003E\n\u003Cp\u003E\nThis includes astronomy, space flights, etc as well.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the investment into space studies is investment into full-featured self-sustained economics.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso the spaceflight sometimes bring minor bonuses like the listed in the posts above.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd of course do not underestimate the Disneyland. \u003Cbr\u003E\nHow would you explain to the child what is a \u0022spaceship\u0022 if none is actually flying.\u003Cbr\u003E\nSo, the space conquest is a way to gain several minutes of silence while the age-challenged subjects are busy with space toys or a space attraction.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso if you won\u0027t conquest the space, someone other will do this.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2021-07-02T17:29:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998984\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625246427\u0022 data-ipsquote-userid=\u0022204106\u0022 data-ipsquote-username=\u0022SOXBLOX\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, SOXBLOX said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think it would be worthwhile to point out to anyone who thinks exploring space is a waste how small NASA\u0027s budget truly is. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022119411\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/\u0022 rel=\u0022\u0022\u003E@tater\u003C/a\u003E showed in a different thread that it\u0027s actually (a lot) less than the New York City public school system\u0027s budget.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n$23B (more?) vs $35B, yeah.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the grand scheme, not a huge amount of money. Human spaceflight is ~45% of that, so ~$10B.  Science is ~$7.25B\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2021-07-03T00:42:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998812\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625208087\u0022 data-ipsquote-userid=\u0022146349\u0022 data-ipsquote-username=\u0022DDE\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, DDE said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat was your first mistake.\n\u003C/p\u003E\n\u003Cp\u003E\nr/space on Reddit also gets this question asked a lot.\n\u003C/p\u003E\n\u003Cp\u003E\nPeaceful material applications: communication, navigation, meteorology.\n\u003C/p\u003E\n\u003Cp\u003E\nMilitary application: communication, reconnaissance, missile early warning.\n\u003C/p\u003E\n\u003Cp\u003E\nImmaterial benefits: inspiration.\n\u003C/p\u003E\n\u003Cp\u003E\nAvoid the \u0022NASA spinoff technology\u0022 argument, it\u0027s full of holes. I know the \u0022inspiration\u0022 counterargument has been attacked as well, but at least it\u0027s not based on utter logical fallacy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDoes any of this apply to deep space exploration?\n\u003C/p\u003E\n\u003Cp\u003E\nOf course you yourself stated inspiration has been attacked, but I think I will go ahead and attack it to provide an alternate vantage point.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the first two are fine, but even if there is inspiration one can argue why there is a need to spend money on that at all. Ignoring the other political aspect, Apollo certainly was inspiring, but it failed to move society towards \u0022stopping\u0022 poverty, failed to end the enormous tension in the US between the anti-war protesters and \u0022patriots\u0022, and apart from being a pat on the back to the US and a bit of an \u003Cem\u003Eimage boost\u003C/em\u003E for the average human and Westerner, seems to have created no tangible positive impact.\n\u003C/p\u003E\n\u003Cp\u003E\nTo use a weird example, the Palace of the Soviets would certainly have been inspiring if it had been completed. But spending such money just for inspiration was rightfully considered a waste of money, possibly by Stalin\u0027s government themselves, as as far as I know they never made any attempt to restart construction between \u002745 and \u002753. Thus the more functional and affordable State Kremlin Palace was built later on.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy should millions be spent by the government on \u0022inspiration\u0022- which in the form given by spaceflight, I might go as far as to say is nothing more than glorified \u0022feel goodness\u0022- when there are enormous issues on Earth where the money could be better directed?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998936\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625239335\u0022 data-ipsquote-userid=\u0022204106\u0022 data-ipsquote-username=\u0022SOXBLOX\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, SOXBLOX said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m glad you asked. \u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMy favorite resource for this which I\u0027ve found so far is Günter Paul\u0027s \u003Cem\u003EThe Satellite Spinoff\u003C/em\u003E, a translation of the original work, \u003Cem\u003EDie dritte Entdeckung der Erde\u003C/em\u003E, translated by Alan and Barbara Lacy. My edition was published 1980-ish. I got it from my library, which had pulled it from circulation.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETelecommunications:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHe starts off asking what use space exploration is to humanity. He begins with the field of telecommunications. Trans-Atlantic cables were expensive, and could only handle a low volume of messages. The communication satellites changed all that by making Trans-Atlantic calls and faxes cheaper and more abundant. This has economic ramifications, improving trade, besides the human factor of someone being able to speak to their family from a distant place.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Westinghouse Corporation was getting tired of paying for its employees to fly everywhere for their business meetings. They began using telecommunications equipment, and the number of their people flying was reduced by 20%. That reduces pollution.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EGeology and Cartography:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNext, geography. How do you think they made maps before satellites? Were they probably very accurate? No, especially in remote locations. French scientists used Echo I (1950s) to determine the distance between Europe and North Africa to an accuracy of 12 meters.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEDIT: \u003C/strong\u003EIn Brazil, scientists at the Brazilian Space Exploration Office reported that, by comparing a satellite image and the best existing maps at the time, they had found striking results. The Amazon was drawn on the maps with an error, in some places, of over 20 miles. Several tributaries were found to flow in entirely different directions than previously thought. In some cases, the differences approached 90°. \n\u003C/p\u003E\n\u003Cp\u003E\nThe sad thing is, the pictures revealed that several dozen bridges built as part of an Amazon superhighway were completely superfluous. Were the satellite pictures available earlier, much money could have been saved.\n\u003C/p\u003E\n\u003Cp\u003E\nSatellites are used to watch and study tectonic plates. They give advance warnings for volcanic eruptions, and other natural disasters, but we\u0027ll get to meteorology later.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EResource Management:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then, look at an atlas from the time he wrote this. There were still areas of low detail, where cartographers had little data. Yet, in future, he points out, we will have to develop new centers of agriculture to fight world hunger. Resource management is a very important area of satellite usage today. A satellite can tell you exactly what kinds of trees are in a forest, or what kind of rock a range of mountains includes. It can measure soil types and gather data which helps humans efficiently use only what land they need, instead of older, more wasteful methods.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAtmospherics:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, satellites play a role in studying the atmosphere. I believe the ozone hole was discovered with satellite data.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENavigation:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAaaaand then there\u0027s navigation. GPS is of unlimited utility. It helps shipping, airliners, etc. in massive ways, every day. Using GPS to optimize air traffic over the North Atlantic saved $46.5 million dollars (1976) a year. The benefits are greater to shipping. By saving one percent in the areas of both astronomical navigation and fuel usage, the industry would save $150 million a year. I\u0027m certain it is waaay higher today.\n\u003C/p\u003E\n\u003Cp\u003E\nNOTE: I\u0027ll edit this post to add the rest of the summary later; I\u0027ve gotta put this down now...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMeteorology:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEDIT: \u003C/strong\u003EIn August 1969, pictures from the new Essa satellites arrive. The weathermen noted a cloud formation similar to those from which hurricanes were known to develop from. As they watched, hour by hour, \u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Hurricane_Camille\u0022 rel=\u0022external nofollow\u0022\u003EHurricane Camille\u003C/a\u003E grew and moved across the Caribbean. On the night of August 17, it hit.  The Mississippi overflowed its banks, and Pass Christian registered a stormtide 26 feet above normal. It had the second-lowest air pressure of any hurricane in the United States. It flattened 6,000 houses, and severely damaged 50,000 more. Property damages amounted to more than 10 billion 2020 USD.\n\u003C/p\u003E\n\u003Cp\u003E\nOnly ~260 people died. The satellite data, by providing advance warning, had saved more than 50,000 lives. I dare anyone to put a price on that.\n\u003C/p\u003E\n\u003Cp\u003E\nHay, after being mowed, needs to dry for three days before being collected. If it rains on the hay in that time, it rots and becomes much less valuable. Weather satellites predict these three-day windows. According to the book, at the time of publication, that capability would save ~$28 million per harvest, per state. That number is surely much higher today.\n\u003C/p\u003E\n\u003Cp\u003E\n-----------\n\u003C/p\u003E\n\u003Cp\u003E\nSo, space exploration has saved billions of dollars, created an industry, and inspired tens of thousands of people. I think it is safe to say that the savings to the economy from space exploration have \u003Cem\u003Emore than paid\u003C/em\u003E for all space activities, scientific or otherwise.\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition, we have used the vantage point of space to save countless lives. And that is priceless.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThese are excellent arguments for space exploration in LEO. I am curious, how do you justify deep space exploration?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998948\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625241154\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy response to them would be if they don\u0027t like space exploration, then don\u0027t explore space.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same would go for concerns about spending on space exploration, they\u0027re free to not spend the billions they have on rockets, too. Some might come back with \u0022muh taxes!\u0022 but the reality is that many coming up with those arguments likely don\u0027t pay meaningful taxes anyway. If they are in the top 1% of wage earners NASA might cost them a few hundred bucks. For nearly half the pop NASA costs them exactly $0 (since they don\u0027t pay net income tax). Median income family pays ~$15 a year for NASA. Note that some of that goes for aircraft related stuff that they likely use (commercial airliners), and the space agency was instrumental in weather satellites that save countless lives and billions of dollars in the US, so that\u0027s a net benefit as well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think the argument that it is a waste of money is not so much about \u0022I want my money back\u0022 as much as it is \u0022why don\u0027t we spend this somewhere more worthwhile\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nNow there may be people who just want their money back, but there are those who simply want it spent somewhere else too.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998949\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625241862\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTwo possible futures exist for humanity. In one, we decide to stay here on Earth. In this future, we will live our traditional lives on our rightful home. Maybe we will go extinct soon, maybe later. Maybe other intelligent species will arise, maybe they will not.\n\u003C/p\u003E\n\u003Cp\u003E\nThe oceans will boil away in one billion years. All life will burn. We will never know if we were the only manifestations of consciousness and life in the Universe. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn the other future, we build rockets and satellites today. We step on the Moon. We learn how to grow food in space and use the scarce resources on other planets. We make spaceships that can refuel and fly again and again. We go to Mars and build a base, then a city there. We float in Venus\u0027 sky. We learn how to exploit the precious metals in the Asteroid belt to build even larger spaceships in space. We create new kinds of rockets, and...We blast off to the next star. We will find worlds similar to the Earth that we can live on. It will be different than living on Earth, and it won\u0027t be perfect, but we will be there. In five million years, we will be everywhere in the entire Milky Way, as our ancestors five million years ago dreamed of when they looked up at the sky. \n\u003C/p\u003E\n\u003Cp\u003E\nThe oceans will boil away in one billion years. It will be no matter to us, because we will have our other homes by then. We will not be limited to the Earth. Our home will be the Milky Way. Life will persist in the Universe for billions of years to come.\n\u003C/p\u003E\n\u003Cp\u003E\nThe diverging point between these two futures is in the current century; it lies in our efforts to pursue human exploration of Mars. Decisions we make today will definitively decide the future of the entire Milky Way galaxy for the next several billion years. That is why space exploration is important, and that is how I remind people of the true magnitude of its effects.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think there are a number of counters to this argument.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy should money be spent on it when there are so many issues that threaten humanity right now? Yes, you can justify the need to \u0022escape the planet\u0022, but that is so far in the future that it is a miniscule problem when compared with what there is right now.\n\u003C/p\u003E\n\u003Cp\u003E\nNot to get to dramatic, but people are dying out there. If humans are truly intelligent as they claim to be, these ideas- space colonization, interstellar travel- will not die just because we didn\u0027t decide to do them in 2021 or the 21st century. Yes, people have a responsibility to protect the Earth for future generations, but they also have a responsibility to protect people alive right now. Currently, just about everywhere people are doing a pretty bad job of that.\n\u003C/p\u003E\n\u003Cp\u003E\nFix Earth first- there are problems that need to be fixed- then go to space. As you said, the oceans will boil away in one billion years. There is little that can justify spending money on it now vs. spending money on it in 2221.\n\u003C/p\u003E\n\u003Cp\u003E\nI would like to clarify that this is a counter to human exploration, not robotic exploration.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998952\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625242868\u0022 data-ipsquote-userid=\u002277241\u0022 data-ipsquote-username=\u0022MKI\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, MKI said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have a very short, simple, but harsh reason as to why we should invest more into space and science in general.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EPerspective\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe average joe doesn\u0027t think that much about it, and I personally think that is a problem. That average joe might believe in something, spend their whole life fighting over it or for it, possibly even succeed, or fail, or even possibly die fighting for what they believe in. It doesn\u0027t matter what they originally believed in, what they did, what they made their life out of, because with the right perspective, they are a small spec on the surface of a small spec in a small dot, within another smaller dot in the cosmos itself. \n\u003C/p\u003E\n\u003Cp\u003E\nIt can make one \u003Cstrong\u003Emad\u003C/strong\u003E with how insignificant they are in the grand scheme of things, that inflated ego of \u003Cstrong\u003Eself\u003C/strong\u003E can create problems as its a powerful feeling, as that ego is required to keep you humming along. But focusing on that ego of a small spec on a small dot, is what I consider an incredible waste when there is so much to explore, find, learn and experience.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EImagine you were given the keys to heaven itself, infinities of infinites available to you,\u003C/strong\u003E and you said \u003Cstrong\u003EI just wanna focus on my little spec instead just outside its gates. \u003C/strong\u003ERegardless of religious connotations, it would be easy to find this incredibly selfish, ignorant and hubris.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENow imagine your the only one with the keys and heaven itself is entirely empty\u003C/strong\u003E, if you don\u0027t walk through it may stay empty forever. Now not stepping through is not only still selfish, but now all of those that came before you would want you to finally get in, break free and go beyond that \u0022small spec\u0022 they have been on. This again would be a crime committed by ones ego.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENow imagine, your the one with the key that opens the door, but its not you who goes through, you only get to open the gate, to let some future person walk through it, to enjoy the infinities of infinities abound\u003C/strong\u003E. Again you don\u0027t need to be religious to realize it would be a crime to not try to take that key, to open that gate, even if you can never step 1 foot in it. Its almost a moral responsibility to do what you can to open that door.\n\u003C/p\u003E\n\u003Cp\u003E\nIts incredibly easy to continue focusing on that single spec, never looking up to the gates of heaven and let them be closed, possibly forever.\n\u003C/p\u003E\n\u003Cp\u003E\nThat is the purpose of space and science, its perspective. Its to make people realize there is that door (the universe), and we have the key in our hand (consciousness) and that we may never personally walk through that door, but should do everything in our power so someone can. Otherwise, we can sit outside of heavens gate, caring about our small spec, on the surface of a small spec in a small dot within another small dot and stop looking up, for many that seems like a life now and forever, except I see it as a massive irresponsible waste of what is the universe, and our conscious knowledge that all of it exists. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think this could be a good argument but it is easy to counter it.\n\u003C/p\u003E\n\u003Cp\u003E\nThose who can\u0027t care for others- whether those who physically exist right now or those who will in the future- are probably hopeless to begin with. Behaviorally they are much closer to the most primitive variant of homo sapiens- \u0022an animal\u0022 as one might refer to it- they simply exist to consume to keep themselves alive, perhaps reproduce one day, then go about wandering aimlessly during a period of their lifespan that should not exist- please correct me if I am wrong, but before modern medicine and society, homo sapiens generally lived up to what is now considered to be prime reproductive age- to their 20s- presumably briefly partook in the protection of the females and offspring, and then died. Humans at the basic level are not capable of comprehending existence beyond their prime function- reproduction- and thus stray.\n\u003C/p\u003E\n\u003Cp\u003E\nBut, thankfully education and greater comprehension (within the context of homo sapiens cognitive ability) exist in 2021. I don\u0027t think space is required to convince people \u0022starving people need to be helped in some way\u0022 etc.\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t need to take people to space and show them the Earth to make them \u0022move\u0022 in the right direction. You can tell them about the problems of the world, educate and spread the message of the dire circumstances, produce a plan to solve those problems, and then with the right leadership, incentives, and with a cooperative mindset, you can get people to help solve those problems.\n\u003C/p\u003E\n\u003Cp\u003E\nWe have been producing images of the Earth from space for nearly 80 years. At least in the 40s, 50s, 60s, and 70s, there was in an interest in preventing conflict and promoting peace and cooperation. Looking at history, one might argue human behavior at the nation/state/tribal level has only worsened since then, although not because of space, for other non-related reasons. But space has had little to no impact. While there is a large environmental movement that was especially aided in recruiting by images of the Earth, it seemingly has had little impact on policy- it is only right on the door step of irreversible/non-remediable climate change that changes in policy are starting to become *acceptable* but even then it is still quite perfunctory. And of course, climate change denial still pervades everywhere.\n\u003C/p\u003E\n\u003Cp\u003E\nSo instead of spending money on something that I might go as far as to call glorified propaganda, why not spend it on solving actual issues on Earth?\n\u003C/p\u003E\n\u003Cp\u003E\nI would like to clarify this counter doesn\u0027t necessarily target the existence of space exploration at all, but is instead targeting expansion of space exploration and human space exploration.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223998987\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625246901\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTo buy the goods, you need to produce them.\n\u003C/p\u003E\n\u003Cp\u003E\nTo produce the goods, you need industry.\n\u003C/p\u003E\n\u003Cp\u003E\nTo keep the industry running, you need engineers.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have the engineers, you need to give them a \u003Cs\u003Egreencard and hostel\u003C/s\u003E education.\n\u003C/p\u003E\n\u003Cp\u003E\nTo upgrade the \u003Cs\u003Elemmings\u003C/s\u003E students to the engineers, you need \u003Cs\u003Eyoutube course \u0022Become an engineer in 21 day\u0022\u003C/s\u003E a university.\n\u003C/p\u003E\n\u003Cp\u003E\nTo keep the university teaching, you need professors.\n\u003C/p\u003E\n\u003Cp\u003E\nTo educate the professors, you need an applied scientific school which \u003Cs\u003Emakes\u003C/s\u003E lets them \u003Cs\u003Efeel their ignorance and\u003C/s\u003E get learnt in turn.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have an applied scientific school, you need applied science.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have the applied science, you need the applied scientists, who run the applied studies.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have the applied scientists, you should teach them.\n\u003C/p\u003E\n\u003Cp\u003E\nTo teach the applied scientists, you need a fundamental scientific school.\n\u003C/p\u003E\n\u003Cp\u003E\nTo have the fundamental scientific school, you need fundamental scientists.\n\u003C/p\u003E\n\u003Cp\u003E\nTo make them busy and let them learn each other, you need fundamental studies.\n\u003C/p\u003E\n\u003Cp\u003E\nThis includes astronomy, space flights, etc as well.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the investment into space studies is investment into full-featured self-sustained economics.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso the spaceflight sometimes bring minor bonuses like the listed in the posts above.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd of course do not underestimate the Disneyland. \u003Cbr\u003E\nHow would you explain to the child what is a \u0022spaceship\u0022 if none is actually flying.\u003Cbr\u003E\nSo, the space conquest is a way to gain several minutes of silence while the age-challenged subjects are busy with space toys or a space attraction.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso if you won\u0027t conquest the space, someone other will do this.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think this argument makes sense, but it is a bit too \u0022up-front\u0022 for the average person.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s like instead of trying to promote STEM careers \u0022because they are cool and fun\u0022, trying to promote them by using nationalistic propaganda about great power competition and the need to continue to supply \u0022our nation\u0022 throughout the perpetual rivalry.\n\u003C/p\u003E\n\u003Cp\u003E\nOr trying to solve population decline by talking about how it is necessary to expand the population to prevent economic problems of the state.\n\u003C/p\u003E\n\u003Cp\u003E\n----------------------------------------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\nI would like to clarify I do not actually espouse the viewpoints of all of these counter-arguments I have made, I wrote them to provide a different viewpoint.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease do not hesitate to counter my counters.\n\u003C/p\u003E\n\u003Cp\u003E\nMy response goes like this-\n\u003C/p\u003E\n\u003Cp\u003E\nImagine you are in your house. Now do not hold any interest in anything outside of it. No interest in the trees, no interest in the clouds, no interest in the grocery store down the street. You are not allowed to leave or study anything not in the house.\n\u003C/p\u003E\n\u003Cp\u003E\nEventually you will run out of food. Eventually that tree will come crashing through the roof. Eventually those clouds will form a storm that will wipe away your house.\n\u003C/p\u003E\n\u003Cp\u003E\nNow imagine you are in your village. Now do not hold any interest in anything outside of it. No interest in the neighboring village, no interest in the mountain next to the village, no interest in the wild animals that run in the forest around the mountain. You are not allowed to study anything not originating in the village- no science, no history, nothing.\n\u003C/p\u003E\n\u003Cp\u003E\nEventually the neighboring village may come and pillage and ransack your village. A landslide will occur from the mountain and destroy the village. And you will overhunt the animals and have no more food. Those clouds up above may not come anymore one day, and you cannot grow food.\n\u003C/p\u003E\n\u003Cp\u003E\nNow imagine you are in your country. Now do not hold any interest in anything outside of it. No interest in the neighboring countries, no interest in the river that flows through the neighboring country and into yours, no interest in the sailing ships you see passing your coastline, or the armored soldiers on horses that ride along your border. You cannot study anything outside of your country- not military technology, not engineering, not economics- nothing.\n\u003C/p\u003E\n\u003Cp\u003E\nEventually the neighboring country will launch a military invasion and either completely kill or enslave your people. Eventually the neighboring country might build a dam on the river, destroying your country\u0027s access to water, dooming crops and wildlife- destroying your country\u0027s food supply. And eventually your country will run out of resources and society will collapse, while the neighboring country seeks new territories or allies and continues to maintain a steady supply of resources.\n\u003C/p\u003E\n\u003Cp\u003E\nNow imagine you are on Earth. I cannot say what threats may come from the sky. But there is certainly a potential for them to exist. And just as the speeds that objects in space move with are enormous, there will be little time to solve a problem coming from space once it is detected. Furthermore, just as the problems go up in scale- from your house being destroyed, to your village being destroyed, to your nation collapsing- the problems from space will be enormous and threaten everyone. Therefore it is important to start learning now. That \u003Cem\u003Eis\u003C/em\u003E the ideal scenario- to find and solve a problem before it causes suffering and death.\n\u003C/p\u003E\n\u003Cp\u003E\nNow let\u0027s look at some of those smaller scale issues again-\n\u003C/p\u003E\n\u003Cp\u003E\n1. Your house may be destroyed by a storm\n\u003C/p\u003E\n\u003Cp\u003E\n2. A landslide might destroy your village\n\u003C/p\u003E\n\u003Cp\u003E\n3. Your country will run out of resources\n\u003C/p\u003E\n\u003Cp\u003E\nNone of these will occur any time soon. Just as you would like to prioritize your relationship with your wife or maybe the fighting between your two boys over a theoretical storm, or you might want to prioritize the church in your village in need of repairs or the building of a shelter for orphans over the hypothetical landslide, or you might want to prioritize poverty relief and improving medical care over the hypothetical resource depletion, no one is saying we need to build space colonies or interstellar arks right now. All that is being done now is basic learning. As I said earlier, it is important to start learning now.\n\u003C/p\u003E\n\u003Cp\u003E\nNow you might ask why government money must be spent on this. After all, research in other areas often does not rely on such seemingly large amounts of government money. The unfortunate answer lies in the nature of how rocketry began, and to a lesser extent the nature of operations in space. Rocketry could be described as a peaceful application of missile development. Due to national security reasons, strict oversight is necessary to prevent leaking of technology to potential enemies. It is not possible in the current international situation to let private organizations go around building rockets willy nilly.\n\u003C/p\u003E\n\u003Cp\u003E\nFurthermore objects in space have great potential to hurt people. The best example is the uncontrolled reentry of space debris, a lesser example would be the potential- albeit highly unlikely- of contamination of Earth with alien organisms from another planet that could cause an ecological disaster. The government must participate to allow for oversight, accountability, and guidance.\n\u003C/p\u003E\n\u003Cp\u003E\nNow you might go even further and try to point out different aspects of space exploration that seem wasteful. Perhaps they are. You may think studying Jupiter provides little to no benefit for humans.\n\u003C/p\u003E\n\u003Cp\u003E\nTo this I say the following-\n\u003C/p\u003E\n\u003Cp\u003E\n1. As I said, \u0022we\u0022 are simply learning about space. We can\u0027t identify problems we don\u0027t know exist yet, and therefore unfortunately cannot pinpoint our efforts towards \u0022useful\u0022 exploration. Therefore space exploration is somewhat generalized, not aimed towards gaining knowledge in support of solving any specific problem.\n\u003C/p\u003E\n\u003Cp\u003E\n2. We do not live in a novel or movie where one MacGuffin saves the day. Real life has multiple working parts. It may be hard to see right now, but even seemingly worthless information may have the potential to impact the solution to a future problem.\n\u003C/p\u003E\n\u003Cp\u003E\nNow you may ask me \u0022if we just need to explore why spend money on humans in space?\u0022 To this, I give the following response-\n\u003C/p\u003E\n\u003Cp\u003E\n1. There are certain experiments that require human tending, particularly ones in LEO.\n\u003C/p\u003E\n\u003Cp\u003E\n2. I do not agree to blindly accepting that humans in space is a must. It may or may not be the most efficient method of exploration.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the 50s, robots were practically non-existent. Thus humans were required to go to space if they wanted to explore. Because of the glorification surrounding astronauts and the mysterious belief in some sort of \u0022human urge to explore\u0022, the belief in the need of humans in space exploration has persisted to today.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to what the most efficient method of space exploration would be in 2021, is a matter that I do not know the answer to, and would require detailed examination.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease feel free to counter my response.\n\u003C/p\u003E\n"},{"CreatedByName":"SOXBLOX","CreatedById":204106,"CreatedDateTime":"2021-07-03T01:56:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223999166\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625272947\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThese are excellent arguments for space exploration in LEO. I am curious, how do you justify deep space exploration?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAll due to Mr. Paul\u003Cspan\u003E, of course. \u003C/span\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206402-sunlitzelkova/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022206402\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206402-sunlitzelkova/\u0022 rel=\u0022\u0022\u003E@SunlitZelkova\u003C/a\u003E\u003Cspan\u003E and others, you put an amazing amount of thought into the posts above. I love it when we get deep threads like this. Thank you all.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIMHO, I don\u0027t see much in the way of \u003Cem\u003Eeconomic\u003C/em\u003E justification for deep space exploration. At least, not today. The only things I can come up with are unlimited hydrocarbons from Titan and metals from the asteroid belts. And He3 from Saturn or whatever, if that ever happens. Beyond that, I just scratch my head.\n\u003C/p\u003E\n\u003Cp\u003E\nBut \u003Cem\u003Etomorrow\u003C/em\u003E, figuratively speaking, we could have an economic use for space. There is a law of economics (I forget the name...help!?) which says we cannot predict distinct future inventions in detail without actually inventing them, if in thought only. In other words, you can\u0027t predict the rise of an original idea without having the idea. I can\u0027t think of a better way to phrase it... But the point is that we could have a need to go to space sometime in the near future; we just can\u0027t see it coming.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, people didn\u0027t really need mass production of steel until the railroad made it necessary. And no one could have predicted railroads without inventing the idea.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, that\u0027s not an argument for deep space exploration \u003Cem\u003Etoday\u003C/em\u003E. You could say that we should launch probes now, to make using space easier later on, when we need it, but that has no economic benefits in the present.\n\u003C/p\u003E\n\u003Cp\u003E\n--------\n\u003C/p\u003E\n\u003Cp\u003E\nSince there are few economic reasons at the moment,\u003Cspan\u003E we can resort to philosophical arguments. For example, if the person you\u0027re debating is religious (I hope this doesn\u0027t violate forum rules...), you could say that the universe is designed to be explored and enjoyed by mankind.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYou can also say that it\u0027s really none of their business what other people are doing on their own time, provided they\u0027re not hurting anyone while they do it. They may refute this by saying that not intervening to help the starving is harming them by inaction, but you can reply by pointing out that they can no longer indulge in any luxuries, lest they harm by inaction.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd lastly, if they\u0027re honestly looking to keep money from being wasted, and not just going after space exploration because of a vendetta they have, there are many, many more \u0022wastes\u0022 of money present, at least in the U.S. Federal budget, than NASA. I mean, do we really need \u0026lt;insert hated federal program here\u0026gt;?\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2021-07-03T02:50:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223999166\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625272947\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think the argument that it is a waste of money is not so much about \u0022I want my money back\u0022 as much as it is \u0022why don\u0027t we spend this somewhere more worthwhile\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nNow there may be people who just want their money back, but there are those who simply want it spent somewhere else too.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027d bet money the bulk of the people making this argument are not spending their own money, since they don\u0027t pay meaningful taxes. The US tax code is extremely progressive, the bottom 80% could pay nothing and it would make no difference (and the bottom almost 50% already pay nothing).\n\u003C/p\u003E\n\u003Cp\u003E\nThe 0.5% of the federal budget that goes to NASA is also mostly a jobs program, so it is in effect spending it on society at large as the huge payroll goes to people in places like Huntsville, Houston, etc, and they spend it on food, services, and all the things people spend money on.\n\u003C/p\u003E\n"},{"CreatedByName":"Souptime","CreatedById":204451,"CreatedDateTime":"2021-07-03T03:41:06Z","Content":"\n\u003Cp\u003E\nWho cares about earth pollution? we can just screw over another planet with spaceflight!\n\u003C/p\u003E\n\u003Cp\u003E\nPlus we\u0027re not just throwing away money at space, it gets re-absorbed into the economy (Unless you bring actual money into space with you)\n\u003C/p\u003E\n\u003Cp\u003E\nIf we stay on earth it\u0027ll keep getting polluted, and overpopulated. so if we do stay the only place we\u0027ll eventually have to go is into space.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd we can just stay in the solar system, if earth gets screwed over with an asteroid we dont need an entire new system, we have enough resources withing the solar system to rebuild or civilization. all the energy of the sun, europan waters, methane on titan, basically anything we need is within the gas giants alone, not to mention the extreme amount of metal and other stuff on the inner planets we can use for escaping the solar system if needed or advancing home-tech here.\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact tholins (The stuff that makes certain areas on pluto) is made of carbon, methane, and nitrogen so if ALL life ends before that humans can whip pup a computer program to harvest resources and create life once more!\n\u003C/p\u003E\n\u003Cp\u003E\nSpace sure is fascinating...\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2021-07-03T04:00:58Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 width=\u0022200\u0022 data-embed-src=\u0022https://www.youtube.com/embed/lARpY0nIQx0?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-07-03T04:21:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223999166\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625272947\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think this argument makes sense, but it is a bit too \u0022up-front\u0022 for the average person.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u0022From the school classes which you were skipping playing football, you should know that much, much wiser and intellectualler people have a care about it.\u003Cbr\u003E\nThanks to the space, you can keep saling your warmed stale pizza to the tourists coming to watch a sci-fi show in the amusemenet park next to your village.\u003Cbr\u003E\nThanks to the space,  your children have a chance to learn up and become space engineers and sit in office instead of saling the hot-dogs like their dad. Or at least sale them in a university caffee.\u003Cbr\u003E\nSo, shut up and be happy that the space exists and you don\u0027t need to call the customers by rear-blowing at a candle in a suit of clown, under accompaniment of your family orchestra.\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-03T04:32:26Z\u0022 title=\u002207/03/2021 04:32  AM\u0022 data-short=\u00223 yr\u0022\u003EJuly 3, 2021\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2021-07-03T07:25:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223999166\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625272947\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDoes any of this apply to deep space exploration?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOnly inspiration. Any attempt to argue material benefits of deep-space research devolves into a circular argument: deep-space research is seemingly only necessary for deep-space exploration.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223999166\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625272947\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy should millions be spent by the government on \u0022inspiration\u0022- which in the form given by spaceflight, I might go as far as to say is nothing more than glorified \u0022feel goodness\u0022- when there are enormous issues on Earth where the money could be better directed?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUltimately it comes down to materialism and its foibles. Societies that focus on material well-being seem to burn out, atomize, achieving very little while spurring the growth of insatiable appetites. The \u0022feel-goodness\u0022 - basis of \u003Ci\u003Esobornost\u0027\u003C/i\u003E, \u003Cem\u003Easabiyya\u003C/em\u003E - seems to turn out to be a better investment than eradication of poverty \n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-07-04T03:42:24Z","Content":"\n\u003Cp\u003E\nFrom the alt-text on an \u003Ca href=\u0022https://xkcd.com/893/\u0022 rel=\u0022external nofollow\u0022\u003Eold XKCD comic\u003C/a\u003E:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The universe is probably littered with the one-planet graves of cultures which made the sensible economic decision that there\u0027s no good reason to go into space--each discovered, studied, and remembered by the ones who made the irrational decision.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2021-07-04T13:49:37Z","Content":"\n\u003Cp\u003E\nQuestion: \u0022Why spend money on space exploration when there\u0027s _____________ to solve on Earth?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnswer: Well, it\u0027s not like we\u0027re actually bothering to solve \u003Cem\u003Ethat problem\u003C/em\u003E, anyway.  Might as well spend it on something cool.\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-07-04T17:35:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223999710\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625406577\u0022 data-ipsquote-userid=\u002232993\u0022 data-ipsquote-username=\u0022razark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, razark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnswer: Well, it\u0027s not like we\u0027re actually bothering to solve \u003Cem\u003Ethat problem\u003C/em\u003E, anyway.  Might as well spend it on something cool.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAssuming that said problems are actually solvable.\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2021-07-04T19:00:24Z","Content":"\n\u003Cp\u003E\nReally, your best bet is to just not discuss anything on Twitter or better yet don\u0027t go there at all. That place is a dumpster fire.\n\u003C/p\u003E\n\u003Cp\u003E\n Best,\n\u003C/p\u003E\n\u003Cp\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2021-07-05T07:58:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223999217\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625280616\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/2/2021 at 7:50 PM, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027d bet money the bulk of the people making this argument are not spending their own money, since they don\u0027t pay meaningful taxes. The US tax code is extremely progressive, the bottom 80% could pay nothing and it would make no difference (and the bottom almost 50% already pay nothing).\n\u003C/p\u003E\n\u003Cp\u003E\nThe 0.5% of the federal budget that goes to NASA is also mostly a jobs program, so it is in effect spending it on society at large as the huge payroll goes to people in places like Huntsville, Houston, etc, and they spend it on food, services, and all the things people spend money on.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI should have clarified. I don\u0027t think they are saying \u0022please spend my money more efficiently/better\u0022, they are saying \u0022please spend the money more better\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nLike invest in \u0022insert other program\u0022 to help \u0022insert societal problem\u0022 instead of spending it on crewed spaceflight. They are arguing on reasons related to political opinions and morals, not in relation to their own money.\n\u003C/p\u003E\n\u003Cp\u003E\nOr to put it another way, \u0022please fix *insert problem* instead of spending money on crewed spaceflight, because I think *insert problem* is serious and more of a priority\u0022, vs. \u0022please fix *insert problem* instead of spending money on crewed spaceflight because I think that crewed spaceflight is a waste of taxpayer dollars\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2021-07-05T17:49:38Z","Content":"\n\u003Cp\u003E\nPersonally ? Manned spaceflights are indication that your country have quite the resources.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t question why we go and do unmanned missions (that\u0027s what geopositioning, telecommunications, and weather observation satellites are, and those make up most of the stuff we do launch unmanned), but to take manned spaceflight means that you do have the resource to take it and you have the will to take them as well. There are a lot of important stuff that we\u0027d get if we did manage to not get stuck with a single planet, sure, but given the barrier needed to be passed before we get there, let alone the \u0027smaller\u0027 barriers one must take before it, gives that only those who have the resources and the will would even attempt it.\n\u003C/p\u003E\n\u003Cp\u003E\nMy sole problem is that we\u0027ve never quite do anything in a global scale as humanity in the exact same will. Maybe the pandemic will serve as a reminder of how fractured humanity on Earth still is, and that\u0027s with every single one of our lives in danger. And until that is done, I think we\u0027d never quite get the full benefit of being a multiplanetary species, period.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-05T17:54:26Z\u0022 title=\u002207/05/2021 05:54  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 5, 2021\u003C/time\u003E by YNM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2021-07-05T21:53:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224000173\u0022 data-ipsquote-contentid=\u0022203545\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221625507378\u0022 data-ipsquote-userid=\u002298447\u0022 data-ipsquote-username=\u0022YNM\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, YNM said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy sole problem is that we\u0027ve never quite do anything in a global scale as humanity in the exact same will.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s probably because no \u0027leader\u0027 is ever motivated by the will to serve, but rather the will to rule.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\n\u003C/p\u003E\n\u003Cp\u003E\n-Slashy\n\u003C/p\u003E\n"}]}