{"TopicId":205083,"ForumId":44,"TopicTitle":"Sleeping At 2g... Constant acceleration.","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-10-02T04:01:53Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-10-02T04:01:53Z","Content":"\n\u003Cp\u003E\nIf one had a fictional constant acceleration drive, would upping the acceleration for 8 hours while the crew slept be OK-ish?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI mean why not? Everyone but the helm control crew are sleeping on their backs anyway?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThen revert to 1g when they wake up.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStill not sure what the effects would be if done routinely. Probably not good.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThen again if crew is all young and healthy (no one over 45 years and must be healthy and fit) then that may be mitigated too.\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2021-10-02T04:15:38Z","Content":"\n\u003Cp\u003E\nI sleep on my side...\n\u003C/p\u003E\n\u003Cp\u003E\nIf you upped the gees just a little bit, it might feel more like a weighted blanket.\n\u003C/p\u003E\n\u003Cp\u003E\nThere were some experiments back in the day where some people lived in high-G centrifuges for many days at a time. Presumably they found some way to sleep.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-10-02T04:20:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038648\u0022 data-ipsquote-contentid=\u0022205083\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633148138\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI sleep on my side...\n\u003C/p\u003E\n\u003Cp\u003E\nIf you upped the gees just a little bit, it might feel more like a weighted blanket.\n\u003C/p\u003E\n\u003Cp\u003E\nThere were some experiments back in the day where some people lived in high-G centrifuges for many days at a time. Presumably they found some way to sleep.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGreat. So cut travel time down even more for manned scifi interplanetary flight.\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder what is the limit? 3g? 4g? 5g?\n\u003C/p\u003E\n\u003Cp\u003E\nObviously unmanned could go faster still... but sleeping on the back I wonder...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-02T04:21:21Z\u0022 title=\u002210/02/2021 04:21  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 2, 2021\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2021-10-02T11:03:23Z","Content":"\n\u003Cp\u003E\nWhy would you need to have a pattern of higher thrust and lower thrust for long periods of time?  \n\u003C/p\u003E\n\u003Cp\u003E\nIf your ship needs to be somewhere right now, then you run high acceleration the whole time, and the crew just deals with it.  But why run it on a schedule?   Unless I\u0027m missing something completely fundamental in the math here, why not just run slightly increased thrust for the entire time?   2g for 8hrs a day is the same as 1 1/3 g for 24 hours, no?    A healthy crew would just get a workout at the slightly increased g\u0027s. \n\u003C/p\u003E\n\u003Cp\u003E\nSecondly, why only 8 hours?   You either have an autonomous ship that doesn\u0027t require crew, or you require a constant watch.  With an autonomous ship, you could run at high thrust for 20 some hours a day, with regular breaks for the crew to arise for human needs.  Otherwise they are in their racks the rest of the time.   If you need a constant watch.... why do people think it\u0027s ok to disrespect third shift?!   We\u0027re people too ya know!\n\u003C/p\u003E\n\u003Cp\u003E\nWithin the Solar system, the time gained for just about any distance journey is pretty much negligible in practical terms.  6 weeks to someplace?  OK, why does it matter then if you arrive a week earlier.  It really doesn\u0027t, and as mentioned, if it does, then the crew just deals with it.  \n\u003C/p\u003E\n\u003Cp\u003E\nBut for interstellar travel you say!  I say it would not have nearly the impact you think it would.   Turns out... we have this speed limit, in terms of both literal speed and energy required.   At 1g constant acceleration, it takes a ship roughly a year to accelerate to the speed of light.    You then flip over and take another year to return to... whatever normal is.    So the \u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Space_travel_using_constant_acceleration#Planetary_reference_frame\u0022 rel=\u0022external nofollow\u0022\u003Erule of thumb\u003C/a\u003E, for constant 1g acceleration, is that to travel a distance of X light years, it requires X\u002B1 years to do it, when observed from the Earth.   From the ship\u0027s point of view, the entire trip takes even less time. \n\u003C/p\u003E\n\u003Cp\u003E\nYou would approach the speed of light within a short time frame at 1g, but for the next however long you are near the speed of light, you\u0027d want to maintain that 1g acceleration to keep stuff from floating around inside the ship, but due to Mr Einstein et al, you really wouldn\u0027t gain any speed.  Basically this would be the cruise phase.   Because you\u0027d reach this cruise phase relatively quickly in the scheme of things, there\u0027s no reason to do pulsed acceleration as you describe.  \n\u003C/p\u003E\n\u003Cp\u003E\nSo, for really short distances, Earth to the Moon, or even Earth to Mars let\u0027s say, there\u0027s no benefit, as the tiny amount of time saved would really not have practical benefit.   For interstellar distances, there would be no noticeable time gained, and just a whole lot of fuel wasted.   For longer interplanetary distances, the amount of time saved might be appreciable, but at what cost to the crew?  So honestly, short of tactical situations, there isn\u0027t a real reason to accelerate faster than 1g. \n\u003C/p\u003E\n"}]}