{"TopicId":207145,"ForumId":44,"TopicTitle":"The idea of ​​a reactor in space","CreatedByName":"charleygoldberg","CreatedById":219705,"CreatedDateTime":"2022-03-06T08:33:38Z","PageNum":1,"Articles":[{"CreatedByName":"charleygoldberg","CreatedById":219705,"CreatedDateTime":"2022-03-06T08:33:38Z","Content":"\n\u003Cp\u003E\nImagine If I could build a RBMK-1000 graphite censored water-cooled reactor and put it in low earth orbit Any ideas on this?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-03-06T08:40:35Z\u0022 title=\u002203/06/2022 08:40  AM\u0022 data-short=\u00222 yr\u0022\u003EMarch 6, 2022\u003C/time\u003E by charleygoldberg\u003C/strong\u003E\n\u003Cbr\u003EFixed formatting\n\u003C/span\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2022-03-06T08:41:21Z","Content":"\n\u003Cp\u003E\nWelcome to the forum \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/219705-charleygoldberg/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022219705\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/219705-charleygoldberg/\u0022 rel=\u0022\u0022\u003E@charleygoldberg\u003C/a\u003E, your question has been moved from KSP discussion to our sub forum dedicated to real science topics. Your post has also been edited to remove a formatting error.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-03-06T09:52:07Z","Content":"\n\u003Cp\u003E\nAs the only way to cool this reactor in space is radiation, and the radiator should be huge, and the pipes should be long, and the coolant hydraulic resistance would be enormous, you can\u0027t cool it with water.\n\u003C/p\u003E\n\u003Cp\u003E\nEither inert gas (like Xe-He), or metal droplets in electromagnetic field, and both options are still very limited.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, wait for aneutronic fusion reactors, and only then you can transform the nuclear energy directly into electricity without overheating.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2022-03-06T12:02:02Z","Content":"\n\u003Cp\u003E\nAlso, low Earth orbit is not a safest place to put nuclear reactor in. A lot of trash there. Either put good shielding on it, or place the rig in a higher, emptier orbit. It will save you a lot of headaches.\n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2022-03-06T14:34:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224099927\u0022 data-ipsquote-contentid=\u0022207145\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221646555618\u0022 data-ipsquote-userid=\u0022219705\u0022 data-ipsquote-username=\u0022charleygoldberg\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, charleygoldberg said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nImagine If I could build a RBMK-1000 graphite censored water-cooled reactor and put it in low earth orbit Any ideas on this?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis arrangement requires gravity to work. You\u0027d be looking at steam and water going into places they\u0027re not supposed to. Pump and turbine failure is likely, plus the reactor would be rather uncontrollable from the very first seconds due to a random mixture of phases having unpredictable neutron moderation characteristics.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221052px-RBMK_reactor_schematic.svg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002270.72\u0022 height=\u0022744\u0022 width=\u00221052\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/RBMK_reactor_schematic.svg/1052px-RBMK_reactor_schematic.svg.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2022-03-06T16:26:33Z","Content":"\n\u003Cp\u003E\nNot sure why you want to use an RMBK specifically, but the main problem with reactors in space is the cooling issue as has been mentioned. Vast, fragile radiators to carry away waste heat. An ideal black body would carry away something on the order of 2000W/m2 at the reactor exhaust temperatures. An RMBK 1500 has about 4.8MW thermal power and produces 1.5MW electrical power, so must reject 3.3MW. Double sided that would take ~850m2 of radiators (33mx25m). Probably twice that once accounting for grey bodies.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course you can use a heat pump to concentrate the heat to improve the radiator power density at the cost of extra energy consumption.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAnything that uses steam separators in the reactor would need a redesign, and additional pumping effort will be required to overcome the lack of convection assistance. The UK\u0027s AGR primary circuit would probably still function with extra pumping effort because the coolant is already a gas and so there are no phase changes to get messed up by lack of bouyancy.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe normal metres thick biological shield (concrete) on earth based reactors would be an extremely effective debris shield, but I\u0027m not sure concrete is a great material for space. I think it outgasses and decays under UV, plus launching the thousands of tonnes would be a challenge. A directional shield to any crew compartments would be fast more effective, with a thinner shielding and physical clearance being counted on for protection in other directions. You\u0027d also want some sort of whipple shield for protection of the reactor itself.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2022-03-06T17:18:36Z","Content":"\n\u003Cp\u003E\nSpace reactors use radiative cooling, though there are variants of this like liquid droplet cooling that increase heat transfer vs normal radiators.\n\u003C/p\u003E\n\u003Cp\u003E\nUS worked on SP-100 for a long time:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EZTgqnNWoAQ-uWq?format=jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002266.25\u0022 height=\u0022795\u0022 width=\u00221200\u0022 src=\u0022https://pbs.twimg.com/media/EZTgqnNWoAQ-uWq?format=jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSoviets had this, Topaz:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ej5sE2zWkAQ5TYy?format=png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002233.50\u0022 height=\u0022402\u0022 width=\u00221200\u0022 src=\u0022https://pbs.twimg.com/media/Ej5sE2zWkAQ5TYy?format=png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSome papers here, too:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://isnps.unm.edu/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://isnps.unm.edu/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2022-03-07T03:37:50Z","Content":"\n\u003Cp\u003E\nneither one was exceptionally powerfull, and neither design was improved upon. i dont think something like an rbmk would work in space. anything that turns water into steam will be problematic in zero g. so you would have to build it on a centrifuge. i think liquid metal loops have always been preferred in space, as there is no phase change to contend with. the real limit is the heat rejection systems, which need to be massive if you want something megawatt scale. \n\u003C/p\u003E\n\u003Cp\u003E\nalso if you intend to use the nuclear reactor for propulsion, the mass of the system is critical. you might be better off with nuclear-thermal engine rather than a dedicated reactor, then you can reject heat in the exhaust. if you want nuclear electric, say using plasma thrusters, then you got to haul radiator.  the added weight may cancel out the isp advantage. \n\u003C/p\u003E\n\u003Cp\u003E\ni think the best power reactor for space will be a direct-conversion aneutronic fusion reactor. you would still need radiators, but only from the thermal portion of the power output. depending on the fuel used that could be as low as 5% of the total output, so a lot less radiator. however an open cycle fusion engine would give you a lot more isp than a plasma thruster. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-03-07T03:52:15Z\u0022 title=\u002203/07/2022 03:52  AM\u0022 data-short=\u00222 yr\u0022\u003EMarch 7, 2022\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2022-03-07T07:17:38Z","Content":"\n\u003Cp\u003E\nI don\u0027t think it\u0027s true that the mere fact of boiling water is a problem in microgravity. With *forced* flow the loop will keep moving as usual. Pressure gradients still function.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat doesn\u0027t work is bouyancy-dependent steam separators (which can be redesigned - centrifugal), and using convection (a bouyancy effect) to assist the flow - 100% of the effort needs to be pumped.\n\u003C/p\u003E\n"},{"CreatedByName":"CBase","CreatedById":189476,"CreatedDateTime":"2022-03-07T07:24:59Z","Content":"\n\u003Cp\u003E\nActually I am more worried about using graphite moderation. This is considered an outdated design, because the moderator allows for thermal runaways unlike water moderated designs, where reaction stops if you fail to provide fresh water.\n\u003C/p\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2022-03-07T07:42:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224100232\u0022 data-ipsquote-contentid=\u0022207145\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221646637899\u0022 data-ipsquote-userid=\u0022189476\u0022 data-ipsquote-username=\u0022CBase\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, CBase said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nActually I am more worried about using graphite moderation. This is considered an outdated design, because the moderator allows for thermal runaways unlike water moderated designs, where reaction stops if you fail to provide fresh water.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s the combination of graphite moderator with water that\u0027s the problem (although that\u0027s extremely power dense, which may be desirable in a space reactor) - graphite moderated gas-cooled  cores like AGR and Magnox don\u0027t have positive void coefficients.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reasons we don\u0027t build gas-cooled graphite moderated reactors anymore are:\n\u003C/p\u003E\n\u003Cp\u003E\n1) They\u0027re physically big and therefore comparatively expensive to build \n\u003C/p\u003E\n\u003Cp\u003E\n2) Although graphite absorbs fewer neutrons allowing lower enriched uranium to be used, the cost of enriched uranium fell.\n\u003C/p\u003E\n\u003Cp\u003E\n3) Although being physically bigger permits refuelling options without opening the reactor and therefore in theory zero downtime (making up for point 1), in practice this couldn\u0027t be made to work.\n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2022-03-07T09:28:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224100232\u0022 data-ipsquote-contentid=\u0022207145\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221646637899\u0022 data-ipsquote-userid=\u0022189476\u0022 data-ipsquote-username=\u0022CBase\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, CBase said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nActually I am more worried about using graphite moderation. This is considered an outdated design, because the moderator allows for thermal runaways unlike water moderated designs, where reaction stops if you fail to provide fresh water.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe reason graphite was used was to have plutonium production capability. That alone makes it utterly scandalous. Plus there was an advantage in cost from having a cheap reactor vessel built \u003Cem\u003Ein situ\u003C/em\u003E, rather than transported from the plant.\n\u003C/p\u003E\n"},{"CreatedByName":"RCgothic","CreatedById":132560,"CreatedDateTime":"2022-03-07T11:39:49Z","Content":"\n\u003Cp\u003E\nGraphite cores are very very not cheap. They\u0027re comparatively huge, requiring vastly more massive shielding and much deeper foundations.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther\u0022\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedid=\u0022embed2041297212\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=https://twitter.com/RCgothic/status/1500792454345334787?s=20%26t=-C2McFwtx-d8LTXXxLZZUw\u0022 style=\u0022height:567px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe AGR fuel handling arrangements are also vastly more complicated and expensive. For graphite cores it takes hundreds of tonnes of mobile shielded connectable pressure vessels. And multiple specialised grabs for handling standpipe shield plugs.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EPlus because the fuel assemblies are so physically huge they have to be disassembled on site whilst screamingly radioactive so as to be storeable.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EPWRs just flood the reactor head, unbolt the whole thing, and transfer the spent fuel whole to their storage cannisters using a comparatively simple bridge crane.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThere\u0027s a reason nobody builds graphite cores like this anymore, and the #1 reason is cost. PWRs are much cheaper.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EYes, they allow access to unspent fuel for plutonium. Yes, they use comparatively low-enriched uranium which is also better for generating plutonium. These designs were developed out of military reactors which were designed to do just that. But the AGRs, and the Magnoxes apart from early Chapelcross and Calder Hall didn\u0027t. Can\u0027t speak for the RMBKs.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThese graphite reactors were theoretically cheaper than PWRs in operation, but weren\u0027t.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI suspect you may be conflating the apocryphal \u0022RMBK control rods were tipped with graphite tips because it was cheaper\u0022 with the cores themselves being cheaper. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERMBK control rods weren\u0027t tipped with graphite because it was cheap. They were tipped with moderator because you *want* the reaction to increase when you withdraw the control rods. Otherwise the voids would have been filled with water, which is like replacing control rod with more control rod. The mistake (which may have been for cost reasons) was to not have the graphite tips extend to the bottom of the reactor core. Therefore *locally* the cores experienced an increase in reaction at the bottom of the core when the rods were inserted.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EBut they\u0027re were graphite tipped for a sensible reason.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2022-03-07T14:45:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224100278\u0022 data-ipsquote-contentid=\u0022207145\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221646653189\u0022 data-ipsquote-userid=\u0022132560\u0022 data-ipsquote-username=\u0022RCgothic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, RCgothic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGraphite cores are very very not cheap. They\u0027re comparatively huge, requiring vastly more massive shielding and much deeper foundations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhich is still cheaper than transporting an oversized pressure vessel halfway across Eurasia. RMBKs were 2-4 times cheaper than VVERs, whatever the reason.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2022-03-12T19:01:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224100047\u0022 data-ipsquote-contentid=\u0022207145\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221646587116\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/6/2022 at 11:18 AM, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUS worked on SP-100 for a long time:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://pbs.twimg.com/media/EZTgqnNWoAQ-uWq?format=jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022EZTgqnNWoAQ-uWq?format=jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002266.25\u0022 height=\u0022795\u0022 width=\u00221200\u0022 src=\u0022https://pbs.twimg.com/media/EZTgqnNWoAQ-uWq?format=jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t have anything to add to this conversation, but I don\u0027t see this around much, and every time I do I have to point it out.  This was one of the projects my grandpa worked on during his time at NASA. I can\u0027t tell you exactly what he did (didn\u0027t talk about his work much, got Alzheimer\u0027s, died), but you will find his name on several SP-100 PDFs.\n\u003C/p\u003E\n"},{"CreatedByName":"Davi SDF","CreatedById":197335,"CreatedDateTime":"2022-03-14T19:55:48Z","Content":"\n\u003Cp\u003E\nReactors designed to work in space could definetly exist and be quite useful for future missions, specially if we are willing to make a colony in Mars.\u003Cbr\u003E\u003Cbr\u003E\nOf course, there are many other problems to be tackled with it. But large enough space stations of even space rigs around asteroids would definetly need the power density of such reactors.\n\u003C/p\u003E\n"}]}