{"TopicId":208792,"ForumId":44,"TopicTitle":"Is This A Nerf To Scifi Missiles In Space?","CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2022-07-01T00:41:24Z","PageNum":1,"Articles":[{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2022-07-01T00:41:24Z","Content":"\n\u003Cp\u003E\nHigh thrust constant acceleration is useful for scifi but also creates what I like to call the relativistic kill vehicle problem.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf a lot of folks have them and so do missiles, missiles would outrun spaceships and make them all but obsolete.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYet I found a solution by a chance of creational conceit.\n\u003C/p\u003E\n\u003Cp\u003E\nEqualized Acceleration: The high thrust constant acceleration drive is of course a fictional plot device, so it\u0027s limits can also be. The drive can actually accelerate for years without refueling.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUnlike a normal rocket the scifi drive\u0027s maximum acceleration is capped in the low gees (3g max). Thrust the drive harder and it will become unstable and detonate like a nuke... releasing a tiny part of it\u0027s energy in the detonation which is more than enough to blow the spaceship  to smithereens.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMissiles with the drive would also be acceleration capped at the same rate (3g) unless they had a secondary close range rocket stage for intercept.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHow would this change the space battle field?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSeems to me that at longer ranges missiles could NEVER catch up with spaceships since max accelerations are equalized and we both know normal rocketry is only good for a closer range intercept.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWould this make missiles near obsolete except for planet orbital defense?\n\u003C/p\u003E\n\u003Cp\u003E\nI am aware that if spaceships are closing range with each other missiles could be useful but rendezvous would have to be mutual or otherwise a ship must be drifting toward another at a high enough speed that reversing directions or evasion would take too long before missiles intersect along it\u0027s potential paths.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-01T01:40:54Z\u0022 title=\u002207/01/2022 01:40  AM\u0022 data-short=\u00222 yr\u0022\u003EJuly 1, 2022\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-07-01T01:22:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150332\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656636084\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHigh thrust constant acceleration is useful for scifi but also creates what I like to call the relativistic kill vehicle problem.\n\u003C/p\u003E\n\u003Cp\u003E\nIf a lot of folks have them and so do missiles, missiles would outrun spaceships and make them all but obsolete.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have a much simpler solution.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your spaceships have fancy reactionless drives that can accelerate the spaceships at up to three gees indefinitely, and you want missiles to be able to catch up to them, then just don’t give the missiles fancy reactionless drives.\n\u003C/p\u003E\n\u003Cp\u003E\nMake up a reason. Say that the reactionless drives are very bulky, or perhaps they are too expensive to use in missiles, or say that a human is required to operate them. Or, maybe best of all, say that the reason the drives are limited to three gees is that they are very sensitive to acceleration and so as a corollary one drive cannot ever be transported by another drive or it will become unstable and explode. This would also mean that a spaceship with one of these drives cannot carry shuttles with reactionless drives, so the shuttles need to have ordinary engines.\n\u003C/p\u003E\n\u003Cp\u003E\nAll that is much simpler than trying to invent physical answers for things that already break physics. \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2022-07-01T01:30:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150347\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656638521\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have a much simpler solution.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your spaceships have fancy reactionless drives that can accelerate the spaceships at up to three gees indefinitely, and you want missiles to be able to catch up to them, then just don’t give the missiles fancy reactionless drives.\n\u003C/p\u003E\n\u003Cp\u003E\nMake up a reason. Say that the reactionless drives are very bulky, or perhaps they are too expensive to use in missiles, or say that a human is required to operate them. Or, maybe best of all, say that the reason the drives are limited to three gees is that they are very sensitive to acceleration and so as a corollary one drive cannot ever be transported by another drive or it will become unstable and explode. This would also mean that a spaceship with one of these drives cannot carry shuttles with reactionless drives, so the shuttles need to have ordinary engines.\n\u003C/p\u003E\n\u003Cp\u003E\nAll that is much simpler than trying to invent physical answers for things that already break physics. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI do not want missiles to be able to outrun ships with drives that can fly for years.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt would make all spacecraft obsolete.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYou have it backwards in this case.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-07-01T02:05:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150356\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656639039\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI do not want missiles to be able to outrun ships with drives that can fly for years.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would make all spacecraft obsolete.\n\u003C/p\u003E\n\u003Cp\u003E\nYou have it backwards in this case.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDid you read my post?\n\u003C/p\u003E\n\u003Cp\u003E\nI literally said that if you don’t want missiles to be able to outrun ships, simply say that missiles can’t  use the fancy reactionless drives that the ships use. So the missiles can use conventional rocket propulsion to accelerate at high speeds over short distances, but they cannot catch up to the constant gradual acceleration of the spaceships over long distances. \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2022-07-01T02:17:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150367\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656641104\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDid you read my post?\n\u003C/p\u003E\n\u003Cp\u003E\nI literally said that if you don’t want missiles to be able to outrun ships, simply say that missiles can’t  use the fancy reactionless drives that the ships use. So the missiles can use conventional rocket propulsion to accelerate at high speeds over short distances, but they cannot catch up to the constant gradual acceleration of the spaceships over long distances. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI know.... but that really would not help in a SW like setting with of ships.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn that case ship size missiles would be viable.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI like my idea better. Allows for more utility... even an ironman like suit lol.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-01T02:31:17Z\u0022 title=\u002207/01/2022 02:31  AM\u0022 data-short=\u00222 yr\u0022\u003EJuly 1, 2022\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2022-07-01T03:03:27Z","Content":"\n\u003Cp\u003E\nThe Traveller RPG always had this issue. The rock-throwing threads (relativistic KE weapons) was an endless subject on usenet.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s true of any SF with a space opera feel. Traveller has limited duration drives of 1 to 6 g, but \u0022limited\u0022 is \u003Cem\u003Eweeks\u003C/em\u003E. Reactionless, torch drives, they all pose KE issues, if not relativistic, then at the very least WMD level damage to worlds.\n\u003C/p\u003E\n\u003Cp\u003E\nTypically missiles were given far more limited capabilities—but there were also then small craft, that might as well just be missiles with no such problem of highly limited \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nJust looking at missiles, high velocity makes them dangerous, but hitting becomes harder (or they blow up far before intercept and the cloud of  shrapnel crosses the target making a hit likely, but with a small chunk).\n\u003C/p\u003E\n\u003Cp\u003E\nIn my traveller universe ( \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/70033-thesaint/\u0026amp;do=hovercard\u0022 data-mentionid=\u002270033\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/70033-thesaint/\u0022 rel=\u0022\u0022\u003E@TheSaint\u003C/a\u003E just mentioned traveller in another thread, lol) we tried to square a few elements of the game, and tried to solve it culturally, and technically via surveillance, etc.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Ships can all be WMD.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Many worlds have EWS systems to try and detect threats, natural or unnatural—and the latter are easy to spot with fusion blowtorches on the back. They also have defense forces capable of dealing with these threats.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Piracy was a thing in traveller, so we wanted that to make sense as well.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Life-prolonging drugs/tech. As a result, people are more careful with their lives, which could be healthy, adult lives for centuries—trauma is not desirable, but fixable. Hyper deadly space combat? \u003Cem\u003EReally\u003C/em\u003E undesirable.\n\u003C/p\u003E\n\u003Cp\u003E\n5. Related to 4, the game\u0027s abstracted combat system for warships was astoundingly deadly. Huge ships with thousands of crew, poof.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I combined 3-5 to make a more \u0022age of sail\u0022 dynamic where ships were damaged to be combat ineffective, then \u0022struck\u0022 to be repaired after battle if victorious, or taken as prizes (and the crew aided, and later swapped, given parole, etc (Horatio Hornblower style)). This resulted in rules of war that minimized total war style conflicts. Individual events might happen, but never as direct actions by great powers, and punished. Lone nuts are still a problem, but that\u0027s easier to defend against than a nation state spending billions to wreck a world (and why wreck a planet when a good planet is highly desirable?).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-01T04:32:19Z\u0022 title=\u002207/01/2022 04:32  AM\u0022 data-short=\u00222 yr\u0022\u003EJuly 1, 2022\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-07-01T04:49:10Z","Content":"\n\u003Cp\u003E\nThe ship wants 3g.\u003Cbr\u003E\nThe ship needs force.\u003Cbr\u003E\nOnly Jedi and Sith masters can use the Force.\u003Cbr\u003E\nThe ship needs several  Force Masters onboard to let them meditate and give enough Power.\u003Cbr\u003E\nThus, missiles can\u0027t. Unless it\u0027s a very small missile with a very strong (Yoda class) Jedi.\n\u003C/p\u003E\n\u003Cp\u003E\nGood jedi produce blue exhaust from the nozzles. Bad ones produce red.\u003Cbr\u003E\nFrom time to time a good jedi becomes bad, and his exhaust gets red. They call it \u0022Red Shift\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, it\u0027s a reactionless drive.\u003Cbr\u003E\nBecause both Jedi(s) and Sith(s) don\u0027t react on something. They just don\u0027t care.\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2022-07-01T04:57:29Z","Content":"\n\u003Cp\u003E\nhaving ships with very large reactors, something like the iter tokamak, i think would solve this. there is likely a lower band for fusion, especially when using magnetic confinement. you require minimum reactor volumes on the order of meters due to scaling laws for the reactor design. these would both be very massive and would represent a lot of capitol. so it would be impractical to use these drives on missiles (barring long range planet killers, but thats a whole other can of worms). \n\u003C/p\u003E\n\u003Cp\u003E\nmissiles might instead depend on chemical engines or beamed power thermal engines or a combination of both. two stage missiles where the first stage is beamed power, the firing ship gets these things up to intercept velocity with power from its own reactor. once out of range of its ship, it would rely on the chemical engine for the terminal phase. ships might fire swarms of these things  to maximize the kill probability (this adds the interesting scenario where the ship is a sitting duck while launching swarms since its using energy required by its engine).  you might also use gun-missile hybrid weapons using multistage guns or linear accelerators to get a lot of initial velocity for intercept. then use \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003Esrb\u003C/abbr\u003E\u003C/abbr\u003E charges for the terminal phase (some spin stabilized asat weapons do this). these ships could use their engines while firing but would be more massive. this would be the option for npp as you have replaced a big fusion reactor with a giant pusher plate. \n\u003C/p\u003E\n\u003Cp\u003E\nthe limit here is not velocity but the delta-v of the terminal phase. ships cannot outrun missiles, but they can out burn them. so battle is like a cheetah vs an impala. missiles can accelerate faster in their terminal phase, but its delta-v limited. a target can be thought of as an expanding radius. a target ship will engage in evasive maneuvers the second it detects incoming ordinance, and this radius will depend on how much space the ship can cover during the intercept phase, we can call this the evasion radius. so you fire your missiles in a pattern that enables it to cover as much of that radius as possible. the delta-v of the terminal phase limits how much space each missile can cover.  each missile will have an assured destruction radius from the point where it exits the intercept phase, any target in that radius is effectively dead. combat doctrine would involve firing enough missiles so that their destruction radii (think of it as a sphere) completely fill the target\u0027s evasion radius sphere with enough overlap to deny survival. this is not always possible, you might not have enough ordinance or you might be too far and the the ship would have too much time to escape.  you could have dialog like: \u0022sir, firing solution is at 60% coverage with the full magazine, do i engage?\u0022 \u0022negative, if we miss they could turn and swamp us\u0022. that could be interesting if you plan on having a lot of tactical dialogue.\n\u003C/p\u003E\n\u003Cp\u003E\nmultiple ships can also converge their firing solutions for maximum kill probability but requires the light delay to be significantly short enough.  use of stealth and concealment can add additional tactical flare. think you are in a 1v1 battle, fire your ordinance. then a ship pops out of a sensor shadow and unloads its missiles, while the target ship launches its missiles to fill the gaps. this makes sense if the things being fought over are immobile like big space colonies or planets/asteroids/moon systems. you could intentionally build in messy locations and hide corvettes among the space debris. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-01T05:13:44Z\u0022 title=\u002207/01/2022 05:13  AM\u0022 data-short=\u00222 yr\u0022\u003EJuly 1, 2022\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2022-07-01T06:00:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150394\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656650950\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe ship wants 3g.\u003Cbr\u003E\nThe ship needs force.\u003Cbr\u003E\nOnly Jedi and Sith masters can use the Force.\u003Cbr\u003E\nThe ship needs several  Force Masters onboard to let them meditate and give enough Power.\u003Cbr\u003E\nThus, missiles can\u0027t. Unless it\u0027s a very small missile with a very strong (Yoda class) Jedi.\n\u003C/p\u003E\n\u003Cp\u003E\nGood jedi produce blue exhaust from the nozzles. Bad ones produce red.\u003Cbr\u003E\nFrom time to time a good jedi becomes bad, and his exhaust gets red. They call it \u0022Red Shift\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, it\u0027s a reactionless drive.\u003Cbr\u003E\nBecause both Jedi(s) and Sith(s) don\u0027t react on something. They just don\u0027t care.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMissile class Jedi are all called Jedi-biah Kerman and are cloned from spores. From a distance their green skin and oversized heads occasionally get them confused for Yoda. It\u0027s also a little known fact that painting red stripes on the missile makes it go faster.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2022-07-01T08:16:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150347\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656638521\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOr, maybe best of all, say that the reason the drives are limited to three gees is that they are very sensitive to acceleration and so as a corollary one drive cannot ever be transported by another drive or it will become unstable and explode.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI believe magnetic bottles (e.g. the kind you\u0027d find in many fusion reactors or antimatter storage) don\u0027t work well together.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2022-07-01T09:02:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150398\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656651449\u0022 data-ipsquote-userid=\u002210883\u0022 data-ipsquote-username=\u0022Nuke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Nuke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhaving ships with very large reactors, something like the iter tokamak, i think would solve this. there is likely a lower band for fusion, especially when using magnetic confinement. you require minimum reactor volumes on the order of meters due to scaling laws for the reactor design. these would both be very massive and would represent a lot of capitol. so it would be impractical to use these drives on missiles (barring long range planet killers, but thats a whole other can of worms). \n\u003C/p\u003E\n\u003Cp\u003E\nmissiles might instead depend on chemical engines or beamed power thermal engines or a combination of both. two stage missiles where the first stage is beamed power, the firing ship gets these things up to intercept velocity with power from its own reactor. once out of range of its ship, it would rely on the chemical engine for the terminal phase. ships might fire swarms of these things  to maximize the kill probability (this adds the interesting scenario where the ship is a sitting duck while launching swarms since its using energy required by its engine).  you might also use gun-missile hybrid weapons using multistage guns or linear accelerators to get a lot of initial velocity for intercept. then use \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003Esrb\u003C/abbr\u003E\u003C/abbr\u003E charges for the terminal phase (some spin stabilized asat weapons do this). these ships could use their engines while firing but would be more massive. this would be the option for npp as you have replaced a big fusion reactor with a giant pusher plate. \n\u003C/p\u003E\n\u003Cp\u003E\nthe limit here is not velocity but the delta-v of the terminal phase. ships cannot outrun missiles, but they can out burn them. so battle is like a cheetah vs an impala. missiles can accelerate faster in their terminal phase, but its delta-v limited. a target can be thought of as an expanding radius. a target ship will engage in evasive maneuvers the second it detects incoming ordinance, and this radius will depend on how much space the ship can cover during the intercept phase, we can call this the evasion radius. so you fire your missiles in a pattern that enables it to cover as much of that radius as possible. the delta-v of the terminal phase limits how much space each missile can cover.  each missile will have an assured destruction radius from the point where it exits the intercept phase, any target in that radius is effectively dead. combat doctrine would involve firing enough missiles so that their destruction radii (think of it as a sphere) completely fill the target\u0027s evasion radius sphere with enough overlap to deny survival. this is not always possible, you might not have enough ordinance or you might be too far and the the ship would have too much time to escape.  you could have dialog like: \u0022sir, firing solution is at 60% coverage with the full magazine, do i engage?\u0022 \u0022negative, if we miss they could turn and swamp us\u0022. that could be interesting if you plan on having a lot of tactical dialogue.\n\u003C/p\u003E\n\u003Cp\u003E\nmultiple ships can also converge their firing solutions for maximum kill probability but requires the light delay to be significantly short enough.  use of stealth and concealment can add additional tactical flare. think you are in a 1v1 battle, fire your ordinance. then a ship pops out of a sensor shadow and unloads its missiles, while the target ship launches its missiles to fill the gaps. this makes sense if the things being fought over are immobile like big space colonies or planets/asteroids/moon systems. you could intentionally build in messy locations and hide corvettes among the space debris. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is simple and realistic, also hold true with most drive systems like fusion engines or Orion. \u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2022-07-01T16:16:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150332\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656636084\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHigh thrust constant acceleration is useful for scifi but also creates what I like to call the relativistic kill vehicle problem.\n\u003C/p\u003E\n\u003Cp\u003E\nIf a lot of folks have them and so do missiles, missiles would outrun spaceships and make them all but obsolete.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYet I found a solution by a chance of creational conceit.\n\u003C/p\u003E\n\u003Cp\u003E\nEqualized Acceleration: The high thrust constant acceleration drive is of course a fictional plot device, so it\u0027s limits can also be. The drive can actually accelerate for years without refueling.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHint: if you have a magic engine (especially one capable of \u0026gt;=1g thrust), there\u0027s your \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E.  Use magic instead of bad science.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150375\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656644607\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Traveller RPG always had this issue. The rock-throwing threads (relativistic KE weapons) was an endless subject on usenet.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s true of any SF with a space opera feel. Traveller has limited duration drives of 1 to 6 g, but \u0022limited\u0022 is \u003Cem\u003Eweeks\u003C/em\u003E. Reactionless, torch drives, they all pose KE issues, if not relativistic, then at the very least WMD level damage to worlds.\n\u003C/p\u003E\n\u003Cp\u003E\nTypically missiles were given far more limited capabilities—but there were also then small craft, that might as well just be missiles with no such problem of highly limited \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nJust looking at missiles, high velocity makes them dangerous, but hitting becomes harder (or they blow up far before intercept and the cloud of  shrapnel crosses the target making a hit likely, but with a small chunk).\n\u003C/p\u003E\n\u003Cp\u003E\nIn my traveller universe ( \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/70033-thesaint/\u0026amp;do=hovercard\u0022 data-mentionid=\u002270033\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/70033-thesaint/\u0022 rel=\u0022\u0022\u003E@TheSaint\u003C/a\u003E just mentioned traveller in another thread, lol) we tried to square a few elements of the game, and tried to solve it culturally, and technically via surveillance, etc.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Ships can all be WMD.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Many worlds have EWS systems to try and detect threats, natural or unnatural—and the latter are easy to spot with fusion blowtorches on the back. They also have defense forces capable of dealing with these threats.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Piracy was a thing in traveller, so we wanted that to make sense as well.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Life-prolonging drugs/tech. As a result, people are more careful with their lives, which could be healthy, adult lives for centuries—trauma is not desirable, but fixable. Hyper deadly space combat? \u003Cem\u003EReally\u003C/em\u003E undesirable.\n\u003C/p\u003E\n\u003Cp\u003E\n5. Related to 4, the game\u0027s abstracted combat system for warships was astoundingly deadly. Huge ships with thousands of crew, poof.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I combined 3-5 to make a more \u0022age of sail\u0022 dynamic where ships were damaged to be combat ineffective, then \u0022struck\u0022 to be repaired after battle if victorious, or taken as prizes (and the crew aided, and later swapped, given parole, etc (Horatio Hornblower style)). This resulted in rules of war that minimized total war style conflicts. Individual events might happen, but never as direct actions by great powers, and punished. Lone nuts are still a problem, but that\u0027s easier to defend against than a nation state spending billions to wreck a world (and why wreck a planet when a good planet is highly desirable?).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTraveler used a lot of guns (weapons that fired bits of metal propelled by chemical reactions) in addition to proper \u0022sci-fi\u0022 weapons.  There was no reason to believe that they would be rendered completely obsolete, and even included bladed weapons for similar reasons.\n\u003C/p\u003E\n\u003Cp\u003E\n(4. ... As a result, people are more careful with their lives)  you mentioned this together with \u0022usenet\u0022.   My edition (from the 80s, I think the first one) had an amazing character death rate \u003Cem\u003Ejust rolling up the characters.\u003C/em\u003E  No only that, but it came in a box set and if you wanted to play the \u0022included adventure\u0022 (just a bare framework for exploring the galaxy) you needed to roll up and kill off a lot of characters just to get the guy to survive the scout service with enough decorations to get the starship reward (even then you didn\u0027t get it outright, just the downpayment and were on the hook for the mortgage).  It is my favorite tale of \u0022you youngin\u0027s have no idea how lethal old school rpgs were.  Back in traveller, your characters often died while being rolled up\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-07-01T16:39:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150453\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656663383\u0022 data-ipsquote-userid=\u0022146349\u0022 data-ipsquote-username=\u0022DDE\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, DDE said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI believe magnetic bottles (e.g. the kind you\u0027d find in many fusion reactors or antimatter storage) don\u0027t work well together.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMake sense.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as we know, antimatter has positive inertial and gravitational mass, but you could very easily envision a fictional universe where it does not. And so in this fictional universe, applying some sort of current or field to antimatter contained in a self-sustaining inertial magnetic loop creates a “dark matter interaction field” which produces apparently-reactionless thrust by pushing against dark matter particles.\n\u003C/p\u003E\n\u003Cp\u003E\nThen the reason for gee-limiting the drive is trivial: the antimatter containment loop won’t remain stable if it is pushed to over 3 gees. As a corollary, any non-negligible acceleration applied to the antimatter containment loop by an outside force will make it fail, so ships can’t carry missiles with these drives.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150369\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656641876\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI know.... but that really would not help in a SW like setting with of ships.\n\u003C/p\u003E\n\u003Cp\u003E\nIn that case ship size missiles would be viable.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe point is that ships would not be able to carry missiles.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150369\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656641876\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI like my idea better. Allows for more utility... even an ironman like suit lol.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI mean it seems like your idea would give all missiles infinite range, allowing them to pursue ships infinitely and become relativistic kill vehicles capable of taking out planets, but if you’re interpreting your rule to do something different from what you said your rule would do then I suppose it could do something different. \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2022-07-01T16:41:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150587\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656692182\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n(4. ... As a result, people are more careful with their lives)  you mentioned this together with \u0022usenet\u0022.   My edition (from the 80s, I think the first one) had an amazing character death rate \u003Cem\u003Ejust rolling up the characters.\u003C/em\u003E  No only that, but it came in a box set and if you wanted to play the \u0022included adventure\u0022 (just a bare framework for exploring the galaxy) you needed to roll up and kill off a lot of characters just to get the guy to survive the scout service with enough decorations to get the starship reward (even then you didn\u0027t get it outright, just the downpayment and were on the hook for the mortgage).  It is my favorite tale of \u0022you youngin\u0027s have no idea how lethal old school rpgs were.  Back in traveller, your characters often died while being rolled up\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI still have ALL the Little Black Books (LBBs). I\u0027m actually in the credits of a later edition of the game (sadly, no longer in LBBs).\n\u003C/p\u003E\n\u003Cp\u003E\nI was discussing this with my son in the car the other day (coming back from his DnD group). I said I stopped DnD partially because I was more of a SF guy, partially because the rules seemed to make people artificially stronger with level, and I prefered the constraint of more lethal mechanics—violence as a last, \u003Cem\u003Eworst\u003C/em\u003E option.\n\u003C/p\u003E\n\u003Cp\u003E\nBut with \u0022autodocs\u0022 etc, there was at least suspension of disbelief for repairing broken humans. When the ship is vaporized that\u0027s kind of not an option. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-07-01T16:42:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150398\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656651449\u0022 data-ipsquote-userid=\u002210883\u0022 data-ipsquote-username=\u0022Nuke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Nuke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe limit here is not velocity but the delta-v of the terminal phase. ships cannot outrun missiles, but they can out burn them. so battle is like a cheetah vs an impala. missiles can accelerate faster in their terminal phase, but its delta-v limited. a target can be thought of as an expanding radius. a target ship will engage in evasive maneuvers the second it detects incoming ordinance, and this radius will depend on how much space the ship can cover during the intercept phase, we can call this the evasion radius. so you fire your missiles in a pattern that enables it to cover as much of that radius as possible. the delta-v of the terminal phase limits how much space each missile can cover.  each missile will have an assured destruction radius from the point where it exits the intercept phase, any target in that radius is effectively dead. combat doctrine would involve firing enough missiles so that their destruction radii (think of it as a sphere) completely fill the target\u0027s evasion radius sphere with enough overlap to deny survival. this is not always possible, you might not have enough ordinance or you might be too far and the the ship would have too much time to escape. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMakes perfect sense.\n\u003C/p\u003E\n\u003Cp\u003E\nI will note for what it’s worth that the word you’re looking for is “ordnance” not “ordinance”. The former means artillery or other ranged weaponry; the latter means a law or regulation.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2022-07-01T16:45:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150593\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656693559\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe point is that ships would not be able to carry missiles.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis depends on the setting. Take a Star Wars, or even Star Trek (or Expanse) type of setting. A small ship (Millennium Falcon, or smaller) that can accelerate at 1g for a few weeks might not be a \u0022missile\u0022 that could be carried by another small ship, but a \u0022torpedo\u0022 carried by the Death Star could easily be the size of the Falcon (or a fighter).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022into-the-death-star.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002269.74\u0022 height=\u0022265\u0022 width=\u0022380\u0022 src=\u0022http://starwarsage9.com/images/stories/into-the-death-star.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSuch a missile/torpedo needs no warhead. The longer it has to accelerate, the more deadly it is—if it hits. It can have a simple HE warhead designed to break it into chunks, or it could have a dispenser that spits out tungsten (whatever) bars a few cm long. Spin the thing, spit them out every few seconds such that there is a disk moving at the target going however many 10s or 100s of km/s in the target direction, while spreading out the impending shotgun blast. The target cannot evade with sufficient density to the cloud of metal, else the hit % is a function of target cross sectional area vs cloud density.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s what we did in traveller. So the old fashioned hit rolls were a decent approximation. At closer ranges, missiles at lower closing velocities, dispense cloud of metal, scrub off surface features of hull (weapons, sensors, radiators, etc). If something was sent from farther away at higher velocity, hit chance much reduced, but more damage possible. Or missiles/torpedoes could be designed to dispense more, smaller particles to increase hit %, doing linearly less damage as a result of lower mass, but retaining the same velocity.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2022-07-01T17:08:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150596\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656693901\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis depends on the setting. Take a Star Wars, or even Star Trek (or Expanse) type of setting. A small ship (Millennium Falcon, or smaller) that can accelerate at 1g for a few weeks might not be a \u0022missile\u0022 that could be carried by another small ship, but a \u0022torpedo\u0022 carried by the Death Star could easily be the size of the Falcon (or a fighter).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd that applies all the way up. For a sufficiently large and valuable target, it might be worth using a capital ship as a \u0027missile\u0027 especially if it can be set on autopilot and the crew have a chance to get off first. Or maybe they don\u0027t if the setting is sufficiently grimdark.\n\u003C/p\u003E\n\u003Cp\u003E\nI think that as soon as you\u0027re allowing for RKV enabling technology in a setting, then not using them becomes a political, social or economic issue rather than a technical one that involves drawing an arbitrary distinction between a ship and a missile.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-07-01T17:13:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150596\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656693901\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150593\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656693559\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n31 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe point is that ships would not be able to carry missiles.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis depends on the setting. Take a Star Wars, or even Star Trek (or Expanse) type of setting. A small ship (Millennium Falcon, or smaller) that can accelerate at 1g for a few weeks might not be a \u0022missile\u0022 that could be carried by another small ship, but a \u0022torpedo\u0022 carried by the Death Star could easily be the size of the Falcon (or a fighter).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, sure.\n\u003C/p\u003E\n\u003Cp\u003E\nI’m talking about an in-universe constraint in which no ships can carry other ships with these magical drives.\n\u003C/p\u003E\n\u003Cp\u003E\nSo you can certainly build a missile with a magical acceleration but it has to be independently flown from the shipyard to its target. \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2022-07-01T17:27:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150610\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656695636\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI’m talking about an in-universe constraint in which no ships can carry other ships with these magical drives.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat would be sort of rare, but I suppose 2 such drives can\u0027t be within some range of each other might be a thing... then of course getting a ship near another ship is itself a weapon. magical drives make each other explode? Ship = weapon. Magical drives near each other (not even turned on?) bricks both drives? Still makes 2 ships near each other weapons.\n\u003C/p\u003E\n\u003Cp\u003E\nMost settings like fighters (because Star Wars, Battlestar Galactica, Babylon 5, etc, ad nauseum), so I always look at those.\n\u003C/p\u003E\n\u003Cp\u003E\nmaking internally consistent space opera is nontrivial \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-07-01T17:45:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150613\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656696420\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMost settings like fighters (because Star Wars, Battlestar Galactica, Babylon 5, etc, ad nauseum), so I always look at those.\n\u003C/p\u003E\n\u003Cp\u003E\nmaking internally consistent space opera is nontrivial \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, if your goal is to get space dogfights then you either have to cut corners with the physics or you need to come up with some plot reasons.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2022-07-01T17:49:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150620\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656697531\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah, if your goal is to get space dogfights then you either have to cut corners with the physics or you need to come up with some plot reasons.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI always hated fighters in the SW/BG sense, never had them in my traveller settings. Just weapons platforms that were smaller/dispersed.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you posit any even narrow AI, then putting crew on stuff looks even kookier, lol.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-07-01T18:37:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150622\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656697795\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n44 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI always hated fighters in the SW/BG sense, never had them in my traveller settings. Just weapons platforms that were smaller/dispersed.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you posit any even narrow AI, then putting crew on stuff looks even kookier, lol.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can always go the BG/Dune approach and just ban thinking machines \n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2022-07-01T18:42:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150620\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656697531\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah, if your goal is to get space dogfights then you either have to cut corners with the physics or you need to come up with some plot reasons.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTraveler had an interesting set of rules that  allowed for Newtonian physics (well, in 2D) for your tabletop starship maneuvers.  You\u0027d have three tokens per ship.  Where you were last turn, where you are now, and where you plan on being next turn.  The \u0022where you will be\u0022 starts opposite of \u0022where you were\u0022 (thanks to your current velocity) and you are then allowed to move the \u0022where you will be\u0022 one hex (or square, whichever it was) for each \u0022count\u0022 of acceleration your ship had.  Made it easy.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it wasn\u0027t anything like a dogfight.  That would make sense only for ages that you would launch tiny boats from a main ship.  Only case I can think of that happening is whale hunting.  So maybe zerglings or pirates?  But I\u0027m blanking on why pirates would want small attack boats.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2022-07-01T19:34:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150629\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656700631\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can always go the BG/Dune approach and just ban thinking machines \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAt the full AI level, then yes... but narrow intelligent systems?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if intelligence in in fact substrate independent, then it\u0027s just a matter of when. You can ban it, but someone will do it anyway.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150630\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656700934\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n44 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTraveler had an interesting set of rules that  allowed for Newtonian physics (well, in 2D) for your tabletop starship maneuvers.  You\u0027d have three tokens per ship.  Where you were last turn, where you are now, and where you plan on being next turn.  The \u0022where you will be\u0022 starts opposite of \u0022where you were\u0022 (thanks to your current velocity) and you are then allowed to move the \u0022where you will be\u0022 one hex (or square, whichever it was) for each \u0022count\u0022 of acceleration your ship had.  Made it easy.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it wasn\u0027t anything like a dogfight.  That would make sense only for ages that you would launch tiny boats from a main ship.  Only case I can think of that happening is whale hunting.  So maybe zerglings or pirates?  But I\u0027m blanking on why pirates would want small attack boats.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat was Mayday. There was also the other GDW game using the same system, Triplanetary. I still have both \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2022-07-02T01:09:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224150593\u0022 data-ipsquote-contentid=\u0022208792\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221656693559\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMake sense.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as we know, antimatter has positive inertial and gravitational mass, but you could very easily envision a fictional universe where it does not. And so in this fictional universe, applying some sort of current or field to antimatter contained in a self-sustaining inertial magnetic loop creates a “dark matter interaction field” which produces apparently-reactionless thrust by pushing against dark matter particles.\n\u003C/p\u003E\n\u003Cp\u003E\nThen the reason for gee-limiting the drive is trivial: the antimatter containment loop won’t remain stable if it is pushed to over 3 gees. As a corollary, any non-negligible acceleration applied to the antimatter containment loop by an outside force will make it fail, so ships can’t carry missiles with these drives.\n\u003C/p\u003E\n\u003Cp\u003E\nThe point is that ships would not be able to carry missiles.\n\u003C/p\u003E\n\u003Cp\u003E\nI mean it seems like your idea would give all missiles infinite range, allowing them to pursue ships infinitely and become relativistic kill vehicles capable of taking out planets, but if you’re interpreting your rule to do something different from what you said your rule would do then I suppose it could do something different. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNot infinite... just a few years... which to us virtually is infinite since real high thrust rockets last less than a thousand seconds of thrust.\n\u003C/p\u003E\n\u003Cp\u003E\nReally having such missiles does not mean they can necessarily catch up with spaceships.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf anything such scifi tech makes the galaxy safer. Why?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMissiles are best used for intercept, so they are GREAT as orbital defense swarms.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAny enemy missile or spaceship must plot an intercept course for such a planet, and believe you me that any industrialized planet will have far more missiles in orbit than virtually all but the most uber space fleets can muster.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nQuanity and concentration of force is a quality all it\u0027s own... something planets can do in orbital space with ease... especially with my scifi drive.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRKV\u0027s may be deadly, but they are also quite easy to destroy because of how fast they move even a grain of dust could obliterate them.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-02T01:11:00Z\u0022 title=\u002207/02/2022 01:11  AM\u0022 data-short=\u00222 yr\u0022\u003EJuly 2, 2022\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}