{"TopicId":210139,"ForumId":44,"TopicTitle":"Real orbital flights of the 60\u0026#039;s: pilot or computer??","CreatedByName":"RealDarko","CreatedById":22682,"CreatedDateTime":"2022-10-17T13:44:24Z","PageNum":1,"Articles":[{"CreatedByName":"RealDarko","CreatedById":22682,"CreatedDateTime":"2022-10-17T13:44:24Z","Content":"\n\u003Cp\u003E\nHere\u0027s my question, what the NASA and the Soviet space agency used during the 60\u0027s for their manned flights into stable orbits and moon landings? Were the astronauts responsible to manually pilot the rockets into orbits, turning them into position and controlling the burns, or that was controlled from a computer or from the earth? Really curious to know about it.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-10-17T14:24:13Z","Content":"\n\u003Cp\u003E\nBoth.\n\u003C/p\u003E\n\u003Cp\u003E\nNASA was tending to give pilots as much freedom \u003Cs\u003Eto pet their USAF vanity\u003C/s\u003E to let the vessel be as manually controllable as possible. So, their manual controls were assisted with then-advanced computers.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nThe Soviet ships were as much automated as possible with as simple electronics as possible, but with the backup manual override,  \u003Cs\u003Ebecause who cares what the pilot wants\u003C/s\u003E because on the one hand the electronics was more poor and the human assistance was often required, but on the other hand the more poor electronics required more launches which made the human control too expensive and thus impossible.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the Soviet crafts were oriented on advanced analog devices (more electrics than electronics) and the possibility of doing as much operations without a human onboard as possible.\u003Cbr\u003E\nThey were mostly either autonomous or remotely operated, regardless of the crew presence onboard.\u003Cbr\u003E\nThe first digital computers on the crewed ships appeared in mid-1970s, i.e. almost a decade later than on Apollo, but unlike the US ships, the Soviet ones theoretically weren\u0027t needing the crew at all, even for redocking.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same situation was in civil electronics. While in the US a TV-set or a tape recorder was made out of high-quality details, a similar Soviet one was made out of defective details sorted out by the military or industrial facility, having more random characteristics. This made to add various correction schemes (useless in the American TV set), to compensate and balance the signal and to jam the noise. \u003Cbr\u003E\nThis onone hand was making the Soviet TV set more heavy, complicated, and having more probable failure points, but on the other hand gave a good noise resistance and field repairability.\n\u003C/p\u003E\n\u003Cp\u003E\nR-7 didn\u0027t have a computer at all till late XX.\n\u003C/p\u003E\n\u003Cp\u003E\n(Only electrics and mechanics.)\n\u003C/p\u003E\n"},{"CreatedByName":"Poppa Wheelie","CreatedById":218525,"CreatedDateTime":"2022-10-17T16:15:34Z","Content":"\n\u003Cp\u003E\nAlthough this video is about 1.5 hours long, I really enjoyed it.  It\u0027s about the Apollo Guidance Computer, how it worked, and how the crew interacted with it.  It describes what was really happening with all of those 1202 alarms that were going off during the lunar landing descent.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/B1J2RMorJXM?feature=oembed\u0022 title=\u0022Light Years Ahead | The 1969 Apollo Guidance Computer\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd here\u0027s a 15 minute video from Scott Manley where he interacts with some people who have recently gotten an original one of these computers working again.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/Bh_gP5aF3ys?feature=oembed\u0022 title=\u0022Rebooting a 50 Year Old Computer - Making The Apollo Guidance Computer Work Again\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-10-17T16:51:15Z","Content":"\n\u003Cp\u003E\nAmerican crewed spacecraft tended to be flown from the spacecraft itself, either by the crew or by sophisticated onboard computers. The ability to fly the spacecraft by hand was vital to the saving of Apollo 13 after the oxygen tank explosion took out most of its fuel cells and with it the power needed to run the main flight computers. A lot of American astronauts were former military test pilots, which probably had some influence on spacecraft design too.\n\u003C/p\u003E\n\u003Cp\u003E\nIn contrast, Soviet computer technology wasn\u0027t as advanced so the computers were larger and heavier, making them impractical in spacecraft where mass and space are both at a premium; this meant that  Soviet spacecraft were more reliant on ground commands than their American equivalents as they couldn\u0027t calculate their manoeuvres in space and needed ground computers to do so. On the other hand, it also allowed the spacecraft to be operated without a crew and this was done many times: the Vostok capsule was operated as an orbital reconnaissance satellite (named Zenit) with cameras inside the capsule instead of a person, while Soyuz needed only minor changes to turn it into a cargo vessel (Progress) which has been used to supply various space stations for over forty years. The Space Shuttle always required pilots to fly it regardless of mission or payload, but the Soviet Buran was designed to be able to fly autonomously and flew to orbit and back successfully with no crew aboard before the whole project ended with the collapse of the Soviet Union.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2022-10-17T18:03:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224186938\u0022 data-ipsquote-contentid=\u0022210139\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666016653\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBoth.\n\u003C/p\u003E\n\u003Cp\u003E\nNASA was tending to give pilots as much freedom \u003Cs\u003Eto pet their USAF vanity\u003C/s\u003E to let the vessel be as manually controllable as possible. So, their manual controls were assisted with then-advanced computers.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nThe Soviet ships were as much automated as possible with as simple electronics as possible, but with the backup manual override,  \u003Cs\u003Ebecause who cares what the pilot wants\u003C/s\u003E because on the one hand the electronics was more poor and the human assistance was often required, but on the other hand the more poor electronics required more launches which made the human control too expensive and thus impossible.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the Soviet crafts were oriented on advanced analog devices (more electrics than electronics) and the possibility of doing as much operations without a human onboard as possible.\u003Cbr\u003E\nThey were mostly either autonomous or remotely operated, regardless of the crew presence onboard.\u003Cbr\u003E\nThe first digital computers on the crewed ships appeared in mid-1970s, i.e. almost a decade later than on Apollo, but unlike the US ships, the Soviet ones theoretically weren\u0027t needing the crew at all, even for redocking.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same situation was in civil electronics. While in the US a TV-set or a tape recorder was made out of high-quality details, a similar Soviet one was made out of defective details sorted out by the military or industrial facility, having more random characteristics. This made to add various correction schemes (useless in the American TV set), to compensate and balance the signal and to jam the noise. \u003Cbr\u003E\nThis onone hand was making the Soviet TV set more heavy, complicated, and having more probable failure points, but on the other hand gave a good noise resistance and field repairability.\n\u003C/p\u003E\n\u003Cp\u003E\nR-7 didn\u0027t have a computer at all till late XX.\n\u003C/p\u003E\n\u003Cp\u003E\n(Only electrics and mechanics.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nApollo has digital computers, it was an primitive one but digital. However I\u0027m very sure they used lots of analog controllers to just that most of them was under computer control. \u003Cbr\u003E\nEven the burns done by Apollo 13 was done using the computer as its more accurate, now they had to find the craft orientation using an sextant and get velocity and distance from the ground and then input the burn duration and heading. Ground then confirm the trajectory is good. \u003Cbr\u003E\nHowever Apollo 11 went manual, probably with some stability help like SMARTASS to redirect during landing. \u003Cbr\u003E\n\u003Cbr\u003E\nAnd analog controllers works well but they tend to be single use, one example Iowa class battleships has lots of them, you have main guns firing at ships and another for ground targets, yes its the same except ground targets don\u0027t move. However for ground targets you will often rely on people calling inn your shots and the anti ship computer could not handle that well. \u003Cbr\u003E\nThe secondary guns had separate computers and extra for shooting at aircraft, and you needed multiple of all as it took seconds to reset them so 6 for the main guns. \u003Cbr\u003E\nStill at the 80\u0027s restoration they kept the analog  computers as they worked as well as their most advanced stuff. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-10-17T18:15:13Z\u0022 title=\u002210/17/2022 06:15  PM\u0022 data-short=\u00221 yr\u0022\u003EOctober 17, 2022\u003C/time\u003E by magnemoe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2022-10-17T18:22:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224186986\u0022 data-ipsquote-contentid=\u0022210139\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666025475\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA lot of American astronauts were former military test pilots, which probably had some influence on spacecraft design too.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nProbably? Those highly skilled test pilots resented being treated like spam in a can at worst, or trained monkeys at best, and fought for the capability to take control of the craft\n\u003C/p\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2022-10-17T19:28:37Z","Content":"\n\u003Cp\u003E\nPart of the Apollo mission planning was to land on the edge of the lighted half of the moon.  That way the lander cast long shadows which the pilot could see out the window.  They also had a altimeter radar, but shadows were considered a good way to judge altitude.  The shadows also helped spot boulders or irregular terrain, so the pilot could manually choose a smooth landing site.  \n\u003C/p\u003E\n"},{"CreatedByName":"Beamer","CreatedById":219034,"CreatedDateTime":"2022-10-17T20:12:17Z","Content":"\n\u003Cp\u003E\nSmarter Everyday and Linus Tech Tips did a collab video on the Saturn V guidance computer, with a tour by one of the guys who built it. It\u0027s an interesting watch.\n\u003C/p\u003E\n\u003Cp\u003E\nOriginal video:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/dI-JW2UIAG0?feature=oembed\u0022 title=\u0022How did NASA Steer the Saturn V?- Smarter Every Day 223\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nExtended behind the scenes video:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022113\u0022 src=\u0022https://www.youtube-nocookie.com/embed/6mMK6iSZsAs?feature=oembed\u0022 title=\u0022The Computer that Controlled the Saturn V (Behind the Scenes ft Linus Tech Tips) - Smarter Every Day\u0022 width=\u0022200\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-10-17T20:23:16Z\u0022 title=\u002210/17/2022 08:23  PM\u0022 data-short=\u00221 yr\u0022\u003EOctober 17, 2022\u003C/time\u003E by Beamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RealDarko","CreatedById":22682,"CreatedDateTime":"2022-10-17T22:12:12Z","Content":"\n\u003Cp\u003E\nThanks for sharing those videos and the info, thing is that I struggle to control my rockets launches in order to reach orbit specially, and I tought, If I cannot properly do it in the game, how those astronauts did manually in real life?\n\u003C/p\u003E\n"},{"CreatedByName":"Beamer","CreatedById":219034,"CreatedDateTime":"2022-10-18T00:28:40Z","Content":"\n\u003Cp\u003E\nThe reality is most of the ascent through the atmosphere was automated and during the ascent the only real control option the astronauts had was to abort or not abort. It never did go wrong during a manned flight but if it had gone wrong during the first stage, there\u0027s little chance the astronauts could have saved the mission by taking manual control. They definitely could take manual attitude and engine control once in orbit though.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP is a matter of practice really, both in rocket design and flight. Once you get the hang of it it\u0027s easy, so keep at it. It\u0027s mostly about developing some consistency during the early take-off, once you get the hang of that you can often ride comfortably to space by locking your \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E prograde (so in essence automated). In KSP, like in RL, if you have to do a lot of manual work to keep stuff from going wrong it\u0027s probably a design issue. Wobbly payloads can ruin attitude control, and big fairings can just outright flip your rocket over, especially if what they\u0027re hiding is relatively light.\n\u003C/p\u003E\n\u003Cp\u003E\nSome pointers if you want them:\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nMy ascent profiles tend to be on the steep sides but I generally follow these checkpoints during my ascent to an equatorial orbit:\n\u003C/p\u003E\n\u003Col\u003E\n\u003Cli\u003E\nturn on \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, max throttle\n\u003C/li\u003E\n\u003Cli\u003E\nlaunch, turn on \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E if the rocket uses it\n\u003C/li\u003E\n\u003Cli\u003E\nat 100 m/s or 1 km altitude (whichever comes first) start tilting. How far your ideal tilt is depends on how fast you go off the pad (\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E) but it\u0027s typically around 15 degrees off the normal (= 75 degrees pitch), up to 20 degrees or so for higher \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E rockets. Don\u0027t tilt too fast, I typically keep my nav ball cross hair on the edge of the prograde marker or just outside it.\n\u003C/li\u003E\n\u003Cli\u003E\nonce at the desired pitch lock your \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to prograde and don\u0027t touch attitude control anymore. You\u0027re now just going to let gravity turn your rocket further in powered ballistic flight. Thanks to the prograde lock you\u0027ll always be pointing straight into the \u0027wind\u0027 which reduces your air resistance to the minimum. Shortly after this point you should be reaching maxQ so you might want to throttle down a bit to a 1.5 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E or so.\n\u003C/li\u003E\n\u003Cli\u003E\nWith \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E locked to prograde your craft should slowly tilt further by itself as it gains height and speed, keep an eye on it, if it behaves erratically you have a design problem, add struts for wobbly payloads or some tail fins and/or vernors for rockets with big fairings. Throttle back up once past 12 km altitude or so if you throttled down during maxQ\n\u003C/li\u003E\n\u003Cli\u003E\nAt 15 km you should be at least 45 degrees tilt off the normal, so 45 degrees pitch or lower, work towards that manually if you tilt too slow (and remember that for next time with this craft your initial tilt should be a bit further). If you\u0027re tilting too slow you can also simply reduce your throttle a bit rather than taking manual attitude control.\n\u003C/li\u003E\n\u003Cli\u003E\nprobably around here you need to stage to throw off some boosters, if your craft is pointing prograde there is very little risk of collisions, but separatrons are your friends for heavy SRBs \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nkeep an eye on your apoapsis, after this point it\u0027s going to run up fast and you want to tilt over more before it hits your target altitude, above 15 km you have most of the atmosphere behind you so start tilting over (slowly) more towards the horizontal, it should be fairly easy to control the rocket now, start pushing your apoapsis away by aiming below the prograde marker but make sure it stays just above the horizon. again tilt slowly, it\u0027s easy to overshoot the mark if you rotate too fast which can spell problems. Pro tip, if you want to let the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E do most of the work, keep it locked to prograde but switch from \u0022Surface\u0022 to \u0022Orbit\u0022 frame of reference when you want to tilt more, the Orbit prograde marker is typically around 10 degrees below the Surface one at this point.\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cp\u003E\nFrom there you pretty much just stop boosting when your apoapsis is at the desired height (I usually aim for 80 km) and circularize. Above 50km it\u0027s safe to discard your fairings, no need to drag those along to orbit. Exact numbers in the above are somewhat variable depending on how you design your rockets, how quick you are with the controls, etc, but it\u0027s a good starting point. At every flight, notice what could be better and adjust your checkpoints for that. After a while, you\u0027ll by putting heavy loads in orbit like a pro while hardly having to touch your attitude controls.\n\u003C/p\u003E\n\u003Cp\u003E\nMechJeb or Kerbal Engineer can give you precise readouts for things like \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, dynamic pressure, ap/pe, pitch heading and roll, etc.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RealDarko","CreatedById":22682,"CreatedDateTime":"2022-10-18T14:40:12Z","Content":"\n\u003Cp\u003E\nI have a lot of problems during ascent, turning the rocket at the precise moment and keeping there the needed time, etc. That\u0027s why I tought, how they did it back then? Seems I would need that small piece of equipment installed on my rockets for the orbital phase. \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2022-10-18T15:03:43Z","Content":"\n\u003Cp\u003E\nTail fins help a lot in keeping prograde.  In game you can throttle all the way down.  Real rockets have problems with throttling down and usually eschew tail fins.  They have engine gimbal and get the angle right early, which is more difficult.  \n\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2022-10-18T15:06:24Z","Content":"\n\u003Cp\u003E\nIf you over-build your rockets and don\u0027t mind being sub-optimal, you can launch straight up until about 35km where aero stops being an issue, and then turn to 45 degrees up/east until your ap is above 70km or close to your desired orbit, then turn straight east until your pe is the desired height.(low \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E rockets may need to keep the angle above the horizon for longer, high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E rockets can use a planned maneuver node at ap and may coast for several seconds before starting that burn)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-10-18T15:08:53Z\u0022 title=\u002210/18/2022 03:08  PM\u0022 data-short=\u00221 yr\u0022\u003EOctober 18, 2022\u003C/time\u003E by Terwin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2022-10-18T15:34:40Z","Content":"\n\u003Cp\u003E\nThe cheapest transit to Mars/Duna is achieved by waiting till sunrise (which aligns  up with the direction of Kerbin\u0027s motion around the sun)  Then just hold straight up to surface (don\u0027t use the radial out heading because it flips when you go from surface orientation to orbit orientation).\n\u003C/p\u003E\n\u003Cp\u003E\nIn real life this would be a good way to get to Mars.  The side boosters are easier to land at the initial launch pad, so they can be bigger relative to falcon heavy.  You could even do some version of asparagus staging and land the boosters at the initial site.\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2022-10-18T16:04:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224186986\u0022 data-ipsquote-contentid=\u0022210139\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666025475\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Space Shuttle always required pilots to fly it regardless of mission or payload, but the Soviet Buran was designed to be able to fly autonomously and flew to orbit and back successfully with no crew aboard before the whole project ended with the collapse of the Soviet Union.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe real reason the Shuttle required astronauts was political.  NASA wanted to launch 7 astronauts as many times as they could, and using crewed flights to launch satellites was a way to get Congress to fund more and more crewed missions.  As far as I know (and this might only be with the latest revision of electronics), the only thing really required for an uncrewed shuttle launch/landing was an extra long cable (and presumably quite a bit of software, I doubt NASA was willing to let anyone write it without an act of Congress).  This made every satellite/probe proposal have to think whether or not such a mission was worth risking 7 lives just to get it in space.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t forget that the computers NASA had on the ground were unlikely to be all that spectacular.  The birth of supercomputing can be traced to CDC shipping the CDC6600 in 1964, but early models typically went to intelligence services (who paid a hefty premium for serial #0001 or whatever special model CDC was selling).  They may have been able to check the Apollo trajectories on one of these, but recent history implies that they\u0027d prefer hand/sliderule calculations (it didn\u0027t help that Seymour Cray didn\u0027t like parity memory either).  64 bit floating point calculations were an afterthought in computing before the CDC6600, and tend to be rather important in computing for spaceflight (KSP uses 32 bit floats, and this leads to all sorts of issues most notably the \u0022Kraken\u0022 of yore that simply deleted ships going too fast or too far from Kerbin.  Havester was so impressed by his work-around to prevent this that he named his next company after the trick).\n\u003C/p\u003E\n"},{"CreatedByName":"farmerben","CreatedById":190194,"CreatedDateTime":"2022-10-18T17:36:59Z","Content":"\n\u003Cp\u003E\nHow many shuttle astronauts can fit in a Honda Civic?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n12\n\u003C/p\u003E\n\u003Cp\u003E\n2 in front\n\u003C/p\u003E\n\u003Cp\u003E\n3 in back\n\u003C/p\u003E\n\u003Cp\u003E\n7 in the ashtray\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RealDarko","CreatedById":22682,"CreatedDateTime":"2022-10-19T07:16:55Z","Content":"\n\u003Cp\u003E\nIs there a good mod that simulates those early computers? capable of controlling the launch, burn, etc?\n\u003C/p\u003E\n"},{"CreatedByName":"Beamer","CreatedById":219034,"CreatedDateTime":"2022-10-20T00:42:00Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.curseforge.com/kerbal/ksp-mods/mechjeb\u0022 rel=\u0022external nofollow\u0022\u003EMechJeb\u003C/a\u003E has it all. The Ascent Guidance module should have everything you need. I never use this module so don\u0027t ask me how to work it, but from what I understand it has an autopilot that will fly your rocket to orbit based on a selected flight path and it can even give you a countdown to launch a direct intercept to a vessel in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you just want to \u0022Fly by the numbers\u0022 rather than using WASD and eyeing the nav ball, you can use the Smart A.S.S. module. Set Mode to \u0022SURF\u0022, click \u0022SURF\u0022 below that. For an equatorial orbit (and assuming default \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E rotation for your control module), enable Heading, Pitch and Roll control and set them all to 90, launch and hit the Execute button. Then just use the little - (minus) button next to \u0022PIT\u0022 to decrease your pitch in 1 degree steps. This can give you more precise control than a keyboard.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229tKN8JLn_o.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022153.61\u0022 height=\u0022298\u0022 width=\u0022194\u0022 src=\u0022https://images2.imgbox.com/08/e0/9tKN8JLn_o.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFinally there\u0027s the Maneuver planner module for setting up (and automatically executing if you want) circulization burns, plane changes, transfer burns etc.\n\u003C/p\u003E\n\u003Cp\u003E\nIt has a lot more tools, I\u0027ve been using it for years but I still frequently find new stuff.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RealDarko","CreatedById":22682,"CreatedDateTime":"2022-10-22T07:30:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224187959\u0022 data-ipsquote-contentid=\u0022210139\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221666226520\u0022 data-ipsquote-userid=\u0022219034\u0022 data-ipsquote-username=\u0022Beamer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/20/2022 at 2:42 AM, Beamer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.curseforge.com/kerbal/ksp-mods/mechjeb\u0022 rel=\u0022external nofollow\u0022\u003EMechJeb\u003C/a\u003E has it all. The Ascent Guidance module should have everything you need. I never use this module so don\u0027t ask me how to work it, but from what I understand it has an autopilot that will fly your rocket to orbit based on a selected flight path and it can even give you a countdown to launch a direct intercept to a vessel in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you just want to \u0022Fly by the numbers\u0022 rather than using WASD and eyeing the nav ball, you can use the Smart A.S.S. module. Set Mode to \u0022SURF\u0022, click \u0022SURF\u0022 below that. For an equatorial orbit (and assuming default \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E rotation for your control module), enable Heading, Pitch and Roll control and set them all to 90, launch and hit the Execute button. Then just use the little - (minus) button next to \u0022PIT\u0022 to decrease your pitch in 1 degree steps. This can give you more precise control than a keyboard.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://images2.imgbox.com/08/e0/9tKN8JLn_o.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00229tKN8JLn_o.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u0022153.61\u0022 height=\u0022298\u0022 width=\u0022194\u0022 src=\u0022https://images2.imgbox.com/08/e0/9tKN8JLn_o.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFinally there\u0027s the Maneuver planner module for setting up (and automatically executing if you want) circulization burns, plane changes, transfer burns etc.\n\u003C/p\u003E\n\u003Cp\u003E\nIt has a lot more tools, I\u0027ve been using it for years but I still frequently find new stuff.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks a lot! Will need to check that, I feel is just what I need.\n\u003C/p\u003E\n"}]}