{"TopicId":21979,"ForumId":44,"TopicTitle":"Why aren\u0026#039;t we using nuclear thermal rockets?","CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2012-10-11T23:29:55Z","PageNum":1,"Articles":[{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2012-10-11T23:29:55Z","Content":"\n\u003Cp\u003EHaving played around a lot with the atomic rocket engines I\u0027ve come to the conclusion that they are king of spacecraft propulsion for all but the smallest spacecraft.\u003C/p\u003E\u003Cp\u003ESo the question is: how come we don\u0027t use them in our rockets like the Kerbals? Our own NERVA rockets could manage 800s-1000s Isp and could reach a TWR of 7, much better than LV-N which is below 3. Both the US and Soviet Union have launched nuclear reactor powered satellite into LEO before and a NERVA reactor cores are very tough and have been successfully destructively tested to cause minimal containment in case of failure.\u003C/p\u003E\u003Cp\u003ESo how come Kerbals are ahead of us?\u003C/p\u003E\n"},{"CreatedByName":"AtomicIrishman","CreatedById":39214,"CreatedDateTime":"2012-10-11T23:31:06Z","Content":"\n\u003Cp\u003EWhat happens when a nuclear rocket blows up?\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2012-10-11T23:35:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AtomicIrishman\u0022 data-cite=\u0022AtomicIrishman\u0022\u003E\u003Cdiv\u003EWhat happens when a nuclear rocket blows up?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKiwi-TNT\u003C/p\u003E\u003Cp\u003EIn January of 1965, the U.S. Rover program purposely placed a Kiwi Reactor (KIWI-TNT) on fast excursion to simulate a worst-case scenario of a fall from altitude into the ocean such as might occur in a booster failure after launch. The rocket was positioned on a railroad car in the Jackass Flats area of the Nevada Test Site, with the reactor specially modified so as to go critical.\u003C/p\u003E\u003Cp\u003EThe radiation released would have caused fatalities out to 600 feet and injuries out to 2000 feet.\u003C/p\u003E\u003Cp\u003EWith current solid-core nuclear thermal rocket designs, it\u0027s possible that potentially radioactive fuel elements would be dispersed intact over a much smaller area. The overall hazard from the elements would be confined to near the launch site and would be much lower than the many open-air nuclear weapons tests of the 1950s.\u003C/p\u003E\n"},{"CreatedByName":"Sbowyer28","CreatedById":4338,"CreatedDateTime":"2012-10-11T23:48:12Z","Content":"\n\u003Cp\u003EThe reason it was discontinued is the Nuclear Test Treaty Ban, Wish we wouldn\u0027t have signed that DAMNED DOCUMENT!!!\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2012-10-12T00:03:59Z","Content":"\n\u003Cp\u003EWell, the NIMBYs got too powerful in the lobbyist business, too, but that\u0027s a different story...\u003C/p\u003E\u003Cp\u003EAlso, we don\u0027t have the ability to test-fire them, either on Earth or in space. We need to... renegotiate the treaty that prevents that to allow for NTR usage.\u003C/p\u003E\n"},{"CreatedByName":"OdinYggd","CreatedById":26917,"CreatedDateTime":"2012-10-12T00:34:12Z","Content":"\n\u003Cp\u003EIn the 1960s nuclear power was all the rage. Surely atomic propulsion was the true path to space exploration, and nobody knew or cared what it might do. \u003C/p\u003E\u003Cp\u003EThen we had Three Mile Island, quickly followed by Chernobyl. Not only did people learn really quickly what these reactors would do if things went wrong, but they also found out that the government hadn\u0027t told them how dangerous anything involving nuclear fission really was. We had intentionally covered up much of what was learned from the Manhattan Project in order to ensure that public outcry would not prevent us from using the bombs in wartime if needed. \u003C/p\u003E\u003Cp\u003EThe biggest thing is the fallout risk. If a reactor blows while atmospheric, it means global consequences. Naturally the environmentalists and anti-nuclear lobbyists complain too loudly for this to ever be allowed again. Even under normal circumstances, one little leak in the heat exchanger and your \u0027clean\u0027 hot gas exhaust is now a nuclear disaster site. Plus the reactors themselves are very sluggish to respond to control variations- a feature not found in the Kerbal LV-N engine where throttle response is instant, and are even harder to \u0027store live\u0027 than it is to keep a fuelled rocket on the pad without things going wrong because of the extreme conditions involved. \u003C/p\u003E\u003Cp\u003EHowever, NASA regularly launches their RTG units aboard unmanned spacecraft, and in the past did indeed fly a functional nuclear reactor that is currently stuck in a parking orbit with its core subcritical after ejecting one of the required neutron reflectors. These are nothing more than a subcritical mass of plutonium pellets inside a welded-shut container, which is in another container, which is surrounded by thermocouples for electrical generation, which is in yet another container for safety and protection. A number of RTG units are currently safely on the ocean floor after the satellites they powered fell out of orbit and burned up, but the RTG itself remained sealed and splashed safely, sinking before anyone could come across it.\u003C/p\u003E\n"},{"CreatedByName":"Sherlock21st","CreatedById":42362,"CreatedDateTime":"2012-10-12T01:08:20Z","Content":"\n\u003Cp\u003EQuick answer to your question: Nuclear propulsion -\u0026gt; radiation all throughout our atmosphere and space -\u0026gt; lots of people get cancer\u003C/p\u003E\u003Cp\u003EDo you really want that?\u003C/p\u003E\u003Cp\u003EBesides, nuclear rocket engines have already been invented.\u003C/p\u003E\n"},{"CreatedByName":"OdinYggd","CreatedById":26917,"CreatedDateTime":"2012-10-12T01:32:09Z","Content":"\n\u003Cp\u003ERadiation in space isn\u0027t as big of a deal. Space itself is already full of that, cosmic and the like flying about the cosmos. On the surface of the planet the atmosphere protects us, but once you go past the magnetosphere the only thing between the charged particles and ionizing photons of space itself is the tinfoil of your ship\u0027s hull. \u003C/p\u003E\u003Cp\u003EThe problem is the extreme risks of launching a functional nuclear reactor.\u003C/p\u003E\u003Cp\u003ENow if we could figure out a way to launch a reactor in pieces and assemble it safely in space, it would be well suited for powering stations or making interplanetary cruisers. Then each ground launch is only carrying a few containers full of components and fuel, which in a worst case scenario would fall into the ocean still inside a sealed container for safety. \u003C/p\u003E\u003Cp\u003EBut leaving the ground using nuclear power? \u003C/p\u003E\u003Cp\u003EI don\u0027t think the gains are worth the risks.\u003C/p\u003E\n"},{"CreatedByName":"yoyo478","CreatedById":31789,"CreatedDateTime":"2012-10-12T01:46:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sherlock21st\u0022 data-cite=\u0022Sherlock21st\u0022\u003E\u003Cdiv\u003EQuick answer to your question: Nuclear propulsion -\u0026gt; radiation all throughout our atmosphere and space -\u0026gt; lots of people get cancer\u003Cp\u003EDo you really want that?\u003C/p\u003E\u003Cp\u003EBesides, nuclear rocket engines have already been invented.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou understand what nuclear engines actually produce, right? Even if it produced the energy, our atmosphere \u002B our magnetic field prevent the radiation from doing any damage.\u003C/p\u003E\u003Cp\u003EAnd he knows they\u0027ve been invented, he\u0027s asking why we aren\u0027t using them right now, even if we have them.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2012-10-12T01:51:48Z","Content":"\n\u003Cp\u003ENobody is seriously proposing using NTRs for launch from Earth... that\u0027s just silly. They would be used for interplanetary injections and orbit insertions upon arrival.\u003C/p\u003E\u003Cp\u003EThe reason we aren\u0027t using them today? Lack of vision and the unwillingness to to educate those who oppose anything \u0022nuclear,\u0022 along with their unwillingness to be educated.\u003C/p\u003E\n"},{"CreatedByName":"Sbowyer28","CreatedById":4338,"CreatedDateTime":"2012-10-12T02:06:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sherlock21st\u0022 data-cite=\u0022Sherlock21st\u0022\u003E\u003Cdiv\u003EQuick answer to your question: Nuclear propulsion -\u0026gt; radiation all throughout our atmosphere and space -\u0026gt; lots of people get cancer\u003Cp\u003EDo you really want that?\u003C/p\u003E\u003Cp\u003EBesides, nuclear rocket engines have already been invented.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm many people dead or bettering Human kinds knowledge with a mission to mars or wherever... Mission wins everytime (Unless its Orion Pulse Motor)\u003C/p\u003E\n"},{"CreatedByName":"Fendleton","CreatedById":22867,"CreatedDateTime":"2012-10-12T02:20:57Z","Content":"\n\u003Cp\u003EThe NERVA program was initially cancelled because the president at the time (Nixon?) didn\u0027t want to fund a mars mission. NERVA existed to facilitate the mission, so it was cancelled once it became clear the program wouldn\u0027t fail. \u003C/p\u003E\u003Cp\u003EThe main problem is crash damage. If an NTR crashes, it\u0027s not a pretty sight. Because they\u0027re quite heavy (and shielded), they\u0027re more likely to last all the way through a re-entry....but that shielding will be damaged, and will fail on impact if it hasn\u0027t failed earlier. This leads the the fuel elements being scattered around the crash area (note to people not familiar with contamination science: radioisotopes are classed as their own group of contaminants, but they\u0027re basically heavy metals. This means you can\u0027t easily remove them from soil: you have to scrap up the soil (ALL of it), encase it in concrete or glass, and bury it in a vault for a few thousand years) causing issues from radiation (type and level depends on how concentrated the contaminants are, and what elements are used in the reactor) AND the innate toxicity of the heavy metals themselves. if the engine loses containment and disintegrates in the atmosphere, you get lighter contamination over a larger area. In which case you have radioactive cows for a few months, and toxic mushrooms for several years....and you really can\u0027t do much to clean things up.\u003C/p\u003E\u003Cp\u003EWith modern \u0022let\u0027s de-orbit things sensibly\u0022 practice combined with designing the reactor to not disintegrate before impact, this can be avoided by sending debris into the ocean (who likes whales anyway?), but there\u0027s always the potential for a failure to result in a decaying orbit that turns into a bad accident. Australia was peeved enough by being hit with bits of Skylab (and both Spain and Canada have been utterly furious when the US has accidentally dropped unfused nukes onto their land), so just imagine what any country would do if a fully fueled reactor hit their territory, causing contamination which the country might not be in a position to clean up. It would be very similar to a defused nuclear weapon being released...and historical instances have shown this to be VERY expensive and politically damaging to fix up. Of course, NTRs are not filled with explosives when they hit, but they\u0027re travelling fast enough that probably doesn\u0027t matter.\u003C/p\u003E\u003Cp\u003ENERVA was designed as (I think) a third or 4th stage engine, and would have worked just fine as such. You don\u0027t really want to have lots and lots of reactors on a spaceship.....using LFEs or SRBs to get up to a height where you can run your NTR all the way into orbit (and beyond) is far more efficient for the cost (and not having to have lots of expensive recovery systems to retrieve the engines)...since I would imagine that these engines become expensive quickly, especially as you add in safeguards to bring them up to modern safety standards. Plus the controls on nuclear material and public opinion would make dropping stages with reactors in them.....slightly risky, politically. And environmentally. You have to minimise impacts.\u003C/p\u003E\u003Cp\u003EThe main issue to PREVENT an NTR flying is probably the \u0022nuclear is bad\u0022 PR thing. While I\u0027m personally against nuclear power stations (On some fairly strong reasons, but not as a uniform \u0022No nuclear power stations should ever be built anywhere\u0022 thing), nuclear rockets don\u0027t have all of the same issues, due to their design and the fact they aren\u0027t bolted down in a big building that can be damaged or destroyed (except during engine/vehicle assembly, where they really shouldn\u0027t be running)....if the launch platform is reliable enough, and the engine is designed sensibly with modern technology....it\u0027s likely they could be made to work within acceptable safety standards.\u003C/p\u003E\u003Cp\u003EOf course, public opinion differs on such things. Most people 1: Don\u0027t understand how nuclear engines (or reactors. Or bombs) work. 2: Don\u0027t understand how induced radioactivity works and 3: Think all things nuclear can turn into atom bombs in an accident and are designed in exactly the same way regardless of purpose.... But I\u0027d venture that rocketry is probably one of the better things to use nuclear power for. It probably isn\u0027t going to happen, but a well designed one fired from somewhere safe, with adequate fuel element design, protection from an explosive failure of the rocket, and safe disposal or recovery system? It\u0027d probably be fine. Until one went wrong, in which case there would be nasty political and environmental impacts.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2012-10-12T02:46:49Z","Content":"\n\u003Cp\u003EPublic awareness on anything nuclear related is depressing. \u0022Oh no the nuclear reactor will explode like a nuclear bomb and give everyone three arms!\u0022.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2012-10-12T02:53:32Z","Content":"\n\u003Cp\u003EToday, launching nuclear engines section will need extra care, but not much more than launching people.\u003C/p\u003E\u003Cp\u003EAlso You must mind, that because of all these political and social reasons (many people see any use of nuclear power as apocalyptic danger, but in fact, it\u0027s one of last things that probably can kill you), fission materials aren\u0027t easy (and cheap) to get these days, also uranium resources on the world will aren\u0027t last long if will be used for provide energy to all earth power needs (So much uranium are wasted for weapons because of cold war :\u0026lt;). \u003C/p\u003E\u003Cp\u003EI personally hope that nuclear fusion power could replace fossil fuels as main source of electricity (now still coal power plants are on top), but we must still wait 20-30 years before we could said that this technology is feasible for industrial applications (so in optimistic prediction it could be common technology for 50-70 years \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) ,but if that happen all windmills, solar panels and other \u0022green\u0022 toys could hide from the new king of the clean power \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-12T03:04:46Z\u0022 title=\u002210/12/2012 03:04  AM\u0022 data-short=\u002211 yr\u0022\u003EOctober 12, 2012\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-10-12T03:07:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temstar\u0022 data-cite=\u0022Temstar\u0022\u003E\u003Cdiv\u003EThe radiation released would have caused fatalities out to 600 feet and injuries out to 2000 feet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E2000ft for injuries is way, way, way to much to be an acceptable risk.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2012-10-12T03:15:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sneakeypete\u0022 data-cite=\u0022sneakeypete\u0022\u003E\u003Cdiv\u003E2000ft for injuries is way, way, way to much to be an acceptable risk.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Saturn V rocket had more than double that projected radius for injuries, should the first stage suffered a catastrophic explosion or loss of control authority and crashed. I guess we shouldn\u0027t have launched any of them, by your argument.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2012-10-12T03:22:05Z","Content":"\n\u003Cp\u003ENah. My bet is still on nuclear fission as a viable power supply. Wind and solar are nice, but we don\u0027t have the batteries for it. (All of the world\u0027s rechargeable batteries could provide a mere ten minutes of power to the world at current consumption. Unless we have a huge breakthrough in energy storage, It\u0027s unreasonable to expect solar or wind to provide for the world.)\u003C/p\u003E\u003Cp\u003EAnd we aren\u0027t running out of fuel. That\u0027s just silly. We \u003Cstrong\u003Eare\u003C/strong\u003E having slight issues supplying enriched uranium to LWRs, but HWRs can use practically natural uranium. And the travelling wave reactor (look up TerraPower) could use all the nuclear waste we have in storage as fuel, providing power at world consumption rates for a millennia. (Seriously, that\u0027s what the numbers come out to. A thousand years of clean energy to the world, without the risks of nuclear proliferation and weaponisation, all using the waste from our current reactors. Quite frankly, screw anti-nuclear NIMBY types. I WANT this thing in my back yard. Litterally, if possible.)\u003C/p\u003E\n"},{"CreatedByName":"pwnedbyscope","CreatedById":47191,"CreatedDateTime":"2012-10-12T03:26:13Z","Content":"\n\u003Cp\u003EI think the biggest, reason and one previously not mentioned is right now there is no reason we would need to use an NTR for any missions, sure they a efficient but there currently are no missions planned or even thought of that would require what an NTR can give, the farthest we as humans have even thought about traveling is Mars, and that can be reach easily, i use that lightly, with LFEs its already been proven, as soon as we reach the extent of what LFEs and SRBs can offer then we will start looking at other options which would include NTRs, but asking why we dont use NTRs is like asking why we dont use solar sails, the technology is there, but there is no use for them. a question i would like to ask is why isnt there any research going into things such as alcubierre drives\u003C/p\u003E\u003Cp\u003E@ roboray, on that argument the largest non-nuclear artificial explosion was caused by the N1 rocket\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-12T03:31:54Z\u0022 title=\u002210/12/2012 03:31  AM\u0022 data-short=\u002211 yr\u0022\u003EOctober 12, 2012\u003C/time\u003E by pwnedbyscope\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MrMoog","CreatedById":18466,"CreatedDateTime":"2012-10-12T03:45:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoboRay\u0022 data-cite=\u0022RoboRay\u0022\u003E\u003Cdiv\u003EThe Saturn V rocket had more than double that projected radius for injuries, should the first stage suffered a catastrophic explosion or loss of control authority and crashed. I guess we shouldn\u0027t have launched any of them, by your argument.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe difference is that the Saturn V wouldn\u0027t have left the pad full of radioactive debris after an explosion.\u003C/p\u003E\n"},{"CreatedByName":"Werwolf","CreatedById":38001,"CreatedDateTime":"2012-10-12T03:47:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoboRay\u0022 data-cite=\u0022RoboRay\u0022\u003E\u003Cdiv\u003EThe Saturn V rocket had more than double that projected radius for injuries, should the first stage suffered a catastrophic explosion or loss of control authority and crashed. I guess we shouldn\u0027t have launched any of them, by your argument.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t talk poorly of my beloved Saturn V.\u003C/p\u003E\u003Cp\u003E*sniff*\u003C/p\u003E\n"},{"CreatedByName":"Qumefox","CreatedById":43197,"CreatedDateTime":"2012-10-12T04:04:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrMoog\u0022 data-cite=\u0022MrMoog\u0022\u003E\u003Cdiv\u003EThe difference is that the Saturn V wouldn\u0027t have left the pad full of radioactive debris after an explosion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept NTR\u0027s aren\u0027t nuclear bombs. The reactor in an NTR going critical wouldn\u0027t explode, it would melt. \u003C/p\u003E\u003Cp\u003EAlso, they wouldn\u0027t be first stage engines. The NTR\u0027s developed in the 60\u0027s were designed to be operated in space, and use conventional saturn V first, and likely second stages to get in orbit.\u003C/p\u003E\u003Cp\u003EA failure on the pad would actually be a best case failure for something with a NTR on board, because a chemical rocket explosion would be unlikely to seriously harm the shielding/containment of an NTR engine.. Plus launch sites are purposely built away from everything else to minimize the danger to people from accidents.\u003C/p\u003E\u003Cp\u003ENo, the real danger with an NTR engine is a craft failure at high altitude/sub orbital.. or in an unstable orbit that will eventually decay and have the engine re-enter and land in a populated area.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2012-10-12T04:15:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrMoog\u0022 data-cite=\u0022MrMoog\u0022\u003E\u003Cdiv\u003EThe difference is that the Saturn V wouldn\u0027t have left the pad full of radioactive debris after an explosion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not that good of a reason. We know how to clean up radioactive contamination. It\u0027s not really any worse than hypergolic rocket fuel which are highly corrosive, highly toxic, produces carcinogenic exhaust and was used to fuel Titan rockets that flew the Gemini spacecrafts.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2012-10-12T04:20:28Z","Content":"\n\u003Cp\u003EAnyway, many people will be happy by shutting down and remove ALL nuclear plant (Look what damage made green guys in Germany) and technology associated with that. \u003C/p\u003E\u003Cp\u003EAnd about reactor in the backyard, it seams an little overkill - one compact reactor are enough for average town/village/suburbs power needs.\u003C/p\u003E\u003Cp\u003EI hope some NTRs fly in the future, (if / ) when some serious space colonization start takes place \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"pwnedbyscope","CreatedById":47191,"CreatedDateTime":"2012-10-12T04:28:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022karolus10\u0022 data-cite=\u0022karolus10\u0022\u003E\u003Cdiv\u003EAnyway, many people will be happy by shutting down and remove ALL nuclear plant (Look what damage made green guys in Germany) and technology associated with that. \u003Cp\u003EAnd about reactor in the backyard, it seams an little overkill - one compact reactor are enough for average town/village/suburbs power needs.\u003C/p\u003E\u003Cp\u003EI hope some NTRs fly in the future, (if / ) when some serious space colonization start takes place \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethey wont however be happy with the increase it would cause on their power bill\u003C/p\u003E\n"},{"CreatedByName":"doggie015","CreatedById":51752,"CreatedDateTime":"2012-10-12T05:37:37Z","Content":"\n\u003Cp\u003ENuclear FISSION is rather unsafe, however there is more than one way to use nuclear energy...\u003C/p\u003E\u003Cp\u003EIf you can make a fusion reactor small enough to fit in a rocket engine then you have a very safe alternative. Fusion uses less fuel in the reactor, the waste is not a problem as all the fuel is converted into energy, at most you can only have enough fuel for a few milliseconds of operation at a time in the reactor, if the core is breached it stops producing heat in less time than it takes for you to blink, and it runs on Hydrogen, already widely used in space travel!\u003C/p\u003E\n"}]}