{"TopicId":220724,"ForumId":44,"TopicTitle":"A City On Mars","CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2023-11-09T00:56:29Z","PageNum":3,"Articles":[{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-14T13:16:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339775\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699966299\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe point I was trying to make is that your second paragraph was treating off-world colonisation as inevitable, something that was part of the flow of life as we know it, a fundamental aspect of existence that you couldn\u0027t see any point in opposing.  Whereas, in your first paragraph you were fretting that off-world colonisation would never happen, because of human nature.\n\u003C/p\u003E\n\u003Cp\u003E\nThey\u0027re both reasonable viewpoints, they\u0027re just opposed to each other.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOk, I see the issue.  I never used the word \u0022inevitable\u0022.  It most certainly is not inevitable.  The push of life to do so is inevitable, but success is not.  And humans being the only species on the planet capable of fulfilling this push are in the position of either obstructing it, or fulfilling it.   I\u0027d rather \u0022Failed to do the only obvious job they had because they didn\u0027t really try\u0022 to *not* be on humanity\u0027s tombstone. \n\u003C/p\u003E\n\u003Cp\u003E\nSome people, like Extinction Rebellion as an example, see humanity and technology as outside of nature, but any real scientist is not going to draw this line.  Humans and technology are a part of terrestrial life.  What service can this part play that no other part can do that dovetails with what life in general does (grow, adapt, survive, replicate, expand range)?  How do we pay forward the gift of life?  By trying.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-14T13:17:27Z\u0022 title=\u002211/14/2023 01:17  PM\u0022 data-short=\u0022Nov 14\u0022\u003ENovember 14, 2023\u003C/time\u003E by darthgently\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2023-11-14T14:42:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339781\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699967764\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOk, I see the issue.  I never used the word \u0022inevitable\u0022.  It most certainly is not inevitable.  The push of life to do so is inevitable, but success is not.  And humans being the only species on the planet capable of fulfilling this push are in the position of either obstructing it, or fulfilling it.   I\u0027d rather \u0022Failed to do the only obvious job they had because they didn\u0027t really try\u0022 to *not* be on humanity\u0027s tombstone. \n\u003C/p\u003E\n\u003Cp\u003E\nSome people, like Extinction Rebellion as an example, see humanity and technology as outside of nature, but any real scientist is not going to draw this line.  Humans and technology are a part of terrestrial life.  What service can this part play that no other part can do that dovetails with what life in general does (grow, adapt, survive, replicate, expand range)?  How do we pay forward the gift of life?  By trying.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOK, that makes more sense. In which case, I would say that humans are the only species on the planet capable of \u003Cem\u003Etrying\u003C/em\u003E to fulfill that push. To use your own words, the push is inevitable, success is not.\n\u003C/p\u003E\n\u003Cp\u003E\nI also disagree that off-world colonies are the only obvious job we have. As the book which kicked off this thread apparently concluded: \u0022this will be really hard to do and possibly should even never be done, but definitely should not be rushed into.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nFor what it\u0027s worth, that pretty much sums up my opinion. Is somebody going to try building off-world colonies? Probably yes. Are off-world colonies important enough that they\u0027re worth rushing, cutting unnecessary corners for, and killing or injuring people for entirely avoidable reasons in the here and now? Certainly not.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-14T15:26:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339800\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699972949\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n51 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs somebody going to try building off-world colonies? Probably yes. Are off-world colonies important enough that they\u0027re worth rushing, cutting unnecessary corners for, and killing or injuring people for entirely avoidable reasons in the here and now? Certainly not.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nObviously I respectfully disagree and would only point out 1) that all people involved will be volunteers, and that would be an historical first for a frontier, probably.  And 2) we should be very careful deciding what other people are allowed to choose for themselves. \n\u003C/p\u003E\n\u003Cp\u003E\nHumanity has survived so far by exploring multiple paths in parallel and our biggest failures have been when there existed centralized insistence (typically under threat of state coercion/violence) on one \u0022plan\u0022 within a given society.  It is unnatural to explore a single path when it is not necessary.  I\u0027d say it is quite societally dangerous, more so than space settlement even\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339800\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699972949\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n51 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs the book which kicked off this thread apparently concluded: \u0022this will be really hard to do and possibly should even never be done, but definitely should not be rushed into.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I\u0027ve been reading it, and it inspired my disagreement with what I see as its basic assumptions in posts here.  I see the book as playing devil\u0027s advocate at best, not being an end-all, be-all, definitive, settled, unassailably positioned, conversation ender that it seems to be presenting itself as at times\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-14T15:34:02Z\u0022 title=\u002211/14/2023 03:34  PM\u0022 data-short=\u0022Nov 14\u0022\u003ENovember 14, 2023\u003C/time\u003E by darthgently\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2023-11-14T18:25:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339815\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699975568\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nObviously I respectfully disagree and would only point out 1) that all people involved will be volunteers, and that would be an historical first for a frontier, probably.  And 2) we should be very careful deciding what other people are allowed to choose for themselves. \n\u003C/p\u003E\n\u003Cp\u003E\nHumanity has survived so far by exploring multiple paths in parallel and our biggest failures have been when there existed centralized insistence (typically under threat of state coercion/violence) on one \u0022plan\u0022 within a given society.  It is unnatural to explore a single path when it is not necessary.  I\u0027d say it is quite societally dangerous, more so than space settlement even\n\u003C/p\u003E\n\u003Cp\u003E\nYeah, I\u0027ve been reading it, and it inspired my disagreement with what I see as its basic assumptions in posts here.  I see the book as playing devil\u0027s advocate at best, not being an end-all, be-all, definitive, settled, unassailably positioned, conversation ender that it seems to be presenting itself as at times\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd respectfully, I think you\u0027re overplaying the volunteer thing.  Sure, space colonisation will be risky and dangerous. No way around that, and I agree that people should be able to choose the level of risk they\u0027re OK with.  But the way I see it, is there\u0027s a big difference between accepting the risk that things will go wrong despite the best efforts of everyone involved, and accepting the risk that something\u0027s going to go wrong because somebody decided that the \u0027best part for this is no part\u0027, or used the wrong grade wiring tape, or wedged in an accelerometer upside down, or decided that they didn\u0027t need a flame trench for this launch. The kind of thing that\u0027s given Go Fever a deservedly bad name - and as far as I see it,  the one company seriously pushing for space colonisation at the moment, has Go Fever writ large. Maybe not in individual launches but very much in the \u0027pushing this as fast as possible otherwise its not going to happen\u0027 mindset.\n\u003C/p\u003E\n\u003Cp\u003E\nRelying on volunteers shouldn\u0027t be an acceptance that any level of risk is OK. Deciding what level of risk \u003Cem\u003Eis\u003C/em\u003E OK - well that\u0027s a whole other can of worms. I don\u0027t have an answer to that one, but I\u0027ll freely admit that I\u0027m biased against private industry deciding it unilaterally - because given the choice, private industry will invariably go for the faster and cheaper option. I suspect we may disagree on that point.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:  Actually I have a sort of answer, which is that any volunteers should be volunteering on the basis of informed consent, but that\u0027s going to be damn difficult in practice.\n\u003C/p\u003E\n\u003Cp\u003E\nI kind of agree with your second point in general (although I\u0027d lump societal dogma in with state coercion and violence) but I suspect we\u0027d disagree over the specifics. \u003Cspan\u003E Sticking to a single path can be beneficial  for getting things done though, provided that other paths have been fairly considered, and folks have had a chance to make their case for alternatives. Sadly, what worked for the Apollo Program is considerably harder to implement at a societal level.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAnyhow, thanks for an interesting debate - and thanks for keeping  it civil. Happy to read your answer to this post, but shall we then agree to disagree, and let other folks get a word in edgeways on this thread? \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-14T18:30:59Z\u0022 title=\u002211/14/2023 06:30  PM\u0022 data-short=\u0022Nov 14\u0022\u003ENovember 14, 2023\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2023-11-14T21:53:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339815\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699975568\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah, I\u0027ve been reading it, and it inspired my disagreement with what I see as its basic assumptions in posts here.  I see the book as playing devil\u0027s advocate at best, not being an end-all, be-all, definitive, settled, unassailably positioned, conversation ender that it seems to be presenting itself as at times\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe book is written by a cartoonist and a worm biologist. They in no way claim to be providing a definitive \u0022conversation ender\u0022. What they are doing is attempting to be a conversation STARTER -- about issues that are often handwaved over by space colony advocates.\n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2023-11-15T00:03:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339708\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699929707\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt won\u0027t even happen in Musk\u0027s lifetime and he knows it and has admitted as much.  But if we don\u0027t have some urgency it simply won\u0027t happen at all.  Because human nature.\n\u003C/p\u003E\n\u003Cp\u003E\nYou simply will not find a case where life has not tried to fill a niche and to extend its range.  With a living technological species entirely new niches open up and range extension leaps previous boundaries.  You can either go with the flow of life as we know it, or attempt to oppose the flow for \u0022reasons\u0022.   I can\u0027t see the point of opposing such a fundamental aspect of existence\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgain, this “if there is no urgency it won’t happen ever” is nonsense. There was no urgency to develop means of artificial flight after the concept of humans flying was born in stories, but it happened thousands of years later.\n\u003C/p\u003E\n\u003Cp\u003E\nNo one is opposing Mars colonies. They are opposing \u003Cem\u003Erushed\u003C/em\u003E Mars colonies, in other words, Mars colonies without ethics.\n\u003C/p\u003E\n\u003Cp\u003E\nHeck, I’m a Venus colonization fan. I just don’t want it to be rushed and unethical.\n\u003C/p\u003E\n\u003Cp\u003E\nJust to be clear, what steps do you think should be taken before trying to build a settlement?\n\u003C/p\u003E\n\u003Cp\u003E\nIt seems Musk’s fantasy is landing there and setting up shop right away, with no data on how humans function in 38% of Earth gravity.\n\u003C/p\u003E\n\u003Cp\u003E\nI think people should probably know better and realize we need at least as much time studying human health on Mars in a research station as we have on the ISS so far (about 25 years). We see if it’s even possible to live on Mars, and then maybe go for a small town or something.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I say I’m opposed to rushing, I mean I’m opposed to Musk’s fantasy version. Do you believe his fantasy version is the ideal way to do things, or believe a more methodical (if still quick, much quicker than the timeline I suggested or centuries or millennia) path? Because our disagreement may not be as wide as I am assuming.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother thing that bothers me is how certain everyone is we will be able to live on Mars. We just don’t know. It might not even be possible to give birth on Mars. We need to find out.\n\u003C/p\u003E\n\u003Cp\u003E\nIf a huge industry builds up enough momentum, it can be hard to stop. People need to be more pragmatic, even if they want to do things relatively fast. Otherwise “Their disappointment may be immeasurable and their day ruined” one day.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I don’t think that has to be the case. There are other options than Mars. The reason I’m such a big fan of Venus is because of the gravity being much more similar to Earth. And Starship is so similar to the balloon deployment vehicle Geoffrey Landis proposed that it would be easy to adapt for Venus exploration.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339815\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699975568\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nObviously I respectfully disagree and would only point out 1) that all people involved will be volunteers, and that would be an historical first for a frontier, probably.  And 2) we should be very careful deciding what other people are allowed to choose for themselves. \n\u003C/p\u003E\n\u003Cp\u003E\nHumanity has survived so far by exploring multiple paths in parallel and our biggest failures have been when there existed centralized insistence (typically under threat of state coercion/violence) on one \u0022plan\u0022 within a given society.  It is unnatural to explore a single path when it is not necessary.  I\u0027d say it is quite societally dangerous, more so than space settlement even\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust because people volunteer doesn’t mean their lives can be thrown away like lab guinea pigs*. The people on Challenger volunteered for spaceflight but that doesn’t excuse the negligence that caused the disaster. Death is never okay or acceptable. It happens in accidents, but we need to try to prevent the accidents, not create more opportunities for them to happen.\n\u003C/p\u003E\n\u003Cp\u003E\nI would disagree on the second point. It is often only because of a decentralized system that the people who then create the centralized system that brings about evil can rise to power in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, an example of a decentralized system is, ironically, the Soviet space program in the 1960s, where the different Chief Designers were free to propose random projects and getting funding for them without oversight from the government. Trying to develop so much random spacecraft, ranging from spaceplanes to Moon rockets to space stations, is what doomed the Soviet Moon landing effort in that the funding was spread all over the place instead of being concentrated into one goal. That said…\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I find this remark quite ironic, because the Mars colonization project is basically being led by one man under his singular vision right now. Not a lot of discussion and exchange of ideas going on, and everyone seems to be hell bent on the One Singular Vision.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I don’t think the lack of competition is a reason for the lack of discussion. In the same way we talked about the options for Apollo’s architecture and debated about a Mars program afterwards to some extent (majority of Americans opposed it in a July 1969 Gallup poll), discussions should take place amongst Musk’s supporters- even within one organization that lacks competition. Aren’t they the ones who will be signing up to journey to Mars? Shouldn’t they be more concerned over how things are being run and done? I’d hate for the first Mars habitat to suffer the fate of the OLM at Starbase after IFT-1.\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-15T02:03:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339915\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699998811\u0022 data-ipsquote-userid=\u0022137807\u0022 data-ipsquote-username=\u0022mikegarrison\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, mikegarrison said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe book is written by a cartoonist and a worm biologist. They in no way claim to be providing a definitive \u0022conversation ender\u0022. What they are doing is attempting to be a conversation STARTER -- about issues that are often handwaved over by space colony advocates.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPoh-tay-toh, poh-tah-toh.  It is foreseeable by anyone that many will see it as an ender confirming their views\n\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2023-11-15T02:35:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339781\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221699967764\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHumans and technology are a part of terrestrial life.  What service can this part play that no other part can do that dovetails with what life in general does (grow, adapt, survive, replicate, expand range)?  How do we pay forward the gift of life? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs George Carlin said, “The Earth plus Plastic!” We’re just here to provide the Earth with plastic, because it cannot make plastic on its own. \n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-15T02:44:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339951\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700006619\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAgain, this “if there is no urgency it won’t happen ever” is nonsense. There was no urgency to develop means of artificial flight after the concept of humans flying was born in stories, but it happened thousands of years later.\n\u003C/p\u003E\n\u003Cp\u003E\nNo one is opposing Mars colonies. They are opposing \u003Cem\u003Erushed\u003C/em\u003E Mars colonies, in other words, Mars colonies without ethics.\n\u003C/p\u003E\n\u003Cp\u003E\nHeck, I’m a Venus colonization fan. I just don’t want it to be rushed and unethical.\n\u003C/p\u003E\n\u003Cp\u003E\nJust to be clear, what steps do you think should be taken before trying to build a settlement?\n\u003C/p\u003E\n\u003Cp\u003E\nIt seems Musk’s fantasy is landing there and setting up shop right away, with no data on how humans function in 38% of Earth gravity.\n\u003C/p\u003E\n\u003Cp\u003E\nI think people should probably know better and realize we need at least as much time studying human health on Mars in a research station as we have on the ISS so far (about 25 years). We see if it’s even possible to live on Mars, and then maybe go for a small town or something.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I say I’m opposed to rushing, I mean I’m opposed to Musk’s fantasy version. Do you believe his fantasy version is the ideal way to do things, or believe a more methodical (if still quick, much quicker than the timeline I suggested or centuries or millennia) path? Because our disagreement may not be as wide as I am assuming.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother thing that bothers me is how certain everyone is we will be able to live on Mars. We just don’t know. It might not even be possible to give birth on Mars. We need to find out.\n\u003C/p\u003E\n\u003Cp\u003E\nIf a huge industry builds up enough momentum, it can be hard to stop. People need to be more pragmatic, even if they want to do things relatively fast. Otherwise “Their disappointment may be immeasurable and their day ruined” one day.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I don’t think that has to be the case. There are other options than Mars. The reason I’m such a big fan of Venus is because of the gravity being much more similar to Earth. And Starship is so similar to the balloon deployment vehicle Geoffrey Landis proposed that it would be easy to adapt for Venus exploration.\n\u003C/p\u003E\n\u003Cp\u003E\nJust because people volunteer doesn’t mean their lives can be thrown away like lab guinea pigs*. The people on Challenger volunteered for spaceflight but that doesn’t excuse the negligence that caused the disaster. Death is never okay or acceptable. It happens in accidents, but we need to try to prevent the accidents, not create more opportunities for them to happen.\n\u003C/p\u003E\n\u003Cp\u003E\nI would disagree on the second point. It is often only because of a decentralized system that the people who then create the centralized system that brings about evil can rise to power in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, an example of a decentralized system is, ironically, the Soviet space program in the 1960s, where the different Chief Designers were free to propose random projects and getting funding for them without oversight from the government. Trying to develop so much random spacecraft, ranging from spaceplanes to Moon rockets to space stations, is what doomed the Soviet Moon landing effort in that the funding was spread all over the place instead of being concentrated into one goal. That said…\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I find this remark quite ironic, because the Mars colonization project is basically being led by one man under his singular vision right now. Not a lot of discussion and exchange of ideas going on, and everyone seems to be hell bent on the One Singular Vision.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I don’t think the lack of competition is a reason for the lack of discussion. In the same way we talked about the options for Apollo’s architecture and debated about a Mars program afterwards to some extent (majority of Americans opposed it in a July 1969 Gallup poll), discussions should take place amongst Musk’s supporters- even within one organization that lacks competition. Aren’t they the ones who will be signing up to journey to Mars? Shouldn’t they be more concerned over how things are being run and done? I’d hate for the first Mars habitat to suffer the fate of the OLM at Starbase after IFT-1.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI really don\u0027t know where to start with all the assumptions you are making.  Nearly everything is a big assumption about what I meant, what Musk plans, about everything really.  No one, not Musk, suggests we just ship a bunch of people to Mars in the first ship.  Of course studies will be done, on Mars, in orbit, on the Moon, Venus etc.  I\u0027ve been talking about pushing toward settlements off Earth, not just Mars, any company or nation, not just SpaceX, and \u0022pushing toward settlements\u0022, not instant settlements.  I feel like my posts were read through a glass darkly and not fully parsed.\n\u003C/p\u003E\n\u003Cp\u003E\nThe point is the answers will be found by stepping out there, not in discussions like this or in speculative books. \n\u003C/p\u003E\n\u003Cp\u003E\nFor example, given the accelerating advances in AI, molecular biology, materials science, and environmental science I think we can be cautiously optimistic about AI regulated hybrid natural/artificial biosphere development for life support.  But it will only move forward decently if we explore it in real situations.   \n\u003C/p\u003E\n\u003Cp\u003E\nIt is frustrating, for one example, that the ISS hasn\u0027t explored more toward full scale atmospheric recycling via algae or plants.  Not just an experiment box, more like 4 large Bigelows with racks of atmospheric recycling biologics.   Start with one, work out issues, add another, repeat.  The results would be usable in modified form on the Moon, other orbitals, Mars etc.  Until we are attempting to rely on it to a degree, there will be no serious progress.  Because human nature.   Use the result to train biosphere regulating AIs.\n\u003C/p\u003E\n\u003Cp\u003E\ntl;dr More excitement, not less.  More real learning, less speculation.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2023-11-15T04:05:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339996\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700016298\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI really don\u0027t know where to start with all the assumptions you are making.  Nearly everything is a big assumption about what I meant, what Musk plans, about everything really.  No one, not Musk, suggests we just ship a bunch of people to Mars in the first ship.  Of course studies will be done, on Mars, in orbit, on the Moon, Venus etc.  I\u0027ve been talking about pushing toward settlements off Earth, not just Mars, any company or nation, not just SpaceX, and \u0022pushing toward settlements\u0022, not instant settlements.  I feel like my posts were read through a glass darkly and not fully parsed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://x.com/elonmusk/status/1110329210332053504?s=46\u0026amp;t=Jd73T2beq0JLNtwTy1uR5A\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://x.com/elonmusk/status/1110329210332053504?s=46\u0026amp;t=Jd73T2beq0JLNtwTy1uR5A\u003C/a\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nMusk has literally said the city will be complete by 2050.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.inverse.com/science/51291-spacex-here-s-the-timeline-for-getting-to-mars-and-starting-a-colony\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.inverse.com/science/51291-spacex-here-s-the-timeline-for-getting-to-mars-and-starting-a-colony\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd SpaceX’s chief Mars development engineer has said they won’t start off with a base, but with a town. Musk has said it will only be 10 years before the town would be established after the first crewed Mars landing.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that he began these proposals in 2019, before Artemis was planned. Musk had no plans for research on the Moon, and certainly not enough on Mars to determine if people can live there.\n\u003C/p\u003E\n\u003Cp\u003E\nMusk has also said he wants to die on Mars. If he has Starship working after a few development flights, an uncrewed Mars development mission has flown, and rapid reuse is perfected, there is nothing to stop him from his “1,000 ships in each transfer window” plan. He expects a million people to be sent to the planet over the course of roughly 20 years.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339996\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700016298\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor example, given the accelerating advances in AI, molecular biology, materials science, and environmental science I think we can be cautiously optimistic about AI regulated hybrid natural/artificial biosphere development for life support.  But it will only move forward decently if we explore it in real situations.   \n\u003C/p\u003E\n\u003Cp\u003E\nIt is frustrating, for one example, that the ISS hasn\u0027t explored more toward full scale atmospheric recycling via algae or plants.  Not just an experiment box, more like 4 large Bigelows with racks of atmospheric recycling biologics.   Start with one, work out issues, add another, repeat.  The results would be usable in modified form on the Moon, other orbitals, Mars etc.  Until we are attempting to rely on it to a degree, there will be no serious progress.  Because human nature.   Use the result to train biosphere regulating AIs.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI still don’t understand this “human nature” argument. The ISS isn’t being used to study specific systems for Mars missions because none are in development. It would be pointless to develop without a Mars program in place.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reason we haven’t gotten a Mars program so far is because we have more pressing problems on Earth. That’s human nature, but only insofar as we take care of each other instead of abandoning the majority of people in the name of “survival of the species”.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339996\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700016298\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ntl;dr More excitement, not less.  More real learning, less speculation.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSpeculation is not a replacement for excitement. We have to talk about these things to see if they are viable.\n\u003C/p\u003E\n\u003Cp\u003E\nNo one, whether it be a government or a company board, is going to fund experiments for something that might not even work.\n\u003C/p\u003E\n\u003Cp\u003E\nWould you fund parapsychology experiments without speculating whether they are even worthwhile first?\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2023-11-15T06:47:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340006\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700021119\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMusk has also said he wants to die on Mars.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI remember, he also said that he won\u0027t fly because what if something happens.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nAbout the hurry-up mode.\n\u003C/p\u003E\n\u003Cp\u003E\nI believe, the SpaceX sponsor had set a deadline for working rocket, and Musk worries about finishing it in time.\n\u003C/p\u003E\n\u003Cp\u003E\nMars is just a carrot in front of the nose here.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-15T06:49:11Z\u0022 title=\u002211/15/2023 06:49  AM\u0022 data-short=\u0022Nov 15\u0022\u003ENovember 15, 2023\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-15T13:41:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340006\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700021119\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMusk has literally said the city will be complete by 2050.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow many examples of Musk\u0027s super optimistic timelines followed by his satisfaction with how much time it actually ends up taking does one have to be exposed to in order realize he is simply accounting for human nature to bring out the best in people?  It has worked repeatedly in view of the entire world.  We should learn from this clear demonstration\n\u003C/p\u003E\n\u003Cp\u003E\nBy all means, work on the problems you feel/think are most important.  But allow for the reality that it makes sense for others to work on the problems they feel/think are most important. This is how humanity solves multiple problems in parallel.  There doesn\u0027t need to be a central authority picking one path over the other.  That is not how life has succeeded to date\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-15T13:59:51Z","Content":"\n\u003Cp\u003E\nA concept that comes to mind wrt space settlement is refactoring old technology and designs with new knowledge in mind. \n\u003C/p\u003E\n\u003Cp\u003E\nFor example a log cabin on Earth can be built much more efficiently and quickly, even by hand, with just the addition of modern handsaws and tools with modern tool steel and blade technology.  Add in power tools, like chain saws, and a log cabin is a perfectly good solution for shelter in the northern Canadian or Siberian wilderness and much easier to construct than in the 1700s.\n\u003C/p\u003E\n\u003Cp\u003E\nSimilarly a full blown multilayer nano wavelength IC FAB on Mars isn\u0027t necessary at first.  Maybe the ability to simply make discrete solid state transistors, diodes, and FETs would be adequate for in situ manufacturing of simple solar panel tracking and other useful circuits.  We shouldn\u0027t be skittish of older simpler technology that gets the job done, but refactored and improved with new knowledge.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other end of the spectrum, a few CRSPR machines and a library of algal and eukaryotic cell lines would be a great high tech addition to early manned missions.  Also 3D printers of various types.  But maybe the electronics in those printers could use, where possible, discrete components that can be manufactured in situ at the base for some self sufficiency in maintenance of the printers\n\u003C/p\u003E\n"},{"CreatedByName":"Royalswissarmyknife","CreatedById":216092,"CreatedDateTime":"2023-11-15T16:15:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340006\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700021119\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMusk has literally said the city will be complete by 2050.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah and IFT-2 Launched 2 months after IFT-1\n\u003C/p\u003E\n\u003Cp\u003E\nWait...\n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2023-11-16T00:42:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340064\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700055674\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow many examples of Musk\u0027s super optimistic timelines followed by his satisfaction with how much time it actually ends up taking does one have to be exposed to in order realize he is simply accounting for human nature to bring out the best in people?  It has worked repeatedly in view of the entire world.  We should learn from this clear demonstration\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, he may not actually be planning to colonize Mars at all, especially if research shows humans can’t survive in lower Mars gravity.\n\u003C/p\u003E\n\u003Cp\u003E\nGood to know. I’ll treat his statements like the Soviet government’s goal of landing a man on the Moon in 1968 from now.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340064\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700055674\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBy all means, work on the problems you feel/think are most important.  But allow for the reality that it makes sense for others to work on the problems they feel/think are most important. This is how humanity solves multiple problems in parallel.  There doesn\u0027t need to be a central authority picking one path over the other.  That is not how life has succeeded to date\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don’t think the book is a treatise arguing for a singular, UN guided colonization program. It’s just asking questions and being skeptical, which is a good thing.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd in regards to your earlier remark that is trying to close the conversation, I’d say any opinion when presented is done in such a way. It’s very rare to have an addendum at the end of an opinion or viewpoint saying “I might be totally wrong but I’m just saying, so feel free to do your own thing.”\n\u003C/p\u003E\n\u003Cp\u003E\nI’d say shooting down criticism and speculation is pushing for centralized control/singular viewpoint and goal just as much as anyone trying to shoot down an ambitious Mars colonization plan is.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-16T00:43:24Z\u0022 title=\u002211/16/2023 12:43  AM\u0022 data-short=\u0022Nov 16\u0022\u003ENovember 16, 2023\u003C/time\u003E by SunlitZelkova\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-16T01:09:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340212\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700095370\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 minutes ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo, he may not actually be planning to colonize Mars at all, especially if research shows humans can’t survive in lower Mars gravity.\n\u003C/p\u003E\n\u003Cp\u003E\nGood to know. I’ll treat his statements like the Soviet government’s goal of landing a man on the Moon in 1968 from now.\n\u003C/p\u003E\n\u003Cp\u003E\nI don’t think the book is a treatise arguing for a singular, UN guided colonization program. It’s just asking questions and being skeptical, which is a good thing.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd in regards to your earlier remark that is trying to close the conversation, I’d say any opinion when presented is done in such a way. It’s very rare to have an addendum at the end of an opinion or viewpoint saying “I might be totally wrong but I’m just saying, so feel free to do your own thing.”\n\u003C/p\u003E\n\u003Cp\u003E\nI’d say shooting down criticism and speculation is pushing for centralized control/singular viewpoint and goal just as much as anyone trying to shoot down an ambitious Mars colonization plan is.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou speculate too much between the lines I\u0027ve written for me to feel it useful to clarify further.  I don\u0027t understand how repeatedly stating that multiple parallel paths is good somehow equates to centralized control or a singular viewpoint.  I don\u0027t think you are making sense.  I\u0027m not interested in the tone this has taken, so we can perhaps agree that we\u0027ve failed to comprehend each other and move on and let time and silence perhaps do some work.\n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2023-11-16T03:31:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340215\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700096973\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou speculate too much between the lines I\u0027ve written for me to feel it useful to clarify further.  I don\u0027t understand how repeatedly stating that multiple parallel paths is good somehow equates to centralized control or a singular viewpoint.  I don\u0027t think you are making sense.  I\u0027m not interested in the tone this has taken, so we can perhaps agree that we\u0027ve failed to comprehend each other and move on and let time and silence perhaps do some work.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat I’m saying is this. Why can’t the “speculation” you dislike be one of those parallel paths?\n\u003C/p\u003E\n\u003Cp\u003E\nIn other words, why are you so opposed to this book if you think there should not be centralized thinking and control, in other words, debate and discussion?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-16T05:22:12Z\u0022 title=\u002211/16/2023 05:22  AM\u0022 data-short=\u0022Nov 16\u0022\u003ENovember 16, 2023\u003C/time\u003E by SunlitZelkova\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2023-11-16T04:49:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340212\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700095370\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUN guided\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks, had a good laugh.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340212\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700095370\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nespecially if research shows humans can’t survive in lower Mars gravity.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAccording to Reuters, that\u0027s not a problem.\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-16T08:59:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340235\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700105466\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I’m saying is this. Why can’t the “speculation” you dislike be one of those parallel paths?\n\u003C/p\u003E\n\u003Cp\u003E\nIn other words, why are you so opposed to this book if you think there should not be centralized thinking and control, in other words, debate and discussion?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m reading the book, I\u0027ve stated it works as a \u0022devil\u0027s advocate\u0022.  I fully understand the value of opponent processes in biology and society.  I\u0027m not sure you do though as my viewpoint is unacceptable to you while I tolerate yours. I simply don\u0027t want yours to veto mine.  Now, seriously, let\u0027s just put it aside for a bit\n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2023-11-16T10:44:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340281\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700125197\u0022 data-ipsquote-userid=\u0022204885\u0022 data-ipsquote-username=\u0022darthgently\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, darthgently said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m reading the book, I\u0027ve stated it works as a \u0022devil\u0027s advocate\u0022.  I fully understand the value of opponent processes in biology and society.  I\u0027m not sure you do though as my viewpoint is unacceptable to you while I tolerate yours. I simply don\u0027t want yours to veto mine.  Now, seriously, let\u0027s just put it aside for a bit\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe only opinion I can’t tolerate is intolerance of other opinions. I think anyone who has concerns should be properly heard out.\n\u003C/p\u003E\n\u003Cp\u003E\nIt may not be your intention to say so, but writing something off as simply a “devil’s advocate” is, to me, basically saying their criticism and concerns aren’t real and shouldn’t be taken seriously. I interpret that as being intolerant of their opinion to some extent, in that you don’t want to “hear” (take into account seriously in the discussion of a Mars colony) what they are saying. In other words, you trying to veto their opinion or delegitimize it.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can be hopeful all their naysaying is incorrect, and that we will have few issues building a Mars colony, and even not take into account what they say (not “hear” them out, despite what I said in the above paragraph)- that’s fine. To put it another way, I’m not trying to veto your opinion.\n\u003C/p\u003E\n\u003Cp\u003E\nBut to go as far as to say any kind of concern is “holding humanity back” or to insinuate that the authors have ulterior motives is wrong. It’s why I have carried this conversation on for so long instead of letting it go. That kind of attitude is how our worst mistakes happen, not centralized control or any other particular system. And I can’t just sit by and not comment. This is a forum for discussion, not simple comments (like an YouTube video) after all.\n\u003C/p\u003E\n\u003Cp\u003E\nPS- I’m not trying to drag this argument out or start a flame war. I’m just responding when it’s worth responding. I wanted to respond to the accusation that I am intolerant of opinions, and explain my feelings in this discussion.\n\u003C/p\u003E\n\u003Cp\u003E\nPPS- This is really just an explanation of my feelings in this matter. I’m not expecting you to really change your opinion, not even on the whole “they’re holding back humanity thing”. I’m just gonna apply my attitude towards the P word in other spheres of life towards spaceflight from now on. You all can do your own thing and opinions aren’t really worth discussing about. Humans gonna human. This is not an ultimatum, I’m just trying to assure that I won’t drag out the argument further if you are thinking of responding to this but are worried we will argue more.\n\u003C/p\u003E\n\u003Cp\u003E\nPPPS- Those lines in the PPS aren’t insults or passive aggressive remarks, or at least they aren’t intended to be. I apologize if you take them that way. I’m just saying that I don’t feel our discussion needed to go this way and that if it might end up like this next time, I might as well not waste our time. And the second line is me just saying that it is in our nature to butt heads from time to time, and that I’d rather avoid it from now on. And that’s all for both ours benefit, I’m not trying to shame you or feel bad about myself in how we conducted this conversation.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-16T11:25:14Z\u0022 title=\u002211/16/2023 11:25  AM\u0022 data-short=\u0022Nov 16\u0022\u003ENovember 16, 2023\u003C/time\u003E by SunlitZelkova\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-16T11:26:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224340287\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700131473\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n44 minutes ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt may not be your intention to say so, but writing something off as simply a “devil’s advocate” is, to me, basically saying their criticism and concerns aren’t real and shouldn’t be taken seriously\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis may be the crux of the disagreement.  This is not my understanding of \u0022devil\u0027s advocate\u0022 nor is it the common understanding.  If your definitions vary so much from the norm communication is bound to be problematic.  Nearly every point they bring up in the book so far is valid for consideration, that is why I\u0027m reading it.  But it is the apparent central assumption of the book, and in comments here, that \u0022we\u0022 should decide collectively to try or not try.  Humans explore multiple paths in parallel, as does life.  There is no \u0022we\u0022 to get all on the same page nor a reason to browbeat some mythical collective \u0022we\u0022 to toe a single line.  I don\u0027t grok the idea that a subset of humanity must get approval from the collective before proceeding.\n\u003C/p\u003E\n\u003Cp\u003E\nThe P-word may be at the heart of this disjoint, in which case this is the wrong venue for discussion and unlikely to be fruitful anyway\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-11-16T11:29:34Z\u0022 title=\u002211/16/2023 11:29  AM\u0022 data-short=\u0022Nov 16\u0022\u003ENovember 16, 2023\u003C/time\u003E by darthgently\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-16T11:48:12Z","Content":"\n\u003Cp\u003E\nI still think moving on for now is best, as stated before\n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2023-11-16T19:44:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224339951\u0022 data-ipsquote-contentid=\u0022220724\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221700006619\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/15/2023 at 3:03 AM, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere was no urgency to develop means of artificial flight after the concept of humans flying was born in stories\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022825312.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://static.tvmaze.com/uploads/images/original_untouched/330/825312.jpg\u0022\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2023-11-16T20:06:25Z","Content":"\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022X7-Rare-Ww1-Aerial-Flechette-Fletchette-\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002274.75\u0022 height=\u0022299\u0022 width=\u0022400\u0022 src=\u0022https://www.treasurebunker.com/forums/uploads/monthly_2020_01/X7-Rare-Ww1-Aerial-Flechette-Fletchette-Aeroplane-Aerial.jpg.5af82750a4f8ad99d395ced5a79ea739.jpg\u0022\u003E\u003Cimg alt=\u0022untitled-design-16.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002252.25\u0022 height=\u0022418\u0022 width=\u0022800\u0022 src=\u0022https://www.thevintagenews.com/wp-content/uploads/sites/65/2018/03/untitled-design-16.jpg\u0022\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.thevintagenews.com/2018/03/03/the-flechettes/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.thevintagenews.com/2018/03/03/the-flechettes/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"darthgently","CreatedById":204885,"CreatedDateTime":"2023-11-17T01:25:53Z","Content":"\n\u003Cp\u003E\nHere is some excitement\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedid=\u0022embed3137282543\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=https://twitter.com/ashleevance/status/1724872339316482054?t=VJfzjKEQJcDgthuNmOEynw%26s=19\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}