{"TopicId":22630,"ForumId":44,"TopicTitle":"Future Timeline of Space Exploration [WIP]","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-04-18T23:47:36Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-04-18T23:47:36Z","Content":"\n\u003Cp\u003ENOTE: This thread is not affliated with any other thread on the forum. It was not made to be similar to any other thread on the forum. It simply shows my predications for spaceflight from 2013-(Whenever I choose to end.) \u003C/p\u003E\u003Cp\u003EThis is a timeline of the future, and is currently a WIP. Feel free to add your thoughts and opnions, I wil be molding the timeline based on them. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E2013\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EFebruary: Taurus XL 3110 rocket to launch NASA\u0027s Orbiting Carbon Observatory-2\u003C/p\u003E\u003Cp\u003EApril 17: Orbital Sciences Corp. Antares rocket will undergo a flight test, to test the capabilites of of the rocket and the Cyngus Spacecraft. \u003C/p\u003E\u003Cp\u003EOct. 17-18: NASA Juno spacecraft to flyby Earth on its way to Jupiter \u003C/p\u003E\u003Cp\u003EOctober-November: India to launch a unmanned orbiter to Mars. \u003C/p\u003E\u003Cp\u003ENovember: NASA\u0027s Atlas 5-401 rocket to launch Mars Atmosphere and Volatile EvolutioN (MAVEN) probe \u003C/p\u003E\u003Cp\u003ENovember: NASA\u0027s Minotaur V rocket to send Lunar Atmosphere and Dust Environment Explorer, LADEE, into the lunar orbit. \u003C/p\u003E\u003Cp\u003EGerman Space Agency, DLR, to launch a $658-million remote-sensing and cartography spacecraft into the lunar orbit\u003C/p\u003E\u003Cp\u003ENASA to retire Hubble Space Telescope, HST.\u003C/p\u003E\u003Cp\u003EChina\u0027s Long-March-3B rocket to launch Chang\u0027e-3 lunar lander. A second vehicle, Chang\u0027e-4, was expected to back up the mission as of 2010. \u003C/p\u003E\u003Cp\u003EJapan to introduce the Epsilon light-weight rocket, replacing the M-5 launch vehicle, and carrying a Sprint-A planetary telescope.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E2014\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEarly 2013-Late 2014: NASA to launch the first unmanned version of the Orion spacecraft \u003C/p\u003E\u003Cp\u003EEarly 2014: NASA to launch Joint Dark Energy Mission\u003C/p\u003E\u003Cp\u003EJanuary: European Rosetta spacecraft to end its hibernation period\u003C/p\u003E\u003Cp\u003EAug. 20: NASA\u0027s Dawn spacecraft to enter orbit around Ceres.\u003C/p\u003E\u003Cp\u003EAugust: European Rosetta spacecraft to enter orbit around comet Churyumov-Gerasimenko.\u003C/p\u003E\u003Cp\u003EFall: NASA\u0027s MAVEN spacecraft to enter orbit around Mars.\u003C/p\u003E\u003Cp\u003ESept. 21: India\u0027s unmanned probe to enter orbit around Mars.\u003C/p\u003E\u003Cp\u003ENovember: The Rosetta spacecraft to drop Philae lander on the surface of comet Churyumov-Gerasimenko.\u003C/p\u003E\u003Cp\u003EDec. 31: The last chance for a private company to claim a $15-million prize of the X-Prize Foundation for soft-landing a rover on the Moon (Paid for by Google.inc), capable of moving and relying images to Earth. \u003C/p\u003E\u003Cp\u003E2014 the earliest: Japan to launch Hayabusa-2 spacecraft on a mission to a carbon-rich asteroid. \u003C/p\u003E\u003Cp\u003EBigelow and Boeing companies to start assembling a 690-cubic-meter space station in the Earth orbit. \u003C/p\u003E\u003Cp\u003ENASA to launch a visible-light coronagraph to search for planets outside Solar System. \u003C/p\u003E\u003Cp\u003ENASA to send three small landers on the surface of the Moon. \u003C/p\u003E\u003Cp\u003EChina to test fly the Chang Zheng 5 (CZ-5) rocket, capable of delivering 25 tons to the low Earth orbit. It might be used to carry a space station around 2020. \u003C/p\u003E\u003Cp\u003EBrazil to conduct its fourth attempt to orbit a satellite with a domestically built vehicle from Alcantara. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E2015\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EMay: NASA to launch a Solar Probe Plus, which would fly closer to the Sun than any other spacecraft. (Funded as of 2008, by 2011, the launch date slipped to 2017.)\u003C/p\u003E\u003Cp\u003EJuly 14: New Horizons spacecraft to flyby Pluto and its moon Charon.\u003C/p\u003E\u003Cp\u003EJuly 19: NASA\u0027s Solar Probe Plus to conduct a flyby of Venus.\u003C/p\u003E\u003Cp\u003EJuly 26: End of primary mission for NASA\u0027s Dawn spacecraft. \u003C/p\u003E\u003Cp\u003EAug. 15: Europe\u0027s Ariane-5 rocket to launch the 2,300-kilogram BepiColombo probe toward Mercury from Kourou. \u003C/p\u003E\u003Cp\u003EDecember: The Rosetta spacecraft to end its mission as Churyumov-Gerasimenko comet flies past Jupiter.\u003C/p\u003E\u003Cp\u003E2014-2015: China to inaugurate its fourth and southernmost launch facility in Wenchang, Hainan island. \u003C/p\u003E\u003Cp\u003ENASA to add an inflatable module to the ISS. \u003C/p\u003E\u003Cp\u003EChina to launch a Venus orbiter. \u003C/p\u003E\u003Cp\u003EChina to launch a hard X-ray modulation telescope to study black holes, HXMT\u003C/p\u003E\u003Cp\u003EChina\u0027s first solid-fuel launch vehicle Long March-11 to fly its first mission. \u003C/p\u003E\u003Cp\u003EMore to come.....I found a old version of it on a website, but I updated, revised, and modifed it to post it here.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-19T00:49:21Z\u0022 title=\u002204/19/2013 12:49  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 19, 2013\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-04-19T00:21:00Z","Content":"\n\u003Cp\u003EA few points, mostly just updates needed;\u003C/p\u003E\u003Cp\u003EShenzhou 9 already flew last year\u003C/p\u003E\u003Cp\u003EThe first launch of Orion is listed twice\u003C/p\u003E\u003Cp\u003EOCO-2\u0027s flying on a delta-II (I think the last) NET 2014\u003C/p\u003E\u003Cp\u003EMoonlite\u0027s not happening. I think the whole project was functionally stillborn\u003C/p\u003E\u003Cp\u003ELiberty was removed from the CCDev program, and is probably cancelled\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-04-19T00:49:37Z","Content":"\n\u003Cp\u003EThanks. I changed it.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-04-19T06:02:16Z","Content":"\n\u003Cp\u003EFor 2017, you can have the CHEOPS spacecraft and the american SLS (exploration mission 1 to be exact)\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-04-19T11:40:26Z","Content":"\n\u003Cp\u003EYes, I will be adding that. I will also add possible evenets such as the moonbase by 2022 (Due to the Congressional Support of the REAL Space act.)\u003C/p\u003E\n"},{"CreatedByName":"MmPMSFmM","CreatedById":56831,"CreatedDateTime":"2013-04-19T12:03:28Z","Content":"\n\u003Cp\u003ELater this year SpaceX will make the first test flight with Falcon Heavy, capable of lifting 2x the amount of payload which the Space Shuttle was capable of and only the Saturn V could lift more payload to orbit than the falcon heavy.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-04-19T13:55:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EYes, I will be adding that. I will also add possible evenets such as the moonbase by 2022 (Due to the Congressional Support of the REAL Space act.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECongressional support? Where did you get that impression? I will believe that when they show the budget with the money for it. As long as all they speak about is \u0022needing a new vision\u0022 and \u0022within existing budgets\u0022, IMO, it\u0027s just empty rhetoric to win over people like you.\u003C/p\u003E\u003Cp\u003ERune. No bucks, no Buck Rogers.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-04-19T13:58:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MmPMSFmM\u0022 data-cite=\u0022MmPMSFmM\u0022\u003E\u003Cdiv\u003ELater this year SpaceX will make the first test flight with Falcon Heavy, capable of lifting 2x the amount of payload which the Space Shuttle was capable of and only the Saturn V could lift more payload to orbit than the falcon heavy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne word: \u0022Energia\u0022. Read up on your rocket history.\u003C/p\u003E\u003Cp\u003ERune. Not that Falcon Heavy is anything short of awesome.\u003C/p\u003E\n"},{"CreatedByName":"Warshawski","CreatedById":9171,"CreatedDateTime":"2013-04-19T14:04:23Z","Content":"\n\u003Cp\u003EBoth Deep Space Industries and Planetary Resources plan to launch prospecting spacecraft in 2015. Well, prospecting in PR\u0027s case is a telescope, but still.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-04-19T16:10:33Z","Content":"\n\u003Cp\u003EPrototype 200 kW VASIMR engine is scheduled to be installed and tried on ISS in 2015.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-04-19T17:04:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003ECongressional support? Where did you get that impression? I will believe that when they show the budget with the money for it. As long as all they speak about is \u0022needing a new vision\u0022 and \u0022within existing budgets\u0022, IMO, it\u0027s just empty rhetoric to win over people like you.\u003Cp\u003ERune. No bucks, no Buck Rogers.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet\u0027s not start a flame war here. Considering the asteriod plan is unpopular and the main supporters are from the space states, I\u0027d say it has around a 60% chance\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-04-19T17:35:16Z","Content":"\n\u003Cp\u003EThe act requires congress to give NASA finding consistent with \u003Cem\u003Esetting up a moon base\u003C/em\u003E. Do you really expect the act to be passed by the same congress that won\u0027t even give the amounts Bolden is asking for now?\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-04-19T17:55:52Z","Content":"\n\u003Cp\u003EOne year\u0027s worth of USA military budget i way bigger than ALL the money NASA got since it\u0027s been created. Damn shame, it\u0027s all i have to say. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-04-19T18:24:21Z","Content":"\n\u003Cp\u003ETry the 2016 trace gas orbiter, the 2018 exomars rover and the 2020 curiosity-based rover.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-04-19T19:11:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThe act requires congress to give NASA finding consistent with \u003Cem\u003Esetting up a moon base\u003C/em\u003E. Do you really expect the act to be passed by the same congress that won\u0027t even give the amounts Bolden is asking for now?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I said, asteroids are unpopular. Why would Congress fund somethimg they don\u0027t like? I think the Bill has a rsther good chance of.success. Other than that thanks fot the suggestions. They help alot with thr timrlines accuracy.\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-04-19T19:12:20Z","Content":"\n\u003Cp\u003EIn 2019, the Sabre engines (Reaction Engines) will be going through test flights.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-04-19T19:16:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003ELet\u0027s not start a flame war here. Considering the asteriod plan is unpopular and the main supporters are from the space states, I\u0027d say it has around a 60% chance\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, I didn\u0027t intend to flame you, sorry if I gave that impression. I was just trying to correct you on the \u0022congressional support\u0022 part. Congressional support is shown on budgets, not words, and right now that is exactly 0 for a Moon base, and only marginal (100 million \u003Cem\u003Eif\u003C/em\u003E the budget goes through, out of 17 billion) for an asteroid mission. No matter what congressman Wolf keeps on screaming (I\u0027m actually starting to hate that guy, BTW).\u003C/p\u003E\u003Cp\u003ECongress gets enough pork going to the space states with SLS\u002BOrion. When they cancel it, a new pork rocket will take its place without actually having to build or launch anything. If they actually wanted to get something done, they would buy something like 50 existing ELV\u0027s and give NASA money to put stuff on top of them.\u003C/p\u003E\u003Cp\u003ERune. It sound sarcastic, but I\u0027m just going by recent history here.\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-04-20T03:28:09Z","Content":"\n\u003Cp\u003EI didn\u0027t seem to see the James Webb Space Telescope on there anywhere... Unless I\u0027m bad at reading. Any particular reason for this?\u003C/p\u003E\n"}]}