{"TopicId":24072,"ForumId":44,"TopicTitle":"Pendulum Rocket Fallacy?","CreatedByName":"LongbowEOD","CreatedById":22817,"CreatedDateTime":"2013-04-25T18:00:49Z","PageNum":1,"Articles":[{"CreatedByName":"LongbowEOD","CreatedById":22817,"CreatedDateTime":"2013-04-25T18:00:49Z","Content":"\n\u003Cp\u003EFor those who aren\u0027t familiar: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Pendulum_rocket_fallacy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Pendulum_rocket_fallacy\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI hadn\u0027t heard of this until yesterday, and when I did I immediately recognized I was guilty of the misconception it describes.\u003C/p\u003E\u003Cp\u003EAnyway, after finding out about it, I did some thought experiments and came to a startling conclusion that I wanted to test. The first thing I thought was that the standard Pendulum Rocket Fallacy (PRF from here out) described an unguided rocket, with the only stabilizing forces intended (but not actually provided) by the pendulum misconception. It didn\u0027t consider any actively guided rocket.\u003C/p\u003E\u003Cp\u003EI then thought about a \u0022perfect\u0022 rocket, one where the center of mass and center of thrust are perfectly aligned. Any such rocket, pendulum (CoT above CoM) or conventional (CoM above CoT) would, if started pointing perfectly up, continue flying straight up, no guidance necessary. If started (or nudged) off-vertical, it would fly a gravity turn trajectory, in the absence of guidance.\u003C/p\u003E\u003Cp\u003ENext I added guidance to the mix, and I only considered guidance provided by gimbaled engines; no fins, no RCS, no reaction wheel torque. Let\u0027s say you want to fly straight up, but aren\u0027t pointed quite straight up right now. You turn your engine gimbals in such a way to provide a torque on your rocket to point it back to vertical. This means a component of your thrust vector is pointed perpendicular to your rocket heading.\u003C/p\u003E\u003Cp\u003EThe simplest analogy I came up with is driving a car, with steering the wheels equivalent to gimbaling the engines of a rocket. Imagine driving backwards, so that the steered wheels are at the back of the car (relative to travel direction). Relative to the direction of travel, if you want to turn RIGHT, you have to point the steered wheels to the LEFT. This is analogous to a conventional rocket: to steer RIGHT, point your thrust vector LEFT. It\u0027s the opposite for a car driving forward (steered wheels in front): to steer RIGHT, point the wheels RIGHT. This is analogous to a pendulum rocket.\u003C/p\u003E\u003Cp\u003EWhat surprised me at this point was the realization that in a gimbal-steered pendulum rocket, that meant that your thrust vector should always point at your intended direction of travel, whereas for a conventional rocket, you actually have to point your thrust AWAY FROM your travel direction to keep yourself pointed there.\u003C/p\u003E\u003Cp\u003EOnce I had that theory in hand, I went into KSP to build myself a pendulum rocket to test it out. Long, explodey story short, I found out that engine gimbals aren\u0027t \u0022smart\u0022 like other control surfaces. Movable fins and RCS are both automatically configured to provide the correct forces to rotate your craft however you command it. Gimbaled engines, it turned out, are only configured to correctly rotate a conventional rocket. Build a pendulum rocket, and suddenly it handles backward. \u003C/p\u003E\u003Cp\u003EI\u0027ll upload the pendulum rocket I built so you can test it out if you want. I set up a mirrored set of controls on my numpad (8 pitch up; 5 pitch down; 4 yaw right; 6 yaw left) and it handled pretty well, but standard controls flip it quickly into the ground. Note that I used a low-torque probe core. I suspect that a high-torque manned pod would adversely react with the \u0022backward\u0022 control scheme of a pendulum rocket, though I haven\u0027t tested that yet.\u003C/p\u003E\u003Cp\u003ELast, that \u0022startling conclusion\u0022 I mentioned. I theorize that a \u0022smart\u0022 set of gimbals on a pendulum rocket would be slightly more efficient than a conventional design for any sort of maneuvers or course correction, but at present it\u0027s only based on my thought experiment. Can\u0027t test it in KSP yet because I think the current gimbals are \u0022dumb.\u0022 Anybody care to share their thoughts?\u003C/p\u003E\n"},{"CreatedByName":"LongbowEOD","CreatedById":22817,"CreatedDateTime":"2013-04-25T18:05:27Z","Content":"\n\u003Cp\u003EHere\u0027s the test rocket I built. Well, the best version. Should be stock, let me know if it\u0027s not and I\u0027ll fix it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/i8yqp6z7g00g6rp/Pendulum%20C.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/i8yqp6z7g00g6rp/Pendulum%20C.craft\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-04-25T18:06:33Z","Content":"\n\u003Cp\u003EScott Manley has a video on it, hold on...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Tx4cjP-GRAY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EBut I\u0027m sure that if I had a bunch of SAS and RCS on it, it might work... then again, that\u0027s what you did, so...\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-04-25T20:54:37Z","Content":"\n\u003Cp\u003EYeah, I also noticed the \u0022gimballs are not smart\u0022 thing... by having them fight normal control torques and turn a giant ship (tractor designs work better structurally) into a horrible spaghetti thingy. Which is why, on tractor designs, I turn them off completely and steer either with RCS or control torque. Could use a polish, that.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-04-25T22:04:06Z","Content":"\n\u003Cp\u003EFor a real rocket with active gimballs for stability, it matters absolutely naught whether the engines are in front or in the back. Only distance from CoM matters, as that decides torque.\u003C/p\u003E\u003Cp\u003EUnfortunately, the gimball control code in KSP is written under assumption that engines are located bellow CoM, which means the rocket will become unstable with engines on top. But this is purely a software limitation and has nothing to do with physics of the matter.\u003C/p\u003E\u003Cp\u003EThe short of pendulum fallacy is that a pendulum requires an acceleration in constant direction. Rocket\u0027s direction of acceleration changes with direction of thrust and that makes all the difference.\u003C/p\u003E\u003Cp\u003EEdit: As a consequence, if you attach cargo to \u003Cem\u003Estabilized\u003C/em\u003E rocket by tether or similar, you will get pendulum effect. So for large stations with many docking port connections, tractor design makes sense. You just have to disable gimballing, as Rune points out, and rely on RCS, which is coded to work correctly, even if suboptimally, in any configuration.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-25T22:07:22Z\u0022 title=\u002204/25/2013 10:07  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 25, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"}]}