{"TopicId":26238,"ForumId":44,"TopicTitle":"Asparagus Staging in Real Life?","CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-05-10T04:39:39Z","PageNum":1,"Articles":[{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-05-10T04:39:39Z","Content":"\n\u003Cp\u003EI was launching yet another heavy payload into orbit with my favourite asparagus-staged rocket, and I was curious to know why there aren\u0027t any (that I know of) asparagus-staged rockets in the real world. Are they only more efficient in KSP than real life, or are they too expensive/complicated/dangerous to be used by any major space agency?\u003C/p\u003E\n"},{"CreatedByName":"Sleipnir","CreatedById":58380,"CreatedDateTime":"2013-05-10T04:44:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CalculusWarrior\u0022 data-cite=\u0022CalculusWarrior\u0022\u003E\u003Cdiv\u003EI was launching yet another heavy payload into orbit with my favourite asparagus-staged rocket, and I was curious to know why there aren\u0027t any (that I know of) asparagus-staged rockets in the real world. Are they only more efficient in KSP than real life, or are they too expensive/complicated/dangerous to be used by any major space agency?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as I know Fuel transfers (and therefore \u0022Asparagus\u0022 designs) are really really complicated and hard to do IRL, and as of right now only one rocket does it and that is the new NASA rocket SLS ( \u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Launch_System\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Space_Launch_System\u003C/a\u003E )\u003C/p\u003E\u003Cp\u003Eif I am correct\u003C/p\u003E\n"},{"CreatedByName":"AlternNocturn","CreatedById":17872,"CreatedDateTime":"2013-05-10T04:44:08Z","Content":"\n\u003Cp\u003EToo complicated, and side-mounted boosters aren\u0027t normally used due to added drag I believe.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-05-10T04:59:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CalculusWarrior\u0022 data-cite=\u0022CalculusWarrior\u0022\u003E\u003Cdiv\u003EI was launching yet another heavy payload into orbit with my favourite asparagus-staged rocket, and I was curious to know why there aren\u0027t any (that I know of) asparagus-staged rockets in the real world. Are they only more efficient in KSP than real life, or are they too expensive/complicated/dangerous to be used by any major space agency?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFuel transfer is complicated and difficult, and the associated pumps, piping, and couplings add complexity (things to go wrong) and weight. Also, there\u0027s considerable ram drag when the atmosphere tries to flow between the stages. Also supersonic and hypersonic flow can do funny things - forcing the stages apart at one speed while sucking them together at another, adding significant dynamic forces. Then there\u0027s the issue of all those interacting shockwaves....\u003C/p\u003E\n"},{"CreatedByName":"RRoan","CreatedById":733,"CreatedDateTime":"2013-05-10T05:13:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sleipnir\u0022 data-cite=\u0022Sleipnir\u0022\u003E\u003Cdiv\u003EAs far as I know Fuel transfers (and therefore \u0022Asparagus\u0022 designs) are really really complicated and hard to do IRL, and as of right now only one rocket does it and that is the new NASA rocket SLS ( \u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Launch_System\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Space_Launch_System\u003C/a\u003E )\u003Cp\u003Eif I am correct\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou are incorrect\u003C/p\u003E\u003Cp\u003Ethe falcon heavy will come with crossfeed\u003C/p\u003E\n"},{"CreatedByName":"Ession","CreatedById":63471,"CreatedDateTime":"2013-05-10T05:14:24Z","Content":"\n\u003Cp\u003EThe Falcon Heavy will do some fuel cross-feeding as well.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.spacex.com/falcon_heavy.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.spacex.com/falcon_heavy.php\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"yongedevil","CreatedById":62491,"CreatedDateTime":"2013-05-10T05:16:42Z","Content":"\n\u003Cp\u003EI don\u0027t know if there are any currently flying rockets that use fuel transfer; however, check out the wikipedia article on the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Falcon_Heavy#First_stage\u0022 rel=\u0022external nofollow\u0022\u003EFalcon Heavy rocket\u003C/a\u003E being developed by Space X. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wikipedia\u0022 data-cite=\u0022Wikipedia\u0022\u003E\u003Cdiv\u003EEngines from all three cores ignite at launch, but until fuel runs out in the booster cores, the main core uses little or none of its own propellant. Falcon Heavy is being designed with a unique propellant crossfeed capability, where fuel and oxidizer are fed to power most of the engines on the center core from the two side cores, up until the side cores are near empty and ready for the first separation event, \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo there may not be any rockets using asparagus staging right now, but there will be.\u003C/p\u003E\n"},{"CreatedByName":"paleorob","CreatedById":60059,"CreatedDateTime":"2013-05-10T05:22:10Z","Content":"\n\u003Cp\u003EIt is interesting that people tend to poo-poo asparagus designs for the real world since nothing currently flying uses it. I wonder if the KSP community has actually independently invented something new that has real-world utility (like the Falcon Heavy) that traditional \u0022in the box\u0022 aerospace engineers had not previously though of.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-05-10T05:29:07Z","Content":"\n\u003Cp\u003EWell, they had a lot of trouble for the furl teansfer between the orange tank and the shuttle. Now imagine the process of creating an asparagus staged monster like the ones we use.\u003C/p\u003E\u003Cp\u003EAnd that\u0027s just one of the problems...\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2013-05-10T05:35:13Z","Content":"\n\u003Cp\u003EClassic KSP-style \u0022asparagus\u0022 staging (6-8 boosters, dropping away in pairs) is also impractical IRL due to the number of staging events - ideally you want to have as few as possible, so there\u0027s less risk of things going wrong.\u003C/p\u003E\u003Cp\u003EBesides that, it\u0027s quite simply a case of \u0022easier said than done\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-05-10T05:54:37Z","Content":"\n\u003Cp\u003EFuel crossfeeding is a very old concept, in fact Mikhail Tikhonravov first came up and wrote about the idea in 1947. The concept is pretty simple though and many people since Tikhonravov have interdependently rediscovered the idea. For example Chelomei came upon the idea again when he designed the UR-700 rocket as an alternative to the N1 moonshot:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.astronautix.com/graphics/u/ur700all.jpg\u0022 alt=\u0022ur700all.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E(on the top left is UR-700 at lift off, in the middle is it again with the outer ring of asparagus boosters jettisoned)\u003C/p\u003E\u003Cp\u003Ebut it\u0027s never been put into practice at this point, though as others have mentioned Falcon Heavy will have a go at it.\u003C/p\u003E\u003Cp\u003EThe thing that makes it so overwhelming popular is because the engines in KSP are at least 4 times heavier than real life rocket engines for the same thrust, and fuel tanks in KSP are 10 times heavier than real life tanks for the same capacity. Because engines and tanks are so heavy in KSP the advantage of getting rid of them early becomes huge. In real life rocket hardware make up a tiny fraction of the fully fuelled weight of the rocket so the benefit of getting rid of them early is not nearly as pronounced.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-05-10T06:33:05Z","Content":"\n\u003Cp\u003EThere\u0027s several theories as to why asparagus staging isn\u0027t used in real life. \u003C/p\u003E\u003Cp\u003EThe ones that I think are real are:\u003C/p\u003E\u003Cp\u003E1) Too many parts, and unlike the Saturn V or Falcon 9, if the wrong fuel pump were to fail (a common problem from what I\u0027ve read on causes for failed launches), the mission would have to abort unless they had redundant pumps. The Saturn V was able to launch on multiple occasions despite engine failures, and the Falcon 9s have the same ability, though I don\u0027t know if any launches have had engine failures yet.\u003C/p\u003E\u003Cp\u003E2) It wouldn\u0027t provide as much benefit. The reason asparagus staging works is because you\u0027re discarding fuel tanks and engines as soon as possible. Real engines and tanks weigh about a quarter what they do in KSP for the same thrust or tank volume, so the delta-V benefits are significantly reduced. (I haven\u0027t done the math on this, but I plan on doing the math to verify this).\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-10T07:19:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EThere\u0027s several theories as to why asparagus staging isn\u0027t used in real life. \u003Cp\u003EThe ones that I think are real are:\u003C/p\u003E\u003Cp\u003E1) Too many parts, and unlike the Saturn V or Falcon 9, if the wrong fuel pump were to fail (a common problem from what I\u0027ve read on causes for failed launches), the mission would have to abort unless they had redundant pumps. The Saturn V was able to launch on multiple occasions despite engine failures, and the Falcon 9s have the same ability, though I don\u0027t know if any launches have had engine failures yet.\u003C/p\u003E\u003Cp\u003E2) It wouldn\u0027t provide as much benefit. The reason asparagus staging works is because you\u0027re discarding fuel tanks and engines as soon as possible. Real engines and tanks weigh about a quarter what they do in KSP for the same thrust or tank volume, so the delta-V benefits are significantly reduced. (I haven\u0027t done the math on this, but I plan on doing the math to verify this).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFalcon 9 was able to launch with one engine out once. \u003C/p\u003E\u003Cp\u003EFalcon heavy will fuel 3 of it main engines with fuel from boosters. should still have engine out while crossfeed however it complicate stuff. \u003C/p\u003E\u003Cp\u003EEngine and dry weight is main reason why its so useful in KSP in short you have low twr. Try to put something like an orange tank in orbit and you find that an serial stacked rocket will be far heavier.\u003C/p\u003E\u003Cp\u003EParallel stacking in real world is mostly used as an cheap way to get more cargo capacity on an rocket. \u003C/p\u003E\u003Cp\u003EIn real world you can also use different trust on boosters and main stage, launch something with mechjeb with plenty of solid boosters and watch mechjeb pull the throttle far back to reduce drag loss. Now think if you could do this with liquid boosters.\u003C/p\u003E\n"},{"CreatedByName":"Crush","CreatedById":59094,"CreatedDateTime":"2013-05-10T08:01:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlternNocturn\u0022 data-cite=\u0022AlternNocturn\u0022\u003E\u003Cdiv\u003Eand side-mounted boosters aren\u0027t normally used due to added drag I believe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou mean except for the Ariane V, the Soyouz, almost all members of the Delta family, the Proton, the retired Space Shuttle, the SLS, the Falcon Heavy or pretty much every heavy lifter used or designed in this century?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-10T08:10:11Z\u0022 title=\u002205/10/2013 08:10  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 10, 2013\u003C/time\u003E by Crush\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-05-10T08:08:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crush\u0022 data-cite=\u0022Crush\u0022\u003E\u003Cdiv\u003EYou mean except for the Ariane V, the Soyouz, the Delta IV Heavy (and most Medium variants), the Proton, the SLS, the Falcon Heavy or pretty much every heavy lifter used in this century?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Proton launch vehicle does not use side boosters. The center tank holds the oxidizer and the surrounding tanks hold the fuel -- they are not boosters that separate from the stage.\u003C/p\u003E\n"},{"CreatedByName":"Crush","CreatedById":59094,"CreatedDateTime":"2013-05-10T08:14:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003EThe Proton launch vehicle does not use side boosters. The center tank holds the oxidizer and the surrounding tanks hold the fuel -- they are not boosters that separate from the stage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but we were talking about aerodynamics.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-10T08:35:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crush\u0022 data-cite=\u0022Crush\u0022\u003E\u003Cdiv\u003EYes, but we were talking about aerodynamics.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes and it make it interesting that they selected this design, it probably made the stage lighter and cheaper with the higher drag less of an issue.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-05-10T09:07:05Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://www.astronautix.com/graphics/u/ur500dh2.jpg\u0022 alt=\u0022ur500dh2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe shape of the Proton was selected to facilitate rail transport. Since the rockets are going to be built in Moscow and transported to Baikonur by rail for finally assembly each individual piece much fit within existing railway wagons and platforms. What Chelomei did was he built a centre core with a single large tank used for oxidiser. This tank was designed with the largest possible diameter that could be transported by rail. Then once it arrived at Baikonur it\u0027s mated with a ring of segments each holding a smaller fuel tank and engine. Thus you then have a large first stage with all components rail-portable yet require only minimal assembly at Baikonur.\u003C/p\u003E\u003Cp\u003EAnd yes if you\u0027re think Proton kind of looks a bit like the UR-700 I posted above, pat yourself on the shoulder - Proton is actually UR-500. Chelomei designed his rockets so that both UR-500 and UR-700 shared the \u0022maximum railway diameter\u0022 tanks. Only difference is UR-500 would use one in its first stage while UR-700 would use 18 of those tanks in the first two asparagus stages and a UR-500 first stage as its third stage.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-10T09:16:10Z\u0022 title=\u002205/10/2013 09:16  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 10, 2013\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"geb","CreatedById":5399,"CreatedDateTime":"2013-05-10T09:35:27Z","Content":"\n\u003Cp\u003EOne set of fuel crossfeed pipes is tricky to do, but it can be done, and has been. The Falcon Heavy fuel crossfeed system is pretty much the same as the system the space shuttle used to use for moving fuel from its external tank.\u003C/p\u003E\u003Cp\u003EOne pair of asparagus staged boosters can be done.\u003C/p\u003E\u003Cp\u003EThe problem is that as you add more boosters and more engines, the fuel flow rate has to increase. If you have two pairs of boosters, all the fuel pumps and pipes have to be more than twice as big. If you have three pairs, each fuel crossfeed system would need to be about four times as big, and you need four sets of pipes and pumps, so more than sixteen times as much huge heavy junk bolted to your vehicle. It\u0027s not just adding a little yellow tube in reality, since you need to be able to handle tonnes per second of liquid under high pressure, and you need to do it near perfectly smoothly.\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2013-05-10T12:26:17Z","Content":"\n\u003Cp\u003Eone supposes that if you really wanted to see the difference, make a clean copy of ksp and then mod the cfg files for the tanks and reduce their dry weight by a factor of 10 and reduce all engine masses by a factor of 4. then do some testing of your own.\u003C/p\u003E\u003Cp\u003Ereally, about the only thing you couldn\u0027t simulate is mechanical failures. But, otherwise, the results might be interesting.\u003C/p\u003E\n"},{"CreatedByName":"MK3424","CreatedById":19932,"CreatedDateTime":"2013-05-20T22:07:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EThe Saturn V was able to launch on multiple occasions despite engine failures, and the Falcon 9s have the same ability, though I don\u0027t know if any launches have had engine failures yet...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell it happened during the apollo 13 mission that during the 2nd stage burn the center stage shut down so that the spacecraft adjusted his ascent to compensate for the loss.\u003C/p\u003E\n"},{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2013-05-20T22:16:07Z","Content":"\n\u003Cp\u003EHave they even tried using a yellow pipe with arrows painted on it? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENASA\u0027s always trying to make stuff seem complicated to keep their huge budgets.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-20T22:20:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EThe Saturn V was able to launch on multiple occasions despite engine failures, and the Falcon 9s have the same ability, though I don\u0027t know if any launches have had engine failures yet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup... They had a pretty big fail on the ISS resupply mission and the thing kept on trucking.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://motherboard.vice.com/blog/spacex-s-non-fatal-failure\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://motherboard.vice.com/blog/spacex-s-non-fatal-failure\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-20T22:56:16Z","Content":"\n\u003Cp\u003Ealso: conservation on momentum - if tons of fuel are pumped clockwise around the rocket - the rocket will start to roll couterclockwise\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2013-05-20T23:28:06Z","Content":"\n\u003Cp\u003EIt\u0027s too bad things don\u0027t work like that in real life. But sometimes simplicity is really the best option.\u003C/p\u003E\n"}]}