{"TopicId":30374,"ForumId":44,"TopicTitle":"Launch Loops: A viable alternative to space elevators?","CreatedByName":"Phoenix Aerospace","CreatedById":26120,"CreatedDateTime":"2013-05-31T02:53:23Z","PageNum":1,"Articles":[{"CreatedByName":"Phoenix Aerospace","CreatedById":26120,"CreatedDateTime":"2013-05-31T02:53:23Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/LaunchLoop.svg/300px-LaunchLoop.svg.png\u0022 alt=\u0022300px-LaunchLoop.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is a discussion thread, in which we will discuss the viability of the Launch Loop, or in more technical terms, the Lofstrom Loop; an obscure design for a permanent space launch platform which could dramatically reduce costs for spaceflight. For those not \u0022in the loop\u0022 (pun unintended), the Launch Loop is a large structure consisting mainly of a long, flexible tube. This tube, approximately 10cm in diameter is in fact composed of two nested tubes, one inside the other. The outer tube, or the stator, drives the inner tube, or the rotor, by the means of linear induction motors, which may or may not be superconducting in nature. This tube is joined together at the ends, in order to form a loop, one half is affixed to the ground, and the other is secured by the means of a long tether. When the rotor is accelerated, it generates a strong centripetal force. This has the curious effect of lifting the tethered half of the loop off the ground. Once it reaches the limit of the tether, at 80 kilometers above the ground, the loop takes on the shape of a rough parallelogram, with the top measuring roughly 2000 kilometers. Payloads are lifted to the top of this loop by elevator, and grapple onto the madly spinning rotor using electromagnets. At a comfortable rate of 2gs, this accelerates the payload to orbital speeds, where it is released. At apogee, the payload would then fire its own thrusters to circularize its orbit.\u003C/p\u003E\u003Cp\u003EPros and cons of a Launch Loop\u003C/p\u003E\u003Cp\u003EPros\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECan launch large volumes of material. A large loop could launch up to 6 million tons per year.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECosts are lower than conventional rockets, or even space elevators. Space elevators would cost anywhere from 3,000$ to 1,600$ per kilo, wheras a launch loop could bring costs down to \u003Cstrong\u003E300$ to 3$\u003C/strong\u003E per kilo. By comparison, launch on an existing Proton rocket costs approximately 4,300$ per kilogram.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHigher launch rate than conventional rockets (up to several per hour).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECan be built with current or near-future materials. Requires no new high tensile strength materials.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDepending on energy source and erection area, can be more environmentally friendly than conventional rockets.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPayloads spend less time in radiation-heavy Van Allen Belts.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMain structure is situated at an altitude free of space debris.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ECons\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EIf the linear induction system fails, particularly in the unstable turnaround sections, the rotor may collide with the stator. Due to the accumulated kinetic energy, this would release roughly 1.5 petajoules of energy; roughly equvalent to the detonation of a nuclear weapon.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERequires precise electronic control over linear induction elements in order to compensate for weather effects.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe necessity for expansion joints in the rotor presents severe engineering challenges.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERequires the vehicles to have their own engines for circularization.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo, despite the difficulties, would you still consider this a viable method for space access? Why?\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2013-05-31T03:10:19Z","Content":"\n\u003Cp\u003EI read the wiki page, your post and googled the youtubes - and I still don\u0027t understand how this concept works. I\u0027m dumb that way.\u003C/p\u003E\n"},{"CreatedByName":"SuperFastJellyfish","CreatedById":57985,"CreatedDateTime":"2013-05-31T03:55:10Z","Content":"\n\u003Cp\u003EIt sounds like a viable alternative minus the bad day if there is a catastrophic failure. Not to mention, the engineering nightmare it would take to set it up and keep running smoothly.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-05-31T06:24:01Z","Content":"\n\u003Cp\u003EI googled it once, but the forces at the ends where the rotor turns are grotesque. Not sure how they want to do it. Maybe by making the loop turning points be several dozen kilometers in diameter. And the entire thing needs several nuclear powerplants running 24/7 because no power = explosive disintegration.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EIt is a cool idea nonetheless because it does not need any exotic materials.\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2013-05-31T13:48:54Z","Content":"\n\u003Cp\u003EInteresting concept, never heard of it before. Looks like it could be worth a shot if we need to get an extreme amount of payload into orbit like in the far future when humanity wants to settle Mars or something. But for now, even though they say that it needs no exotic materials, any engineering project that spans over 2,000k is going to have a lot of engineering obstacles to overcome. My first thought for why it won\u0027t work is that if you need to service it you have to drop the cables... into the ocean(no need to go into details of difficulties there). And there\u0027s no way you could put this over any stretch of land.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-05-31T14:10:11Z","Content":"\n\u003Cp\u003EWe had a huge discussion on the subject already, but I guess it was eaten by the forum kraken.\u003C/p\u003E\u003Cp\u003EA launch loop is a 4000km long 5cm wide bicycle cable that runs inside a sheath at 14000km/s, which is equivalent to the fastest man-made object ever made (Voyager 1 is travelling at 17km/s). Due to the mass of the cable, thousands of tons, the energy involved is tremendous.\u003C/p\u003E\u003Cp\u003EThe sheath has to maintain a perfect vacuum, because if any air leaked into the system, the friction would melt the cable and the system would explode. If any of the magnets fails, the cable touches the sheath and cause the whole thing to burn up and explode. If any temperature variations along the 2000km loop cause either the sheath or the cable to dilate or retract, even slightly, there will be slack or breakage, and it will explode.\u003C/p\u003E\u003Cp\u003EBut the biggest issue is that there is no known way to raise or lower the cable or to stop it for maintenance, and the engineering problems involved in building hundreds of platforms on the oceanic seabed and assembling the cable is huge.\u003C/p\u003E\u003Cp\u003EBasically, it\u0027s even less viable than a space elevator.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-05-31T14:23:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EWe had a huge discussion on the subject already, but I guess it was eaten by the forum kraken.\u003Cp\u003EA launch loop is a 4000km long 5cm wide bicycle cable that runs inside a sheath at 14000km/s, which is equivalent to the fastest man-made object ever made (Voyager 1 is travelling at 17km/s). Due to the mass of the cable, thousands of tons, the energy involved is tremendous.\u003C/p\u003E\u003Cp\u003EThe sheath has to maintain a perfect vacuum, because if any air leaked into the system, the friction would melt the cable and the system would explode. If any of the magnets fails, the cable touches the sheath and cause the whole thing to burn up and explode. If any temperature variations along the 2000km loop cause either the sheath or the cable to dilate or retract, even slightly, there will be slack or breakage, and it will explode.\u003C/p\u003E\u003Cp\u003EBut the biggest issue is that there is no known way to raise or lower the cable or to stop it for maintenance, and the engineering problems involved in building hundreds of platforms on the oceanic seabed and assembling the cable is huge.\u003C/p\u003E\u003Cp\u003EBasically, it\u0027s even less viable than a space elevator.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E-snip-\u003C/p\u003E\u003Cp\u003ESure there are issues to iron out with a launch loop. However, its main advantage over a space elevator is that is can be made using modern materials, and is a lot cheaper. \u003C/p\u003E\u003Cp\u003EI would be willing to bet this method would be constructed before a space elevator on Earth. That is to say if we don\u0027t find a more economical traditional rocket to get us into space, by the time humanity is ready to actually become a space faring species, we\u0027ll build a launch loop.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-01T00:14:15Z\u0022 title=\u002206/01/2013 12:14  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 1, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-05-31T14:35:42Z","Content":"\n\u003Cp\u003E- snipped -\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-01T00:17:27Z\u0022 title=\u002206/01/2013 12:17  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 1, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-31T14:43:57Z","Content":"\n\u003Cp\u003EInteresting in concept, pointless in practice. The engineering difficulties of this and similar designs (including space elevator-type designs) render it impractical. It is large, expensive, and not robust against failure; the potential savings are far out-weighed by the costs of actually building the thing. Further, the potential savings will vanish in the near future; rockets may be expensive today, but they will not remain so indefinitely.\u003C/p\u003E\u003Cp\u003EWhile ideas like these are fun to contemplate, it\u0027s very difficult to beat the advantages potentially offered by reusable rockets: cost effectiveness, distributed modular launch capability, and the system as a whole is robust against failures of single components. SSTOs, should they become a thing (and they probably will) will render launch loops and elevators obsolete. Why take a train when you can fly?\u003C/p\u003E\u003Cp\u003E-snip-\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-01T00:17:38Z\u0022 title=\u002206/01/2013 12:17  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 1, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2013-05-31T15:13:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Phoenix Aerospace\u0022 data-cite=\u0022Phoenix Aerospace\u0022\u003E\u003Cdiv\u003EIf the linear induction system fails, particularly in the unstable turnaround sections, the rotor may collide with the stator. Due to the accumulated kinetic energy, this would release roughly 1.5 petajoules of energy; roughly equvalent to the detonation of a nuclear weapon.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA failure mode which leads to that much energy release near a shipping hub would seem to render it non viable...\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-05-31T15:29:22Z","Content":"\n\u003Cp\u003E-snip- concepts like this (like giant railguns, space elevators, balloons to orbit, and so on...) have been floating around for decades, yet nobody is building them, because I\u0027m not the only one who thinks they are ont viable or practical. \u003C/p\u003E\u003Cp\u003EOn the other hand, a lot of people on this forum wear pink-tinted glasses. Many of us are young, somewhat inexperienced, and have been raised on science fiction. Now, Star Trek is fun, with warp drives, time travel, and teleportation, but real-life constraints and physics say that it\u0027s not reasonable to expect these to happen any time soon.\u003C/p\u003E\u003Cp\u003EPowerpoint presentations are easy. Real engineering is hard. Some concepts look appealing in theory but are hard to actually build because all sorts of petty real-life concerns crop up when you want to convert theory into a robust operational system. You know, stuff like money, politics, weather, patents, regulations, maintenance, human resources...\u003C/p\u003E\u003Cp\u003EI\u0027d love to see someone come up with a cheap and feasible way to put people and stuff into orbit. However, handwaving the problems that I raised away by calling them naysaying doesn\u0027t make them go away and certainly doesn\u0027t provide an decent answer to those issues.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-01T00:18:07Z\u0022 title=\u002206/01/2013 12:18  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 1, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-31T15:48:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EA launch loop is a 4000km long 5cm wide bicycle cable that runs inside a sheath at 14000km/s, which is equivalent to the fastest man-made object ever made (Voyager 1 is travelling at 17km/s).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow that I\u0027m actually thinking about this, I wonder if it\u0027s not possible to change the design to render it more robust against the specific failures that you mentioned.\u003C/p\u003E\u003Cp\u003EWhat\u0027s actually keeping the outer shell up is the magnetic coupling between it and the interior cable - but there\u0027s no actual need for the interior to be a solid capable. It\u0027s the angular momentum that\u0027s keeping the whole structure supported, and that could be just as easily achieved by a particle beam (or a bunch of tennis balls, or whatever) with the same mass as long as you could keep it aimed down the center of the tube. That would resolve the worst of the problems caused by flexing or thermal expansion/contraction and in the event of failure possibly allow you to distribute the energy around the entirety of the ring rather than concentrating most of it as the point of failure. Of course, now you\u0027re left with the problem of building a 4000km long flexible particle accelerator, and if you can do that I\u0027ve got a whole lot of more important things to use it for than launching stuff into orbit.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-05-31T15:59:07Z","Content":"\n\u003Cp\u003ESo let me get this straight. You move something back and forth... on Earth... until it reaches orbital velocities... then release it?\u003C/p\u003E\u003Cp\u003E\u0022Look, mommy! That train is on fire!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-31T16:24:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EYou move something back and forth... on Earth... until it reaches orbital velocities... then release it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. That\u0027s not how it works. Reread the design specs.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-05-31T16:37:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI might be wrong 99% of the time, but concepts like this (like giant railguns, space elevators, balloons to orbit, and so on...) have been floating around for decades, yet nobody is building them, because I\u0027m not the only one who thinks they are ont viable or practical.\u003Cp\u003EOn the other hand, a lot of people on this forum wear pink-tinted glasses. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EPeople have heard that many times from you. Nah, it can\u0027t be done, nah, too difficult, nah, physics ( always in general, never saying in detail why not ) , nah this, nah, that. Always dismissing things right out of the bat.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EAs I said in another thread. Who wants, seeks ways, who does not want, seeks reasons.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EAnd, seems to me, you are all about seeking reasons why not.\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2013-05-31T16:37:42Z","Content":"\n\u003Cp\u003ESomething this big that even has a slight possibility of a total catastrophic failure will never be built. If you lose a rocket it\u0027s a bad day. If you have a massive international construction project that would take years to produce suddenly flies apart it\u0027s not like \u0022oops chain snapped.... okay guys, lets set it back up again for another go\u0022\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-05-31T16:42:16Z","Content":"\n\u003Cp\u003E*re-reads OP*\u003C/p\u003E\u003Cp\u003EHow would you attach the payload? He said you turn it on first, and I assume that this thing would be electrified and moving fast enough to tear off limbs.\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2013-05-31T16:47:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003E*re-reads OP*\u003Cp\u003EHow would you attach the payload? He said you turn it on first, and I assume that this thing would be electrified and moving fast enough to tear off limbs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaglev. I think the concept is just how to build a massive rail system. The actual launch vehicle just rides it as if were a static track (it being metal).\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2013-05-31T16:47:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003E*re-reads OP*\u003Cp\u003EHow would you attach the payload? He said you turn it on first, and I assume that this thing would be electrified and moving fast enough to tear off limbs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EElectromagnetic induction - the payload hangs off the sheath, and electro magnets set up an induction effect in the moving core that provides traction. Varying the electromagnet power will adjust the force provided, allowing for a controlled pick-up of traction *IF* somebody can work out the details of doing so in such a way as to not cause destructive oscillations in the moving core!\u003C/p\u003E\n"},{"CreatedByName":"SuperFastJellyfish","CreatedById":57985,"CreatedDateTime":"2013-05-31T17:00:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003E*re-reads OP*\u003Cp\u003EHow would you attach the payload? He said you turn it on first, and I assume that this thing would be electrified and moving fast enough to tear off limbs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure it\u0027s a mag-lev setup. It would be moving a little faster than tear-off-limbs speed. 31,000mph, if I remember the wiki\u0027s number correctly. A 2km long, solid metal cable moving at orbital velocity suspended inside a vacuum sheath...yeah, that\u0027s a lot of energy and totally impractical.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-31T17:01:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022softweir\u0022 data-cite=\u0022softweir\u0022\u003E\u003Cdiv\u003EJust because it is less impossible than a space elevator does not make it plausible or realistic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, I disagree that the launch loop is less impossible than a space elevator. The engineering challenges for a launch loop are significantly greater. All an elevator really needs is a large quantity of material with a sufficiently high tensile strength and a way to put that quantity of material into orbit. We even have candidate materials existing (carbon nanotubes may work), but lack the infrastructure to manufacture, launch and assemble the thing (space elevators are a chicken-and-egg problem; by the time you have the capability of putting one into orbit, you\u0027ve solved the problem of getting to orbit cheaply).\u003C/p\u003E\u003Cp\u003ELaunch loops, on the other hand, require a whole slew of technical capabilities we do not possess: high temperature light weight super conductors; materials of sufficient strength - requirements in this regard may be greater than even those for an elevator; efficient transmission of power along the whole 4000km length; and a whole slew of others. The problem of failsafing the device boggles the mind - I cannot even imagine how one would go about it.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-05-31T17:02:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ewe can\u0027t create a sheath that long that is air-tight\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe only difference between several km of sealed tube and a few thousand kilometers of sealed tube is cost nothing more. And I would add, that our particle colliders need ultra high vacuum. for this, normal vacuum would be enough.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ewe can\u0027t create electromagnets light enough and powerful enough\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, right, that\u0027s why the LHC was never built \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ewe can\u0027t build any of this in such a way as to be maintenance-free (which they would need to be),\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyeah right, that is why the LHC that has never been built because of your point 1 and 2 needs thousands of workers inspecting and repairing the magnets each day \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2013-05-31T17:05:17Z","Content":"\n\u003Cp\u003EThe LHC doesn\u0027t fall 80KM into the ocean when you turn it off.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-05-31T17:11:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe LHC doesn\u0027t fall 80KM into the ocean when you turn it off. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe LHC did actually blow apart a segment of it because of superconductor failure. And in worst case scenario can damage itself beyond repair in case of sudden catastrophic failure.\u003C/p\u003E\u003Cp\u003EAnd fall into ocean per se is not a big deal. parachutes and stuff.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-31T17:12:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MBobrik\u0022 data-cite=\u0022MBobrik\u0022\u003E\u003Cdiv\u003EYeah, right, that\u0027s why the LHC was never built\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you have a viable plan for turning the LHC into a system capable of launching payloads into orbit, please let me know. After all, now that the Higgs has been discovered, we need to find a use for it.\u003C/p\u003E\n"}]}