{"TopicId":32933,"ForumId":44,"TopicTitle":"Water core like Naboo?","CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-06-14T11:15:30Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-06-14T11:15:30Z","Content":"\n\u003Cp\u003ESetting aside all the hatred of the Star Wars prequels, would it be possible to have a planet with solid ground but a lot of water as well and a core filled with water, like in the Phantom Menace on Naboo. I\u0027m guessing no, unless the elements and compounds making up the ground were mostly less heavy than water, which seems unlikely to happen.\u003C/p\u003E\n"},{"CreatedByName":"TheZofDeath","CreatedById":57344,"CreatedDateTime":"2013-06-14T11:39:29Z","Content":"\n\u003Cp\u003EI\u0027m not really sure at all, mainly just random guessing so don\u0027t quote me on anything, but I think that the planet would need to form normally, and then be structurally strong enough to withstand it being hollowed out somehow and filled with water. Maybe some sort of rock that makes up a large part of the planet that reacts with water as a catalyst to release hydrogen and oxygen to form water. Again, making up wild guesses from the top of my head here. \u003C/p\u003E\u003Cp\u003ESay if the water does in fact make up the core of a planet, then one thing I know for sure is that it won\u0027t have a molten core (unless you count water being molten ice \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E), so there will be no magnetic field, which I\u0027m fairly sure is necessary for life, something about radiation or particles from the sun I think. \u003C/p\u003E\u003Cp\u003ESo assuming I\u0027ve got stuff right, which I really don\u0027t know in the first paragraph bit, you could have a water core, but not life like on Naboo. Maybe if the planet had a normal core, but massive cavern systems filled with water around it.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-06-14T12:05:55Z","Content":"\n\u003Cp\u003EThe pressure in the core is too great. No known material could withstand it and remain solid, so it would move towards the center and squeeze out all the water to the surface, even if the core was made of titanium or diamond...\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-06-14T12:13:34Z","Content":"\n\u003Cp\u003EYes, the pressure and heat is so high it even causes atoms to break down and some fission occurs at the center of even Earth size planets.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-06-14T12:24:35Z","Content":"\n\u003Cp\u003Efrom what I remember of that movie, the planet just has large underwater oceans and caves. Probably far larger than can be sustained on a planet that size (the supporting walls and roofs would need to be far too massive) but not theoretically impossible in principle.\u003C/p\u003E\u003Cp\u003ESo you\u0027d end up with a large structure of caverns, each say several dozen miles high and having a floorspace of several hundred to several thousand square miles, caverns roughly the size of the Yellowstone basin and taller/deeper than Everest would be needed to support the large predators shown in the movie.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-06-14T12:32:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Efrom what I remember of that movie, the planet just has large underwater oceans and caves. Probably far larger than can be sustained on a planet that size (the supporting walls and roofs would need to be far too massive) but not theoretically impossible in principle.\u003Cp\u003ESo you\u0027d end up with a large structure of caverns, each say several dozen miles high and having a floorspace of several hundred to several thousand square miles, caverns roughly the size of the Yellowstone basin and taller/deeper than Everest would be needed to support the large predators shown in the movie.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI say core because they say that they need to go through the planet core to get to the city.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-06-14T12:33:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Efrom what I remember of that movie, the planet just has large underwater oceans and caves. Probably far larger than can be sustained on a planet that size (the supporting walls and roofs would need to be far too massive) but not theoretically impossible in principle.\u003Cp\u003ESo you\u0027d end up with a large structure of caverns, each say several dozen miles high and having a floorspace of several hundred to several thousand square miles, caverns roughly the size of the Yellowstone basin and taller/deeper than Everest would be needed to support the large predators shown in the movie.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the movie explicitly mentions that they have to go through the core of the planet...\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-06-14T12:44:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EBut the movie explicitly mentions that they have to go through the core of the planet...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere was a lot of rock below all that water though. I\u0027m not sure if that line was really accurate judging from their surroundings.\u003C/p\u003E\n"},{"CreatedByName":"Quickfire","CreatedById":70208,"CreatedDateTime":"2013-06-14T12:50:34Z","Content":"\n\u003Cp\u003EIn theory, It is possible, however some form of sentient species would have to build it as planets form from planetoids, which form rocky space debris, etc,etc.\u003C/p\u003E\u003Cp\u003EIt\u0027s center of gravity would have to be at the centre, and to prevent water fusing under this pressure, you would have to \u0027pulse\u0027 the entire planet with an intense pressure wave every second or two, creating massive fluctuations which would prevent nuclear fusion occuring. This could be acheived by having about ten moons with highly elliptical orbits with huge masses, and time them to create these fluctuations. That project would be a bit of a waste of a few millennia ^^. Any questions?\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-06-14T12:54:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003EThere was a lot of rock below all that water though. I\u0027m not sure if that line was really accurate judging from their surroundings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInaccurate? A Star Wars movie? Do you mean to say that the Millenium Falcon CAN\u0027T make the Kessel Run in less than twelve parsecs? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-06-14T12:55:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003EThere was a lot of rock below all that water though. I\u0027m not sure if that line was really accurate judging from their surroundings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, it didn\u0027t really make sense that there was light either (barring some sort of bioluminescent light source), although I think the rock \u0022below\u0022 was just our perspective, they were going straight down and then up. Supposedly Naboo is the size of Earth, so obviously there\u0027s a lot of the travel time we didn\u0027t see where they could have rock above, below, next to them etc.\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2013-06-14T12:59:29Z","Content":"\n\u003Cp\u003ENo. A very basic reason is that water would have to be the densest material on the planet to form like that. But then if you add in pressure associated with it, that theoretical planet breaks down too.\u003C/p\u003E\n"},{"CreatedByName":"Dockillar","CreatedById":69914,"CreatedDateTime":"2013-06-14T13:01:46Z","Content":"\n\u003Cp\u003EAbsolutely not, or, for at least if life were to florish on a place like Naboo, why? Because, Earth supports a magnetic field the protects us from deadly radiation, and that field is supported by a dense, liquid and solid mostly iron core. If a planet were to have a water core, volcanism, stable gravity and many other imporant features that keep life in the past and today going would be impossible, and all life on Earth or Naboo would literally be COOKED under this radiation, or, just float into space therefore making life on Naboo, physically impossible...\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-06-14T13:13:00Z","Content":"\n\u003Cp\u003EOh, well here\u0027s what the Star Wars wiki says about it. Is it all nonsense? I can\u0027t tell. \u003Ca href=\u0022http://starwars.wikia.com/wiki/Naboo\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://starwars.wikia.com/wiki/Naboo\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-06-14T13:16:37Z","Content":"\n\u003Cp\u003EOn planetary scales, \u0022rock\u0022 is a fluid. Rock is heavier than water, so it will flow to the bottom.\u003C/p\u003E\u003Cp\u003EIf you tried to build a planet like Naboo, you would very quickly find that the walls of the underwater caves would melt and collapse to fill the available space, producing a lot of steam and a very, very large volcanic eruption. This eruption would likely extinguish all life on the planet\u0027s surface - including a certain Gungan - making realistic physics the best gift George Lucas could have possibly given us with respect to episode one.\u003C/p\u003E\n"},{"CreatedByName":"Hooligan Labs","CreatedById":45359,"CreatedDateTime":"2013-06-14T13:18:06Z","Content":"\n\u003Cp\u003EA quick Google search seems to reveal that Naboo has a \u0022plasma core\u0022 which the Abyss reaches. A planet\u0027s molten magnetic core could be considered plasma, and having water access to it would make for easier mining and export. However, I would expect that the water would be extremely dense and hot.\u003C/p\u003E\u003Cp\u003EMeanwhile, scientists do believe planets entirely of water may exist...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://gizmodo.com/5887003/hubble-discovers-a-new-type-of-world-made-of-water\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gizmodo.com/5887003/hubble-discovers-a-new-type-of-world-made-of-water\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESaturn has such low density that it actually would float in a big enough body of water.\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-06-14T19:21:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EInaccurate? A Star Wars movie? Do you mean to say that the Millenium Falcon CAN\u0027T make the Kessel Run in less than twelve parsecs? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpeaking of which, WHY has nobody made a millenium falcon with the cupola?\u003C/p\u003E\n"},{"CreatedByName":"Hooligan Labs","CreatedById":45359,"CreatedDateTime":"2013-06-14T19:28:51Z","Content":"\n\u003Cp\u003EYou have no-one to blame but yourself. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-06-14T19:31:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EInaccurate? A Star Wars movie? Do you mean to say that the Millenium Falcon CAN\u0027T make the Kessel Run in less than twelve parsecs? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt can\u0027t, Han was just saying that to see how much he could scam those suckers out of \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-06-14T20:06:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EInaccurate? A Star Wars movie? Do you mean to say that the Millenium Falcon CAN\u0027T make the Kessel Run in less than twelve parsecs? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Epeople always seem to think it\u0027s a measure of time as intended by Han, but what if he knows full well what he\u0027s saying and he means he\u0027s found a shortcut (maybe through that dense asteroid field where they later encounter that space slug, or an area like that where larger ships can\u0027t go) and that\u0027s what astounds the listeners?\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-06-15T00:43:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Epeople always seem to think it\u0027s a measure of time as intended by Han, but what if he knows full well what he\u0027s saying and he means he\u0027s found a shortcut (maybe through that dense asteroid field where they later encounter that space slug, or an area like that where larger ships can\u0027t go) and that\u0027s what astounds the listeners?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EArguments like this make even less sense than just owning up to the fact that George Lucas and Harrison Ford got the meaning of parsec wrong, because saying \u0022he found a shortcut\u0022 badly, badly underestimates the scale of the distances involved. At the scale of twelve parsecs, the only shortcut is a straight line. Minor course corrections to deviate around an asteroid field - or even the entire star system containing the asteroid field - will be nearly immeasurable come journey\u0027s end.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-06-15T01:09:00Z","Content":"\n\u003Cp\u003EA while ago, there was a thread on the science labs here asking what the deepest possible ocean was, and If I recall somebody worked it out to about 220 km on the surface of any planet with 1G of surface gravity and 1 atmosphere of pressure on top of the water. As the depth increases linearly, the temperature needed to keep it liquid increases exponentially. So, there is an asymtote at about 220 km. Now, if the planet was composed entirely of water, it would obviously have a different depth. A ball of water with a diameter of 440 meters would have considerably less gravity than earth, but without sufficient gravity at the surface, the water would evaporate into space. Furthermore, higher temperatures can support liquid at greater pressures, but would also contribute to evaporation at the surface. Needless to say it\u0027s a pretty complex problem to solve.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-06-15T02:10:29Z","Content":"\n\u003Cp\u003EI could imagine having a small ice dwarf planet or Planetoid where at some point towards the center of the planet the pressure and heat would be enough to have a liquid center.\u003C/p\u003E\u003Cp\u003EI\u0027d imagine that 440km diameter would still be it\u0027s maximum size.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-06-15T02:28:07Z","Content":"\n\u003Cp\u003EAn all-water planet would have a solid interior because water is a solid at the kinds of pressures you find inside a planet-sized body. See a water phase diagram. And when I say solid water, I do not mean ice as you know it...this solid water would have a different crystal structure and density than the ice you know, and it requires pressure to form...not low temperature. No, the pressures are not going to be great enough to cause thermonuclear fusion or anything like that...you\u0027d need a much more massive object for that to happen. The interior of an all-water planet would not be as hot as the Earth\u0027s interior because the all-water world lacks the things that made the inside of the Earth hot (radioactive elements and the differentiation of heavy elements into the center).\u003C/p\u003E\u003Cp\u003EBecause of the lower density of water (even in the interior solid phases) compared to the materials that make up the Earth, an all-water planet the mass of the Earth would be larger in diameter and have a lower surface gravity than the Earth does.\u003C/p\u003E\u003Cp\u003EDepending on the surface temperature (distance from its star and what kind of star it circles) the all-water planet would have a water vapor atmosphere which may also contain oxygen (if the star is hot enough to emit enough photons with sufficient energy to photodissociate water molecules). Any hydrogen from the dissociation would rapidly escape.\u003C/p\u003E\u003Cp\u003EI suspect that the planet would not have a strong magnetic field. Although impure water is a good conductor and can participate in a dynamo effect, the all-water planet would lack the important convection currents in the core that Earth has because liquid iron is \u0022freezing out\u0022 into solid iron, releasing energy, at the boundary of the inner and outer core.\u003C/p\u003E\n"}]}