{"TopicId":34285,"ForumId":44,"TopicTitle":"Did you knew that Poland was the only eastern block country that Broadcast Apollo 11","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2013-06-22T15:25:06Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2013-06-22T15:25:06Z","Content":"\n\u003Cp\u003EFrom what I know of my country, Poland was the only country in the Eastern bloc, which showed live landing and Neil Armstrong\u0027s first words on the moon. \u003C/p\u003E\u003Cp\u003EMy mother told me that the landing on the moon watching with her sister my aunt, because she had tv, apparently the whole family and neighbors gathered at my aunt\u0027s small apartment to watch the first landing on the moon. \u003C/p\u003E\u003Cp\u003EI once watched an interview with the old journalists, our Polish public television. Apparently, the head of the Polish Television, BTW dedicated communist, in the 60\u0027s decided that TVP will broadcast the Apollo 11 landing despite the strong objections of our beloved neighbor, the Soviet Union. \u003C/p\u003E\u003Cp\u003EThe guy then he lost his job, is still working on TV but not as a director. \u003C/p\u003E\u003Cp\u003EApparently he said that landing on the moon is too great events in human history to not be broadcast, and that he will not deprive Polish viewers of the event, because Soviets inferiority complex. Making Poland only Eastern Block country that made live broadcast of Apollo 11\u003C/p\u003E\n"},{"CreatedByName":"John Nowak","CreatedById":67890,"CreatedDateTime":"2013-06-24T00:17:59Z","Content":"\n\u003Cp\u003EThat\u0027s a fascinating bit of history.\u003C/p\u003E\n"},{"CreatedByName":"ajshell1","CreatedById":24132,"CreatedDateTime":"2013-06-25T01:28:01Z","Content":"\n\u003Cp\u003EI like interesting facts like these. You\u0027ve just made my evening a bit better.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2013-06-25T02:11:30Z","Content":"\n\u003Cp\u003EI seem to remember my parents telling me they saw Apollo 11 on TV in Romania back then. So I don\u0027t think Poland was the only Eastern block country to broadcast it.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-06-25T02:13:54Z","Content":"\n\u003Cp\u003EDid not know that. But i wasn\u0027t really surprised if you know what i mean.\u003C/p\u003E\n"}]}