{"TopicId":35417,"ForumId":44,"TopicTitle":"What does alien lifeforms breath?","CreatedByName":"Inspector Gadget","CreatedById":62884,"CreatedDateTime":"2013-06-30T20:49:47Z","PageNum":1,"Articles":[{"CreatedByName":"Inspector Gadget","CreatedById":62884,"CreatedDateTime":"2013-06-30T20:49:47Z","Content":"\n\u003Cp\u003EI have heard many discussions to what conditions would be equal for every lifeform and which would differ and I\u0027ve come to a few conclusions:\u003C/p\u003E\u003Cp\u003EAll lifeforms will be carbon based.\u003C/p\u003E\u003Cp\u003ELife forms can have many substitutes for water (f.x. liquid methan)\u003C/p\u003E\u003Cp\u003EBut I was thinking, what kind of atmosphere could different lifeforms breath? I know that earth animals needs oxygen in their respiratory system. Plants use photosynthesis and needs carbondioxide which takes more energy so they stay still, which caused them to develop into what they are. Some bacteria breath nitrogen. But is there any environments were this proces could be chanched so that f.x. animals breathed nitrogen, plants breathed oxygen and bacteria breath carbondioxide. Or maybe breath something completily different?\u003C/p\u003E\u003Cp\u003EPlease leave a reply explaining this and maybe come with some good links.\u003C/p\u003E\u003Cp\u003EAlso: What other alternatives is there for water? (I\u0027ve been looking around but I can\u0027t find a complet list)\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-06-30T21:00:07Z","Content":"\n\u003Cp\u003EVery early Earth animal life didn\u0027t use oxygen as it was not yet available, oxygen was a waste product (and a toxic one) of other life at the time, particularly of plants which still excrete oxygen (though most plants use oxygen at night)\u003C/p\u003E\u003Cp\u003ELater, life evolved that could make use of the oxygen, they had an advantage over other creatures as they could metabolize much faster, and non-oxygen using animal life just couldn\u0027t compete.\u003C/p\u003E\u003Cp\u003EThe stuff around deep sea vents though, they still don\u0027t use oxygen as it\u0027s not available, instead they metabolize sulfur.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-06-30T21:07:48Z","Content":"\n\u003Cp\u003EWe know of a lot of organisms on Earth that don\u0027t \u0027breathe\u0027 oxygen. They use sulfur, nitrates, iron, uranium instead of oxygen. See \u003Ca href=\u0022https://en.wikipedia.org/wiki/Anaerobic_respiration\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Anaerobic_respiration\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhat an organism breathes would depend on it\u0027s life chemistry. For example, If an organism used liquid methane instead of water (as you mentioned), I very much doubt that it would breathe oxygen, since the oxygen and the methane would react violently with each other. \u003C/p\u003E\u003Cp\u003EOne of the possible substitutes for water might be liquid ammonia.\u003C/p\u003E\n"},{"CreatedByName":"xclusiv8","CreatedById":20567,"CreatedDateTime":"2013-06-30T23:02:53Z","Content":"\n\u003Cp\u003ELife will evolve to use whatever is around.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-07-01T01:32:46Z","Content":"\n\u003Cp\u003EActually, as far as we know, all life form may not be necessarily carbon based. Technically, silicon based life forms could exist, using liquid nitrogen as a cellular solvant instead of water. They\u0027d live at very low temperatures and have a really slow life cycle, but could potentially exist.\u003C/p\u003E\n"},{"CreatedByName":"deathbane","CreatedById":64268,"CreatedDateTime":"2013-07-01T02:32:05Z","Content":"\n\u003Cp\u003Ewell speaking of silicon based life.\u003C/p\u003E\u003Cp\u003Eif humans ever created A.I would that in its self be consiterd silicon base life\u003C/p\u003E\n"},{"CreatedByName":"Redjoker","CreatedById":68444,"CreatedDateTime":"2013-07-01T02:55:49Z","Content":"\n\u003Cp\u003EBut it wouldn\u0027t really be silicon based life. Silicon has almost the same bonding properties as carbon which allows it to form carbon-like chains and in theory life.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-07-01T03:34:10Z","Content":"\n\u003Cp\u003Eall depends on your definition of life... As long as we don\u0027t agree on that, we of necessity can\u0027t agree on what it\u0027d eat, breathe, excrete, and be actually made of.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-07-01T05:54:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redjoker\u0022 data-cite=\u0022Redjoker\u0022\u003E\u003Cdiv\u003EBut it wouldn\u0027t really be silicon based life. Silicon has almost the same bonding properties as carbon which allows it to form carbon-like chains and in theory life.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that was partially a joke. You know, because of silicon chips.\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2013-07-15T21:14:13Z","Content":"\n\u003Cp\u003EOxygen cycle, that is Food(carbon-carbohydrates)\u002BOxygen=CO2\u002BH2O\u002Benergy, is pretty dam energy productive. The only thing that might beat it is Chlorine or Fluorine but those molecules are so reactive and much less abundant then oxygen its difficult imagine a planet that could support such a corrosive and exotic atmosphere. \u003C/p\u003E\u003Cp\u003EHydrogen could be used in reverse of oxygen: Food\u002Bhydrogen=CH4\u002BH2O but this process is far less energy productive. Animal life in a hydrogen cycle biosphere is not as likely, at least not very active animal life, also the planet has got to be at least a super earth or even a gas giant to have enough gravity to hold on to all that hydrogen gas. \u003C/p\u003E\u003Cp\u003EH2S, Sulfur, SO2, SO3, SO4 could provide molecular energy, but some of these molecules have poor gaseous properties (or non-existent, limiting life to water) and again energy returns are inferior to oxygen. If there is life under the ice of Europa I would bet its utilizes a sulfur cycle, but again sulphur is not something you can breath, not in air, but in water in dilute concentrations. \u003C/p\u003E\u003Cp\u003EThere are really no other probable gases life could utilize, CO2 and N2 are always going to consume energy to \u0022react\u0022 with carbon compounds, only oxygen, hydrogen or halogens are going to provide energy. Of course life that not carbon based could get around this with something radical, but its very hard to saw how probable such life is.\u003C/p\u003E\u003Cp\u003ENH3 (ammonia) could possible be used other then H2O, put ammonia has inferior solvent property to water and worse is not energetically stable, with N2 and H2 being what it decays to over millions of years from exposure to heat, lightning and solar radiation. Again in a hydrogen atmosphere ammonia might be more common, but water is likely to be the dominate solvent none the less.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-16T00:08:45Z","Content":"\n\u003Cp\u003EI\u0027m sure somewhere in the Universe group of Silicoids right now is laughing at ridiculous idea of life existing on the planets with such toxic and corrosive substances as water and *gasp* free oxygen. Not to mention freezing temperatures. Do not anthropomorphise guys. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2013-07-16T00:37:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EI\u0027m sure somewhere in the Universe group of Silicoids right now is laughing at ridiculous idea of life existing on the planets with such toxic and corrosive substances as water and *gasp* free oxygen. Not to mention freezing temperatures. Do not anthropomorphise guys. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know, if there is natural silicon life out there I would guess it lives under extreme pressures and temperatures high enough to melt lead in order to have interesting complex silicon chemistries that are too stable to occur in our conditions, probably has liquid metals as its blood or even breaths molten aluminium! Our conditions would seem quite balmy by comparison: \u0022Bags of mostly water!\u0022\u003C/p\u003E\u003Cp\u003EAnyways before I was stating what is possible, oxygen pretty dam the best your going to get naturally as a gaseous oxidizing agent (hydrogen is the inverse), Chlorine or Fluorine maybe, but those are hard to imagine being stable because of how incredibly corrosive those are, yeah sure we really have not seen enough to say that does not happen ever in this huge universe or to put reliable odds on it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-16T00:42:58Z\u0022 title=\u002207/16/2013 12:42  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 16, 2013\u003C/time\u003E by RuBisCO\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-07-16T01:02:45Z","Content":"\n\u003Cp\u003EBroadly speaking, the two main types of atmospheres are \u0022oxidizing\u0022 and \u0022reducing\u0022\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Reducing_atmosphere\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Reducing_atmosphere\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-07-16T01:15:44Z","Content":"\n\u003Cp\u003EHell, if we ever find alien higher life forms, we don\u0027t even know if they breathe. Could be space ships filled with dolphins (space dolphins) in tanks\u003C/p\u003E\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2013-07-16T10:49:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EI\u0027m sure somewhere in the Universe group of Silicoids right now is laughing at ridiculous idea of life existing on the planets with such toxic and corrosive substances as water and *gasp* free oxygen. Not to mention freezing temperatures. Do not anthropomorphise guys. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou read too much scifi my friend. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-18T19:13:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KOCOUR\u0022 data-cite=\u0022KOCOUR\u0022\u003E\u003Cdiv\u003EYou read too much scifi my friend. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eno offense man you would understand this if you had tried sci-fi because it is really just science being put to the limits with imagination and if you want a glimpse of what it would be like for another life form that thinks it is ridiculous for oxygen breathing lifeforms to exists try reading a book called wheelers then you will reconsider what you had said\u003C/p\u003E\n"},{"CreatedByName":"Charzy","CreatedById":440,"CreatedDateTime":"2013-07-18T19:29:32Z","Content":"\n\u003Cp\u003EOr just read Report on Planet Three. One of the first chapters has the Martians mocking people who could consider life to exist on a such a toxic planet, with an atmosphere shielding life from the vital radiation it needs and strange and destructive phenomena such as \u0022fire\u0022.\u003C/p\u003E\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2013-07-19T06:50:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Helix935\u0022 data-cite=\u0022Helix935\u0022\u003E\u003Cdiv\u003Eno offense man you would understand this if you had tried sci-fi because it is really just science being put to the limits with imagination and if you want a glimpse of what it would be like for another life form that thinks it is ridiculous for oxygen breathing lifeforms to exists try reading a book called wheelers then you will reconsider what you had said\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell my friend, \u003C/p\u003E\u003Cp\u003EI read Scifi, a lot of it. My first Scifi book was some russian SCIFI novel composition, since then i ceased to read normal literature as it was not so interesting for me anymore. The thing is that as i love Scifi, i am avare that it is just stories, and i do not take anything of it seriously. So reading another will not make me reconsider anything, but thanks for the tip.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh and last 15 years i participate as one of the organizators of one of the biggest science fiction,fantasy and horror convention in central europe. so you can easily call me scifi fan.\u003C/p\u003E\n"},{"CreatedByName":"pyrosheep","CreatedById":74479,"CreatedDateTime":"2013-07-19T10:32:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EI\u0027m sure somewhere in the Universe group of Silicoids right now is laughing at ridiculous idea of life existing on the planets with such toxic and corrosive substances as water and *gasp* free oxygen. Not to mention freezing temperatures. Do not anthropomorphise guys. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Esurely it would be anthropomorphising to suggest that these hypothetical extraterrestrials would have the same worries about potential alien life in the universe?\u003C/p\u003E\u003Cp\u003E(first post ;D)\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-07-22T11:10:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Helix935\u0022 data-cite=\u0022Helix935\u0022\u003E\u003Cdiv\u003Eno offense man you would understand this if you had tried sci-fi because it is really just science being put to the limits with imagination and if you want a glimpse of what it would be like for another life form that thinks it is ridiculous for oxygen breathing lifeforms to exists try reading a book called wheelers then you will reconsider what you had said\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Enope. While SOME SciFi extrapolates more or less logically from what is known based on what can within reason be expected to become known, a lot of it is just space junk and so distanced from actual science it hardly deserves to be called SCIENCE fiction.\u003C/p\u003E\u003Cp\u003EIt\u0027s just magic masquerading as engineering. Laser cannon wielding space ships instead of fire breathing dragons, computer brains coming up with engineering solutions to impossible situations instead of magicians casting spells, etc. etc.\u003C/p\u003E\u003Cp\u003EAnd yes, I read and greatly enjoy SciFi, but a lot of it also greatly annoys me because of the often paper thin plots, deus ex machina like resolutions, and generally poor writing.\u003C/p\u003E\u003Cp\u003EIn that it\u0027s little different from most other fiction.\u003C/p\u003E\n"}]}