{"TopicId":37752,"ForumId":44,"TopicTitle":"Is it at all possible there was a civilised species on Earth long before humans?","CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-07-19T16:41:14Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-07-19T16:41:14Z","Content":"\n\u003Cp\u003EBy civilised, I mean enough to develop language, social structure, infrastructure and tools.\u003C/p\u003E\u003Cp\u003EIt\u0027s a question that popped into my head recently, it would be a remarkable discovery, if we found evidence of such a civilisation. It seems we should have perhaps found it, but if there were few of them or if they didn\u0027t do much crafting of lasting things like rock, perhaps the ruins of time could have removed all evidence of their existance...\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2013-07-19T16:48:41Z","Content":"\n\u003Cp\u003EPossible? Certainly. There is absolutely no evidence to support an argument that suggests that a species could not have had language, social hierarchy, and tools. \u003C/p\u003E\u003Cp\u003EWe do know that there were no reasonable structures, shelters, or graves built by anyone prior to man. That doesn\u0027t mean man was the first species on Earth to have a language.\u003C/p\u003E\u003Cp\u003EI will say, however, that it is extremely - extremely unlikely that we were not the first civilized species. The reasoning is that large groups of organisms that intelligently organize and form social structures and languages tend to linger around longer than species that do not. The simple act of information sharing makes a species capable of coping with danger. If such a species had existed, it would have had a better chance at surviving the climate changes, predators, and other species-killers than long-living species that are still around today, such as ants or reptile species or mammals. Social species almost always outlive species that are not, and the fact that very few species around today have shown signs of communication capabilities (Elephants, Dolphins, etc) suggests we are the first civilized species.\u003C/p\u003E\u003Cp\u003ESuggests - not proves.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-07-19T16:49:56Z","Content":"\n\u003Cp\u003EWhile it may be possible, since your definition of civilized has only existed for the last 3000 years, and humans have existed for tens of thousands of years... we probably would have found evidence of it by now, as all cultures use things that will stand the test of time (in our case, the brick buildings, and metal skeletons of buildings will last a very long time).\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-07-19T16:52:44Z","Content":"\n\u003Cp\u003EHow many million years do you think a brick building will last? How about a grass hut?\u003C/p\u003E\u003Cp\u003EConsidering the many, many large gaps in the fossil record, the poor preservation of anything about human scale, and low population density of any pre-agricultural civilisation, it\u0027s very much possible.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-07-19T16:56:15Z","Content":"\n\u003Cp\u003EI agree it\u0027s unlikely, though I don\u0027t think it\u0027s entirely impossible for their structures to all be gone, if perhaps they only made them out of wood or stone very rarely, and over millions of years those stone structures have been destroyed by tectonics and weathering. And yes, intelligent creatures are more likely to survive, but a major extinction event could have wiped them out, particularly if they were intelligent, but not building sustainable fallout shelter intelligent.\u003C/p\u003E\u003Cp\u003EAnd yes, I think it\u0027s probably not true, but an interesting scifi idea and distant possibility.\u003C/p\u003E\n"},{"CreatedByName":"DeltaV_","CreatedById":74997,"CreatedDateTime":"2013-07-19T17:04:19Z","Content":"\n\u003Cp\u003EI doubt it, although it\u0027s possible. Surely if anything had existed on a \u0027civilized\u0027 level before us, we\u0027d find \u003Cem\u003Esomething\u003C/em\u003E to clue us in. \u003C/p\u003E\u003Cp\u003EAlso, \u0027ello Kryten.\u003C/p\u003E\n"},{"CreatedByName":"Crush","CreatedById":59094,"CreatedDateTime":"2013-07-19T17:11:30Z","Content":"\n\u003Cp\u003EThere are anthropologists who think that this did indeed happen. The Neanderthals developed tools, but then went extinct and other strains of primates took their place.\u003C/p\u003E\u003Cp\u003EIt is of course debatable if you can call all the different flavors of cavemen different species, or just different races of the same species. The line is pretty blurry in this regard.\u003C/p\u003E\u003Cp\u003ESome anthropologists even go so far and claim that certain indigenous people, like the Aborigines or Inuit, are actually genetically so different from most other humans that they could be considered a different species. That would mean that this planet is actually shared by multiple intelligent species right now. Although this is a topic you should thread lightly on when discussing it, or you soon start to question if \u0022human rights\u0022 actually apply to these people and you start justifying all kinds of atrocities which were committed and are still being committed against them.\u003C/p\u003E\u003Cp\u003EAnthropology is interesting.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-19T17:28:16Z\u0022 title=\u002207/19/2013 05:28  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 19, 2013\u003C/time\u003E by Crush\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-19T17:36:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022westair\u0022 data-cite=\u0022westair\u0022\u003E\u003Cdiv\u003EWe do know that there were no reasonable structures, shelters, or graves built by anyone prior to man. That doesn\u0027t mean man was the first species on Earth to have a language.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s quite possible that the first humans with language were women.\u003C/p\u003E\u003Cp\u003EAnd... neanderthals buried their dead about 130,000 years ago, before modern humans did. Homo habilis constructed and used tools about 2.5 million years ago. Homo erectus a million years ago could control and light fires, build campfires, and probably built semi-permanent shelters.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-19T17:48:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crush\u0022 data-cite=\u0022Crush\u0022\u003E\u003Cdiv\u003ESome anthropologists even go so far and claim that certain indigenous people, like the Aborigines or Inuit, are actually genetically so different from most other humans that they could be considered a different species.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo serious anthropologist thinks this. Homo sapiens migration out of Africa is well supported by archaeological and genetic evidence. The working definition of species --breeding compatibility -- applies to all humans, regardless of geographical origin. And geographical origin, while it does contribute to genetic clustering, only is responsible for an average of about 5% of the genetic difference between any two random individual humans. Humans are actually all remarkably genetically similar. Chimps, for instance, show much greater diversity than we do.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-07-19T20:18:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003E (in our case, the brick buildings, and metal skeletons of buildings will last a very long time).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot as long as you may think Modern man has been around for about 50,000 years. Mankind has been evolving for about 2 million years. \u003C/p\u003E\u003Cp\u003EIf we all disappeared right now, a million years from now, you could find mount rushmore, and the great pyramid of giza, and that\u0027s probably about it, \u003C/p\u003E\u003Cp\u003ENow if you were an archaeologist you could find a lot more and dig up much much more, some of the bronze work of the greeks would will still be around in a million years, bronze is sturdy. Our landfills and cities will show evidence of metal deposits that don\u0027t fit with nature. things like that.\u003C/p\u003E\u003Cp\u003EThose are the things we don\u0027t see in the past.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2013-07-19T21:39:13Z","Content":"\n\u003Cp\u003EVelociraptors. It MUST be!\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-07-19T21:47:01Z","Content":"\n\u003Cp\u003EA small problem--civilization would have a hard time surviving in a pre-human world. For instance:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcS-yXv71sAxiX_1cGlRf63l8vnO_OYc1Csj7OlBZdMI81vjdWba\u0022 alt=\u0022images?q=tbn:ANd9GcS-yXv71sAxiX_1cGlRf63l8vnO_OYc1Csj7OlBZdMI81vjdWba\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou know what that impact caused? Think Eve in KSP, only one trillion times worse.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-19T22:05:30Z","Content":"\n\u003Cp\u003EDNA tests provide support for theory of interracial breeding between Homo sapiens and Homo neanderthalensis. About 4% of DNA found in populations outside of Africa seems to be inherited from Neanderthals. More than that: populations in Asia and Melanesia have traces of genetic material coming from a third Homo species - Denisovans. So, since all three groups could succesfully interbreed, by definitions they were just three races of one species. And certainly our distant ancestors got around a lot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-19T22:11:07Z","Content":"\n\u003Cp\u003E\u0022This is impossible because of this\u0022 does not mean some other \u0022this\u0022 that we have yet to become aware of wouldn\u0027t make it possible.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-07-19T22:39:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moon Goddess\u0022 data-cite=\u0022Moon Goddess\u0022\u003E\u003Cdiv\u003ENot as long as you may think Modern man has been around for about 50,000 years. Mankind has been evolving for about 2 million years. \u003Cp\u003EIf we all disappeared right now, a million years from now, you could find mount rushmore, and the great pyramid of giza, and that\u0027s probably about it, \u003C/p\u003E\u003Cp\u003ENow if you were an archaeologist you could find a lot more and dig up much much more, some of the bronze work of the greeks would will still be around in a million years, bronze is sturdy. Our landfills and cities will show evidence of metal deposits that don\u0027t fit with nature. things like that.\u003C/p\u003E\u003Cp\u003EThose are the things we don\u0027t see in the past.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf humans disappeared today, it would be plenty of evidence even 64 million years. Not of humans but all sort of junk would become fossilized, stuff car engines and larger metal parts.\u003C/p\u003E\u003Cp\u003ESo no advanced civilization, something like the ancient Egyptians back at the time of the dinosaurs might leave no trace, better if its places somewhere where the area is underwater today.\u003C/p\u003E\u003Cp\u003EHowever we would find related species, it would not evolve alone. \u003C/p\u003E\u003Cp\u003E----\u003C/p\u003E\u003Cp\u003EThat we made tools a million years ago is well know, Same with Neanderthals, however they did not have an civilization.\u003C/p\u003E\u003Cp\u003EAtlantis 10.000 year ago and so on don\u0027t work as knowledge would spread. \u003C/p\u003E\u003Cp\u003EHowever the oldest city is 10.000 year old. Might have been some older who is underwater now as the sea did raise after the ice age. However they would be stone age, probably fishers as it can support an large fixed population, they did however not have an significantly higher tech level than others.\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-07-19T22:50:23Z","Content":"\n\u003Cp\u003ENow if an ancient civilization existed more like 300 million years ago, and happened to make all their cities along \u003Ca href=\u0022https://en.wikipedia.org/wiki/Subduction\u0022 rel=\u0022external nofollow\u0022\u003Esubduction zones\u003C/a\u003E, there might not be any trace left of them.\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2013-07-19T22:55:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EIf humans disappeared today, it would be plenty of evidence even 64 million years. Not of humans but all sort of junk would become fossilized, stuff car engines and larger metal parts.\u003Cp\u003ESo no advanced civilization, something like the ancient Egyptians back at the time of the dinosaurs might leave no trace, better if its places somewhere where the area is underwater today.\u003C/p\u003E\u003Cp\u003EHowever we would find related species, it would not evolve alone. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnless you\u0027re making car engines out of gold and silver, there\u0027s no way it would last long enough to form a fossil. The only way I can see something like a car becoming archaeological proof is if it were to fall into mud - specifically, the kind of mud that those fossilised footprints were left in. You\u0027d uncover the imprint of the underside of a car.\u003C/p\u003E\u003Cp\u003ENothing ferrous [containing iron] would last 64 million years. Hoover Damn would last at most 10,000 years.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-19T22:59:03Z\u0022 title=\u002207/19/2013 10:59  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 19, 2013\u003C/time\u003E by RedDwarfIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-19T23:40:49Z","Content":"\n\u003Cp\u003EWhat about trace amounts of alloys and other \u0022exotic\u0022 tech related compounds?\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-07-19T23:55:19Z","Content":"\n\u003Cp\u003EWe got along fine as a civilization without any metal, never mind clearly artificial alloys, for tens of thousands of years. There wasn\u0027t any such thing in america right up until Cortez.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-20T00:04:22Z","Content":"\n\u003Cp\u003EThe longest-lasting signs of humanity may well be our high-orbiting satellites. Geostationary satellites will drift out of position after their fuel is gone, but such high orbits will last a VERY long time.\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-20T00:18:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWe got along fine as a civilization without any metal, never mind clearly artificial alloys, for tens of thousands of years. There wasn\u0027t any such thing in america right up until Cortez.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Exotic tech related compounds\u0022 didn\u0027t make it obvious I was speaking in reference to a more advanced civilization?\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-07-20T00:32:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EDNA tests provide support for theory of interracial breeding between Homo sapiens and Homo neanderthalensis. About 4% of DNA found in populations outside of Africa seems to be inherited from Neanderthals. More than that: populations in Asia and Melanesia have traces of genetic material coming from a third Homo species - Denisovans. So, since all three groups could succesfully interbreed, by definitions they were just three races of one species. And certainly our distant ancestors got around a lot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWasn\u0027t the line between same-species and related-species blurred when they found that Grolar bear? Should grizzly and polar bears be considered different races of the same species of they have produced fertile offspring?\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-07-20T00:39:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RedDwarfIV\u0022 data-cite=\u0022RedDwarfIV\u0022\u003E\u003Cdiv\u003EUnless you\u0027re making car engines out of gold and silver, there\u0027s no way it would last long enough to form a fossil. The only way I can see something like a car becoming archaeological proof is if it were to fall into mud - specifically, the kind of mud that those fossilised footprints were left in. You\u0027d uncover the imprint of the underside of a car.\u003Cp\u003ENothing ferrous [containing iron] would last 64 million years. Hoover Damn would last at most 10,000 years.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBones have an chance of being petrified, something who breaks down magnitudes harder and has an decent chance of being buried. Now not saying that the steel or aluminum would survive however it would leave traces and decent chance for generating an fossil. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nyrath\u0022 data-cite=\u0022nyrath\u0022\u003E\u003Cdiv\u003ENow if an ancient civilization existed more like 300 million years ago, and happened to make all their cities along \u003Ca href=\u0022https://en.wikipedia.org/wiki/Subduction\u0022 rel=\u0022external nofollow\u0022\u003Esubduction zones\u003C/a\u003E, there might not be any trace left of them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELack of advanced creatures so long ago I think.\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2013-07-20T01:47:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EBones have an chance of being petrified, something who breaks down magnitudes harder and has an decent chance of being buried. Now not saying that the steel or aluminum would survive however it would leave traces and decent chance for generating an fossil. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBones don\u0027t corrode.\u003C/p\u003E\u003Cp\u003EAs for satellites, that\u0027s a good point. The Apollo landing sites on the Moon won\u0027t be going anywhere fast. They\u0027d be noticable too, with those reflective mirrors they set up on them. Kind of sad that it would only be proof of 1969\u0027s technology level. Do we have many more recent active probes/rovers on non-atmospheric bodies?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-20T01:49:41Z\u0022 title=\u002207/20/2013 01:49  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 20, 2013\u003C/time\u003E by RedDwarfIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-07-20T02:05:33Z","Content":"\n\u003Cp\u003ENear-shoemaker on eros.\u003C/p\u003E\n"}]}