{"TopicId":42230,"ForumId":44,"TopicTitle":"If Apollo-Saturn was a beginning.","CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-12T20:49:52Z","PageNum":1,"Articles":[{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-12T20:49:52Z","Content":"\n\u003Cp\u003EElsewhere in the science labs you will find this thread:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/45565-What-if-the-Space-Shuttle-Program-had-done-its-job\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/45565-What-if-the-Space-Shuttle-Program-had-done-its-job\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt asks \u0022what if the Space Shuttle was a complete success, what would it have led to?\u0022.\u003C/p\u003E\u003Cp\u003EThis thread goes a little further back in time, to the early 70s. Men were walking on the Moon, Kennedy\u0027s challenge to the American space industry was accomplished. And we did stuff.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.influx.co.uk/wordpress/wp-content/uploads/2012/04/Apollo_15_Rover_Irwin.jpeg\u0022 alt=\u0022Apollo_15_Rover_Irwin.jpeg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EYou know those annoying \u0022My other car is...\u0022 bumper stickers? I bet this guy has a pretty frickin\u0027 rad one.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBut even as NASA was starting to get good at going to the Moon, new endurance records and ground-breaking discoveries being made on each new mission, it was called back, or rather, pulled back, to Washington DC. Voters were now getting bored of the Moon, and it\u0027s difficult to justify two men with living quarters on another world when there are millions without homes on Earth.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/PaleBlueDot.jpg/300px-PaleBlueDot.jpg\u0022 alt=\u0022300px-PaleBlueDot.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022The Earth is all we need!\u0022 Said nobody after looking at this picture.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E5% of the annual budget is a lot less than what people today, and then, think is what NASA gets, but it is still a lot of money, and even the other, more Earthbound and \u0022practical\u0022 science organisations get less than NASA. Space had to get cheap, and the new plans for a reusable \u0022space truck\u0022 for LEO was the only new manned program that congress would accept, and pull through with.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.ddmcdn.com/gif/space-shuttle-launch3a.jpg\u0022 alt=\u0022space-shuttle-launch3a.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe Space Shuttle: only 1.48% catastrophic failure!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EApollo-Saturn, the most fantastical transport system ever built in human history, was dead.\u003C/p\u003E\u003Cp\u003EAs it turns out, all that talk of the Apollo-Saturn duo being a waste of money meant the next generation of spaceship builders, the ones working right now, have had to re-invent the rocket. I\u0027m sure you are aware of the SLS-Orion program in development right now.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v480/punkboi/punkboi2/main2_SLS_components.jpg\u0022 alt=\u0022main2_SLS_components.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOf, course it won\u0027t come apart like this in actual flight.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIt is a wonderful design, and if allowed to flower, would open up a lot of options for NASA. But here\u0027s the thing-remember when those old spent F-1 engines were recovered from the sea bed?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://d1jqu7g1y74ds1.cloudfront.net/wp-content/uploads/2013/07/image.png\u0022 alt=\u0022image.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0026lt;Hums the theme to Titanic.\u0026gt;\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThose engines, along with museum pieces, are being studied by NASA to produce the high-power engines needed for SLS. Many people think aloud \u0022How inept are the people of NASA that they need ancient relics to build their supposed \u0022state of the art\u0022 rocket?\u0022. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://3.bp.blogspot.com/-cvSzdJC_93w/T8hb65GEZ1I/AAAAAAAAAC8/AwDSWeXTe1Q/s320/wheel.jpg\u0022 alt=\u0022wheel.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EIt was invented ages ago, and is therefore primitive and useless!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWhat these idiots don\u0027t realise is that the F-1 was the best at what it does (producing an ungodly amount of thrust) for so long because what it does hasn\u0027t been needed for a long time. No rocket since had the payload capacity of Saturn V because not one needed the payload capacity. The F-1 is still state of the art. Unfortunately, there is few technical documents of the F-1 left, and the people at Rocketdyne who built it are either retired or dead. I\u0027m sure the retired rocket scientists wish to help NASA build their new engines as much as possible, but it is difficult remembering every step to build a rocket engine you designed nearly 50 years ago. That means only the museum pieces and used wreckage from the sea-floor are left to base new engines on.\u003C/p\u003E\u003Cp\u003ELet\u0027s use the Lunar Module as a better case.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/d/d9/Apollo_15_LRV_loading.jpg\u0022 alt=\u0022Apollo_15_LRV_loading.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EYou had trouble getting your car in that tiny parking space? That must have been an incredible accomplishment.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIt was, and is, the only vehicle ever built that can take a human crew from Lunar orbit to the surface. The LEM had a brilliant service record, working every time it was needed to, even pushed beyond it\u0027s factory limits to become a lifeboat to the crew of Apollo 13. Not bad for small New York state-based aircraft company Grumman Corporation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://timemilitary.files.wordpress.com/2013/05/screen-shot-2013-05-29-at-12-32-12-pm.png?w=480\u0026amp;h=320\u0026amp;crop=1\u0022 alt=\u0022screen-shot-2013-05-29-at-12-32-12-pm.png?w=480\u0026amp;h=320\u0026amp;crop=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EHere\u0027s to you, spaceship builders.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBut then Project Apollo was cancelled, and demand for manned lunar landers dropped noticeably. The team that designed and built the LEM moved on to other projects and eventually retired, the remaining LEMs were sent to the museums, and the design sketches of components and how it all fits together, were thrown away. Why throw away this priceless data? Again, because it wasn\u0027t needed. These were the days when \u0022data\u0022 was not stored as bits on a hard drive, but as actual pieces of paper, on a shelf. The designs for the LEM alone could fill a small room.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://phoenix.officewarehousespace.net/wp-content/blogs.dir/5/files/19th-ave-business-park/19th_ave_interior_warehouse.jpg\u0022 alt=\u002219th_ave_interior_warehouse.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThis. full of paper.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EGrumman had no need for it, and drawings and paragraphs of technobabble don\u0027t make good museum pieces, so they were condemned. What does this mean? It means that when NASA starts thinking of building a new Lunar lander...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://teachers.egfi-k12.org/wp-content/uploads/2010/07/Altair.jpg\u0022 alt=\u0022Altair.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWith blackjack, and hookers.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E...the LEMs in air and space museums across the states will probably be taken apart, studied, tested (sometimes to destruction), and maybe put together again, like the F-1 is right now. The same is true of many other \u0022relics\u0022 of project Apollo, like the spacesuits and the rovers. Beyond the obvious loss of an engineering masterpiece (Although I think it would be wrong to shun technological improvement to continue marvelling over machines of the past), this means a lot of money is being spent to do what has already been done.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.logodesignlove.com/images/bad/nasa-logo-meatball.jpg\u0022 alt=\u0022nasa-logo-meatball.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENASA: Built a computer from scratch, then had that computer taken away from them, and forced to use an abacus for 40 years. Then the people who took away the computer makes them build another computer from scratch, better than the last one, with one-tenth the money.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThings weren\u0027t always like this. The people who built the machines of Apollo-Saturn were still building said machines, and some optimists among the designers were thinking on how the equipment could be made better. The production line would be increased, and the rockets would get both better and cheaper. Since all the hard work had already been accomplished (a 15-minute sub-orbital flight to an 8-day round trip to the Moon in 8 years is a steep learning curve.), it would\u0027ve been relatively simple and cheap to scale everything up.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.space.com/images/i/14601/i02/interstellar-space-travel-concepts-adrian-mann-1.jpg\u0022 alt=\u0022interstellar-space-travel-concepts-adrian-mann-1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ETHIS IS WHAT COULD HAVE BEEN.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIf the success of the Apollo missions had left the people of the world hungry for further exploration, what would the next big program have accomplished? There would\u0027ve been space stations, of course, but humans would\u0027ve also spent longer and longer periods on the Moon...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.futuretimeline.net/21stcentury/images/moon-telescope-future.jpg\u0022 alt=\u0022moon-telescope-future.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENever have I hated something so much for not existing.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E...humans would be going to Mars by 1980...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.wired.com/images_blogs/wiredscience/2012/08/Mars-in-95-Rover1-660x478.jpg\u0022 alt=\u0022Mars-in-95-Rover1-660x478.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ESTOP IT! YOUR BREAKING MY HEART!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E...and the gas giants by the turn of the century.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://4.bp.blogspot.com/-B4ZFf9sZQ-8/UYfaFmQt0WI/AAAAAAAAEf8/dNvrdtsGZHM/s640/Europa\u002B3.jpg\u0022 alt=\u0022Europa\u002B3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOne thing would make me happier than this happening in my lifetime. It is this happening before I ever existed.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOr at least, that\u0027s what I think would\u0027ve happened. What would you think have come from the Apollo Program, with all the sharp minds, brilliant hardware, and money NASA had at it\u0027s disposal?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-13T04:58:09Z\u0022 title=\u002208/13/2013 04:58  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 13, 2013\u003C/time\u003E by Drunkrobot\u003C/strong\u003E\n\u003Cbr\u003ERemoved grammatical errors, and added new snarky subtitle to Grumman photo.\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-08-12T21:03:25Z","Content":"\n\u003Cp\u003EWhy would any of this happen?\u003C/p\u003E\u003Cp\u003EThat\u0027s the main issue. You\u0027d won your race to the moon, there\u0027s very little point going beyond.\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-12T21:10:03Z","Content":"\n\u003Cp\u003EWell first off, I\u0027m British, my country was a spectator in the race to the Moon. And secondly, I was assuming we lived in a crazy parallel universe where the majority of people value scientific discovery and engineering achievements that don\u0027t have immediate practical value.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2013-08-12T21:14:25Z","Content":"\n\u003Cp\u003EAbove anything else, I would wanted it to lead to a manned Mars landing.\u003C/p\u003E\u003Cp\u003EBy the way, nice post! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-12T21:27:40Z","Content":"\n\u003Cp\u003EThank you! When I do another of these really long posts, I\u0027ll be sure to bring comedy italic text with me!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EDude, don\u0027t respond to every comment. You do this all the time.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EHey, I\u0027m responding to feedback. The dinosaurs died because they didn\u0027t respond to feedback.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThat was a killer asteroid, this is an internet forum.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThere are more similarities than you think.\u003C/p\u003E\n"},{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2013-08-12T21:39:09Z","Content":"\n\u003Cp\u003EWe flew to the Moon just because Americans wanted to \u0022be\u0022 better than Russians. And also because John Kennedy wanted to be elected again. Or that\u0027s at least what I think. Our stupidity has made us more smart,\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/cFods1KSWsQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T21:42:44Z\u0022 title=\u002208/12/2013 09:42  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by EvilotionCR2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jimbobq11","CreatedById":63235,"CreatedDateTime":"2013-08-12T22:19:02Z","Content":"\n\u003Cp\u003EStephen Baxter wrote a novel about a manned landing on mars in the 80s, Voyage. Back on topic: Crewed mars landings, crewed Venus flybys, and maybe, if the public approved, some sort of Earth-Moon System infrastructure. But that is a very optimistic assumption.\u003C/p\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2013-08-12T23:26:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunkrobot\u0022 data-cite=\u0022Drunkrobot\u0022\u003E\u003Cdiv\u003EWell first off, I\u0027m British, my country was a spectator in the race to the Moon. And secondly, I was assuming we lived in a crazy parallel universe where the majority of people value scientific discovery and engineering achievements that don\u0027t have immediate practical value.\u003C/div\u003E\u003C/blockquote\u003E That is pretty much America now. I actually have had to agree to disagree with almost everyone I met about going back to the moon.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EvilotionCR2\u0022 data-cite=\u0022EvilotionCR2\u0022\u003E\u003Cdiv\u003EWe flew to the Moon just because Americans wanted to \u0022be\u0022 better than Russians. And also because John Kennedy wanted to be elected again. Or that\u0027s at least what I think.\u003C/div\u003E\u003C/blockquote\u003E John Kennedy was dead\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-12T23:30:21Z","Content":"\n\u003Cp\u003EA great post! Love the humor \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think you\u0027ve pretty much hit the nail on the head. Politics and fickle public opinion probably had more to do with the death of the Apollo-Saturn legacy more than anything NASA did itself. Still, I think the humorous tone you strike in suggesting that NASA is having to reinvent the wheel is perhaps a bit exaggerated relative to reality.\u003C/p\u003E\u003Cp\u003EI had not even realized until getting into this game and having a couple weeks of free time to browse wiki that, there were a lot of important things happening in space travel during the post-Apollo era _besides_ the Shuttle. Many of these developments received little or no public attention; certainly nothing like the obsessive international attention paid to the Apollo program (or at least until the viewing public got bored of Apollo).\u003C/p\u003E\u003Cp\u003EFor one thing, Space Lab, Mir and the ISS. By as early as 1975 the US and Russia were already working together (perhaps only to some symbolic extent) on a Shuttle Mir program. Mir was in the sky for a VERY long time and some incredible worlds records were set on that station. For example the longest single space flight and I would imagine the longest total amount of time I space for a human. I know the former was set by a cosmonaut in Mir (Polyakev I think was his name) and I suspect a substantial portion of the latter. While simply \u0022leaving a guy up there for a long time\u0022 doesn\u0027t sound as dramatic or exciting as \u0022one small step\u0022 it is in some respects equally or more important. Based on the sum total of all those human hours spent in microgravity above Earth, I think they now have a pretty good idea of what long space journeys (e.g., to Mars, or on a Lunar base) will really be like for the people that endure them. While I\u0027m sure most of us KSP gamer geeks imagine that being an astronaut would be very, VERY cool (oh believe me, I dreamed of it myself!) the fact is: to spend many months in space is probably one of the most tedious, unpleasant and unhealthy things (not to mention dangerous) that anyone could ever do. Certainly not like time in prison, but not the bed of roses that it might superficially seem to be.\u003C/p\u003E\u003Cp\u003EInsomnia, bone loss, muscle atrophy, loneliness, mood disturbances, distorted perceptions, and if memory serves weakened immune function and for some individuals, dysfunction of metabolic and cardiovascular functions. Probably the only reason the cosmonauts and astronauts who are now retirees are not known for dying early is because they were already chosen from a highly select group of near supermen/women to begin with, were intensively monitored and trained while in space, and to some extent since then too.\u003C/p\u003E\u003Cp\u003EThe simple fact is: long-term space habitation (or at least long-term micro-gravity habitation) may never actually be something that becomes commonplace, and I don\u0027t know why we would be surprised if the truth is anything different than that. The world highup from our own sea level is quite in hospitable, to say nothing of that beyond our atmosphere.\u003C/p\u003E\u003Cp\u003EI think a number of things have happened here in the past 50 or 60 years that have left a bit of prevailing confusion in most of our minds.\u003C/p\u003E\u003Cp\u003EFirst of all, the incredibly quick and relatively untroubled success of the Apollo program made it all seem so easy. But the fact is, the U.S. (and I suspect in large part the entire \u0022Western world\u0022) were largely supportive of that program. I doubt that there was much quibbling about a few extra hundreds of millions for the Apollo program, given the important ideological meaning that it represented to people.\u003C/p\u003E\u003Cp\u003EIt is ironic that an ideological conflict could be the source of such a dramatic revolution in science and engineering, with such far reaching societal implications. But it was and we should be thankful for that. Instead of global thermonuclear war, we got Apollo, and Shuttle-Mir, and Soyuz, and ISS. Perhaps a little international competition between rival Superpowers wasn\u0027t such a bad thing after all . . .\u003C/p\u003E\u003Cp\u003EIn the absence of that sort of \u0027motivation\u0027 for a people to be solidary behind a cause, and thus for the administrators to be able to requisition the brainpower, the money and the other resources needed, something like Apollo is probably never gonna happen in a democracy, or for that matter in an autocracy either.\u003C/p\u003E\u003Cp\u003EThe Apollo program, in terms of the sheer magnitude of the accomplishment, and the incalculable impact it has had on life, is probably the single most important scientific movement in the history of humanity. Look around you right now, count up how many items in your immediate surroundings you are _SURE_ were not influenced (in their current form) by developments, inventions, prototypes, or accomplishments from the Apollo program or Space Race more broadly. I have read the experts lists of all the modern technologies that have become completely day-to-day commonplace and it is mind boggling how far reaching were the impacts of this program and the space race more generally.\u003C/p\u003E\u003Cp\u003EThe second way we are perhaps a bit misguided about what Apollo was and what \u0027should/could/would\u0027 have been is that, it is unlikely that a society can maintain that kind of \u0022Golden Age\u0022 pace for very long at a stretch. Moreover, its not like there was a hard stop to space travel immediately following Apollo.\u003C/p\u003E\u003Cp\u003ELastly, while I agree with you in grieving that the sorts of things in the moon base pics have yet to come to pass, I have to be honest that . . . well, maybe that sort of thing just isn\u0027t realistic . . . yet. As I said above, space is harsh, not a nice place for people to live and work. An amazing place with all sorts of promise, true. But also harsh, dangerous, inhospitable, unforgiving, and expensive. Even if somehow the \u0027momentum\u0027 of Apollo had not been \u0027lost\u0027 and the Saturn thing had not \u0027died\u0027 as you put it, we may nonetheless have been no closer to the science fiction imagery that we grew up on, i.e., living on moon bases, working in space stations, and putting on your space suit to go out for a days work fixing the antennaes and such.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T23:57:01Z\u0022 title=\u002208/12/2013 11:57  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by Diche Bach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-08-12T23:38:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunkrobot\u0022 data-cite=\u0022Drunkrobot\u0022\u003E\u003Cdiv\u003EElsewhere in the science labs you will find this thread:\u003Cp\u003EBut even as NASA was starting to get good at going to the Moon, new endurance records and ground-breaking discoveries being made on each new mission, it was called back, or rather, pulled back, to Washington DC. Voters were now getting bored of the Moon, and it\u0027s difficult to justify two men with living quarters on another world when there are millions without homes on Earth.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis argument has no sense, because after 50 years from now there still will be issues (old or new), wars, hunger and poverty... this cannot be fixed entirely.\u003C/p\u003E\u003Cp\u003ESpace race was only an political card and it was cut down after it lost it\u0027s political importance, also development of rockets changed, military don\u0027t needed larger rockets and complex ICBMs using kerosene/lox, has been replaced with hyperbolic and SRB\u0027s due to costs and shorter deployment time.\u003C/p\u003E\u003Cp\u003EAlso US was dealing with Vietnam war at this time and building it\u0027s nuclear arsenal against Russians. \u003C/p\u003E\u003Cp\u003EMilitary and (especially) armed conflicts are one of largest money drains for most of nations.\u003C/p\u003E\u003Cp\u003EFor example, recent Iraq war cost US ~ 760\u002B Billion dollars. \u003C/p\u003E\u003Cp\u003Eentire Apollo program cost around 135 billion dollars (25 billion in 70\u0027s dollars).\u003C/p\u003E\u003Cp\u003EIn 2011 world expenses on military was around 1.7 trillion US dollars. \u003C/p\u003E\u003Cp\u003ENasa has been crippled by fund cuts and space shuttle \u0022lite\u0022 witch became purpose on it\u0027s own for decades to come.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-13T00:08:56Z\u0022 title=\u002208/13/2013 12:08  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 13, 2013\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"apfelbeck","CreatedById":64706,"CreatedDateTime":"2013-08-12T23:40:56Z","Content":"\n\u003Cp\u003EArstechnica has a \u003Ca href=\u0022http://arstechnica.com/science/2013/04/how-nasa-brought-the-monstrous-f-1-moon-rocket-back-to-life/\u0022 rel=\u0022external nofollow\u0022\u003Ereally great\u003C/a\u003E \u003Ca href=\u0022http://arstechnica.com/science/2013/04/new-f-1b-rocket-engine-upgrades-apollo-era-deisgn-with-1-8m-lbs-of-thrust/\u0022 rel=\u0022external nofollow\u0022\u003Epair of articles\u003C/a\u003E about NASA reviving the F1 engines in modern form.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-08-13T00:12:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunkrobot\u0022 data-cite=\u0022Drunkrobot\u0022\u003E\u003Cdiv\u003EBut even as NASA was starting to get good at going to the Moon, new endurance records and ground-breaking discoveries being made on each new mission, it was called back, or rather, pulled back, to Washington DC. Voters were now getting bored of the Moon, and it\u0027s difficult to justify two men with living quarters on another world when there are millions without homes on Earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EApollo was essentially cancelled when the budget was gutted and hardware production capped - in 1965/67. Few people realize that by 1969 Apollo was already running on fumes. (Fewer people realize the contracts for the final round of studies for the Shuttle, the ones that would solidify the configuration chosen in 1972, were signed while Apollo 11 was en-route to the Moon.)\u003C/p\u003E\u003Cp\u003EAnd those who complain of politics and fickle public opinion destroyed Apollo should remember that politics and fickle public opinion \u003Cem\u003Ecreated\u003C/em\u003E Apollo in the first place.\u003C/p\u003E\u003Cp\u003EThere\u0027s a school of thought among space historians that holds, not without some merit based on available documentation, that we really really owe the Apollo program we got not to Kennedy - but to Oswald. Kennedy was already thinking of ways to scale back the expensive beast and to move towards cooperation in space rather than competition - but those plans died with him in Dallas. Instead LBJ seized on the opportunity to push Apollo as Kennedy\u0027s monument.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-08-13T00:19:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jimbobq11\u0022 data-cite=\u0022Jimbobq11\u0022\u003E\u003Cdiv\u003EStephen Baxter wrote a novel about a manned landing on mars in the 80s, Voyage. Back on topic: Crewed mars landings, crewed Venus flybys, and maybe, if the public approved, some sort of Earth-Moon System infrastructure. But that is a very optimistic assumption.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI remember reading this (still have it floating around somewhere... The thing that sticks in my head was the Apollo-N flight where the stack begins to pogo but they keep pushing forward and light the nuclear drive... and it explodes and lethally irradiates the crew. Was so damned emotive.\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-13T00:26:01Z","Content":"\n\u003Cp\u003EWould like to read me one of them space history books Derek. What authors/books would you recommend as a good \u0027grand tour\u0027 introduction?\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-13T01:00:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022karolus10\u0022 data-cite=\u0022karolus10\u0022\u003E\u003Cdiv\u003EThis argument has no sense, because after 50 years from now there still will be issues (old or new), wars, hunger and poverty... this cannot be fixed entirely.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am aware of the fact that stopping the space program would have about zero impact on improving the human condition, in fact it would dramatically reduce it. Sparing a little thought for the future is just as important as thinking of the present.\u003C/p\u003E\u003Cp\u003EBut, you have to remember what people were thinking back then. As children (the people who built the Shuttle, and the parents of those building the SLS-Orion) watched in wonder at the live TV from the Moon, the adults were complaining-\u0022Why should my tax money go to a man practising golf on the Moon!\u0022 Looking back at the state of the world, they did have a point-Vietnam, campus unrest, the human race realising that it was destroying the environments-why should some Buck Rogers wannabes live in Tomorrowland at the expense of billions of dollars?\u003C/p\u003E\u003Cp\u003EPushing the boundaries of human science and engineering is exactly what should be done to help solve the problems we face, along with sparing money for those born in a less hospitable works than ours. But the majority of people couldn\u0027t see the significance Project Apollo had on improving the world we live in, and those of us who try to follow a scientific way of thinking can\u0027t blame them for not believing in something they had no, or little, knowledge about.\u003C/p\u003E\u003Cp\u003EI think the space program is immensely important, just as important as welfare on Earth. But it doesn\u0027t matter what I think, it\u0027s what 51% of legal voters think.\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-13T01:49:42Z","Content":"\n\u003Cp\u003ETo Diche Bach.\u003C/p\u003E\u003Cp\u003EThanks for putting your time towards giving such lengthy feedback. I had as much enjoyment reading it as I hope you had reading the OP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst, exactly how much does NASA have to rediscover to build SLS. I know that as much equipment and experience that can be gathered from previous programs, like the Space Shuttle, and be practically used, is done so. This makes sense, using what you\u0027ve got and building upon it is, in fact, the idea behind the thread. My point was that much of the hardware, especially later, more advanced blocks of SLS, need to take a page from Apollo-Saturn\u0027s book. If NASA wants to do more than simple fly-by missions with Orion, then more needs to be redone-a successor to the LEM, space suits that can deal with the dust etc. They won\u0027t be going back to 1972, the new equipment will be a vast improvement over Apollo-Saturn-it\u0027s just that, for a good deal of that equipment to be built, the space industry will need to learn things that it once had, but then lost.\u003C/p\u003E\u003Cp\u003EAnd I agree with your second point, the space industry has hardly been stagnant for 40 years. Priceless information on how the body reacts to a microgravity environment has been gathered, and how that same microgravity environment could one day be of our benefit, large orbital factories producing things that could never be formed on the Earth. But I am of the opinion that the space industry shouldn\u0027t have been forced to chose between LEO and deep space. I\u0027m sure you are too. Long-term life on space stations can be possible, a large spinning wheel can produce an effect of gravity. Closer to current abilities is putting two living quarters modules on two long arms connected to the central \u0022stack\u0022 of a space craft or station, then spinning them. Spending sleeping, exercising, eating, washing and recreational hours in the living quarters would be an effective counter to microgravity.\u003C/p\u003E\u003Cp\u003EAnd your last point, on how the science fiction sketches I used would probably have never became fact- I partly agree with you. I know that the future of space exploration is not exactly what Von Braun designed it to be, no more than what Da Vinci thought the first flying machines would look like. But the core idea of the sketches, of the human race inventing stuff to let them explore such places remains up to date. Take a man with no technology or knowledge of technology (i.e. science.), and put him in icy tundra or scorching hot desert. He would, very quickly, die. But give him clothes, a source of controlled heat, shelter, ways of harvesting food and water, ways to carry food and water, an effective mode of transport and the knowledge to use it all, and he would survive. Science and technology is how we conquered the world. Science and technology is how we will conquer space.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-13T05:27:59Z\u0022 title=\u002208/13/2013 05:27  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 13, 2013\u003C/time\u003E by Drunkrobot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-08-13T06:54:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003EWould like to read me one of them space history books Derek. What authors/books would you recommend as a good \u0027grand tour\u0027 introduction?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrankly, I\u0027m not aware of any. (Partly because I quit reading \u0027introductory\u0027 level material twenty plus years ago.)\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-08-13T11:18:01Z","Content":"\n\u003Cp\u003EDerek, in your reading did you come across any build blueprints for the 8-Ball or Flight Data Attitude Indicator (Apollo Nav Ball). I have spent hours upon hours trawling the net to find information on this piece and have really enjoyed learning all I can about it but while I have finally figured out how the thing works I have never had anything but guesses to the size of the thing beyond the outside diameter of the case (7 inches high, 7 inches wide, 11 inches deep). I can guestimate most of it but it would be nice to find the exploded diagram of the parts. I\u0027m going to be building multiple sized variants to try out the various sizes.\u003C/p\u003E\u003Cp\u003EI have gotten a lot of Apollo manuals and some of them have had my jaw dropping off the ground when I realised what they had accomplished. A lot of what I already \u0022knew\u0022 about Apollo have been nothing but urban myth. \u003C/p\u003E\u003Cp\u003EI\u0027m not talking \u0022The moon landings were a hoax perpetrated by the US government in their way to fool their own citizens\u0022... I\u0027m talking about things like \u0022On Apollo 11 the LEM was going to crash so Neil Armstrong took over manual control and flew it to a safe landing spot.\u0022 (which was only partly true - He flew under computer assisted flight rather than manual. Think MechJeb Translatron - Keep Vertical mode).\u003C/p\u003E\u003Cp\u003EI\u0027m talking things like \u0022Gimbal Lock\u0022 like I explained in another thread of mine. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/40866-When-Gimbal-Lock-Is-A-Bad-Thing?highlight=gimbal\u002Block\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/40866-When-Gimbal-Lock-Is-A-Bad-Thing?highlight=gimbal\u002Block\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m talking about how Buzz Aldrin saw a UFO (that turned out to be one of the shrouds that covered the LEM when it was in the stack).\u003C/p\u003E\u003Cp\u003EI\u0027m talking about how Apollo 11 almost never left the moon due to a broken contact breaker switch... the switch that armed the ascent engine that would take Neil and Buzz back up to the Command and Service Module in orbit around the Moon and home... broken off when the two astronauts were putting on their space suits for the moonwalks. Buzz found the switch on floor of the LEM and he actually fixed it with a felt pen.I wonder where Buzz keeps that pen that saved a pair of astronaut\u0027s lives. \u003Ca href=\u0022http://www.eetimes.com/author.asp?section_id=4\u0026amp;doc_id=1283891\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.eetimes.com/author.asp?section_id=4\u0026amp;doc_id=1283891\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere are sooooo many little stories like that which really make you realise that space exploration is so damned dangerous. You break something then you had better have a backup and it had better work because there is no way of popping out to the local electronics store to buy a new switch or circuit breaker. Had that felt tip pen not worked do you think they would have had further landings? What if 13 hadn\u0027t have succeeded in bringing the crew back alive? \u003C/p\u003E\u003Cp\u003EI think this is one of the reasons why Mars is such a big step when compared to the moon. You really need to launch multiple ships in formation so that if something goes wrong with one ship that you have the option of sending the team on the faulty ship over to the others as backup. We need a faster flight method as well before we even think about a manned mission to Mars. We need to have ships that can do Earth to the Moon in a couple of hours at most.\u003C/p\u003E\u003Cp\u003EAnyway... waffling aside, the things that the Apollo astronauts did is beyond amazing. But the real awards should have gone to the scientists that made it happen because without them, Neil Armstrong wouldn\u0027t have said his famous \u0022That\u0027s one small step for a man... One giant leap for mankind!\u0022. One misplaced decimal point and POOF.... they would be spam-in-a-can.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-08-13T12:27:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunkrobot\u0022 data-cite=\u0022Drunkrobot\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBut, you have to remember what people were thinking back then. As children (the people who built the Shuttle, and the parents of those building the SLS-Orion) watched in wonder at the live TV from the Moon, the adults were complaining-\u0022Why should my tax money go to a man practising golf on the Moon!\u0022 Looking back at the state of the world, they did have a point-Vietnam, campus unrest, the human race realising that it was destroying the environments-why should some Buck Rogers wannabes live in Tomorrowland at the expense of billions of dollars?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really have to wonder though, did the people who were worried about they\u0027re tax dollars want to spend them on making peace with the soviets? racism? environmentalism?\u003C/p\u003E\u003Cp\u003EReally I can\u0027t think of any time any good has ever come from the phrase, \u0022Why should my tax money go...\u0022 No they complain that because they want their tax money to not be tax money at all, they want to keep it. That phrase is incredibly destructive to the entire civilization we live in. We live together, we have to work together the way we do that is pay taxes.\u003C/p\u003E\n"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-08-13T13:40:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EI remember reading this (still have it floating around somewhere... The thing that sticks in my head was the Apollo-N flight where the stack begins to pogo but they keep pushing forward and light the nuclear drive... and it explodes and lethally irradiates the crew. Was so damned emotive.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELoved that series of books.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-08-13T15:21:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWhy would any of this happen?\u003Cp\u003EThat\u0027s the main issue. You\u0027d won your race to the moon, there\u0027s very little point going beyond.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eand that, the defeatism, the utter lack of imagination and explorative urge, is the reason our society and likely our species has doomed itself to extermination.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2013-08-13T16:03:27Z","Content":"\n\u003Cp\u003EFor the record, the claim that any of the technical documentation for the Apollo program has been lost forever is just an urban legend. While the contractors likely disposed of their copies of it in the mid-70s, when it became clear that they weren\u0027t going to need them again, NASA retained its copies (because NASA retains *everything*... for example, the various ground checklist/manual props seen in Mission Control in \u003Cem\u003EApollo 13\u003C/em\u003E and \u003Cem\u003EFrom the Earth to the Moon\u003C/em\u003E? Those were the REAL ones--not just new copies of them, but the actual ones used in MOCR during the actual missions, pulled out of NASA storage facilities and loaned to the productions for use in those scenes.), both on paper and on microfilm; the problem is that the ones that WERE digitized early on to save on storage space are stored in formats that are so obsolete that it would be very difficult to recover them today. However, it *can* be done if NASA wanted to.\u003C/p\u003E\u003Cp\u003EThe problem, however, is that NONE of this information is directly applicable to building a new spacecraft *today*. Technologically, every item used in the Apollo program is a dinosaur today. While the F-1 engine remains the best there is at what it does, nobody but NOBODY would build an exact duplicate of it today--it\u0027s too labor-intensive, too complex, too expensive, and relies FAR too much on a Rube Goldberg machine of mechanical parts to get the microsecond-precise timing required to run it successfully. On top of that, the relatively small production run and limited technology of the time means that every single item used in the program was hand-built and custom-fitted to the specific mission it was on (a situation similar to when the US military licensed the 40mm Bofors anti-aircraft gun during World War Two and were horrified to see how many parts on it were specified as being made to a certain specification \u0022and then file to fit\u0022); no two were precisely alike and each had to be massaged into working as designed, and the details of THAT process were never recorded in technical documentation, as it was never the same for any two units.\u003C/p\u003E\u003Cp\u003EThe expectation is not that the crew at Marshall will reverse-engineer the F-1 to start a second production run of identical engines when we have no technical documentation remaining--it\u0027s that they\u0027ll reverse-engineer the F-1 to see what individual modifications were made to the units that they retain as samples to get them to work, compared to the documentation, and then figure out all the ways they could change the design to retain the same (or better) performance with a simpler, less expensive design that has its timing done by microprocessor software instead of loops in fuel lines and tiny delay valves and flow restrictors and such.\u003C/p\u003E\u003Cp\u003EIt\u0027s the same with all Apollo hardware--we could do much better with an all-new design based on the Lessons Learned rather than trying to replicate it today, simply because the technology has matured so much that many of the expedients and work-arounds involved in making it possible for us to land on the Moon with, as Spock once put it, \u0022stone knives and bearskins\u0022 are no longer necessary. On top of that, it\u0027s not the \u0022how\u0022 that NASA needs to relearn--we have all the documentation that explains exactly how everything worked. It\u0027s the \u0022WHY\u0022 that NASA needs to relearn, and that they\u0027re interrogating old engineers and reverse-engineering hardware for--we know HOW the F-1 engine worked, but we need to know WHY they chose that particular plumbing design. We know HOW the LM guidance computer worked, but we need to know WHY the MIT engineers decided on that particular architecture. By learning *why* the engineers did what they did back then, we can thus avoid a lot of the trial-and-error phase of R\u0026amp;D, because we know what most of the problems we\u0027ll have to solve are, and can thus start work directly on tackling those problems with the best technology has to offer today, rather than wasting effort with designs that run headlong into those same problems and having to discard the design and start anew.\u003C/p\u003E\u003Cp\u003E(For the record, attempting to return the original Apollo-Saturn hardware to production today would be essentially impossible, given that many of the technological solutions present in them are no longer available because they\u0027re so very obsolete--for example, surface-mount miniature vacuum tubes are GONE now, completely replaced by solid-state electronics that would require all the computers to be completely re-engineered.)\u003C/p\u003E\n"},{"CreatedByName":"Drunkrobot","CreatedById":58034,"CreatedDateTime":"2013-08-13T16:51:19Z","Content":"\n\u003Cp\u003EIn reply to rdfox.\u003C/p\u003E\u003Cp\u003EI said earlier, in the thread that building SLS is NOT a return to Apollo-Saturn, it is simply looking back at the people who built it, how and why they did what they did, and how the technology of today can simplify, and improve the work done in the 60s.\u003C/p\u003E\u003Cp\u003EOK, I didn\u0027t put it that clearly, but I was trying to stop the posts from being too long. Thank you for your reply!\u003C/p\u003E\n"},{"CreatedByName":"King Arthur","CreatedById":73849,"CreatedDateTime":"2013-08-13T18:04:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eand that, the defeatism, the utter lack of imagination and explorative urge, is the reason our society and likely our species has doomed itself to extermination.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThree words: Lack. Of. Practicality.\u003C/p\u003E\u003Cp\u003EWe can dream all we want, but if something isn\u0027t worth the money (and manned spaceflight has steadily proven itself through the years that it isn\u0027t, unfortunately) then it simply isn\u0027t happening.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-08-13T18:29:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eand that, the defeatism, the utter lack of imagination and explorative urge, is the reason our society and likely our species has doomed itself to extermination.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlright, so what is there for man to accomplish on missions? Plant a flag? Take some samples a robot could take at a fraction of the cost? Just lack of \u0022imagination\u0022 isn\u0027t a good reason why Kryten was wrong.\u003C/p\u003E\n"}]}