{"TopicId":42600,"ForumId":44,"TopicTitle":"Kerbin Astronomical and Geological Society (KAS)","CreatedByName":"Super 6-1","CreatedById":62499,"CreatedDateTime":"2013-08-15T15:17:53Z","PageNum":1,"Articles":[{"CreatedByName":"Super 6-1","CreatedById":62499,"CreatedDateTime":"2013-08-15T15:17:53Z","Content":"\n\u003Cp\u003EHey everybody! Now that school is back in session, I am ready to get posting again. Last year, I made a thread dedicated to the photography and naming of different celestial bodies and constellations (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27226-Calling-all-astronomers-past-present-and-future%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/27226-Calling-all-astronomers-past-present-and-future%21\u003C/a\u003E). Check it out to see what we have named. That thread has died down now, so I would like to create a new one, but this time, include the planets and their surfaces, as well as the moons. \u003C/p\u003E\u003Cp\u003EPlease reply if you are interested.\u003C/p\u003E\u003Cp\u003EHere are the rules:\u003C/p\u003E\u003Cp\u003E1) try to avoid naming what you discover after yourself, its not like you\u0027ve spent years of your life and a lot of money to do this.\u003C/p\u003E\u003Cp\u003E2) any vulgar names will not be accepted, try to think of something original and scientific that has something to do with what you\u0027ve discovered\u003C/p\u003E\u003Cp\u003E3) you can not rename anything someone else has discovered. If you find it first, you get to name it.\u003C/p\u003E\u003Cp\u003EGuidelines:\u003C/p\u003E\u003Cp\u003E1) give as much info as you can on it (where you were orbiting, stuff like that)\u003C/p\u003E\u003Cp\u003E2) try to give a description (maybe some assumed science like size, composition, and other logical information you feel like adding.)\u003C/p\u003E\u003Cp\u003EOther than that, have fun guys and lets start mapping!\u003C/p\u003E\u003Cp\u003EP.S. I will be posting my findings as i get them. Happy hunting!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-15T18:30:12Z\u0022 title=\u002208/15/2013 06:30  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 15, 2013\u003C/time\u003E by Super 6-1\u003C/strong\u003E\n\u003C/span\u003E\n"}]}