{"TopicId":43615,"ForumId":44,"TopicTitle":"Super-Earth Plausibility","CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2013-08-23T15:26:03Z","PageNum":1,"Articles":[{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2013-08-23T15:26:03Z","Content":"\n\u003Cp\u003EI\u0027ve already made thread about this, but it\u0027s really old. So I think it would be better to start anew. \u003C/p\u003E\u003Cp\u003ESimply how big could a terrestrial or \u0022rocky\u0022 planet get before becoming a gas giant? In my head I had an an idea for a short story (Which I probably won\u0027t write down, but still). With my serious ideas I like a mix of mostly softcore sci-fi with a few hardcore elements to make it feel believable, but not limit myself so much that my options can fit on a sticky note. And i\u0027ve always want a giant life capable planet in one of my ideas.\u003C/p\u003E\u003Cp\u003EAs for the atmosphere would it be too much of a stretch to say when it was forming the area it was in was gas-poor so that\u0027s why the planet is huge, but didn\u0027t become a gas giant? Also could it be bigger in terms of radius or will it just compress down after a certain point?\u003C/p\u003E\u003Cp\u003EI\u0027ve experimented US, and earth 4 is probably going to be as big as it\u0027s going to get as believability will allow. But who knows?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://oi44.tinypic.com/2s1m61s.jpg\u0022 alt=\u00222s1m61s.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-23T15:31:37Z","Content":"\n\u003Cp\u003EIs that a game interface you\u0027re showing us a picture of? What game?\u003C/p\u003E\u003Cp\u003EI believe the prevailing theories about the formation of Earth and the solar system have been revised rather dramatically since my days in the geology class room, so I\u0027m probably wise to just keep my mouth shut. Would be very interested to hear what anyone with some expertise has to say though!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-23T15:35:02Z\u0022 title=\u002208/23/2013 03:35  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 23, 2013\u003C/time\u003E by Diche Bach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-23T15:48:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003EIs that a game interface you\u0027re showing us a picture of? What game?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would be \u003Ca href=\u0022http://universesandbox.com/\u0022 rel=\u0022external nofollow\u0022\u003EUniverse Sandbox\u003C/a\u003E, which you can sometimes get for sale for $2 on Steam.\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-08-23T16:10:39Z","Content":"\n\u003Cp\u003EWell, as far I understand, it\u0027s more than just sheer mass - from what I understand, it\u0027s possible to have terrestrial planets way past the 10xEarth limit, and gas planets well below it.\u003C/p\u003E\u003Cp\u003EFor example, consider a gas planet in really low orbit over a star. Over time, its atmosphere is stripped away by hydrodynamic forces. The end result is that the planet\u0027s core is exposed, and it\u0027s superficially similar to a terrestrial planet. This is called a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Chthonian_planet\u0022 rel=\u0022external nofollow\u0022\u003ECthonian planet\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThis suggests something interesting - that a gas giant may have originated as a (large) terrestrial planet, and simply accreted enough gas that the terrestrial portion became a minority part of the overall planetary mass. Following under this hypothesis, the pressure and mass of the gas \u0022squeezes\u0022 the terrestrial core into a more conventional planetary core (like the rock and magma of Earth do to its core). Any \u0022rocky\u0022 mass the planet absorbed after this point (asteroids, wayward planets, what have you) would then tend to be assimilated into the core.\u003C/p\u003E\u003Cp\u003EFollowing on this, I propose the following: that a solar system that has a large number of gas giants (like our own, which has 4, plus a number of smaller bodies, both planets and moons, with not-insignificant atmospheres) is also more likely to have terrestrial planets with atmospheres (be they Earth-like or not), because the materials required for atmosphere formation were present in sufficient abundance during its early formation.\u003C/p\u003E\u003Cp\u003EAs for the original question: yes, I think even Earth-10 would be possible; however, it would require far more stringent conditions to be met for it not to become a gas planet than for, say, Earth-1, or even Earth-4. Hypothetically, the more gas-poor a region of space is, the larger a terrestrial planet could become before the chances of becoming a gas giant became significant. Though, naturally, the more gas-poor your area is, the less likely your Earth-100 is to be habitable in the first place.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-23T21:09:38Z","Content":"\n\u003Cp\u003EFirst, we have learned a lot after starting to discover planets outside our solar system. It looks pretty obvious to me that even current theories are rush jobs done by scientists who try hard to not look like idiots and keep their salaries, in short they are junk. \u003C/p\u003E\u003Cp\u003EWhy can not gas giants be created close to the star, you have double stars like Sirius with huge difference in size. Why not an larger difference?\u003C/p\u003E\u003Cp\u003EOne option who sounds plausible is that super earths is water planets. No not Laythe or Sparta but places where minimum ocean depth is hundreds of kilometers. \u003C/p\u003E\u003Cp\u003EMain downside of super earths with rocky surface is that they would have to work hard to avoid picking up an Venus like atmosphere. \u003C/p\u003E\u003Cp\u003EHowever they might have interesting moons.\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-23T21:27:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EThat would be \u003Ca href=\u0022http://universesandbox.com/\u0022 rel=\u0022external nofollow\u0022\u003EUniverse Sandbox\u003C/a\u003E, which you can sometimes get for sale for $2 on Steam.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDamn you Shifty! Another game that I must buy now . . . \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EFirst, we have learned a lot after starting to discover planets outside our solar system. It looks pretty obvious to me that even current theories are rush jobs done by scientists who try hard to not look like idiots and keep their salaries, in short they are junk. \u003Cp\u003EWhy can not gas giants be created close to the star, you have double stars like Sirius with huge difference in size. Why not an larger difference?\u003C/p\u003E\u003Cp\u003EOne option who sounds plausible is that super earths is water planets. No not Laythe or Sparta but places where minimum ocean depth is hundreds of kilometers. \u003C/p\u003E\u003Cp\u003EMain downside of super earths with rocky surface is that they would have to work hard to avoid picking up an Venus like atmosphere. \u003C/p\u003E\u003Cp\u003EHowever they might have interesting moons.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell said Magnemoe! It is always difficult to generalize about a \u0022population\u0022 (all the solar systems in the Milky Way for example) if you only have a sample size of one (Sol system).\u003C/p\u003E\u003Cp\u003EI seem to recall that some of these exoplanet discoveries seemed to rather dramatically defy traditional wisdom about how solar systems tend to form. Specifically, I seem to recall that a few of those exoplanets are enormous gas giants that are rather close to their parent star, and revolving rather quickly.\u003C/p\u003E\u003Cp\u003EI debated doing my major in geology instead of anthropology; I finally decided humans are more complicated so go with that (silly decision in retrospect). I envy the unborn who will one day get to do extrasolar geology, xenogeology or, astrogeology whatever the heck you want to call it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-23T21:34:44Z\u0022 title=\u002208/23/2013 09:34  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 23, 2013\u003C/time\u003E by Diche Bach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-08-23T22:38:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003EI debated doing my major in geology instead of anthropology; I finally decided humans are more complicated so go with that (silly decision in retrospect). I envy the unborn who will one day get to do extrasolar geology, xenogeology or, astrogeology whatever the heck you want to call it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, we already have one xenogeologist - Harrison Schmitt was a civilian geologist who went up on Apollo 17.\u003C/p\u003E\u003Cp\u003EBesides, look at me - I\u0027m a computer science major. Doesn\u0027t mean I can\u0027t love physics and engineering and whatnot, am I right? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-24T00:09:04Z","Content":"\n\u003Cp\u003EAbsolutely!\u003C/p\u003E\n"},{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2013-08-24T00:54:02Z","Content":"\n\u003Cp\u003EVery fascinating information, I wonder what else is plausible? Could a moon support life as well if it was massive enough and had an atmosphere?\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-08-24T01:03:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WhiteWeasel\u0022 data-cite=\u0022WhiteWeasel\u0022\u003E\u003Cdiv\u003EVery fascinating information, I wonder what else is plausible? Could a moon support life as well if it was massive enough and had an atmosphere?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, there is at least one moon in our own solar system with an atmosphere - Titan, a moon of Saturn. It\u0027s composed of various hydrocarbons and has a surface pressure approximately 150% that of Earth. It\u0027s believed that there are hydrocarbon \u0022lakes\u0022 on the surface as well. The Huygens part of the NASA/ESA Cassini-Huygens probe landed on it a few years ago, and took some pictures, and the Cassini part has mapped large chunks of the surface using radar and other tools.\u003C/p\u003E\u003Cp\u003EWhile it\u0027s not a perfect example, it\u0027s a perfect proof-of-concept - there is no reason a moon couldn\u0027t have an atmosphere, and retain it. From there, it\u0027s not far to life, even if it\u0027s not life as we know it.\u003C/p\u003E\n"},{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2013-08-24T01:09:10Z","Content":"\n\u003Cp\u003ECurious, how extreme could a moon\u0027s inclination naturally get? 20, 30, 45 degrees, maybe more?\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-08-24T01:22:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WhiteWeasel\u0022 data-cite=\u0022WhiteWeasel\u0022\u003E\u003Cdiv\u003ECurious, how extreme could a moon\u0027s inclination naturally get? 20, 30, 45 degrees, maybe more?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends on the origin of said moon. If it\u0027s a captured asteroid, its inclination could be anything.\u003C/p\u003E\u003Cp\u003EAs for moons that were formed by accretion, generally speaking they would tend to follow the plane of the solar system (as this is where the accretion disk that produces these moons tends to form). However, that being said, I suppose it isn\u0027t inconceivable that enough moons, acting in close proximity to each other over time, could succeed in altering each other\u0027s orbits to be more or less inclined. And, naturally, it should go without saying that a sufficiently large body (a rogue planet, for instance) might also disturb them into more-inclined orbits.\u003C/p\u003E\n"},{"CreatedByName":"Dockillar","CreatedById":69914,"CreatedDateTime":"2013-08-24T02:15:58Z","Content":"\n\u003Cp\u003EThere is a technically no limit between a terrestrial planet\u0027s size, and the type of planet it is, a planet being big enough does not necessarily make it a gas giant, a gas giant will form in the outer, more hydrogen, helium, and methane rich areas, they grow large because they use gravitational force to pull these gases into gas planets, so in a sense, a gas giant literally, \u0022eats\u0022 its area of gases up, which on a scale of a proto-planetary disc, is a HUGE area...\u003C/p\u003E\u003Cp\u003EIf a so-called \u0022super earth\u0022 were to exist, it would literally have to take massive amounts of rocks, ice, or other solid materials into itself to form, and it is possible that other larger planets would be interfered by this huge body to collide and make it BIGGER!!!\u003C/p\u003E\u003Cp\u003EThe point is, planets grow big because of the area they form in, not because of their common large sizes, but their history and orbits around their star...\u003C/p\u003E\u003Cp\u003EIts a cool idea though! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-24T04:46:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dockillar\u0022 data-cite=\u0022Dockillar\u0022\u003E\u003Cdiv\u003EThere is a technically no limit between a terrestrial planet\u0027s size, and the type of planet it is, a planet being big enough does not necessarily make it a gas giant, a gas giant will form in the outer, more hydrogen, helium, and methane rich areas, they grow large because they use gravitational force to pull these gases into gas planets, so in a sense, a gas giant literally, \u0022eats\u0022 its area of gases up, which on a scale of a proto-planetary disc, is a HUGE area...\u003Cp\u003EIf a so-called \u0022super earth\u0022 were to exist, it would literally have to take massive amounts of rocks, ice, or other solid materials into itself to form, and it is possible that other larger planets would be interfered by this huge body to collide and make it BIGGER!!!\u003C/p\u003E\u003Cp\u003EThe point is, planets grow big because of the area they form in, not because of their common large sizes, but their history and orbits around their star...\u003C/p\u003E\u003Cp\u003EIts a cool idea though! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is largely what I had in mind in response to the OP too. I don\u0027t think there necessarily is an upper limit on how big a rocky planet can be and still evolve to have conditions that favor the evolution of life.\u003C/p\u003E\u003Cp\u003EThere may however be a lower size limit, because in the absence of plate tectonics, volcanism, or a magnetosphere it has been argued to be unlikely that a permanent atmosphere or surface water will form, both of which are regarded as essential to the development of life.\u003C/p\u003E\u003Cp\u003EBeyond that I think what matters most is: tidally locked orbits are unlikely to be conducive to life and the \u0027goldilocks\u0027 region around a star (not too hot, not too cold) is important. However, in some special instances, sufficient heat to maintain liquid water could come from other sources. For example, they hypothesize that Europa may have liquid oceans under its all ice surface as a result of tidal flexing by Jupiter\u0027s gravity.\u003C/p\u003E\u003Cp\u003EThe other thing obviously is that the planet absolutely must have a suitable mixture of the organic elements that are essential to carbon-based life (unless of course you want to consider the possibility of life based on other elements, which is pretty much pure science fiction I think).\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-08-24T04:50:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003EThe other thing obviously is that the planet absolutely must have a suitable mixture of the organic elements that are essential to carbon-based life (unless of course you want to consider the possibility of life based on other elements, which is pretty much pure science fiction I think).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot necessarily - we live in an infinite (OK, near-infinite) universe. One of the best lines I ever read was, \u0022If we\u0027ve done it, nature has done it somewhere, but better\u0022 (I think it was Mr. Scotty of the \u003Cem\u003EEnterprise\u003C/em\u003E, though I may be paraphrasing a bit). If we can dream it, I\u0027d bet that somewhere, somehow, nature has built it.\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-24T05:12:34Z","Content":"\n\u003Cp\u003EWell, one thing I think we can be sure of: whatever elements might facilitate the molecules that are essential to life as we know it, meaning self-replicating (i.e., not crystals which do replicate but not through a self-driven process) \u0027vehicles\u0027 for packets of chemical information, they will have to exhibit similar capacity to form into complex reactive and catalytic biopolymers; in the case of Earth these being nucleic acids and proteins the basis for all life, including prions, which like viruses are not \u0027technically\u0027 alive.\u003C/p\u003E\u003Cp\u003EMy limited mastery of organic chemistry does not allow me to speculate what possible configurations of organic elements could suffice in place of good old carbon, nitrogen, oxygen, hydrogen, phosphorous, etc., as the building blocks of life. But I think the available options would be fairly limited simply from the standpoint of what would allow for the sort of chemical structures that could serve a similar role as do the nucleic acids and proteins. I think there has been speculation that, in some exotic context, \u0022silicon-based\u0022 life could (maybe) evolve, but I have no idea if that is pure fantasy or not.\u003C/p\u003E\u003Cp\u003EIt seems unlikely that there is much in terms of unknown elements to be discovered out there in the cosmos, though I suppose if the unknown elements are organic and thus found only as traces in the large structures that can be spectroscopically examined, it is possible, though very unlikely.\u003C/p\u003E\u003Cp\u003ESo, I think it is reasonable to operate from the hypothesis that, life anywhere else in the cosmos is likely to be based on a very similar chemical basis as life on Earth.\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-08-24T05:28:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003ESo, I think it is reasonable to operate from the hypothesis that, life anywhere else in the cosmos is likely to be based on a very similar chemical basis as life on Earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPossibly - I\u0027m still not going to discount life with alternative chemistries, but let\u0027s set that aside.\u003C/p\u003E\u003Cp\u003ENow, here\u0027s the more interesting question: what form would this life take?\u003C/p\u003E\u003Cp\u003EFor instance, it was demonstrated in the \u002770s that, if you took the elements present in Jupiter\u0027s atmosphere and subjected them to electrical flashes (like, say, a lightning bolt), you would eventually end up with amino acids (the building blocks of life). Now, Jupiter isn\u0027t a particularly good example because the violent weather would drag any interesting molecules that formed down to the depths, where they would be reduced back down to their base elements by heat and pressure. But it raises some interesting questions - what kind of life might arise on a planet that isn\u0027t perfectly Earth-like (or even Earth-like at all), even if its biochemistry is like our own?\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-24T12:06:42Z","Content":"\n\u003Cp\u003EBiochemistry of the another planet would probably be rather similar to ours in its foundations. No doubt there\u0027d be different pathways and some different chemicals.\u003C/p\u003E\u003Cp\u003EThat\u0027s because it can\u0027t be different. Element properties are universal, elements involved are abundant. You can bet it would be carbon based. Other elements don\u0027t offer enough possibilities or yield unstable compounds. Silicon lifeforms are probably a pipedream, and that\u0027s the best option after carbon.\u003C/p\u003E\u003Cp\u003EThe basics of morphology would be the same. Something similar to our bacteria. Multicelular organisms would have radial symmetry, and the more advanced ones, who acquired the ability to move through a dense fluid would be bilaterally symmetrical. That\u0027s to avoid drag and later, on dry land, tipping.\u003C/p\u003E\u003Cp\u003EWhat we see on Earth is not, in its foundations, so special. It\u0027s like that because it\u0027s the most efficient option. You can expect interesting and wild morphological differentiation with highly evolved organisms that have a skeleton, but with those yucky, squishy dudes, there\u0027s no much option. I wouldn\u0027t be much surprised (although fascinated) if oceans of Europa contained things like tube worms and jellyfish, and lots of different bacteria-like species. In fact, I\u0027d be surprised if those oceans were completely devoid of bacteria-like species.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-24T13:03:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EBiochemistry of the another planet would probably be rather similar to ours in its foundations. No doubt there\u0027d be different pathways and some different chemicals.\u003Cp\u003EThat\u0027s because it can\u0027t be different. Element properties are universal, elements involved are abundant. You can bet it would be carbon based. Other elements don\u0027t offer enough possibilities or yield unstable compounds. Silicon lifeforms are probably a pipedream, and that\u0027s the best option after carbon.\u003C/p\u003E\u003Cp\u003EThe basics of morphology would be the same. Something similar to our bacteria. Multicelular organisms would have radial symmetry, and the more advanced ones, who acquired the ability to move through a dense fluid would be bilaterally symmetrical. That\u0027s to avoid drag and later, on dry land, tipping.\u003C/p\u003E\u003Cp\u003EWhat we see on Earth is not, in its foundations, so special. It\u0027s like that because it\u0027s the most efficient option. You can expect interesting and wild morphological differentiation with highly evolved organisms that have a skeleton, but with those yucky, squishy dudes, there\u0027s no much option. I wouldn\u0027t be much surprised (although fascinated) if oceans of Europa contained things like tube worms and jellyfish, and lots of different bacteria-like species. In fact, I\u0027d be surprised if those oceans were completely devoid of bacteria-like species.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgree with you here except its lots of strange small animals who is radically different think its more variations than within larger ones who tend to look much the same. \u003C/p\u003E\u003Cp\u003EProbably as size put restrictions to design and you have far fewer species. \u003C/p\u003E\u003Cp\u003EOne interesting aspect with the gas giant ice moons is if bacteria frozen in ice could survive moving between them? \u003C/p\u003E\u003Cp\u003EGetting thrown away from the moon after an impact should work however the impact on another might be harder to survive but perhaps an glancing hit would shatter the pieces and allow some part of it to come down without becoming hot gas.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-24T14:05:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EAgree with you here except its lots of strange small animals who is radically different think its more variations than within larger ones who tend to look much the same. \u003Cp\u003EProbably as size put restrictions to design and you have far fewer species. \u003C/p\u003E\u003Cp\u003EOne interesting aspect with the gas giant ice moons is if bacteria frozen in ice could survive moving between them? \u003C/p\u003E\u003Cp\u003EGetting thrown away from the moon after an impact should work however the impact on another might be harder to survive but perhaps an glancing hit would shatter the pieces and allow some part of it to come down without becoming hot gas.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEvolution doesn\u0027t have a goal. It just is. There are small animals with weird configurations, but they\u0027re advanced versions we see today. Primitive animals we see in the fossils and the basis of morphology of simple avertebrates today, are very similar. It took a long, long time before multicellular life became rich in shapes.\u003C/p\u003E\u003Cp\u003EThere aren\u0027t many options. It boils down to what the animal does. If it\u0027s stationary, it can\u0027t go after the food, so it needs radial symmetry to increase its chances of catching a drifting piece. If it moves, it has a hydrodinamic shape, bilateral symmetry, sensors and mouth at the front, propellers and waste opening at the back.\u003C/p\u003E\u003Cp\u003EEffect of the planet\u0027s size it\u0027s an interesting question. I\u0027m not sure how it would affect animals floating in fluid, but high gravity would slow down the evolution of land animals. They couldn\u0027t grow large in size.\u003C/p\u003E\u003Cp\u003EI think the size of fluid floating dudes is much more affected by the factors such as the position in the food chain and the abundance of food.\u003C/p\u003E\u003Cp\u003EPanspermia between satellites without atmosphere has a lot greater chance of success. If something hits an Europa-like satellite, there\u0027d be lots of material not affected by the heat thrown into escape orbit. If it lands on a similar satellite and somehow gets into the fluid environment that\u0027s not radically different, that\u0027s a start.\u003C/p\u003E\u003Cp\u003EAtmospheres act as very efficient sterilizers, yes.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-25T00:03:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EEvolution doesn\u0027t have a goal. It just is. There are small animals with weird configurations, but they\u0027re advanced versions we see today. Primitive animals we see in the fossils and the basis of morphology of simple avertebrates today, are very similar. It took a long, long time before multicellular life became rich in shapes.\u003Cp\u003EThere aren\u0027t many options. It boils down to what the animal does. If it\u0027s stationary, it can\u0027t go after the food, so it needs radial symmetry to increase its chances of catching a drifting piece. If it moves, it has a hydrodinamic shape, bilateral symmetry, sensors and mouth at the front, propellers and waste opening at the back.\u003C/p\u003E\u003Cp\u003EEffect of the planet\u0027s size it\u0027s an interesting question. I\u0027m not sure how it would affect animals floating in fluid, but high gravity would slow down the evolution of land animals. They couldn\u0027t grow large in size.\u003C/p\u003E\u003Cp\u003EI think the size of fluid floating dudes is much more affected by the factors such as the position in the food chain and the abundance of food.\u003C/p\u003E\u003Cp\u003EPanspermia between satellites without atmosphere has a lot greater chance of success. If something hits an Europa-like satellite, there\u0027d be lots of material not affected by the heat thrown into escape orbit. If it lands on a similar satellite and somehow gets into the fluid environment that\u0027s not radically different, that\u0027s a start.\u003C/p\u003E\u003Cp\u003EAtmospheres act as very efficient sterilizers, yes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know evolution don\u0027t have a goal, however I was also thinking of the cambrian explosion however that might be to advanced creatures for that you are talking about.\u003C/p\u003E\u003Cp\u003EAs for surviving asteroids, atmosphere brakes them, surprisingly the stuff who reach earth is often cold. probably because the outer part act as an heat shield who burns up and the time in atmosphere is to short to transfer heat into the body, while if you hit an moon at orbital speed I\u0027m not sure how much would be left.\u003C/p\u003E\u003Cp\u003EYou need an large light gas gun and some ice cooled to -200 degree to test this. \u003C/p\u003E\u003Cp\u003EAnyway an glancing blow should work and an impact will throw lots of stuff up. \u003C/p\u003E\u003Cp\u003EProbably enough to throw stuff in system and perhaps interstellar distances.\u003C/p\u003E\n"}]}