{"TopicId":44216,"ForumId":44,"TopicTitle":"Climate change protest done right","CreatedByName":"SaturnVee","CreatedById":78862,"CreatedDateTime":"2013-08-29T00:19:43Z","PageNum":1,"Articles":[{"CreatedByName":"SaturnVee","CreatedById":78862,"CreatedDateTime":"2013-08-29T00:19:43Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://climatenamechange.org/#/petition?c=upworthy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://climatenamechange.org/#/petition?c=upworthy\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESign this petition and names for hurricanes could actually be relevant \u003Cimg src=\u0022https://forum.kerbalspaceprogram.com/images/smilies/k_cheesy.gif\u0022 alt=\u0022k_cheesy.gif\u0022\u003E. \u003C/p\u003E\u003Cp\u003EOn side note, what evidence is there that climate change isn\u0027t caused by human industrialisation?\u003C/p\u003E\n"},{"CreatedByName":"Omicron314","CreatedById":59506,"CreatedDateTime":"2013-08-29T00:38:56Z","Content":"\n\u003Cp\u003ENo evidence to the contrary, or else climate scientists would not be in complete agreement. The only reason this is difficult is because there are a lot of stupid people in the country.\u003C/p\u003E\u003Cp\u003EAnyway, signed. We need to get a famous person to support this. Does anyone here know any famous people? Actually, scratch that. Someone tell Bill Nye about this!\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-29T01:06:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SaturnVee\u0022 data-cite=\u0022SaturnVee\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://climatenamechange.org/#/petition?c=upworthy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://climatenamechange.org/#/petition?c=upworthy\u003C/a\u003E\u003Cp\u003ESign this petition and names for hurricanes could actually be relevant \u003Cimg src=\u0022https://forum.kerbalspaceprogram.com/images/smilies/k_cheesy.gif\u0022 alt=\u0022k_cheesy.gif\u0022\u003E. \u003C/p\u003E\u003Cp\u003EOn side note, what evidence is there that climate change isn\u0027t caused by human industrialisation?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can\u0027t prove a negative (proving that A caused it doesn\u0027t mean B wasn\u0027t involved, too).\u003C/p\u003E\u003Cp\u003EYou can only prove a positive statement, and there\u0027s plenty of evidence we started this problem.\u003C/p\u003E\u003Cp\u003EI think this is a great idea. If people in US can\u0027t use science to shove the mouths of ignorant politicians, they can at least mock them. That\u0027s all they\u0027re left with.\u003C/p\u003E\u003Cp\u003EI find it devastating that almost 40% of the people that decided to rate the video actually disliked it. It\u0027s the revenge of the failed school systems.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T01:10:57Z\u0022 title=\u002208/29/2013 01:10  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wesreidau","CreatedById":75430,"CreatedDateTime":"2013-08-29T01:18:41Z","Content":"\n\u003Cp\u003EI fail to see how ad hominem furthers the pursuit of reason.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-08-29T02:27:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EYou can\u0027t prove a negative (proving that A caused it doesn\u0027t mean B wasn\u0027t involved, too).\u003Cp\u003EYou can only prove a positive statement, and there\u0027s plenty of evidence we started this problem.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh? Such as?\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-29T02:29:27Z","Content":"\n\u003Cp\u003ECalling out those who are unreasonable furthers the pursuit of reason, Wesreidau. The idea is not to call those who disagree names, the idea is to remind the world that an overwhelming scientific consensus exists and that people who irrationally deny climate change should not be making policy for the United States.\u003C/p\u003E\u003Cp\u003EEdit: though on reading the site, they seem a bit lax in their selection. Joe Heck is called a denier because he voted to allow offshore oil drilling on the Outer Continental Shelf...whether you like the idea or not, that\u0027s not exactly climate change denial.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T02:39:52Z\u0022 title=\u002208/29/2013 02:39  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by Kimberly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-08-29T02:48:41Z","Content":"\n\u003Cp\u003EHurricane names are one thing. U.S. policy is something entirely different. If you shut down coal fired plants, there had better be a plan B. If my neighbors air conditioner goes out, no big deal, he just gets hot and pissed off. If he runs out of food and gets hungry, that\u0027s something to worry about. People get desperate when they are hungry. Bad **** happens.\u003C/p\u003E\n"},{"CreatedByName":"Wesreidau","CreatedById":75430,"CreatedDateTime":"2013-08-29T02:59:37Z","Content":"\n\u003Cp\u003EReason furthers wisdom, and petty sophistries further petty minds. Naming hurricanes after climate change deniers is simply personal attacks to insult one point of view. One man\u0027s stance about a climate science theory does not make him responsible for a weather pattern any more than one man\u0027s stance on germ theory makes him responsible for an epidemic. His individual actions might leave him responsible for some tiny fraction of the incident, but you cannot blame one person not covering his mouth when he sneezes for an outbreak of influenza on another continent. Would you have blizzards named after AGW backers? Their efforts to reduce CO2 emissions cause automobile accidents on icy roads, hypothermia, and frost on Florida orange trees. Those claims are just as nonsensical as AGW deniers being blamed for hurricanes.\u003C/p\u003E\u003Cp\u003EIt is far better for everyone if unreasonable people are defeated with reason, rather than both sides becoming unreasonable.\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-29T03:20:56Z","Content":"\n\u003Cp\u003EDespite whatever consensus exists, I remain skeptical that anthropogenic forces are the sole and sufficient explanation for recently observed changes in climate. Explaining recent patterns of climate change may necessitate inclusion of anthropogenic factors, but that is not the same as those factors sufficing to explain the changes.\u003C/p\u003E\u003Cp\u003EEarth\u0027s climate has changed more or less forever, and in particular during the past ~1.3 million years of the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Quaternary\u0022 rel=\u0022external nofollow\u0022\u003EQuaternary period\u003C/a\u003E, tremendous evidence indicates a pattern of more rapid and extreme oscillations in climate than the much more gradual pattern of cooling during the preceding two eras of the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Cenozoic\u0022 rel=\u0022external nofollow\u0022\u003ECenozoic\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ESo in sum, dramatic and possibly quite rapid variation in climatic patterns has been the rule, not the exception for the past 1.2 or so million years, and this pattern over the last 1.2 million years is a clear departure from a generally slower and more gradually fluctuating climate during the preceding 65 million years.\u003C/p\u003E\u003Cp\u003ENone of this in any way \u0027disproves\u0027 the signs that Earth\u0027s climate has been warming, that greenhouse gases have increased, that sea level is rising, and that weather patterns have become more erratic, and extreme. Those observations appear superficially to be sound and valid, and to the extent that the aforementioned \u0022consensus\u0022 is specific to those observations, then it seems fitting.\u003C/p\u003E\u003Cp\u003EThe problem I have with the standard rhetoric of climate changes \u0027science\u0027 going all the way back to the \u003Ca href=\u0022https://en.wikipedia.org/wiki/IPCC\u0022 rel=\u0022external nofollow\u0022\u003EIPCC\u003C/a\u003E findings (which incidentally get quoted by everyone still to this day) was that there has been virtually noconcern with developing models that would address how anthropogenic forces were interacting with the pre-existing patterns of fluctuation and change that the geological record (and historical records) show quite incontrovertible to have \u0027been there\u0027 when the industrial revolution ensued. Since then I have yet to see any advocate of climate change science, and the handy moral/ideological/political compass it tends to be presented alongside even bother to acknowledge that something might be gained from including geological climate change into \u0022global warming\u0022 anthropogenic change models, much less serious efforts to integrate insights about natural climatic variation into such anthropogenic models.\u003C/p\u003E\u003Cp\u003EThis combined with the moralistic and politicized tone and agenda have made me rather cynical about the whole thing.\u003C/p\u003E\u003Cp\u003EAs I\u0027ve said in other threads, I believe that reducing our ecological footprint is a good thing, nah an essential thing. But focusing on one supposed culprit, even specifically for warming trends, is a risky venture at best. I fear that the cult like focus on carbon emissions may well have distracted our attention from other equally important environmental problems.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T03:29:57Z\u0022 title=\u002208/29/2013 03:29  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by Diche Bach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wesreidau","CreatedById":75430,"CreatedDateTime":"2013-08-29T03:35:02Z","Content":"\n\u003Cp\u003EAve, Horatius. Hold the bridge well.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-08-29T05:43:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003ECalling out those who are unreasonable furthers the pursuit of reason, Wesreidau. The idea is not to call those who disagree names, the idea is to remind the world that an overwhelming scientific consensus exists and that people who irrationally deny climate change should not be making policy for the United States.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is no consensus on anthropogenic climate change. There isn\u0027t even a consensus on which way the climate is changing. Basically, the fact that it\u0027s changing is pretty much the only thing everyone in the scientific community agrees with. But since it has always been changing, and none of the models in place are sufficiently good to even agree with the pre-industrial record, claiming that we know how humans are affecting it all is just silly.\u003C/p\u003E\u003Cp\u003ENow, I agree that it\u0027s better to be safe than sorry, and we know of ways in which we can reduce our impact on the environment, even if we don\u0027t completely understand what that impact is. And it\u0027s a good idea to try and scale back on emissions, try to stop deforestation, and so on. This is true regardless of whether these things impact global climate in a significant way.\u003C/p\u003E\u003Cp\u003EBut it bugs me when people try and claim that we understand anything about how we impact global climate, that it\u0027s certainly for the worse, and that this is something that everyone in the field has agreed upon. This just isn\u0027t so. We don\u0027t know what we are dealing with, and there is no consensus. There is no need to misinform the public further to try and convince them to do the \u0022right thing\u0022. Being responsible to local environment shouldn\u0027t be something you have to scare people into using a made up global crisis.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-08-29T06:46:51Z","Content":"\n\u003Cp\u003EI don\u0027t think climate change requires protesting, especially not with ad hominen attacks. It requires awareness and the removal of corporate sponsorship in US political campaigns.\u003C/p\u003E\u003Cp\u003EThere are several facts that *everybody* agrees on:\u003C/p\u003E\u003Cp\u003E- The Earth\u0027s climate is measurably changing.\u003C/p\u003E\u003Cp\u003E- The Earth\u0027s climate has varied a lot over millions of years in the past, but never this rapidly.\u003C/p\u003E\u003Cp\u003E- Extreme climate change will have negative effects on human activity.\u003C/p\u003E\u003Cp\u003E- Burning stuff emits CO2, which is a greenhouse gas.\u003C/p\u003E\u003Cp\u003E- We have only be massively burning stuff for the last century or two.\u003C/p\u003E\u003Cp\u003E- There is a finite amount of stuff to burn.\u003C/p\u003E\u003Cp\u003E- Big corporations don\u0027t want to stop burning stuff.\u003C/p\u003E\u003Cp\u003E- Environmentalists want us to stop burning stuff.\u003C/p\u003E\u003Cp\u003EAnd there is the stuff that we do not agree on:\u003C/p\u003E\u003Cp\u003E- Whether climate change was caused by human activity.\u003C/p\u003E\u003Cp\u003E- Whether we need to stop burning stuff.\u003C/p\u003E\u003Cp\u003E- Whether we can actually fix it.\u003C/p\u003E\u003Cp\u003ENow, there are at least 2 events going on at the same time that are unprecedented in the millions of years of historical data that we have:\u003C/p\u003E\u003Cp\u003E- An unprecedented rapid change of climate.\u003C/p\u003E\u003Cp\u003E- An unprecedented industrial and demographical explosion of one species.\u003C/p\u003E\u003Cp\u003ECorrelation doesn\u0027t imply causality, but it would be foolish to not consider it. We can\u0027t necessarily confirm the causality (although mechanisms are suggested), and we can\u0027t deny it either. Science is never about certainty, but about establishing predictable models. Climate and weather are chaotic in nature (the butterfly effect...), which makes them hard to model and predict. Our models are currently imprecise and need refining, but ultimately, does it matter what triggered the changes in the climate? The question is, what do we do about it? When your house is on fire, whatever the cause, do you keep on throwing wood into the fireplace? \u003C/p\u003E\u003Cp\u003EWe have two options:\u003C/p\u003E\u003Cp\u003E- Stop making things worse by burning more stuff.\u003C/p\u003E\u003Cp\u003E- Ignore the fire alarms and keep on with business as usual.\u003C/p\u003E\u003Cp\u003EThe main force that is driving the \u0022let\u0027s ignore climate change\u0022 current is big corporations who want business as usual. They don\u0027t want to invest in the future because their main focus is on next year\u0027s earnings and they can\u0027t project themselves over a decade or two. Incidentally, they also have the money to influence politicians and the public opinion, especially in the US which is the only democratic country where political campaigns are paid for by corporations.\u003C/p\u003E\u003Cp\u003EWhen people complain about the political influence of environmentalists, I think that the political influence of corporations is much more dangerous.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T06:58:52Z\u0022 title=\u002208/29/2013 06:58  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-08-29T06:48:23Z","Content":"\n\u003Cp\u003EVoice of reason, K^2 and DicheBach. \u003C/p\u003E\u003Cp\u003EI can\u0027t believe how far we have gotten with this climate change thing. When it was just starting out, there was still some open discussion, now there\u0027s just name-calling and popularity contests. I can tell you that the 97% metric, so often cited by the alarmists, is completely bogus. I work with scientists every day, they are our customers. None of them simply says \u0022yes\u0022 or \u0022no\u0022, the discussion there is ambivalent in the same way it is ambivalent in the general public. The data is unreliable or the models are wrong. Heck, the whole idea is based on turbulence, one of the last unsolved problems of classical physics.\u003C/p\u003E\u003Cp\u003EWhat I dislike is when people call CO2 a pollutant. That to me is just evil tactics. If anything, it\u0027s an elixir of life, you and I wouldn\u0027t live without CO2. Plants build 90% of their body mass from CO2 through photosynthesis. We eat plants. CO2 levels used to be much much higher historically and they\u0027ve been so low in the past couple million years that plants are actually suffocating - they had to evolve a more efficient method of extracting CO2 from the atmosphere (C4 photosynthesis). CO2 have been so low because all the carbon has been deposited underground and there is not enough to go around in the biosphere. There used to be rain forests in Antarctica. Barring anthropocentric arguments, rising CO2 levels is actually good for nature. If you double the CO2 concentration in the atmosphere, plant size doubles as well.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wattsupwiththat.files.wordpress.com/2012/06/image4.png\u0022 alt=\u0022image4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBy the way, the Earth has been actually getting colder in the past 10 years. I am not an antienvironmentalist, I think the environment is important. But I think science has been taken hostage by political forces trying to hold people down in this matter.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-08-29T07:10:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThere are several facts that *everybody* agrees on:\u003Cp\u003E- The Earth\u0027s climate has varied a lot over millions of years in the past, but never this rapidly.\u003C/p\u003E\u003Cp\u003E- Burning stuff emits CO2, which is a greenhouse gas.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think these two require clarification. We don\u0027t have evidence of climate changing this rapidly in the past, but the further back we go, the harder it is to detect rapid changes. Its very difficult to say just how rapid some of the past climate shifts have been. And some of them have been rapid enough to cause serious ecological problems. It\u0027s possible that these are also related to some mass emissions, like volcanic eruptions, meteorite strikes, etc. But we just don\u0027t know. There are some problems with data as well. There is major bias in where we have been taking measurements and what we are comparing them to.\u003C/p\u003E\u003Cp\u003EAs for CO\u003Csub\u003E2\u003C/sub\u003E being the greenhouse gas, the main problem is with what we mean by the greenhouse gases. The greenhouse model of environment heating is simply wrong. An actual glass greenhouse placed in vacuum would have the same equilibrium temperature as a bare rock. The reason greenhouses work down here is because they are placed in an environment. The way the atmosphere heats up the planet is way more complicated and has to do with convective cycles and radiation equilibria at different altitudes. The atmosphere, in this case, works as a heat pump, not a greenhouse. If the atmosphere was perfectly stable, with no convective flows, CO\u003Csub\u003E2\u003C/sub\u003E in upper atmosphere would actually result in \u003Cem\u003Ecooling\u003C/em\u003E, due to reduction in IR albedo. Despite that, many estimates on impact of CO\u003Csub\u003E2\u003C/sub\u003E are done based on the faulty greenhouse model. In fact, I have not seen a good workup on how CO\u003Csub\u003E2\u003C/sub\u003E actually affects global temperatures that takes weather into account. I wonder if that might be because \u0022everyone knows that CO\u003Csub\u003E2\u003C/sub\u003E is a greenhouse gas.\u0022\u003C/p\u003E\u003Cp\u003ENothing about climate is that clear cut. We need to be talking about it. We need to be doing more research. Convincing people that we have reached consensus is actually extremely counterproductive.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-08-29T07:52:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jackissimus\u0022 data-cite=\u0022Jackissimus\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhat I dislike is when people call CO2 a pollutant. That to me is just evil tactics. If anything, it\u0027s an elixir of life, you and I wouldn\u0027t live without CO2. Plants build 90% of their body mass from CO2 through photosynthesis. We eat plants. CO2 levels used to be much much higher historically and they\u0027ve been so low in the past couple million years that plants are actually suffocating - they had to evolve a more efficient method of extracting CO2 from the atmosphere (C4 photosynthesis). CO2 have been so low because all the carbon has been deposited underground and there is not enough to go around in the biosphere. There used to be rain forests in Antarctica. Barring anthropocentric arguments, rising CO2 levels is actually good for nature. If you double the CO2 concentration in the atmosphere, plant size doubles as well.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think anybody said that CO2 wasn\u0027t good for plants, but that doesn\u0027t mean that it can\u0027t have a negative impact elsewhere. Water is also good for life on Earth, but flooding and tsunamis can kill us. It\u0027s all a question of balance.\u003C/p\u003E\u003Cp\u003EAnyway, life on Earth has nothing to worry about; it will survive with or without us. Species disappear or evolve, others emerge; that\u0027s no big deal in the grand scheme of things. What we should worry about are the consequences of climate change on human activity: if some areas become unhospitable or uninhabitable, it could lead to famine, mass migration, war... A new balance will have to emerge. As a species, I have no doubt that we will survive, but not without massive suffering and political instability.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T07:54:44Z\u0022 title=\u002208/29/2013 07:54  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-08-29T08:01:32Z","Content":"\n\u003Cp\u003EPeople get very focussed on CO\u003Csub\u003E2\u003C/sub\u003E, but the fact is that most of our energy-producing equipment that has a high-CO\u003Csub\u003E2\u003C/sub\u003E output is also a nightmare for other pollutants such as nitrogen oxides, sulfur and particulates. Replacing all our coal-burning power plants would be a good idea even if you ignore carbon.\u003C/p\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-08-29T08:02:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EI don\u0027t think anybody said that CO2 wasn\u0027t good for plants, but that doesn\u0027t mean that it can\u0027t have a negative impact elsewhere. Water is also good for life on Earth, but flooding and tsunamis can kill us. It\u0027s all a question of balance.\u003Cp\u003EAnyway, life on Earth has nothing to worry about; it will survive with or without us. Species disappear or evolve, others emerge; that\u0027s no big deal in the grand scheme of things. What we should worry about are the consequences of climate change on human activity: if some areas become unhospitable or uninhabitable, it could lead to famine, mass migration, war... A new balance will have to emerge. As a species, I have no doubt that we will survive, but not without massive suffering and political instability.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPossible, possible. But the counter measures as suggested now are so expensive that they will also cause major political upheaval and massive suffering.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-08-29T08:04:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EI don\u0027t think anybody said that CO2 wasn\u0027t good for plants, but that doesn\u0027t mean that it can\u0027t have a negative impact elsewhere. Water is also good for life on Earth, but flooding and tsunamis can kill us. It\u0027s all a question of balance.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot to mention H\u003Csub\u003E2\u003C/sub\u003EO being a much stronger greenhouse gas than CO\u003Csub\u003E2\u003C/sub\u003E and present in much higher concentrations in upper atmosphere. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But yeah, yeah, I know about non-overlapping spectra.\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-29T08:10:32Z","Content":"\n\u003Cp\u003EI think Jackissimus raises an excellent point, open discussion has been made heretical and that is not a good context in which learning and knowledge are generated. It is really quite deplorable.\u003C/p\u003E\u003Cp\u003EGood theories are transformed into scientific law, not by browbeating and ostracizing those with questions, but by allowing anyone with questions to \u0022throw it against the wall and see if it sticks.\u0022 I fear that in 20 years when the current generation of \u0027leaders,\u0027 lobbyists, and activists are past their prime and the evidence that the story is far more complicated than the rhetoric conveys simply cannot be ignored any longer, that suddenly there will be a sad denouement and a couple generations of well-meaning environmentalist young people (now middle aged) will realize that, all that passion they felt for that single silly model, may well have blinded them to the 1000 other issues that had all along been contributing to climatic changes and/or other forms of environmental degradation: nitrogenous wastes, heavy metals waste, wasted precious metals in electronic, continued expansion of invasive species and pathogen, extinction of species that we could\u0027ve saved (gray and little brown bats, African wild dogs to name only acouple that are likely goners within the next 20 years) . . .\u003C/p\u003E\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2013-08-29T08:27:07Z","Content":"\n\u003Cp\u003EHmm, climate is changing. Thats true, Ve contribute to those changes. thats also true. How much we contribute, is qestionable.\u003C/p\u003E\u003Cp\u003EAnyway, we as humans should minimize our impact to nature to prevent unvanted damage that could bite us in the ass. Thats logic.\u003C/p\u003E\u003Cp\u003EBut the form, the form.\u003C/p\u003E\u003Cp\u003EThis kind of pettitions is one of the stupidest form of figting. Seriously pointing out on people that opose us, saying: \u0022look a bad person\u0022? Naming bad things after people we dont like? Thats childisch, so childish.\u003C/p\u003E\u003Cp\u003EIts still better than tiing yourself to the tracks in front of the train (thats really stupid), but still stupid. \u003C/p\u003E\u003Cp\u003EThis kind of behaviour undermines all our effort. Because it more or less makes us look as mindless childish radicals and people who see this will never take us seriously.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T08:31:17Z\u0022 title=\u002208/29/2013 08:31  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by KOCOUR\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"palker","CreatedById":67355,"CreatedDateTime":"2013-08-29T08:30:09Z","Content":"\n\u003Cp\u003EClimate is changing ok. The question is: Why should i care? Most likely by the time some real cereal stuff happens i will be dead or to old to notice.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/h05YfP_8UsU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T08:32:41Z\u0022 title=\u002208/29/2013 08:32  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by palker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-08-29T08:52:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003ENot to mention H\u003Csub\u003E2\u003C/sub\u003EO being a much stronger greenhouse gas than CO\u003Csub\u003E2\u003C/sub\u003E and present in much higher concentrations in upper atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was saving that point for counter-arguments \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI guess what peeves me is when I have to listen to 15-year old girls on the bus talking about CO2 being \u0022toxic\u0022 and that the evil factories want to poison us all by releasing more of it in the atmosphere. It\u0027s starting to resemble propaganda more than science. If it was real science, those girls wouldn\u0027t care, lol.\u003C/p\u003E\u003Cp\u003EI understand that the above example is a bit extreme, but I had a long discussion with a truck driver recently (yeah I meet a lot of different people) and he was saying that burning things is just evil, we should stop burning things. But burning is just a natural process, it\u0027s part of the carbon cycle just as well as decomposition is. Some forests cannot even grow without first burning down. Storing all carbon in underground fossil deposits might be even more dangerous to life. Why should all human activity be automatically evil? I for one am very proud of human achievements and nature might even be very grateful to us for spreading life to other planets one day.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-08-29T09:42:23Z","Content":"\n\u003Cp\u003EWell, there are real reasons why CO\u003Csub\u003E2\u003C/sub\u003E can have significant impact despite the fact that absorption is already saturated at these wavelengths and that it\u0027s a minor fraction of total absorption when compared to how much water vapor contributes. Basically, altitude at which IR equilibrium is achieved is more sensitive to CO\u003Csub\u003E2\u003C/sub\u003E levels than H\u003Csub\u003E2\u003C/sub\u003EO levels. The problem is that we still don\u0027t know at what point that actually becomes a problem, because modeling this stuff is insanely difficult, and experimenting with it directly is not practically possible.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-08-29T10:19:04Z","Content":"\n\u003Cp\u003ELike others have said, ad hominem attacks are no way to push a point of view.\u003C/p\u003E\u003Cp\u003EFurthermore, there has always been extreme weather, regardless of climatic conditions at the time.\u003C/p\u003E\u003Cp\u003EIn any case, i\u0027m surprised the whole AGW thing is still kicking on. The beginning of the end started with Climategate. Leadership of developed nations have been backing away from it since then. Big money behind carbon credits have pulled out. Developing nations were never onboard, since it\u0027s always been a secular western thing.\u003C/p\u003E\u003Cp\u003ESome gems from Climategate...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EMike Mann refuses to talk to these people and I can understand why. They are just trying to find if we\u0027ve done anything wrong. Ã¢â‚¬â€œ Phil Jones\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWe also have a Data Protection Act, which I will hide behind. Ã¢â‚¬â€œ Phil Jones\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt would be nice to try to \u0022contain\u0022 the putative \u0022Medieval Warm Period\u0022. Ã¢â‚¬â€œ Michael Mann\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe fact is that we can\u0027t account for the lack of warming at the moment and it is a travesty that we can\u0027t. Ã¢â‚¬â€œ Kevin Trenberth\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat kind of science where they doing exactly?!\u003C/p\u003E\n"},{"CreatedByName":"Omicron314","CreatedById":59506,"CreatedDateTime":"2013-08-29T12:07:20Z","Content":"\n\u003Cp\u003ELet\u0027s see, a new name is added once every 5.7 seconds on average as far as I can tell, and with about 8040 names to go, this will take about 26 and a half more minutes. That seems too fast, but math, I suppose.\u003C/p\u003E\n"}]}