{"TopicId":45104,"ForumId":44,"TopicTitle":"This would be fun on Duna.","CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-09-06T09:29:00Z","PageNum":1,"Articles":[{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-09-06T09:29:00Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/mNXBfz1iVzc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cbr\u003E\u003Cbr\u003ENow imagine sliding down a Dunan dune with a dry ice surfboard. Awesome.\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-06T09:55:34Z","Content":"\n\u003Cp\u003EXD, yes it would.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-09-06T10:48:12Z","Content":"\n\u003Cp\u003EThis is why I laugh at some scientists claiming the so called \u0027river valleys\u0027 are evidence of water on Mars. It\u0027s a joke to me because they are allowing their own biases to color to interpret the evidence. \u003C/p\u003E\u003Cp\u003EIn essence they\u0027ve already made a conclusion that Mars has water based on wishful thinking, and then when the data eventually comes in, they try to bend the data to support the conclusion instead of looking at the data from a blank slate.\u003C/p\u003E\u003Cp\u003EI for one believe that Mars probably once had water millions/billions of years ago. But as of today, it has NONE. At most it\u0027s all locked up at the poles. The so-called valleys elsewhere are no evidence of \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eancient\u003C/span\u003E actively flowing water because judging from geological activity of Mars from sandstorms, these valleys would have been eroded and covered up. Which the video showed nicely that the valleys are caused by dry ice, something I had suspected for a damn long time. \u003C/p\u003E\u003Cp\u003EEven the topic of the Mars Phoenix lander digging and finding white \u0027water ice\u0027 that evaporated away, is ridiculous, because that behavior of sublimation is more consistent with CO2 ice. They have taken zero samples to determine if it was confirmed to be water ice, instead they did a visual conclusion that it was water. That really got on my nerves because they were just forcing their wishful thinking on the data.\u003C/p\u003E\u003Cp\u003EI\u0027m glad JPL in this video performed the experiment to actually find out the truth.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-06T15:21:22Z\u0022 title=\u002209/06/2013 03:21  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 6, 2013\u003C/time\u003E by Levelord\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"spectrhz","CreatedById":69106,"CreatedDateTime":"2013-09-06T12:05:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EThis is why I laugh at some scientists claiming the so called \u0027river valleys\u0027 are evidence of water on Mars. It\u0027s a joke to me because they are allowing their own biases to color to interpret the evidence. \u003Cp\u003EIn essence they\u0027ve already made a conclusion that Mars has water based on wishful thinking, and then when the data eventually comes in, they try to bend the data to support the conclusion instead of looking at the data from a blank slate.\u003C/p\u003E\u003Cp\u003EI for one believe that Mars probably once had water millions/billions of years ago. But as of today, it has NONE. At most it\u0027s all locked up at the poles. The so-called valleys elsewhere are no evidence of ancient water because judging from geological activity of Mars from sandstorms, these valleys would have been eroded and covered up. Which the video showed nicely that the valleys are caused by dry ice, something I had suspected for a damn long time. \u003C/p\u003E\u003Cp\u003EEven the topic of the Mars Phoenix lander digging and finding white \u0027water ice\u0027 that evaporated away, is ridiculous, because that behavior of sublimation is more consistent with CO2 ice. They have taken zero samples to determine if it was confirmed to be water ice, instead they did a visual conclusion that it was water. That really got on my nerves because they were just forcing their wishful thinking on the data.\u003C/p\u003E\u003Cp\u003EI\u0027m glad JPL in this video performed the experiment to actually find out the truth.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, there are many interesting claims about mars from many people I have talked to, ranging from oceans coming out in Martian summer, to people telling me that NASA adds the red color to mars in pictures after the fact...\u003C/p\u003E\n"},{"CreatedByName":"Lanfranc","CreatedById":67288,"CreatedDateTime":"2013-09-06T12:18:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EI for one believe that Mars probably once had water millions/billions of years ago. But as of today, it has NONE. At most it\u0027s all locked up at the poles. The so-called valleys elsewhere are no evidence of ancient water because judging from geological activity of Mars from sandstorms, these valleys would have been eroded and covered up. Which the video showed nicely that the valleys are caused by dry ice, something I had suspected for a damn long time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would love to see the dry ice that could create something like \u003Ca href=\u0022http://www.esa.int/Our_Activities/Space_Science/Mars_Express/Kasei_Valles_outflow_channel_system\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThe features that they\u0027re talking about here are completely different from the river valleys. The rivers are found in rock and have specific courses and outlets, whilst these are found in the sand and are just straight troughs that seem to end in nothing. That\u0027s precisely why they could not be identified as rivers, but had to be something else. So it\u0027s interesting in that sense, but it doesn\u0027t disprove any previous conclusions.\u003C/p\u003E\n"},{"CreatedByName":"Matt56","CreatedById":59493,"CreatedDateTime":"2013-09-06T14:59:06Z","Content":"\n\u003Cp\u003E^^ Agreed. I think it\u0027s too early to call the water theory busted just because of one experiment.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-09-06T15:03:13Z","Content":"\n\u003Cp\u003EWAY too early, especially in light of the detection of clay-based minerals in flow channels that commonly form in the presence of free flowing water.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-06T16:06:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EThis is why I laugh at some scientists claiming the so called \u0027river valleys\u0027 are evidence of water on Mars. It\u0027s a joke to me because they are allowing their own biases to color to interpret the evidence. \u003Cp\u003EIn essence they\u0027ve already made a conclusion that Mars has water based on wishful thinking, and then when the data eventually comes in, they try to bend the data to support the conclusion instead of looking at the data from a blank slate.\u003C/p\u003E\u003Cp\u003EI for one believe that Mars probably once had water millions/billions of years ago. But as of today, it has NONE. At most it\u0027s all locked up at the poles. The so-called valleys elsewhere are no evidence of \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eancient\u003C/span\u003E actively flowing water because judging from geological activity of Mars from sandstorms, these valleys would have been eroded and covered up. Which the video showed nicely that the valleys are caused by dry ice, something I had suspected for a damn long time. \u003C/p\u003E\u003Cp\u003EEven the topic of the Mars Phoenix lander digging and finding white \u0027water ice\u0027 that evaporated away, is ridiculous, because that behavior of sublimation is more consistent with CO2 ice. They have taken zero samples to determine if it was confirmed to be water ice, instead they did a visual conclusion that it was water. That really got on my nerves because they were just forcing their wishful thinking on the data.\u003C/p\u003E\u003Cp\u003EI\u0027m glad JPL in this video performed the experiment to actually find out the truth.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept that they never said there was flowing water on Mars based on the data you mention, hereby offering a possibility that someone someday would use a straw man argument about their supposed incompetence.\u003C/p\u003E\u003Cp\u003EThe only flowing water on Mars that has ever been hypothesized are possible and rare occurences of muddy burps that occasionally come to the surface and quickly freeze, eventually mostly subliming and leaving marked regolith behind.\u003C/p\u003E\u003Cp\u003EWhat\u0027s been talked about ad nauseam is the evidence of flowing water \u003Cem\u003Ein the past\u003C/em\u003E. There\u0027s plenty of evidence to support that.\u003C/p\u003E\u003Cp\u003EI also don\u0027t remember anyone ever mentioning water ice just below the surface. When Phoenix scratched the surface, everyone was talking about dry ice. Maybe you should check your sources because these are two straw men right here.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-09-06T16:11:27Z","Content":"\n\u003Cp\u003EAlso, and a small but important point... I\u0027m pretty sure the sands on Earth are a wee bit warmer than the sands of Mars. I would expect the dry ice sublimation to go far, far slower.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-06T16:19:33Z","Content":"\n\u003Cp\u003EAnyway, to get back to the OP....\u003C/p\u003E\u003Cp\u003ETw1, that was every interesting. Thanks for posting. I\u0027d been wondering about these features myself and the explanations I\u0027d heard of they being ooze features from some sort of C02/water/dirt slurry just under the surface just didn\u0027t seem right to me. It never occurred to me that blocks of dry ice might be doing it, even though now it looks quite obvious \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-09-06T16:43:01Z","Content":"\n\u003Cp\u003EActually, there are still a handful of (low) places on the surface Mars where the pressure (and temperature, too, on \u0022warm\u0022 days) can support \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Estable\u003C/span\u003E liquid water (barely!). It\u0027s really not that much of a stretch to imagine that somewhere underground, it could melt, and be stable for longer periods. It only needs to break out onto the surface very rarely to carve the evidence for recent water flow we seem to have spotted.\u003C/p\u003E\u003Cp\u003EJust because Mars, on the surface, initially looks cold and dead and dry doesn\u0027t mean it is; if there is anything planetary science has taught us, it is to expect the unexpected. A geologically active moon only 500 km across with giant geysers and probable liquid water lakes under its surface is a FAR more unlikely proposition than a Mars that has maintained a few pockets of liquid water deep underground, and yet, Enceladus exists.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-06T16:48:48Z\u0022 title=\u002209/06/2013 04:48  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 6, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-06T17:04:03Z","Content":"\n\u003Cp\u003EWhere are those places? Pressure is extremely low all over the surface. No doubt there are liquid water pockets deep down where the pressures are high enough, but the surface? Theres no evidence to support it, and everything we know about water says it\u0027s impossible.\u003C/p\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2013-09-06T17:35:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spectrhz\u0022 data-cite=\u0022spectrhz\u0022\u003E\u003Cdiv\u003EIndeed, there are many interesting claims about mars from many people I have talked to, ranging from oceans coming out in Martian summer, to people telling me that NASA adds the red color to mars in pictures after the fact...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs a point of interest, NASA adding the colors is both true and false. The cameras used by things like hubble or the Mars Rover aren\u0027t color cameras, though I don\u0027t think that black and white would be correct either, not by conventional usage. They are broad spectrum, capable of seeing a massive spectrum of light, but record only the magnitude, not the color, and instead take pictures through filters allowing only specific wavelengths to pass (and the single images are usually displayed in black and white). To get an image like the one we might see, they have to use 3 filters on 3 different shots that correspond to the colors our eyes are sensitive to, and then combine them. The Mars rover actually had 8 such filters (for seeing things outside the visible spectrum), while Hubble has 40.\u003C/p\u003E\u003Cp\u003EYou can see the explanation and some pictures \u003Ca href=\u0022http://www.universetoday.com/11863/true-or-false-color-the-art-of-extraterrestrial-photography/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E if you like.\u003C/p\u003E\u003Cp\u003EAnd of course, all this is done so that they can create images that provide whatever is considered the import or desired information, by using specific filters and filter combinations.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-09-06T17:55:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EWhere are those places? Pressure is extremely low all over the surface. No doubt there are liquid water pockets deep down where the pressures are high enough, but the surface? Theres no evidence to support it, and everything we know about water says it\u0027s impossible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWrong. Why didn\u0027t you look it up first?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Hellas_Planitia\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Hellas_Planitia\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe highest pressure at the lowest elevation in this region of Mars is supposedly 1.16 kPa.\u003C/p\u003E\u003Cp\u003EThe lowest pressure at which water can be a stable liquid is 0.612 kPa, this is the triple point.\u003C/p\u003E\u003Cp\u003EIt is possible for liquid water to remain stable in this area of Mars, but in a narrow temperature range.\u003C/p\u003E\u003Cp\u003ETo quote the wikipedia article,\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe altitude difference between the rim and the bottom is 9,000 m (30,000 ft). The depth of the crater (7,152 m (23,465 ft)[1] ( 7,000 m (23,000 ft)) below the standard topographic datum of Mars) explains the atmospheric pressure at the bottom: 1,155 Pa[1] (11.55 mbar, 0.17 psi, or 0.01 atm). This is 89% higher than the pressure at the topographical datum (610 Pa, or 6.1 mbar or 0.09 psi) and above the triple point of water, suggesting that the liquid phase could be present under certain conditions of temperature, pressure, and dissolved salt content.[7] It has been theorized that a combination of glacial action and explosive boiling may be responsible for gully features in the crater.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETechnically, it shouldn\u0027t even be necessary to mix salt into the water to keep it liquid, distilled water should be stable if the temperature is right, but salt would certainly help, as it would lower the melting point, and extend the range in which water would be stable.\u003C/p\u003E\u003Cp\u003EBUT, all that said, while it is technically true to say that there are still places where water is stable on the surface of Mars, it is important to remember that it is only in a narrow range of temperatures (like maybe 10-20 degrees C, don\u0027t remember the exact range), unlike Earth, where water is stable over comparatively a huge range of temperatures (100 degrees C). Furthermore, those temperatures lie near the upper end of the hottest temperatures Mars experiences.\u003C/p\u003E\u003Cp\u003EBUT, again, you mix in the right antifreeze compound, and you could certainly extend that range quite a bit- how much exactly, I don\u0027t know though.\u003C/p\u003E\u003Cp\u003EPersonally, I wouldn\u0027t say there is \u0022no doubt\u0022 that Mars has liquid water pockets underground, it seems like a strong possibility, but we need to collect more evidence at this point.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-06T18:13:21Z\u0022 title=\u002209/06/2013 06:13  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 6, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-06T19:03:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EWrong. Why didn\u0027t you look it up first?\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Hellas_Planitia\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Hellas_Planitia\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe highest pressure at the lowest elevation in this region of Mars is supposedly 1.16 kPa.\u003C/p\u003E\u003Cp\u003EThe lowest pressure at which water can be a stable liquid is 0.612 kPa, this is the triple point.\u003C/p\u003E\u003Cp\u003EIt is possible for liquid water to remain stable in this area of Mars, but in a narrow temperature range.\u003C/p\u003E\u003Cp\u003ETo quote the wikipedia article,\u003C/p\u003E\u003Cp\u003ETechnically, it shouldn\u0027t even be necessary to mix salt into the water to keep it liquid, distilled water should be stable if the temperature is right, but salt would certainly help, as it would lower the melting point, and extend the range in which water would be stable.\u003C/p\u003E\u003Cp\u003EBUT, all that said, while it is technically true to say that there are still places where water is stable on the surface of Mars, it is important to remember that it is only in a narrow range of temperatures (like maybe 10-20 degrees C, don\u0027t remember the exact range), unlike Earth, where water is stable over comparatively a huge range of temperatures (100 degrees C). Furthermore, those temperatures lie near the upper end of the hottest temperatures Mars experiences.\u003C/p\u003E\u003Cp\u003EBUT, again, you mix in the right antifreeze compound, and you could certainly extend that range quite a bit- how much exactly, I don\u0027t know though.\u003C/p\u003E\u003Cp\u003EPersonally, I wouldn\u0027t say there is \u0022no doubt\u0022 that Mars has liquid water pockets underground, it seems like a strong possibility, but we need to collect more evidence at this point.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know about Hellas Planitia. I still refuse to accept the possibility of any flowing water. This is why.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Phase_diagram_of_water.svg/725px-Phase_diagram_of_water.svg.png\u0022 alt=\u0022725px-Phase_diagram_of_water.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is for pure water. If the pressure is 1.155 pascals at the bottom, the range is around 0-20Ã‚Â°C. Below that is ice (subliming more and more as you\u0027re getting closer to the liquid phase) and above that is vapor.\u003C/p\u003E\u003Cp\u003EMars is much colder and it would take a load of salt to change the graph. It can be calculates if we know what salt we\u0027re talking about. Even with the impure water, you can expect liquid evaporating in less than a day. I agree there are probably burps of water, but no ponds and flowing water.\u003C/p\u003E\u003Cp\u003EI used \u0022no doubt\u0022 colloquially. Of course we don\u0027t still have evidence, but the theory clearly states there should be liquid water, you only have to dig deep enough. Water is abundant in universe.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-06T19:06:02Z\u0022 title=\u002209/06/2013 07:06  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 6, 2013\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-09-06T19:04:52Z","Content":"\n\u003Cp\u003EKeep that ice nine away from me... O_o\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-09-06T20:04:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EI know about Hellas Planitia. I still refuse to accept the possibility of any flowing water. This is why.\u003Cp\u003E\u003Cimg src=\u0022...\u0022 alt=\u0022...\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is for pure water. If the pressure is 1.155 pascals at the bottom, the range is around 0-20Ã‚Â°C. Below that is ice (subliming more and more as you\u0027re getting closer to the liquid phase) and above that is vapor.\u003C/p\u003E\u003Cp\u003EMars is much colder and it would take a load of salt to change the graph. It can be calculates if we know what salt we\u0027re talking about. Even with the impure water, you can expect liquid evaporating in less than a day. I agree there are probably burps of water, but no ponds and flowing water.\u003C/p\u003E\u003Cp\u003EI used \u0022no doubt\u0022 colloquially. Of course we don\u0027t still have evidence, but the theory clearly states there should be liquid water, you only have to dig deep enough. Water is abundant in universe.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk. I don\u0027t see where there is any disagreement, other than what the definition of \u0022flowing water\u0022 is. I am not talking about permanent rivers or lakes or even streams; to me, occasional rare \u0022burps and spurts\u0022, as you put them, can count as flowing water, because the water could still last long enough on the surface to flow, MAYBE a few kilometers at best (probably more like a few hundred meters), and carve a few short features. The lifetime would be short and dependent on salinity, pressure, and temperature. As I understand it, this is, in fact, what scientists ARE talking about when they are discussing recent evidence of \u0022flowing water\u0022 on Mars. Not flowing, STABLE water. \u003C/p\u003E\u003Cp\u003EHOWEVER, MAYBE, if the water was \u0022lucky\u0022, it might spurt out of the bottom of the Hellas Basin on a warm day, somehow maintain itself in the right temperature range all day long, and only freeze when the sun went down at night. MAYBE, once in an even rarer while, when the Sun comes up the next day, some will remain and it might remelt and sit there for a second day, somehow maintaining that narrow temperature range... but it\u0027s gonna be a very, very rare event probably.\u003C/p\u003E\u003Cp\u003EI just hate totally unequivocal statements like \u0022I refuse to accept the possibility of \u0026lt;insert here\u0026gt;.\u0022 Nature can surprise you. The ignorant man thinks he knows everything; the wise man knows nothing is truly certain. It is certainly within the realm of possibility- \u003Cem\u003Every unlikely\u003C/em\u003E but \u003Cem\u003Epossible\u003C/em\u003E that there is a spring somewhere on the surface of Mars where a small trickle of water has been flowing out onto the surface and collecting in some small pool as it evaporates/boils/freezes/sublimates away, and has been doing this continuously for years. We probably would have spotted something like it already with MRO, but still... it\u0027s possible, especially if water can spurt out in \u0022burps\u0022 from time to time. Do you refuse to accept even the remote possibility of such a feature, either in the recent past, the present time, or near future?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-06T20:27:01Z\u0022 title=\u002209/06/2013 08:27  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 6, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"spectrhz","CreatedById":69106,"CreatedDateTime":"2013-09-06T20:20:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Randox\u0022 data-cite=\u0022Randox\u0022\u003E\u003Cdiv\u003EAs a point of interest, NASA adding the colors is both true and false. The cameras used by things like hubble or the Mars Rover aren\u0027t color cameras, though I don\u0027t think that black and white would be correct either, not by conventional usage. They are broad spectrum, capable of seeing a massive spectrum of light, but record only the magnitude, not the color, and instead take pictures through filters allowing only specific wavelengths to pass (and the single images are usually displayed in black and white). To get an image like the one we might see, they have to use 3 filters on 3 different shots that correspond to the colors our eyes are sensitive to, and then combine them. The Mars rover actually had 8 such filters (for seeing things outside the visible spectrum), while Hubble has 40.\u003Cp\u003EYou can see the explanation and some pictures \u003Ca href=\u0022http://www.universetoday.com/11863/true-or-false-color-the-art-of-extraterrestrial-photography/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E if you like.\u003C/p\u003E\u003Cp\u003EAnd of course, all this is done so that they can create images that provide whatever is considered the import or desired information, by using specific filters and filter combinations.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course, however my wording was a bit loose, I was referring to people that claim Mars is not red in any way, and that NASA adds any color to it later to make it appear red.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-06T20:22:56Z","Content":"\n\u003Cp\u003Eok |Velocity| , I see what you mean.\u003C/p\u003E\u003Cp\u003EThere are no surprises with experimentally determined facts. Mars is not a special place. Water is not a special chemical. There is this notion that things in space simply \u003Cem\u003Emust\u003C/em\u003E be very different because \u0022that\u0027s space\u0022.\u003C/p\u003E\u003Cp\u003EEarth is also part of the universe and shares natural laws and principles with other planetary bodies.\u003C/p\u003E\u003Cp\u003EI can say, without any doubt, that there is no stable water on the surface of Mars because the conditions don\u0027t allow it. Beneath the surface is a whole different story. Higher pressure and temperature.\u003C/p\u003E\u003Cp\u003EDo you know what is the largest reservoir of water on Earth? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-09-06T20:31:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDo you know what is the largest reservoir of water on Earth? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe not. I WOULD have thought the oceans, but I have heard that water helps lubricate plate tectonics, and that there is a considerable amount in the mantle. However, I didn\u0027t think it was liquid, I didn\u0027t think it was comparable to the amount in the oceans, and I thought most of it was bound up in the rocks chemically, but I honestly never thought about it much. I suppose the mantle has high enough pressure it can keep water liquid up to pretty high temperatures. What is it? Am I getting warm?\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-09-06T23:29:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003Eok |Velocity| , I see what you mean.\u003Cp\u003EThere is this notion that things in space simply \u003Cem\u003Emust\u003C/em\u003E be very different because \u0022that\u0027s space\u0022.\u003C/p\u003E\u003Cp\u003EEarth is also part of the universe and shares natural laws and principles with other planetary bodies.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHumans are not infinitely intelligent and we cannot foresee all the different ways in which the laws of physics can come together to produce wholly unexpected and novel phenomenon. Earth *does not* have a monopoly on all planetary processes, and studying Earth alone will only take you so far. \u003C/p\u003E\u003Cp\u003EIn general, if you go into the unknown expecting it to behave exactly like you think it should, you could miss something very important that simply doesn\u0027t fit your preconceived notions. It\u0027s always safest to expect the unexpected. It wouldn\u0027t be \u0022the unknown\u0022 if it always behaved according to \u0022the rules\u0022.\u003C/p\u003E\u003Cp\u003EIn this case, you\u0027re ruling out even the \u003Cem\u003Eremote possibility\u003C/em\u003E that there could be some small spring on the surface of Mars that slowly trickles water out onto the surface over the course of a few years (where that water rapidly boils away or freezes or sublimates or does all three). Still, right at the mouth of the spring, there could be flowing water on the ground that persists for years, as it is continuously replenished by a pressurized and heated underground aquifer. You grant that it\u0027s possible that water might burst out in short episodes, so under what basis can you rule out that it might, very rarely, slowly trickle out instead of burst out?\u003C/p\u003E\u003Cp\u003EI\u0027ll tell you- you\u0027re ruling it out solely on the basis that it doesn\u0027t conform to the way \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eyou\u003C/span\u003E \u003Cem\u003Eexpect\u003C/em\u003E water to behave on Mars. The universe doesn\u0027t know or care what your preconceived notions are, and if something is not explicitly disallowed by the laws of physics, it cannot be ruled out entirely. Especially when an extremely similar phenomenon is already considered likely to exist.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-06T23:37:29Z\u0022 title=\u002209/06/2013 11:37  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 6, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-08T07:43:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EMaybe not. I WOULD have thought the oceans, but I have heard that water helps lubricate plate tectonics, and that there is a considerable amount in the mantle. However, I didn\u0027t think it was liquid, I didn\u0027t think it was comparable to the amount in the oceans, and I thought most of it was bound up in the rocks chemically, but I honestly never thought about it much. I suppose the mantle has high enough pressure it can keep water liquid up to pretty high temperatures. What is it? Am I getting warm?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, lithosphere and upper parts of the mantle contain a lot more than all of the hydrosphere\u002Batmosphere. Lower mantle, outer and inner core should have way less water per unit of volume, but it might even be possible that they contain the most of it, just because of their incredible volume.\u003C/p\u003E\u003Cp\u003EWhen Earth was cooling down from initial protoplanet coalescing, there was substantial outgassing, and later the first oceans formed. Very deep water never had any chance to get out. Volcanos used shallower reservoirs and they were mainly responsible for relasing acids that made the oceans salty.\u003C/p\u003E\u003Cp\u003EWherever you drill, you\u0027ll find water. Lithosphere is just saturated with it, but deeper water is not free. If it was free, it would be supercritical fluid, but in our case it\u0027s like a contaminant in magma.\u003C/p\u003E\u003Cp\u003EMars should be very similar. Moon shouldn\u0027t, because of its unique origin. It has much lower water content.\u003C/p\u003E\u003Cp\u003ECeres is one of the candidates for spectacular surface findings because Hubble photos suggest dirty ice. A probe is currently on the way towards it (I think it will reach it before New Horizons reaches Pluto) so we\u0027ll see. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EHumans are not infinitely intelligent and we cannot foresee all the different ways in which the laws of physics can come together to produce wholly unexpected and novel phenomenon. Earth *does not* have a monopoly on all planetary processes, and studying Earth alone will only take you so far. \u003Cp\u003EIn general, if you go into the unknown expecting it to behave exactly like you think it should, you could miss something very important that simply doesn\u0027t fit your preconceived notions. It\u0027s always safest to expect the unexpected. It wouldn\u0027t be \u0022the unknown\u0022 if it always behaved according to \u0022the rules\u0022.\u003C/p\u003E\u003Cp\u003EIn this case, you\u0027re ruling out even the \u003Cem\u003Eremote possibility\u003C/em\u003E that there could be some small spring on the surface of Mars that slowly trickles water out onto the surface over the course of a few years (where that water rapidly boils away or freezes or sublimates or does all three). Still, right at the mouth of the spring, there could be flowing water on the ground that persists for years, as it is continuously replenished by a pressurized and heated underground aquifer. You grant that it\u0027s possible that water might burst out in short episodes, so under what basis can you rule out that it might, very rarely, slowly trickle out instead of burst out?\u003C/p\u003E\u003Cp\u003EI\u0027ll tell you- you\u0027re ruling it out solely on the basis that it doesn\u0027t conform to the way \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eyou\u003C/span\u003E \u003Cem\u003Eexpect\u003C/em\u003E water to behave on Mars. The universe doesn\u0027t know or care what your preconceived notions are, and if something is not explicitly disallowed by the laws of physics, it cannot be ruled out entirely. Especially when an extremely similar phenomenon is already considered likely to exist.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut that\u0027s nitpicking. I was talking about flowing creeks and stable bodies of water such as ponds. Mars doesn\u0027t have plate tectonics. It\u0027s not squished by tidal forces. It\u0027s a dying planet with almost vacuum even at Hellas Planitia, so we can\u0027t expect anything more than very rare burps of mud.\u003C/p\u003E\u003Cp\u003EYou say \u0022and if something is not explicitly disallowed by the laws of physics\u0022 - well that\u0027s exactly what I\u0027m talking about.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-09-08T17:27:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EYeah, lithosphere and upper parts of the mantle contain a lot more than all of the hydrosphere\u002Batmosphere. Lower mantle, outer and inner core should have way less water per unit of volume, but it might even be possible that they contain the most of it, just because of their incredible volume.\u003Cp\u003EWhen Earth was cooling down from initial protoplanet coalescing, there was substantial outgassing, and later the first oceans formed. Very deep water never had any chance to get out. Volcanos used shallower reservoirs and they were mainly responsible for relasing acids that made the oceans salty.\u003C/p\u003E\u003Cp\u003EWherever you drill, you\u0027ll find water. Lithosphere is just saturated with it, but deeper water is not free. If it was free, it would be supercritical fluid, but in our case it\u0027s like a contaminant in magma.\u003C/p\u003E\u003Cp\u003EMars should be very similar. Moon shouldn\u0027t, because of its unique origin. It has much lower water content.\u003C/p\u003E\u003Cp\u003ECeres is one of the candidates for spectacular surface findings because Hubble photos suggest dirty ice. A probe is currently on the way towards it (I think it will reach it before New Horizons reaches Pluto) so we\u0027ll see. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut that\u0027s nitpicking. I was talking about flowing creeks and stable bodies of water such as ponds. Mars doesn\u0027t have plate tectonics. It\u0027s not squished by tidal forces. It\u0027s a dying planet with almost vacuum even at Hellas Planitia, so we can\u0027t expect anything more than very rare burps of mud.\u003C/p\u003E\u003Cp\u003EYou say \u0022and if something is not explicitly disallowed by the laws of physics\u0022 - well that\u0027s exactly what I\u0027m talking about.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, I guess we ARE in agreement then.\u003C/p\u003E\u003Cp\u003EI guess my point is that humans are very narrow minded. Most of us do not even realize this. There are just so many ways that the universe can combine various physical laws to make astounding and unique phenomenon you simply have to expect the unexpected.\u003C/p\u003E\u003Cp\u003EIt\u0027s similar to how narrow-minded fools at the end of the 19th century would have said that space travel was forever impossible. They had a knowledge of Newtonian physics, thermodynamics, electromagnetics, etc. and they knew how much energy is produced when you combine liquid oxygen and a fuel like liquid hydrogen or kerosene. Given the blueprints for the Saturn V, they would have understood almost everything about how it worked with enough study and without having to stray outside their knowledge of the physical laws. Really, they had all or almost all the physical laws they needed for space travel. They were just too arrogant and confident in their own world view to realize that if something is not disallowed by the physical laws, you CANNOT EVER rule it out. Assuming the survival of civilization, our own future will contain a lot of things NO ONE has ever foreseen. But, if we were to bring a piece of future technology back to the present and analyze it, most likely, we be able to understand how it does all the things that it does within our current set of the laws of physics (seeing as we appear to have exhausted the limit of practical physics discoveries- but even that MIGHT be a wrong assumption, especially in the more distant future).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-08T17:32:53Z\u0022 title=\u002209/08/2013 05:32  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 8, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-09-08T17:47:24Z","Content":"\n\u003Cp\u003EThat was the problem of certain fools, as you say. There were people like Herman PotoÃ„Ânik that knew what\u0027s going to happen, based on the available knowledge.\u003C/p\u003E\n"}]}