{"TopicId":45325,"ForumId":44,"TopicTitle":"LADEE atmosphere tests.","CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-09-08T17:18:07Z","PageNum":1,"Articles":[{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-09-08T17:18:07Z","Content":"\n\u003Cp\u003EAccording tot his video, LADEE will dip into a really low orbit around the moon to gather samples of it\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/qLpLa32fA9w?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EI don\u0027t think it\u0027s possible in KSP, because of the ridiculous mountains that constantly keeps you at least 3000m away. Is the real life lunar surface a bit more flat than our Munar surface? \u003C/p\u003E\u003Cp\u003EBecause I constantly think this will happen if you fly real low:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/mEutj2kDylE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-08T17:21:20Z","Content":"\n\u003Cp\u003EIn KSP, you rendezvous with a mountain below about 5km.\u003C/p\u003E\u003Cp\u003EAssuming the pass is done over the Lunar plains, it is possible to get within a half kilometer of the surface at orbital speeds but areas that can be done are semi-limited. On the real moon, it is a lot more doable than on the Mun.\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2013-09-08T17:37:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EAccording tot his video, LADEE will dip into a really low orbit around the moon to gather samples of it\u0027s atmosphere.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWatch the pre-launch press conference. This \u0022really low\u0022 orbit will be some 20 to 60 kilometers over the Moon surface. And they\u0027ll have to constantly correct trajectory, burning fuel.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-09-08T17:44:44Z","Content":"\n\u003Cp\u003EThere\u0027s an eccentric polar orbit around Minmus that flies over one of the ice lakes at 500m and just skim\u0027s the edge of the mountains that border it.\u003C/p\u003E\n"},{"CreatedByName":"Stahlwerk","CreatedById":81176,"CreatedDateTime":"2013-09-08T18:15:35Z","Content":"\n\u003Cp\u003EFor me, it\u0027s great to know, that LADEE may use some of the silver (and maybe gold) wires/foils that were produced in the factory where i worked during summer holidays^^ \u003C/p\u003E\u003Cp\u003EI helped there producing a order of silver wires and foils for GSFC, so we maybe contributed a very, very, very little part to this mission \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EP.S: excuse my english, i\u0027m no english native speaker \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-09-08T18:51:32Z","Content":"\n\u003Cp\u003EThe fun thing about our moon vs KSP is that it has an \u003Ca href=\u0022https://en.wikipedia.org/wiki/Mass_concentration_(astronomy)\u0022 rel=\u0022external nofollow\u0022\u003Euneven mass distribution\u003C/a\u003E, which causes low flying spacecrafts\u0027 orbits to decay quickly. However, as the Apollo missions found, there are a few orbits that are \u003Ca href=\u0022https://en.wikipedia.org/wiki/Frozen_orbit\u0022 rel=\u0022external nofollow\u0022\u003Estable\u003C/a\u003E, one of which they dropped a \u003Ca href=\u0022https://en.wikipedia.org/wiki/PFS-1#Lunar_subsatellite\u0022 rel=\u0022external nofollow\u0022\u003Elunar subsatellite\u003C/a\u003E into. That is the reason LADEE must constantly correct itself while in Low Lunar Orbit. The presence of an exosphere (thin may it be) can\u0027t help matters either.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-08T19:23:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CalculusWarrior\u0022 data-cite=\u0022CalculusWarrior\u0022\u003E\u003Cdiv\u003EThe presence of an exosphere (thin may it be) can\u0027t help matters either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPart of the definition of an \u0027Exosphere\u0027 is that it\u0027s so thin that it ceases to behave like a fluid. The molecules that are present are so spread out they basically don\u0027t interact with each other.\u003C/p\u003E\u003Cp\u003EThe drag in such an environment is effectively negligible: Even Low Earth Orbits that are still within the Thermosphere frequently have decay lifetimes measured in years.\u003C/p\u003E\u003Cp\u003EVanguard 1, the US\u0027s second Satellite is still up there, in a 3969x654 KM orbit. The edge of the Exosphere varies between around 500 and 1000km depending on solar activity. Current estimates it\u0027ll probably be up there for around another 240 years or so.\u003C/p\u003E\u003Cp\u003EAt the altitudes LADEE is going to be at, Tidal Forces and Gravitational Variances are going to so outweigh the effects of the Exosphere it\u0027s measuring it might as well not be there for maneuvering purposes.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-09-08T21:14:49Z","Content":"\n\u003Cp\u003EAnyone know how they plan to use the post-science-orbit decay period? After they propellant gets critically low, they\u0027re going to lower the orbit more and more until they crash it into the Moon. Will this give them any kind of special opportunities to observe the Lunar exosphere?\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-09-08T21:50:46Z","Content":"\n\u003Cp\u003E...other than contributing to a sudden increase in its density?\u003C/p\u003E\n"},{"CreatedByName":"Thiel","CreatedById":13126,"CreatedDateTime":"2013-09-08T22:14:44Z","Content":"\n\u003Cp\u003EWell, they\u0027ll get to measure the lower parts directly plus rhey might be able to set up a similar impact experiment like they did with the Ebb and Flow probes earlier this year\u003C/p\u003E\n"}]}