{"TopicId":45837,"ForumId":44,"TopicTitle":"Who won the Space Race? Community poll","CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-09-13T18:11:21Z","PageNum":3,"Articles":[{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-09-14T20:54:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EWas the shuttle expensive to maintain? Yes. But without it, many of the things it did simply would not have been done. Doesn\u0027t matter how inefficient it was, it was in no way a failed program And no amount of post-program revisionism can change that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is not a thread about STS (there were few about it, as far as I remember); there are a lot of good points made by critics of it (\u003Ca href=\u0022https://en.wikipedia.org/wiki/Criticism_of_the_Space_Shuttle_program\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Criticism_of_the_Space_Shuttle_program\u003C/a\u003E) but please let\u0027s not derail into the current NASA\u0027s manned program. Instead, let\u0027s concentrate on THIS:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ZfaTMige5Js?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-14T20:58:13Z\u0022 title=\u002209/14/2013 08:58  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 14, 2013\u003C/time\u003E by czokletmuss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2013-09-14T20:59:18Z","Content":"\n\u003Cp\u003EIt\u0027s SPACE race,Russia put Gagarin up first. The Moon race was won by USA.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-09-14T21:05:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThe USAF is not capable of using foreign launchers due to various regulations (mostly related to technology transfer control). NASA is subject to most of the same agreements. In terms of actual commercial launches, Boeing (or rather the ILS assets they\u0027ve developed) hasn\u0027t launched one since 2006, Lockheed hasn\u0027t launched one since 2002, and ATK, uh, well, ATK isn\u0027t actually a launch provider. The decline started long before that; when it was decided the shiny new Space Shuttle\u003Csup\u003ETM\u003C/sup\u003E would be used to launch all US payloads. Having an industry suddenly stop, and then start from scratch a few years later, isn\u0027t terribly good for it...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd yet its still a multi-billion dollar industry and wasn\u0027t destroyed at all, and all of those companies were still providing commercial services during that time.\u003C/p\u003E\u003Cp\u003EMan I had no idea that NASA and the USAF, who, if you can go by some comments in this thread are barely competent of waking up in the morning, could have destroyed the worldwide commercial market. If the shuttle was such a poor choice, maybe there was some other company that could have also provided launch services out there.. maybe something supported by the ESA. Guess nothing like that existed.\u003C/p\u003E\u003Cp\u003ENope, the industry was definitely dead for the entire time the Shuttle flew. I learned something today.\u003C/p\u003E\u003Cp\u003EBTW ATK purchased Thiokol, which absolutely provided stages for a variety of launch vehicles.\u003C/p\u003E\u003Cp\u003EAlso, do you even know what the United Launch Alliance (ULA) is?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022czokletmuss\u0022 data-cite=\u0022czokletmuss\u0022\u003E\u003Cdiv\u003EThis is not a thread about STS (there were few about it, as far as I remember); there are a lot of good points made by critics of it (\u003Ca href=\u0022https://en.wikipedia.org/wiki/Criticism_of_the_Space_Shuttle_program\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Criticism_of_the_Space_Shuttle_program\u003C/a\u003E) but please let\u0027s not derail into the current NASA\u0027s manned program.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, its completely relevant, and I have no problem challenging specious unsupported claims as often as they\u0027re made. You can level criticisms at any space program, Soyuz and Apollo included, but saying that the Shuttle program is an outright failure is a non-starter for me and shall not stand.\u003C/p\u003E\u003Cp\u003EIf you didn\u0027t want people arguing about the various space projects of the 2 nations, then you probably chose a poor thread to start. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-14T21:11:04Z\u0022 title=\u002209/14/2013 09:11  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 14, 2013\u003C/time\u003E by Tiberion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-09-14T21:10:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EIf the shuttle was such a poor choice, maybe there was some other company that could have also provided launch services out there.. maybe something supported by the ESA. Guess nothing like that existed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003E...destroying the \u003Cstrong\u003EUS\u003C/strong\u003E commercial launch industry.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow many times am I going to have to do that until you start responding to the post I actually made?\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-09-14T21:12:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EIf you didn\u0027t want people arguing about the various space projects of the 2 nations, then you probably chose a poor thread to start. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have no problem with that, just please be civil and remember that there are other programs than STS and that STS itself maybe considered by some to begin after the Space Race concluded \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-09-14T21:31:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EHow many times am I going to have to do that until you start responding to the post I actually made?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs many as it takes you to decide you made an exaggerated and silly claim. You brought up the lack of foreign launchers in your last post.\u003C/p\u003E\u003Cp\u003EAs for US launchers being superceded by the Shuttle; \u003C/p\u003E\u003Cp\u003EExplain the Atlas, Delta, and Titan rocket families continuing to operate from the 60s clear through the 90s and (except for the Titan which ended in 2005) continue to operate today.\u003C/p\u003E\u003Cp\u003EWhat about the GPS network? not a single one of those were launched on a shuttle. \u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_GPS_satellite_launches\u0022 rel=\u0022external nofollow\u0022\u003EAll Atlas and Delta Launches\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd companies like Hughes, EchoStar, DirecTV and so on used a combination of US, EU, and RU launchers.\u003C/p\u003E\u003Cp\u003ESo exactly what WAS destroyed?\u003C/p\u003E\u003Cp\u003EIf anything limited the scope of launches by the US providers, it was their sometimes spotty record. Like the absolute failure that was the Delta III rocket (3 launches, all failures)\u003C/p\u003E\u003Cp\u003ESorry, far too much revisionism happening here.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-14T21:35:14Z\u0022 title=\u002209/14/2013 09:35  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 14, 2013\u003C/time\u003E by Tiberion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-09-14T21:41:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EExplain the Atlas, Delta, and Titan rocket families continuing to operate from the 60s clear through the 90s and (except for the Titan which ended in 2005) continue to operate today.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Non-competitive US government contracts. US government payloads being put up by rockets developed as part of a US government program, and via a \u0027company\u0027 that survives through US government funding independent of services rendered cannot be called \u0027commercial\u0027 with anything like a straight face.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-09-14T22:05:53Z","Content":"\n\u003Cp\u003EYou are mis-informed. Those launchers had business outside of the US government. By your measure, Ariane isn\u0027t commercial either.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-09-14T22:08:51Z","Content":"\n\u003Cp\u003EWhat business? Atlas V, as I mentioned, hasn\u0027t launched a non-gov payload since 2005. Delta IV hasn\u0027t launched one since it\u0027s first launch in 2002, meaning it has \u003Cem\u003Enever\u003C/em\u003E launched one on a full-price contract.\u003C/p\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2013-09-14T22:21:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EDon\u0027t be ridiculous. It flew 135 missions over \u003Cem\u003E30 years.\u003C/em\u003E\u003Cp\u003EIf being the 2nd most used \u0027people launcher\u0027 makes you a failure, I am sure there are dozens of countries and private companies lining up to get in on some of that failure.\u003C/p\u003E\u003Cp\u003ECome on people, get a grip on reality.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003ENot to mention it had the greatest capacity of any manned space vehicle to date and on top of that it could launch cargo on top of that. It also acted as a cheap space station.\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-09-14T22:39:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWhat business? Atlas V, as I mentioned, hasn\u0027t launched a non-gov payload since 2005. Delta IV hasn\u0027t launched one since it\u0027s first launch in 2002, meaning it has \u003Cem\u003Enever\u003C/em\u003E launched one on a full-price contract.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E2006 actually, mostly since the creation of the ULA. I think their payload choices are more of a fact that the government was able to fill up their schedule, rather than the Atlas V suddenly becoming unsuitable for commercial operations. Maybe other providers also started being competitive? I think the major limiting factor was the lack of launch space.\u003C/p\u003E\u003Cp\u003EThe original claim was that the Shuttle destroyed the US launch business. How can that be so if it \u0027ended\u0027 in 2006, when the shuttle was already pretty much dedicated to finishing the ISS (since nothing else could) and thus wasn\u0027t really available to take those jobs from the commercial launchers? And the Delta II HAS launched commercial payloads since then.\u003C/p\u003E\u003Cp\u003EAnd you can\u0027t discount the government launches anyway, its still a commercial endeavor and they certainly profit from it.\u003C/p\u003E\u003Cp\u003EOh, and those dozens and dozens of government launches? They back up the notion that the US is very dominant in overall space activity. We already talked about NASA and the USAF, but there is also the NOAA who has launched numerous weather research projects.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-09-14T22:49:10Z","Content":"\n\u003Cp\u003EShuttle led to the major gap in capability in unmanned that led to Arianespace becoming ascendant, it left the US providers unable to catch up. The government certainly did not fill up their schedule, as shown by the previously mentioned payments rendered for various ongoing costs (e.g. pad maintenance); if we assume the government did fill their schedule, the payments mean we have to assume Boeing and Lockheed designed two launch vehicles that they were literally impossible to make a profit on. ULA is at this point effectively a branch of the DoD, they have no commercial aspects apart from their management structure, which given the amount of subsidy required appears to only make a difference of terms of paychecks to managers.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-09-14T23:06:59Z","Content":"\n\u003Cp\u003EExcept those launchers still existed throughout the shuttle program, so there was no lack of capability. Any failure on their ends is directly attributed to issues within the organization (again, see Delta III) so at the end of this discussion I am only left to boggle at the need to attach everything to the shuttle to discredit it. But I digress.\u003C/p\u003E\u003Cp\u003EAnd if we\u0027re discounting ULA then I guess Ariane is right out too, since it literally IS a branch of the ESA. Same goes for any Russian launches since the Russian government maintains a hammerlock on everything there.\u003C/p\u003E\u003Cp\u003EAll hail Sealunch, the captain of industry for the private launch sector.\u003C/p\u003E\u003Cp\u003EI wonder if SpaceX will be able to unseat them.\u003C/p\u003E\u003Cp\u003EEdit, I\u0027ve had enough of this. Clearly I have been blind to the joke the US has become in the space sector. I have seen the error of my ways. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-14T23:09:46Z\u0022 title=\u002209/14/2013 11:09  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 14, 2013\u003C/time\u003E by Tiberion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-09-14T23:13:51Z","Content":"\n\u003Cp\u003EArianespace does what a company is supposed to do; it launches, and the monetary return on those launches is enough to actually run the organisation. Same for ILS or Sealaunch. ULA is a complete failure as a commercial organisation in that it simply doesn\u0027t return any kind of profit. It can\u0027t even attract customers except ones that have no other choice.\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-09-14T23:26:58Z","Content":"\n\u003Cp\u003EUS landed on the moon! USSR did not!\u003C/p\u003E\u003Cp\u003EThough they were ahead early on, the USSR failed to rendezvous and dock before the US and never managed a lunar landing.\u003C/p\u003E\n"},{"CreatedByName":"Rockhem","CreatedById":57141,"CreatedDateTime":"2013-09-14T23:35:52Z","Content":"\n\u003Cp\u003EThe USSR did everything except dock and a lunar landing first. so the USSR won.\u003C/p\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2013-09-15T01:19:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rockhem\u0022 data-cite=\u0022Rockhem\u0022\u003E\u003Cdiv\u003EThe USSR did everything except dock and a lunar landing first. so the USSR won.\u003C/div\u003E\u003C/blockquote\u003Eand first spy satellite, first telecommunication via a satellite, first international cooperation, first manned flyby/orbit of the moon,longest lasting satellite to date,first flyby of mars, first successful Mars soft landing, First flyby of mercury, first flyby of Jupiter,Saturn,Uranus,Neptune,soon to be Pluto, first spacecraft to drop into Jupiter, and first spacecraft to exit the solar system.\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-09-15T07:58:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EDon\u0027t be ridiculous. It flew 135 missions over \u003Cem\u003E30 years.\u003C/em\u003E\u003Cp\u003EIf being the 2nd most used \u0027people launcher\u0027 makes you a failure, I am sure there are dozens of countries and private companies lining up to get in on some of that failure.\u003C/p\u003E\u003Cp\u003ECome on people, get a grip on reality.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EDon\u0027t get me wrong, i think the STS is a wonderful spacecraft but it failed to accomplish its goal. It was supposed to be a cheap way to transport hardware into space, just a stepping stone on the way to other planets. In the end it was just as expensive (if not even more expensive) to launch like every conventional rocket. Its greatest achievement was building part of the ISS which could have been done with conventional rockets too.\n"},{"CreatedByName":"Gornakosh","CreatedById":58121,"CreatedDateTime":"2013-09-15T11:33:41Z","Content":"\n\u003Cp\u003EGermany won without knowing and before the race even started. First man made object in space: V2 Rocket in WW2\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2013-09-15T11:58:10Z","Content":"\n\u003Cp\u003EThe fact is that we would almost certainly not be where we are in terms of space exploration if one of these two magnificent space programs didn\u0027t exist. And that is why I don\u0027t like thinking about it as a race. Science is not about competing against the others to see who gets the furthest - it\u0027s about working together and getting much, much further than anyone could on their own. If I absolutely had to choose a winner, it would be USSR for all their \u0022first times\u0022. Laika, Belka \u0026amp; Strelka, Sputnik 1, Gagarin, Leonov, MIR, the Venera probes.. Sure, USA has done some really cool stuff, like the Voyager probes, Space Shuttles, ISS, the Apollo missions and Mars rovers, but I think it\u0027s safe to say that USSR played a big part in building a base of knowledge for future space exploration.\u003C/p\u003E\n"},{"CreatedByName":"FellipeC","CreatedById":77983,"CreatedDateTime":"2013-09-15T22:01:25Z","Content":"\n\u003Cp\u003EWerner von Braun won the space race alone!\u003C/p\u003E\n"},{"CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2013-09-15T22:19:02Z","Content":"\n\u003Cp\u003EHuman Civilization won the space race, just from the sheer amount of technology and spinoffs. Simple as that.\u003C/p\u003E\n"},{"CreatedByName":"ReptilianGameplays","CreatedById":65831,"CreatedDateTime":"2013-09-15T22:55:23Z","Content":"\n\u003Cp\u003ELaika won.\u003C/p\u003E\u003Cp\u003EHer death led to allow humans in space.\u003C/p\u003E\n"},{"CreatedByName":"Jacob01","CreatedById":61842,"CreatedDateTime":"2013-09-16T04:38:43Z","Content":"\n\u003Cp\u003EIts a tough question to answer. I\u0027m just going to answer it on the period which I think the space race was. From 1957 to 1969 I\u0027d say the USSR. Alot of people would probably disagree with this, but the USSR did most of the things first. They got a satellite into orbit first, sent men up there first and docked the first spacecraft together. Even though America got men to the Moon, and the USSR didn\u0027t, I still believe the USSR won. \u003C/p\u003E\u003Cp\u003EIf we are talking about after the Moon landings, then the USA probably won. They built the space shuttle which I think, along with the Moon landings put them in front. \u003C/p\u003E\u003Cp\u003EAnd at present day, Russia are winning. This is because the USA currently do not have a rocket to get their astronauts off the ground, but Russia can. To be honest though, its not really a space race anymore. Most nations who can get to space are working with others, so they can build things such as the ISS. And, working together is what we need to do if we want to send people to Mars and other worlds.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-16T04:40:50Z\u0022 title=\u002209/16/2013 04:40  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 16, 2013\u003C/time\u003E by Jacob01\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-09-16T04:59:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jacob01\u0022 data-cite=\u0022Jacob01\u0022\u003E\u003Cdiv\u003Eand docked the first spacecraft together. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_rendezvous#First_docking\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Space_rendezvous#First_docking\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUSA: \u003C/p\u003E\u003Cp\u003EFirst rendezvous - December 15, 1965 Gemini 6 \u0026amp; 7\u003C/p\u003E\u003Cp\u003EFirst docking of 2 craft - March 16, 1966 - Gemini 8\u003C/p\u003E\u003Cp\u003EFirst crew transfer March 1969 During Apollo 9 (2 months after the Russian transfer)\u003C/p\u003E\u003Cp\u003ERussia:\u003C/p\u003E\u003Cp\u003EFirst Russian rendezvous and docking (unmanned vessels) October 30, 1967\u003C/p\u003E\u003Cp\u003EFirst Russian successful manual docking (and transfer) January 16, 1969 (Soyuz 4 and 5) - just 6 months before the Moon Landing\u003C/p\u003E\u003Cp\u003ETheir first attempt failed in Oct 1968 with Soyuz 2 and 3 (one being unmanned)\u003C/p\u003E\u003Cp\u003ENote, Russia launched 2 Vostok craft into identical orbits in 1962, but they lacked the systems for even rudimentary rendezvous maneuvers. It was just a timed launched like Apollo 6 and 7.\u003C/p\u003E\u003Cp\u003ESo the only first related to rendezvous and docking was crew transfer for Soyuz 4 and 5. Gemini was definitely the first successful docking program, by more than a year\u003C/p\u003E\n"}]}