{"TopicId":46901,"ForumId":44,"TopicTitle":"Question about Speed of Light and Relativity","CreatedByName":"funkey100","CreatedById":73931,"CreatedDateTime":"2013-09-29T19:23:47Z","PageNum":1,"Articles":[{"CreatedByName":"funkey100","CreatedById":73931,"CreatedDateTime":"2013-09-29T19:23:47Z","Content":"\n\u003Cp\u003EMy question is, what is the speed of light relative to? I did some Googling and the answer is everything. But I don\u0027t quite understand. If I\u0027m on Earth and the Sun is directly above me, and I have a laser and shoot a beam of light to Earth\u0027s pro- and retrograde, it would be moving c for me since it\u0027s relative to everything, included me. That will mean that relative for the sun its going at c\u002B and c- Earth\u0027s speed respectively. I\u0027m slightly (really) confused. Can some one please help me understand this?\u003C/p\u003E\u003Cp\u003EAlso, if two objects were moving at each other at (relative to their point of impact) 0.60c, and I were on one of them, then it would be moving 1.2c relative to me which is impossible.\u003C/p\u003E\u003Cp\u003EP.S., You can see I\u0027m new to all this relativity thing but I want to understand.\u003C/p\u003E\u003Cp\u003EEDIT: I understand the bus moving and one km/h less than c and I walked in it two km/h I couldn\u0027t go faster than c because special relativity makes the bus and everything in it contract relative to the outside (and everything outside to contract relative to the inside).\u003C/p\u003E\u003Cp\u003EEDIT: I\u0027m trying to read the Wikipedia article on special relativity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-29T19:54:17Z\u0022 title=\u002209/29/2013 07:54  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 29, 2013\u003C/time\u003E by funkey100\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-09-29T21:04:24Z","Content":"\n\u003Cp\u003EThe main idea of special relativity is that light goes at the same speed (about 300 million m/s in a vacuum) no matter HOW fast you are moving. In the first case, the sun would see two light beams going in opposite directions at exactly the speed of light.\u003C/p\u003E\u003Cp\u003EFor the second, you\u0027re right in saying 1.2c (even relative) is impossible. Instead, they each see the other moving at a slower speed than c (this can be calculated easily, but I\u0027m too lazy to look up the formula) and with slowed time, each with the same factor (like 0.8 times slower each).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-29T21:29:25Z\u0022 title=\u002209/29/2013 09:29  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 29, 2013\u003C/time\u003E by TheDarkStar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-09-29T21:32:48Z","Content":"\n\u003Cp\u003EIs the speed of light constant related to anything in physics, in a sense that why is it exactly 300 Mm/s, not 100?\u003C/p\u003E\n"},{"CreatedByName":"Bunsen","CreatedById":10598,"CreatedDateTime":"2013-09-29T21:34:00Z","Content":"\n\u003Cp\u003EThe critical thing here is that our normal idea of how velocities add (e.g. if I\u0027m running at 10mph and I throw a baseball at 30 mph, the baseball whizzes past you at 40 mph) is wrong (you see that baseball traveling a tiny, tiny, tiny bit slower than 40 mph), and the faster things go the more wrong it is. It\u0027s \u003Cem\u003Ereally close\u003C/em\u003E to right if the velocities are small enough (39.999999999999973 mph, in fact), but it breaks down horribly when the numbers approach \u003Cem\u003Ec.\u003C/em\u003E That happens because distance \u003Cem\u003Eand time\u003C/em\u003E depend on who\u0027s asking about them. I see you\u0027ve already caught the distance part -- Lorentz contraction squishes things -- but there\u0027s also time dilation involved. Between the two of those, the apparent contradictions from the counterintuitive velocity addition disappear.\u003C/p\u003E\n"},{"CreatedByName":"GregoryNeal","CreatedById":83622,"CreatedDateTime":"2013-09-29T21:47:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bunsen\u0022 data-cite=\u0022Bunsen\u0022\u003E\u003Cdiv\u003EThe critical thing here is that our normal idea of how velocities add (e.g. if I\u0027m running at 10mph and I throw a baseball at 30 mph, the baseball whizzes past you at 40 mph) is wrong (you see that baseball traveling a tiny, tiny, tiny bit slower than 40 mph), and the faster things go the more wrong it is. It\u0027s \u003Cem\u003Ereally close\u003C/em\u003E to right if the velocities are small enough (39.999999999999973 mph, in fact), but it breaks down horribly when the numbers approach \u003Cem\u003Ec.\u003C/em\u003E That happens because distance \u003Cem\u003Eand time\u003C/em\u003E depend on who\u0027s asking about them. I see you\u0027ve already caught the distance part -- Lorentz contraction squishes things -- but there\u0027s also time dilation involved. Between the two of those, the apparent contradictions from the counterintuitive velocity addition disappear.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell said, you beat me to it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-09-29T21:49:45Z","Content":"\n\u003Cp\u003EThe disappointing answer is: It\u0027s not relative to \u003Cem\u003Eanything\u003C/em\u003E. No matter where you are, no matter how fast you go -- light will always have a speed of 300,000 km/s.\u003C/p\u003E\u003Cp\u003EIn your example, if you were moving at . 6c towards another object moving at .6c, wouldn\u0027t it appear to approach at 1.2c?\u003C/p\u003E\u003Cp\u003EThe answer is no, because of your velocity time is slowing down. Thus, when that object has come 360,000 km closer to you, not one second has passed in your frame of reference, but \u003Cem\u003Emore\u003C/em\u003E than one second. Making the object \u003Cem\u003Estill\u003C/em\u003E move slower than the speed of light towards you.\u003C/p\u003E\n"},{"CreatedByName":"funkey100","CreatedById":73931,"CreatedDateTime":"2013-09-29T21:55:28Z","Content":"\n\u003Cp\u003ESo I think I get it now. Since time slows down in the object (let\u0027s say by half), since c is distance per time, it would appear as the other object would be going half that speed, or 0.6c. But, in the point of impact they would still appear to be going 0.6c each. But then what is the contraction for? The slower time makes it so the person inside the bus couldn\u0027t achieve that speed already, what difference does the contraction make?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-09-29T22:30:28Z","Content":"\n\u003Cp\u003EIt\u0027s a package deal. Picture a third object moving relative to Earth and the Sun. If you are using time dilation to explain speed of light staying constant, it will result in speed of that 3rd object changing too. And if you don\u0027t introduce space contraction, that change is inconsistent. (After all, relative to that object you still have constant speed of light.)\u003C/p\u003E\u003Cp\u003EOf course, the universe doesn\u0027t work this way to keep speed of light constant. Rather, because it has this structure, the speed of light is constant. And the reason you get both time dilation and space contraction is in how distances work in space-time. Two events separated by space and time are closer together than two events separated by space alone.\u003C/p\u003E\n"},{"CreatedByName":"funkey100","CreatedById":73931,"CreatedDateTime":"2013-09-29T22:41:47Z","Content":"\n\u003Cp\u003ESorry, but I\u0027m new to all of this. The 3rd object will change speed relative to the Earth and Sun because of the time dilation (I get this, as anything that\u0027s going at a relative speed greater than 0 will be slower than the other object). But why would that change not last without contraction?\u003C/p\u003E\n"},{"CreatedByName":"badgers_in_space","CreatedById":78329,"CreatedDateTime":"2013-09-30T18:29:27Z","Content":"\n\u003Cp\u003ESo, if it were possible for one to travel at the speed of light, and one fired a laser whilst travelling at the speed of light - would the laser beam be travelling at the same speed as you? (the speed of light)\u003C/p\u003E\n"},{"CreatedByName":"Klingon Admiral","CreatedById":69090,"CreatedDateTime":"2013-09-30T18:33:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003EIs the speed of light constant related to anything in physics, in a sense that why is it exactly 300 Mm/s, not 100?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt isn\u0027t exactly 300,000 km/s, it is 299,792,458 m/s. And exactly this length, as the metre is defined by the speed of light in vacuum and the second.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-09-30T19:12:56Z","Content":"\n\u003Cp\u003EPicture a cartesian (x,y,z) coordinate system that moves with you, so that the \u0022origin\u0022 point of the coordiante system is always YOU. This is your \u0022inertial reference frame\u0022. You ALWAYS measure a beam of light travelling through your coordinate system- your inertial reference frame- at the speed of light. \u003C/p\u003E\u003Cp\u003ESince all frames of reference frames observe the same thing- that light always travels at the speed of light in their reference frame- and all reference frames must see the same EVENTS take place, that can only mean that time and length mean different things to different reference frames.\u003C/p\u003E\u003Cp\u003EIt sounds crazy only because humans evolved to live in a non-relativistic world, where velocities are low enough, and gravity is weak enough, that all these effects can be ignored. We think that such things as simultaneity are real, when they are a fiction... there is NO SUCH THING as simultaneous events if those events are separated in space. Different reference frames will NEVER ALL agree on the order of all events if those events do not occur in the same spot in space.\u003C/p\u003E\u003Cp\u003EVery often, when reading an astronomy article, I will come across a phrase like this and cringe:\u003C/p\u003E\u003Cp\u003E\u0022The light we are seeing from M31 left it 2.4 million years ago; thus we are actually seeing what the Andromeda galaxy looked like 2.4 million years ago, not now.\u0022\u003C/p\u003E\u003Cp\u003EThis is actually an INCORRECT STATEMENT. Einstein PROVED that the whole idea of there being some sort of absolute, cosmological time was wrong. The idea that 2.4 million years ago in the Andromeda galaxy was somehow simultaneous with 2.4 million years ago on Earth is totally wrong, as there is \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eno such thing\u003C/span\u003E as simultaneity between two different points in space! There is \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eno such thing\u003C/span\u003E as \u0022what is happening now?\u0022 in the Andromeda galaxy. That question is unphysical.\u003C/p\u003E\u003Cp\u003ETo say that \u0022Betelguese might have already exploded and the light just hasn\u0027t reached us yet\u0022 is similarly incorrect. Betelgeuse has not exploded UNTIL the light reaches us; lightspeed is the fastest speed that distant events can truly exist from our frame of reference!\u003C/p\u003E\u003Cp\u003EFrom a reference frame roughly at rest with the Andromeda galaxy and with the Milky Way, sure, it will look like 2.4 million years will pass for light from M31 to reach the Milky Way, but that is only for reference frames roughly at rest with the two galaxies. To the light, the trip was instantaneous; to any particle launched at extremely high velocities near the speed of light, the trip was nearly instantaneous. Einstein showed us that there is nothing special about any particular reference frame, and the whole notion of simultaneity is nothing but a fantasy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-30T19:33:23Z\u0022 title=\u002209/30/2013 07:33  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 30, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vilheim","CreatedById":83096,"CreatedDateTime":"2013-10-01T00:43:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003EIs the speed of light constant related to anything in physics, in a sense that why is it exactly 300 Mm/s, not 100?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe speed of light was measured, and it was also calculated from Maxwell\u0027s electromagnetic equations using a few well established constants in that field (Vacuum permittivity and vacuum permeability). After that, we redefined the meter in relation to the speed of light as some one above me has explained.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-10-01T03:32:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis is actually an INCORRECT STATEMENT. Einstein PROVED that the whole idea of there being some sort of absolute, cosmological time was wrong. The idea that 2.4 million years ago in the Andromeda galaxy was somehow simultaneous with 2.4 million years ago on Earth is totally wrong, as there is \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eno such thing\u003C/span\u003E as simultaneity between two different points in space! There is \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eno such thing\u003C/span\u003E as \u0022what is happening now?\u0022 in the Andromeda galaxy. That question is unphysical.\u003C/p\u003E\u003Cp\u003ETo say that \u0022Betelguese might have already exploded and the light just hasn\u0027t reached us yet\u0022 is similarly incorrect. Betelgeuse has not exploded UNTIL the light reaches us; lightspeed is the fastest speed that distant events can truly exist from our frame of reference!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIsn\u0027t the point of entanglement that two observers see the same event (or the other side of the same event) at the same time?\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2013-10-01T04:11:15Z","Content":"\n\u003Cp\u003EQuestion for the science professionals here:\u003C/p\u003E\u003Cp\u003EWhat is the difference between an object with mass traveling at the speed of light (299,792,458 m/s), and an object traveling at almost the same speed, but slower by 1 Plank Length x a time larger than the age of the Universe? One is unachievable, and the other is achievable, yet both would have the object move the exact same distance over the exact same time if clocked today. How is that explained?\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-10-01T04:13:58Z","Content":"\n\u003Cp\u003E\u0022To the light, the trip was instantaneous; to any particle launched at extremely high velocities near the speed of light, the trip was nearly instantaneous.\u0022\u003C/p\u003E\u003Cp\u003EThis is where I go fetal. From a photon\u0027s point of view, space/time is irrelevant as they get to their destination instantaneously no matter the distance involved. I was watching Brian Greene\u0027s The Fabric of the Cosmos, and it did a nice job of blowing my mind on this subject.\u003C/p\u003E\n"},{"CreatedByName":"Geckgo","CreatedById":76457,"CreatedDateTime":"2013-10-01T04:39:36Z","Content":"\n\u003Cp\u003E*Grabs the popcorn*\u003C/p\u003E\u003Cp\u003EI really thought this thread was going to end up more heated for some reason.\u003C/p\u003E\u003Cp\u003EArmchair, no reason to go fetal, think about it in terms of sublight and you sitting on a spacecraft traveling near c. Everything you observe moving relative to you at almost c will be squished in the direction of motion, thus the closer you get to c, the shorter the distance becomes that you need to traverse. At least from your point of view.\u003C/p\u003E\u003Cp\u003EWhen I was studying physics in school I remember a LOT of word problems posed about klingons and the Enterprise. Made it fun. I\u0027m just glad to see that someone pointed out Maxwell, everyone forgets about him, and most people (himself included) thought there was something wrong with his equations when it was first realized that c could be represented as a constant until relativity came along. I don\u0027t remember the equation exactly but it\u0027s something like c = sqrt([mu][epsilon]). In admitting that relativity doesn\u0027t make sense to you, you are already smarter than most people who claim they understand it and really don\u0027t. I\u0027m not talking about anyone on this thread, just most of the sci-fi people that I\u0027ll run into sometimes on the street.\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-10-01T05:29:45Z","Content":"\n\u003Cp\u003E\u0022Armchair, no reason to go fetal, think about it in terms of sublight and you sitting on a spacecraft traveling near c. Everything you observe moving relative to you at almost c will be squished in the direction of motion, thus the closer you get to c, the shorter the distance becomes that you need to traverse. At least from your point of view.\u0022\u003C/p\u003E\u003Cp\u003EYes, that really helps pull me from the fetal position. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been an armchair cosmologist since I could read, and while my math skills suck, I am totally fascinated by the implications. To think that when I look into the night sky, those photons from other stars that strike my eye have, from their point of view, instantaneously made that journey. Those photons are absorbed by my retina. I am participating in a quantum event that is both instantaneous and took 1000\u0027s of years depending on what frame of reference is used. If this doesn\u0027t bake your noodle a bit I\u0027m not sure what would.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-10-01T15:45:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EIsn\u0027t the point of entanglement that two observers see the same event (or the other side of the same event) at the same time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENO.\u003C/p\u003E\u003Cp\u003EFrom my understanding of quantum entanglement, here is how it works:\u003C/p\u003E\u003Cp\u003EImagine two electrons entangled so that one is spin up and one is spin down. They are separated by cosmological distances. Now, you locally measure one of the electrons to be spin down. Before you measure the electron, both electrons are fundamentally in both states, but after you measure it, this means that the other electron must be spin up, even if it is in another galaxy.\u003C/p\u003E\u003Cp\u003ESay if distant aliens are measuring the other electron; they measure it to be spin up, and know that yours must be spin down. However, they don\u0027t KNOW what state their electron is in UNTIL they measure it- your observation of your electron makes no observable change to their electron.\u003C/p\u003E\u003Cp\u003EThis is not communication, it\u0027s just knowing that some other particle in a distant location must be in some state. The \u0022spooky\u0022 part is merely that quantum properties of particles appear to be fundamentally random. It\u0027s NOT that the electron is in one state or the other, it is truly in both states at the same time, and thus, when we measure our electron, we determine the state of another particle in a distant location \u0022instantaneously\u0022 (from our frame of reference, I guess). But that does not transmit any information, we only KNOW, here in this location, what the particle is in another location. That particle in the other location, from that other location\u0027s point of view, does nothing special.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-10-01T16:41:21Z","Content":"\n\u003Cp\u003EThank goodness we are discussing the speed of light, as opposed to the speed of the expansion of space. :-) As for Entanglement, what a web we weave.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-10-01T17:34:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EThis is not communication, it\u0027s just knowing that some other particle in a distant location must be in some state.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI never spoke of communication, I said that two observers would see the same thing at the same time, as you argued that \u003Cem\u003Eat the same time\u003C/em\u003E does not exist. If you measured the spin of the same electron at different times, both could see the same spin, I guess.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-10-01T18:01:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI never spoke of communication, I said that two observers would see the same thing at the same time, as you argued that \u003Cem\u003Eat the same time\u003C/em\u003E does not exist. If you measured the spin of the same electron at different times, both could see the same spin, I guess.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe time ordering in measurement of entangled spins makes no difference. And, in fact, depending on coordinate system choice, the order in which they are measured can change. The important fact is that prior to measurement both spins are in superposition. After the measurement the state of one can be determined from the state of the other.\u003C/p\u003E\n"},{"CreatedByName":"Geckgo","CreatedById":76457,"CreatedDateTime":"2013-10-02T01:52:22Z","Content":"\n\u003Cp\u003ENow it\u0027s getting good, where\u0027d I put that popcorn? Nice to see people politely discussing this stuff instead of arguing and bashing eachother over typos. Kudos to everyone on this thread.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2013-10-02T02:08:28Z","Content":"\n\u003Cp\u003EAnyone know the answer here?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022westair\u0022 data-cite=\u0022westair\u0022\u003E\u003Cdiv\u003EQuestion for the science professionals here:\u003Cp\u003EWhat is the difference between an object with mass traveling at the speed of light (299,792,458 m/s), and an object traveling at almost the same speed, but slower by 1 Plank Length x a time larger than the age of the Universe? One is unachievable, and the other is achievable, yet both would have the object move the exact same distance over the exact same time if clocked today. How is that explained?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Geckgo","CreatedById":76457,"CreatedDateTime":"2013-10-02T03:11:19Z","Content":"\n\u003Cp\u003ESorry westair, got my degree nearly 10 years ago and don\u0027t remember anything about that. To be honest I\u0027m not sure what you are asking, can you reference an article or be more specific?\u003C/p\u003E\n"}]}