{"TopicId":47547,"ForumId":44,"TopicTitle":"Planet Statistics","CreatedByName":"Deadfingers","CreatedById":82785,"CreatedDateTime":"2013-10-06T16:55:30Z","PageNum":1,"Articles":[{"CreatedByName":"Deadfingers","CreatedById":82785,"CreatedDateTime":"2013-10-06T16:55:30Z","Content":"\n\u003Cp\u003EThere has been some talk about making procedural planets/solar systems in the modding and suggestions forums. Is there any science data available that could be used to base a procedural planet/solar system creation algorithm on? I\u0027m thinking that it would need to at least include planet mass/volume, distance from the sun, and atmosphere information. \u003C/p\u003E\u003Cp\u003EAlso, since it has been statistically more likely for us to find larger planets and planets that pass between us and their sun, is there anyone that has used available data to extrapolate what the actual data is?\u003C/p\u003E\n"},{"CreatedByName":"GregoryNeal","CreatedById":83622,"CreatedDateTime":"2013-10-06T22:50:28Z","Content":"\n\u003Cp\u003EHave you played Space Engine? I\u0027m pretty sure they have accurate representations of a lot of the planetary systems in our galaxy, as well as a beautiful procedural planet/solar system generator. And the reason we have been finding more large planets is because of our technology, it\u0027s very hard to notice the subtle variations in a stars radial velocity, or notice a small planets transit, with our current technology. However, spacecraft like the Kepler telescope make it more reasonable to find Earth sized planets. It\u0027s search volume is actually quite large if the Wikipedia page is to be believed.\u003C/p\u003E\n"},{"CreatedByName":"Deadfingers","CreatedById":82785,"CreatedDateTime":"2013-10-07T16:38:30Z","Content":"\n\u003Cp\u003EThat was definitely an interesting program to look at, but ultimately not exactly what I\u0027m looking for. I\u0027m hoping that there\u0027s a database of all discovered planets in the universe with some sort of extrapolation on what the actual statistics would look like if the sample size was accurate representation of all planets. I knew about the reasons why we have been more likely to find larger planets, I just assumed it didn\u0027t need repeating since most of the people here are up to date on space sciences activity. What I would like to be able to do is make a solar system generator that will create plausible solar systems that aren\u0027t copies of existing systems.\u003C/p\u003E\n"}]}