{"TopicId":51137,"ForumId":44,"TopicTitle":"Surface-based centrifuge for lunar colonization","CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2013-10-30T03:40:28Z","PageNum":1,"Articles":[{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2013-10-30T03:40:28Z","Content":"\n\u003Cp\u003EMost of the moons in our solar system have gravity wells so weak that it\u0027s impractical for humans to live there for prolonged periods of time. It\u0027s often suggested that humans would be far more comfortable living in rotating space stations (where we can simulate a full 1 G acceleration) then they would be trying to colonize any of the moons. This assumes we are unable to figure out special medicine and/or genetic engineering that can somehow eliminate the debilitating effects of microgravity on the human body (forcing ourselves to evolve into a space-capable species, as it were).\u003C/p\u003E\u003Cp\u003EWhat about using that centrifuge trick on a lunar surface though? At first glance it seems crazy, you\u0027d have to have a massive wheel spinning on the ground, huge motors and gears and a sophisticated mechanism to spin it up or wind it down. But I realized... you could just use a fancy train. We have trains today that exhibit slight centripetal forces on high speed turns. We even have tilting trains that are designed to compensate for these turns. What if we designed a circular track (a rather large one) with a high speed train on it designed to operate at a tilt at all times. Living on a train wouldn\u0027t be much worse than living on the usual type of space habitats or space capsules you typically see (cramped, but workable). And so long as the train keeps it\u0027s speed up you could experience a heightened gravity.\u003C/p\u003E\u003Cp\u003EIf the tilting mechanism is good enough you could even adjust it (along with the train\u0027s speed) and dial your gravity between a certain range. Maybe depending on visitors who would have different kinds of resistance to prolonged microgravity, or starting high and dialling it down slowly to help you acclimate to the local gravity more gradually.\u003C/p\u003E\u003Cp\u003EDiscuss.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.railway-technology.com/projects/alaris/images/alaris4.jpg\u0022 alt=\u0022alaris4.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"roux_de_secours","CreatedById":61130,"CreatedDateTime":"2013-10-30T04:25:50Z","Content":"\n\u003Cp\u003EThat is very bright! I guess it could be solar powered.\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2013-10-30T05:11:29Z","Content":"\n\u003Cp\u003EMight be a bit impractical, though. Either it\u0027s a building size train(with all the maintenance problems similarly magnified) or you\u0027re cooped up on a train sized train on the Moon, in which case why\u0027d you go there anyway?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-30T05:13:07Z","Content":"\n\u003Cp\u003Ei had an idea for using nuclear water rockets to turn ice dwarves into interstellar generation ships by using the ice as propellant. the problem was there wasnt enough gravity on an ice dwarf for things/people to stick to the surface very well, some some kind of centrifuge would be neccisary. \u003C/p\u003E\u003Cp\u003Eproblem is you have some natural gravity to contend with, so a cylindrical centrifuge would not work out very well. you would need geometry to be something between a slightly tapered cylinder stood up on end for ice dwarves with plutonian gravity (\u0026lt; 0.1g) to something more conic for dwarves with more gravity. this whole thing would be mounted on a giant bearing mounted on a vertical shaft buried deep in the ice and frozen in place. the whole thing would be built in a vertical shaft for radiation shielding and then domed over with an ice and steel structure.\u003C/p\u003E\u003Cp\u003Eof course this is just a basic model, you would need it set up so that for every point on the surface, the magnitude of the vector sum of the natural gravity and the centrifugal force would be 1g. this would end up with some rather exotic geometry, and i feel sorry for any team of engineers tasked to construct a building on such a platform.\u003C/p\u003E\u003Cp\u003Eliving on trains i suppose would work, but i personally have never been able to sleep on a thing with a motor.\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2013-10-30T05:16:54Z","Content":"\n\u003Cp\u003E@ meve\u003C/p\u003E\u003Cp\u003EWell like I said most lunar base designs use pretty small capsules anyway. I think the largest rooms wouldn\u0027t be too much bigger than your average train wagon.\u003C/p\u003E\u003Cp\u003EAs for how they would use them, I imagine that they would operate through rotation. You\u0027d spend ~24 hours working on the moon in it\u0027s natural gravity, then you would board the train and remain on it for roughly another 24 hours. There you could do paper work, perform exercises in the higher gravity, or just relax. Running through this cycle is bound to help alleviate some of the problems with long-term habitation in micro-gravity.\u003C/p\u003E\u003Cp\u003ETruth be told though... I don\u0027t know the details. Maybe conventional exercises would be enough to hold back all of that nasty bone deterioration and muscle mass loss when living on the moon. I know that on the ISS, exercise alone hasn\u0027t been enough so far.\u003C/p\u003E\u003Cp\u003E@ Nuke\u003C/p\u003E\u003Cp\u003EI suspect the angle thing wouldn\u0027t be that hard to solve, like I said we already have trains that are designed to tilt into sharp quick turns so that the travellers don\u0027t feel the incline. It\u0027s like when the swings on a ride (see picture) tilt as the speed increases. If you had your eyes covered and if you were in a swing with no contact with the air (and if you had a very smooth ride with minimal perturbations) it would feel like you just got heavier. You wouldn\u0027t notice the inclination. Similarly, so long as the train passengers don\u0027t look out of a window they wouldn\u0027t notice the incline, they would just feel a stronger (more Earth-like) gravity.\u003C/p\u003E\u003Cp\u003EAnd to clarify, it wouldn\u0027t be the whole city built on a train like this. Most people would live and work in normal houses/chambers. These would be special \u0022recuperation\u0022 stations for people more susceptible to micro-gravity problems. I agree that if you had to build your entire lunar city on a track like this it would be completely impractical.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.bertazzon-america.com/swing-carousel/swing-carousel_dollywood.jpg\u0022 alt=\u0022swing-carousel_dollywood.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-30T05:25:06Z\u0022 title=\u002210/30/2013 05:25  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 30, 2013\u003C/time\u003E by PTNLemay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-30T05:44:38Z","Content":"\n\u003Cp\u003Ethe math wouldn\u0027t be hard at all, just a little bit of trig, pythagorean theorem and vector math. buildings would end up looking rather interesting, a 2 story building would probibly have non parallel floorplans and structural engineering would get complex.\u003C/p\u003E\n"},{"CreatedByName":"Zuni","CreatedById":85203,"CreatedDateTime":"2013-10-30T06:59:15Z","Content":"\n\u003Cp\u003ECool!\u003C/p\u003E\u003Cp\u003EBut how do you get out?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-30T11:08:01Z","Content":"\n\u003Cp\u003Efor my idea, probibly an interchange ring in the hub, get in, spin up/down, and get out. for the train idea, a second train in parallel, just have another train pull up and match phase, connect to transfer personnel, and then reduce speed.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-10-30T11:51:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zuni\u0022 data-cite=\u0022Zuni\u0022\u003E\u003Cdiv\u003ECool!\u003Cp\u003EBut how do you get out?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuite fast.\u003C/p\u003E\n"},{"CreatedByName":"SunJumper","CreatedById":27062,"CreatedDateTime":"2013-10-30T12:15:14Z","Content":"\n\u003Cp\u003EHmm, how would this fare if it were like a giant ferris wheel?\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2013-10-30T15:57:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zuni\u0022 data-cite=\u0022Zuni\u0022\u003E\u003Cdiv\u003ECool!\u003Cp\u003EBut how do you get out?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe train wouldn\u0027t be on all the time, it would periodically slow to a stop to rotate the crew out and bring in a new group that needs the high-G therapy. In which case you don\u0027t need anything more fancy than a regular air-lock connecting the train to the rest of the moon base.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SunJumper\u0022 data-cite=\u0022SunJumper\u0022\u003E\u003Cdiv\u003EHmm, how would this fare if it were like a giant ferris wheel?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027d be a whole lot more complicated, the bigger the object you have to spin, the more energy it takes to spin up and spin back down. Also if you have an actual giant wheel instead of just a little train, you will probably have a LOT more surface area to worry about. What this means is that you\u0027ll get more friction points, more wear and tear, more maintenance needed. Remember to get a smooth G-force the wheel is going to be lying on it\u0027s side, not standing up.\u003C/p\u003E\u003Cp\u003EIn orbit it\u0027s not such a big deal because you can set almost the entire station to spin, so you won\u0027t experience much resistances. But on a surface you\u0027ll have to keep the whole thing up against the moon\u0027s (small but still present) gravity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-30T16:04:51Z\u0022 title=\u002210/30/2013 04:04  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 30, 2013\u003C/time\u003E by PTNLemay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-10-30T18:09:22Z","Content":"\n\u003Cp\u003Ei kinda wonder if you could eliminate a lot of friction with magnetic bearings as opposed to mechanical bearings. for a physics standpoint it would suffer very little momentum loss. the whole thing would spin up by means of what is essentially a large brushless motor, and once up to speed would only need to occasionally top off the momentum by running the motor breifly. the hardest part would be keeping it stable in the bering, it would likely be very sensitive to imbalence. so some kind of active ballast would need to be used, such as water. pump it around to achieve stability. being a generation ship for an everyone out type scenario, these things would be pretty big, and there would be more than one of them. so if you had to shut one down for maintenance, you could just relocate people temporarily while you did repairs.\u003C/p\u003E\u003Cp\u003Ethe train idea is still useful in my scenario though, because large scale ice mining would be neccisary to feed the engines. you would need to periodically move the mining site as you ate away at the surface over time, and this would be done far away from the city centrifuges. trains could be used as temporary habitats for miners. the engines themselves would be large mobile structures (probibly with their own smaller centrifuges for worker housing) on big crawler platforms that could be moved around as you altered the landscape of the ice dwarf over time. miners and engine workers would also need transportation to and from the job site, so modular train track would probibly be readily available. if you ever needed a makeshift habitat, it would be the way to go.\u003C/p\u003E\u003Cp\u003Ethough i should probibly work out the delta-v of an ice dwarf running ice through nuclear (or some kind of fusion) engines. you might just be better with a fleet of orion drive starships. but i like to think big. thing is its something we could pull off with today\u0027s technology if we were so inclined.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-30T18:23:26Z\u0022 title=\u002210/30/2013 06:23  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 30, 2013\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"}]}