{"TopicId":52272,"ForumId":44,"TopicTitle":"Reentry without a heatshield possible on Earth?","CreatedByName":"BrickedKeyboard","CreatedById":91822,"CreatedDateTime":"2013-11-07T20:41:46Z","PageNum":1,"Articles":[{"CreatedByName":"BrickedKeyboard","CreatedById":91822,"CreatedDateTime":"2013-11-07T20:41:46Z","Content":"\n\u003Cp\u003EI have the \u0022deadly reentry\u0022 mod installed. This seems to more or less realistically burn your rockets up if you try to enter at too steep of an angle without a heatshield.\u003C/p\u003E\u003Cp\u003EHowever, I was coming back from the Mun with a couple of goo cannisters, and I had not yet unlocked a method to shield them from reentry heat. So I made my periapsis 33 km (discovered after some trial and error) and found that I could skim the upper atmosphere, bleed off some speed, and not burn up. I still had a rocket motor and a couple of fuel tanks attached as well at this point. \u003C/p\u003E\u003Cp\u003EI made two passes, until the friction had moved my apoapsis into the lower atmosphere, and found I was now going slow enough that I wouldn\u0027t burn up.\u003C/p\u003E\u003Cp\u003ENow, I thought about this maneuver on paper, and I realized that skimming the upper atmosphere without a heatshield is realistic. Technically, low flying satellites are doing this all the time.\u003C/p\u003E\u003Cp\u003EHowever, when you do this maneuver, in the best case scenario, you end up in a suborbital trajectory headed towards the planet at several thousand m/s. (because on your last pass through the atmosphere you lost as much energy as you could, and now you are going to be headed in)\u003C/p\u003E\u003Cp\u003EIs this survivable on earth under any circumstances?\u003C/p\u003E\u003Cp\u003EI realize that kerth has a smaller atmosphere, and you have less kinetic energy in low orbit. When I right click on the ship parts during this kind of reentry, I can see that they are heating up quite a bit - the rocket motor nozzle peaks at 1100 C, the fuel tanks at about 400 C. However, deadly reentry does not consider this hot enough to destroy these objects, and I can see that, spacecraft aluminum doesn\u0027t melt at 400C. However, there\u0027s also a force on the thin aluminum skins of a fuel tank, and DR doesn\u0027t seem to model that. \u003C/p\u003E\u003Cp\u003ESo, what\u0027s the deal?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-11-07T20:49:02Z","Content":"\n\u003Cp\u003EFrom orbit? I don\u0027t think so, you have too much speed to lose.\u003C/p\u003E\u003Cp\u003EBut people have fallen from near space without needing heat shields, look at Felix Baumgartner\u0027s recent skydive \u003Ca href=\u0022http://www.space.com/14928-space-jump-supersonic-skydive-practice.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.space.com/14928-space-jump-supersonic-skydive-practice.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEven in KSP, if you cancel your horizontal velocity before you enter the atmosphere the heating effects are less severe, I\u0027ve no idea if it could work for real but maybe it could, someone smarter than me would have to run the numbers.\u003C/p\u003E\u003Cp\u003EIf you could cancel your horizontal velocity and be draggy enough so you didn\u0027t build up too much speed as you fell, then you wouldn\u0027t have the same heat build up as a craft re-entering, the heat is cause by compression of the atmosphere in front of you, not by friction.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-07T20:54:53Z","Content":"\n\u003Cp\u003EOn Earth, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Atmospheric_entry#Feathered_reentry\u0022 rel=\u0022external nofollow\u0022\u003ESpaceShipOne\u003C/a\u003E is supposed to reenter without heat shield.\u003C/p\u003E\u003Cp\u003ESimilar approach is possible in KSP. Or you can thrust downwards to keep your altitude while the atmosphere slows you down. Something like powered landing, but instead of landing you just avoid entering thick layers of atmosphere too fast.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-11-07T20:56:12Z","Content":"\n\u003Cp\u003EYeah, heat damage is caused by friction with the air, so if you\u0027re going slow enough you can keep the heat from reaching critical. You could do this with extended aerobraking in the very upper reaches, or you could do this by retroburning to keep your speed down as you enter.\u003C/p\u003E\u003Cp\u003EThe reason neither of these are popular in real uses is they require extra resources to be onboard, either in extended food, water and oxygen for the crew to live longer making multiple aerobraking orbits, or with enough fuel to burn the retro-engines long enough to cancel off all that orbital velocity (basically the opposite of how much it required to launch, since you\u0027ll have to fight gravity on the way down at least until you\u0027re past the danger zone where being in freefall would speed you up enough to cause too much friction again.\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2013-11-07T21:00:16Z","Content":"\n\u003Cp\u003EWhile not very practical, a powered descent would fit your criteria.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-07T21:05:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EYeah, heat damage is caused by friction with the air\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. It\u0027s caused by air compression.\u003C/p\u003E\u003Cp\u003EIf you fall into water from great height, you will die not because your friction with water is too high but because the water is simply too heavy to move aside fast enough.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2013-11-07T21:11:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EYeah, heat damage is caused by friction with the air, so if you\u0027re going slow enough you can keep the heat from reaching critical. You could do this with extended aerobraking in the very upper reaches, or you could do this by retroburning to keep your speed down as you enter.\u003Cp\u003E[...]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHeat damage is done by air compression,even if more air compression usually result in more friction.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E[...]\u003C/p\u003E\u003Cp\u003EBut people have fallen from near space without needing heat shields, look at Felix Baumgartner\u0027s recent skydive \u003Ca href=\u0022http://www.space.com/14928-space-jump-supersonic-skydive-practice.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.space.com/14928-space-jump-supersonic-skydive-practice.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E[...]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe jumped from 39.45KM, at that altitude it\u0027s the stratosphere,not space. \u003C/p\u003E\u003Cp\u003EIt\u0027s still hight tough.\u003C/p\u003E\u003Cp\u003ETo answer your question, it is possible to make a rocket that doesn\u0027t need a heat shield.\u003C/p\u003E\u003Cp\u003EHowever, it would required a lot of fuel(if you decide to use engines) so it\u0027s simpler(and more effective) to use a heat shield and let the rocket fall trough the atmosphere.\u003C/p\u003E\u003Cp\u003EYou might be interested by this article from XKCD: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://what-if.xkcd.com/58/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://what-if.xkcd.com/58/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-11-07T21:44:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EOn Earth, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Atmospheric_entry#Feathered_reentry\u0022 rel=\u0022external nofollow\u0022\u003ESpaceShipOne\u003C/a\u003E is supposed to reenter without heat shield.\u003Cp\u003ESimilar approach is possible in KSP. Or you can thrust downwards to keep your altitude while the atmosphere slows you down. Something like powered landing, but instead of landing you just avoid entering thick layers of atmosphere too fast.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpaceShipTwo (One is retired) will be doing suborbital hops only, so won\u0027t have to bleed off orbital speeds.\u003C/p\u003E\u003Cp\u003EThink of it this way. A vessel in orbit is going about 7500 m/s. The amount of energy that a vessel has is its potential energy (due to its height) plus its kinetic energy (due to velocity.) Use a Mercury capsule (one of the lightest crewed spacecraft ever at 1.4 metric tons) as the example. The potential energy is approximately mass_vessel*g*height = 1400kg*9.8m/s\u003Csup\u003E2\u003C/sup\u003E*3e5m=4.1GJ. The kinetic energy is 0.5*mass_vessel*velocity\u003Csup\u003E2\u003C/sup\u003E=39GJ for a total of about 43GJ of energy that has to be converted (to heat) in order to land the vessel. If you\u0027re not going to use rockets to slow down (and it seems wasteful to spend fuel when the atmosphere is capable of doing it), you have to have a heat shield to either carry the heat energy away (through ablation) or absorb the heat while keeping the vessel cool (through insulation.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T23:01:48Z\u0022 title=\u002211/07/2013 11:01  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by Mr Shifty\u003C/strong\u003E\n\u003Cbr\u003EFixed my math\n\u003C/span\u003E\n"},{"CreatedByName":"Bunsen","CreatedById":10598,"CreatedDateTime":"2013-11-07T22:26:19Z","Content":"\n\u003Cp\u003EReentry heating depends quite a lot on how much surface area you have per unit mass. Large, dense objects require a lot of dynamic pressure to decelerate from orbital speed, and that means lots of compression and high surface temperatures. Small, lightweight objects can do it with lower pressures and temperatures. There have been a couple research projects on developing large inflatable heat shields, which don\u0027t need to survive quite such severe heating as their compact counterparts. Some tiny objects (I think the little circuit boards on KickSat are close) can survive reentry without any special shielding.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-11-07T22:37:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EOn Earth, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Atmospheric_entry#Feathered_reentry\u0022 rel=\u0022external nofollow\u0022\u003ESpaceShipOne\u003C/a\u003E is supposed to reenter without heat shield.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027s that they say? Never let the facts get in the way of a good story? \u003C/p\u003E\u003Cp\u003ETo add to what MrShifty said, re-entry heating is really just all about conservation of energy. A spacecraft in LEO has an immense amount of potential and kinetic energy that must be dissipated during re-entry. The majority of that energy is kinetic energy. An object orbiting the Earth at 400 km has roughly 4 MJ/kg of potential energy and a whopping 30 MJ/kg of kinetic energy relative to an object on the surface. This is why SpaceShipOne can re-enter without heatshields. It has very little, if any, kinetic energy at the top of its ballistic arc. It needs to dissipate less than 2 MJ/kg, whereas the space shuttle needs to dissipate upwards of 34 MJ/kg. An object returning from the Moon has to dissipate close to twice as much energy as an object in LEO, and the Stardust probe\u0027s sample return capsule entered the Earth\u0027s atmosphere with over 80 MJ/kg!\u003C/p\u003E\u003Cp\u003EAn aggressive aerobraking pass will cause significant heating and will require a heat shield. The most aggressive form of aerobraking is aerocapture. In the case of aggressive aerobraking, heat dissipation is a further problem because there\u0027s no convection in space to cool the shield between aerobraking passes. Radiation is the only cooling mechanism and it isn\u0027t as effective as convection. Ablative heat shields designed for multi-pass aerobraking/aerocapture must also tolerate repeated exposure to elevated temperatures without failing or burning through.\u003C/p\u003E\u003Cp\u003EThe multi-pass aerobraking followed by aerocapture process described in the OP works in KSP because the current re-entry heat model doesn\u0027t take into account ablation of heat shields, and the unshielded spacecraft components are more tolerant of high temperatures than real life spacecraft.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-07T23:07:03Z\u0022 title=\u002211/07/2013 11:07  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 7, 2013\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003Cbr\u003EFixed a number\n\u003C/span\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-11-07T23:39:46Z","Content":"\n\u003Cp\u003EWell if you had materiel strong enough, I guess you could in theory, build a ladder to geosynchronous orbit, park your ship next to it and take the ladder down. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2013-11-07T23:56:28Z","Content":"\n\u003Cp\u003EThanks for the OP, that was an interesting discussion about re-entry theories \u0026gt; I really am a geek.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-08T01:51:54Z","Content":"\n\u003Cp\u003EAs some people have mentioned or alluded to, re-entry without heat shields is entirely possible, depending on maximum altitude attained. Re-entry from orbital flight, however, is not. A drop from 100km is only going to have 1.3km/s worth of energy in it. You don\u0027t need heat shields to survive that. Re-entry from LEO, on the other hand, is going to be on the order of 7km/s. That\u0027s a whole different game.\u003C/p\u003E\u003Cp\u003EThis does suggest one way to return from orbit without heat shields, however. Just do a retrograde burn to kill all your orbital velocity and drop almost straight down into the atmo. Problem is that the fuel required to do that is going to be heavier than a heat shield.\u003C/p\u003E\n"},{"CreatedByName":"Tech Support","CreatedById":89874,"CreatedDateTime":"2013-11-08T06:23:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EFrom orbit? I don\u0027t think so, you have too much speed to lose.\u003Cp\u003EBut people have fallen from near space without needing heat shields, look at Felix Baumgartner\u0027s recent skydive \u003Ca href=\u0022http://www.space.com/14928-space-jump-supersonic-skydive-practice.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.space.com/14928-space-jump-supersonic-skydive-practice.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you could cancel your horizontal velocity and be draggy enough so you didn\u0027t build up too much speed as you fell, then you wouldn\u0027t have the same heat build up as a craft re-entering, the heat is cause by compression of the atmosphere in front of you, not by friction.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethis video should provide some illumination to this debate \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLYu7z3I8tdEn2m_lLL3Vn7BDwkvMLo_hl\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIn the end he does suggest that if we could could a very angled trajectory we could do without heatshields\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-08T06:31:37Z\u0022 title=\u002211/08/2013 06:31  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 8, 2013\u003C/time\u003E by Tech Support\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-08T07:10:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tech Support\u0022 data-cite=\u0022Tech Support\u0022\u003E\u003Cdiv\u003EIn the end he does suggest that if we could could a very angled trajectory we could do without heatshields\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENah. I did the math on that once. It\u0027s a good idea on paper, but by the time you have enough lift, you\u0027re in too dense an atmosphere moving too fast to survive without a heat shield.\u003C/p\u003E\u003Cp\u003EYou \u003Cem\u003Emight\u003C/em\u003E be able to do something with a powered descent, but all of the \u0022simple\u0022 things I\u0027ve tried result in you burning as much or more fuel than you\u0027d need to simply kill your orbital velocity and drop down.\u003C/p\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2013-11-08T08:22:55Z","Content":"\n\u003Cp\u003ESo right now everyone is talking about 1 shot ships and using a heat shield because it is lighter.\u003C/p\u003E\u003Cp\u003EWhat if we wanted a ship that could land multiple times from orbit in multiple locations on multiple bodies in locations where replacing a heat shield is not an option but refueling is.\u003C/p\u003E\n"},{"CreatedByName":"Thiel","CreatedById":13126,"CreatedDateTime":"2013-11-08T08:42:26Z","Content":"\n\u003Cp\u003ESimple, make a tougher heatshield and pay the weight penalty\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-11-08T08:48:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drakesdoom\u0022 data-cite=\u0022drakesdoom\u0022\u003E\u003Cdiv\u003ESo right now everyone is talking about 1 shot ships and using a heat shield because it is lighter.\u003Cp\u003EWhat if we wanted a ship that could land multiple times from orbit in multiple locations on multiple bodies in locations where replacing a heat shield is not an option but refueling is.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell transporting a heat shield to the landed ship is still easier than transporting the heavier and explosive fuel to it.\u003C/p\u003E\u003Cp\u003EThere aren\u0027t that many places that produce rockets fuels around the world. If you want space ports, then you need to pre-place the necessary parts and infrastructure to do it.\u003C/p\u003E\u003Cp\u003EJust look at that big Airbus A380. It can\u0027t just go to any airport, it has to go to airports that have been prepared for it.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-08T08:52:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drakesdoom\u0022 data-cite=\u0022drakesdoom\u0022\u003E\u003Cdiv\u003EWhat if we wanted a ship that could land multiple times from orbit in multiple locations on multiple bodies in locations where replacing a heat shield is not an option but refueling is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is an option. I don\u0027t think anyone is saying it is not. You are not going to do worse landing than you are taking off. In fact, you can look at LM as an extreme case. Lithobraking wasn\u0027t an option, so they had to burn fuel to land. Same deal with aerobraking on re-entry.\u003C/p\u003E\u003Cp\u003EThe problem, of course, is that it takes an enormous amount of fuel to do powered landing on Earth. As I\u0027ve mentioned above, I haven\u0027t come up with anything that improves dramatically on simply killing (almost) all of your orbital speed. And that\u0027s 6-7km/s worth of fuel. When your typical rocket is capable of something on the order of 10km/s total, adding 6-7 more on top of that is insanely challenging. Right now, it\u0027s simply cheaper to have craft that are either not re-usable at all, or require servicing of the heat shields. And we can\u0027t do better with chemical fuels.\u003C/p\u003E\u003Cp\u003EWe are going to have to find a completely different kind of fuel/propellant for our ships before we start looking at a heat shield as too much hassle. MSMH could do it, but we don\u0027t know if that mythical substance even exists. Much less how to produce it in necessary quantities for cheap. At higher energies are the core electrons, which nobody knows how to work with, or nuclear. Fission or fusion are going to be very troublesome for small ships, but maybe we don\u0027t have to go small. There is also some promise in nuclear isomers. Since there is no decay involved with these, the only radiation you have to deal with is gamma, making for a much cleaner reactor. Nuclear isomer batteries are also rechargeable, at least in theory, but that might not be worth the trouble. At any rate, there are some options in power generation.\u003C/p\u003E\u003Cp\u003EThe biggest limitation with alternative power sources is getting decent TWR. If you want to do powered landing, you don\u0027t need quite as high TWR as you do for liftoff, but anything significantly less than 1 is going to be problematic. The best we\u0027ve got is NERVA, and that only gives you about a fifth of its own weight in thrust. You \u003Cem\u003Emight\u003C/em\u003E be able to do powered landing on one of these if that\u0027s all you are carrying. But you aren\u0027t lifting off on that. And once you add everything you need for liftoff, the ship\u0027s too heavy for powered landing on NERVA. (Naturally, I assume that multi-stage defeats the very purpose of building something that can be simply refueled.)\u003C/p\u003E\u003Cp\u003ESo in short, yes, powered landing can replace heat shields. Yes, it would be very useful to have that capability. But no, we don\u0027t have anything even close to the tech you\u0027d need to make it happen.\u003C/p\u003E\n"},{"CreatedByName":"Savage117","CreatedById":69620,"CreatedDateTime":"2013-11-08T09:39:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drakesdoom\u0022 data-cite=\u0022drakesdoom\u0022\u003E\u003Cdiv\u003ESo right now everyone is talking about 1 shot ships and using a heat shield because it is lighter.\u003Cp\u003EWhat if we wanted a ship that could land multiple times from orbit in multiple locations on multiple bodies in locations where replacing a heat shield is not an option but refueling is.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis made me think, what other ways could one land a ship that still has to deal with aerobraking without using an ablative heatshield? For instance, lets say our ship is interstellar and has established orbit around a Earth-like planet, we only have one lander and that lander needs to be able to land, takeoff, and land again in another location from orbit, say because it needs to refuel at the mothership. If its a large lander, which it will be due to the needed fuel to make a powered landing on Earth and takeoff, an ablative shield will also have to be large and heavy, and storing several of those shields on the mothership would be impractical for many reasons, most of them due to safety concerns. So how would you do it? I\u0027m no expert so these ideas I\u0027m gonna throw out are just brain storming. We have materials that could easily survive the heat of re-entry without damage, the problem is they wouldn\u0027t dissipate the heat very well, basically cooking our poor astronauts before they got to the ground. So how bout active cooling? Or maybe passive cooling methods like Heatsinks, these are usually heavy things especially if they needed to dissipate heat quickly, but they might work, right?\u003C/p\u003E\u003Cp\u003ESecond theory: since sky diving from orbit would turn you into a crispy critter without a heatshield. Could you not just send a rocket straight up to 300km without establishing orbit, jump out and fall straight back down to Earth without deadly re-entry heat. Or would the rotational speed of the planets atmosphere be enough to cook you on the way down? Just a thought.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-08T09:45:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Savage117\u0022 data-cite=\u0022Savage117\u0022\u003E\u003Cdiv\u003ESecond theory: since sky diving from orbit would turn you into a crispy critter without a heatshield. Could you not just send a rocket straight up to 300km without establishing orbit, jump out and fall straight back down to Earth without deadly re-entry heat. Or would the rotational speed of the planets atmosphere be enough to cook you on the way down? Just a thought.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E300km is pushing it. Not because of Earth\u0027s rotation, but because a fall from 300km is going to get you going at nearly 2km/s by the time you enter thick enough atmosphere to start slowing down. But what use is that, anyways?\u003C/p\u003E\n"},{"CreatedByName":"Savage117","CreatedById":69620,"CreatedDateTime":"2013-11-08T10:48:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E300km is pushing it. Not because of Earth\u0027s rotation, but because a fall from 300km is going to get you going at nearly 2km/s by the time you enter thick enough atmosphere to start slowing down. But what use is that, anyways?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENever said it would be useful, just awesome. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I thought smaller objects create less compression, so would a man sized object be able to survive 2km/s worth of aerobraking? Thats 1/4th the speed of a spacecraft returing to Earth. How fast do you need to be going to get deadly re-entry heat anyway? When I thought about this I was thinking of Star Treks space diving that was briefly mentioned in several episodes and shown in the new Star Trek movie. After reading this and playing KSP I know that was a bunch of movie magic, handwavyness and impossible as shown in the movie, but could it actually be possible under the right circumstances, was my thought?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-11-08T11:28:58Z","Content":"\n\u003Cp\u003EThere are two regimes. First in upper layers of the atmosphere, where density is very low. The in-falling object will collide with individual air molecules there. There is no hydrodynamics. Every molecule on your path you are going to hit. Here, the shape is absolutely irrelevant. Heat generation can be quite severe, but falling straight down you also pass this region pretty fast. Then you hit thicker atmosphere where air starts to behave as a fluid. The in-falling object generates a shock wave, and that helps reduce heat transferred to the body. On the other hand, air is denser, so way more energy is dissipated here. If there is a problem, it will happen here. And yeah, shape and size will matter. Slow down too gradually, you burn up. Slow down too fast, G-forces will get you. The later shouldn\u0027t be a problem for a falling human. The heat, though, I don\u0027t know. This is Mach 6, so it\u0027s going to be bad. But it could be brief enough to be survivable.\u003C/p\u003E\n"},{"CreatedByName":"BrickedKeyboard","CreatedById":91822,"CreatedDateTime":"2013-11-08T20:57:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E This is Mach 6, so it\u0027s going to be bad. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. Hope he\u0027s wearing an armored spacesuit with armored underpants.\u003C/p\u003E\n"},{"CreatedByName":"Simon Ross","CreatedById":82582,"CreatedDateTime":"2013-11-08T21:34:32Z","Content":"\n\u003Cp\u003EIt really depends on what you define as a heat shield. On most traditional capsule type re-entry vehicles it has been an ablative type heat shield. On the Shuttle it was ceramic charring heat shield. In reality, there are a number of metals you can use as a heat shield, all of which will dissipate heat faster then they will absorb it during re-entry and are re-usable. Only problem is, most of them are very heavy.\u003C/p\u003E\n"}]}