{"TopicId":55616,"ForumId":44,"TopicTitle":"I represent an interstellar civilization, What does Earth offer for export?","CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-12-09T06:25:27Z","PageNum":7,"Articles":[{"CreatedByName":"randomness5555","CreatedById":53367,"CreatedDateTime":"2015-09-22T12:16:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moar Boosters\u0022 data-cite=\u0022Moar Boosters\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m sure even alien school children would love to learn about how crazy, brave and primitive we are to strap ourselves to giant explosive devices just to reach orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou know what? I like that idea, I think you could be right there. And what we could offer them? Variety maybe? New ways of thinking, types of culture and entertainment and the like. But no human zoos, that ain\u0027t cool.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-09-22T12:32:29Z","Content":"\n\u003Cp\u003EAn inexhaustible supply of endless slave labour?\u003C/p\u003E\n"},{"CreatedByName":"vixr","CreatedById":133940,"CreatedDateTime":"2015-09-22T18:21:18Z","Content":"\n\u003Cp\u003ETweakers... Please take as many as you like (no trade required)\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-09-22T19:52:31Z","Content":"\n\u003Cp\u003ENow, this debate is cool and all, but has anyone given any thought as to how we would actually \u003Cem\u003Ecommunicate\u003C/em\u003E with said aliens to arrange a trade deal?\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-09-22T23:37:54Z","Content":"\n\u003Cp\u003EOh hey, that\u0027s a cool thread I haven\u0027t replied to yet!\u003C/p\u003E\u003Cp\u003EA civilization able to go interstellar would probably treat us as an amusement park, or something like that. They could take from us whatever they wanted without even caring about being attacked. My lasers defeat your heat-seeking missiles! PEW PEW!\u003C/p\u003E\u003Cp\u003EThey would probably take a few pics here and there, chat about the economics and politics for a few minutes, gather some animals or plants for DNA and fly away.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-09-22T23:56:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Veeltch\u0022 data-cite=\u0022Veeltch\u0022\u003E\u003Cdiv\u003EOh hey, that\u0027s a cool thread I haven\u0027t replied to yet!\u003Cp\u003EA civilization able to go interstellar would probably treat us as an amusement park, or something like that. They could take from us whatever they wanted without even caring about being attacked. My lasers defeat your heat-seeking missiles! PEW PEW!\u003C/p\u003E\u003Cp\u003EThey would probably take a few pics here and there, chat about the economics and politics for a few minutes, gather some animals or plants for DNA and fly away.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally? Aliens go PEW PEW.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-09-23T00:13:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EReally? Aliens go PEW PEW.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. PEW PEW!\u003C/p\u003E\u003Cp\u003EOn a serious note (and after some thinking and reading of this thread), I think it might\u0027ve been nice if we taught them our languagues and they would show us some of their math or physics equations we don\u0027t know about. One of the languagues spoken on Earth might be similar to a languague used by some other civilization in the universe so knowing it might be useful. I mean, what other thing an all-knowing civilization has to do? Space travels get boring and they might actually consider learning a form of entertainment!\u003C/p\u003E\u003Cp\u003EEither that or they would talk to the dolphins.\u003C/p\u003E\n"},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2015-09-23T04:40:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003Erule 34\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou stole my answer...\u003C/p\u003E\u003Cp\u003EWelcome, Robbaz here to another episode of the Sims\u003C/p\u003E\u003Cp\u003E*que Billy Jean*\u003C/p\u003E\u003Cp\u003ENow to move on, I\u0027d say culture. If you have ever played Civilization, you will realize there are different things in every Civ. The aliens mightnhave warp drives. We might have say, cats. They get cats, we get warp drives.\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-09-23T10:01:51Z","Content":"\n\u003Cp\u003EFood and drinks? Assuming these aliens eat actual food instead of consuming some sort of nutrient fluid or something.\u003C/p\u003E\n"},{"CreatedByName":"Requia","CreatedById":112924,"CreatedDateTime":"2015-09-23T18:37:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WedgeAntilles\u0022 data-cite=\u0022WedgeAntilles\u0022\u003E\u003Cdiv\u003EMilitary advisors.\u003Cp\u003ESo what if alien technology is X years ahead of our own? It\u0027s very possible we humans are better at war than they are. Tactical and strategic skill are things you can\u0027t build with advanced technology.\u003C/p\u003E\u003Cp\u003EOh, and that\u0027s also a damn good reason aliens best not mess with us...... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOur history suggests military minds aren\u0027t usually great when faced with new technology, there are some very brilliant exceptions, but a lot of WWI generals were stumbling around in the dark with how to attack a position defended by barbed wire.\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-09-23T19:30:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EInteresting thought. In terms of how civilizations evolve, what if becoming a space-faring race demands that we lose a lot of our \u0022jerk\u0022 tendencies to become a unified and cooperative race? Competition may simply make such a civilization impossible if we can\u0027t get over it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know if we would completely lose our \u0022jerk\u0022 tendencies. We would definitely have to become cooperative to ourselves, but once humanity is working together the competitive drive will be replaced by other interstellar civilizations.\u003C/p\u003E\n"},{"CreatedByName":"Clear Air Turbulence","CreatedById":149987,"CreatedDateTime":"2015-09-23T19:36:14Z","Content":"\n\u003Cp\u003EWe have Donald Trump. You can experiment on him.\u003C/p\u003E\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-09-23T20:01:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EInteresting thought. In terms of how civilizations evolve, what if becoming a space-faring race demands that we lose a lot of our \u0022jerk\u0022 tendencies to become a unified and cooperative race?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t. We\u0027re already a spacefaring race even though we haven\u0027t done the unified cooperative Kumbaya thing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Requia\u0022 data-cite=\u0022Requia\u0022\u003E\u003Cdiv\u003EOur history suggests military minds aren\u0027t usually great when faced with new technology\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAren\u0027t great, compared to what?? It\u0027s all relative. If you assume humans are clumsy and dimwitted at war? Alien civilizations could be even clumsier and more dimwitted at warfare than we are.\u003C/p\u003E\u003Cp\u003EStrategic and tactical concepts are things that don\u0027t require technology. Attack the enemy where they\u0027re weak, not where they\u0027re strong; attack their economy instead of their army; deceive the enemy as to where your military strength really is and what it\u0027s doing; wear down their courage and will to fight instead of wearing down their armies. These are all ideas that can be applied in any theater of war, anywhere. And there\u0027s no reason to assume alien civilizations will have invented them already, because in our own past we humans were once fighting wars without knowing any of the above.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Clear Air Turbulence\u0022 data-cite=\u0022Clear Air Turbulence\u0022\u003E\u003Cdiv\u003EWe have Donald Trump. You can experiment on him.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou seriously don\u0027t want to go there, and here\u0027s why: you have no idea what experiments the aliens have planned. They could be trying to give humans telekinetic powers.\u003C/p\u003E\u003Cp\u003EYikes. I can hear Clear Air Turbulence screaming in terror through my ethernet cable. Didn\u0027t know that was possible........\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-09-23T21:09:29Z","Content":"\n\u003Cp\u003EFor the record, technology DOES enter greatly into warfare. It\u0027s not just a matter of the items that you presented. Yes those are obvious, but there are plenty of other things as well. Technology for example provides the possibilities that your military thinking may or may not be able to exploit or comprehend, not to mention that various social mores can keep you from fully utilizing a given technology. An example of this would be air defense setups. You might have the technical know how to detect your enemy\u0027s anti aircraft systems some distance away from you, it\u0027s not strictly speaking that difficult. And so you might see how a particular setup clearly made sense for a lot of reasons, but left a hole due to terrain off to the side. Utilizing this hole you can clearly get much deeper into the enemies defense network before revealing yourself as you undertake your mission. A clear advantage. Turns out, the enemy saw this hole and decided that instead of simply plugging it, a good 10-15 miles back from the front they have another AA setup geared to pounce on you the moment you got too far in to do any damage, but too far in for you to take any maneuvers to escape one of the three AA batteries boxing you in. If the society in question either was not used to deceptive thinking or had moral qualms against deceptive tactics, than it might never occur to them that such a setup could be a trap to either be wary of, or that they could set up themselves.\u003C/p\u003E\u003Cp\u003EThat is an example of a decision that used the limitations and advantages of both sides technology to drive the tactics of either side. If one side did not have the ability to see the radar the other was using, they wouldn\u0027t have even known of the possibility of the hole. Which of course means that they would never be able to take advantage of real ones should they exist. Meanwhile, the other side knew the limitations on its systems and used it to sucker the other side in. If their technology was particularly better or worse (lets say they have flack guns instead of missiles) than either the holes wouldn\u0027t exist in order to exploit, or you\u0027d rather plug them up to increase the chances of detecting an enemy with enough time to do something about it.\u003C/p\u003E\u003Cp\u003EThere are many scenarios that can demonstrate this, but the point is that your technology enables a great many tactics and strategies for you, but if you do not have the requisite thinking in order to take advantage of them, then your effectiveness goes down against an enemy that does.\u003C/p\u003E\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-09-23T22:35:42Z","Content":"\n\u003Cp\u003ETechnology doesn\u0027t really enable new military strategies and tactics, it just makes existing ones easier (or more difficult). The concept of going around the enemy defenses instead of through them, for example, has existed for a lot longer than air power has. Air power (and the catapult, in all truth) simply added another way to go \u0022around\u0022: by going \u0022over\u0022.\u003C/p\u003E\u003Cp\u003EWhether or not technology can open new doors....it can definitely close them. An advanced military that comes to take particular technologies for granted (such as, say, satellite surveillance) tends to forget how it did things before those technologies existed. Then, when some evil genius sets off an orbital EMP or something, and the entire satellite network goes dead......big problem.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2015-09-24T01:47:58Z","Content":"\n\u003Cp\u003EWhy do Americans go to Central America? \u003C/p\u003E\u003Cp\u003ETo see the sights, eat the food (Which could likely be made edible, Id be surprised if Aliens didn\u0027t utilize similar organic compounds for energy), may be build a school or two.\u003C/p\u003E\n"},{"CreatedByName":"X10Z","CreatedById":105923,"CreatedDateTime":"2015-11-02T00:25:42Z","Content":"\n\u003Cp\u003EAn alien\u0027s experience on Earth would be less like an amusement park, and more like a township tour. We just don\u0027t have that much to give them.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-11-02T00:38:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022X10Z\u0022 data-cite=\u0022X10Z\u0022\u003E\u003Cdiv\u003EAn alien\u0027s experience on Earth would be less like an amusement park, and more like a township tour. We just don\u0027t have that much to give them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIgnorance? I mean, we have boat loads!\u003C/p\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2015-11-02T00:42:46Z","Content":"\n\u003Cp\u003Ehumans... we offer humans... you can get as many as you need... they are hard workers and can do anything if you give green paper to them... and some iPhones... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-02T23:44:14Z\u0022 title=\u002211/02/2015 11:44  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 2, 2015\u003C/time\u003E by luizopiloto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-11-02T01:07:31Z","Content":"\n\u003Cp\u003ETotality Solar Eclipses on the seurface of a habitable planet are a seasonal tourist attaction unavailable anywhere else in the galaxy. (statistically speaking)\u003C/p\u003E\n"},{"CreatedByName":"Alias72","CreatedById":111778,"CreatedDateTime":"2015-11-02T01:46:08Z","Content":"\n\u003Cp\u003EInternet memes. They can have over 9000 internet memes.\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-11-02T02:43:25Z","Content":"\n\u003Cp\u003EI\u0027ll give them bigots, sexist, racist, and other-ist people. \u003C/p\u003E\u003Cp\u003EEdited for too much left-wing crazy juice.\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2015-11-02T20:30:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Agent86\u0022 data-cite=\u0022Agent86\u0022\u003E\u003Cdiv\u003EWar. Lots of War.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat is it good for?\u003C/p\u003E\u003Cp\u003E*stares at you expectantly*\u003C/p\u003E\u003Cp\u003EYeah, medicines and genome harvesting, mainly.\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-11-02T23:58:59Z","Content":"\n\u003Cp\u003EOn a side note, I have to admit getting a bit sick of the scifi idea that aliens contact us because they cannot even conceive of how to fight and thus are grabbing the violent monkeys. Mostly because in a lot of ways I think that while sure, they might have developed their society into one in which enacting violence is just not something that would occur to them, they clearly have engineering (they did just come here in an FTL ship to grab us to fight for them). Rather quickly they\u0027d figure out that whatever is going on, it\u0027s not an accident and so they can SEE violence in front of them. People willfully attacking other people. Sure, they have no experiencing doing this well, but in many ways combat tactics, ESPECIALLY spaceship tactics are just an engineering problem. Making weapons is obvious, they can control titanic energy forces already, so figuring out how to...lose control...of those forces in directed ways shouldn\u0027t be that hard for them to figure out. After that its a matter of running simulations on what might work, trying them for real, etc. Learning how to be good at violence/war at violence isn\u0027t particularly hard. With the exclusion of learning things like military discipline and developing such a culture in their forces, I\u0027d honestly posit that them starting to figure out war from a standing start probably ends up taking only a bit longer than us figuring starting with new tactics and such given suddenly having magic-grade hyper tech to work with as weapons (at least, as compared with our current things).\u003C/p\u003E\u003Cp\u003EBut on to the main topic. I recently read a book (whose name I am struggling to remember) where the US discovers that aliens set up a space station next to Jupiter and is trying to quietly assemble a mission to go there, hoping not to tip off China (who has a ship prepping to start delivering colonists to Mars), so that they can get there first.\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-11-03T00:05:39Z","Content":"\n\u003Cp\u003ENow, we are by nature extremely war-mongering (I\u0027m looking at you USA), and hate even the slightest difference in cultures and peoples. That doesn\u0027t mean were that bad. The invention of the Atomic Bomb and a German scientist named Werner Von Braun, we have been able to explore our native system to the very farthest. We plan to send people to our fourth planet from the sun, Mars. I\u0027ll leave it up to you to decide our fate/relations.\u003C/p\u003E\n"}]}