{"TopicId":56126,"ForumId":44,"TopicTitle":"What life looks like on other planets? (scientific discussion)","CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-14T15:16:41Z","PageNum":1,"Articles":[{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-14T15:16:41Z","Content":"\n\u003Cp\u003EWe know that there is life somewhere in the universe.\u003C/p\u003E\u003Cp\u003EEven the most pessimistic statistics show that there must be at least thousands of planets with (ANY sort of) life within our galaxy.\u003C/p\u003E\u003Cp\u003EWe will hardly find any other life kinds anytime soon though.\u003C/p\u003E\u003Cp\u003EAnyway, \u003Cstrong\u003Eif for any reason you disagree the said above, just don\u0027t bother getting on this discussion\u003C/strong\u003E, under the risk of falling under 2.2b rule, which will be reported.\u003C/p\u003E\u003Cp\u003EI\u0027m not talking about religion or beliefs here, so no harassing is intended.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBiologically and scientifically talking:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHow you belive other planets lifeforms look like?\u003C/p\u003E\u003Cp\u003EWhat can the microorganisms probably life with?\u003C/p\u003E\u003Cp\u003EWhat are the possible interspecies relations of such a different biosphere?\u003C/p\u003E\u003Cp\u003EWhich ways can a different lifeform communicate and behave?\u003C/p\u003E\u003Cp\u003EWhat can their organisms \u0022recipe\u0022 be based on? (ex: on earth we got DNA)\u003C/p\u003E\u003Cp\u003EDo they even need a sort of DNA?\u003C/p\u003E\u003Cp\u003EThese and all related questions are meant to be discussed here.\u003C/p\u003E\u003Cp\u003ETake this pacifically and under the scientific aspect, not stuff like \u0022green man with cylindrical heads\u0022, or trolling.\u003C/p\u003E\u003Cp\u003ELet\u0027s discuss what seems possible and viable for any sort of stable and prosperous life overall, not just the lifeforms shaping.\u003C/p\u003E\u003Cp\u003EWill be asking for active moderation if needed.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-12-14T15:31:28Z","Content":"\n\u003Cp\u003EIt really depends on the environment what potential extraterrestrial life looks like. All you really need for life is:\u003C/p\u003E\u003Cp\u003E 1) Some system that can encode information (DNA, RNA or something else)\u003C/p\u003E\u003Cp\u003E 2) Some system that can read instructions from the information carrier and use that to produce a copy. (Enzymes, RNA or just a solution of nucleobases)\u003C/p\u003E\u003Cp\u003E 3) Some entropy gradient to fuel the above system.\u003C/p\u003E\u003Cp\u003EThose requirements are quite lenient so I wouldn\u0027t be surprised if we find life in all sorts of places.\u003C/p\u003E\u003Cp\u003EBut, if we are looking specifically at earthlike situations (multicellular life on a planetary body that has liquid water) I suspect them to be quite similar. Even if their chemistry works completely different the same ecological niches exist. I would expect some form of photosynthesis to evolve, I wouldn\u0027t be surprised to find eyes or mouths and land based animals likely have legs.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-14T15:42:37Z","Content":"\n\u003Cp\u003EI also belive that legs-like members are likely to exist on other kinds of life.\u003C/p\u003E\u003Cp\u003EWould it be possible that any sort of moving (moveable) lifeform to be abble to handle photosyntesis even as a fallback?\u003C/p\u003E\u003Cp\u003EWe know that plants can breath oxygen but which factors would bring the opposite to happen?\u003C/p\u003E\u003Cp\u003EMaybe hostility would force photosyntesis-able life to be active or defend itself activelly.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-12-14T15:58:51Z","Content":"\n\u003Cp\u003EI think that they will look quite similar to Earth life, by the Mediocrity Principle.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-14T16:08:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003EI think that they will look quite similar to Earth life, by the Mediocrity Principle.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am not sure that Earth is a planet with the most standard life kind possible.\u003C/p\u003E\u003Cp\u003EIt can be normal to us, but exotic if compared to others.\u003C/p\u003E\u003Cp\u003EJust think about amphibians and their eggs, that doesn\u0027t seem like something that would be common.\u003C/p\u003E\u003Cp\u003EAnd since their branch is one of the first to leave water, it interferes with all big animal organisms we know.\u003C/p\u003E\u003Cp\u003EThat comes from sponges, which trew off their \u0022spores\u0022 to uncluster the bunches.\u003C/p\u003E\u003Cp\u003EI\u0027m still trying to think about a more simplistic way of reproduction and how would it be brought to complex organisms.\u003C/p\u003E\n"},{"CreatedByName":"Black_sod","CreatedById":96750,"CreatedDateTime":"2013-12-15T00:45:37Z","Content":"\n\u003Cp\u003EIt could look like anything. All life on earth is descended from some extremely primitive cell with (probably) some sort of RNA for passing on genetic information. (it\u0027s been shown that certain clays cause RNA to polymerise which is an intriguing hint to it\u0027s origin. anyway since everything is descended from this it makes sense for it to be similar. whose to say some other form of molecule couldn\u0027t be used to transfer genetic info. our life is carbon based. maybe other life forms are based in silicon or sulfur? it also depends on what you define as \u0022alive\u0022 . Viruses are considered as non living. because they can\u0027t reproduce on their own. there\u0027s 7 characteristics ( i think) necessary to call something alive. response respiration nutrition reproduction excretion growth.. the other one is escaping me , oh well. fascinating topic btw\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2013-12-15T16:51:42Z","Content":"\n\u003Cp\u003EThere are photosynthetic see slugs on Earth, although they need to eat algae to get their chloroplasts first.\u003C/p\u003E\u003Cp\u003EI don\u0027t think photosynthesis is that important. There are a number of other processes for life to get energy, and photosynthesis only makes sense if you have a biome that\u0027s not too harsh and has a lot of light.\u003C/p\u003E\u003Cp\u003EThere are different definitions of life. Black_sod\u0027s is a relatively conservative one. I prefer SchrÃƒÂ¶dinger\u0027s one: a system that can decrease its own entropy by using an energy gradient. It allows for much more exotic stuff to be considered alive, like computer programs, large scale plasma structures, complete planets, etc...\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-12-15T19:13:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EI also belive that legs-like members are likely to exist on other kinds of life.\u003Cp\u003EWould it be possible that any sort of moving (moveable) lifeform to be abble to handle photosyntesis even as a fallback?\u003C/p\u003E\u003Cp\u003EWe know that plants can breath oxygen but which factors would bring the opposite to happen?\u003C/p\u003E\u003Cp\u003EMaybe hostility would force photosyntesis-able life to be active or defend itself activelly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1) slugs\u003C/p\u003E\u003Cp\u003E2) why not? We have them on earth\u003C/p\u003E\u003Cp\u003E3) ?\u003C/p\u003E\u003Cp\u003E4) plants are quite actively engaged in chemical (and sometimes mechanical) warfare. Many spread chemicals to poison competing species and even their own, some deliberately grow large leafy canopies in such a way as to block out the sun to other plants in the direct vicinity (have seen time lapse videos of that, it\u0027s amazing).\u003C/p\u003E\n"},{"CreatedByName":"agentKmurph","CreatedById":80512,"CreatedDateTime":"2013-12-15T19:57:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EBiologically and scientifically talking:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHow you belive other planets lifeforms look like?\u003C/p\u003E\u003Cp\u003EWhat can the microorganisms probably life with?\u003C/p\u003E\u003Cp\u003EWhat are the possible interspecies relations of such a different biosphere?\u003C/p\u003E\u003Cp\u003EWhich ways can a different lifeform communicate and behave?\u003C/p\u003E\u003Cp\u003EWhat can their organisms \u0022recipe\u0022 be based on? (ex: on earth we got DNA)\u003C/p\u003E\u003Cp\u003EDo they even need a sort of DNA?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst of all, I think that we run in to an empirical trap when trying to imagine life on other planets. We think that organisms require water and DNA and RNA simply because every organism on Earth has these things. That is an incredibly limited sample size when we look at the scale of the universe. My point is that because its all we\u0027ve ever seen, its all we are capable of thinking about. Life on other planets may use some other self-replicating molecule or it could be silicon-based instead of carbon because silicon, being a metalloid with a \u002B4 oxidation state, has similar properties to carbon. I do agree that water and carbon\u0027s versatility makes them prime factors but I am also going to say they are not the only things life would require\u003C/p\u003E\u003Cp\u003EThat being said, I cannot with any certainty say what lifeforms other planets would look like or what they would be made of. However I would contended that we would immediately recognize them as living.\u003C/p\u003E\u003Cp\u003EWhy? Simple. Life is all a question of meeting certain basic requirements. Does it reproduce? Does it respond to its environment in a meaningful, non-random way? Does it exhibit a complicated, multifaceted chemical structure?\u003C/p\u003E\u003Cp\u003EAnd even though we may not be able to anticipate what life on other planets might look like exactly there are probably things that are going to remain pretty consistent. For instance, perceptive organs. Eyes are going to be pretty much the same because of the nature of light. If you have some other way of focusing light other than a lens with an aperture, I am eager to see it. Ears would be pretty recognizable as well. Maybe less so because other organisms may transduct sound directly rather than through a fluid-filled cochlea like in humans. Noses / nostrils, especially if the being depends on atmosphere for respiration.\u003C/p\u003E\n"},{"CreatedByName":"Black_sod","CreatedById":96750,"CreatedDateTime":"2013-12-15T21:20:26Z","Content":"\n\u003Cp\u003EJust want to point out that this isn\u0027t MY definition of life, merely what I have been taught as the stance of biologists. I consider virus\u0027 to be alive, an AI? Depends I\u0027d have to meet it first. reproduction I maintain is something key to the definition of life. I remember seeing some programme about this which alluded to forms of life as exotic as clouds of gas particles in a gas giant, or in an Ian Banks book he briefly describes organisms that life along plasma streams in stars \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Ealso why not space-whales /krakens \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2013-12-16T12:00:45Z","Content":"\n\u003Cp\u003EThe definition you used is quite commonly accepted, but it\u0027s too constrained for my taste. As with intelligence, defining is difficult, and the debate is of limited importance until we find something that might be alien life. It works pretty well on Earth to tell the difference between a rock and a living thing, but might be unable to account for exotic stuff, even on Earth.\u003C/p\u003E\u003Cp\u003EAnd I don\u0027t think reproduction per see is that important for a definition. Worker bees, mules or freshly detached limbs are pretty much alive, but they don\u0027t really reproduce. In Lem\u0027s great novel Solaris, there is a planet that is, apparently, a giant organism: that kind of thing wouldn\u0027t reproduce.\u003C/p\u003E\u003Cp\u003ESame thing with respiration/excretion, it just means life needs a form of metabolism, consuming stuff and releasing waste is a way to go, but there might others. And even on Earth, there are a number of things that can live without exactly breathing (by fermenting, for example).\u003C/p\u003E\u003Cp\u003EAnd that\u0027s what I love with SchrÃƒÂ¶dinger\u0027s definition, it doesn\u0027t care for particulars. Reproduction is just an example of entropy decrease, and metabolism one of use of energy gradients.\u003C/p\u003E\u003Cp\u003EThe one thing that many people don\u0027t like with this definition, especially biologists, is that a bunch of things we don\u0027t normally consider alive must then be considered so. We have computer programs that decrease their own entropy by using electricity and computing power, some of them can even reproduce sexually. Companies consumes resources to grow, attack, and sometimes absorb, each other, split, mutate. Memes (in Dawkin\u0027s sense, not in wow doge much sense), can arguably fit that definition too, and so do cities, nations, etc...\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-12-16T12:40:48Z","Content":"\n\u003Cp\u003EFirst of all, the borderline between living and nonliving is not strict. It\u0027s quite blurry, and is especially blurry when chemical evolution is turning into biological one.\u003C/p\u003E\u003Cp\u003EThis is our current understanding of the tree of life.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://biologia.laguia2000.com/wp-content/uploads/2012/10/Archaea.jpg\u0022 alt=\u0022Archaea.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EArchaea and Bacteria look basically the same under a microscope.\u003C/p\u003E\u003Cp\u003EProcariotic microbes should be the basis of the extraterrestrial life. Simple, tiny cells without nucleus, with floating cellular engines inside and various pumps on the membrane.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.earthlife.net/images/bacteria.gif\u0022 alt=\u0022bacteria.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf we ever find them, it will be absolutely spectacular and awesome.\u003C/p\u003E\u003Cp\u003EFor larger organisms, their morphology will depend on their environment and behaviour. Avertebrates would be the first to develop, of course.\u003C/p\u003E\u003Cp\u003EIf they stay in place and gather food, they will resemble tunicates\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm1.static.flickr.com/172/434429108_36f0df8b3a_m.jpg\u0022 alt=\u0022434429108_36f0df8b3a_m.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eor cnidarians\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://207.239.98.140/upperschool/science/Classes/AllBiology/bio/biotext/biowilson/2008-2009/Encyclopedia%20Of%20Life%202009/Cathy/sponges_cnidarians/cnidarian2.jpg\u0022 alt=\u0022cnidarian2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eor sponges\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://1.bp.blogspot.com/_uYveNuAx1SE/TAfismIl0-I/AAAAAAAAAE8/DrA2rRukCQ8/s320/sponge.jpg\u0022 alt=\u0022sponge.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eetc.\u003C/p\u003E\u003Cp\u003ERadial symmetry if they\u0027re predators or no symmetry if they\u0027re filtrators.\u003C/p\u003E\u003Cp\u003EHowever we can expect very different shapes even from simpler organisms.\u003C/p\u003E\u003Cp\u003ESome of you might\u0027ve seen this delicate creature. It\u0027s \u003Cem\u003EAcetabularia acetabulum\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.coexploration.org/bbsr/coral/assets/images/acetabularia.jpg\u0022 alt=\u0022acetabularia.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt looks like a satellite dish flower, sways in the sea and is harmless. It\u0027s a eukaryote, just like any other plant, but this one is unicellular. Each \u0022flower\u0022 is one cell, measuring few centimetres in height. Now that\u0027s the kind of diversity I expect to see with more developed organisms.\u003C/p\u003E\u003Cp\u003EIn some aspect they will be the same as Earth life (basic carbon chemistry), in other aspects they\u0027ll be similar (biochemical mechanisms), but even with the same basic rules (symmetry, etc.), we should expect surprises such as \u003Cem\u003EAcetabularia\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-12-16T13:23:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EI am not sure that Earth is a planet with the most standard life kind possible.\u003Cp\u003EIt can be normal to us, but exotic if compared to others.\u003C/p\u003E\u003Cp\u003EJust think about amphibians and their eggs, that doesn\u0027t seem like something that would be common.\u003C/p\u003E\u003Cp\u003EAnd since their branch is one of the first to leave water, it interferes with all big animal organisms we know.\u003C/p\u003E\u003Cp\u003EThat comes from sponges, which trew off their \u0022spores\u0022 to uncluster the bunches.\u003C/p\u003E\u003Cp\u003EI\u0027m still trying to think about a more simplistic way of reproduction and how would it be brought to complex organisms.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAmphibians evolves from fish who lay eggs in water, some fish manages out of water for some time so its a sliding slope between them. \u003C/p\u003E\u003Cp\u003EThe next step i harder, why not instead of eggs with shell it might be simpler to keep the egg internally until it hatches. \u003C/p\u003E\u003Cp\u003EBoth some fish and frogs do this, has the benefit that you get fewer offspring and should take care of them.\u003C/p\u003E\u003Cp\u003EIs an six limbed fish plausible? it should result in six limbed land animals. \u003C/p\u003E\u003Cp\u003EAmong plants and small animals we will probably find all sort of things, for larger animals it would be less fun stuff as physic set design limits, yes you will still get weird stuff like dinosaurs and giraffes, more weird if six limbed, the front limbs would also make nice weapons or manipulators.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-16T13:39:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EAmphibians evolves from fish who lay eggs in water, some fish manages out of water for some time so its a sliding slope between them. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that every organism on the planet still grows it\u0027s young in an aquatic environment. Eggs, after all, are just a small, enclosed \u0027sea\u0027, wombs and water births of many a creature, it\u0027s all about creating a tiny little ocean just for your offspring to grow up in.\u003C/p\u003E\u003Cp\u003EWe all came from the sea and we all carry the sea with us when we re-produce.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-12-16T20:17:32Z","Content":"\n\u003Cp\u003EWith transformative technological innovations coming in the fields of biology/genetics, computing, and possibly nanotechnology, I think that there could be two very different kinds of life in the universe, and multitude of combinations between the two-\u003C/p\u003E\u003Cp\u003EA) Emergent\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Designed\u003C/p\u003E\u003Cp\u003EC) Hybrid types\u003C/p\u003E\u003Cp\u003EA) Emergent life forms are what we are. No one designed us, we arose naturally out of the organic soup and then come to where we are today through lucky chance and Darwinian evolution. Emergent life forms were \u0022designed\u0022 by the blind hand of Darwin, and are not likely to be as fit as well-designed Designed or hybrid life forms. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Designed life forms are created by an intelligent civilization. They may be biological (chemical) in nature, they may be mechanical, they may be some combination of the two, or possibly, something we haven\u0027t even imagined yet. Because there is an actual intelligent designer responsible for the evolution of Designed life forms, they are theoretically capable of being far more fit and adaptable that the solely Emergent life forms. We do not yet have any examples of purely Designed life forms, though we know it is theoretically very possible. If we completely crack the DNA code, or computers crack it, then theoretically we can build any kind of organism we want, if we can find a way to piece together the desired DNA sequences. Alternatively, a sufficiently intelligent computer system, capable of reproducing itself or shaping its environment to its own desires, could also be considered a Designed life form. There is the question, however, of whether to class life forms with at least part of themselves designed via evolutionary algorithms as \u0022Emergent\u0022 or \u0022Designed\u0022. I\u0027m leaning towards \u0022Designed\u0022 however, as the conditions of the evolutionary algorithms, and what features are favored across the artificial generations, IS a very much designed set of parameters. The features that true Darwinian evolution favors are not under anyone\u0027s control.\u003C/p\u003E\u003Cp\u003EC) Hybrid life forms are what we humans are just beginning to dabble in through genetic engineering. Hybrid life forms will probably start as some Emergent organism that is modified in some desirable way. We have the very first of these now, as genetically engineered plants and animals, but these organisms are still like 99.99% Emergent. Of course the, strength of Hybrid life forms is that they can be created by such intellectual dunces as our 100% Emergent selves, because we don\u0027t have to understand how the entire organism works. It\u0027s a lot harder to make a major mistake, as Darwin has the bases covered.\u003C/p\u003E\u003Cp\u003EIt is my hope that humans will eventually overcome the stigma of \u0022playing God\u0022 and start modifying ourselves, once we have the means to do so in a safe and humane manner, that is. We are likely to give birth to Designed or Hybrid offspring (intelligent computers, at the very least, if not uplifted non-human animals, too), and unless we modify ourselves, we are likely to get very outclassed by our Designed or Hybrid descendants. Right now, humans are just wild animals. Think about it- we domesticated dogs, cats, cows, etc. to make them more compatible with humans. But we never underwent a program to make humans more compatible with humans. Never tried to increase our intelligence, and decrease our violent tendencies. We never tried to increase our fitness. We\u0027ve also never had to the technology to do so in a safe and humane manner either, but that is very likely to change. For example, if genetic tailoring becomes possible, all it takes is a small number of individuals doing it voluntarily to pass the positive benefits to the rest of the population.\u003C/p\u003E\u003Cp\u003EAnyway, with the likely advent of Designed and Hybrid life forms, perhaps not even the sky is the limit as to what kind of life we could expect to find in extrasolar planetary systems. If an advanced civilization had an influence or is still active, there could be life forms living among the asteroids. Designed life forms do not even need a habitable world, as long as they have energy and building materials, they can go and live anywhere.\u003C/p\u003E\u003Cp\u003EIn the end, I think that intelligent civilizations likely change the very definition of what counts as life. Darwinian evolution, and maybe even biology, may just be the stage that life forms go through before an intelligent race is evolved that acheives the requisite level of technology. Once that happens, the intelligent race takes over, replacing the blind hand of Darwin with more purposeful and infinitely more adaptive DESIGNED life forms.\u003C/p\u003E\u003Cp\u003ENow, most emergent biologies will likely never progress to this stage, but some should, and they will be the most \u0022powerful\u0022 life forms in the universe, nearly infinitely adaptable, and thus, likely nearly immortal.\u003C/p\u003E\u003Cp\u003EMaybe this sounds a little crazy, but if our technological progress has taught us anything, it is to not discount the possibility of something that is not prohibited by the laws of physics. That is especially true for technologies we are ALREADY developing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T20:37:58Z\u0022 title=\u002212/16/2013 08:37  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"}]}