{"TopicId":58093,"ForumId":44,"TopicTitle":"Choosing a graphing calculator","CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-29T03:33:20Z","PageNum":1,"Articles":[{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-29T03:33:20Z","Content":"\n\u003Cp\u003ESince I have started playing Kerbal Space program, I have started doing something I have been wanting to do for a long time, which is brushing up my mathematics. In high school I had some excellent teachers, but at that age I was more interested in things outside school. I had a great time and have very little regrets, except that I wish I put a little more effort into these exact sciences. It is no use dwelling on the past, so with the help of Khan Academy I decided to rectify this.\u003C/p\u003E\u003Cp\u003EUntil now, I have made do with a Casio fx-82ES PLUS, which is a cheap but capable calculator. However, there are limits to what it can do. Websites on the internet provide some great free graphing capabilities, but those are usually of a more limited nature and I much prefer physical buttons. I actually own an old Texas Instruments Ti-82, but that is buried in a box somewhere and it would take a considerable effort to try and find it. I think it is a bit outdated anyway. Therefore I have decided to look for a new graphing calculator.\u003C/p\u003E\u003Cp\u003EHere\u0027s the catch: I am unsure what to get. I am actually unsure what to look for. Most advices seem to be based on what functions you are not allowed to use (school) or the specific line of work you want to use it for (financial, construction et cetera). The problem is I am in none of those positions. Also, since I still working on expanding my knowledge, I am unsure where I will end up and what I will need. \u003C/p\u003E\u003Cp\u003EI am looking for a calculator that has the least amount of (artificial) restrictions, with a broad range of applications and capabilities. Some preliminary research indicates that something like a Ti-Nspire CX CAS could be what I am looking for, but it is unclear whether that would be my best option. Since these things are not cheap, I would like some input from people that have more experience with these things. Do you have any tips and suggestions?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-29T05:20:08Z\u0022 title=\u002212/29/2013 05:20  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 29, 2013\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003Cbr\u003ECorrected Ti type.\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-12-29T03:50:22Z","Content":"\n\u003Cp\u003EHP15C all the way. Of course it cannot draw graphs. But there\u0027s computers for that.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-29T03:56:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EHP15C all the way. Of course it cannot draw graphs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am not sure a non-graphing calculator is a good option for a graphing calculator \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E Unless you can provide some proper reasoning that would be a good option, of course.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-29T04:19:44Z","Content":"\n\u003Cp\u003EFind that Ti-83. It\u0027s a good machine. A bit over-priced if you buy it new, but in terms of capabilities, nothing outdated about it. You can flash it with fresh firmware if needed.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-12-29T04:22:04Z","Content":"\n\u003Cp\u003EI personally loved the TI-89 because it can do calculus for you. The ti-84 is good for school and those are the only ones I have used.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-29T04:45:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EFind that Ti-83. It\u0027s a good machine. A bit over-priced if you buy it new, but in terms of capabilities, nothing outdated about it. You can flash it with fresh firmware if needed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you not think there are better options in terms of speed and capabilities? The capability of doing things like calculus sounds interesting. I feel I should be able to do it by hand, but as with other tasks, sometimes it is just a little more convenient to punch in the numbers.\u003C/p\u003E\u003Cp\u003EWhatever the choice, I would probably buy second hand (if I buy at all), as there are a lot of barely used calculators out there that could use a good home. That also narrows the price range quite a bit.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-29T05:12:44Z","Content":"\n\u003Cp\u003ECorrection: I believe the buried-in-boxes-calculator might very well be a Ti-82, not a Ti-83.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-12-29T05:30:31Z","Content":"\n\u003Cp\u003Eloved my Ti-81 when I still used a graphing calculator. The newer models appear more capable, never tried them.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-29T06:07:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EThe capability of doing things like calculus sounds interesting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only calculators I know to do symbolic math are the Ti-89 and Ti-92. They are pretty much the same, but Ti-92 has a full qwerty keyboard and a larger screen. It\u0027s also larger and heavier overall. Ti-89 has the same body as the rest of the 8x series, so it\u0027s a bit more convenient on the go. The software on the two is pretty much the same.\u003C/p\u003E\u003Cp\u003EThese will, indeed, do symbolic calculus, including doing things like taking indefinite integrals. They are also pretty good at factoring, solving systems of equations, and so on. Nowhere near as advanced as PC software, like, say, Mathematica, but it\u0027s handy. So if this is what you are looking for, you probably won\u0027t be disappointed. I\u0027ve used both, and liked everything but the price. they are pretty expensive.\u003C/p\u003E\u003Cp\u003EThe other 8x models only do some numerical calculus. They can do things like area under a curve, find local minima/maxima, and do tangent lines. In other words, they can handle calculus problems numerically, but not analytically. So if your interest is purely in solving numerical problems, you\u0027ll probably be able to learn to do everything even with a Ti-82.\u003C/p\u003E\u003Cp\u003EEdit: There is one more cool option for portable computing. If you have an android phone or tablet, you can get Octave on it. I don\u0027t know if there is a port for iOS devices as well, but there might be. Octave basically runs engine equivalent to Matlab and can handle pretty much all the same things. In terms of getting the most computational power on the go, this is miles ahead of any graphing calculator. Unfortunately, Octave doesn\u0027t do symbolic math. It\u0027s a purely numerical tool.\u003C/p\u003E\u003Cp\u003EThis might also be your cheapest option even if you have to buy an Android device for it. Texas Instruments calculators are ridiculously expensive.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-29T06:10:47Z\u0022 title=\u002212/29/2013 06:10  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 29, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-12-29T12:31:04Z","Content":"\n\u003Cp\u003Ei just do graphing in lua\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-12-29T13:37:42Z","Content":"\n\u003Cp\u003EI don\u0027t see a need for graphic calculators anymore. Smartphones, tablets, they can all run applications capable of doing complex stuff in an elegant and user friendly way.\u003C/p\u003E\n"},{"CreatedByName":"miis","CreatedById":75357,"CreatedDateTime":"2013-12-29T14:10:03Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.wolframalpha.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.wolframalpha.com/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you want to use Khan Academy, then you may consider usin Wolfram Alpha instead of a physical calculator.\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-12-30T18:52:32Z","Content":"\n\u003Cp\u003ETI-84 Plus Silver Edition.\u003C/p\u003E\u003Cp\u003EShe\u0027s easy to program and compatible with the most applications.\u003C/p\u003E\u003Cp\u003EI program games using the Axe assembler on her. She\u0027s the successor to the TI-83 /TI-83\u002B/TI-83\u002BSE, one of the most popular lines of all time. But under no circumstances get the TI-84 C Silver Edition, which has a color screen, because supposedly it\u0027s horribly slow. Most math students use the TI-83\u002B as it is.\u003C/p\u003E\u003Cp\u003EI personally have a TI-83\u002B, TI-84\u002BSE, and TI-Nspire CX CAS, the CX CAS being the most advanced calculator on the market, being so advanced it is banned on the ACT. It can even have Wifi through an addon module.\u003C/p\u003E\n"},{"CreatedByName":"Maxwell Comp","CreatedById":85545,"CreatedDateTime":"2014-01-04T07:34:12Z","Content":"\n\u003Cp\u003EI second the App suggestion. The trustworthy Ti-83 is hugely overpriced. It\u0027s good for what it is, but I think the price has been constant for at least 10 years with no real changes.\u003C/p\u003E\n"}]}