{"TopicId":59809,"ForumId":44,"TopicTitle":"Asparagus Staging - Something that occurred to me.","CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-01-13T00:19:34Z","PageNum":1,"Articles":[{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-01-13T00:19:34Z","Content":"\n\u003Cp\u003ENow, I have a theory as to how to make asparagus type staging really worth it in real life. However, I would like to preface this theory with the disclaimer that I know very little about the inner workings of actual rockets. But, from what I do know, I know that the way KSP handles it is fairly unrealistic (mostly because the rocket parts are exaggerated and because the fuel pipes are just plain silly), and I also know that the reason it isn\u0027t done in real life is because it\u0027d be hard to pump the fuel around without spinning the rocket out of control. \u003C/p\u003E\u003Cp\u003ENow, with that being said, my idea was why not take the outer fuel tanks and integrate them into the core rocket, and have them break off \u0022seed\u0022 style. IE, they\u0027d pop off of the core tank like a seed (or whatever the hell those little white things are) popping off of a strawberry. And then, the way you would design it is so that fuel naturally flows into the center tank via a, for lack of a better description, vertical opening on the core rocket (that\u0027s exposed to the fuel of the booster)that is controlled by a door like mechanism to adjust fuel flow. Then, when time comes to separate that tank, you can seal off the core rocket door for that booster and then separate. If you compress the rocket enough, you could probably use the same mechanism between boosters.\u003C/p\u003E\u003Cp\u003EThis way, you\u0027re not pumping fuel, you\u0027re just letting it spill into the center tank as the fuel level drops. Presumably doing it this way would stop any issues with losing control over the rocket, while also providing better aerodynamics what with the rocket being essentially one solid, relatively smooth piece. \u003C/p\u003E\u003Cp\u003ENow the obvious problem to me is whether or not you\u0027ll end up igniting residual fuel when you separate your boosters. Not quite sure how to deal with that one.\u003C/p\u003E\u003Cp\u003EBut anyway, that was my mostly uneducated idea.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-01-13T03:46:11Z","Content":"\n\u003Cp\u003EFrom what I understand about physics and astronautics, your idea has a flaw: If the fuel is supposed to \u0022flow\u0022 from boosters into the central core, the g-force of the rocket itself would cause a few major issues. For one, the downward force would try to pin the fuel to the bottom of the booster itself, and, depending on where your fuel door is located, any fuel below that would be stuck and unable to move.\u003C/p\u003E\u003Cp\u003ESecondly, the fuel lines aren\u0027t as frivolent as one might initially assume. The US Shuttle\u0027s external tank used a total of five umbilical fuel lines (2 liquid oxygen, 3 hydrogen) to fuel the Shuttle\u0027s main engines. These lines were simply separated as the tank was, much like you can do in KSP.\u003C/p\u003E\u003Cp\u003EThirdly, your fuel door concept would have to be insanely strong, because if the door is located towards the bottom of the boosters\u0027 assemblies, the sheer amount of fuel, no doubt amplified by the g-forces, would all try to find a way to get out at any weak point (the doors). This will most likely cause structural failures at these door mechanisms fairly often.\u003C/p\u003E\u003Cp\u003EI like what you\u0027re saying! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E These are my opinions.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2014-01-13T04:08:14Z","Content":"\n\u003Cp\u003EThat is an interesting idea you have there, perhaps the fuel could be coerced over into the centre tank by increasing the pressure inside the booster tanks (perhaps even taking in air from outside and pressurizing it?). Your \u0027seed\u0027 idea is very nice; in fact the Soviets used something similar to your idea when designing the Soyuz rocket. In it, while there is no fuel transfer, the centre stage is actually twice the capacity of the booster tanks, so while all engines fire at launch, at booster separation the centre tank is half-empty and continues firing to place the third stage and capsule higher in the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-13T07:58:26Z","Content":"\n\u003Cp\u003Ei like to sometimes have a short core with a lot of mainsails but not very much fuel, and a bunch of larger drop tanks around the cluster. the droptanks drop of in the same manor as asparagus stages, but all the engines are kept until the booster is jettisoned. with better nozzel tech capable of operating at a wide range of atmospheric pressures, i dont see why we dont have more droptank based staging out there, would be a good candidate for a vtvl ssto design.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-01-13T08:51:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis way\u0027 date=\u0027 you\u0027re not pumping fuel, you\u0027re just letting it spill into the center tank as the fuel level drops.[/quote\u0027]\u003C/p\u003E\u003Cp\u003EI don\u0027t know much about rocket engines, but I do know they\u0027re thirsty beasts. I suspect there\u0027s a good reason why the fuel is pumped rather than gravity fed, even for engines that will always be firing under acceleration.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-01-13T09:14:35Z","Content":"\n\u003Cp\u003EYou might be thinking about something like this old McDonnel Douglas SSTO proposal from the 60s.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://sites.google.com/site/spaceodysseytwo/space60s/pegasus3.jpg\u0022 alt=\u0022pegasus3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://sites.google.com/site/spaceodysseytwo/space60s/ithacus1.jpg\u0022 alt=\u0022ithacus1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe problem with this is that there is a lot of added complexity, whereas modern composite tanks aren\u0027t really that heavy, so you don\u0027t gain much by dropping them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-13T09:18:47Z\u0022 title=\u002201/13/2014 09:18  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 13, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2014-01-13T12:11:20Z","Content":"\n\u003Cp\u003EThe best real world example of parallel stages with crossfeed was UR-700 (never built because they had to choose between it and N1).\u003C/p\u003E\u003Cp\u003ENote that railroads limit size of what can be delivered to Baikonur: the biggest single part is the size of oxidizer tank (the central part) of Proton 1st stage (pretty much equivalent of KSP orange tank). Also note that with UDMH/N2O4 mass and volume of fuel and oxidizer are similar.\u003C/p\u003E\u003Cp\u003E2nd stage of UR-700 is 3 stacks of 2 tanks (1 of UDMH and 1 of N2O4) and engine (equivalent of Mainsail, also they considered putting 4 engines of Proton first stage instead in case the new large ones won\u0027t be ready) each. \u003C/p\u003E\u003Cp\u003E1st stage is 6 stacks, each of them consists of: the same engine as the second stage, 1 tank of UDMH and 1 tank of N2O4 for this engine and one extra tank (3 stacks had UDMH, other had N2O4) for the second stage.\u003C/p\u003E\u003Cp\u003ESo basically during the first stage burn the second stage uses fuel from the first stage.\u003C/p\u003E\u003Cp\u003EUR-900 had 3 more stacks in first stage, but they didn\u0027t carry additional fuel for the second stage.\u003C/p\u003E\u003Cp\u003EBTW, these are pretty good designs for KSP. Just be careful with struts\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-01-13T14:14:19Z","Content":"\n\u003Cp\u003EIn KSP you move fuel from tank to tank, in Falcon heavy they will run engines directly from the external tanks, 3-4 engines from each side tank wile the 1 or 3 engines in center will use the internal tank. This will probably be solved by having two set of piping for side tanks, one goes to the engines and one goes to the center stage. \u003C/p\u003E\u003Cp\u003EValves for each set. \u003C/p\u003E\u003Cp\u003EIn the center stage you probably need two set of valves, an top one who select who tank to feed from and the bottom one to regulate flow into the pump. You probably also need an valve to prevent fuel to go from the center tank to the empty side tank, probably smart with an small drain to suck the pipe dry after stopping the flow from side tank. \u003C/p\u003E\u003Cp\u003EHere is how I guess seperation will go, some seconds before separation you change over to center tank fuel for outer engines while the side stages continues to burn, pipes are drained, outer booster shutdown and separates while center stage continues.\u003C/p\u003E\n"}]}