{"TopicId":61545,"ForumId":44,"TopicTitle":"So, I have hopes and dreams....","CreatedByName":"spudman2","CreatedById":84199,"CreatedDateTime":"2014-01-30T01:47:16Z","PageNum":1,"Articles":[{"CreatedByName":"spudman2","CreatedById":84199,"CreatedDateTime":"2014-01-30T01:47:16Z","Content":"\n\u003Cp\u003E... and am also a biology major with a hefty interest in spaceflight. (As is evidenced by my being here on these forums.)\u003C/p\u003E\u003Cp\u003EIs there any way you guys can think of that I could earn a seat on a scientific spaceflight of any kind? Are biologists needed on orbital missions? I mean, I could maybe be sent up to the ISS for some sort of research, but... I don\u0027t know. Thoughts?\u003C/p\u003E\n"},{"CreatedByName":"Top8","CreatedById":79933,"CreatedDateTime":"2014-01-30T01:56:53Z","Content":"\n\u003Cp\u003EI think you will have the best luck with commercial space flight in the coming years. Become an expert in something specific that they need on site. So maybe become an expert in life support systems - the closed loop biological kind. Space farming, that sort of thing.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-01-30T02:39:42Z","Content":"\n\u003Cp\u003EIf I were you(and if a had enough motivation) I would contact spaceflight organization(NASA, spacex, orbital science, roscosmos etc...) and ask which services you can provide to them.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-01-30T06:48:27Z","Content":"\n\u003Cp\u003EIf you are interested in space, you should orient your career into microgravity and partial gravity biology research. Partial gravity is something that we know practically nothing about. Cosmic radiation is another center of interest for space biology.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-01-30T11:51:37Z","Content":"\n\u003Cp\u003EAviation medicine is another obvious one, although that would be a bit of a change of discipline for you.\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-01-30T12:22:05Z","Content":"\n\u003Cp\u003EAnother idea, check Nasa, Esa and other space agencies\u0027 websites to see what experiments they do.\u003C/p\u003E\u003Cp\u003EYou could also check what is done in vomit comets. I know both USA and France (Europe? I\u0027m not sure who owns it) have one.\u003C/p\u003E\n"}]}