{"TopicId":64554,"ForumId":44,"TopicTitle":"House Committee Chairman Encourages NASA To Send Crew Flyby Mars in 2021","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-28T22:54:05Z","PageNum":4,"Articles":[{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-03-03T03:09:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EDefinitely chemical rockets, no time to develop one or get the public swayed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENERVA\u0027s already been tested and proven on the ground; It got shelved when the Mars mission proposal did after Apollo.\u003C/p\u003E\u003Cp\u003EVASMIR\u0027s gonna get tested on the ISS in 2016.\u003C/p\u003E\u003Cp\u003EWe\u0027ll have alternatives to chem rockets by the time 2021 rolls around.\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-03-03T03:22:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EHave they looked into the difficulty of keeping human beings sane under those conditions? I\u0027d think that would be a bigger problem than the life support and shielding and consumables problems. Human psychology doesn\u0027t hold up well to being stuck in a small box for 2 years with nowhere to go.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInflatable Habs could help that a bit; (some) more living space for your payload mass/volume.\u003C/p\u003E\u003Cp\u003EOtherwise keep em\u0027 busy. Have the crew members cross train eachother whilst in transit, and make most of the non-critical tasks doable manually(preferably in a short-sleeve environment. Include a big electronic \u0022library\u0022, spare computers for games/backups, and lightweight, magnetized pieces for nonelectronic games. Also include a wide variety of foodstocks, and high-quality air filters and scents to alleviate the inevitable stench.\u003C/p\u003E\u003Cp\u003EA stock of cockroaches (to eat skin cells and other organic debris, preventing them from rotting) may also be a good investment, although not for the entomophobic.\u003C/p\u003E\u003Cp\u003EIf you\u0027re going to use an algae farm, consider bring some fiber(or growing it with more algae) to add digestion and add something to chew. Also include lots of flavoring.\u003C/p\u003E\n"},{"CreatedByName":"Roastduck","CreatedById":98490,"CreatedDateTime":"2014-03-03T06:00:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meve12\u0022 data-cite=\u0022meve12\u0022\u003E\u003Cdiv\u003EInflatable Habs could help that a bit; (some) more living space for your payload mass/volume.\u003Cp\u003Espare computers for games\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eif those computers don\u0027t include KSP, I will RIOT.\u003C/p\u003E\n"},{"CreatedByName":"Piwa","CreatedById":82713,"CreatedDateTime":"2014-03-03T06:35:24Z","Content":"\n\u003Cp\u003EThose who really understand what I mean with 100% certainty that the person will not go to Mars earlier 2030-2040 period. It\u0027s just a duck...\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-03-03T06:48:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWhy? You still haven\u0027t given a single factor that\u0027d differ between a mars flyby and just keeping the same craft in a medium or high earth orbit, excepting of course the cost.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m still not quite sure what the point you\u0027re trying to make is. So you\u0027re suggesting that we launch all the hardware for a Mars mission into Earth orbit and test it there? Ok, fine that\u0027s a nice conservative approach. You\u0027d be able to do most of what you could do on a flyby, obviously you\u0027re not carrying out all the maneuvers you would be otherwise, and crew psychology would still be a big question mark.\u003C/p\u003E\u003Cp\u003EWould you then go straight from that to scaling up for a landing later, or are you suggesting they should do both the Earth orbit mission and the flyby later?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe human race would get nowhere if everyone was a defeatist and pessmist. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELook, this kind of name calling does you more harm than good. If you want to be taken seriously keep your arguments rational. Not everybody who disagrees with your personal vision for space exploration does so because of some kind of character flaw.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EHave they looked into the difficulty of keeping human beings sane under those conditions? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s one of the big unanswered questions of interplanetary flight. There have been some \u003Ca href=\u0022https://en.wikipedia.org/wiki/MARS-500\u0022 rel=\u0022external nofollow\u0022\u003Eexperiments\u003C/a\u003E done, results have been a bit mixed. It\u0027s a genuine issue. Prospective astronauts would have to be picked carefully.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-03-03T07:30:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EHave they looked into the difficulty of keeping human beings sane under those conditions? I\u0027d think that would be a bigger problem than the life support and shielding and consumables problems. Human psychology doesn\u0027t hold up well to being stuck in a small box for 2 years with nowhere to go.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere have been several studies on the subject, including shutting people inside a bunker for 500 days to see how they react. The key is to keep them busy. If all else fails, there is always medication... It\u0027s really not an unsolvable issue. \u003C/p\u003E\u003Cp\u003EThe biggest issue is definitely life support.\u003C/p\u003E\n"},{"CreatedByName":"1of6Billion","CreatedById":46191,"CreatedDateTime":"2014-03-03T12:35:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003ETHIS WOULD BE BAD. WHy not, if going to Mars, ACTUALLY GO TO MARS. Why beat around the bush and not land? There\u0027s no reason not to land on Mars if you\u0027re already there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t believe I read this on the KSP forum. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyone who has ever tried a landing and return mission to Duna knows it\u0027s far more complicated than a one way trip. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Horn Brain","CreatedById":49626,"CreatedDateTime":"2014-03-03T20:41:28Z","Content":"\n\u003Cp\u003EI think the flyby to Mars and Venus is a good opportunity to test interplanetary travel. We get a free-return, so we don\u0027t have to do much maneuvering, but we can still test the reliability of various components that would be needed to, say, do an orbital insertion. It would be like Apollo 10 : Apollo 11 :: Mars flyby free return : Mars orbital mission.\u003C/p\u003E\u003Cp\u003EBUT\u003C/p\u003E\u003Cp\u003EIt makes no sense to do this mission as a one-off publicity stunt. It has to be a part of a concerted effort to develop the ability to send humans to other worlds, eventually permanently. If this accelerates the SLS program and we get a EML2 space station out of it, then I would be for it, because it would be a part of a clear direction to establish a presence outside of LEO, learn how to live for long periods without an immediate escape opportunity constantly available, and develop hardware for living in space and getting back and forth from the surface of another world.\u003C/p\u003E\u003Cp\u003EMy notional plan given this opportunity:\u003C/p\u003E\u003Cp\u003E2017: Test of Orion and SLS. There is a push to make this manned, but I don\u0027t think it\u0027s necessary given the accelerated schedule.\u003C/p\u003E\u003Cp\u003E2018-2020: As many SLS flights as needed to establish and operate the EML2 station. Could be one or two if the wet workshop model is used (but I would like a module with windows -- That\u0027s important). Testing life support and other driving factors for the Mars flyby should be done early. Infrastructure for refueling and/or resource processing could also be a goal of testing.\u003C/p\u003E\u003Cp\u003E2021: Mars and Venus flyby. Ultimate proof that we can send humans beyond the Earth\u0027s domain and bring them back safely. Pictures of Mars and Venus through the windows get everyone really excited.\u003C/p\u003E\u003Cp\u003E2022 and beyond: Shift focus back to the Moon, developing landing technology and testing surface EVA tech: New suits, rovers, etc. We should establish a permanent base wherever is most convenient (I would argue for the poles because of illumination concerns as well as resource opportunities). This will also give us another data point on the effects of other-than-one-g gravity on humans in the long term. (If 1/6 g is enough or nearly enough, then 1/3 will be great!). If resource processing testing is done at EML2, another interesting possibility would be to do the Asteroid Redirect Mission and park the asteroid at EML2 with the station for continued access. We could use our pet asteroid to test NEA/Martian moon mission technology without leaving cislunar space.\u003C/p\u003E\u003Cp\u003EIt\u0027s important the the 2022\u002B lunar operations are \u003Cstrong\u003Ealways\u003C/strong\u003E clearly defined as a testbed for reaching further. We should put it in the name of the program. Designs should focus on using as much hardware that is compatible with a Mars mission as possible.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-03-03T21:33:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Horn Brain\u0022 data-cite=\u0022Horn Brain\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMy notional plan given this opportunity:\u003C/p\u003E\u003Cp\u003E2017: Test of Orion and SLS. There is a push to make this manned, but I don\u0027t think it\u0027s necessary given the accelerated schedule.\u003C/p\u003E\u003Cp\u003E2018-2020: As many SLS flights as needed to establish and operate the EML2 station. Could be one or two if the wet workshop model is used (but I would like a module with windows -- That\u0027s important). Testing life support and other driving factors for the Mars flyby should be done early. Infrastructure for refueling and/or resource processing could also be a goal of testing.\u003C/p\u003E\u003Cp\u003E2021: Mars and Venus flyby. Ultimate proof that we can send humans beyond the Earth\u0027s domain and bring them back safely. Pictures of Mars and Venus through the windows get everyone really excited.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo be ready in 2018 (or even 2021), they should already be cutting metal and building stuff. It takes years to design and build space hardware. But there is nothing to be seen. \u003C/p\u003E\u003Cp\u003EThere are no current plans for any SLS payloads other than Orion with a 21-day ECLSS, no habs or extended duration modules, no landers, no interplanetary stages, and no SLS launchers have been ordered other than for EM-1 in 2017 and EM-2 in 2021.\u003C/p\u003E\u003Cp\u003EReally guys, a manned two-week shakedown mission is all we can hope for in 2021. Any interplanetary stunts for 2021 are ruled out because nothing is being built for that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-03T21:35:54Z\u0022 title=\u002203/03/2014 09:35  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 3, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-03-03T21:43:59Z","Content":"\n\u003Cp\u003EThe Cygnus exists and has flown 2 or 3 times, and Orion will be ready for manned flight by 2021 if I\u0027m not mistaken. Shouldn\u0027t it be possible to design and test the modified Cygnus sufficiently in 7 years?\u003C/p\u003E\n"},{"CreatedByName":"Horn Brain","CreatedById":49626,"CreatedDateTime":"2014-03-03T22:07:23Z","Content":"\n\u003Cp\u003EThese things can indeed be done by 2018 (the beginning of the EML2 station, specifically). They just need to be funded and directed. That\u0027s what\u0027s exciting about Congress being interested in this. If they want to fund it, we can absolutely do the flyby. The SLS actually becomes rather economical if we fly it once or twice a year.\u003C/p\u003E\n"},{"CreatedByName":"mdatspace","CreatedById":83778,"CreatedDateTime":"2014-03-03T22:45:07Z","Content":"\n\u003Cp\u003EThere is no deep space habitat for Orion. Without that, Orion is a cis-lunar taxi cab.\u003C/p\u003E\u003Cp\u003EWhere is the funding for this mission?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-03T22:50:22Z\u0022 title=\u002203/03/2014 10:50  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 3, 2014\u003C/time\u003E by mdatspace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-03-03T22:58:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mdatspace\u0022 data-cite=\u0022mdatspace\u0022\u003E\u003Cdiv\u003EThere is no deep space habitat for Orion. Without that, Orion is a cis-lunar taxi cab.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere can be, literally, a bolt on fix for that. Send up an inflatable hab in a separate launch, and a better engine as a third, and assemble the craft in orbit.\u003C/p\u003E\n"},{"CreatedByName":"mdatspace","CreatedById":83778,"CreatedDateTime":"2014-03-03T23:01:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EThere can be, literally, a bolt on fix for that. Send up an inflatable hab in a separate launch, and a better engine as a third, and assemble the craft in orbit.\u003C/div\u003E\u003C/blockquote\u003EYou are right. But where is the funding for this mission? If this mission wants to go further than a proposal, there needs to be funding.\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-03-03T23:55:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meve12\u0022 data-cite=\u0022meve12\u0022\u003E\u003Cdiv\u003EInflatable Habs could help that a bit; (some) more living space for your payload mass/volume.\u003Cp\u003EOtherwise keep em\u0027 busy. Have the crew members cross train eachother whilst in transit, and make most of the non-critical tasks doable manually(preferably in a short-sleeve environment. Include a big electronic \u0022library\u0022, spare computers for games/backups, and lightweight, magnetized pieces for nonelectronic games. Also include a wide variety of foodstocks, and high-quality air filters and scents to alleviate the inevitable stench.\u003C/p\u003E\u003Cp\u003EA stock of cockroaches (to eat skin cells and other organic debris, preventing them from rotting) may also be a good investment, although not for the entomophobic.\u003C/p\u003E\u003Cp\u003EIf you\u0027re going to use an algae farm, consider bring some fiber(or growing it with more algae) to add digestion and add something to chew. Also include lots of flavoring.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESilk worms can be grown and eaten too, no? I love the idea of small simple solutions for issues like that.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-04T00:23:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ETo be ready in 2018 (or even 2021), they should already be cutting metal and building stuff. It takes years to design and build space hardware. But there is nothing to be seen. \u003Cp\u003EThere are no current plans for any SLS payloads other than Orion with a 21-day ECLSS, no habs or extended duration modules, no landers, no interplanetary stages, and no SLS launchers have been ordered other than for EM-1 in 2017 and EM-2 in 2021.\u003C/p\u003E\u003Cp\u003EReally guys, a manned two-week shakedown mission is all we can hope for in 2021. Any interplanetary stunts for 2021 are ruled out because nothing is being built for that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re already building the SLS for the 2017 launch.\u003C/p\u003E\u003Cp\u003EMetal is being cut and welded, and they\u0027re building the structure.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-03-04T02:52:44Z","Content":"\n\u003Cp\u003EWhile this sounds fascinating, it seems like a hopeless fantasy. Most I would hope for would be a lunar fly-by.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-03-04T03:00:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skyler4856\u0022 data-cite=\u0022Skyler4856\u0022\u003E\u003Cdiv\u003EWhile this sounds fascinating, it seems like a hopeless fantasy. Most I would hope for would be a lunar fly-by.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe can do a lunar flyby any time. I believe Orion is supposed to do a manned lunar flyby by 2018. It\u0027s what happens NEXT that is being discussed, and this 3 planet alignment doesnt happen every century.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-03-04T09:28:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EThere can be, literally, a bolt on fix for that. Send up an inflatable hab in a separate launch, and a better engine as a third, and assemble the craft in orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat bolt-on inflatable hab is currently sitting on a shelf, complete with power, thermal control, and an ECLSS capable of running reliably in a closed loop for 2 years? What bolt-on \u0022better engine\u0022 is sitting around waiting for a mission? What launcher is being built to launch those things before 2021?\u003C/p\u003E\u003Cp\u003EWe\u0027re not playing with Legos here. You don\u0027t just bolt stuff together and launch it. Space craft design and integration is a long and tedious process that requires extensive studies and simulations before you even start cutting any metal.\u003C/p\u003E\u003Cp\u003EWith current budgets, current flight manifests, and most of the engineering workforce tied up with SLS and Orion, none of that stuff can be developed, built, tested, and integrated in the 6 year period between now and 2021.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EThey\u0027re already building the SLS for the 2017 launch.\u003Cp\u003EMetal is being cut and welded, and they\u0027re building the structure.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlready? It\u0027s only in 3 years. That\u0027s actually a short time to finish building the launcher and to do all the testing and integration work. They\u0027re on track, but I wouldn\u0027t say \u0022already\u0022.\u003C/p\u003E\u003Cp\u003EHowever, you missed my point, which was that no mission payloads are being developed to put on top of SLS, other than Orion, which as mdatspace put it, is just a 21-day cislunar taxi that can\u0027t do much on its own.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EWe can do a lunar flyby any time. I believe Orion is supposed to do a manned lunar flyby by 2018.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMan, read the thread already... It\u0027s been stated a dozen times that the SLS manifest is EM-1 unmanned in 2017 and EM-2 manned in 2021. That\u0027s all there is for now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-04T09:32:24Z\u0022 title=\u002203/04/2014 09:32  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 4, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rocketscience101","CreatedById":12864,"CreatedDateTime":"2014-03-05T02:10:30Z","Content":"\n\u003Cp\u003EYou sorta have your facts wrong, the flyby would occur in 2021, the launch window is 2018. This really is the best time, every 3 years the sun goes through a phase of solar maximum and solar minimum. Maximum is when there are a large amount of solar flares that could potentially harm outgoing astronauts. This mission just in the middle of solar minimum, when the sun has a low output of radiation, and little to no solar flares. This won\u0027t happen again when a launch window and solar minimum will be in 2031. This is because mars and Earth become at a close approach every 2 1/2 years.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-03-05T05:10:28Z","Content":"\n\u003Cp\u003EThis is an interesting read. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://physicsworld.com/cws/article/news/2008/nov/06/magnetic-shield-could-protect-spacecraft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://physicsworld.com/cws/article/news/2008/nov/06/magnetic-shield-could-protect-spacecraft. \u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut if were going to send people out there the craft is going to need a panic room regardless of the suns cycle. How predictable is the Sun?\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2014-03-05T13:00:16Z","Content":"\n\u003Cp\u003EI think we do need a delay because it would have been ~50 years since we last did a Moon mission by 2021. We may need a bit of practice and some Moon flyby missions dropping off equipment for a Moon base (automated or not) would be the perfect way to test candidates for a much-longer Mars mission.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-15T11:16:47Z","Content":"\n\u003Cp\u003EThis simply HAS TO happen...\u003C/p\u003E\u003Cp\u003ELet\u0027s see, the facts:\u003C/p\u003E\u003Cp\u003E- This set of planetary alignments happens less than once every 100 years\u003C/p\u003E\u003Cp\u003E- The sun will be in the middle of a solar minimum (once every 3 years)\u003C/p\u003E\u003Cp\u003E- The sun is starting to go a potentially long-term (decades or centuries) increase in the amount of cosmic (extrasolar) radiation it allows to penetrate this close to it- which will SIGNIFICANTLY increase radiation exposure during interplanetary missions further off than 2021. This change could possibly be permanent, according to some scientists...\u003C/p\u003E\u003Cp\u003ESo, we won\u0027t see another opportunity like this for at least a couple centuries- possibly longer if the solar minimum doesn\u0027t line up next time- and there might be higher levels of radiation to contend with when we do...\u003C/p\u003E\u003Cp\u003EIt sounds like now is the best chance we\u0027re going to get to launch a mission like this, pretty much EVER.\u003C/p\u003E\u003Cp\u003EThe scientific benefits maybe be... questionable. But the space race it could set off- that would be immensely useful to the future of space exploration. We probably wouldn\u0027t have *ever* left LEO if not for the Space Race (politicians would have been forever calling it too risky and expensive) IMHO...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-05-15T13:04:15Z","Content":"\n\u003Cp\u003EI agree Northstar it\u0027s a he\u0027ll of an opportunity. But... Can we get a space craft assembled by then? Correct me on this, but the alignment is in 2021. It\u0027s a two year journey so does that mean the launch window is in 2019? \u003C/p\u003E\u003Cp\u003EI don\u0027t know if five years... Or even seven years is enough time to assemble a reliable craft to do the job. Because I tell ya right now if we throw together some sketchy space machine and something goes wrong.. it\u0027s curtains for the future of space exploration for a good while. \u003C/p\u003E\u003Cp\u003EThat being said.. it\u0027s not worth it imo. I understand the rarity of the alignment, but.. so what? Future Mars missions won\u0027t rely on Venus being in the right place so I say let\u0027s take our time and do it right.\u003C/p\u003E\n"},{"CreatedByName":"Bacterius","CreatedById":69384,"CreatedDateTime":"2014-05-15T13:34:22Z","Content":"\n\u003Cp\u003EIf they do then they will \u003Cem\u003Eneed\u003C/em\u003E a live feed during the flyby. Or at least an HD recording \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}