{"TopicId":64554,"ForumId":44,"TopicTitle":"House Committee Chairman Encourages NASA To Send Crew Flyby Mars in 2021","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-28T22:54:05Z","PageNum":5,"Articles":[{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-05-15T14:21:51Z","Content":"\n\u003Cp\u003EYou wouldn\u0027t see much, because a flyby would fly over the dark side of the planet. You\u0027d see a sunset, 30 minutes of darkness, a sunrise, and you\u0027d be on your way for another 10 months of travel... Not much point.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-05-15T14:33:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EYou wouldn\u0027t see much, because a flyby would fly over the dark side of the planet. You\u0027d see a sunset, 30 minutes of darkness, a sunrise, and you\u0027d be on your way for another 10 months of travel... Not much point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou would still see Mars, and that is what matters.\u003C/p\u003E\u003Cp\u003EAnd Venus too.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-05-15T15:18:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EYou would still see Mars, and that is what matters.\u003Cp\u003EAnd Venus too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t remember \u0027getting one guy to be able to look at Mars out of a window for a few minutes\u0027 being added to the NASA act.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-05-15T15:55:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EI don\u0027t remember \u0027getting one guy to be able to look at Mars out of a window for a few minutes\u0027 being added to the NASA act.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a reason this was proposed at a hearing and not being worked on since 2010.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-05-15T16:37:13Z","Content":"\n\u003Cp\u003EThe US cannot or should not do this, they would go into economic collapse with their massive military, space and other stuffs budgets. Not to mention $19 trillion debt.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-15T16:45:11Z","Content":"\n\u003Cp\u003EIt\u0027d be cool to keep US politics out of this thread, somehow :/\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-05-15T16:52:19Z","Content":"\n\u003Cp\u003EWell thats rather hard if look at the thread title.\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2014-05-15T17:04:37Z","Content":"\n\u003Cp\u003EI sort of find it amazing knowing that i will be alive (hopefully) to see people explore the gas giants, if not the inner solar system\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-16T00:37:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EI agree Northstar it\u0027s a he\u0027ll of an opportunity. But... Can we get a space craft assembled by then? Correct me on this, but the alignment is in 2021. It\u0027s a two year journey so does that mean the launch window is in 2019? \u003Cp\u003EI don\u0027t know if five years... Or even seven years is enough time to assemble a reliable craft to do the job. Because I tell ya right now if we throw together some sketchy space machine and something goes wrong.. it\u0027s curtains for the future of space exploration for a good while. \u003C/p\u003E\u003Cp\u003EThat being said.. it\u0027s not worth it imo. I understand the rarity of the alignment, but.. so what? Future Mars missions won\u0027t rely on Venus being in the right place so I say let\u0027s take our time and do it right.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe can do it intelligently and reliably if we start NOW- it\u0027s just going to take some serious funding...\u003C/p\u003E\u003Cp\u003EHonestly, the best thing would be for NASA to cooperate \u003Cstrong\u003EHEAVILY\u003C/strong\u003E for financial and technological/engineering support with the ESA on this, and portray it to the public/politicians as a triumph of Western innovative spirit and intellectual freedom over the oppressive forces of Communism (China) or corrupt \u0022democracies\u0022 really run by totalitarian leaders (Russia).\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-16T00:41:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xenomorph555\u0022 data-cite=\u0022xenomorph555\u0022\u003E\u003Cdiv\u003EThe US cannot or should not do this, they would go into economic collapse with their massive military, space and other stuffs budgets. Not to mention $19 trillion debt.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, the United States\u0027 national debt is \u003Cstrong\u003EMUCH\u003C/strong\u003E smaller compared to its GDP and population in comparison to, say, Italy or France. And a lot of space program funding actually ends up feeding back into the economy- as the profit margins and salaries are very high in the defense and space sectors (which also creates room to cut out a lot of fat if politicians can make up their mind to try and bring down costs...)\u003C/p\u003E\u003Cp\u003EAnd who do you think owns most of that debt? It\u0027s the Chinese, actually- which comes \u003Cstrong\u003Eseriously\u003C/strong\u003E in handy for preventing future wars and encouraging good relations between the US and China (China knows if they ever ended up at war with us, they would never see a cent of that money...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T00:43:42Z\u0022 title=\u002205/16/2014 12:43  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-05-16T06:08:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022montyben101\u0022 data-cite=\u0022montyben101\u0022\u003E\u003Cdiv\u003EI sort of find it amazing knowing that i will be alive (hopefully) to see people explore the gas giants, if not the inner solar system\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wonder what makes you so optimistic?\u003C/p\u003E\u003Cp\u003EIf you\u0027re lucky, you might get to see a manned Mars mission (although there are some 90 year old NASA retirees who have been waiting all their life to see it), but I doubt that a manned expedition to Saturn or Jupiter will happen in any of our lifetimes.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-05-16T06:13:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHonestly, the best thing would be for NASA to cooperate \u003Cstrong\u003EHEAVILY\u003C/strong\u003E for financial and technological/engineering support with the ESA on this, and portray it to the public/politicians as a triumph of Western innovative spirit and intellectual freedom over the oppressive forces of Communism (China) or corrupt \u0022democracies\u0022 really run by totalitarian leaders (Russia).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wonder what puts you or your country on a moral high ground compared to different and much older cultures.\u003C/p\u003E\u003Cp\u003EThe important thing isn\u0027t who accomplishes something. It\u0027s what Humanity accomplishes. Those countries are just as representative of Humanity as yours.\u003C/p\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2014-05-16T06:52:44Z","Content":"\n\u003Cp\u003EAm I the only one thinking that this is too big of a step? It\u0027s been what? almost 50 years since we sent man to the moon, the most we did since then is have a few orbital stations.\u003C/p\u003E\u003Cp\u003EIf anything they should be working on improving the reliability of anything that would send a man to mars. And no what we have now doesn\u0027t have a good enough safety record to attempt it.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-16T08:12:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EI wonder what puts you or your country on a moral high ground compared to different and much older cultures.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a matter of different government types, and different ideologies. Older doesn\u0027t mean better, and there is no question that the Communist Chinese government is oppressive, totalitarian, and antithetical to freedom and democracy around the world. In fact, half the reason China is doing as well as it is is not because of their government (which is actually newer than the US government- the current Chinese government has its roots in the 1940\u0027s), but because of their long history, large territory, and huge population- all of which stem from history *BEFORE* the current government took power.\u003C/p\u003E\u003Cp\u003EIt makes perfect sense to frame this as a battle of ideologies in order to touch off another space race and win popular support for further human progress in space exploration...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThe important thing isn\u0027t who accomplishes something. It\u0027s what Humanity accomplishes. Those countries are just as representative of Humanity as yours.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s true that the ultimate measurement of success is what humanity accomplishes- but competition in the form of a space race is one of the best ways to encourage further progress and accomplishment for all parties.\u003C/p\u003E\u003Cp\u003EAnd one other measure of the success of humanity is the triumph of freedom and democracy vs. oppression and totalitarianism. Trust me, I\u0027m just as concerned about the increasingly anti-democratic tendencies of American politics as I am about the totalitarian Communist regime of China. If China is moving towards a Big Brother style dystopia, America seems to be moving towards a cyberpunk Corpocracy dystopia, where the rich control everything (and are above the law) and the poor have no say in how their own government is run...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-16T08:19:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brethern\u0022 data-cite=\u0022Brethern\u0022\u003E\u003Cdiv\u003EAm I the only one thinking that this is too big of a step? It\u0027s been what? almost 50 years since we sent man to the moon, the most we did since then is have a few orbital stations.\u003Cp\u003EIf anything they should be working on improving the reliability of anything that would send a man to mars. And no what we have now doesn\u0027t have a good enough safety record to attempt it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENASA\u0027s problem is precisely that it is *too cautious* now. \u003Cstrong\u003EExploration has been, and always will be, dangerous.\u003C/strong\u003E People need to accept that, and not make too big a deal of it if a few astronauts are lost in the process (thousands more people die every day in Africa, after all). The risks they undergo for the greater good is precisely what makes astronauts heroes worth looking up to.\u003C/p\u003E\u003Cp\u003EOf the Nina, the Pinta, and the Santa Maria, for instance, only two made it back to Europe... (I bet you didn\u0027t know THAT) As a wise man once said, \u0022You can\u0027t discover new continents without losing sight of the shore\u0022.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-16T08:23:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EIf you\u0027re lucky, you might get to see a manned Mars mission (although there are some 90 year old NASA retirees who have been waiting all their life to see it).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. \u003Cstrong\u003EAnd I want to ACTUALLY SEE THAT MISSION (and I bet those retirees do too).\u003C/strong\u003E So that\u0027s why we need to take this first bold step, and \u0022bravely go where no man has gone before\u0022.\u003C/p\u003E\u003Cp\u003EPlanetary Sciences are never going to inspire children to enter into careers in math and science (and, at least in the US, not nearly enough young people do that anymore). Manned missions are.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003EP.S. The current NASA space program has become the laughing-stock of the world, even here in America. For instance, the popular television show \u0022The Big Bang Theory\u0022 openly mocks the space program with their treatment of one of the main characters going to the ISS, and at another time the characters stealing a spare camera for the Mars Rover to film their friend, like extra-planetary rovers are just some joke to use the spare parts from to pull practical jokes and spy on people...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T08:27:08Z\u0022 title=\u002205/16/2014 08:27  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-05-16T11:10:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EI wonder what makes you so optimistic?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wonder what makes you so pessmistic.\u003C/p\u003E\u003Cp\u003EThe conditions are right for a new burst in space exploration, this time instead of the Moon, we go interplanetary. More and more billionaires are investing themselves into the space industry, the government is proposing new technologies such as asteroid mining and solar farms (Despite the fact some are not practical, any space infrastructure is good space infrastructure so if they really want to do it, I support them 100%), and the Chinese and Iranians (Both arch enemies of one of the greatest spacefaring powers of the world) are gearing up their own space programs. Perhaps you may call these ideals unreasonable and propose cheaper and less exciting \u0022logical\u0022 alternatives.\u003C/p\u003E\u003Cp\u003EWe stopped exploring space with humans due to the big boondoggle known as the space shuttle and the lack of competition and a hostile Congress. As you can see, Congress is once again warming up to the idea of space exploration, the Chinese are prodding us in the back, and we\u0027ve handed LEO to private companies to invest in spacecraft that can launch lunar sorties, to Lagrange point stations, and Mars missions (Multiple launches). Space exploration will see a rate of progress in this century not unlike the space race.\u003C/p\u003E\u003Cp\u003EBut humans are not all completely forms of logic, and we, especially the leadership, likes to show the other side who\u0027s nether region is bigger.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T11:59:55Z\u0022 title=\u002205/16/2014 11:59  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-16T11:44:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWe stopped exploring space due to the big boondoggle known as the space shuttle\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEr, no we didn\u0027t. Not even a little bit. If anything the pace has accelerated as our capabilities have increased. We don\u0027t need to send humans to explore the solar system, we\u0027re doing a grand job without them.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-05-16T12:00:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EEr, no we didn\u0027t. Not even a little bit. If anything the pace has accelerated as our capabilities have increased. We don\u0027t need to send humans to explore the solar system, we\u0027re doing a grand job without them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpace exploration isn\u0027t just science.\u003C/p\u003E\u003Cp\u003EIt\u0027s about building a sustainable interplanetary civilization for not only us, but our children and their kin.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-16T12:06:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003ESpace exploration isn\u0027t just science.\u003Cp\u003EIt\u0027s about building a sustainable interplanetary civilization for not only us, but our children and their kin.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s colonisation, which isn\u0027t on the cards. Exploration is about acquiring new knowledge, sounds a bit sciency to me.\u003C/p\u003E\u003Cp\u003EScience output is the goal of exploration missions, it\u0027s how their performance is measured. You personally may have different goals and expectations, but if they\u0027re not aligned with those running the space programmes you\u0027re probably just setting yourself up for disappointment.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T12:08:56Z\u0022 title=\u002205/16/2014 12:08  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by Seret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-05-16T12:25:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EThat\u0027s colonisation, which isn\u0027t on the cards. Exploration is about acquiring new knowledge, sounds a bit sciency to me.\u003Cp\u003EScience output is the goal of exploration missions, it\u0027s how their performance is measured. You personally may have different goals and expectations, but if they\u0027re not aligned with those running the space programmes you\u0027re probably just setting yourself up for disappointment.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEvery manned mission is a precursor to a research base.\u003C/p\u003E\u003Cp\u003EEvery research base is the first step to colonization.\u003C/p\u003E\u003Cp\u003EMany of those in Congress want NASA to establish a base on Mars. The Constellation Program called for it, and so did the NASA Authorization Act of 2013. NASA\u0027s Mars Reference Mission 5.0 is still in effect as of 2013, and that too calls for a future Mars research outpost. Bigelow and NASA are both looking at a probable lunar outpost. I can assure you that a research base is well on the cards, and a research bases are colonies if you stretch it.\u003C/p\u003E\u003Cp\u003ERobotic exploration now should be focused on the Outer Planets and finishing up a Mars Sample Return, and humans should be sent to fill the gaps in between. Robotic exploration doesn\u0027t excite the imaginations of the public. It doesn\u0027t give a nation a factor of national pride. That\u0027s why Congress is hesitant to fund it.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-05-16T12:52:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EEvery research base is the first step to colonization.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI highly doubt that this is the case. We have research bases in Antarctica Continent, but there is no effort to build any colony there whatsoever, as far as I knew. Living conditions both on the Moon and Mars are significantly worse than that, so I find the concept of having manned research bases there very unlikely.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T12:55:03Z\u0022 title=\u002205/16/2014 12:55  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by shynung\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-05-16T12:53:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EEvery manned mission is a precursor to a research base.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Hence the US having had a moonbase since the late 70\u0027s. Oh, wait.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-05-16T12:55:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EHence the US having had a moonbase since the late 70\u0027s. Oh, wait.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHence, the Soviets dropping out of the space race and us investing into a big boondoggle.\u003C/p\u003E\u003Cp\u003EOh, wait.\u003C/p\u003E\u003Cp\u003E@Shyung.\u003C/p\u003E\u003Cp\u003ENo one cares about Antartica! It\u0027s a piece of ice!\u003C/p\u003E\u003Cp\u003EThat doesn\u0027t excite the public mind at all\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T14:20:26Z\u0022 title=\u002205/16/2014 02:20  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-05-16T12:59:14Z","Content":"\n\u003Cp\u003EI think that a mission to Mars should be saved for a landing. Something that there\u0027s a point to do. With a flyby you just take some pictures and go back, and you\u0027d be cooped up in a cabin for 20 months.\u003C/p\u003E\n"}]}