{"TopicId":69183,"ForumId":44,"TopicTitle":"What SCIENCE is there to be done on the surface of the moon?","CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-04-13T00:34:27Z","PageNum":1,"Articles":[{"CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-04-13T00:34:27Z","Content":"\n\u003Cp\u003EIn a lot of discussions or proposals about returning humans to the moon or building a moon base, I fail to see people talk about what exact scientific work can be done while on the surface but can\u0027t be done elsewhere. This compares to the exploration of Mars, where the scientific objectives are frequently talked about (ie following the water, climbing stratified mountains, etc). In addition, many achievements that have been done on the moon, like sample return, haven\u0027t been done on Mars yet. \u003C/p\u003E\u003Cp\u003EIMO, the moon and mars really are apples to oranges, so it\u0027s really not much of a \u0022proving ground\u0022 for Mars missions. I just hear that argument a lot and I don\u0027t think it really justify the costs of a moon base versus an artificial gravity station in cis-lunar space. \u003C/p\u003E\u003Cp\u003EI would like to know what big questions about the moon demand investigating on the surface, regardless if it\u0027s manned or unmanned, and which ones require the former.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-04-13T00:45:40Z","Content":"\n\u003Cp\u003EThere is still a lot of exploration to do on the moon as well as industrial things such as metals, solar and construction of larger ships in orbit with said materials (like your artgrav station however we should be honest it would to be MASSIVE to work) it is also easier to launch stuff from the moon. Also before we send men and women off on incredible journeys to new worlds we should see if we can do it on our closest neighbour. New discoveries about the moon are made every few years, there is no \u0022all science is complete\u0022.\u003C/p\u003E\n"},{"CreatedByName":"mdatspace","CreatedById":83778,"CreatedDateTime":"2014-04-13T00:49:51Z","Content":"\n\u003Cp\u003EThe \u0022proving ground\u0022 reason for manned lunar exploration and colonization does not really hold merit. Radiation can be researched out of earths magnetosphere and Gravity can be researched in LEO. Life support can be tested in LEO.\u003C/p\u003E\u003Cp\u003EThe government is focused on mars and the political reality of today is not conducive to a moon return. Commercial companies, however, with explore the moon. Bigelow is thinking about it. If I am correct, Elon said that it could be used to test technology in an (NBC?) interview. Still, not the most cost effective proving ground.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xenomorph555\u0022 data-cite=\u0022xenomorph555\u0022\u003E\u003Cdiv\u003EThere is still a lot of exploration to do on the moon as well as industrial things such as metals, solar and construction of larger ships in orbit with said materials (like your artgrav station however we should be honest it would to be MASSIVE to work) it is also easier to launch stuff from the moon. Also before we send men and women off on incredible journeys to new worlds we should see if we can do it on our closest neighbour. New discoveries about the moon are made every few years, there is no \u0022all science is complete\u0022.\u003C/div\u003E\u003C/blockquote\u003E There is still science to be done.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-13T00:55:46Z\u0022 title=\u002204/13/2014 12:55  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 13, 2014\u003C/time\u003E by mdatspace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-04-13T03:05:05Z","Content":"\n\u003Cp\u003EThe main thing would be geological survey work. \u003C/p\u003E\u003Cp\u003EAt some point we may very well need to mine the moon for rare earth minerals. You don\u0027t build an oil rig until you know where to drill. First you do extensive surveying to figure out where the best deposits are, and some sort of base with long-range rovers would be well suited to this task. \u003C/p\u003E\u003Cp\u003EMining and extraction techniques may well be critical to a Mars mission, so it\u0027d be better to practice them on the Moon where the lives of your astronauts don\u0027t depend on it.\u003C/p\u003E\n"},{"CreatedByName":"deadshot462","CreatedById":13659,"CreatedDateTime":"2014-04-13T03:37:46Z","Content":"\n\u003Cp\u003EBase construction, rocket building, fuel processing. Learning how to use the local resources would be a big step. That kind of manufacturing could be used on Mars.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-04-13T05:36:12Z","Content":"\n\u003Cp\u003EApollo missions did not survey that much of the Moon. It\u0027s like you landed in the middle of Texas, England and Sahara, walked around for couple of hours, and then claimed you\u0027ve surveyed all of the Earth.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-04-13T05:37:36Z","Content":"\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Helium-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Helium-3\u003C/a\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2014-04-13T06:56:27Z","Content":"\n\u003Cp\u003EI think we should run experiments that attempt to grow plants on the moon under pressurized domes with water brought from earth.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-13T07:34:10Z","Content":"\n\u003Cp\u003EI was rewatching that documentary the NASA missions yesterday and watching some of scott manly\u0027s (spelling?) videos after playing doing some 3 different mun landings in kerbal spaceprogram. Got me thinking exactly about this... Should we go back to the moon... \u003C/p\u003E\u003Cp\u003EI actually think the answer is yes... Not with 10 (?) or so originally planned apollo lunar landings, but fewer and somewhat more long stays at interesting places. \u003C/p\u003E\u003Cp\u003EI imagined 2-3 landings with week to months long stays. Meaning we are able to resupply the landings from earth, if necessary. \u003C/p\u003E\u003Cp\u003EThe hardware we put down on the moon, should be made in such a way that it guarantees a relatively long lifetime, in the case we find it necessary to go back. They can be used as those polar, antarctic shelters the first explorers built, that the next expedition used. \u003C/p\u003E\u003Cp\u003EThe point of these landings would be moon research at those interesting places, gather experience with establishing bases on the surface of another stellar body that is not zero G, gather experience with in-situ ressource utilisation, space food farming and whatever we can think of, that we need experience with.\u003C/p\u003E\u003Cp\u003EExperience that will be needed should we ever wish to establish permanent presense on the moon or go to mars. \u003C/p\u003E\u003Cp\u003EA sort of gemini precursor of a mars programme, but this time designed in a way that we can, potentially get use of the hardware used in years to come.\u003C/p\u003E\u003Cp\u003EPersonally though, I find the asteroid capture thing equally interesting and it should be done too, to the point of maybe cutting some lunar expeditions, but I think atleast one will still be needed. Which could then have additional crews staying for longer.\u003C/p\u003E\u003Cp\u003EEDIT and PS: \u003C/p\u003E\u003Cp\u003EYes... I know that the moon and mars are quite different, but the fact of the matter is that we have zero practical experience in constructing a surface base, protect it against cosmic radiation, grow enough food on the surface or make ressources available from the processing of local materials. \u003C/p\u003E\u003Cp\u003EI think the basic principles of this should be explored before we launch people on multi year missions to mars, where it\u0027s insanely expensive to emergency resupply, if it is at all.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-13T07:40:29Z\u0022 title=\u002204/13/2014 07:40  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 13, 2014\u003C/time\u003E by 78stonewobble\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2014-04-13T07:59:20Z","Content":"\n\u003Cp\u003EI believe the moon could be used as a place to build larger telescopes and deep space surveillance equipment. No atmosphere, easy construction due to low gravity and plenty of cheap real estate. (Builders might have a bit of a long commute.)\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-04-13T10:52:08Z","Content":"\n\u003Cp\u003EIt would be better to practise living on other worlds on the moon, if something goes wrong they are not too far away unlike mars.\u003C/p\u003E\n"},{"CreatedByName":"Nao","CreatedById":23462,"CreatedDateTime":"2014-04-13T14:37:10Z","Content":"\n\u003Cp\u003EI share the OP\u0027s concern, and right now i see no economical point in returning to the moon.\u003C/p\u003E\u003Cp\u003EIt\u0027s atmosphereless, so it can\u0027t really be used as test ground for mars mission since there is a lot of different engineering challenges on Mars that just don\u0027t occur on the Moon and vice versa. \u003C/p\u003E\u003Cp\u003ETesting growing plants and other low gravity stuff could be tested with centrifuges in low earth orbit.\u003C/p\u003E\u003Cp\u003EAlso the cost is an issue, gathering experience is good, but at some point, it is just cheaper to do the homework well enough to be sure it works in the filed at first try. (For example the B2 bomber program, the plane was so expensive that it had no prototypes, or \u0022test\u0022 aircrafts, the first one off the assembly line went right into service).\u003C/p\u003E\u003Cp\u003EThe telescopes/deeps space surveillance is an interesting point, as it could shield the sensitive equipment from noisy earth. And there are a bunch of smaller research projects that could be performed at the Moon bases, but the problem is that these project\u0027s couldn\u0027t self sustain Moon base economically.\u003C/p\u003E\u003Cp\u003EAs for mining, most of the stuff can be mined from asteroids at a cheaper cost, since not only we have more experience with space constructions but it is just plainly closer and more accessible.\u003C/p\u003E\u003Cp\u003ESo maybe the first big thing that will kickstart Moon Bases will be be... tourism! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E (or Helium3 if we suddenly start needing it in large quantities)\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-13T16:45:06Z","Content":"\n\u003Cp\u003EThe B2 also had quite a few problems in the beginning of it\u0027s service, if I remember correctly.\u003C/p\u003E\n"},{"CreatedByName":"WindShieIds","CreatedById":105967,"CreatedDateTime":"2014-04-13T16:53:16Z","Content":"\n\u003Cp\u003EBlow a soap bubble on the moon, see what happens.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-04-13T16:56:24Z","Content":"\n\u003Cp\u003EAsking if there is science left to be done on the Moon is like asking if there is science left to be done in the ocean or in the South Pole, yet McMurdo has been operating for decades and we are still building oceanographic survey ships.\u003C/p\u003E\u003Cp\u003EThere is a lot of science that needs to be done before we can go to Mars. A lot of the tech for going to Mars is at TRL 3 or 4 at best. It needs to be at 8 or 9 for humans to rely on it for multi-year missions to other planets.\u003C/p\u003E\u003Cp\u003EFor example, we don\u0027t know anything about long duration survival on the surface of another planet, construction techniques, radiation mitigation, dust mitigation, closed loop life support, partial gravity, ISRU, and so on.\u003C/p\u003E\u003Cp\u003EApollo could never have worked without Gemini, and a mission to Mars is really too big of a leap with current technology.\u003C/p\u003E\u003Cp\u003EWe could test some of these techniques in a BEO station, but building a second ISS at EML-1 with a large-centrifuge and greenhouses id going to cost more than building it on the Moon with ISRU techniques that we are going to have to learn anyway.\u003C/p\u003E\n"},{"CreatedByName":"Nao","CreatedById":23462,"CreatedDateTime":"2014-04-13T23:13:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EThe B2 also had quite a few problems in the beginning of it\u0027s service, if I remember correctly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha true that. But the first built fuselage was designed with confidence that there won\u0027t be any big problems that would need some major redesign, and will be used by the military after solving problems with subsystems. And (to my knowleage) it was a first time to build completely new type of craft without prototyping it\u0027s design. (As a engineer i find it extraordinary) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ERight now we have even better abilities to simulate and predict how the given design will work, (we got better programs, more computing power, deeper understanding of physics and generally more experience with modern prediction/simulation techniques than the guys creating the B2) So i\u0027m hopeful it\u0027s possible that for mars mission we are just above the cost threshold for simulation (or approximation from limited tests) to be cheaper than full filed testing (like making a moon base to see if astronauts can build/live on other planets).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-13T23:16:49Z\u0022 title=\u002204/13/2014 11:16  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 13, 2014\u003C/time\u003E by Nao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-04-13T23:20:54Z","Content":"\n\u003Cp\u003EWe still know very little about the dynamics of natural moon development, and the interiors of said bodies.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-14T00:23:29Z","Content":"\n\u003Cp\u003EMuch of Luna, like the Oceans of Earth, have not been explored.\u003C/p\u003E\u003Cp\u003ESo, who knows, maybe a new organic compound could be discovered (Organic compounds have been discovered on comets/asteroids).\u003C/p\u003E\u003Cp\u003EOr anything.\u003C/p\u003E\u003Cp\u003EHeck, there are possibly MILLIONS of species on Earth ALONE that we haven\u0027t discovered.\u003C/p\u003E\u003Cp\u003EDid you know, an entire patch of forest wasn\u0027t discovered till recently (early 2000s, even though satellites get \u0022complete\u0022 coverage).\u003C/p\u003E\u003Cp\u003EI say we go to get experience with long-term stays on the surfaces of other bodies (like Mars).\u003C/p\u003E\u003Cp\u003EBut, before we go on a full on expedition to Luna, we should at least do some more exploring here, even for a little bit of time.\u003C/p\u003E\n"},{"CreatedByName":"TerLoki","CreatedById":30301,"CreatedDateTime":"2014-04-14T00:31:34Z","Content":"\n\u003Cp\u003EPretty sure the Apollo guys forgot to bring mystery goo along, we should get on that.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-04-14T02:24:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TerLoki\u0022 data-cite=\u0022TerLoki\u0022\u003E\u003Cdiv\u003EPretty sure the Apollo guys forgot to bring mystery goo along, we should get on that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd Aperture Science is waiting for a shipment of white goo.\u003C/p\u003E\n"},{"CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-04-14T03:35:04Z","Content":"\n\u003Cp\u003EI don\u0027t want to be rude to anyone, but my question hasn\u0027t been convincingly answered. Let\u0027s say I\u0027m congress, you\u0027re NASA, and I\u0027m reviewing your budget to reduce costs/risks. I need to know WHY we have to go to the moon to do XYZ stuff. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOthers have pointed out that things like long duration stays, radiation exposure testing, or artificial gravity environments can be done in LEO or EML2. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.marssociety.org/home/about/faq\u0022 rel=\u0022external nofollow\u0022\u003EMars society explain the apples to oranges-ness between the Moon and Mars.\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EA: While valuable in its own right, human Lunar exploration will teach us very little about how to survive on Mars. The two are drastically different environments:\u003Cp\u003EThe Moon has no atmosphere, which means that testing methods of generating rocket fuel from the atmosphere cannot be tested at all.\u003C/p\u003E\u003Cp\u003ETemperatures on the two bodies are wildly different: Mars ranges from roughly -90C (-130F) to \u002B10C (50F), while the Moon, during its 672-hour day, averages \u002B100C (212F).\u003C/p\u003E\u003Cp\u003EMars has a 24.65-hour day, very similar to Earth; the Moon has a 672-hour day.\u003C/p\u003E\u003Cp\u003EWater exists in abundance on Mars -- as ice seen at the poles by the Mars Odyssey orbiter and frozen into the Martian soil. While water may exist on the Moon, it is nowhere near as available there, and would require considerably more effort to obtain.\u003C/p\u003E\u003Cp\u003EMars\u0027 gravity is roughly 1/3 of Earth\u0027s; the Moon\u0027s is roughly 1/6 of Earth\u0027s.\u003C/p\u003E\u003Cp\u003EIndeed, comparing the two environments, it might actually be said that we need to go to Mars to prepare for the considerably more harsh environment of the Moon!\u003C/p\u003E\u003Cp\u003EIt is useful to practice for Mars before we go, but this can be done in the Arctic at 1/1000th the cost of a Lunar training facility.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA polar moon base could be a good place to practice for missions to icy vacuum bodies like Ceres and Callisto, but that probably would happen AFTER a manned mars mission. I\u0027m thinking of the 2040s/2050s or so.\u003C/p\u003E\u003Cp\u003EA lot of people mention Helium-3, but I\u0027ve become a bit skeptical of it recently. For one, it\u0027s a 2nd generation fusion fuel, and we haven\u0027t even achieved 1st generation fusion with d-t. Also, while Helium-3 is apparently less rare on the moon, it\u0027s still mixed with all the other rocks. So it\u0027d require plenty of extraction and refining of rocks. And that means bringing heavy equipment and a power supply. At some point, it could be profitable do these things, but I don\u0027t see that happening until the 2nd half of the 21st century. \u003C/p\u003E\u003Cp\u003EIt is very true that there\u0027s lots of survey work needing to be done, but how much of that requires a surface visit versus remote sensing in orbit? What sort of geologic field work has to be done in the 2020s/2030s?\u003C/p\u003E\u003Cp\u003EMy favorite reason to return to the moon is \u003Ca href=\u0022http://forum.nasaspaceflight.com/index.php?topic=29529.0\u0022 rel=\u0022external nofollow\u0022\u003Eto study apparent subsurface water and sinkholes\u003C/a\u003E and private lunar tourism. I\u0027m thinking of a circumlunar race broadcasted to people around the world.\u003C/p\u003E\u003Cp\u003EOne thing to consider is that the pressing scientific questions may be tackled by developing space agencies that want to land robots on the moon to demonstrate their spaceflight capabilities.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-04-14T03:53:49Z","Content":"\n\u003Cp\u003EWhile it might be possible to remote-drill on the moon, if we ever want to go deeper, I can\u0027t see depending on a robot to handle the task on its own.\u003C/p\u003E\u003Cp\u003EAnd I\u0027m very curious about the presence of water. If we were going to send just one more manned mission, I\u0027d want it to be a polar landing.\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-04-14T10:14:13Z","Content":"\n\u003Cp\u003EHelium-3 is worthless as a fusion fuel: it\u0027s rare, difficult to mine, difficult to fuse and there are side reactions that produce neutrons.\u003C/p\u003E\u003Cp\u003EThe Moon is essentiqlly a chunck of primordial Earth with a lot of asteroid impacts. It\u0027s a very nice place to study early Earth, the composition of asteroids, and how the solar system evolved (number and composition of asteroids vs time).\u003C/p\u003E\u003Cp\u003EIt is also a great place to put a radiotelescope, since it has no atmosphere and shields us from Earth noise.\u003C/p\u003E\u003Cp\u003EAnd I imagine you could build interresting particle detectors up there, since you\u0027re out of the Earth magnetosphere, but still have a bunch of material (like ice) lying around that might be used in the detector\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-04-14T17:00:03Z","Content":"\n\u003Cp\u003EThe moon is a gold mine for high energy particle physics. Cosmic rays have been known to get as high as 10^20 eV which is 20-40 million times more powerful than the LHC. We can\u0027t observe them directly on Earth, but we do have many arrays set up to measure the shower of secondary particles. Still, it would be nice to get some more direct measurements.\u003C/p\u003E\u003Cp\u003EAnyway, landing a detector array on the moon will likely spring particle physics ahead faster than anything we currently have.\u003C/p\u003E\u003Cp\u003EAlso, it\u0027s cheaper than building the LHC.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-14T18:05:11Z","Content":"\n\u003Cp\u003EIn terms of studying the Moon itself, loads. However, that can be done fairly well by unmanned landers and rovers, especially as a lunar rover can be driven in near real-time and so travel much faster than one on Mars or Venus, though it may still be slower than a manned rover. Compare Apollo 17\u0027s moon buggy, the unmanned Lunokhod 2, and the Opportunity rover: They all drove about the same distance, but took 4 1/2 hours, 5 months, and 10 years to do it respectively.\u003C/p\u003E\u003Cp\u003EIn terms of science to do from the Moon, again plenty. However a practical approach again might be to design the experiments to be autonomous, while having the possibility of manned servicing missions if needed. This worked very well for Hubble, though it is much easier to get to being in LEO.\u003C/p\u003E\u003Cp\u003EIn terms of science to do on people, I think the big one is understanding how the human body handles reduced gravity. We know a good amount about zero-g, and of course loads about 1-g, but nothing of what lies between.\u003C/p\u003E\u003Cp\u003EConsidering the comparison between the Moon and Mars, I think it\u0027s fair to say that if humans can survive, stay healthy, get water, and so on on the Moon, we can almost certainly do it on Mars. Meanwhile the Moon offers the advantage of being closer to get to, and possible to get back from in a hurry if needed.\u003C/p\u003E\n"}]}