{"TopicId":69296,"ForumId":44,"TopicTitle":"My Latest Model Rockets!","CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-04-14T01:30:02Z","PageNum":1,"Articles":[{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-04-14T01:30:02Z","Content":"\n\u003Cp\u003EIn this thread, I post pictures, video, and information about my latest model rockets. \u003C/p\u003E\u003Cp\u003EMay they be an inspiration to all who are interested in model, mid- or high-power rocketry.\u003C/p\u003E\u003Cp\u003EI\u0027ll start with a recent project I\u0027m attempting to replicate soon. This is possibly one of the most awesomest rockets I\u0027ve made. It is called the HyPr, short for either \u0022High Power or \u0022Hyper.\u0022 Its goal was to reach a mile in altitude and to break the sound barrier on an H135 (non-rocketeers read: Really Freaking Big) motor. Sadly, on its maiden test flight, it went into the clouds... and never came out. It\u0027s currently somewhere in the vicinity of the American West. (Or maybe the American Midwest, or East. That thing flew so high!) It\u0027s a minimum diameter 29mm design, and the big thing on the back is a retainer to keep the rocket motor in. I do not want the rocket motor to come down without a parachute and bean people in the head.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9RcKusc.jpg\u0022 alt=\u00229RcKusc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny fellow rocketeers out here? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-14T01:48:11Z","Content":"\n\u003Cp\u003ESweet!\u003C/p\u003E\u003Cp\u003EI got to build a rocket of my own.\u003C/p\u003E\u003Cp\u003E(Although my wish is to build a liquid fuel rocket, kind of like Goddard\u0027s P-series, but with modern hardware)\u003C/p\u003E\n"},{"CreatedByName":"Sidoz11","CreatedById":95460,"CreatedDateTime":"2014-04-14T08:57:33Z","Content":"\n\u003Cp\u003EMan, if you had attached a camera to that thing and recovered it, that would have been awesome to see \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-04-14T19:47:58Z","Content":"\n\u003Cp\u003EThat\u0027s a fine looking rocket. Around the age of 21 I gave up on rocket recovery and just started building them to explode.\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2014-04-14T19:51:24Z","Content":"\n\u003Cp\u003EI\u0027m currently working on a two stage rocket.\u003C/p\u003E\u003Cp\u003EGiven the size of the area I have to launch it in, though, it uses the mini-motors. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}