{"TopicId":70348,"ForumId":44,"TopicTitle":"What do you think of the SLS?","CreatedByName":"MrZayas1","CreatedById":95654,"CreatedDateTime":"2014-04-24T14:10:35Z","PageNum":8,"Articles":[{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-04-29T15:28:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EOnly if the fuel was staying there, but it isn\u0027t. It\u0027s going out the engine. So not all of its energy is transferred back to the rocket, producing a net torque.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis can easily be cancelled out with gimbal king the engine a tiny bit.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-29T15:28:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI understood your use of net torque correctly, I think. If I\u0027m not mistaken, you\u0027re ignoring the force imparted by the fuel coming to a stop in the rotational direction when it arrives in the destination tank.\u003Cp\u003EUsing your analogy, if we start walking on the turntable and stop, will it still be turning?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003ENo, but it will have turned. And if we both jump off when it\u0027s turning, ensuring our jumps are radially outwards so they don\u0027t apply any new torque, then the turntable will continue turning. That jumping off is the analogue to the rocket expelling burnt fuel from its engines.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOr to simplify further, if we remove the two connected tanks from the core stage and pump fuel from one to the other, will the whole thing move (other than adjusting for the center of mass moving)?\u003C/div\u003E\u003C/blockquote\u003ETwo tanks round the core, like Falcon Heavy, creates no problems in the first place. It\u0027s when there\u0027s more tanks with feed around the rings, like we often do in KSP, that has the rotation issues.\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-29T15:31:34Z","Content":"\n\u003Cp\u003EDkmdlb,\u003C/p\u003E\u003Cp\u003EThe red isn\u0027t a force, as near as I can tell, it\u0027s just for clarity of flow direction. Seriously, do you think if I put this contraption on a cart and turned the pump on, the cart would continue accelerating to the right?\u003C/p\u003E\u003Cp\u003ESargeRho,\u003C/p\u003E\u003Cp\u003EPushing the fuel down after it arrives in the destination tank doesn\u0027t change the fact that it must stop moving in the left/right direction first.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-04-29T15:33:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EDkmdlb,\u003Cp\u003EThe red isn\u0027t a force, as near as I can tell, it\u0027s just for clarity of flow direction. Seriously, do you think if I put this contraption on a cart and turned the pump on, the cart would continue accelerating to the right?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it would move slightly to the right as the center of mass moved slightly to the left. The center of mass wouldn\u0027t move, but the cart would move in the opposite direction of the fuel flow.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T15:36:25Z\u0022 title=\u002204/29/2014 03:36  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Dkmdlb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-29T15:39:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ENo, but it will have turned. And if we both jump off when it\u0027s turning, ensuring our jumps are radially outwards so they don\u0027t apply any new torque, then the turntable will continue turning. That jumping off is the analogue to the rocket expelling burnt fuel from its engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe fuel is not moving around the ring anymore when the engine gets it. It had to stop moving around the ring, which implies a force to counteract the initial acceleration given by the pump. You ignored this question:\u003C/p\u003E\u003Cp\u003E\u0022If we time it so that I\u0027m starting just as you\u0027re stopping (and we mass the same), would it move at all?\u0022\u003C/p\u003E\u003Cp\u003EWhich is the most analogous to the pump situation, fuel is constantly being accelerated in one direction by the pump and constantly stopping in the destination tank, producing the counteractive force.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETwo tanks round the core, like Falcon Heavy, creates no problems in the first place. It\u0027s when there\u0027s more tanks with feed around the rings, like we often do in KSP, that has the rotation issues.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I wasn\u0027t clear, I meant two tanks from one side of the asparagus. See the above diagram for what I mean.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-04-29T15:46:56Z","Content":"\n\u003Cp\u003Esince the fuel is moving in an asparagus ring, doesn\u0027t the fact that each tank is paired with another one affect it? While one tank is pumping fuel from right to left, the other tank will be pumping fuel from left to right (since one side of the stack is an exact mirror image of the other side.) This fact means that any torque/force created by one side will be canceled out by the other side. So both sides are right: the pumps will exert torque on the rocket, but since fuel is flowing in opposite directions on either side, the forces will cancel each other out automatically.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-29T15:48:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dkmdlb\u0022 data-cite=\u0022Dkmdlb\u0022\u003E\u003Cdiv\u003ENo, it would move slightly to the right as the center of mass moved slightly to the left. The center of mass wouldn\u0027t move, but the cart would move in the opposite direction of the fuel flow.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo we\u0027re talking about a small effect, then. If all the mass was fuel, the rocket would rotate 60 degrees through the burn of a stage in a core-plus-six asparagus configuration, and stop once on its own once the stage is burnt out. Assuming the stage burns for a non-trivial amount of time, I don\u0027t see why this would break asparagus staging at all, such forces could easily be counteracted by vectored thrust or aerodynamic control surfaces. Or simply ignored for that matter, it\u0027s not like the rocket is going to spin faster and faster until it\u0027s uncontrollable.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-04-29T15:48:44Z","Content":"\n\u003Cp\u003EOh my god. \u003C/p\u003E\u003Cp\u003Eawsumindyman:\u003C/p\u003E\u003Cp\u003EIf there are opposing sideways forces on a rocket, it will spin. Exactly what we\u0027ve been saying. Not cancel out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T15:52:38Z\u0022 title=\u002204/29/2014 03:52  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Dkmdlb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-29T15:50:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ESorry, I wasn\u0027t clear, I meant two tanks from one side of the asparagus. See the above diagram for what I mean.\u003C/div\u003E\u003C/blockquote\u003EThe problem then is that your diagram is not complete, it\u0027s only part of the rocket. I\u0027ll try and do one of the full rocket later, hopefully it\u0027ll be clearer than the analogies.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022awsumindyman\u0022 data-cite=\u0022awsumindyman\u0022\u003E\u003Cdiv\u003Esince the fuel is moving in an asparagus ring, doesn\u0027t the fact that each tank is paired with another one affect it? While one tank is pumping fuel from right to left, the other tank will be pumping fuel from left to right (since one side of the stack is an exact mirror image of the other side.)\u003C/div\u003E\u003C/blockquote\u003EThey aren\u0027t mirror images, but 180 degree rotated counterparts. Mirror images would be worse since the centre of mass would shift radially away from the centreline of the rocket. (Incidentally, such a shift is something KSP *does* model.)\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T15:53:41Z\u0022 title=\u002204/29/2014 03:53  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by cantab\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-04-29T15:51:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI don\u0027t see why this would break asparagus staging at all, such forces could easily be counteracted by vectored thrust or aerodynamic control surfaces.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t have anything to say about that. My only point in this discussion is that asparagus staging will exert torque on a rocket that, if not countered, will cause it to rotate.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-04-29T15:52:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dkmdlb\u0022 data-cite=\u0022Dkmdlb\u0022\u003E\u003Cdiv\u003EOh my god. \u003Cp\u003EIf there are opposing sideways forces on a rocket, it will spin. Exactly what we\u0027ve been saying. Not cancel out.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh. Now that i realize it, you\u0027re right: i imagined them running head on. Please excuse me for such a stupid mistake (not sarcasm).\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-29T16:13:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EThe problem then is that your diagram is not complete, it\u0027s only part of the rocket. I\u0027ll try and do one of the full rocket later, hopefully it\u0027ll be clearer than the analogies.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was trying to simplify by showing that if there is no net force on one half of the asparagus, there cannot be a net force on the rocket as a whole. I\u0027ll have to leave the better diagram to you, my MS Paint skills are very modest.\u003C/p\u003E\u003Cp\u003EI think Dkmdlb is correct in saying it will rotate as the center of mass of each side of the asparagus moves, but I think that rotation will be at most 180 degrees for a single ring asparagus, spread through the entire asparagus-staged burn, and it will stop rotating of its own accord when the last asparagus stage is expended. It\u0027s not going to spin like a bullet from a rifle, or increasingly faster. Definitely within the limits of realistic control authority.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-29T18:21:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003E@KASASpace\u003Cp\u003EAsparagus in real life isn\u0027t as easy as it is in ksp. As sgt_flyer already mentioned, there are a lot of possible complications with the pumps, but aerodynamics are also a huge limiting factor. Try installing FAR and kerbal engineer/mechjeb in ksp and compare the delta-v you need to get into orbit in a streamlined vehicle to the dV needed for an asparagus pancake. Also if you don\u0027t go reusable, the rocket itself will always be more expensive by an order of magnitude than the fuel, so the fuel is the worst place to save money. And reusability is way harder than simply sticking parachutes on your booster because liquid fuel rocket engines don\u0027t tend to like salt water and most first stage engines aren\u0027t designed to be reused.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know it\u0027s difficult. But who in their right mind would ever make an Asparagus PANCAKE? I mean like the Falcon Heavy but with four extra stages, using similar pumps for all of them. The first two tanks dropped pump into the second pair which pump into the third pair which pumps into the final core. I know it\u0027s not easy, but it\u0027s a good way to make a low energy rockets provide a large amount of payload.\u003C/p\u003E\u003Cp\u003EAnd plus, if you could use Balloon tanks, the cost of the stage is actually not as big as you would expect.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-29T18:28:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003E@KASASpace In any case it\u0027s still a non sequitur. What evidence do you have for your other claims. If you have non then your argument is because it isn\u0027t using asparagus staging it is a worthless and horrible rocket. I don\u0027t know why you bought it up. Have you just abandoned those arguments? It sounded trollish because you avoided the question and didn\u0027t justify your arguments.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy point is that SLS is expensive and can be done with low energy technologies. Using Asparagus. \u003C/p\u003E\u003Cp\u003EFine, I\u0027ll say it\u0027s my OPINION that it isn\u0027t safe and shouldn\u0027t be used for manned flights.\u003C/p\u003E\u003Cp\u003ENASA should be developing new technologies, not sticking to the old ones. Like if they went with SLS they should use LRBs instead of SRBs, as LRBs aren\u0027t very common.\u003C/p\u003E\u003Cp\u003EPlus, they should be developing Asparagus staged rockets, as no one has as of yet.\u003C/p\u003E\u003Cp\u003ENASA knows that low energy rockets are cheaper, because the price of LH2 is large, and not even counting all the handling requirements! LH2 can leak through the tiniest hole in the tank. It also requires more insulation than LOX and a thick common bulkhead. But it provides high energy and thus is okay for upper stage use.\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-04-29T18:36:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KASASpace\u0022 data-cite=\u0022KASASpace\u0022\u003E\u003Cdiv\u003EI know it\u0027s difficult. But who in their right mind would ever make an Asparagus PANCAKE? I mean like the Falcon Heavy but with four extra stages, using similar pumps for all of them. The first two tanks dropped pump into the second pair which pump into the third pair which pumps into the final core. I know it\u0027s not easy, but it\u0027s a good way to make a low energy rockets provide a large amount of payload.\u003Cp\u003EAnd plus, if you could use Balloon tanks, the cost of the stage is actually not as big as you would expect.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would still be about than seven times the drag that a streamlined rocket would experience.\u003C/p\u003E\u003Cp\u003EMaking an asparagus staged rocket would be possible, but whether the gain is enough to make up to the more complicated engineering is questionable.\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-04-29T18:41:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KASASpace\u0022 data-cite=\u0022KASASpace\u0022\u003E\u003Cdiv\u003ENASA knows that low energy rockets are cheaper, because the price of LH2 is large\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I have already said, the fuel price doesn\u0027t really matter that much in real life. I would bet that less than 5 million dollars of the 500 million dollars per launch is the price for the fuel.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-29T18:46:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003EAs I have already said, the fuel price doesn\u0027t really matter that much in real life. I would bet that less than 5 million dollars of the 500 million dollars per launch is the price for the fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMost of the launch price is the logistics! The actual rocket is probably only 1/5 of that 500 million.\u003C/p\u003E\u003Cp\u003ESeriously. :|\u003C/p\u003E\u003Cp\u003EIt costs money to prepare the pad, to transport the vehicle, and to pump all the fuel inside.\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2014-04-29T18:48:52Z","Content":"\n\u003Cp\u003EBalloon tanks are not structurally viable as side boosters. (too fragile - especially against the thrust they\u0027ll have to support against drag) \u003C/p\u003E\u003Cp\u003Ethere\u0027s a reason for balloon tanks to be contained inside of fairings.\u003C/p\u003E\u003Cp\u003Ebesides, your mass fraction would be even more against an asparagus design with a balloon tank weight. (it\u0027s built to be lightweight - not cheap. if you add a structural frame, you should go for a true tank instead...)\u003C/p\u003E\u003Cp\u003Eone thing that works wonderfully well in today\u0027s rocketry, is stages and a half... which a lot of current rockets use AKA central core with sustainers. (delta IV, Atlas V, Ariane V)\u003C/p\u003E\u003Cp\u003EEnergia was a 1.5 stage rocket, with the payload having to circularize on it\u0027s own.\u003C/p\u003E\u003Cp\u003Eseveral \u0027updates\u0027 of saturn V asked for boosters.\u003C/p\u003E\u003Cp\u003ESLS is a 2.5 stage rocket.\u003C/p\u003E\u003Cp\u003Ethe main difference with asparagus, is you have to take more fuel inside the central tank (or throttle down the central engine in delta-IV heavy case) - and fuel is the cheapest thing in rockets (you only have to stretch the fuel tanks).\u003C/p\u003E\u003Cp\u003Ewith asparagus, you\u0027ll have to add heavy additionnal plumbing, and devellop extremely reliable fuel pumps. (if a single one breaks, things are going to go haywire fast)\u003C/p\u003E\u003Cp\u003Ebesides, most rocket engineers want to limit separation events (that\u0027s the most dangerous parts during flights), and a 6 tank asparagus add a lot of separation events (should one fail to ignite it\u0027s separation SRB motors, you have a huge risk of colliding with the tank next to it in a 6xtank around a core configuration) - when you drop all boosters at the same time, there\u0027s less chances to hit another valuable booster.\u003C/p\u003E\u003Cp\u003Eand if you are afraid of the logistics of a standard stage and a half rocket, imagine the price of the logistics needed to support asparagus staging...\u003C/p\u003E\u003Cp\u003Eheck, even in KSP, stages and a half are extremely efficient.\u003C/p\u003E\u003Cp\u003Ealso, LRB\u0027s are quite common...\u003C/p\u003E\u003Cp\u003ESoyuz use LRB\u0027s, Energia too used Zenit Kerolox first stage LRB\u0027s, Delta-IV Heavy, Angara will make use in some configurations, some Long March rockets, some Ariane IV configurations used LRB\u0027s, etc. so no, not that uncommon.\u003C/p\u003E\u003Cp\u003Eand the Pyrios LRB booster is in competition for becoming SLS block II boosters (and with what ? a rebuilt/rethinked F-1 engine.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T18:58:35Z\u0022 title=\u002204/29/2014 06:58  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by sgt_flyer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-29T18:49:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003EThat would still be about than seven times the drag that a streamlined rocket would experience.\u003Cp\u003EMaking an asparagus staged rocket would be possible, but whether the gain is enough to make up to the more complicated engineering is questionable.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll give you that, but the drag wouldn\u0027t actually be that big of a problem. The biggest problem is more than likely Max-Q......... but onto drag! The most drag experience would be when the rocket isn\u0027t pointing towards its velocity vector. So, to minimize drag, you only point a few degrees off at all times.\u003C/p\u003E\u003Cp\u003EAnd plus, the 9,144 m/s of Dv needed to get to orbit takes into account drag if I\u0027m not mistaking..........\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-29T18:54:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sgt_flyer\u0022 data-cite=\u0022sgt_flyer\u0022\u003E\u003Cdiv\u003EBalloon tanks are not structurally viable as side boosters. (too fragile - especially against the thrust they\u0027ll have to support against drag) \u003Cp\u003Ethere\u0027s a reason for balloon tanks to be contained inside of fairings.\u003C/p\u003E\u003Cp\u003Ebesides, your mass fraction would be even more against an asparagus design with a balloon tank weight. (it\u0027s built to be lightweight - not cheap. if you add a structural frame, you should go for a true tank instead...)\u003C/p\u003E\u003Cp\u003Eone thing that works wonderfully well in today\u0027s rocketry, is stages and a half... which a lot of current rockets use AKA central core with sustainers. (delta IV, Atlas V, Ariane V)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBallon tanks are actually fairly viable, as they are light. But you could add a few structural emplacements to make it lighter than a typical tank, like a semi-balloon tank.\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t look like you know what 1.5 stage means. The Atlas LV-3b was a 1.5 stage. The Space Shuttle was a 1.5 stage.\u003C/p\u003E\u003Cp\u003E1.5 stage means all the engines fire at launch, but then the heavier engines are dropped, aka the booster engines and then the sustainer is left.\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2014-04-29T19:14:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KASASpace\u0022 data-cite=\u0022KASASpace\u0022\u003E\u003Cdiv\u003EBallon tanks are actually fairly viable, as they are light. But you could add a few structural emplacements to make it lighter than a typical tank, like a semi-balloon tank.\u003Cp\u003EIt doesn\u0027t look like you know what 1.5 stage means. The Atlas LV-3b was a 1.5 stage. The Space Shuttle was a 1.5 stage.\u003C/p\u003E\u003Cp\u003E1.5 stage means all the engines fire at launch, but then the heavier engines are dropped, aka the booster engines and then the sustainer is left.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei know exactly what a stage and a half means. and all examples i gave you are stages and a half design where all lower engines fire at the same time.\u003C/p\u003E\u003Cp\u003Eand for note : i said stage and a half, not 1.5 staging.\u003C/p\u003E\u003Cp\u003ESoyuz / longmarch are 2.5 stage, so is SLS and Ariane V.\u003C/p\u003E\u003Cp\u003EEnergia was 1.5 stage.\u003C/p\u003E\u003Cp\u003Edropping the engines with or without the fuel tanks (like the Atlas-3B) doesn\u0027t change anything to the staging.\u003C/p\u003E\u003Cp\u003Eand balloon tanks are not meant to support the full weight of the rocket (or the full thrust of the lower stages) - only the payload at low TWR.\u003C/p\u003E\u003Cp\u003Efor now, i\u0027ll stop feeding the troll you seem to be...\u003C/p\u003E\u003Cp\u003Ereal life rocket engineers want rockets to be as simple as possible to limit risks of failures, and you keep wanting to add complex things to rockets...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T19:46:44Z\u0022 title=\u002204/29/2014 07:46  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by sgt_flyer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-29T19:52:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sgt_flyer\u0022 data-cite=\u0022sgt_flyer\u0022\u003E\u003Cdiv\u003Ei know exactly what a stage and a half means. and all examples i gave you are stages and a half design where all lower engines fire at the same time.\u003Cp\u003Eand for note : i said stage and a half, not 1.5 staging.\u003C/p\u003E\u003Cp\u003ESoyuz / longmarch are 2.5 stage, so is SLS and Ariane V.\u003C/p\u003E\u003Cp\u003EEnergia was 1.5 stage.\u003C/p\u003E\u003Cp\u003Edropping the engines with or without the fuel tanks (like the Atlas-3B) doesn\u0027t change anything to the staging.\u003C/p\u003E\u003Cp\u003Eand balloon tanks are not meant to support the full weight of the rocket (or the full thrust of the lower stages) - only the payload at low TWR.\u003C/p\u003E\u003Cp\u003Efor now, i\u0027ll stop feeding the troll you seem to be...\u003C/p\u003E\u003Cp\u003Ereal life rocket engineers want rockets to be as simple as possible to limit risks of failures, and you keep wanting to add complex things to rockets...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen kindly explain why the Atlas LV-3b used Balloon tanks. It was a booster launch vehicle, and they placed an upper stage on it. The Centaur.\u003C/p\u003E\u003Cp\u003EAtlas V is not a 1 and a half stage, Ariane V is not. And I\u0027m quite sure that the Delta IV isn\u0027t as well.\u003C/p\u003E\u003Cp\u003EAtlas V: ONE RD-180 first stage engine. Sure, you can add booster stages, but those aren\u0027t individual engines, those are entire stages.\u003C/p\u003E\u003Cp\u003EAriane V: Has a second stage, albeit small. UPDATE: Plus, the SRBs contain their own fuel.\u003C/p\u003E\u003Cp\u003EDelta IV: Also has a second stage, using the RL-10. The upper stage was planned to be adapted for the SLS\u0027 first two missions : EM-1 and EM-2.\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2014-04-29T20:07:53Z","Content":"\n\u003Cp\u003Eif you can\u0027t read \u0027Stage\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Es\u003C/span\u003E\u0027 and a half, i can\u0027t do anything for you.\u003C/p\u003E\u003Cp\u003Ethere\u0027s a reason 2.5 stage to orbit keeps coming back with very lightweight upper stages (compared to the rest of the rocket)\u003C/p\u003E\u003Cp\u003Ei even specifically made the distingo between 1.5 and 2.5 stages in my post.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESoyuz / longmarch are 2.5 stage, so is SLS and Ariane V.\u003C/p\u003E\u003Cp\u003EEnergia was 1.5 stage.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebesides, i\u0027d like to see your sources for the Atlas-LV3b where they talk about balloon tanks... \u003C/p\u003E\u003Cp\u003Eexcept for the Centaur \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eupper\u003C/span\u003E stage, which is a balloon tank i don\u0027t seem to find where in the rocket\u0027s first stage they used balloon tanks...\u003C/p\u003E\u003Cp\u003Ebesides, space shuttle could be considered 2.5 stages to orbit by dropping the External Tank.\u003C/p\u003E\u003Cp\u003Eignition : SSME\u0027s from external tank \u002B SRB\u0027s\u003C/p\u003E\u003Cp\u003ESRB drop\u003C/p\u003E\u003Cp\u003ESSME\u0027s extinction \u002B external tank jettison\u003C/p\u003E\u003Cp\u003Ecircularization with OMS engines.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T20:13:06Z\u0022 title=\u002204/29/2014 08:13  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by sgt_flyer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-29T20:27:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sgt_flyer\u0022 data-cite=\u0022sgt_flyer\u0022\u003E\u003Cdiv\u003Eif you can\u0027t read \u0027Stage\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Es\u003C/span\u003E\u0027 and a half, i can\u0027t do anything for you.\u003Cp\u003Ethere\u0027s a reason 2.5 stage to orbit keeps coming back with very lightweight upper stages (compared to the rest of the rocket)\u003C/p\u003E\u003Cp\u003Ei even specifically made the distingo between 1.5 and 2.5 stages in my post.\u003C/p\u003E\u003Cp\u003Ebesides, i\u0027d like to see your sources for the Atlas-LV3b where they talk about balloon tanks... \u003C/p\u003E\u003Cp\u003Eexcept for the Centaur \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eupper\u003C/span\u003E stage, which is a balloon tank i don\u0027t seem to find where in the rocket\u0027s first stage they used balloon tanks...\u003C/p\u003E\u003Cp\u003Ebesides, space shuttle could be considered 2.5 stages to orbit by dropping the External Tank.\u003C/p\u003E\u003Cp\u003Eignition : SSME\u0027s from external tank \u002B SRB\u0027s\u003C/p\u003E\u003Cp\u003ESRB drop\u003C/p\u003E\u003Cp\u003ESSME\u0027s extinction \u002B external tank jettison\u003C/p\u003E\u003Cp\u003Ecircularization with OMS engines.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Stages and a half\u0022 looks like you mean multiple launch vehicles with stage and a half design. You wouldn\u0027t say \u0022stage and a halves\u0022 would you?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.astronautix.com/lvs/atlas.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.astronautix.com/lvs/atlas.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s the Encyclopedia Astronautica. One of the best resources for space flight. If you look in the very first paragraph it says:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIts innovative stage-and-a-half and \u0027balloon tank\u0027 design provided the best dry-mass fraction of any launch vehicle ever built\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt *could* be considered that (the STS).\u003C/p\u003E\u003Cp\u003E(Although, I have to commend you on your Saturn family.......)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T20:30:27Z\u0022 title=\u002204/29/2014 08:30  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by KASASpace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2014-04-29T20:49:04Z","Content":"\n\u003Cp\u003Ewell, you have 2 stages and a half \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E for example \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003Esaying 2 stage and halves would make little sense \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eelse, Wikipedia\u0027s article on the atlas is more expansive on the balloon tank \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eit just \u0027needs\u0027 to be kept under at least a pressure of 5 PSI - for such a light payload it carried \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003Eyou would need way higher pressures for keeping the high thrust engines in check for a superheavy rocket boosters. (or you\u0027ll need a support structure - but that\u0027s what those tanks already are - notably the Space Shuttle External tank - they needed to build a support structure to support everything above) - so the gain between a balloon tank \u002B support structure around it would be mitigated.\u003C/p\u003E\u003Cp\u003Eone of the best structures to support heavyweights posed on top of it remains a tube after all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T20:59:31Z\u0022 title=\u002204/29/2014 08:59  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by sgt_flyer\u003C/strong\u003E\n\u003C/span\u003E\n"}]}