{"TopicId":70348,"ForumId":44,"TopicTitle":"What do you think of the SLS?","CreatedByName":"MrZayas1","CreatedById":95654,"CreatedDateTime":"2014-04-24T14:10:35Z","PageNum":3,"Articles":[{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-25T15:13:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022awsumindyman\u0022 data-cite=\u0022awsumindyman\u0022\u003E\u003Cdiv\u003ENASA is done wasting it\u0027s time, money and resources on repeating experiments in LKO and sending countless rovers* to Mars.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENonsense, the Mars rovers have been hugely successful, and there are extensive future plans for further probes, rovers and a sample return. Experiments in LEO are also very sensible, we still have quite a lot of new kit to test before it\u0027ll be really safe to send humans on interplanetary missions.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-04-25T15:37:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrZayas1\u0022 data-cite=\u0022MrZayas1\u0022\u003E\u003Cdiv\u003Ethey should just stick to the guns of the past! They worked perfectly fine and we could give them a facelift\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESLS is more efficient than Saturn V, and it actually uses some Saturn V technology that has gotten a facelift.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-04-25T15:42:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003ENonsense, the Mars rovers have been hugely successful, and there are extensive future plans for further probes, rovers and a sample return. Experiments in LEO are also very sensible, we still have quite a lot of new kit to test before it\u0027ll be really safe to send humans on interplanetary missions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you see the asterisk? That\u0027s called a footnote. Go down to the bottom of the page, find the sentence with an asterisk in front, and read it. Then you\u0027ll understand my point a bit better.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-04-25T15:58:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022awsumindyman\u0022 data-cite=\u0022awsumindyman\u0022\u003E\u003Cdiv\u003EDid you see the asterisk? That\u0027s called a footnote. Go down to the bottom of the page, find the sentence with an asterisk in front, and read it. Then you\u0027ll understand my point a bit better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E*I\u0027m not saying that the Mars rovers are useless, just that they can only do so much before it becomes impractical to use them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour point seems to be to counter your own claim that NASA has been wasting its time, money and resources.\u003C/p\u003E\u003Cp\u003EBonus question: how many NASA missions are not in LEO or on Mars?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T16:02:01Z\u0022 title=\u002204/25/2014 04:02  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by rkman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Klingon Admiral","CreatedById":69090,"CreatedDateTime":"2014-04-25T16:11:56Z","Content":"\n\u003Cp\u003ENew Horizons and Cassini come to mind, and there is one around Jupiter as well iirc.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-25T16:45:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Klingon Admiral\u0022 data-cite=\u0022Klingon Admiral\u0022\u003E\u003Cdiv\u003ENew Horizons and Cassini come to mind, and there is one around Jupiter as well iirc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDawn, Messenger, still listening to voyager once in a while... SOHO, Stereo and other assorted probes aimed at investigating the sun... James webb telescope and others that we might want to put a little further away than LEO.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-25T18:37:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022awsumindyman\u0022 data-cite=\u0022awsumindyman\u0022\u003E\u003Cdiv\u003EDid you see the asterisk? That\u0027s called a footnote. Go down to the bottom of the page, find the sentence with an asterisk in front, and read it. Then you\u0027ll understand my point a bit better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol, I managed to detect your little caveat just fine thanks. I don\u0027t think it really adds weight to your point though, does it? On the contrary, I think you realised you\u0027d said something a bit ridiculous and tried to back away from it a bit.\u003C/p\u003E\u003Cp\u003EI get it, you like manned exploration. That\u0027s understandable, it\u0027s romantic and inspires all sorts of warm fuzzy feelings. But that\u0027s not how priorities in space exploration are set. Maximum science out to money in ratio is the hard-nosed reality of it. Which is why SLS will struggle, it costs a lot and doesn\u0027t have much to do. They either need to find some payloads for it or cancel it now before too much more money is spent.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-04-25T19:21:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003ELol, I managed to detect your little caveat just fine thanks. I don\u0027t think it really adds weight to your point though, does it? On the contrary, I think you realised you\u0027d said something a bit ridiculous and tried to back away from it a bit.\u003Cp\u003EI get it, you like manned exploration. That\u0027s understandable, it\u0027s romantic and inspires all sorts of warm fuzzy feelings. But that\u0027s not how priorities in space exploration are set. Maximum science out to money in ratio is the hard-nosed reality of it. Which is why SLS will struggle, it costs a lot and doesn\u0027t have much to do. They either need to find some payloads for it or cancel it now before too much more money is spent.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell you could also launch unmanned stuff on the SLS. Ie. hubble replacement with say an 8 meter primary mirror versus the 2,4 meter mirror on hubble.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-04-25T19:52:35Z","Content":"\n\u003Cp\u003EThe SLS is a good idea. I\u0027m glad NASA choose for an actual rocket.\u003C/p\u003E\u003Cp\u003EComparing the Saturn V with SLS isn\u0027t really fair. It\u0027s like comparing a tube with an LCD TV.\u003C/p\u003E\u003Cp\u003EImagine what the Saturn V might have evolved into if it was kept in favor of the Space Shuttle.\u003C/p\u003E\u003Cp\u003EIt might have become a better rocket than what they say the SLS is going to be.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-25T21:04:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duxwing\u0022 data-cite=\u0022Duxwing\u0022\u003E\u003Cdiv\u003EI did the same thing in Kerbal Space Program, and I am happy with my results. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E My similarly-developed universal interplanetary tug system can put 6 Kerbals or ten tons anywhere in the Kerbolar system.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, but KSP has time-warp. I wish IRL had that feature.....\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhy were the papers not kept? O_O\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe manufacturers of the engines (IE the F-1) were ordered to keep the designs. They didn\u0027t really do that well at it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe same could be said of Delta-IV.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, that\u0027s no where near the payload of the SLS. SLS will have an LH2 stage that will be just as big or bigger than the first stage of the S-V.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe funding of exploding craft does not necessarily evaporate: Apollo 1 killed its crew, and Apollo 11 walked on the Moon.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUmm, not to be the contrary, but that was when NASA was heavily committed. Now, NASA has a shoestring budget, one flop, and it goes down the toilet. It\u0027s mainly a political thing. Plus, Apollo 1 was a capsule fire, not an LV explosion.\u003C/p\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-04-26T00:29:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EI don\u0027t know why people say this. There were terrible tragedies, yes, but it worked perfectly fine otherwise. It was a (relatively) cheap way to go to space. Now SLS is going to be that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was not really that cheap. And SLS is not replacing the Space Shuttle, it is a heavy lift rocket similar to payload capacity of the Saturn V (Block II at least). Dream Chaser, Dragon, and CST-100 are the replacements for the Space Shuttle. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xenomorph555\u0022 data-cite=\u0022xenomorph555\u0022\u003E\u003Cdiv\u003EI\u0027m gonna say it now, the sls, is the ugliest rocket ever created... bad name as well. Plus the solild boosters \u0022I got an idea lets kill another crew\u0022. I doubt it will cost what they say, probably over 3-4 times as much.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought the same thing, but with a proper and traditional launch escape system, they SHOULD be able to abort rather quickly if they solid rocket boosters fail (which isn\u0027t likely, they\u0027ve learned a lot about O-rings since then; another safety \u0022feature\u0022 is that the Orion MPCV is not piggybacked, so there won\u0027t be any foam coming off and knocking away the heat shield... and the heatshield is already not exposed like the Space Shuttle\u0027s wings. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maximus97\u0022 data-cite=\u0022Maximus97\u0022\u003E\u003Cdiv\u003EI thought it was pretty cool that the J-2 engines on it were the same as the main engines on the Space Shuttle, and using a cluster of four of them was something I had never thought of.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha, you got those mixed up a bit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The J-2 was used on the Saturn V second stage in a cluster of five, and a single J-2 on the third stage. The Space Shuttle used SSME\u0027s (renamed RS-25 for the SLS), and they\u0027re using four (you\u0027re correct \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E) on the core stage. Block II of the SLS will use two J-2X engines (upgraded J-2 enginees) on the second stage (or third, counting the boosters). The F-1 engine from the S-IC stage (Saturn V first stage) is being modernized and made more \u0022reliable\u0022 (even though the F-1 had no failures) and turned into a less complex (simpler) design. It\u0027s called the F-1B and is being developed by Dynetics and Aerojet Rocketdyne (formerly Pratt and Whitney Rocketdyne when development began).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KASASpace\u0022 data-cite=\u0022KASASpace\u0022\u003E\u003Cdiv\u003ENo, that\u0027s no where near the payload of the SLS. SLS will have an LH2 stage that will be just as big or bigger than the first stage of the S-V.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpace Launch System Block II upper stage will be 8.4 meters wide. The first stage of the Saturn V was 10.1 meters wide. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe SLS is not a waste of time, not at all. It is another step in the right directions for Mars, which if we don\u0027t get there, we are failing. Falcon Heavy doesn\u0027t have the Oomph, and the Falcon XX and such aren\u0027t even being developed, they\u0027re just concepts. They actually ARE making the SLS, it\u0027s going to happen. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-04-26T01:17:36Z","Content":"\n\u003Cp\u003EFalcon XX is an interesting concept, but it isn\u0027t getting any funding currently and we don\u0027t even know anything about the development of its Merlin 2 engines, so it\u0027s pretty unlikely that it will become reality anytime soon.\u003C/p\u003E\u003Cp\u003EHowever we know that SpaceX is developing the raptor engines and the only planned vehicle they have yet spoken about that would use these engines is the mars colonial transporter - a vehicle that could lift over 100 tons to mars. It will still take several years to even get to a point when they can announce an ETA.\u003C/p\u003E\u003Cp\u003EThis is still all only on paper, but if it will get operational and fully reusable, SLS would loose all hope for any mars missions. Things that SLS would set on mars would be able to be loaded as a secondary payload on the mars colonial transporter.\u003C/p\u003E\n"},{"CreatedByName":"check","CreatedById":71875,"CreatedDateTime":"2014-04-26T01:53:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003EFalcon XX is an interesting concept, but it isn\u0027t getting any funding currently and we don\u0027t even know anything about the development of its Merlin 2 engines, so it\u0027s pretty unlikely that it will become reality anytime soon.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think it\u0027s\u003Cem\u003E that\u003C/em\u003E far off.. maybe by the end of the decade. Falcon 9 first stage recovery should be demonstrated by years end... reusability by Q1 of 2015. Abort tests for Dragon rider should be done by this year. Falcon Heavy demo flight by Q1-Q2 of 2015... Maybe a crewed Dragon Rider next year. All that is happening within the next year. After that, I could see a large part of r\u0026amp;d shifting to Merlin 2 and Falcon X/XX.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-04-26T06:35:22Z","Content":"\n\u003Cp\u003EThat schedule is way too optimistic. SpaceX has yet to recover a booster. After that, it will be a while before they get to a stage where they are confident enough to reuse it. They will need to tear down the first couple of recovered stages, x-ray the parts, check everything, and rebuild and test them. They will also need to find a customer who is actually willing to risk their payload on a reused stage. NASA won\u0027t, and I don\u0027t think DoD will either. That kind of limits the point of reusability. \u003C/p\u003E\u003Cp\u003EAnd again, Falcon XX will only be built if there are customers willing to fly their birds on it. There are no payloads for it and customers aren\u0027t really queuing up with 100 ton payloads on the launch market.\u003C/p\u003E\n"},{"CreatedByName":"Lexif","CreatedById":65533,"CreatedDateTime":"2014-04-26T11:02:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eyou show your ignorance.\u003Cp\u003EConcorde \u0022only killed 1 crew and load of passengers\u0022. That was considered enough to order the type retired.\u003C/p\u003E\u003Cp\u003EWhy? Because there were so few of them.\u003C/p\u003E\u003Cp\u003E2 hull losses out of 6 or so built is a lot, it\u0027s 1/3 of the fleet.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou should not use bold statements about the ignorance of others and then expose your lack of knowledge in the next sentences, that\u0027s pretty embarassing.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-04-26T11:08:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E........They will also need to find a customer who is actually willing to risk their payload on a reused stage. NASA won\u0027t, and I don\u0027t think DoD will either. That kind of limits the point of reusability.............\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo I guess the STS was useless than?\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-04-26T21:23:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EOr it might not, that\u0027s my point. As I said up at the top: \u0022if you build it, they will come\u0022 is not a sensible way to do business.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe can speculate forever on what Congress\u0027 motivation might be, and payload manufacturers might be nervously standing around, pointing at and whispering about the guy with the blue patch on his shirt and the model of a huge rocket on his desk, wondering whether he can build it and whether they therefore can sleep at night after building payloads for it; the patch-and-rocket guy likely has already asked the huddled crowd whether they would if he succeeded. Less allegorically, NASA likely has done market research that indicates demand for the SLS.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe only reason they should even be building a giant lifter is if they had some giant payloads they absolutely \u003Cem\u003Ehad to\u003C/em\u003E launch. That\u0027s why we built the Saturn V, because it was an integrated part of a programme that required it. I\u0027m not quite sure what SLS is being built for.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe SLS is for Beyond Earth Orbit payloads that lesser rockets cannot lift.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EI don\u0027t think anyone is seriously thinking about sending one to L\u003Cstrong\u003EK\u003C/strong\u003EO ;-)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E *snickers* Playing a little Kerbal Space Program, I see...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf congress wants to send men to Mars, then they\u0027d better start allocating a budget. It would take at least 10 years to develop the technology and another 10 years to develop the vehicles to go there, and that\u0027s if they started allocated funds right now, which they aren\u0027t.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat estimate seems extreme. The Martian technology (I feel giddy saying that phrase) would be developed within some mass limit, enabling the transfer vehicles\u0027 simultaneous development.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESLS can\u0027t sit around for 20 years waiting for a payload, and any interim mission hardware requires even more funds, which only pushes Mars back another 10 years.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt need not, and how would interim mission hardware push back a mission that would have, by definition, already begun?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt is an overly specialized launcher. It\u0027s specialized in 60 to 130 ton payloads which don\u0027t exist. You don\u0027t get more overly specialized than that really.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose payloads are already being developed.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-26T22:43:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003ESo I guess the STS was useless than?\u003C/div\u003E\u003C/blockquote\u003ENot the same thing at all. The Shuttle was always meant to be reusable and they were never going to make a new Shuttle just for one launch.\u003Cp\u003EWith Falcon, customers will have a clear choice: Insist on a brand-new rocket for their payload and accept the possible higher cost, or let SpaceX use a reused rocket and negotiate a lower price. Commercial buyers will estimate what they feel is the extra risk of failure with a reused rocket and weigh the losses of such a failure against the cost savings. Their estimates may or may not be in line with SpaceX\u0027s.The insurers will have a say too. The military, on the other hand, will probably just take the brand-new rocket, cost be damned. NASA\u0027s payloads are probably more expensive and less replaceable themselves than typical commercial satellites so they\u0027re also likely to play it safe.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-26T23:18:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duxwing\u0022 data-cite=\u0022Duxwing\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe SLS is for Beyond Earth Orbit payloads that lesser rockets cannot lift.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell obviously, yes. But do you think it makes sense to simply assume that such payloads will appear once the rocket is ready? What happens if they don\u0027t? What if NASA ends up using STS for ISS crews and not much else?\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-04-26T23:41:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ENot the same thing at all. The Shuttle was always meant to be reusable and they were never going to make a new Shuttle just for one launch.\u003Cp\u003EWith Falcon, customers will have a clear choice: Insist on a brand-new rocket for their payload and accept the possible higher cost, or let SpaceX use a reused rocket and negotiate a lower price. Commercial buyers will estimate what they feel is the extra risk of failure with a reused rocket and weigh the losses of such a failure against the cost savings. Their estimates may or may not be in line with SpaceX\u0027s.The insurers will have a say too. The military, on the other hand, will probably just take the brand-new rocket, cost be damned. NASA\u0027s payloads are probably more expensive and less replaceable themselves than typical commercial satellites so they\u0027re also likely to play it safe.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe falcon 9 was also designed from the beginning with reusability in mind. The probability of a failure because something got damaged on a previous flight and the damage wasn\u0027t discovered won\u0027t be very much higher than the probability that some component got manufactured faulty. The space shuttle failures didn\u0027t have anything to do with the reuse of components and so it\u0027s unlikely that the falcon 9 will be more unsafe when reused.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-04-26T23:48:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EWell obviously, yes. But do you think it makes sense to simply assume that such payloads will appear once the rocket is ready? What happens if they don\u0027t? What if NASA ends up using STS for ISS crews and not much else?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe payloads are already being developed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-04-26T23:55:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duxwing\u0022 data-cite=\u0022Duxwing\u0022\u003E\u003Cdiv\u003EThe payloads are already being developed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich payloads are those? From what I know the only payload that is actually funded is Orion.\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2014-04-27T00:02:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EWell obviously, yes. But do you think it makes sense to simply assume that such payloads will appear once the rocket is ready? What happens if they don\u0027t? What if NASA ends up using STS for ISS crews and not much else?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot even NASA would use a vehicle with a 70\u002B ton payload capacity to deliver a 20 ton spacecraft to LEO. A man-rated Delta IV Heavy would probably work, but Dragon, Dream Chaser, or CST-100 would be much better suited for LEO taxi missions.\u003C/p\u003E\n"},{"CreatedByName":"deadshot462","CreatedById":13659,"CreatedDateTime":"2014-04-27T00:35:37Z","Content":"\n\u003Cp\u003EThe SLS is a jobs program for former shuttle contractors to keep state constituents happy. Congress basically wrote the specs for the rocket, telling NASA they have to use certain shuttle-derived parts. Not much room for innovation there, which is NASA\u0027s job.\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t mind this if there were specific missions lined out or even payloads. Right now the only confirmed payload is the Orion capsule for a couple of test missions. Just for that, NASA could have used already available commercial rockets.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-04-27T00:58:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ENot the same thing at all. The Shuttle was always meant to be reusable and they were never going to make a new Shuttle just for one launch.\u003Cp\u003EWith Falcon, customers will have a clear choice: Insist on a brand-new rocket for their payload and accept the possible higher cost, or let SpaceX use a reused rocket and negotiate a lower price. Commercial buyers will estimate what they feel is the extra risk of failure with a reused rocket and weigh the losses of such a failure against the cost savings. Their estimates may or may not be in line with SpaceX\u0027s.The insurers will have a say too. The military, on the other hand, will probably just take the brand-new rocket, cost be damned. NASA\u0027s payloads are probably more expensive and less replaceable themselves than typical commercial satellites so they\u0027re also likely to play it safe.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs R0cketC0der said, it was designed from the start to be reusable, the Shuttle accidents had nothing to do with detriment of parts over time due to being reused, what reason do you have to think that it won\u0027t be more reliable because it is being reused. In fact we have reason to think that it would be more reliable than the STS because the main components which are being reused do not have to survive reentry and are inherently less complicated than the entire STS system. What\u0027s your point? Because the customer has a choice between using a reusable rocket and using a one time use rocket they will just pay the extra to use the one time use? So if they had the same option with the STS would they of taken it?\u003C/p\u003E\n"}]}