{"TopicId":73218,"ForumId":44,"TopicTitle":"Solar FREAKIN\u0026#039; roadways discussion","CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-05-24T03:20:59Z","PageNum":5,"Articles":[{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-06-12T06:27:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EThose predictions are based on the tokamak, which is just absurdly problematic. Dense plasma focus and polywell fusion devices have a very real chance of being practical in under a decade.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgree, but we still new in the laser approximation, you know how these things are.\u003C/p\u003E\u003Cp\u003EFirst you get an prototype that it works ( generating 5% more energy that you waste in few min).\u003C/p\u003E\u003Cp\u003EThen you get something that generate 10% in 1 hr, then years pass and you get something that generate 80% 12 hrs. \u003C/p\u003E\u003Cp\u003EYou build a comercial model, but its still very complex and expensive. So many years pass until you find a new shorcut to produce fusion using nanotec.\u003C/p\u003E\u003Cp\u003EI hope being wrong.\u003C/p\u003E\u003Cp\u003EBut we dont need to let all our hope in 1 technology that we dont know for sure how hard is to achieve.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBring on the radiation? It\u0027s not like I was saying you\u0027d want to live there, just that people\u0027s reaction to nuclear disaster tend to be clouded in fear of a thing that can kill but they cannot see.\u003C/div\u003E\u003C/blockquote\u003EHow it must be, the danger is real and it can be measure it.\u003Cp\u003EThe fact that you dont know for sure if you will be ok or not (also your family) is not something that worth to risk when renewable energy is cheaper and inexhaustible.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI would gladly tour the Chernobyl exclusion zone for the sake of science. The radiation there isn\u0027t all that terrible. A few milliseiverts above background; big freaking whoop. When there\u0027s science to be done, a little radiation isn\u0027t going to kill you. Radiation workers have a yearly dose limit of 50mSv. Scientific advancement and the progression of human society are worth that small price.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWhat experiments you want to make there? I do not think that a lizard has had time to become godzillla \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E I can\u0027t tell what you\u0027re trying to say. Are you saying you should put poles in people\u0027s crop fields? Do you have any idea what kind of havoc that could wreak? What do you do when they fall over? Just put your planting on hold? Sure, it\u0027s not like planting seasons are...seasonal.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dont know what is the right translate. When I chosse the word Pole I mean \u0022guidepost\u0022 to transport the wires in height..\u003C/p\u003E\u003Cp\u003ESecond, how often a guidepost fall? But you dont need them. The best its if you keep your wind generator close to the grid, in the border of fields or roads.\u003C/p\u003E\u003Cp\u003EYou dont need to have a wind farm. Is more efficient if you have them in different location to save in transmission losses.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EUnless you have proof, I\u0027ve got to write this off as paranoia. As to Canada, yes, we have Alberta that loves to extract from the tar sands, but you know what? We don\u0027t even use most of that crap. The Americans do, and China wants in. We\u0027re a nation that earns its wealth through natural resources; I won\u0027t apologize for that, as many nations do. China does it with heavy metals, South American nations have done it with crude oil and precious metals.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELook, before you misunderstand me, let me clear you that I know what kind of country Canada is. In fact it was always my favorite place to live since kid.\u003C/p\u003E\u003Cp\u003EBut what I want to said, is that accidents happens in all the world; secure measures are skipped. No country is exempt of flaws or human error. The benefic of Canada and Germany is that you dont have many natural disasters.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs I pointed-out earlier, nuclear power, when properly managed and designed, is ridiculously safe. The problems come when you have poor design and crap management.\u003C/div\u003E\u003C/blockquote\u003EThey are still a time bomb, you can have the detonator well insulated, but it is still a bomb.\u003Cp\u003EYou need to deal with radiation waste, mine and enrich the uranium, it needs many workers all with high salary due to risk, \u0026gt; cost than renewable, etc.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Cost_of_electricity_by_source\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Cost_of_electricity_by_source\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.bloomberg.com/news/2014-04-16/new-wind-solar-power-cheaper-than-nuclear-option-study-shows.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.bloomberg.com/news/2014-04-16/new-wind-solar-power-cheaper-than-nuclear-option-study-shows.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://reneweconomy.com.au/2014/wind-and-solar-generation-half-the-cost-of-nuclear-95493\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://reneweconomy.com.au/2014/wind-and-solar-generation-half-the-cost-of-nuclear-95493\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.agora-energiewende.org/topics/optimisation-of-the-overall-system/detail-view/article/klimaschutz-wird-mit-erneuerbaren-deutlich-preiswerter-als-mit-atomkraft/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.agora-energiewende.org/topics/optimisation-of-the-overall-system/detail-view/article/klimaschutz-wird-mit-erneuerbaren-deutlich-preiswerter-als-mit-atomkraft/\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003ECouple points.\u003Cp\u003ECommon sense is not an argument for anything apart for the existence of oxymorons.\u003C/p\u003E\u003Cp\u003EWind and solar can\u0027t be used for base load because they aren\u0027t a continuous power source. That\u0027s why they can\u0027t completely replace coal.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll my arguments are detailed, if you dint find nothing to correct or reply is the proof of that.\u003C/p\u003E\u003Cp\u003EFirst, Thermal solar produce energy day and night. Wind blows at all times in different locations, so if wind does not blow in one place, for sure would blow in another one. Electric cars can help to storage energy when you dont needed. Many countries like Sweden, Australia, Switzerland, Denmark and Norway had almost the 50% of their energy consumption using renowable.\u003C/p\u003E\u003Cp\u003EThey had complex software to predict energy consumption by zone and time, wind conditions in the whole country, etc. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003EYour points are made with too much empty rhetoric and too much emotion. Nuclear power is fine. Neither Chernobyl nor Fukushima are successful arguments against it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWind generator cost half than nuclear, they are renowable and safe.\u003C/p\u003E\u003Cp\u003ESo fukushima and chernobyl or other accidents are not good arguments against? What else you need? Blow up half planet? This is stupid. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skyler4856\u0022 data-cite=\u0022Skyler4856\u0022\u003E\u003Cdiv\u003EBefore we go off into a discussion of other power sources, let us not forget what the implementation of these road ways would cause. I could easily see an Orion type situation in the Infrastructure sector; One project could take the vast majority of the funding, leaving very little for invaluable maintenance...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would not happen becouse nobody will invest in something like this. Is clearly a joke.\u003C/p\u003E\n"},{"CreatedByName":"mdatspace","CreatedById":83778,"CreatedDateTime":"2014-06-12T06:28:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EActually, that\u0027s a maybe. Specifically these concerns come from fracking, which \u003Cem\u003Emight\u003C/em\u003E help cause earthquakes. If true, they \u003Cem\u003Emight\u003C/em\u003E be small enough to ignore, or the \u003Cem\u003Emight\u003C/em\u003E be so big that geothermal near fault lines is a terrible idea (which is a problem since most of the best places for geothermal are right on fault lines). We just don\u0027t have enough data.\u003C/div\u003E\u003C/blockquote\u003E We have enough data. Most geothermal plants are located on hot rock, not fault lines. A good example? The geysers.\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-12T06:32:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moss\u0022 data-cite=\u0022Moss\u0022\u003E\u003Cdiv\u003EI don\u0027t like solar power because as people have said, it\u0027s pretty pathetic at generating power. That\u0027s why I believe fusion power is the way to go for the future\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFuture energy systems aren\u0027t a zero-sum game, there\u0027s no one energy source that will \u0022win\u0022. Our demands are such that we\u0027ll need a diverse energy mix to meet them. We\u0027ll need nuclear (whether fission or fusion), and renewables and fossils fuels (particularly in transport) to meet our needs.\u003C/p\u003E\u003Cp\u003EAs for not being able to put wind turbines in farmland, that\u0027s just silly. It\u0027s done routinely. The whole wind sector in the UK was kickstarted by a farmer getting annoyed with official procrastination and importing some turbines from Denmark to put on his land. Do a Google image search for something like \u0022wind turbine farmland\u0022 if you don\u0027t believe me. It\u0027s probably how most on-shore turbines are built.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://solarroadways.com/military.shtml\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://solarroadways.com/military.shtml\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol, he\u0027s really trying to hit that \u0022mad inventor in a shed\u0022 meme, isn\u0027t he?\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-06-12T07:02:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003ESo fukushima and chernobyl or other accidents are not good arguments against? What else you need? Blow up half planet? This is stupid. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe ratio of accidents is nowhere near high enough to declare nuclear power unsafe. \u003C/p\u003E\u003Cp\u003EThe kind of paranoia that spreads after even one incident is staggering. All school buses must now stop in front of train tracks because ONE bus got hit by a train when the warning gates failed. One.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-06-12T10:42:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003E1. Lol, WTF? What lives? How a Fission reactor may save lives against renowable energy? \u003Cp\u003E2. With common sense, green technologies start to have benefics in many countries, there is an added value to the energy that is produced with renowable resources. It has to be take it into account in the price when you sell that energy.\u003C/p\u003E\u003Cp\u003EThe same happens with organic food. The study that I am talking about is the main study that is delivery to all invesors in that ruble. I guess it has its central in Harvard.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. Global warming is estimated to indirectly cost 5 million lives every year from the year 2025-2050. That\u0027s 125 million lives over all. That\u0027s by keeping coal and driving cars. Adding sun panels and windmills is actually adding pollution due to manufacturing, transportation and so on. Nuclear power would actually replace that biggest polluter and save us from adding pollution with sun panels and windmills. It\u0027s too late now to reverse the ongoing effects, but if we\u0027d begun going nuclear in the 60\u0027s and 70\u0027s we wouldn\u0027t have killed all those 125 million people. But here we are 50\u002B years later and we\u0027re still not replacing the big ass coal plants. \u003C/p\u003E\u003Cp\u003E2. \u0022How to predict future taxation? ... Yeah, well all it took here was one government change and 4 years and the sun panel market changed for the worse.\u003C/p\u003E\u003Cp\u003EPS: I wonder how much land has been \u0022rendered inhabitable by humans\u0022 due to windmills. They make noise you know, enough to negatively affect sleep and significantly lowers real estate value.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-12T10:54:09Z\u0022 title=\u002206/12/2014 10:54  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 12, 2014\u003C/time\u003E by 78stonewobble\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Reddragon","CreatedById":66937,"CreatedDateTime":"2014-06-12T11:01:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EPS: I wonder how much land has been \u0022rendered inhabitable by humans\u0022 due to windmills. They make noise you know, enough to negatively affect sleep and significantly lowers real estate value.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGermany is building windmill parks along it\u0027s shoreline in the sea. That doesn\u0027t make any land \u0027inhabitable\u0027. Of course, not every country could do the same but it\u0027s a good solution and it could be exported too.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-06-12T11:14:09Z","Content":"\n\u003Cp\u003EIt is also nonsense that we have a problem with land getting inhabitable due to noise. We don\u0027t need as much land as we do for growing crops. And I doubt the crops care. Apart from that, it probably isn\u0027t worse than anywhere in a city.\u003C/p\u003E\n"},{"CreatedByName":"Bagface145","CreatedById":48918,"CreatedDateTime":"2014-06-12T12:19:30Z","Content":"\n\u003Cp\u003EI really think thunderf00t does a good job explaining why they aren\u0027t possible. I really love the idea, but it\u0027s just not plausible\u003C/p\u003E\u003Cp\u003EPart 1:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/H901KdXgHs4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EPart 2:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/K3ftXinT4jI?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EPart 3:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/KI8c2f8r0UU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2014-06-12T14:16:34Z","Content":"\n\u003Cp\u003EI think that in the context of discussing the radiation surrounding Chernobyl, some may find the following youtuber interesting:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/user/bionerd23\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/user/bionerd23\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETherein you will find her literally frolicking through parts of the exclusion zone, digging up bits of nuclear fuel from the ground. \u003Cstrong\u003EWith her hands.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou want to know the kicker? She recieved less radiation on her Chernobyl trip, than on a trip to a Brazilian beach.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-12T14:22:04Z\u0022 title=\u002206/12/2014 02:22  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 12, 2014\u003C/time\u003E by pxi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-06-12T15:11:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWind generator cost half than nuclear, they are renowable and safe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you could point me to a wind generator that produces as much electricity as a nuclear plant...\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo fukushima and chernobyl or other accidents are not good arguments against? What else you need? Blow up half planet? This is stupid.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn addition to Vger\u0027s, accurate comment, I\u0027d like to point out that there was Zero loss of life due to Fukushima, and the loss of life at Chernobyl was less than 30. There were more fatalities in the wind industry in England in 2011 and 2012 than the worst 2 nuclear energy events in history. In fact, wind has 150 deaths per trillion KWH but nuclear has only 90 (INCLUDING Chernobyl).\u003C/p\u003E\u003Cp\u003ESo we should shut down wind, Right? Because the ecological impact is also pretty severe.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-12T20:15:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003EI\u0027d like to point out that there was Zero loss of life due to Fukushima\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIIRC there were two workers killed at the plant during the attempts to manage the incident (although not due to radiation). There would (assuming the linear no threshold model) also be some extra deaths expected whenever you release a significant amount of radioactivity, although at the levels of Fukushima they wouldn\u0027t be directly detectable over normal cancer rates.\u003C/p\u003E\u003Cp\u003EHowever, in the context of the surrounding tsunami disaster that was occurring and killed many thousands of people, the release of radiation from Fukushima was almost completely inconsequential.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-06-12T20:55:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Cost_of_electricity_by_source\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Cost_of_electricity_by_source\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat page pegs the total cost of nuclear power as \u003Cstrong\u003Eless\u003C/strong\u003E than solar and offshore wind, not more. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mdatspace\u0022 data-cite=\u0022mdatspace\u0022\u003E\u003Cdiv\u003EWe have enough data. Most geothermal plants are located on hot rock, not fault lines. A good example? The geysers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI said most of the best \u003Cstrong\u003Eplaces\u003C/strong\u003E for geothermal is near fault lines, not the actual plants themselves. You need to into read harder.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-06-12T21:02:20Z","Content":"\n\u003Cp\u003EThe total cost of nuclear is somewhat off by not accounting (or not being able to account) for the cost of century-long storage.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-06-12T21:21:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZetaX\u0022 data-cite=\u0022ZetaX\u0022\u003E\u003Cdiv\u003EThe total cost of nuclear is somewhat off by not accounting (or not being able to account) for the cost of century-long storage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou stick it in concrete. It\u0027s not like you need to keep the lights on or something. Or even \u003Cstrong\u003Ehave\u003C/strong\u003E lights.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-06-12T21:46:29Z","Content":"\n\u003Cp\u003EJust sticking it in conrete won\u0027t work. You need to throw it somewhere safe, and the past has shown that it happens way to often that it needs to be relocated due to ground water, fractures or whatever.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-06-12T21:50:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EThe ratio of accidents is nowhere near high enough to declare nuclear power unsafe. \u003Cp\u003EThe kind of paranoia that spreads after even one incident is staggering. All school buses must now stop in front of train tracks because ONE bus got hit by a train when the warning gates failed. One.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is 435 Nuclear reactors in the world, 99 of them had an accident. This mean 1 each 5. If you only take into account the major disasters with INES\u0026gt;4 is 16. This mean 1 each 27 had a major disaster.\u003C/p\u003E\u003Cp\u003ENow lets compare it with other activities that are considered dangerous like oil transportation by sea.\u003C/p\u003E\u003Cp\u003EThere was 7600 considerable accidentes in history, so if we take that number and we figure out how possible is that 1 ship had an accident in its life-span is a lot lower than the nuclear plant example.\u003C/p\u003E\u003Cp\u003EWhat you would said next? That war is safe? \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003E1. Global warming is estimated to indirectly cost 5 million lives every year from the year 2025-2050. That\u0027s 125 million lives over all. That\u0027s by keeping coal and driving cars. Adding sun panels and windmills is actually adding pollution due to manufacturing, transportation and so on. Nuclear power would actually replace that biggest polluter and save us from adding pollution with sun panels and windmills. It\u0027s too late now to reverse the ongoing effects, but if we\u0027d begun going nuclear in the 60\u0027s and 70\u0027s we wouldn\u0027t have killed all those 125 million people. But here we are 50\u002B years later and we\u0027re still not replacing the big ass coal plants. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you are saying that if we add wind generators to remplace coal plants we are adding more pollution than remplace the coal plant with a new nuclear reactor???\u003C/p\u003E\u003Cp\u003EI already told you, wind generators cost the half of a nuclear reactor for the same power output. Also the cost is a good guide to measure the pollution produced in the manufacture process. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E2. \u0022How to predict future taxation? ... Yeah, well all it took here was one government change and 4 years and the sun panel market changed for the worse.\u003Cp\u003EPS: I wonder how much land has been \u0022rendered inhabitable by humans\u0022 due to windmills. They make noise you know, enough to negatively affect sleep and significantly lowers real estate value.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbout predict future taxation, I refused to explain something so simple again.\u003C/p\u003E\u003Cp\u003ENoice?? That is your last card? \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/zKgN2G9d0dc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/pgPLubeVcD8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/EFt74TdmkPk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/roQjHWlxDF0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAnd why you would had trouble to sleep? Someone would install a wind turbine in your house roof? You dont have any road or car in from of your house?\u003C/p\u003E\u003Cp\u003EIf someone wants to put a wind turbine in your farm, they paid you 3000 U$S each for month. Seems a really good deal. I never hear nobody being paided for live close to a traffic road.\u003C/p\u003E\u003Cp\u003EWhat about the kitegen approach, they produce noice too?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZetaX\u0022 data-cite=\u0022ZetaX\u0022\u003E\u003Cdiv\u003EIt is also nonsense that we have a problem with land getting inhabitable due to noise. We don\u0027t need as much land as we do for growing crops. And I doubt the crops care. Apart from that, it probably isn\u0027t worse than anywhere in a city.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow my link videos show, you are correct.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pxi\u0022 data-cite=\u0022pxi\u0022\u003E\u003Cdiv\u003EI think that in the context of discussing the radiation surrounding Chernobyl, some may find the following youtuber interesting:\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/user/bionerd23\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/user/bionerd23\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETherein you will find her literally frolicking through parts of the exclusion zone, digging up bits of nuclear fuel from the ground. \u003Cstrong\u003EWith her hands.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou want to know the kicker? She recieved less radiation on her Chernobyl trip, than on a trip to a Brazilian beach.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can show you many videos of \u0022scientist\u0022 that give prof that Global Warming is a myth. What is that mean? It means that someone paid them money or they are dumb.\u003C/p\u003E\u003Cp\u003EEvery time that I post data, it was from International Organizations, what are yours sources? Tabloids, bloogers, solitary researchers?\u003C/p\u003E\u003Cp\u003EAnd even if now is habitable, what was the cost to relocate an entire city? Without count the multiple death.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003EIf you could point me to a wind generator that produces as much electricity as a nuclear plant...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOMG, I really need to explain this?\u003C/p\u003E\u003Cp\u003ENobody is saying that a single wind generator produce as a nuclear reactor!\u003C/p\u003E\u003Cp\u003EI am saying that 1GW Wind Farm cost less money than 1GW nuclear plant.\u003C/p\u003E\u003Cp\u003EThere is no country in the world where Nuclear energy cost less than Wind. In some places is HALF the price of nuclear. \u003C/p\u003E\u003Cp\u003EIs clear enoght?\u003C/p\u003E\u003Cp\u003EI can give you the link of the world nuclear sociaty (they promote nuclear of course), in that page they show that wind energy cost a 15% more than nuclear, but in small letters they also said that all external cost as operation, uranium and wastes, maintenance are not in included in the cost.\u003C/p\u003E\u003Cp\u003EAnd their use wind prices from 5 years old.\u003C/p\u003E\u003Cp\u003EI already publish all different energy cost from trusted sources.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIn addition to Vger\u0027s, accurate comment, I\u0027d like to point out that there was Zero loss of life due to Fukushima, and the loss of life at Chernobyl was less than 30. There were more fatalities in the wind industry in England in 2011 and 2012 than the worst 2 nuclear energy events in history. In fact, wind has 150 deaths per trillion KWH but nuclear has only 90 (INCLUDING Chernobyl).\u003Cp\u003ESo we should shut down wind, Right? Because the ecological impact is also pretty severe.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHAHAHAHAHAHA LOL X3\u003C/p\u003E\u003Cp\u003EI do not know whether to laugh or mourn. How can you be so naive?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_nuclear_and_radiation_accidents_by_death_toll\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_nuclear_and_radiation_accidents_by_death_toll\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u00224,000 fatalities[1][2] Ã¢â‚¬â€œ Chernobyl disaster, Ukraine, April 26, 1986. 56 direct deaths (47 accident workers and nine children with thyroid cancer) and it is estimated that there were 4,000 extra cancer deaths among the approximately 600,000 most highly exposed people.[3]\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe World Health Organization (WHO) suggests it could reach 4,000 civilian deaths, a figure which does not include military clean-up worker casualties.[5] A 2006 report predicted 30,000 to 60,000 cancer deaths as a result of Chernobyl fallout.[6] A Greenpeace report puts this figure at 200,000 or more.[7] A disputed Russian publication, Chernobyl, concludes that 985,000 premature cancer deaths occurred worldwide between 1986 and 2004 as a result of radioactive contamination from Chernobyl.[8]\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOnly 28 years have passed since the accident, so the list is not complete.\u003C/p\u003E\u003Cp\u003EHow can you prof if someone die by natural cancer or by chernobyl causes?\u003C/p\u003E\u003Cp\u003EEasy, you had statistics from the average of cancer death in some location, if that average increase drastically there is only one explanation.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EPhoenix_ca:\u003C/strong\u003E That page pegs the total cost of nuclear power as less than solar and offshore wind, not more. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is the total system cost from OFF SHORE. What about ON SHORE? is always less like I SAID.\u003C/p\u003E\u003Cp\u003EIn fact you can see more values down when it said that the cost of mw/h is less than half in Wind.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-12T22:01:05Z\u0022 title=\u002206/12/2014 10:01  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 12, 2014\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-06-12T22:05:14Z","Content":"\n\u003Cp\u003EIgnore, I did bad math and now I look stupid.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-12T22:40:18Z\u0022 title=\u002206/12/2014 10:40  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 12, 2014\u003C/time\u003E by The Jedi Master\u003C/strong\u003E\n\u003Cbr\u003Esee above\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-12T22:14:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003ELets all just stop for a moment and think about this.\u003Cp\u003ETotal length of all roadways in America: 6,341,421 km\u003C/p\u003E\u003Cp\u003EAverage price of one (SMALL) solar panel: $9.99\u003C/p\u003E\u003Cp\u003EAverage size of one solar panel: 1X1 meters\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETotal Price: $63,414,210\u003C/strong\u003E (if I did my math right)\u003C/p\u003E\u003Cp\u003EIn a recession. Think about it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour numbers are way off. You\u0027ve only put a single $10 panel on each km of roadway.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-06-12T22:39:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EYour numbers are way off. You\u0027ve only put a single $10 panel on each km of roadway.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhoops... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-06-12T22:57:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EThere is 435 Nuclear reactors in the world, 99 of them had an accident. This mean 1 each 5. If you only take into account the major disasters with INES\u0026gt;4 is 16. This mean 1 each 27 had a major disaster.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAn INES \u0026gt;4 rating is not a \u0022major disaster\u0022: it is an \u0022accident with local consequences,\u0022 at worst killing a few. For a major disaster, see INES \u0026gt;5.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENow lets compare it with other activities that are considered dangerous like oil transportation by sea.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet\u0027s not: we\u0027re comparing power sources, not activities in general. Let\u0027s instead consider wind power. Ignoring the Chernobyl accident\u0027s extra cancer deaths because the estimates thereof vary from four thousand to almost a million and could make the number of deaths from any power source infinite, I found that nuclear power accidents have killed fewer people in history (\u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_nuclear_and_radiation_accidents_by_death_toll\u0022 rel=\u0022external nofollow\u0022\u003E136\u003C/a\u003E) than wind power accidents killed last year \u003Ca href=\u0022http://www.caithnesswindfarms.co.uk/accidents.pdf\u0022 rel=\u0022external nofollow\u0022\u003E(~160)\u003C/a\u003E. Should wind power keep killing at this rate (which actually will increase with the number of turbines) and we include the extra cancer deaths from Chernobyl, wind power will out-kill nuclear power in twenty-five years.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo you are saying that if we add wind generators to remplace coal plants we are adding more pollution than remplace the coal plant with a new nuclear reactor???\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENuclear power plants produce almost no pollution because they are few, power themselves, and yearly each produce about a few tons of waste--replacement parts and ludicrious safety standards included. Whereas wind turbines require constant, expensive maintenance and must be built by the hundreds, further increasing cost to life, limb, and ledger.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI already told you, wind generators cost the half of a nuclear reactor for the same power output. Also the cost is a good guide to measure the pollution produced in the manufacture process. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd where will they be built? Also, coal is far cheaper than wind and produces enormous pollution.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAbout predict future taxation, I refused to explain something so simple again.\u003C/p\u003E\u003Cp\u003ENoice?? That is your last card? \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/zKgN2G9d0dc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/pgPLubeVcD8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/EFt74TdmkPk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/roQjHWlxDF0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAnd why you would had trouble to sleep? Someone would install a wind turbine in your house roof? You dont have any road or car in from of your house?\u003C/p\u003E\u003Cp\u003EIf someone wants to put a wind turbine in your farm, they paid you 3000 U$S each for month. Seems a really good deal. I never hear nobody being paided for live close to a traffic road.\u003C/p\u003E\u003Cp\u003EWhat about the kitegen approach, they produce noice too?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA wind turbine is not only noisy but also can just fall over, crushing whatever lies beneath it and partly exploding into shrapnel; they therefore render huge swaths of land uninhabitable to all but the many people foolishly living near them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI can show you many videos of \u0022scientist\u0022 that give prof that Global Warming is a myth. What is that mean? It means that someone paid them money or they are dumb.\u003C/p\u003E\u003Cp\u003EEvery time that I post data, it was from International Organizations, what are yours sources? Tabloids, bloogers, solitary researchers?\u003C/p\u003E\u003Cp\u003EAnd even if now is habitable, what was the cost to relocate an entire city? Without count the multiple death.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E-We can say the same to you about your scientists.\u003C/p\u003E\u003Cp\u003E-See my data.\u003C/p\u003E\u003Cp\u003E-Chernobyl was wisely not built near a city.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOMG, I really need to explain this?\u003C/p\u003E\u003Cp\u003ENobody is saying that a single wind generator produce as a nuclear reactor!\u003C/p\u003E\u003Cp\u003EI am saying that 1GW Wind Farm cost less money than 1GW nuclear plant.\u003C/p\u003E\u003Cp\u003EThere is no country in the world where Nuclear energy cost less than Wind. In some places is HALF the price of nuclear. \u003C/p\u003E\u003Cp\u003EIs clear enoght?\u003C/p\u003E\u003Cp\u003EI can give you the link of the world nuclear sociaty (they promote nuclear of course), in that page they show that wind energy cost a 15% more than nuclear, but in small letters they also said that all external cost as operation, uranium and wastes, maintenance are not in included in the cost.\u003C/p\u003E\u003Cp\u003EAnd their use wind prices from 5 years old.\u003C/p\u003E\u003Cp\u003EI already publish all different energy cost from trusted sources.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs money more important than the workers\u0027 lives? I would gladly pay more for safe power: would you?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHAHAHAHAHAHA LOL X3\u003C/p\u003E\u003Cp\u003EI do not know whether to laugh or mourn. How can you be so naive?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_nuclear_and_radiation_accidents_by_death_toll\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_nuclear_and_radiation_accidents_by_death_toll\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u00224,000 fatalities[1][2] Ã¢â‚¬â€œ Chernobyl disaster, Ukraine, April 26, 1986. 56 direct deaths (47 accident workers and nine children with thyroid cancer) and it is estimated that there were 4,000 extra cancer deaths among the approximately 600,000 most highly exposed people.[3]\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe World Health Organization (WHO) suggests it could reach 4,000 civilian deaths, a figure which does not include military clean-up worker casualties.[5] A 2006 report predicted 30,000 to 60,000 cancer deaths as a result of Chernobyl fallout.[6] A Greenpeace report puts this figure at 200,000 or more.[7] A disputed Russian publication, Chernobyl, concludes that 985,000 premature cancer deaths occurred worldwide between 1986 and 2004 as a result of radioactive contamination from Chernobyl.[8]\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOnly 28 years have passed since the accident, so the list is not complete.\u003C/p\u003E\u003Cp\u003EHow can you prof if someone die by natural cancer or by chernobyl causes?\u003C/p\u003E\u003Cp\u003EEasy, you had statistics from the average of cancer death in some location, if that average increase drastically there is only one explanation.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile some people gawked at Chernobyl and its staggering death toll, wind power crushed them: literally. Wind accidents are routine and expensive, and at the current rate of wind power expansion, we will have to either consign huge swaths of land to power generation or literally live under the blades.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-06-12T23:21:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EIIRC there were two workers killed at the plant during the attempts to manage the incident (although not due to radiation). There would (assuming the linear no threshold model) also be some extra deaths expected whenever you release a significant amount of radioactivity, although at the levels of Fukushima they wouldn\u0027t be directly detectable over normal cancer rates.\u003Cp\u003EHowever, in the context of the surrounding tsunami disaster that was occurring and killed many thousands of people, the release of radiation from Fukushima was almost completely inconsequential.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not even really fair to count Fukishima as a \u0022nuclear disaster,\u0022 at least in terms of excuses to not keep using nuclear power. From that perspective, it would be just as logical to say we can\u0027t have nuke plants because a meteor might hit one. Fukishima was more or less a perfect storm.\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2014-06-12T23:28:15Z","Content":"\n\u003Cp\u003EI think that these would be expensive. Fine, they may pay for themselves... but remember lighting up those LEDs at night will BURN through power. I think they might barely make breakeven just for power output.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-06-12T23:39:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00223_bit\u0022 data-cite=\u00223_bit\u0022\u003E\u003Cdiv\u003EI think that these would be expensive. Fine, they may pay for themselves... but remember lighting up those LEDs at night will BURN through power. I think they might barely make breakeven just for power output.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy hideously-bad, ignorant estimate indicates that the panels would waste enormous amounts of electricity:\u003C/p\u003E\u003Cp\u003EA high-power LED uses \u003Ca href=\u0022https://en.wikipedia.org/wiki/Light-emitting_diode#Efficiency_and_operational_parameters\u0022 rel=\u0022external nofollow\u0022\u003Eone watt.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELet night, on average, last twelve hours.\u003C/p\u003E\u003Cp\u003EA high power LED therefore uses twelve watt-hours per day.\u003C/p\u003E\u003Cp\u003ELet each panel have five LEDs.\u003C/p\u003E\u003Cp\u003EEach panel therefore uses sixty watt-hours per day.\u003C/p\u003E\u003Cp\u003ESunlight provides ~1kW/m^2\u003C/p\u003E\u003Cp\u003ELet each panel have an area of 0.1m^2 and an efficiency of 0.3\u003C/p\u003E\u003Cp\u003EEach panel therefore produces ~33 watt-hours per day.\u003C/p\u003E\u003Cp\u003E60 watt-hours/day - 33 watt-hours/day = -27 watt-hours/day\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-06-12T23:45:54Z","Content":"\n\u003Cp\u003EAnd there is absolutely no reason to have every panel shining it\u0027s LED light all night. Thus no energy lost here.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-06-13T00:59:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZetaX\u0022 data-cite=\u0022ZetaX\u0022\u003E\u003Cdiv\u003EAnd there is absolutely no reason to have every panel shining it\u0027s LED light all night. Thus no energy lost here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat would the panels\u0027 LEDs do instead?\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"}]}