{"TopicId":74671,"ForumId":44,"TopicTitle":"space warfare","CreatedByName":"Stilgar2300","CreatedById":46325,"CreatedDateTime":"2014-06-10T16:01:00Z","PageNum":1,"Articles":[{"CreatedByName":"Stilgar2300","CreatedById":46325,"CreatedDateTime":"2014-06-10T16:01:00Z","Content":"\n\u003Cp\u003ESo my question is how would it work? I know it wouldn\u0027t be like the movies, but would it even be possible? The defending party would always be at an advantage since the attacker is trying to hit a high speed object fired from another high speed object. This thread isn\u0027t about weaponizing ksp, just the theory behind space based combat\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-06-10T16:08:40Z","Content":"\n\u003Cp\u003Ehaving read the first few halo books, they have some great discriptions of space combat, but im not sure if they are realistic. the maneuvering was questionable.\u003C/p\u003E\u003Cp\u003Ehope this leads to dialogue and isnt locked, maybe this is for the science lab?\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-06-10T16:09:06Z","Content":"\n\u003Cp\u003ECan you rendezvous with an object in orbit?\u003C/p\u003E\u003Cp\u003ERendezvous with extreme prejudice, it almost certainly can\u0027t dodge and is fragile.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-06-10T16:15:48Z","Content":"\n\u003Cp\u003ERead all the sections below \u0022Space War\u0022 on \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/spacewarintro.php\u0022 rel=\u0022external nofollow\u0022\u003Ethis site\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"warmarrer","CreatedById":112685,"CreatedDateTime":"2014-06-10T16:20:23Z","Content":"\n\u003Cp\u003EI believe in the current state of our technology it wouldn\u0027t be the defender with the advantage, but the person with the most advanced object detection/fastest computers. We\u0027re actually fairly good at making one object go to another object in space. Whoever gets the math done first fires off a couple high velocity projectiles and with no shielding technology the target is most likely destroyed.\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-06-10T16:30:00Z","Content":"\n\u003Cp\u003ECheck out the thread on \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75141-Interplanetary-WAR%21?p=1066000\u0026amp;viewfull=1#post1066000\u0022 rel=\u0022external nofollow\u0022\u003EInterplanetary War\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAlso check out \u003Ca href=\u0022https://www.youtube.com/user/MaceyDean\u0022 rel=\u0022external nofollow\u0022\u003EMacey Dean\u0027s YouTube Channel.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLnfM-w9LSGDtzy3R6gdsFO4apdt-tNolf\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-06-10T17:53:38Z","Content":"\n\u003Cp\u003EThis is more of a Science Labby kind of question, and so, moved.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2014-06-10T18:01:42Z","Content":"\n\u003Cp\u003EThere have been many discussions on the theory of space warfare, the only thing that was really agreed on is that it would be exceedingly boring. Most other aspects are highly determinate on what kind of technology the waring factions have. Everything else is a big argument on whether lasers would be better than missiles and such.\u003C/p\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-06-10T19:29:14Z","Content":"\n\u003Cp\u003EI personally really like the series \u0022Lost Fleet\u0022 by \u0027Jack Campbell\u0027 (Actually John G. Hemry) - in this series, I think it accurately describes how it takes ages to intercept, and it\u0027s over in the blink of an eye at a cumulative velocity of about 0.2 lightspeed... but then, if they were armoured and/or shielded in some way, then both sets of combatants can come round for subsequent passes, during which time they will also check how the first pass went... for both sides...\u003C/p\u003E\u003Cp\u003EIn these stories, they mainly make use of high-energy beam weapons, missiles and good old fashioned grape-shot - grape-shot in space battles as told in the stories is used in close-range battle to wear down shields and armour more than do much damage on its own - and all seem equally effective in this type of combat at different ranges.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-06-10T19:52:37Z","Content":"\n\u003Cp\u003EI would think it will be oriented around stealth and speed more than sheer firepower. If you can drop in unexpected, people won\u0027t be able to retaliate quite as well.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-06-10T20:24:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003EI would think it will be oriented around stealth and speed more than sheer firepower. If you can drop in unexpected, people won\u0027t be able to retaliate quite as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought the same until recently. But it turns out that stealth in space is absolute bogus. You can detect spaceship burns all the way out in the Kuiper belt from earth and even the faint heat signatures of dormant ships can be spotted from several AU\u0027s.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2014-06-10T20:37:46Z","Content":"\n\u003Cp\u003ESpace warfare is gonna all be about diplomacy. \u003C/p\u003E\u003Cp\u003EIt\u0027s impossible to hide, and fairly impossible to defend yourself. \u003C/p\u003E\u003Cp\u003ESo basically you sit there, stare at each others with big guns, and let the diplomats talk, when the diplomacy breaks down....\u003C/p\u003E\u003Cp\u003ESide A fires big weapon A, Side B, detects big weapon A in route.\u003C/p\u003E\u003Cp\u003ESide B fires their big weapon B and attempts to dodge. \u003C/p\u003E\u003Cp\u003ESide A detects big weapon B and attempts to dodge.\u003C/p\u003E\u003Cp\u003EBig weapon A corrects course, Side B is destroyed\u003C/p\u003E\u003Cp\u003EBig weapon B corrects coruse, Side A is destroyed\u003C/p\u003E\u003Cp\u003EDiplomats return to the table if they\u0027re still alive.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-06-10T20:45:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moon Goddess\u0022 data-cite=\u0022Moon Goddess\u0022\u003E\u003Cdiv\u003ESpace warfare is gonna all be about diplomacy. \u003Cp\u003EIt\u0027s impossible to hide, and fairly impossible to defend yourself. \u003C/p\u003E\u003Cp\u003ESo basically you sit there, stare at each others with big guns, and let the diplomats talk, when the diplomacy breaks down....\u003C/p\u003E\u003Cp\u003ESide A fires big weapon A, Side B, detects big weapon A in route.\u003C/p\u003E\u003Cp\u003ESide B fires their big weapon B and attempts to dodge. \u003C/p\u003E\u003Cp\u003ESide A detects big weapon B and attempts to dodge.\u003C/p\u003E\u003Cp\u003EBig weapon A corrects course, Side B is destroyed\u003C/p\u003E\u003Cp\u003EBig weapon B corrects coruse, Side A is destroyed\u003C/p\u003E\u003Cp\u003EDiplomats return to the table if they\u0027re still alive.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENjyarf... Just because we\u0027ve had nuclear weapons, doesn\u0027t mean people haven\u0027t found a way to fight the last 60 years, on pretty big scales even. \u003C/p\u003E\u003Cp\u003EWhatever sides there are in the future and even if we can agree on not wiping ourselves out by not using the big weapons... I\u0027ll be pessimestic and bet that someone somewhere would want someone else dead for what ever reason or just to self defend.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-10T22:07:13Z","Content":"\n\u003Cp\u003EMost discussions on this topic are useless unless we determine what the technological level of the people fighting is.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-10T22:39:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003ERead all the sections below \u0022Space War\u0022 on \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/spacewarintro.php\u0022 rel=\u0022external nofollow\u0022\u003Ethis site\u003C/a\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t take what\u0027s written there as gospel. The section about stealth in particular seems rather flawed due to the fact that it assumes (without any justification) that the vehicles would be manned.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-10T23:14:02Z","Content":"\n\u003Cp\u003EEven if it was a drone, you either drift in space for months on end, any engine burn would generate heat which would be detectable until you could radiate the heat.\u003C/p\u003E\n"},{"CreatedByName":"warmarrer","CreatedById":112685,"CreatedDateTime":"2014-06-11T00:21:47Z","Content":"\n\u003Cp\u003EGiven the fact that we already possess point defense systems (both ballistic and laser) that can vaporise incoming missiles I\u0027d wager space warfare would return to ballistic weaponry of some kind. The distances involved in most combat would make it difficult to sneak any sort of self propelled device past enemy defenses. \u003C/p\u003E\u003Cp\u003EMaybe even some metal storm kind of device that launches dormant projectiles that self activate guidance systems after a programmable time.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/ZFjGbOyd2ek?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003EImagine if that weapon fired ballistic shells. Those shells activate at a pre-set distance from the enemy ships (regulated by a timer or transmitted signal). Using very small thrusters they orient themselves to launch an explosive payload on an adjusted ballistic trajectory. These rounds are difficult to detect because for most of their lives they travel inactive, and randomly changing course upon detecting launch doesn\u0027t guarantee safety because the explosive payload is deployed on a corrected trajectory at a much closer range, giving you far less response time. That combined with the number of shells may overwhelm any point defense system.\u003C/p\u003E\u003Cp\u003EI know it\u0027s like a gun shooting another gun that shoots a bullet at the target, but it seems like an example of the creative means you may have to take in space warfare.\u003C/p\u003E\u003Cp\u003EDrones could be used in a similar way. Launch them as a projectile and activate at attack range.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-06-11T06:31:04Z","Content":"\n\u003Cp\u003EI think that, if we talk about going beyond just destroying satelites in LEO, then we will only be fighting over something relatively valuable. Meaning probably valuable enough to have people out there repairing also and those can then get in the way of anyone trying to destroying whatever valuable thingymobob. \u003C/p\u003E\u003Cp\u003ESo we\u0027ll have to think humans into it somewhat. \u003C/p\u003E\u003Cp\u003EPersonally I think it will be a relatively \u0022slow\u0022 (sailing ships vs. jet fighters) and as dangerous as submarine warfare (hostile environment and direct hit will be rather dangerous to the entire ship). \u003C/p\u003E\u003Cp\u003EHmm *ponders* Stealth will still be around in some fashion. Ie. if you use missiles you want them to be hard to acquire on radar and other spectrums until it\u0027s too late anyway. Presumably you\u0027d also use the vast amounts of real estate to hide anyway you can, preferably behind something large.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-11T07:21:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EEven if it was a drone, you either drift in space for months on end, any engine burn would generate heat which would be detectable until you could radiate the heat.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, no stealth is foolproof. That\u0027s why they call it low-observable technology, not unobservable. Stealthy aircraft become very visible when they open their weapons bays for example, or if they\u0027re not very careful about their emissions.\u003C/p\u003E\u003Cp\u003EIn very low orbits an attacker would only pop up above the horizon at quite close range. Engagement ranges could be a lot shorter and times a lot quicker than some people seem to assume. The long range blue sky engagement is only one of several likely scenarios. There\u0027s likely to be scope for a wily attacker to get the bounce on the target.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-06-11T07:53:10Z","Content":"\n\u003Cp\u003EDo we really have to put up with the same threads getting posted every week or two?\u003C/p\u003E\u003Cp\u003EOP: please look up the forum before posting new topics. There have been half a dozen topics about space warfare, battle cruisers, space cannons and other such nonsense. Starting with this one:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75141-Interplanetary-WAR!?p=1066000\u0026amp;viewfull=1#post1066000\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/75141-Interplanetary-WAR!?p=1066000\u0026amp;viewfull=1#post1066000\u003C/a\u003E\u003C/p\u003E\n"}]}