{"TopicId":75549,"ForumId":44,"TopicTitle":"Space elevators a fantastic idea that maybe someday could be reality?","CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-06-20T12:03:50Z","PageNum":4,"Articles":[{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-07-04T07:50:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Everten P.\u0022 data-cite=\u0022Everten P.\u0022\u003E\u003Cdiv\u003EWhy is the picture in the O.P. In Indonesia? \u003Cp\u003EAnyway I know how to make one, just get a satellite to orbit in Geosynchronous orbit and have it carry special graphene wire 390km of it, when the wire hits the ground carbon nanotubes would go through the side cables to reinforce it and keep it up. Send stuff up and build a station. Also it should be stronger if the cables supported a circular cart.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s always been the conceptual plan for building a space elevator, except that it\u0027s 36000km, not 390km. Do you have any idea how much a 36000km spool of graphene or carbon nanotube wire weighs?\u003C/p\u003E\u003Cp\u003EOh, and actually, you need twice that weight, because as you unspool the tether downward, you need to unspool a counterweight tether in the other direction to keep the center of mass at constant GEO altitude.\u003C/p\u003E\n"},{"CreatedByName":"Everten P.","CreatedById":103089,"CreatedDateTime":"2014-07-04T14:55:05Z","Content":"\n\u003Cp\u003ESorry for the height problem typing after I went to buffalo wild wings makes it hard to do anything. lol anyway if the wire was attached quickly wouldn\u0027t centripetal force straighten it along with the nanotubes running up the sides? also a way you could get up is by having the satellite pull on the carts. It\u0027s not going to affect the satellite because it is applying structural force down on the and this would mean that only a few carts can be pulled up at a time but it would mean that heavier cargo can be pulled up. If I am wrong about anything forgive me I am kinda new to astrophysics but I know a bit.\u003C/p\u003E\u003Cp\u003EAlso the nanotubes would come from the ground up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-04T15:03:14Z\u0022 title=\u002207/04/2014 03:03  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 4, 2014\u003C/time\u003E by Everten P.\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"randomness5555","CreatedById":53367,"CreatedDateTime":"2014-07-04T15:15:22Z","Content":"\n\u003Cp\u003ESimple answer-everyone is talking about building what is essentially a long cable attached to a small station type thingy at the other end. How about a sort of cone shaped tower-maybe 100 miles wide, 80-90 tall and a width of maybe 1 at the top. It would be large enough for the top floors to be outside the atmosphere, but would have such a large footprint it could happilly stand up without super-materials. Okay, so it would probably need some very special materials still, but it wouldn\u0027t require them to be as strong as a cable would have to be. My thought would be that it would also be a self contained city and research base. It would also probably need to be an international project due to the immense cost-but I think cheap space travel would be worth it. My other idea would be that at this scale you could run ordinary-ish train tracks up the tower to get cargo to space.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-07-04T15:22:13Z","Content":"\n\u003Cp\u003EHow does an 80-mile-high tower lower the cost of reaching orbit ? \u003C/p\u003E\u003Cp\u003EAlso, the sheer mass of the tower would crush itself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-04T15:24:25Z\u0022 title=\u002207/04/2014 03:24  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 4, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-04T16:02:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EHow does an 80-mile-high tower lower the cost of reaching orbit ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPffftt... Because we all know that space starts 60 miles up and that you float when you get there. Heck, some kids showed NASA a thing or two by sending a lego guy into space with a balloon. NASA. What a bunch of rocket scientists! lol\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-07-04T21:03:56Z","Content":"\n\u003Cp\u003EThere is a mountian range in south america that has a peak almost on the equator that\u0027s the furthest point on the ground from the center of earth. (sea level is lower around everest, so everest still has a height above sea level advantage)\u003C/p\u003E\u003Cp\u003EThis mountian, being solid rock, is stable where a hollow tower might not. Build a railway to the top, and it would be one of the best launch sites on earth, or the best place to site a space elevator.\u003C/p\u003E\u003Cp\u003EUnfortunately it\u0027s in the middle of a third world nation with no money or interest in a space program.\u003C/p\u003E\n"},{"CreatedByName":"randomness5555","CreatedById":53367,"CreatedDateTime":"2014-07-05T10:09:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EHow does an 80-mile-high tower lower the cost of reaching orbit ? \u003Cp\u003EAlso, the sheer mass of the tower would crush itself.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay-first, I never said it would make it cheaper. It\u0027s just an alternate idea of how to do it.\u003C/p\u003E\u003Cp\u003EAs for the mass thing-how do you know? Who knows what materials we\u0027d have by the time it came to actually building it-which would not be for a few decades at least.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-05T13:02:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022randomness5555\u0022 data-cite=\u0022randomness5555\u0022\u003E\u003Cdiv\u003EAs for the mass thing-how do you know? Who knows what materials we\u0027d have by the time it came to actually building it-which would not be for a few decades at least.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m guessing you\u0027re not an engineer? As materials science (basically chemistry and physics) has advanced over the past decades, we have learned a lot about what makes the strong ones strong, the fatigue resistant ones fatigue resistant, the creep resistant ones creep resistant, etc. We also have a better idea of the limits of material science.\u003C/p\u003E\u003Cp\u003EYou are talking about building a structure two or more orders of magnitude taller and wider than anything ever built before. There is no doubt that would take major innovations in materials science to achieve. Yet the engineers who designed the current tallest structures in the world aren\u0027t dummies. They are already using the strongest materials that are currently available, and materials that are butting up against the limits of what is physically possible.\u003C/p\u003E\u003Cp\u003ECarbon nanotubes are promising and they may even be the breakthrough we need to make a space elevator or the type of structure you mentioned possible. I wouldn\u0027t hold my breath though.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-07-05T15:14:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EPffftt... Because we all know that space starts 60 miles up and that you float when you get there. Heck, some kids showed NASA a thing or two by sending a lego guy into space with a balloon. NASA. What a bunch of rocket scientists! lol\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, if you can get a stable platform that high, it really reduces the problem of air resistance if you want to launch something using a cannon or railgun. It\u0027s building something that high that\u0027s your problem\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-07-05T23:45:29Z","Content":"\n\u003Cp\u003EA space elevator is the future equivalent of a bullet train: In theory, it\u0027s the best possible solution, but in practice, it\u0027s the next thing to worthless.\u003C/p\u003E\u003Cp\u003E Ultimately, space is about dollars spent per pound of cargo in orbit. Even if the space elevator puts cargo up there for free, you\u0027d never get enough cargo up it to justify the R\u0026amp;D cost.\u003C/p\u003E\u003Cp\u003EJMO,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"TeeGee","CreatedById":82434,"CreatedDateTime":"2014-07-05T23:49:27Z","Content":"\n\u003Cp\u003EGetting payloads up into GSO without ANY use of expendable rockets will be a massive boost in orbital access. It would thus make launches cheaper and even accessible to average folk. Sure the initial structure will be expensive (super expensive) but because it will be sooooo easy (and safer) to get payloads into orbit, companies would rather use the elevator than rockets. Rockets explode.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-07-06T00:13:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TeeGee\u0022 data-cite=\u0022TeeGee\u0022\u003E\u003Cdiv\u003EGetting payloads up into GSO without ANY use of expendable rockets will be a massive boost in orbital access. It would thus make launches cheaper and even accessible to average folk. Sure the initial structure will be expensive (super expensive) but because it will be sooooo easy (and safer) to get payloads into orbit, companies would rather use the elevator than rockets. Rockets explode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Likewise, if we were to commit to building unique roads from every building on Earth to every other building, there would never be any traffic and transportation costs would plummet.\u003C/p\u003E\u003Cp\u003E There are concepts that are so outrageously expensive at the outset that they can never pay for themselves through use.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Everten P.","CreatedById":103089,"CreatedDateTime":"2014-07-06T04:54:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003ELikewise, if we were to commit to building unique roads from every building on Earth to every other building, there would never be any traffic and transportation costs would plummet.\u003Cp\u003E There are concepts that are so outrageously expensive at the outset that they can never pay for themselves through use.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E First, building roads between buildings is nothing like building a space elevator, space elevators are far more practical. Second there would be loads of traffic in the 24 hours after it was built and declared safe, I am sure that NASA would use this to transport goods from earth to the ISS or beyond. This would also mean ( after things calmed down ) that ships could be built in space and would become the luxury sports cars of today, also the thing would be very expensive ( as we all should know ) because the thing would have to stretch from ground level to geosynchronous orbit (as to use centripetal force to pull it from earth and make it more stable) so that means that anything built there can stay in orbit almost indefinitely so permanent colonies can be built (as to provide a human habitat) so that orbital factories and power plants have a strong workforce. All of this WILL cost LOADS of money but if that money can firmly place the human race in space then I am all for it. \u003C/p\u003E\u003Cp\u003EP.S. Splashy don\u0027t be a party pooper by stating facts that some will agree with but most of us know \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-07-06T05:13:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Everten P.\u0022 data-cite=\u0022Everten P.\u0022\u003E\u003Cdiv\u003EFirst, building roads between buildings is nothing like building a space elevator, space elevators are far more practical. Second there would be loads of traffic in the 24 hours after it was built and declared safe, I am sure that NASA would use this to transport goods from earth to the ISS or beyond. This would also mean ( after things calmed down ) that ships could be built in space and would become the luxury sports cars of today, also the thing would be very expensive ( as we all should know ) because the thing would have to stretch from ground level to geosynchronous orbit (as to use centripetal force to pull it from earth and make it more stable) so that means that anything built there can stay in orbit almost indefinitely so permanent colonies can be built (as to provide a human habitat) so that orbital factories and power plants have a strong workforce. All of this WILL cost LOADS of money but if that money can firmly place the human race in space then I am all for it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s still several big \u0027if\u0027s and \u0027maybe\u0027s. Going to GSO still needs plenty of energy, and that means constructing a major power station nearby to power the climbers (wirelessly or otherwise), or installing very powerful engines on the climbers themselves, of which I find rockets preferable.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m not convinced that a functional space elevator will be instantly crowded when it first opened, barring visitors who wanted to see launches. There\u0027s only one space station up there, and it doesn\u0027t need a lot of supplies.\u003C/p\u003E\u003Cp\u003EAlso, I haven\u0027t seen anyone pointing out that a space elevator isn\u0027t necessarily immune from NEOs or orbital debris. If unlucky enough, a single strike from an asteroid could simply cut it in two, and wreak all kinds of havoc on both sides.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-07-06T17:16:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Everten P.\u0022 data-cite=\u0022Everten P.\u0022\u003E\u003Cdiv\u003EFirst, building roads between buildings is nothing like building a space elevator, space elevators are far more practical. Second there would be loads of traffic in the 24 hours after it was built and declared safe, I am sure that NASA would use this to transport goods from earth to the ISS or beyond. This would also mean ( after things calmed down ) that ships could be built in space and would become the luxury sports cars of today, also the thing would be very expensive ( as we all should know ) because the thing would have to stretch from ground level to geosynchronous orbit (as to use centripetal force to pull it from earth and make it more stable) so that means that anything built there can stay in orbit almost indefinitely so permanent colonies can be built (as to provide a human habitat) so that orbital factories and power plants have a strong workforce. All of this WILL cost LOADS of money but if that money can firmly place the human race in space then I am all for it. \u003Cp\u003EP.S. Splashy don\u0027t be a party pooper by stating facts that some will agree with but most of us know \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Ahh, but whether or not *you* are all for it is immaterial unless *you* are going to foot the bill. You can\u0027t afford to pay for it. Even if you got together with everybody on the planet who thinks it\u0027s a neat idea and you all pooled your money, you still couldn\u0027t afford it.\u003C/p\u003E\u003Cp\u003E What you\u0027re really talking about is forcing people who don\u0027t like this idea and think it\u0027s a waste of money to pay for it against their will.\u003C/p\u003E\n"},{"CreatedByName":"Everten P.","CreatedById":103089,"CreatedDateTime":"2014-07-06T20:12:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EAhh, but whether or not *you* are all for it is immaterial unless *you* are going to foot the bill. You can\u0027t afford to pay for it. Even if you got together with everybody on the planet who thinks it\u0027s a neat idea and you all pooled your money, you still couldn\u0027t afford it.\u003Cp\u003E What you\u0027re really talking about is forcing people who don\u0027t like this idea and think it\u0027s a waste of money to pay for it against their will.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain don\u0027t be a party pooper \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. \u003C/p\u003E\u003Cp\u003EAlso I am not forcing anyone I am trying to persuade people towards it. \u003C/p\u003E\u003Cp\u003EP.S. Slashy if everyone wanted to do it cost literally would not matter. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-07-06T21:16:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso I am not forcing anyone I am trying to persuade people towards it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Don\u0027t be a party pooper\u0022 isn\u0027t a very persuasive argument IMO. YMMV.\u003C/p\u003E\n"},{"CreatedByName":"Everten P.","CreatedById":103089,"CreatedDateTime":"2014-07-08T04:08:17Z","Content":"\n\u003Cp\u003ETrue. But, I never said I was trying to persuade him also I said that because everyone was coming up with good ideas and he was just \u0022raining on the parade\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-07-08T08:30:29Z","Content":"\n\u003Cp\u003EReminding about reality isn\u0027t \u0022raining on the parade\u0022. If all you want to do is speculate about invented pseudo-scientific technobabble, then go to a Star Trek forum.\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2014-07-08T09:59:46Z","Content":"\n\u003Cp\u003EI think there are a few people here conflating \u0022Can\u0027t pay for it\u0022, \u0022Can\u0027t make the materials for it\u0022, and \u0022Can\u0027t build it due to laws of physics\u0022\u003C/p\u003E\u003Cp\u003EIt\u0027s theoretically possible to make a space elevator according to the laws of physics as we know them.\u003C/p\u003E\u003Cp\u003ECarbon nanotubes have been calculated to have the requisite strength to make it work.\u003C/p\u003E\u003Cp\u003E- The physics checks out, which means that the whole thing won\u0027t fly apart if it were to suddenly appear out of thin air, fully built and ready to operate.\u003C/p\u003E\u003Cp\u003EWe don\u0027t know how to make the materials in large enough lengths and/or quantities yet. CNT lengths will need to be at least several kilometers between defects, and we would need a reliable way to bond two CNT strands laying side-by-side with a bond of the same or stronger strength.\u003C/p\u003E\u003Cp\u003E- This is an engineering challenge, which means that it CAN be solved, given enough time. How much time? I don\u0027t know. At least 100 years, possibly 1,000.\u003C/p\u003E\u003Cp\u003EHumanity has controlled fire, invented the wheel, harnessed electricity, mastered powered flight, and plenty of other things that I\u0027m sure were thought impossible 10 years before somebody tinkering away in their garage (or cave) got it to work the first time. \u003C/p\u003E\u003Cp\u003EBut nobody will pay for it. Heck, nobody CAN pay for it.\u003C/p\u003E\u003Cp\u003EMy own ballpark estimates that I didn\u0027t do any math for say it would take ~ 20-50% of the GDP of the top 10 countries in the world, combined, for at least 10 years.\u003C/p\u003E\u003Cp\u003EAnd that\u0027s for just one elevator of marginal payload capacity. And I bet my estimates are on the cheap end for even that. Plus there\u0027s the chicken-and-egg problem of not having anything that would use that payload capacity, so there\u0027s no incentive to start building one or researching how to build one.\u003C/p\u003E\u003Cp\u003E- This one\u0027s a sociopolitical-economical challenge. I\u0027m not going to touch that one with a 35km carbon nanotube pole anchored to an asteroid. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-08T10:14:45Z\u0022 title=\u002207/08/2014 10:14  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 8, 2014\u003C/time\u003E by SciMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"randomness5555","CreatedById":53367,"CreatedDateTime":"2014-07-08T16:30:24Z","Content":"\n\u003Cp\u003EWhy is everone going on about the price? Carbon nano-tubes are pricey-atm. They might be cheaper than wool in 120 years-if they are as good as we think they will be, people will work out ways to make more for less. Besides, 80 or so miles is a long way-but we\u0027ve layed fibre optic cables longer than that across the sea-floor. as for who would use that-space station construction anyone? Or even, moonbases? Building one is impractical now-but if you could get every module into space for almost free? These things are usefull. \u003C/p\u003E\u003Cp\u003EBut honestly, Skylon\u0027s probably going to be the answer-cheaper than an elevator and you still get about 200 uses out of each one. And that\u0027s predicted to be ready by 2020 or so.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-07-08T17:15:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022randomness5555\u0022 data-cite=\u0022randomness5555\u0022\u003E\u003Cdiv\u003EBut honestly, Skylon\u0027s probably going to be the answer-cheaper than an elevator and you still get about 200 uses out of each one. And that\u0027s predicted to be ready by 2020 or so.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really wish this statement could be true, but REL\u0027s current condition at the moment doesn\u0027t hold much promise for a mass-produced SSTO vehicle within 6 years.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-07-08T17:41:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHow much time? I don\u0027t know. At least 100 years, possibly 1,000\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eknow if something can be economically viable or not depending on how efficient different approach could be, is one thing.\u003C/p\u003E\u003Cp\u003EBut make a 1000 years!!! prediction of the technological requirements needed for this purpose shows a complety lack of knowledge about the topic and how fast technology grows.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-07-08T18:46:10Z","Content":"\n\u003Cp\u003EWill it be done? Probably. Will it be done in fifty years? Probably not. At the most optimistic \u0022estimates\u0022 (With room for assumptions), we could build one at around 2080 at the \u003Cem\u003Eearliest\u003C/em\u003E. By then, a stable network of SSTO spacecraft/reusable rockets with quick turnaround rates would render the need mostly useless, unless it was a publicity stunt, but even then, it would be mostly empty. There is a limit as to how many customers want spacecraft and things sent to orbit, all of which could be handed with a dedicated network of SSTOs and reusable rockets. \u003C/p\u003E\u003Cp\u003EWe might be able to see a stratosphere spaceport, and I believe that (Or launch loops/railguns) are a much better alternative.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-08T18:49:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022randomness5555\u0022 data-cite=\u0022randomness5555\u0022\u003E\u003Cdiv\u003EWhy is everone going on about the price? Carbon nano-tubes are pricey-atm. They might be cheaper than wool in 120 years-if they are as good as we think they will be, people will work out ways to make more for less. Besides, 80 or so miles is a long way-but we\u0027ve layed fibre optic cables longer than that across the sea-floor. as for who would use that-space station construction anyone? Or even, moonbases? Building one is impractical now-but if you could get every module into space for almost free? These things are usefull. \u003Cp\u003EBut honestly, Skylon\u0027s probably going to be the answer-cheaper than an elevator and you still get about 200 uses out of each one. And that\u0027s predicted to be ready by 2020 or so.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is why we can\u0027t have nice things...\u003C/p\u003E\n"}]}