{"TopicId":76618,"ForumId":44,"TopicTitle":"How will they look like space suits for the Orion capsule","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-07-03T23:01:46Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-07-03T23:01:46Z","Content":"\n\u003Cp\u003EI\u0027m curious how they will look like space suits for NASA astronauts, if NASA decides to go back to the moon. Spacesuits from Apollo looked really good, especially the large spherical helmets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-07-04T03:39:08Z","Content":"\n\u003Cimg src=\u0022http://www.aero-news.net/images/content/aerospace/2005/mccandless-bruce-eva-nasa-astronaut-0105-1a.jpg\u0022 alt=\u0022mccandless-bruce-eva-nasa-astronaut-0105-1a.jpg\u0022\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-07-04T05:20:18Z","Content":"\n\u003Cp\u003ESomething like the Z-2 perhaps?\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-07-04T07:30:54Z","Content":"\n\u003Cp\u003EThe Z-2 suit is a technology demonstrator for planetary exploration. The suitport on the back means that it stays on the outside of the spacecraft and astronauts climb inside the suit instead of using an airlock. It\u0027s also too heavy and bulky to be carried around inside a capsule. This makes it unsuitable for in-flight activities and Orion EVAs which will be conducted by depressurizing the capsule and egressing the capsule through a relatively small hatch.\u003C/p\u003E\u003Cp\u003EWhat Orion needs is a single suit that can be reconfigurable for flight, EVA and surface operations. There was one planned for Constellation, but it was cancelled along with the rest of the program. So NASA is looking at improving the orange ACES suits that were used on the Shuttle. These were designed for emergency scenarios, so they need to modify them to make them suitable for longer EVAs.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.gizmag.com/orion-space-suit/30130/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.gizmag.com/orion-space-suit/30130/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe actual suits will probably be white instead of orange due to thermal requirements. The high-visibility orange was in case the astronauts had to bail out over the ocean, which isn\u0027t a contingency mode in Orion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-04T07:39:16Z\u0022 title=\u002207/04/2014 07:39  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 4, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"}]}