{"TopicId":77646,"ForumId":44,"TopicTitle":"KSP Community CubeSat","CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-07-14T22:43:38Z","PageNum":37,"Articles":[{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-21T19:34:05Z","Content":"\n\u003Cp\u003EWell, how are you at engineering? (I SUPPOSE that doesn\u0027t involve constant Uber equations)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-21T21:37:10Z\u0022 title=\u002208/21/2014 09:37  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 21, 2014\u003C/time\u003E by Nicholander\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2014-08-22T04:49:09Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003ENASA\u0027s Space Biology Program will fund 26 proposals to investigate how microbes, cells, plants and animals respond to changes in gravity. The research will be conducted aboard the International Space Station.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/content/nasa-selects-26-space-biology-research-proposals/index.html#.U_bJ9vldUTo\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/content/nasa-selects-26-space-biology-research-proposals/index.html#.U_bJ9vldUTo\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-22T17:05:33Z\u0022 title=\u002208/22/2014 05:05  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 22, 2014\u003C/time\u003E by Aethon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"hawkinator","CreatedById":57569,"CreatedDateTime":"2014-08-22T13:53:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mazon Del\u0022 data-cite=\u0022Mazon Del\u0022\u003E\u003Cdiv\u003EI am less worried about the software improperly triggering it because of software faults. It is more the thought that a randomly flipped bit (cosmic ray, etc) could make the software THINK that the \u0022should I vent?\u0022 system has declared \u0022Go!\u0022. There is some data to suggest that this has been observed in computers on cars (deep inside atmo) causing things like uncontrolled accel/braking.\u003Cp\u003EPossibly what we could do though which would likely fix this problem and might help with another. We could have a sort of atmosphere \u0022airlock\u0022. This could be useful if we go with stored CO2 or something, because we could vent a little bit of pressure in controlled bursts(open outter valve, close outter valve, open inner, close inner, repeat) then \u0027refill\u0027 from the CO2. It would cause a higher percentage of CO2 to exist without permanently (to a degree anyway) changing the pressure of the bio-container.\u003C/p\u003E\u003Cp\u003EFor what its worth, if we did this and planned for it, we could possibly set these releases to happen in an attempt to help boost our orbit a little.\u003C/p\u003E\u003Cp\u003EVacuum rated seals are probably a little pricey for seals, but I wouldn\u0027t expect them to break the bank honestly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESoftware side you can harden things by having redundant variables in the code, like 5 bits (or more,but a always an odd number) instead of 1. The software could then make sure all the bits were the same, and, if one or two are different change them to match the others (majority rules) that way you need three randomly flipped bits to cause a problem. Check the bits every so often (fairly frequently), and it\u0027s nearly impossible to break, since three bits would have to randomly flip at the same time, which is absurdly improbable.\u003C/p\u003E\n"},{"CreatedByName":"WH40krules","CreatedById":79752,"CreatedDateTime":"2014-08-22T16:13:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aethon\u0022 data-cite=\u0022Aethon\u0022\u003E\u003Cdiv\u003ENASA\u0027s Space Biology Program will fund 26 proposals to investigate how microbes, cells, plants and animals respond to changes in gravity. The research will be conducted aboard the International Space Station.\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/content/nasa-selects-26-space-biology-research-proposals/index.html#.U_bJ9vldUTo\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/content/nasa-selects-26-space-biology-research-proposals/index.html#.U_bJ9vldUTo\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe article only mentions researching microbes, cells, plants, and animals respond to changes of gravity on the ISS. As far as I know, the ISS doesn\u0027t have a centrifuge, and can only test in micro-gravity. We, using a centrifuge on our cubesat, can test in other g\u0027s. Maybe we could even contact NASA about this, since they gave about 12 million for grants to the researchers.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-22T19:36:06Z","Content":"\n\u003Cp\u003E12 million? 12 million US dollars? If we get that (That\u0027s a pretty big If...), imagine the spacecraft we could make! It would be a 6U! Maybe there could even be 2 2U long centrifuges! (If we get that 12 million, that is, and that\u0027s VERY UNLIKELY)\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-08-22T20:38:46Z","Content":"\n\u003Cp\u003EHe mentioned 12 million as the whole pot, not a handout. And 12 million will support a lot more than 6U; you could outright buy a launch on a ~ 1 ton capability vehicle for that much.\u003C/p\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2014-08-22T21:13:17Z","Content":"\n\u003Cp\u003EIn order to fund it, squad could release a paid dlc that adds cubesat parts and a special flag or something...\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-22T21:16:55Z","Content":"\n\u003Cp\u003EKryten: I know why he said it, and I said in the post that it is essentially impossible to get the dream deal.\u003C/p\u003E\u003Cp\u003EZodiaK: DLC is evil crap that EA does. So no, NEVER. They should, however add some CubeSat parts in 0.25.\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-08-24T00:56:59Z","Content":"\n\u003Cp\u003Ewith 12 mil, the Phobos mission with a 2 or 3U isn\u0027t that far off!\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-08-24T00:58:01Z","Content":"\n\u003Cp\u003Eoh, and BTW, we already have a cubesat part in KSP. The cubic satellite part \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-08-24T01:13:27Z","Content":"\n\u003Cp\u003EQuick update. I\u0027ve worked out the EoM for the constants, but I definitely have a math error somewhere along the way. Mathematica version of 2D simulation runs and produces fine orbital motion when no forces are applied, but not all of the constants are correctly updated with a perturbation force. I\u0027m pretty sure energy and angular momentum are correct, but argument of periapsis and time of periapsis passage seem suspect. On the plus side, I have a Hamiltonian dynamics simulation running along side, which I can use to test all of the values. So I should be able to work out all the bugs soon.\u003C/p\u003E\u003Cp\u003EThen I\u0027ll need to move it over to 3D. (That introduces ascending node and L\u003Csub\u003Ez\u003C/sub\u003E.) And then move it all to C\u002B\u002B code and write good integrators for the EoMs.\u003C/p\u003E\u003Cp\u003EAt any rate, getting there.\u003C/p\u003E\u003Cp\u003EEdit: Poked around at it a bit more. It\u0027s starting to look like the errors might actually be purely numerical. I\u0027ll have to switch over to C\u002B\u002B sooner than I thought.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-24T01:47:00Z\u0022 title=\u002208/24/2014 01:47  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 24, 2014\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-24T02:15:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022oarum\u0022 data-cite=\u0022oarum\u0022\u003E\u003Cdiv\u003Ewith 12 mil, the Phobos mission with a 2 or 3U isn\u0027t that far off!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, we still have to put a plant thing there somehow.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-08-24T04:23:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nicholander\u0022 data-cite=\u0022Nicholander\u0022\u003E\u003Cdiv\u003EWell, we still have to put a plant thing there somehow.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI maintain that the technical problems inherent with getting a lunar flyby into a rosetta slingshot are enough to make success it\u0027s own engineering reward. Nailing a Mars aerocapture and a Phobos L1 drop is more icing, but will probably take additional launches, watever funding we get.\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-08-24T08:43:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nicholander\u0022 data-cite=\u0022Nicholander\u0022\u003E\u003Cdiv\u003EWell, we still have to put a plant thing there somehow.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Emaybe we could have 1 cubesat orbiting phobos with the plant in it, and another landing on phobos.\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-08-24T08:55:45Z","Content":"\n\u003Cp\u003EThe Phobos dream has become a possibility!\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-24T14:38:18Z","Content":"\n\u003Cp\u003EBut remember, what do you think are the chances of us getting it? Next to none, it\u0027d be absolutely perfect \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EIF\u003C/span\u003E\u003C/strong\u003E we got it, but that\u0027s a pretty big if. Anyway, I don\u0027t think NASA would want to give 12 million dollars to some very enthusiastic KSP players who want to land a CubeSat on Phobos, and will glue some plants to it just to get the money to do it.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Just because I said \u0022Some very enthusiast KSP players\u0022 does not mean I think this project is impossible. I still believe in this project and support it as much as I can)\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tech Support","CreatedById":89874,"CreatedDateTime":"2014-08-24T14:57:39Z","Content":"\n\u003Cp\u003EGentlemen, I must say that this one of the most exciting plans I have seen in a forum ! I really hope we can send a CubeSat ( hopefully Green and with Jeb\u0027s pic ) into space. one the biggest hurdle seems to the cost of launching it ( assuming we don\u0027t get a free ride ) could we try launchers other than NASA ? perhaps the Indians or the Chinese ? the launch rates are far cheaper and the they good track records.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-24T17:43:43Z","Content":"\n\u003Cp\u003EChina or India? Well, there is Japan\u0027s \u003Ca href=\u0022https://en.wikipedia.org/wiki/H-II_Transfer_Vehicle\u0022 rel=\u0022external nofollow\u0022\u003EH-II Transfer Vehicle\u003C/a\u003E, and the Dragon (Does that count as US?), and both of those are for it being launched on the ISS\u0027s \u0022CubeSat gun\u0022. Also, could you give us the links to the prices for India and China?\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-08-24T19:37:28Z","Content":"\n\u003Cp\u003EFor China you want to contact \u003Ca href=\u0022http://www.cgwic.com/\u0022 rel=\u0022external nofollow\u0022\u003EChina Great Wall Industry Corporation\u003C/a\u003E and for India \u003Ca href=\u0022http://www.antrix.gov.in/contactus.aspx\u0022 rel=\u0022external nofollow\u0022\u003EAntrix Corporation\u003C/a\u003E. I don\u0027t think either have public prices, and for China you\u0027d have to avoid anything ITAR-sensitive. Both provide cubesat launches through \u003Ca href=\u0022http://www.isispace.nl/cms/index.php/products-and-services/launches\u0022 rel=\u0022external nofollow\u0022\u003EISIS launch services\u003C/a\u003E, and probably others.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-24T20:41:28Z","Content":"\n\u003Cp\u003EWell, Tech Support, where did you see that China\u0027s and India\u0027s prices are cheaper? Cause until then, I\u0027ll still be convinced that NASA, ESA, or JAXA are better.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-08-24T20:51:01Z","Content":"\n\u003Cp\u003ERocket launches are cheaper for the same reason most thing from those countries are, better/intact industrial infrastructure and lower wages. Cubesat slots are likely to be of similar prices, because they\u0027re being handed out by the same providers.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-24T21:36:49Z","Content":"\n\u003Cp\u003EOh, but I\u0027m still waiting for Tech Support to respond.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-08-24T22:01:56Z","Content":"\n\u003Cp\u003EThe only people that can give you a real figure are the people at Antrix/CGWIC. The numbers are right there.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-08-24T23:48:45Z","Content":"\n\u003Cp\u003EUh, well... I was looking on both websites, and I couldn\u0027t find the costs. Are we supposed to contact them?\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-08-25T01:26:40Z","Content":"\n\u003Cp\u003Ewait, wait, wait. We don\u0027t know that we can\u0027t get a free ride from NASA yet. Don\u0027t go too far with it.\u003C/p\u003E\n"}]}