{"TopicId":78428,"ForumId":44,"TopicTitle":"Koko The Gorilla","CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-07-19T13:58:50Z","PageNum":1,"Articles":[{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-07-19T13:58:50Z","Content":"\n\u003Cp\u003EWhat do you think of Koko The Gorilla, the research concerning her, and its potential and known implications? Also consider these questions:\u003C/p\u003E\u003Cp\u003E-Is Koko self-aware in the sense of being aware of her own awareness? Why?\u003C/p\u003E\u003Cp\u003E-Could we test her awareness and its limitations?\u003C/p\u003E\u003Cp\u003E-What are the limitations of her intelligence; e.g., can she understand logic, engineer more than simple tools, or perhaps philosophize?\u003C/p\u003E\u003Cp\u003E-Could we teach her the scientific method and have her study other Gorillas, her results unbeknownst-to-her compared with those of human scientists?\u003C/p\u003E\u003Cp\u003E-Would her intellectual development have differed in the wild?\u003C/p\u003E\u003Cp\u003E-If her communication is not merely conditioned imitation, and if this \u0027real\u0027 communication is due to her upbringing, then can she raise another gorilla in her likeness?\u003C/p\u003E\u003Cp\u003E-Were she released into a troupe--wild or captive--would she teach them language?\u003C/p\u003E\u003Cp\u003E-Could another language-capable Gorilla communicate with her, and what would they discuss?\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-07-19T14:40:10Z","Content":"\n\u003Cp\u003EIt\u0027s similar to a small child. No, I don\u0027t think she\u0027s capable of having the full sense of self awareness as an adult human being. She probably has a weak degree of such notion, though, just like kids have.\u003C/p\u003E\u003Cp\u003EI highly doubt she could learn other adult gorillas sign language or pretty much anything. She could raise smart ones, though. It\u0027s like with feral children. If they miss everything in the first five years, they\u0027re ruined for life. Brain gets \u0022cemented\u0022.\u003C/p\u003E\u003Cp\u003EKoko is a precious being that forces us to think more about ourselves. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2014-07-19T17:23:58Z","Content":"\n\u003Cp\u003EI think this will answer the OP\u0027s questions. This is Michael, Koko\u0027s \u0022brother\u0022 and if you can watch him sign the story of his mother\u0027s death without crying- you\u0027re a better man/woman than I.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/DXKsPqQ0Ycc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-19T18:34:47Z\u0022 title=\u002207/19/2014 06:34  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 19, 2014\u003C/time\u003E by Aethon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-19T19:50:55Z","Content":"\n\u003Cp\u003EAnother peripherally related and interesting topic is the Apps for Apes program that is being implemented at a number of \u003Ca href=\u0022http://nationalzoo.si.edu/SCBI/AnimalCare/News/Apps4Apes.cfm\u0022 rel=\u0022external nofollow\u0022\u003Ezoos that house Orangutans\u003C/a\u003E. They use iPads to allow the orangutans to interact with keepers and even other orangutans at other zoos. From what I\u0027ve read about the project, the apes do exhibit sophisticated creativity and behaviors that suggest an understanding of their individuallity.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-19T20:34:50Z","Content":"\n\u003Cp\u003EActually already magpies have self awareness (insofar as they can recognize that the being in a mirror is themselves and not another magpie)\u003C/p\u003E\u003Cp\u003ESo yes, I am absolutely sure that Koko is self aware\u003C/p\u003E\u003Cp\u003EThe only fundamental difference between speech using apes (and other animals, including Grey Parrot Alex) and humans seems to be,\u003C/p\u003E\u003Cp\u003Ethat apes donÃ‚Â´t ask questions.\u003C/p\u003E\u003Cp\u003EThey use tools, they do tasks when being told, they answer questions when being asked ..\u003C/p\u003E\u003Cp\u003Ethey also make requests like \u0022I want a banana\u0022.\u003C/p\u003E\u003Cp\u003EBut they donÃ‚Â´t ask questions themselves like \u0022Where do you go?\u0022, \u0022What is this?\u0022, \u0022How are you?\u0022 and so on\u003C/p\u003E\u003Cp\u003EWhich is defnitely interesting ... i.e. to wonder why this is so\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-07-19T21:12:33Z","Content":"\n\u003Cp\u003EInterrogative mood is a tricky one, though. In English, it\u0027s pretty simple, indicated by certain grammatical structures and some key words. But in a lot of languages, it\u0027s completely down to intonation in a lot of cases. Try to ask someone a question in another language while knowing just a few phrases and not knowing the key words associated with asking questions in that language. You\u0027ll probably resort to making statements that explain your situation and hope the other person understands, rather than manage to ask a direct question.\u003C/p\u003E\u003Cp\u003EThis might be the case with our attempts to communicate with other species. Or it might be that interrogative mood itself is a higher level linguistic constructs, so it\u0027s not natural in their native communication.\u003C/p\u003E\u003Cp\u003EI\u0027d expect dolphins to have an equivalent concept. So I think it should be possible to organize a communication scheme where questions can be asked both ways.\u003C/p\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2014-07-19T21:19:47Z","Content":"\n\u003Cp\u003EI think that a small degree of self-awareness might be quite common among the most intelligent and social animal species. Apes, dolphins, and probably even dogs are likely aware of themselves in both the physical and social sense, and are capable of understanding concepts such as \u0022This Human likes me\u0022 or \u0022This Human is upset at me\u0022.\u003C/p\u003E\u003Cp\u003EHowever, self-awareness is only the most basic part of true sentience, I think. These creatures don\u0027t do things that Humans can do like contemplate hypotheticals, plan for the future, or question the nature of their world; and this is because their brains aren\u0027t built for the kind of multi-tiered, high-level thought processes that those kinds of things take.\u003C/p\u003E\u003Cp\u003EI think that humans might be the only life to have crossed over a certain critical threshold. Larger and more complex brains obviously contribute to higher intelligence, but once a brain reaches a certain point where it is capable of handling those truly complex thought processes, it causes an exponential jump in the being\u0027s apparent intelligence, without requiring an exponential increase in brain size.\u003C/p\u003E\u003Cp\u003E...then again, this could all just be my own crazy babble...\u003C/p\u003E\n"},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2014-07-19T22:21:52Z","Content":"\n\u003Cp\u003EI find this subject very difficult, because i want it to be true. I want to think there is something else that can understand us, something that wants to talk and be with us.\u003C/p\u003E\u003Cp\u003EI agree with the above poster, however i want to extend slightly. They are self aware, they want things from us, they will respond to things; however, critically, they dont think about WHY more than any other creature, i.e i am hungry, not \u0022i\u0027d love a banana over that orange, however can my human friend afford it? Does he have one? What does he want? Where does the bannana come from? Why dont i like the orange\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-07-20T00:43:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EIt\u0027s similar to a small child. No, I don\u0027t think she\u0027s capable of having the full sense of self awareness as an adult human being. She probably has a weak degree of such notion, though, just like kids have.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou mean like a 1-2 year old? All my memories include my being aware of my own awareness--even sometimes exploiting my self-awareness for fun and profit.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI highly doubt she could learn other adult gorillas sign language or pretty much anything. She could raise smart ones, though. It\u0027s like with feral children. If they miss everything in the first five years, they\u0027re ruined for life. Brain gets \u0022cemented\u0022.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould she teach a baby gorilla sign language?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EKoko is a precious being that forces us to think more about ourselves. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree--and suggest we should consider writing \u0022who\u0022 not \u0022that\u0022 to reflect her near-human intelligence.\u003C/p\u003E\u003Cp\u003E@jfil We know that at least some Great Apes can do what you said they cannot--\u0022contemplate hypotheticals, plan for the future, or question the nature of their world\u0022--because chimps given an elevated treat and enough boxes to reach it by stacking them will stack the boxes and eat the treat. These structures are too complex to be built on impulse, instead requiring testing of the strength of the materials and answering the question, \u0022What if this stack falls?\u0022 lest the stack should by failing hurt the chimp.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-07-20T09:31:55Z","Content":"\n\u003Cp\u003EWell I don\u0027t think it\u0027s near human intelligence, but there certainly is intelligence, with a sort of self awareness. As Linear said it: \u003C/p\u003E\u003Cp\u003E\u0022I agree with the above poster, however i want to extend slightly. They are self aware, they want things from us, they will respond to things; however, critically, they dont think about WHY more than any other creature, i.e i am hungry, not \u0022i\u0027d love a banana over that orange, however can my human friend afford it? Does he have one? What does he want? Where does the bannana come from? Why dont i like the orange\u0022. \u0022\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-07-20T13:12:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duxwing\u0022 data-cite=\u0022Duxwing\u0022\u003E\u003Cdiv\u003EYou mean like a 1-2 year old? All my memories include my being aware of my own awareness--even sometimes exploiting my self-awareness for fun and profit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESelf-awareness starts between the first and third year for normally developed kids. It doesn\u0027t instantly turn from being completely oblivious to being fully aware of one\u0027s self, though. It\u0027s gradual. Human are remarkably good at it, compared to other primates.\u003C/p\u003E\u003Cp\u003EThis raises a question if we can even form early memories without being self-aware. It\u0027s complicated and would require asking it to a bunch of child psychologists.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ECould she teach a baby gorilla sign language?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t say that she could, but I don\u0027t think there\u0027s any obstacle to it. Koko clearly understands the benefit of such knowledge, otherwise she wouldn\u0027t use it on her own. I\u0027d say she\u0027d probably try to teach the baby.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI agree--and suggest we should consider writing \u0022who\u0022 not \u0022that\u0022 to reflect her near-human intelligence.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, English language is weird with these things. Animals are an \u0022it\u0022, yet ships are a \u0022she\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-07-20T13:20:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EWell I don\u0027t think it\u0027s near human intelligence, but there certainly is intelligence, with a sort of self awareness. As Linear said it:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow do we know that Koko doesn\u0027t do those things?\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-07-20T14:52:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aethon\u0022 data-cite=\u0022Aethon\u0022\u003E\u003Cdiv\u003EThis is Michael, Koko\u0027s \u0022brother\u0022 and if you can watch him sign the story of his mother\u0027s death without crying- you\u0027re a better man/woman than I.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETIL that not crying means you\u0027re a better person. Thankyou Aethon!\u003C/p\u003E\n"}]}