{"TopicId":79846,"ForumId":44,"TopicTitle":"If a disaster left us with pre-industrial technology, could we become advanced again?","CreatedByName":"szputnyik","CreatedById":84032,"CreatedDateTime":"2014-07-28T15:07:59Z","PageNum":2,"Articles":[{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2014-07-31T18:25:06Z","Content":"\n\u003Cp\u003EWell back at the tech, our \u0022technical writing/public speaking\u0022 teacher gave us the project of \u0022Assume ____ apocalyptic scenario, what assumptions can you and your group come up with about the survivability of humanity.\u0022\u003C/p\u003E\u003Cp\u003EI remember the asteroid group, the general concensus was that as long as people could survive the initial blast/firestorm, they probably wouldn\u0027t have to much trouble springing back. Remember, even though we might be \u0022back in the stone age\u0022 there are countless machines around that the survivors could use to their advantage. No reason why cars and such would stop working aside from physical damage. Yeah fuel would become scarse, but with rationing, they could probably make do with the fuel left in their immediate area, for a few years actually. Also they wouldn\u0027t have many other people around competing with them for resources.\u003C/p\u003E\u003Cp\u003EMy group had drawn the \u0022Coronal Mass Ejection, Disaster\u0022, basically a huge EMP effect, although there would be some serious sunburns, and crops may be destroyed if this went on for a long time. Most all computers, things that operate off semiconductors, batteries and such were destroyed. Now THERE would be a pretty terrible apocalypse. Especially for any living near major cities. The 3rd world, would probably survive just fine. 1st world though. \u003C/p\u003E\u003Cp\u003EJust think of New York City. Usually theres over 3 million people on Manhattan island every day. Suddenly, every car is broken down (most can\u0027t run without their computer), power goes out because no computers or control systems at power plants continue working. Sewage breaks down, Water pumping stations go down. Even most backup generator systems go down because they rely on computerized engine controllers/ semiconductor power rectifier/inverters. Also I don\u0027t think that all the food in the city could support that population for more than a few days. Few cars to transport people away. Police can\u0027t control the population by any amount. Looting, violence. But thats just the beginning. Soon these people would start leaving the city. No food to be had, theres no choice but to leave. Assuming they all grab some food, they might make it a few days down the interstates outside the city. Most would probably head south/west towards the farming country, that would be their only chance of survival. But could the farming country of Pennsylvania/NewYork sustain that number of people? Remember, that 3mil is just what Manhattan sees, theres millions more in the surrounding cities/suburbs. Dead bodies would litter the streets of NY and NJ, bodies of those whos starved before making it. \u003C/p\u003E\u003Cp\u003EEven the mid-west what with all its farming would be hard pressed to survive. Most of that land is really terrible farmland, and never sees enough rain to support growing on the scale that we do it now. All that land has to be irrigated... by rotary sprinkler systems that run on computers, high power water pumping systems that can\u0027t run now since the power plants are for the most part, defunct. Even if the crops weren\u0027t destroyed during the CME, most would probably dry up in the fields. And what if it happened during winter? \u003C/p\u003E\u003Cp\u003EWe had a 35min presentation about it in class... yeah I won\u0027t get into the whole thing, it got pretty morbid around the first 5-10 minutes, but it would be survivable.\u003C/p\u003E\u003Cp\u003ESimple engines that don\u0027t need electronics would still work. Yeah you\u0027d be screwed on batteries (though there are places that sell batteries with no fluid in them, we had argued that some of those might survive, and could be filled and used later) But pull start engines would work fine, so there would be some transport ability. Much farming equipment (tractors and such) would become useless, but with the huge population explosion, there would be plenty of hands to work the land manually. Also anyone who has restored/collected old pre-depression era tractors and such would be in business. Also machinery to construct new machinery (mills/lathes, plug in power tools) would still be viable, if only a suitable power source could be found/made. But man those first 2 years would be brutal.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-07-31T19:13:37Z","Content":"\n\u003Cp\u003Elinkxsc I was just looking into the CME issue just the other day, after news of our recent near-miss with a class-X. Seems it\u0027s pretty trivial to build your own faraday cage, or at least one that\u0027s \u0027good enough\u0027 to protect small electronics. A bit of clever planning and you could park your car inside a combination of cardboard and tinfoil. That\u0027s what I \u0022read\u0022 anyway, and I\u0027m taking it with a few grains of salt, because I have trouble believing it\u0027s really that simple. But if it is, you can then experience the fun of fighting off the crazy looters who are trying to get their hands on the only functional car in the whole town.\u003C/p\u003E\u003Cp\u003EIf nothing else, I\u0027d at least like to construct something that I can toss by hard drives into, along with a few \u0027survivalist\u0027 electronic devices.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-31T19:15:47Z\u0022 title=\u002207/31/2014 07:15  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 31, 2014\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2014-07-31T20:40:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003Elinkxsc I was just looking into the CME issue just the other day, after news of our recent near-miss with a class-X. Seems it\u0027s pretty trivial to build your own faraday cage, or at least one that\u0027s \u0027good enough\u0027 to protect small electronics. A bit of clever planning and you could park your car inside a combination of cardboard and tinfoil. That\u0027s what I \u0022read\u0022 anyway, and I\u0027m taking it with a few grains of salt, because I have trouble believing it\u0027s really that simple. But if it is, you can then experience the fun of fighting off the crazy looters who are trying to get their hands on the only functional car in the whole town.\u003Cp\u003EIf nothing else, I\u0027d at least like to construct something that I can toss by hard drives into, along with a few \u0027survivalist\u0027 electronic devices.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell theres the trick though, some electronics would perhaps survive simply by being in basement parking garages. But the severe majority would stop working. Also unlike other apocalypse scenarios like asteroids which could be detected years ahead of time, a cme can happen and hit the earth withing 3-5 days. \u003C/p\u003E\u003Cp\u003EAbother bad thing to think about. All them nuclear missile subs chilling out down 100m under the surface would probably all work just fine, protected from damage by the water (though i dont know, would the water protect against a cme?)\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-07-31T21:42:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linkxsc\u0022 data-cite=\u0022linkxsc\u0022\u003E\u003Cdiv\u003EWell theres the trick though, some electronics would perhaps survive simply by being in basement parking garages. But the severe majority would stop working. Also unlike other apocalypse scenarios like asteroids which could be detected years ahead of time, a cme can happen and hit the earth withing 3-5 days.\u003Cp\u003EAbother bad thing to think about. All them nuclear missile subs chilling out down 100m under the surface would probably all work just fine, protected from damage by the water (though i dont know, would the water protect against a cme?)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve heard water will deflect them sufficiently, though I don\u0027t know how much. Presuming you can wrap your gear sufficiently in water-tight bags, you could just sink them to the bottom of a pool or tie a rope around them and leave them in a pond.\u003C/p\u003E\u003Cp\u003EI\u0027ve got an urge now to find out what FEMA\u0027s opinion on all of this is.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-08-01T03:50:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PenguinsMeep\u0022 data-cite=\u0022PenguinsMeep\u0022\u003E\u003Cdiv\u003EWho again declare the scrap as a monument... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eor worse, a religious shrine, and declare Holy War on people who dare venerate the wrong kind of scrap.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-08-01T03:57:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KASASpace\u0022 data-cite=\u0022KASASpace\u0022\u003E\u003Cdiv\u003EYou forget, that it is not the metals that matter, but something much much different. Even if we were blasted into the Neolithic age, I know about a piece of technology that could take us to the Bronze Age, it\u0027s called the Bellows. It\u0027s a compressible container that \u0022blows\u0022 air into a fire, making it hotter. This allows for that fire to melt metals. Then we can use those metals to make tools.\u003Cp\u003EPlus, that would only happen if everyone with knowledge about industrial technology died in that disaster.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETiny problem there is that you\u0027d need a lot more heat than a wood fire and a bellows can create to melt all that iron and stuff.\u003C/p\u003E\u003Cp\u003EWhile the knowledge might exist somewhere with some people on how to jump the technology evolution given the right materials, getting those materials is still problematic.\u003C/p\u003E\u003Cp\u003EFirst you need to reinvent charcoal (do you know how to make it without looking it up on the internet, and without 21st century, or even 18th century technology you won\u0027t have?).\u003C/p\u003E\u003Cp\u003EThen with the increased heat from that you need to invent the means to mine coal using hand tools rather than explosives, electric and hydraulic machinery, etc. etc..\u003C/p\u003E\u003Cp\u003EThat gives you the heat needed to forge iron.\u003C/p\u003E\u003Cp\u003ENow you\u0027re going to have to hope someone has a text book on metalurgy that hasn\u0027t burned, rotted, or was otherwise destroyed and he\u0027ll let you read it.\u003C/p\u003E\u003Cp\u003EThat might give you some information on making the easier steel alloys.\u003C/p\u003E\u003Cp\u003EYou\u0027re also going to have to reinvent electricity, pumps, the works.\u003C/p\u003E\u003Cp\u003EAnd the further along we get to putting everything in electronic storage on computers rather than on paper the harder that will all become.\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2014-08-01T06:06:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003ETiny problem there is that you\u0027d need a lot more heat than a wood fire and a bellows can create to melt all that iron and stuff.\u003Cp\u003EWhile the knowledge might exist somewhere with some people on how to jump the technology evolution given the right materials, getting those materials is still problematic.\u003C/p\u003E\u003Cp\u003EFirst you need to reinvent charcoal (do you know how to make it without looking it up on the internet, and without 21st century, or even 18th century technology you won\u0027t have?).\u003C/p\u003E\u003Cp\u003EThen with the increased heat from that you need to invent the means to mine coal using hand tools rather than explosives, electric and hydraulic machinery, etc. etc..\u003C/p\u003E\u003Cp\u003EThat gives you the heat needed to forge iron.\u003C/p\u003E\u003Cp\u003ENow you\u0027re going to have to hope someone has a text book on metalurgy that hasn\u0027t burned, rotted, or was otherwise destroyed and he\u0027ll let you read it.\u003C/p\u003E\u003Cp\u003EThat might give you some information on making the easier steel alloys.\u003C/p\u003E\u003Cp\u003EYou\u0027re also going to have to reinvent electricity, pumps, the works.\u003C/p\u003E\u003Cp\u003EAnd the further along we get to putting everything in electronic storage on computers rather than on paper the harder that will all become.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dunno bro, I\u0027ve made charcoal for my own little forging projects before (its pretty easy, you just burn wood without it getting oxygen, its easy to do by just filling a paintcan or something, with wood and baking it in a fire. Done it several times before when we have bonfires (gonna have the fire anyways), and buying coal where I live is kinda expensive, so I make do with what I got. (Also, NEVER use charcoal briquets) Could I melt steel with the assets at my immediate disposal... maybe, but why would I want to. Some charcoal and some hammering and someone who listens cranking the blower, and I can shape/forgeweld any scrap into a stock material, and back into something useful. \u003C/p\u003E\u003Cp\u003EActually my own forging work was on a whim during highschool, made several knives and such from old files and the spring steel from old automotive springs. Though if I were to be making say... a horse drawn farming plow, I think I might need to expand the size of my forge, but even that would be trivial, Could take the brick to make it larger from any of hundreds of houses. Although I will state, I\u0027m a horrible smith, it was just something to do in the summer with a couple friends, though we did get several good knives out of that, tried a couple swords... they didn\u0027t come out so great, really should have had 2 people hammering for them because they take FOREVER. \u003C/p\u003E\u003Cp\u003EPS. want a good hobby that\u0027ll get you a lot of exercise in a short time, and you\u0027ll always have a nice tan, try smithing.\u003C/p\u003E\u003Cp\u003EYeah the argument is there that most of what we know comes from the internet, and after the apoc, that\u0027ll be gone. But what, is every library in the country going to burn down at the same time too? Maybe its just more to point that people should have some hobbys of varying discipline such that they learn about many different things. (me, well, I\u0027m just a nerd who can\u0027t sit still for long) Also most all the basic of creating and working steel could be gotten out of an old tech school materials course/book. \u003C/p\u003E\u003Cp\u003EAlso, who says that everything would cease to exist. Again I reiterate as I did in an earlier post. Its not like you\u0027ll be blasted back to the stone age. You\u0027ll be in the stone age with countless books of knowledge and derelict machines, and perhaps, others around who are intelligent about different things than yourself. Theres no \u0022reinvention\u0022 it\u0027ll just be, rebuilding. Yeah rebuilding would take time, but hey, all those machines I was talking about. Can probably get them running again.\u003C/p\u003E\u003Cp\u003EJust a little additional info cause well, I\u0027m bored, and you guys might need to know this in the future if theres and apocalypse. Lackign a paint can to make your charcoal, what they did back in the day (medieval) to make charcoal, they would split up logs much liek you would for firewood, stack it up several feet, and cover the wood with dirt to keep the air from getting to it. Then they would stack more wood around that mound and over it and ignite it, then keep the fire burning for a couple days. Then leaving the mound untouched for a few more days to cool, (if you were to dig it out while its still hot, it may ignite) then dig out your charcoal, and use it. \u003C/p\u003E\u003Cp\u003EOther things you may consider looking into because they\u0027re interesting reads is wood gas generators (basically making charcoal, while burning it and releasing flammable gasses that can be trapped, and perhaps stored for later usage, IE allowing the running of propane powered equipment)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-01T06:18:48Z\u0022 title=\u002208/01/2014 06:18  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 1, 2014\u003C/time\u003E by linkxsc\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-08-01T07:12:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Edo you know how to make it without looking it up on the internet\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do too, it\u0027s not hard. Like linkxsc says: build a big bonfire, cover it over with earth and babysit it for a few days.\u003C/p\u003E\u003Cp\u003EThe thing is, not everybody would have to know how to do everything. Even in modern urban society you wouldn\u0027t have to look very hard to find people who could build houses, set broken bones, throw pots, deliver babies, design an irrigation system, train horses, and grow crops. A group of a few dozen people could easily be pretty self-sufficient and after a few years they should be generating an agricultural surplus that would allow some of the them to pursue special skills. There are a few traditional skills that would be very rare (eg: fletching) but groups would presumably trade for these either using their surplus food or their own specialist goods.\u003C/p\u003E\u003Cp\u003EPersonally if I was part of a post-apocalyptic group one of my early jobs would be sending a raiding party into a big city to ransack a university library and carry off every book on a practical subject we could. A good library would be a huge advantage once the group was on its feet and ready to move up a gear.\u003C/p\u003E\u003Cp\u003EIt would be an interesting shift in society to see what types of people would be valuable in a survival situation. Doctors have always been important, but us engineers would suddenly be a lot more valued. People with a practical trade would be able to eat without breaking their backs in the fields. Sorry all you bankers, estate agents, and parking wardens, you\u0027re now farmers. Bit of manual labour might do them some good.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-08-01T09:05:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EPersonally if I was part of a post-apocalyptic group one of my early jobs would be sending a raiding party into a big city to ransack a university library and carry off every book on a practical subject we could.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnde here we have one example of many for the real problem we would face.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-08-01T09:30:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EAnde here we have one example of many for the real problem we would face.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would that be a problem? If somebody took responsibility for safeguarding our stores of knowledge then humanity as a whole is better off. During the Dark Ages in Europe the Christian church took on the role of safeguarding the classical knowledge of the Greeks and Romans, for example.\u003C/p\u003E\u003Cp\u003EBesides, in a survival situation competition is inevitable. Groups which didn\u0027t have some kind of competitive advantage over their neighbours would find it difficult to trade for resources and goods they were short on themselves.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-08-01T10:45:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe thing is, not everybody would have to know how to do everything. Even in modern urban society you wouldn\u0027t have to look very hard to find people who could build houses, set broken bones, throw pots, deliver babies, design an irrigation system, train horses, and grow crops. A group of a few dozen people could easily be pretty self-sufficient \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd they don\u0027t need to be particularly skilled, either. Having some dabbling experience is enough to get you started. All those medieval reenactment folks will come in handy, too: never mind if they ever crafted something themselves, they\u0027re familiar with how a workable low-tech solution looks like, and why. That goes a long way.\u003C/p\u003E\u003Cp\u003EReinventing things is relatively easy. Fletching? I know what it is, how it works, and what the result should look like. Give me some glue and string and I should be able to develop sufficient skill during one rainy day. Getting glue, string and a sharp knife might be the most difficult part of the project.\u003C/p\u003E\u003Cp\u003ETanning is more challenging. Something with urine and/or ashes and/or tree bark? Many things to try, plus I\u0027d have to wait some time before I can tell if I succeeded. Still, I know that it can be done and has been done. That matters a lot.\u003C/p\u003E\u003Cp\u003EOnce sheer survival is taken care of, humanity can quickly recover many \u0022lost\u0022 technologies. If it wants to. Has anyone here read \u0022A Canticle for Leibovitz\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-08-01T10:50:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETanning is more challenging\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why a group of people with many different skills would come in useful. There are still plenty of people who know how to make leather.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-01T11:08:26Z","Content":"\n\u003Cp\u003EThe Amish shall inherit the Earth. Seriously.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-08-01T11:26:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EThat\u0027s why a group of people with many different skills would come in useful. There are still plenty of people who know how to make leather.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t doubt that such people exist, but expect them to be few and far between. Tanning isn\u0027t as cool as smithying... and I presume that you don\u0027t get to pick the members of your group. During the first rounds of disease and starvation, survival is probably a matter of sheer luck more than anything else.\u003C/p\u003E\u003Cp\u003EWhat I\u0027m trying to get at is that you don\u0027t need really skilled people. Even my cursory knowledge of the topic would be quite a head start compared to the original invention. In any random group of 50 people, there\u0027s probably not a single beekeeper. But chances are that you have someone whose uncle used to keep bees and \u0022I watched him as a child\u0022. If she soaked up enough knowldege to get started, that will be enough. Though the most important knowledge is that beekeping is possible, skins can (and have to) be cured, and so on.\u003C/p\u003E\u003Cp\u003EBesides, not every group of survivors has to succeed at all tasks.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-08-01T12:05:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EBesides, not every group of survivors has to succeed at all tasks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJudging from some comments - they only have to succeed in fighting.\u003C/p\u003E\u003Cp\u003EAs I see it, humanity is always split into groups, and even in a nation, county, city, village, family, class room, company, university, office etc. you have no 80% (yup, I made that up to give my sentence a logical flow) common ground.\u003C/p\u003E\u003Cp\u003EI think we humans started out in small groups, families and clans, and it all worked rather well, even as the groups banded together/grew in to villages, but as soon as a certain obscure number of humans lives together, it somehow tips. We have adjusted to live in large cities with up to millions of inhabitants, although it still stresses our system, but still there are rivalries between the cities, because we associate us with the inhabitants of \u003Cem\u003Eour\u003C/em\u003E city.\u003C/p\u003E\u003Cp\u003ENow, if such an event would take place, who would call out to the neighbouring city and say \u0022Resettle in our town, we still have fresh water\u0022? No, no asking for what they have in turn, no demanding their firstborn daughters, no forcing them into labor!\u003C/p\u003E\u003Cp\u003EFood in malls would not be rationed and distributed evenly, it would be fought over.\u003C/p\u003E\u003Cp\u003EMedicine would not be given to those in need, but taken by the stronger party, in case they need it later.\u003C/p\u003E\u003Cp\u003EWater sources would not be open to everyone, they would be seized, guarded and defended against \u003Cem\u003Ethe others\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EIt is rarely the clever guy that survives (on its own or by living by his standards), but almost always the bully - who forces the clever guys to work for him.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-08-01T12:11:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EReinventing things is relatively easy. Fletching? I know what it is, how it works, and what the result should look like. Give me some glue and string and I should be able to develop sufficient skill during one rainy day. Getting glue, string and a sharp knife might be the most difficult part of the project.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually no. The reason I mentioned fletching is that from what I\u0027ve heard it\u0027s highly skilled. You could probably produce rubbish arrows on a rainy day, but you won\u0027t catch much dinner with those.\u003C/p\u003E\u003Cp\u003ESome skills that would be required for a leap back to a lower tech level do have steep learning curves that would make it very hard for a novice to become proficient without instruction from a master.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBesides, not every group of survivors has to succeed at all tasks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, which is why I mentioned trade above, and the importance of having a competitive advantage in one area. If your group could make some goods that others needed you can trade for what you lack.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-08-01T12:18:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EJudging from some comments - they only have to succeed in fighting.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny group attempting to rebuild would be foolish to neglect their security arrangements. Soldier would be high on the list of useful professions IMO.\u003C/p\u003E\u003Cp\u003EHistory shows us that dispersed agrarian societies do engage in raiding, but that more organised military efforts require a considerable agricultural surplus. You can\u0027t raise an army if everybody is busy on their farms, but you can launch raids. Obviously in this post-crash scenario there are significant force-multipliers available in the form of advanced weapons. You wouldn\u0027t have to have a huge army if you had a mortar, you\u0027d just rock up and demand they surrendered or you\u0027d pound their village into dust.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-08-01T12:33:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EYou could probably produce rubbish arrows on a rainy day, but you won\u0027t catch much dinner with those.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027d be surprised. Wild animals (deers/boars/etc.) near towns tend to be so used to humans that often you can approach them close enough to hit with a sharp stick - so arrows, even made by someone with little knowledge but enough manual skill, would work just fine. Obviously it varies from place to place, but where I live - it wouldn\u0027t be a problem, at least for first few months.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003ESome skills that would be required for a leap back to a lower tech level do have steep learning curves that would make it very hard for a novice to become proficient without instruction from a master.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaking quality tools - yes. Making just tools - probably not. Perhaps not an average joe, but many people posses know tons of stuff that never came to the mind of people in a stone age. We probably would be able to create simple steam engines within few years after the disaster. Electricity - no to long after that.\u003C/p\u003E\u003Cp\u003EI doubt that getting back to the level of 18th century would take us longer than one generation. And progress after that would be by far quicker than ever before simply because a lot of knowledge would be passed down to the next generation, and we\u0027d already know about things like bacteria, basics of electronics, elements and their uses, etc.\u003C/p\u003E\u003Cp\u003EA lot - and I mean: A LOT - would depend on who gets in power - but if lead wisely, promoting people with knowledge (instead of warriors), we could progress extremely rapidly.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EJudging from some comments - they only have to succeed in fighting.\u003Cp\u003EAs I see it, humanity is always split into groups, and even in a nation, county, city, village, family, class room, company, university, office etc. you have no 80% (yup, I made that up to give my sentence a logical flow) common ground.\u003C/p\u003E\u003Cp\u003EI think we humans started out in small groups, families and clans, and it all worked rather well, even as the groups banded together/grew in to villages, but as soon as a certain obscure number of humans lives together, it somehow tips. We have adjusted to live in large cities with up to millions of inhabitants, although it still stresses our system, but still there are rivalries between the cities, because we associate us with the inhabitants of \u003Cem\u003Eour\u003C/em\u003E city.\u003C/p\u003E\u003Cp\u003ENow, if such an event would take place, who would call out to the neighbouring city and say \u0022Resettle in our town, we still have fresh water\u0022? No, no asking for what they have in turn, no demanding their firstborn daughters, no forcing them into labor!\u003C/p\u003E\u003Cp\u003EFood in malls would not be rationed and distributed evenly, it would be fought over.\u003C/p\u003E\u003Cp\u003EMedicine would not be given to those in need, but taken by the stronger party, in case they need it later.\u003C/p\u003E\u003Cp\u003EWater sources would not be open to everyone, they would be seized, guarded and defended against \u003Cem\u003Ethe others\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EIt is rarely the clever guy that survives (on its own or by living by his standards), but almost always the bully - who forces the clever guys to work for him.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027d vary very much depending on a location and how many people would die in a disaster.\u003C/p\u003E\u003Cp\u003EYou must understand that modern human is by far more tolerant to living in a close neighbourhood with hundreds of other people than a stone-age humans were. Awareness of \u0022nation\u0022 in a common people begun pretty much after French Revolution. These days we\u0027d be by far more capable of building large society anew and creating a civilization than humans were centuries ago.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-01T12:40:12Z\u0022 title=\u002208/01/2014 12:40  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 1, 2014\u003C/time\u003E by Sky_walker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheGatesofLogic","CreatedById":58468,"CreatedDateTime":"2014-08-01T13:08:16Z","Content":"\n\u003Cp\u003EThe only thing i have to bring to this discussion is this: books would be far and away more valuable than gold\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-01T13:17:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheGatesofLogic\u0022 data-cite=\u0022TheGatesofLogic\u0022\u003E\u003Cdiv\u003EThe only thing i have to bring to this discussion is this: books would be far and away more valuable than gold\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept for gold books. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Seriously, though, books already have more intrinsic value than gold.\u003C/p\u003E\u003Cp\u003EIt would be interesting to see what would develop as a currency for exchange post-apocalypse. Some representation for whatever is in tightest supply, I\u0027d imagine. Fiat currency isn\u0027t going to work for a long time.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-08-01T14:01:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EIt would be interesting to see what would develop as a currency for exchange post-apocalypse.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBottle caps. Obviously.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-08-01T14:02:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EExcept for gold books. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Seriously, though, books already have more intrinsic value than gold.\u003Cp\u003EIt would be interesting to see what would develop as a currency for exchange post-apocalypse. Some representation for whatever is in tightest supply, I\u0027d imagine. Fiat currency isn\u0027t going to work for a long time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBullets. You can use them to hunt, defend yourself, even make a fire (though this requires some know-how). It makes sense they\u0027d become very valuable. Glukhovsky got that one right. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E You all should remember that it\u0027s very hard to remove/destroy guns, and they\u0027d almost certainly survive in a decent number. More advanced military equipment might not, but an M-16/AK-47 and derivatives, as well as many older weapons, are relatively simple and robust. They\u0027re perfect for hunting (no need to make arrows if you have a rifle) and for defense as well. As such, \u0022strongest\u0022 would mean \u0022with the largest amount of guns\u0022.\u003C/p\u003E\u003Cp\u003EUsually, this means the military, so the post-apocalyptic society would probably be led by a military junta. In the US and Europe, it might not be a bad thing at all (the military is pretty civilized there), but in other countries it might differ. Also, both military equipment and personnel are in some way hardened against disasters of all kinds. Even an IPAC paper-pusher lady on an USMC base has probably heard a few things about surviving in the field (if only from the grunts complaining \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E) and fired a rifle at least once, putting her above many men from outside the military (also, she likely lives somewhere near good, hardened shelters and her unit\u0027s armory, making those things a non-issue). If there\u0027s anything that\u0027s going to retain any semblance of pre-apocalyptic structure after a civilization-destroying event, it\u0027s gonna be the western military. USMC will probably remain intact enough to retain it\u0027s own absurds, too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENORAD and rocket forces in general would probably also survive fully intact, since they were designed to do just that. Remember, the world has been preparing for a nuclear apocalypse for about a half of the 20th century. Hardly anything can happen to Earth that can top that, short of the planet being blasted apart or the Sun exploding. If anything, a large amount of people from Moscow and London (huge metro systems that can, and in the latter cases did double as shelters), rocket forces and submariners would survive with their rations and equipment intact.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-01T14:13:11Z\u0022 title=\u002208/01/2014 02:13  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 1, 2014\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-01T14:12:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EBullets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood choice! Also has the advantage of being easily portable and available in small denominations. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EUsually, this means the military, so the post-apocalyptic society would probably be led by a military junta. In the US and Europe, it might not be a bad thing at all (the military is pretty civilized there), but in other countries it might differ. Also, both military equipment and personnel are in some way hardened against disasters of all kinds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the Western militaries are only more civilized due to civilian oversight and control, take that away and they\u0027ll likely become just like those in those other countries.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEven an IPAC paper-pusher lady on an USMC base has probably heard a few things about surviving in the field (if only from the grunts complaining \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E) and fired a rifle at least once, putting her above many men from outside the military (also, she likely lives somewhere near good shelters and her unit\u0027s armory, making those things a non-issue). If there\u0027s anything that\u0027s going to retain any semblance of pre-apocalyptic structure after a civilization-destroying event, it\u0027s gonna be the western military. USMC will probably remain intact enough to retain it\u0027s own absurds, too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E NORAD and rocket forces in general would probably survive fully intact, too, since they were designed to do just that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInterestingly, all US marines are required to stay qualified on the service rifle, even paper pushers. pilots, and generals. Not sure what IPAC is though, and a quick googling wasn\u0027t enlightening.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-08-01T15:52:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EThe thing is, not everybody would have to know how to do everything. Even in modern urban society you wouldn\u0027t have to look very hard to find people who could build houses, set broken bones, \u003Cstrong\u003Ethrow pots\u003C/strong\u003E, deliver babies, design an irrigation system, train horses, and grow crops.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy wife throws pots... But only when she\u0027s really mad.\u003C/p\u003E\u003Cp\u003ESeriously though, I agree that defense and food production would be the highest priority for any organized group after such a catastrophe. As Peadar1987 pointed out, a Chicxulub size impact would be initially survivable by millions of people around the world but the after effects would be devastating to the remaining population. Stockpiles of things like machines, tools, books, food, medicine, etc. would go a long way towards ensuring the survival of human civilization, but it wouldn\u0027t be a pleasant time for anyone to be alive. Larry Niven and Jerry Pournelle did a pretty good job, I think, of describing the initial period of havoc following a comet impact in \u003Ca href=\u0022https://en.wikipedia.org/wiki/Lucifer%27s_Hammer\u0022 rel=\u0022external nofollow\u0022\u003ELucifer\u0027s Hammer\u003C/a\u003E. But heck, an event like that might be the SCA guys time to shine if they manage to survive until after the NRA yahoos run out of ammo...\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-08-01T16:24:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EGood choice! Also has the advantage of being easily portable and available in small denominations. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll trade you 1 155mm high explosive shell for 2 cases of .303?\u003C/p\u003E\n"}]}