{"TopicId":79846,"ForumId":44,"TopicTitle":"If a disaster left us with pre-industrial technology, could we become advanced again?","CreatedByName":"szputnyik","CreatedById":84032,"CreatedDateTime":"2014-07-28T15:07:59Z","PageNum":1,"Articles":[{"CreatedByName":"szputnyik","CreatedById":84032,"CreatedDateTime":"2014-07-28T15:07:59Z","Content":"\n\u003Cp\u003EI\u0027ve read somewhere a long time ago, that we have mined out all of the metals and fossil fuels on Earth that could be mined with pre-industrial technology, and if a large-scale war or a natural disaster blasted us back to the stone age, we would be stuck at a technological stage similar to the Aztecs and other Native Americans of South America, who were literate but still used Neolithic technology, because there would be no metals or hydrocarbons left in easy reach, which we could access with pre-industrial mining methods. In other words, we couldn\u0027t simply dig new mines and mine ores and coal Minecraft-style because there are none of these left that can be accessed that easily. We could have saved modern books and other information sources that would tell us how to build modern mining machines, but without raw materials, with which we could build simple machines, to build the complex mining machines needed, we would be stuck.\u003C/p\u003E\u003Cp\u003EDo you think this is true or not?\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-28T15:16:42Z","Content":"\n\u003Cp\u003EWe could still try to recycle the scrap that is left over from our industrialized past (my melting it and either try to separate the metal contents from each other, or by using it in an impure form)\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-07-28T16:03:44Z","Content":"\n\u003Cp\u003EDepends. I\u0027d say that 90% of people would die, mostly from either starvation, suicide, insanity, or simply having no idea how to survive in a wild enviroment. The death toll would skyrocket in developed, first world nations, especially among the millennial generation (And come to think of it, I don\u0027t think I\u0027d be able to maintain my sanity or my diet with stone age technology). In third-world nations, I think people would have a much better chance of survival since they aren\u0027t dependent on technological luxuries and may or may not have experienced hunger before with a good understanding of how nature works. But regarding first-world nations, we will have to see if the older generations can fill the hole of the \u0022missing\u0022 younger generations who are mostly incapable of surviving in the wilderness or without their iPhones or without internet. That\u0027s going to be a challenge.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-28T16:05:48Z\u0022 title=\u002207/28/2014 04:05  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 28, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-07-28T16:04:26Z","Content":"\n\u003Cp\u003EWe\u0027d be ....ed. No other way to put it. Unless the disaster doesn\u0027t cause nuclear powerplants to go haywire.\u003C/p\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2014-07-28T16:19:28Z","Content":"\n\u003Cp\u003EFirst off we don\u0027t need coal.\u003C/p\u003E\u003Cp\u003ECharcoal is a perfectly good substitute and is easy to make.\u003C/p\u003E\u003Cp\u003ESecondly necessity is the mother of invention, if we knew where an active iron mine was located reaching it wouldn\u0027t be hard we would just have to get creative.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-07-28T16:54:34Z","Content":"\n\u003Cp\u003EReally depends on how pre-industrial you\u0027re talking. If we jumped back to the early 19th century where we had things like water wheels, domesticated livestock, iron and steel, etc then we\u0027d be able to reimplement a fair bit. There\u0027s still masses of coal available, it might be tougher to access than before but it definitely wouldn\u0027t be out of reach to a society that well organised.\u003C/p\u003E\u003Cp\u003EAs others have said, recycling of modern materials would go a long way. Your probably talking about only meeting the demands of a substantially reduced population if we list ability to farm intensively. Things like steel can actually be smelted with pre-industrial tech, folks have been accidentally making steel during iron production for centuries. Having the knowledge of what outcome you want would shortcut centuries of trial and error. I think we\u0027d reindustrialise within a few decades. Once you\u0027ve had things like refrigeration and medicine you\u0027d want them back sooner rather than later.\u003C/p\u003E\n"},{"CreatedByName":"szputnyik","CreatedById":84032,"CreatedDateTime":"2014-07-28T17:39:42Z","Content":"\n\u003Cp\u003ELet\u0027s say an asteroid similar to the one that killed the dinosaurs strikes again. A few thousand people manage to live for a thousand years in an underground bunker system under conditions similar to the Real World of the Matrix trilogy. After emerging from the bunker, they find a devastated environment on the surface, composed of small shrub-like forests, undergrowth consisting of mostly ferns, the main components of land fauna are rodents and birds. Signs of civilization, eg. cities, structures, machines are nowhere to be seen.\u003C/p\u003E\u003Cp\u003EThe bunker is similar to a self-sustaining underground Martian base, or a generational ship, but after all these years, the systems are starting to fail, and there are no heavy industrial factories or raw materials stored down there, just some simple machines that manufacture products needed for day-to-day living from recycled materials.\u003C/p\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2014-07-28T18:11:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EWe could still try to recycle the scrap that is left over from our industrialized past (my melting it and either try to separate the metal contents from each other, or by using it in an impure form)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo! The government declared scrap as a monument to our past! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-28T18:16:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PenguinsMeep\u0022 data-cite=\u0022PenguinsMeep\u0022\u003E\u003Cdiv\u003ENo! The government declared scrap as a monument to our past! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen we have to grab our stone tipped spears and overthrow the government, for the future of our children \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2014-07-28T18:33:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EThen we have to grab our stone tipped spears and overthrow the government, for the future of our children \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWho again declare the scrap as a monument... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-07-28T19:27:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PenguinsMeep\u0022 data-cite=\u0022PenguinsMeep\u0022\u003E\u003Cdiv\u003EWho again declare the scrap as a monument... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoesn\u0027t matter, we have junkyards and landfills full of metal, and nobody will be using all these rusting cars left everywhere.\u003C/p\u003E\u003Cp\u003ETake a minute, look around you, there is metal, mostly iron, aluminium and copper, nearly everywhere.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-28T21:59:01Z","Content":"\n\u003Cp\u003EPeople are ingenious, I think we could ride out just about any disaster that leaves us with a sufficient breeding population and supporting biomass. We might have to do things a lot differently than we do now, but I don\u0027t think that would stop us. I don\u0027t think we\u0027d really stop being \u0022advanced\u0022, in the sense of being ignorant of science and technology.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-07-29T03:48:29Z","Content":"\n\u003Cp\u003EYou forget, that it is not the metals that matter, but something much much different. Even if we were blasted into the Neolithic age, I know about a piece of technology that could take us to the Bronze Age, it\u0027s called the Bellows. It\u0027s a compressible container that \u0022blows\u0022 air into a fire, making it hotter. This allows for that fire to melt metals. Then we can use those metals to make tools.\u003C/p\u003E\u003Cp\u003EPlus, that would only happen if everyone with knowledge about industrial technology died in that disaster.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-07-29T03:53:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022szputnyik\u0022 data-cite=\u0022szputnyik\u0022\u003E\u003Cdiv\u003ELet\u0027s say an asteroid similar to the one that killed the dinosaurs strikes again. A few thousand people manage to live for a thousand years in an underground bunker system under conditions similar to the Real World of the Matrix trilogy. After emerging from the bunker, they find a devastated environment on the surface, composed of small shrub-like forests, undergrowth consisting of mostly ferns, the main components of land fauna are rodents and birds. Signs of civilization, eg. cities, structures, machines are nowhere to be seen.\u003Cp\u003EThe bunker is similar to a self-sustaining underground Martian base, or a generational ship, but after all these years, the systems are starting to fail, and there are no heavy industrial factories or raw materials stored down there, just some simple machines that manufacture products needed for day-to-day living from recycled materials.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe wouldn\u0027t survive that impact. But maybe smaller. There\u0027s still the possibility of maintaining an underground forest and get charcoal from it.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-07-29T07:08:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022szputnyik\u0022 data-cite=\u0022szputnyik\u0022\u003E\u003Cdiv\u003ELet\u0027s say an asteroid similar to the one that killed the dinosaurs strikes again. A few thousand people manage to live for a thousand years in an underground bunker system under conditions similar to the Real World of the Matrix trilogy. After emerging from the bunker, they find a devastated environment on the surface, composed of small shrub-like forests, undergrowth consisting of mostly ferns, the main components of land fauna are rodents and birds. Signs of civilization, eg. cities, structures, machines are nowhere to be seen.\u003Cp\u003EThe bunker is similar to a self-sustaining underground Martian base, or a generational ship, but after all these years, the systems are starting to fail, and there are no heavy industrial factories or raw materials stored down there, just some simple machines that manufacture products needed for day-to-day living from recycled materials.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, that\u0027s a fundamentally different question to the one in the OP. Instead of just limited access to energy you\u0027re now talking about a world lacking the most basic resources such as timber and livestock.\u003C/p\u003E\u003Cp\u003EHowever, certain factors remain the same. Mankind\u0027s greatest asset would still be knowledge. We\u0027d struggle hugely in your new world, lack of decent livestock and beasts of burden would hold us back. The problem wouldn\u0027t really be ease of access to energy sources any more, we\u0027d have much more immediate problems that would stop us even getting up to the level of a confident well-organised agrarian society. We\u0027d have to get some forests planted and raise some livestock to be back in business.\u003C/p\u003E\u003Cp\u003EBut again the knowledge of where we should be heading would accelerate whatever advances we could make. We wouldn\u0027t mess about with beam engines much this time, because we know we should be heading towards turbines. Likewise we wouldn\u0027t use over or undershot waterwheels much, we know we should be using Pelton wheels, and Kaplan and Francis turbines, etc. We\u0027d understand germ theory and have better hygiene, which would make us healthier than our ancestors at equivalent tech levels were.\u003C/p\u003E\u003Cp\u003EBottom line is that unless the constrained resources completely knobbled us, we\u0027d return to higher levels of civilisation relatively quickly.\u003C/p\u003E\n"},{"CreatedByName":"christok","CreatedById":93810,"CreatedDateTime":"2014-07-29T15:13:18Z","Content":"\n\u003Cp\u003EThe story about us having digged up all the easily accessible minerals is a myth. Earlier civilisations had a harder time transporting ores and so were quite likely to make do with rubbish. Producing metal takes more fuel than ore, so they had to transport the ores to a place where fuel is plentiful or more likely find both very close together. Furthermore, there is a difference between the sort of deposit that is economical when mining by hand (depth matters more) or by machine (size matters more). Case in point: some of the earliest artisanal haematite mines in the world are still in operation in Southern Africa. (It has been used in cosmetics since thousands of years before smelting was discovered.) The iron ore that\u0027s exploitable under current market conditions still amounts to billions and billions of tonnes.\u003C/p\u003E\u003Cp\u003EOur coal won\u0027t run out anytime soon. There\u0027s something like 7x the carbon in the atmosphere still trapped in coal. Enough to realise any global warming nightmare you care to think of. Some of it is deep below the surface, true, but a lot of current coal mining is open-pit mining which pretty much implies that it\u0027s shallow enough to get to with hand tools.\u003C/p\u003E\u003Cp\u003ECharcoal, on the other hand, can not sustain iron production on an industrial scale. There\u0027s a reason Europe is no longer covered in forest--the blacksmiths burned most of it. That\u0027s why burning wood to make charcoal started being outlawed a few centuries ago, which caused the switch to coke.\u003C/p\u003E\u003Cp\u003EAnything other than steel is a rounding error in global metal production, so I\u0027m not going to discuss them in detail. Suffice to say that it would be rather difficult to access things like aluminium (2nd highest production) or magnesium (3rd) without more advanced technology. If \u0022civilisation collapses\u0022 means we don\u0027t remember how to make complex machinery, you couldn\u0027t make them. If it doesn\u0027t, Mr Gingery says you can make any machine you need from basic tools.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-29T16:01:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KASASpace\u0022 data-cite=\u0022KASASpace\u0022\u003E\u003Cdiv\u003EWe wouldn\u0027t survive that impact. But maybe smaller. There\u0027s still the possibility of maintaining an underground forest and get charcoal from it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn what basis do you say we wouldn\u0027t we survive an impact similar to the Chicxulub impact? Complex organisms like birds, reptiles, mammals, flowering plants, conifers, etc. all survived that impact just fine. And without any technology. Chances are that we\u0027d see an object like that coming some time before it hit. We may not be able to do anything to prevent it hitting, but we\u0027d know well in advance that it was coming and would probably even know where on the surface it would impact. \u003C/p\u003E\u003Cp\u003EConsider, for example, comet C/2013 A1 Siding Spring. It was discovered a year and a half before its closest approach to Mars this coming October. Were something like it to be discovered to be on a collision course with the Earth, we\u0027d have a year and a half to prepare. That\u0027s not a lot of time to convert underground mines into bunkers stockpiled with books, machines, livestock, food, fuel, etc. but you can bet it would get done. Probably it would be a very ugly period of mayhem, wars and lawlessness necessitating the imposition of marshal law, but some of humanity would be able to ride it out underground just as our mammalian ancestors likely did 66 million years ago.\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2014-07-29T16:20:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EOn what basis do you say we wouldn\u0027t we survive an impact similar to the Chicxulub impact? Complex organisms like birds, reptiles, mammals, flowering plants, conifers, etc. all survived that impact just fine. And without any technology. Chances are that we\u0027d see an object like that coming some time before it hit. We may not be able to do anything to prevent it hitting, but we\u0027d know well in advance that it was coming and would probably even know where on the surface it would impact. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EErm, sorry to burst your bubble but all the complex animals that survived were very small (ex. Just above chipmunk size) and lived underground, unlike our far larger bodies (compared to those animals) and the fact that we live mostly above ground and would need time to adjust to an underground facility.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EConsider, for example, comet C/2013 A1 Siding Spring. It was discovered a year and a half before its closest approach to Mars this coming October. Were something like it to be discovered to be on a collision course with the Earth, we\u0027d have a year and a half to prepare. That\u0027s not a lot of time to convert underground mines into bunkers stockpiled with books, machines, livestock, food, fuel, etc. but you can bet it would get done. Probably it would be a very ugly period of mayhem, wars and lawlessness necessitating the imposition of marshal law, but some of humanity would be able to ride it out underground just as our mammalian ancestors likely did 66 million years ago.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust saying that a mine is NOWHERE near livable. It\u0027d take more than a year and a half to strengthen the mine, clean it out, expand it, build sections for humans to live, eat, sleep and play, and add things like generators, a constant power supply (perhaps leave part of the original mine intact for miners to find coal?), furniture, electric wiring, plumbing, etc. Most tunnel projects take at least 2 years to complete, and this is equivalent to adding a massive expansion to a tunnel, enough to consider it its own tunnel system. Usually, tunnels take a year and a half to dig (equivalent to expanding a mine), then a year to add things like electric lights, wiring, plumbing, and backup generators. Then, they still have to add things like switches, doors, furnishing, hook up all the wiring, etc. Miners agree to a contract that specifically states the dangers of mines and mining. Even without the mining risk, I think the risk of a mine\u0027s lack of structural integrity would deter most people (including engineers) from using one. \u003C/p\u003E\u003Cp\u003EPS Building a whole new tunnel system would take even more that the 3\u002B years projected above. A time of 5\u002B years has to be expected for that, as they would have to plan where to build, add completely new infrastructure as opposed to upgrading primitive infrastructure, and still do all the things mentioned above. So, no go.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-07-29T16:53:00Z","Content":"\n\u003Cp\u003EWe don\u0027t even really need to \u003Cem\u003Elive\u003C/em\u003E in the mine, just find somewhere underground to shelter from the initial firestorm and tsunamis, probably just for a few hours or days. After that we\u0027ll probably have a horrific nuclear winter to deal with, but you can survive that with a sufficiently well-insulated wooden shack and a stockpile of food.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-29T17:04:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FCISuperGuy\u0022 data-cite=\u0022FCISuperGuy\u0022\u003E\u003Cdiv\u003EErm, sorry to burst your bubble but all the complex animals that survived were very small (ex. Just above chipmunk size) and lived underground, unlike our far larger bodies (compared to those animals) and the fact that we live mostly above ground and would need time to adjust to an underground facility.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EErm, sorry to burst YOUR bubble, but even chipmunk size mammals (among other classes or organisms) are considered to be complex organisms. Most complex organisms don\u0027t enjoy asphyxiation, starvation or being burned, yet those organisms that survived the Chicxulub impact did so without any technology. We have technologies that include hydroponics, animal husbandry, etc. \u003C/p\u003E\u003Cp\u003EAs peadar1987 pointed out, we wouldn\u0027t have to live there for years. The \u0022refugees\u0022 would only have to survive just long enough to wait out the firestorms, secondary impacts from debris kicked up by the primary impact, earthquakes and tsunamis. That is far from being beyond the realm of possibility. People work in mines and survive there just fine. Heck, there were the \u003Ca href=\u0022https://en.wikipedia.org/wiki/2010_Copiap%C3%B3_mining_accident\u0022 rel=\u0022external nofollow\u0022\u003EChilean miners\u003C/a\u003E who were trapped underground for 69 days in 2010 with very little in the way of creature comforts. Certainly there would be massive extinctions and the vast majority of humanity would die off but some people would survive to restart a civilization.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-29T17:33:39Z\u0022 title=\u002207/29/2014 05:33  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 29, 2014\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-07-29T17:27:36Z","Content":"\n\u003Cp\u003EI\u0027ve just plugged some numbers into this website: \u003Ca href=\u0022http://impact.ese.ic.ac.uk/cgi-bin/crater.cgi?dist=20000\u0026amp;distanceUnits=1\u0026amp;diam=17500\u0026amp;diameterUnits=1\u0026amp;pdens=\u0026amp;pdens_select=1500\u0026amp;vel=60\u0026amp;velocityUnits=1%CE%B8=45\u0026amp;tdens=1000\u0026amp;wdepth=200\u0026amp;wdepthUnits=1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://impact.ese.ic.ac.uk/cgi-bin/crater.cgi?dist=20000\u0026amp;distanceUnits=1\u0026amp;diam=17500\u0026amp;diameterUnits=1\u0026amp;pdens=\u0026amp;pdens_select=1500\u0026amp;vel=60\u0026amp;velocityUnits=1θ=45\u0026amp;tdens=1000\u0026amp;wdepth=200\u0026amp;wdepthUnits=1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat link should take you to the results for a \u003Cem\u003Ebig\u003C/em\u003E comet hitting us \u003Cem\u003Every\u003C/em\u003E hard. The effects are for somewhere on the opposite side of the globe.\u003C/p\u003E\u003Cp\u003EImmediate effects are actually pretty negligible.\u003C/p\u003E\u003Cp\u003EThe fireball is below the horizon and never reaches you.\u003C/p\u003E\u003Cp\u003EThe shock waves rattle plates off shelves and cause some minor structural damage\u003C/p\u003E\u003Cp\u003EVery little ejected material reaches you\u003C/p\u003E\u003Cp\u003EThe air blast is essentially just a stiff breeze\u003C/p\u003E\u003Cp\u003EThe tsunami is just 1.1m high.\u003C/p\u003E\u003Cp\u003EIf the comet hits the earth on the other side to India and China, the vast majority of people are going to survive it.\u003C/p\u003E\u003Cp\u003EIt\u0027s when agriculture collapses due to the impact winter that we\u0027re going to have to worry. I haven\u0027t been able to find a decent source for how long that would last, but maybe even that\u0027s survivable for many with rationing.\u003C/p\u003E\u003Cp\u003EEdit: If you want to play with the impact simulator yourself, it\u0027s pretty cool, and can be found here: \u003Ca href=\u0022http://impact.ese.ic.ac.uk/ImpactEffects/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://impact.ese.ic.ac.uk/ImpactEffects/\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-29T17:36:50Z\u0022 title=\u002207/29/2014 05:36  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 29, 2014\u003C/time\u003E by peadar1987\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2014-07-30T05:39:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EErm, sorry to burst YOUR bubble, but even chipmunk size mammals (among other classes or organisms) are considered to be complex organisms. Most complex organisms don\u0027t enjoy asphyxiation, starvation or being burned, yet those organisms that survived the Chicxulub impact did so without any technology. We have technologies that include hydroponics, animal husbandry, etc. \u003Cp\u003EAs peadar1987 pointed out, we wouldn\u0027t have to live there for years. The \u0022refugees\u0022 would only have to survive just long enough to wait out the firestorms, secondary impacts from debris kicked up by the primary impact, earthquakes and tsunamis. That is far from being beyond the realm of possibility. People work in mines and survive there just fine. Heck, there were the \u003Ca href=\u0022https://en.wikipedia.org/wiki/2010_Copiap%C3%B3_mining_accident\u0022 rel=\u0022external nofollow\u0022\u003EChilean miners\u003C/a\u003E who were trapped underground for 69 days in 2010 with very little in the way of creature comforts. Certainly there would be massive extinctions and the vast majority of humanity would die off but some people would survive to restart a civilization.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI never said that those weren\u0027t complex animals, I said that they were small enough to escape the blast easily and were more adapted to living in the wild with less tools.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-07-30T07:40:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022christok\u0022 data-cite=\u0022christok\u0022\u003E\u003Cdiv\u003EMr Gingery says you can make any machine you need from basic tools.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed you can. A good tinkerer can make an impressive range of stuff in a good workshop with hand tools. Machine tools just save a lot of effort. Where things start to really accelerate is when you have created tools to make more tools. That\u0027s the definition of technology, and does necessitate some infrastructure. Like you say, aluminium just isn\u0027t going to happen without a large energy surplus. Fun fact: The cap of the Washington Monument in Washington DC is aluminium, because when it was built in the 1800s aluminium was a precious metal.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-30T13:53:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FCISuperGuy\u0022 data-cite=\u0022FCISuperGuy\u0022\u003E\u003Cdiv\u003EI never said that those weren\u0027t complex animals, I said that they were small enough to escape the blast easily and were more adapted to living in the wild with less tools.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair enough, but you also said that humans couldn\u0027t live underground in hastily built bunkers where they would ride out the immediate negative effects of the comet or asteroid impact. You claimed, despite the evidence to the contrary, that we couldn\u0027t hide underground like our mammalian ancestors because mines and underground bunkers are too unpleasant.\u003C/p\u003E\u003Cp\u003EMy point, going all the way back to my original response to KASAspace that you first took exception to, was that the conditions post Chicxulub would have been survivable for properly equipped humans because multitudes of animals and plants survived that event without any technology. They had to rely on their existing adaptations. We, on the other hand, have technology that allows us to live in and adapt to a variety of harsh environments. We would also know about an impending impact long enough in advance that we could stockpile resources to allow a group of survivors to muddle through. A stockpile of books, machines, tools, medicine, fuel and food would go a long way towards getting a fairly modern society back on its feet again quickly after such an event. It wouldn\u0027t be pleasant for anyone, but human life and civilization could be reasonably expected to go on after a Chicxulub size impact.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-30T23:03:02Z\u0022 title=\u002207/30/2014 11:03  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 30, 2014\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003Cbr\u003ECleaned up post for posterity.\n\u003C/span\u003E\n"},{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2014-07-30T15:47:54Z","Content":"\n\u003Cp\u003Ein time yes,that simple\u003C/p\u003E\n"}]}