{"TopicId":80130,"ForumId":44,"TopicTitle":"CZ-9 latest design","CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-07-30T15:19:48Z","PageNum":1,"Articles":[{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-07-30T15:19:48Z","Content":"\n\u003Cp\u003EFrom the latest chinese study for super heavy life vehicles comes the latest Long March 9 design that we know of:\u003C/p\u003E\u003Cp\u003EThe core will still be 9 metres and the boosters will remain 3.35 metres, the rocket would stand about 100 metres tall. The core will have 4 yf-400 engines (400 tonnes of thrust from each I believe) and each booster will contain on yf-400 as well. Both the core and the boosters will run of lox/rp1.\u003C/p\u003E\u003Cp\u003EThe second stage will be another lox/rp1 stage with 2 yf-400 engines.\u003C/p\u003E\u003Cp\u003EThe third stage will run on lox/lh on one yf-77 engine.\u003C/p\u003E\u003Cp\u003EThe rocket could take 100 metric tonnes to LEO and 35 to TLI. In a manned lunar mission the CZ-9 would carry an extra 4th stage most likely running on lox/lh to boost the TLI to 60 metric tonnes. This could then carry a modified shenzhou and lander to the moon.\u003C/p\u003E\u003Cp\u003EAs you can see this latest design is a much more realistic goal for the CZ-9. I will take a look at the components and possible difficulties of the project:\u003C/p\u003E\u003Cp\u003EThings such as 3.35 metre boosters would be very easy for the Chinese since they have had a lot of experience with this size. The 9 metre core could prove to be problematic since Chinese engineers have had problems merely constructing a 5 metres core for CZ-5. Engine wise the yf-77\u0027s were completed in mid 2000\u0027s so no further work is required in this aspect. The yf-400 could take time due to its proposed size and power, it\u0027s 3 times more powerful then the yf-100 Chinas most powerful rp-1 engine, however China appears to be good at developing rp-1 engines so this might be a small problem. Launch wise the CZ-5 pad at Wenchang is said to be able to support rocket\u0027s capable of putting 200 metric tonnes into LEO so the CZ-9 could launch here although a new VAB would have to be constructed.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-30T15:26:43Z","Content":"\n\u003Cp\u003ELink?\u003C/p\u003E\u003Cp\u003E/10char\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-07-30T15:31:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003ELink?\u003Cp\u003E/10char\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m sorry but this was shown at a live conference/presentation, it\u0027s not on the internet at all unfortunately like a lot of Chinese projects.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-30T15:39:06Z","Content":"\n\u003Cp\u003Eoh ~_~\u003C/p\u003E\u003Cp\u003EWell... any way - looks like my prediction about Chinese being the first guys to reach the moon in a 21 century might be right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Or perhaps they\u0027ll be brave and send a first woman to the moon? Now that would be a huge blow in the self-esteem of USA.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-07-30T15:46:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003Eoh ~_~\u003Cp\u003EWell... any way - looks like my prediction about Chinese being the first guys to reach the moon in a 21 century might be right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Or perhaps they\u0027ll be brave and send a first woman to the moon? Now that would be a huge blow in the self-esteem of USA.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are, they have stated a few times that they plan to send a woman to the moon possibly on their first moon mission. It has been said that every shenzhou mission to LEO will have a women on board from now on, whether they can actually do it I don\u0027t know but we shall see.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-30T15:51:39Z","Content":"\n\u003Cp\u003EOh yea, I hear about women on Shenzhou, though I didn\u0027t know about the moon part - last time I read anything about it journalist came out with a conclusion that it\u0027s uncertain if China will go beyond LEO with it\u0027s manned missions in a first place. \u003C/p\u003E\u003Cp\u003EI\u0027m not much into Chinese space program - partially because info available in the Western media is nearly non-existent - but... yea, that will be a huge win for China. Good luck to them with that. It might be a true milestone in the history.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-07-30T15:57:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EOh yea, I hear about women on Shenzhou, though I didn\u0027t know about the moon part - last time I read anything about it journalist came out with a conclusion that it\u0027s uncertain if China will go beyond LEO with it\u0027s manned missions in a first place. \u003Cp\u003EI\u0027m not much into Chinese space program - partially because info available in the Western media is nearly non-existent - but... yea, that will be a huge win for China. Good luck to them with that. It might be a true milestone in the history.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EChina will go to the moon eventually but not right now, they have the belief on economic sustainability when it comes to space, so far it\u0027s working. But who knows, maybe they have something secret in development like a zond replica or something.\u003C/p\u003E\n"},{"CreatedByName":"Simon Ross","CreatedById":82582,"CreatedDateTime":"2014-07-30T19:37:35Z","Content":"\n\u003Cp\u003EAgain folks, be careful how much you read into this.\u003C/p\u003E\u003Cp\u003ECZ-9 is still a PAPER study, not hardware in development. In reality, it is about at the same stage as the Saturn V was in 1963 or the N1 was in 1966, with a lot less funding or political pressure.\u003C/p\u003E\u003Cp\u003ESimon\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-07-30T20:05:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Simon Ross\u0022 data-cite=\u0022Simon Ross\u0022\u003E\u003Cdiv\u003EAgain folks, be careful how much you read into this.\u003Cp\u003ECZ-9 is still a PAPER study, not hardware in development. In reality, it is about at the same stage as the Saturn V was in 1963 or the N1 was in 1966, with a lot less funding or political pressure.\u003C/p\u003E\u003Cp\u003ESimon\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know, it\u0027s just a more advanced, realistic paper project then when it started in 2010.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-07-30T20:42:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003Eoh ~_~\u003Cp\u003EWell... any way - looks like my prediction about Chinese being the first guys to reach the moon in a 21 century might be right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Or perhaps they\u0027ll be brave and send a first woman to the moon? Now that would be a huge blow in the self-esteem of USA.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst woman on the moon? Big deal.\u003C/p\u003E\u003Cp\u003EI want to see the first morbidly obese person on the moon!\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-07-31T01:25:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EFirst woman on the moon? Big deal.\u003Cp\u003EI want to see the first morbidly obese person on the moon!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe ultimate weight loss system...\u003C/p\u003E\u003Cp\u003EMy name is John and I lost 500 pounds in 3 days...\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-07-31T07:08:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xenomorph555\u0022 data-cite=\u0022xenomorph555\u0022\u003E\u003Cdiv\u003EThey are, they have stated a few times that they plan to send a woman to the moon possibly on their first moon mission. It has been said that every shenzhou mission to LEO will have a women on board from now on, whether they can actually do it I don\u0027t know but we shall see.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf they want press coverage, they should send the first cat/dog/hedgehog/sea otter on the moon. Pandas, although super cute, are endangered and shouldn\u0027t be used in space programs.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ECZ-9 is still a PAPER study, not hardware in development. In reality, it is about at the same stage as the Saturn V was in 1963 or the N1 was in 1966, with a lot less funding or political pressure.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is also a much easier design than either of these examples.\u003C/p\u003E\u003Cp\u003EThe yf 400 doesn\u0027t exist yet, but the yf 100 is a copy of the RD 120, and energomash makes engines much more powerful than the RD120, like the RD191, already twice as big as the RD120, or the RD 171, with 4 chambers. So, realistic.\u003C/p\u003E\u003Cp\u003EAlso the idea of using the same engine 8 times is very cost effective.\u003C/p\u003E\u003Cp\u003ESo yeah, it could change quite a lot before it flies, but it is a promising proposal\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-08-01T02:56:47Z","Content":"\n\u003Cp\u003EI should mention the Chinese have been developing since 2012 what is said to be a \u0022very powerful engine\u0022, much more then then the yf-100, it could be the 400 or something else. Rumours have described it as a twin chamber, closed cycle, rp-1 engine possibly developed of the rd-180 which after researching has 390 tonnes of thrust. It would seem the Chinese are one step ahead of us...\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-08-01T23:46:55Z","Content":"\n\u003Cp\u003E\u0027The Chinese\u0027 aren\u0027t doing anything, this is all CAST. It\u0027s private-venture stuff, or at least as close to private-venture as you can get with a government-owned company; it has no funding from actual government departments, and, more importantly, none of them requested this work. It doesn\u0027t represent Chinese plans any more than ULA\u0027s powerpoints of super-heavy Delta derivatives represent American plans.\u003C/p\u003E\n"},{"CreatedByName":"zhanglulutianxia2014","CreatedById":135328,"CreatedDateTime":"2015-01-13T04:24:45Z","Content":"\n\u003Cp\u003EYes, China will go to the moon eventually!!!\u003C/p\u003E\n"},{"CreatedByName":"Reddragon","CreatedById":66937,"CreatedDateTime":"2015-01-13T06:17:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EIt doesn\u0027t represent Chinese plans any more than ULA\u0027s powerpoints of super-heavy Delta derivatives represent American plans.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept one is made and controlled by an official state-run space agency and the other is a company trying to prove it\u0027s abilities for another state run agency and representatives. But you might still be right.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-01-13T06:18:32Z","Content":"\n\u003Cp\u003EThere seems to have been somewhat more government support since I posted that, but it should still be noted that CAST is not directly government-managed.\u003C/p\u003E\n"},{"CreatedByName":"Reddragon","CreatedById":66937,"CreatedDateTime":"2015-01-13T06:25:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThere seems to have been somewhat more government support since I posted that, but it should still be noted that CAST is not directly government-managed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat might be true even though it would be odd for the Chinese. Thanks for that info!\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-01-13T06:30:14Z","Content":"\n\u003Cp\u003EThey moved to indirect management in the 90s, collating a bunch of institutes into CASC (of which CAST is a part) and a competitor called CASIC. Both have diversified into commercial contracts and even non-aerospace areas since; one of CASIC\u0027s institutes rather infamously makes DF-21 ballistic missiles, cars, and refrigerators in the same factory.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2015-01-13T16:02:43Z","Content":"\n\u003Cp\u003ENot sure why this thread was pulled out of no-where but k.\u003C/p\u003E\n"}]}