{"TopicId":80530,"ForumId":44,"TopicTitle":"Point-to-Point Suborbital Flight","CreatedByName":"ptpsuborbital","CreatedById":117772,"CreatedDateTime":"2014-08-02T20:50:25Z","PageNum":1,"Articles":[{"CreatedByName":"ptpsuborbital","CreatedById":117772,"CreatedDateTime":"2014-08-02T20:50:25Z","Content":"\n\u003Cp\u003ETo those interested in learning about point-to-point suborbital flight (e.g., New York - Tokyo in under 3 hours), please visit my blog at \u003Ca href=\u0022http://ptpsuborbital.com\u0022 rel=\u0022external nofollow\u0022\u003Eptpsuborbital.com\u003C/a\u003E. I\u0027ve been posting articles and videos about the revolutionary changes coming to the commercial aerospace industry. Virgin Galactic upcoming \u0027space tourist\u0027 flights are just the beginning.\u003C/p\u003E\u003Cp\u003EThanks for reading!\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-08-03T07:58:20Z","Content":"\n\u003Cp\u003ESuborbital is useless for point to point transport. It takes much less energy, and is therefore cheaper and easier, to just go supersonic or hypersonic in the atmosphere, and we all know how that turned out for Concorde.\u003C/p\u003E\u003Cp\u003EVirgin Galactic flights are designed for zero-g joyrides that land at the launch site, not for transportation. It takes hours just for the Eve mothership to reach the SS2 drop altitude, which negates any transit time gains from the Suborbital part of the mission, and the SS2 is designed to go high, not fast.\u003C/p\u003E\n"},{"CreatedByName":"Chris P. Bacon","CreatedById":97095,"CreatedDateTime":"2014-08-03T08:17:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E and we all know how that turned out for Concorde.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, it was considered the safest aircraft in the world until some junk fell off an aging DC-10 which took off ahead of it. No one wanted to fly on her after that.\u003C/p\u003E\u003Cp\u003EIt\u0027s a shame we never replaced her with more modern and efficient designs.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-03T08:28:36Z\u0022 title=\u002208/03/2014 08:28  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 3, 2014\u003C/time\u003E by Chris P. Bacon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-08-03T10:35:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chris P. Bacon\u0022 data-cite=\u0022Chris P. Bacon\u0022\u003E\u003Cdiv\u003EYup, it was considered the safest aircraft in the world until some junk fell off an aging DC-10 which took off ahead of it. No one wanted to fly on her after that.\u003Cp\u003EIt\u0027s a shame we never replaced her with more modern and efficient designs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not only that, but also the high per-passenger cost that brought her down. It takes a lot of energy to get anything going beyond the sound barrier, no matter what we power them with.\u003C/p\u003E\u003Cp\u003EThe Air France Concorde crash from the DC-10 junk was the last drop in a cup already full.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-08-03T11:15:21Z","Content":"\n\u003Cp\u003EWith only 12 units built, it was a commercial failure decades before the Air France crash. The only reason AF and BA kept flying them was national pride.\u003C/p\u003E\u003Cp\u003EAnyway, looking at the way the OP\u0027s post was written, it looked more like a spam than a proper engagement in a discussion thread.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-08-03T11:29:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ESuborbital is useless for point to point transport. It takes much less energy, and is therefore cheaper and easier, to just go supersonic or hypersonic in the atmosphere, and we all know how that turned out for Concorde.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not about energy. If you could shoot a suborbital out of a cannon, it\u0027d be really cheap. I\u0027ve done a rough estimate, and LAX to JFK (Los Angeles to New York, about 4,000km) requires mass ratio of 1.35 under glide ratio of 7 and I\u003Csub\u003ESP\u003C/sub\u003E of 3,000s at mach 2. These are the rough numbers for a Concorde. In practice, it\u0027s a bit more due to takeoff and landing. But this is a good baseline.\u003C/p\u003E\u003Cp\u003EIn contrast, the same suborbital trajectory requires ground velocity of 5.4km/s (e = 0.72). Add 1.5km/s for atmosphere, and you need 6.9km/s for the launch. Even with LH2/LOX rocket, that still gives you mass ratio of 4.8. So that\u0027s really expensive. But only because we\u0027re using a rocket to accelerate the suborbital craft. Using, say, a launch loop, the same suborbital flight can be done for peanuts. 5.4km/s is just 4kWh / kg. In contrast, the 0.35kg of kerosene above would yield 3.9kWh / kg. So with a launch loop or similar tech, suborbital flights suddenly become quite competitive. Of course, that only makes sense if you are going to be building a launch loop for orbital launches anyways.\u003C/p\u003E\n"},{"CreatedByName":"ptpsuborbital","CreatedById":117772,"CreatedDateTime":"2014-08-03T21:29:39Z","Content":"\n\u003Cp\u003EThanks to all for replying to my post and offering your opinions. My intention was not to spam -- but merely to provide a source of information about point-to-point suborbital transportation. Whether it ever transpires or not, it\u0027s an interesting concept and one that many are taking seriously -- including the FAA.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-08-04T06:19:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003ESo with a launch loop or similar tech, suborbital flights suddenly become quite competitive. Of course, that only makes sense if you are going to be building a launch loop for orbital launches anyways.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, but notwithstanding that a launch loop is still impossible to build and highly impractical itself, there would only be one 8000km-long launch loop on Earth\u0027s equator, making it pointless for point to point travel.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-08-04T07:31:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ESure, but notwithstanding that a launch loop is still impossible to build and highly impractical itself, there would only be one 8000km-long launch loop on Earth\u0027s equator, making it pointless for point to point travel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have no idea where you got that 8,000km figure, but it\u0027s silly. At just 3G, you need less than 1,000km. Launch loop doesn\u0027t have to be equatorial, either. It\u0027s with chemical rockets every few m/s count. With launch loop, extra 400m/s isn\u0027t a huge deal.\u003C/p\u003E\u003Cp\u003EBut hey, that\u0027s just one example. The big picture is that we either figure out how to make launch to orbit cheap and routine, or we are screwed as a civilization. There aren\u0027t any alternatives. Right now, launch loop looks like the most plausible of known options. And we\u0027d need several at different latitudes and in different countries to make access to LEO convenient. We might figure out a different way to do this. But whether we find a way to push off the ground, or find a very cheap way to do reaction drives for space launches, we will need to be able to launch to orbit from multiple locations around the world at a reasonable price. And that means reasonably priced suborbital flight as a consequence.\u003C/p\u003E\u003Cp\u003EMaybe we won\u0027t get there. Then we\u0027ll suffocate on this planet and become extinct sooner or later. And that\u0027s a good enough reason to try in my books. And if economical interest in suborbital flight is going to be the thing that helps us get over that barrier, so much the better.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-08-04T09:30:55Z","Content":"\n\u003Cp\u003EWell Point-to-Point Suborbital Flight at least makes more sense than skipping across the upper atmosphere with some of those hypersonic craft proposed for the general public.\u003C/p\u003E\u003Cp\u003EGoing from micro gravity to one plus G every 5 to 15 minutes as it skips is too much for the untrained public. You\u0027ll need mandatory airsickness bags Velcroed to everyone\u0027s face. \u003C/p\u003E\u003Cp\u003EUltimately we need to find cheaper and less polluting ways of mass space flight. I can\u0027t imagine how much pollution would be generated to lift even a million people into space let alone the number of passengers you see on international flight.\u003C/p\u003E\u003Cp\u003EUnless some truly unconventional technology comes along, commercial flights for the general public I think will be just short joy rides.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-08-04T11:09:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EWell Point-to-Point Suborbital Flight at least makes more sense than skipping across the upper atmosphere with some of those hypersonic craft proposed for the general public.\u003Cp\u003EGoing from micro gravity to one plus G every 5 to 15 minutes as it skips is too much for the untrained public. You\u0027ll need mandatory airsickness bags Velcroed to everyone\u0027s face. \u003C/p\u003E\u003Cp\u003EUltimately we need to find cheaper and less polluting ways of mass space flight. I can\u0027t imagine how much pollution would be generated to lift even a million people into space let alone the number of passengers you see on international flight.\u003C/p\u003E\u003Cp\u003EUnless some truly unconventional technology comes along, commercial flights for the general public I think will be just short joy rides.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr until we are able to design the suborbital shuttles much larger than conventional planes, so that a single suborbital fligh transports the passenger load of sevral conventional planes, so that the polllution per passenger delines rapidy\u003C/p\u003E\n"},{"CreatedByName":"Firov","CreatedById":57445,"CreatedDateTime":"2014-08-04T14:30:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EOr until we are able to design the suborbital shuttles much larger than conventional planes, so that a single suborbital fligh transports the passenger load of sevral conventional planes, so that the polllution per passenger delines rapidy\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerolox is rather polluting, since it generates carbon dioxide, but something using Liquid Oxygen and Liquid Hydrogen are, in theory, completely clean. Generating only water vapor. In practice they run a bit rich and so the exhaust contains some H2, but that\u0027s largely harmless.\u003C/p\u003E\u003Cp\u003EUnfortunately, the low density and cryogenic properties can make H2 a bit of a pain to use for a first stage. Though a number of launch systems used it as a first stage propellant despite that. The Shuttle, obviously, but also the Delta IV and Ariane 5.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-08-04T14:37:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Firov\u0022 data-cite=\u0022Firov\u0022\u003E\u003Cdiv\u003EUnfortunately, the low density and cryogenic properties can make H2 a bit of a pain to use for a first stage. Though a number of launch systems used it as a first stage propellant despite that. The Shuttle, obviously, but also the Delta IV and Ariane 5.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Delta IV usually uses solids to augment it\u0027s first stage, and Shuttle and Ariane V have/had mandatory large solid boosters.\u003C/p\u003E\n"},{"CreatedByName":"Firov","CreatedById":57445,"CreatedDateTime":"2014-08-04T15:57:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EDelta IV usually uses solids to augment it\u0027s first stage, and Shuttle and Ariane V have/had mandatory large solid boosters.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuite right, for the Shuttle and Ariane 5, though there\u0027s hardly any need to even mention it since both launch platforms are so well known. The Delta IV, however, is a different matter. You\u0027re thinking of the current Delta IV Medium\u002B, which relies upon a variable number of strap-on GEM solid rocket boosters (between 2 and 4).\u003C/p\u003E\u003Cp\u003EHowever, remember. There are different variants of the Delta IV, and some of them have not relied upon those solid boosters. The original Delta IV Medium didn\u0027t, and the Delta IV Heavy also doesn\u0027t use GEM boosters. The GEM boosters were just added to give slightly more payload capacity. The Delta IV is quite capable of flying without them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-04T16:10:19Z\u0022 title=\u002208/04/2014 04:10  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 4, 2014\u003C/time\u003E by Firov\u003C/strong\u003E\n\u003C/span\u003E\n"}]}