{"TopicId":80579,"ForumId":44,"TopicTitle":"We could not create a new partition or locate an existing one. For more information,","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-08-03T09:30:35Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-08-03T09:30:35Z","Content":"\n\u003Cp\u003EWe could not create a new partition or locate an existing one. For more information, see Windows Installer log files, WTF?!?\u003C/p\u003E\u003Cp\u003E(\u003Ca href=\u0022https://answers.yahoo.com/question/index?qid=20140803021340AA5bj3J\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://answers.yahoo.com/question/index?qid=20140803021340AA5bj3J\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003EI need re install my Windows 8.1 (upgraded from 8) I want clean install so i used opportunity when i bought new HDD, i already have two ( one 500 gb and other one 300 gb from my previous computer) \u003C/p\u003E\u003Cp\u003EI bought 2 TB my friend saw something is not right becuase windows saw them as two separate 2 TB drive, my firend feel that somethng is not right he advised me to use only one (G) but not use H drive. I copied all my files from C \u0026amp; D drive into G, than formatted D, and than Run install of win 8 to clean install, but the isntalattion menu dosen\u0027t saw my new 2TB i need help\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-03T11:44:53Z","Content":"\n\u003Cp\u003EThis is a bug I encountered. Windows 8 wants to put a \u0022System Reserved\u0022 partition on whatever it thinks is drive 0, ie the first drive it sees. If that drive is already in use you get the error.\u003C/p\u003E\u003Cp\u003EThe workaround I used was to disconnect all drives but the one I want Windows 8 on.\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2014-08-03T17:02:34Z","Content":"\n\u003Cp\u003Eyeah I used to have this problem with Win 7 installs too.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-08-03T22:38:17Z","Content":"\n\u003Cp\u003EThanks to my KSP friend and now also personal friend problem ware partially resolved, but now windows 8.1 not see my 2TB drive( it see it\u0027s as protected file storage.\u003C/p\u003E\u003Cp\u003EAnyway\u003C/p\u003E\u003Cp\u003EThanks Nao:D\u003C/p\u003E\u003Cp\u003EEDIT: \u003C/p\u003E\u003Cp\u003Ethe only difficulty is that i lost all my data stored on my 2 TB drive, system saw is as protected partition, and i and Nao (through mostly him) working on how unprotect protected partition. \u003C/p\u003E\u003Cp\u003EI do not know how it could happen, usually alone did reformat the drive and everything worked A-OK\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-04T11:26:13Z\u0022 title=\u002208/04/2014 11:26  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 4, 2014\u003C/time\u003E by Pawelk198604\u003C/strong\u003E\n\u003C/span\u003E\n"}]}