{"TopicId":81642,"ForumId":44,"TopicTitle":"What\u0026#039;s better, 2-3 small mars colony\u0026#039;s or one bigger one","CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-08-13T21:06:28Z","PageNum":1,"Articles":[{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-08-13T21:06:28Z","Content":"\n\u003Cp\u003EIn your opinion what is better socially, economically, politically, etc for mars.\u003C/p\u003E\u003Cp\u003EA few small marsone-esqe bases with 8-16 people in each, funded by different sources, maybe China tries to rival Marsone with Marstwo. All different locations.\u003C/p\u003E\u003Cp\u003EA larger single colony funded by multiple different entities and maybe has 30\u002B people.\u003C/p\u003E\u003Cp\u003EPersonally I would go with a few small bases:\u003C/p\u003E\u003Cp\u003ENo political screw-up: ISS-Ukraine.\u003C/p\u003E\u003Cp\u003ECheaper: $100 billion dollar ISS.\u003C/p\u003E\u003Cp\u003EMore and faster growth potential.\u003C/p\u003E\u003Cp\u003EIf one falls there is a contingency: base ruined somehow, temporarily move to other base.\u003C/p\u003E\u003Cp\u003EI always thought it would be better if all the space nations had a small salyut, then you wouldn\u0027t need a complicated ISS.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-08-13T21:16:01Z","Content":"\n\u003Cp\u003EFrom a scientific point of view smaller ones spread around in different geological areas would be better. I guess a big base could only beat this if it was a station for a long-range rover which was capable of reaching a large portion of the planet.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-08-13T21:20:41Z","Content":"\n\u003Cp\u003EDon\u0027t put all your eggs in one basket.\u003C/p\u003E\u003Cp\u003EUnless they\u0027re lonely.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-13T21:36:05Z","Content":"\n\u003Cp\u003EMultiple colonies would require much duplication of effort and skills. It seems like one colony is the way to go until a sustainable breeding population is established.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-08-13T21:36:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Airbornem4\u0022 data-cite=\u0022Airbornem4\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EUnless they\u0027re lonely.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t worry these people were chosen from the internet, their used to being alone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-08-13T21:40:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EMultiple colonies would require much duplication of effort and skills. It seems like one colony is the way to go until a sustainable breeding population is established.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECame here to say this. Why have 4 hospitals, one each for about ~5 people when a single one would suffice just fine for 20?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-08-13T21:47:23Z","Content":"\n\u003Cp\u003Eyou need to build the colonies where the resources are, and chances are they are not all in one spot.\u003C/p\u003E\u003Cp\u003Eyou are going to get a fair bit of inter base trade, and so you need a means of transport. rovers dont cut it unless your bases are in driving distance. aircraft are a maybe but they are going to need to be vtols to operate safely (runway landings on mars seem a little scary). id imagine reusable ballistic rockets being the best option, given the low gravity and ease of making methane and oxygen from the mars atmosphere and subsurface water.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003ECame here to say this. Why have 4 hospitals, one each for about ~5 people when a single one would suffice just fine for 20?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou might have a small first aid station at each base, but only one fully equipped hospital at the largest base. every base just has to have a medivac rocket for emergencies. its engine would be throttled for 1g if the patient surviving the trip is a concern.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-13T22:15:58Z\u0022 title=\u002208/13/2014 10:15  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 13, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-08-13T22:07:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003ECame here to say this. Why have 4 hospitals, one each for about ~5 people when a single one would suffice just fine for 20?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERedundancy is pretty important when you\u0027re millions of miles away from help. What are you gonna do if you only build one medical facility and it gets overrun with space weevils?\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-08-13T22:09:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moar Boosters\u0022 data-cite=\u0022Moar Boosters\u0022\u003E\u003Cdiv\u003ERedundancy is pretty important when you\u0027re millions of miles away from help. What are you gonna do if you only build one medical facility and it gets overrun with space weevils?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey should be bringing an exterminator so that doesn\u0027t happen.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-08-13T22:12:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EMultiple colonies would require much duplication of effort and skills. It seems like one colony is the way to go until a sustainable breeding population is established.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is a sensible thought, but keep in mind that \u0022a sustainable breeding population\u0022 in humans has been found to be roughly 200 people - and even then only with a way to inject a fresh round of genetic material once at some later point, either from a second round of settlers arriving or from taking along a bank of frozen sperm.\u003C/p\u003E\u003Cp\u003EProbably 300 without that one-time refresher requirement.\u003C/p\u003E\u003Cp\u003EI doubt we\u0027re going to see that kind of colony size for the first generation or two of human habitation on Mars, even if the supporters of permanent habitation make such a thing happen.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2014-08-13T22:18:28Z","Content":"\n\u003Cp\u003EYou have to ask yourself what the purpose of these colonies is.\u003C/p\u003E\u003Cp\u003EIf only there is some kind of place on earth with an extremely hostile environment where we do scientific research *cough antarctica cough*. How would we do it there?\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-08-13T22:19:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moar Boosters\u0022 data-cite=\u0022Moar Boosters\u0022\u003E\u003Cdiv\u003ERedundancy is pretty important when you\u0027re millions of miles away from help. What are you gonna do if you only build one medical facility and it gets overrun with space weevils?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou may be underestimating the difficulty in one colony\u0027s inhabitants moving to another colony when their med bay gets destroyed. This won\u0027t be a road trip, it\u0027ll be more like walking thousands of km in a space suit.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-08-13T23:32:12Z","Content":"\n\u003Cp\u003EIf your main concern is colonizing and you have to keep your budget down, then a single larger base is the most practical.\u003C/p\u003E\u003Cp\u003EJust spread the buildings out so they are a hundred meters apart, string them out over a kilometer or so and cover them with a few meters of soil.\u003C/p\u003E\u003Cp\u003EThat will help protect you from a bad landing of failed take off. The only other big localized disaster I can think of is a earth/mars quake.\u003C/p\u003E\u003Cp\u003EIf any big quakes even happen on Mars at all? But they must be very very rare and you can\u0027t protect against everything.\u003C/p\u003E\u003Cp\u003EI\u0027ve heard zoologist taking about endangered mammal species needing a breeding population of at least 2000 to prevent long term inbreeding under natural circumstances.\u003C/p\u003E\u003Cp\u003EThe first few generations could rely on frozen embryos, but if nations become serious about colonizing Mars I think they can get a few thousand people there before inbreeding becomes an issue.\u003C/p\u003E\u003Cp\u003EI don\u0027t think you can get away from politics, you just have to deal with them. I like my family, but I can also argue politics all day with them too.\u003C/p\u003E\u003Cp\u003ESocially a bigger colony is better too. You have a better chance of finding people you want to spend your off time with. Larger populations are better at finding solutions to problems that come up as well and you have more people to get the job done quicker.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-08-13T23:55:14Z","Content":"\n\u003Cp\u003EOne fact I would like to point out is that multiple colonies would allow is a wider resource base.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-08-14T00:06:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EYou may be underestimating the difficulty in one colony\u0027s inhabitants moving to another colony when their med bay gets destroyed. This won\u0027t be a road trip, it\u0027ll be more like walking thousands of km in a space suit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d imagine a semi-permanent base would have some sort of rover. The Lunar rovers had a range of about 100km and that was with non-rechargable 1970\u0027s batteries. You\u0027re obviously not going to even try if the other base is thousands of kilometers away....... but if the aim is for a semi cooperative program, then you wouldn\u0027t position your base 1000\u0027s of kilometers away from the others...... you\u0027d find a site of geological interest that was closer to others.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-08-14T09:14:34Z","Content":"\n\u003Cp\u003Esurface to surface rocket travel shouldn\u0027t be much of an issue on mars. so long as both destination and origin both have the means to produce fuel, and that is going to be the first thing you set up when you get there. you need o2 and water for your base anyway. if you have the former you can make the latter, with hydrogen as a byproduct. then by using the atmosphere you get additional o2 (oxidizer), you have carbon as a byproduct. put the byproducts together you have methane (fuel). so the perquisites for life on mars are also the perquisites for inter-base transport. ultimately the availability of subsurface water will dictate how much moving around mars residents do.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-08-14T10:18:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor all of which you will need lots of power - the sun is far away, the air/wind is thin, no running bodies of water, geothermal power is questionable, fossil fuels non-existent/impractical without readily available oxygen.\u003C/p\u003E\u003Cp\u003EBest option - without starting to trash a second planet with waste products from nuclear power generation - is to use solar energy for heating, light and water production, and also for transportation. Rocket taxis are not really economical.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-08-14T10:49:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EFor all of which you will need lots of power - the sun is far away, the air/wind is thin, no running bodies of water, geothermal power is questionable, fossil fuels non-existent/impractical without readily available oxygen.\u003Cp\u003EBest option - without starting to trash a second planet with waste products from nuclear power generation - is to use solar energy for heating, light and water production, and also for transportation. Rocket taxis are not really economical.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA small nuclear reactor in a martian base is highly likely. Not necessarily as a primary power source, but if they found water they could use the energy from the reactor to combine it with CO2 from the atmosphere to produce methane, which would give them all sorts of power options. A small reactor wouldn\u0027t produce a large amount of waste, but could power a large methane processing facility.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-08-14T12:27:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moar Boosters\u0022 data-cite=\u0022Moar Boosters\u0022\u003E\u003Cdiv\u003EA small nuclear reactor in a martian base is highly likely. Not necessarily as a primary power source, but if they found water they could use the energy from the reactor to combine it with CO2 from the atmosphere to produce methane, which would give them all sorts of power options. A small reactor wouldn\u0027t produce a large amount of waste, but could power a large methane processing facility.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI imagine a small submarine type reactor that doesn\u0027t have to be refueled for 30 years.\u003C/p\u003E\n"},{"CreatedByName":"The Pink Ranger","CreatedById":116650,"CreatedDateTime":"2014-08-14T12:30:17Z","Content":"\n\u003Cp\u003ESustainable breeding? Pair me up and ship me out! Ahahahahaha\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-08-14T12:31:52Z","Content":"\n\u003Cp\u003EI think Sandia Labs it was who actually built a small nuclear reactor for space application, for the cancelled Jupiter Icy Moons Orbiter. Put a dirt hill between it and your base and you got yourself a fairly long lasting power source. Combining that with concentrating photovoltaic arrays and fuel cells or batteries would cover all the power needs of a small colony.\u003C/p\u003E\u003Cp\u003E@Thread: Multiple colonies are better from a chance of success-point of views, but perhaps less economical. It\u0027ll most likely happen that way anyway.\u003C/p\u003E\n"},{"CreatedByName":"TheGatesofLogic","CreatedById":58468,"CreatedDateTime":"2014-08-14T15:20:20Z","Content":"\n\u003Cp\u003ENo need even for that, nuclear reactors actually are very safe unless you\u0027re essentially giving the core a bear hug. The walls of the reactor ought to be good enough for government work. And if you want to be extra careful just stick it like 30 meters away from the living area and your perfectly safe\u003C/p\u003E\n"},{"CreatedByName":"RockoDyne","CreatedById":106891,"CreatedDateTime":"2014-08-14T18:18:35Z","Content":"\n\u003Cp\u003EThe likelihood is that larger installations will be self-sustainable and more fail-safe. It would have redundant systems that provide a much safer margin for failure and more extensive facilities to repair, replace, and expand systems.\u003C/p\u003E\u003Cp\u003EThe irony of mars colonization is that it\u0027s not about putting people on mars. It\u0027s about putting a system on mars that will then make the colony. Just putting people on mars doesn\u0027t accomplish much since they can\u0027t do anything. The amount of work someone can do outside a habitat is limited, so most of the work a person can do involves taking care of themselves.\u003C/p\u003E\n"},{"CreatedByName":"Borklund","CreatedById":48144,"CreatedDateTime":"2014-08-14T18:27:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheGatesofLogic\u0022 data-cite=\u0022TheGatesofLogic\u0022\u003E\u003Cdiv\u003ENo need even for that, nuclear reactors actually are very safe unless you\u0027re essentially giving the core a bear hug. The walls of the reactor ought to be good enough for government work. And if you want to be extra careful just stick it like 30 meters away from the living area and your perfectly safe\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd if that reactor fails?\u003C/p\u003E\u003Cp\u003ENuclear power is not a long-term solution for a Mars colony of any reasonable (non-Earth) size.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-08-14T18:30:10Z","Content":"\n\u003Cp\u003EWell yeah, but that also applies on Earth, not to the same extent, but I don\u0027t see anyone build a bigass greenhouse by hand alone. Most big construction jobs are done using machinery. Little of that would change on Mars, exept using even more machinery, either with pressurized cabins or via telepresence from within the colony.\u003C/p\u003E\u003Cp\u003ENuclear power is one of two long term solutions for a Mars colony, the other being solar. In 3-400 years maybe even wind power.\u003C/p\u003E\n"}]}