{"TopicId":81998,"ForumId":44,"TopicTitle":"Spaceplane Carrier Landings?","CreatedByName":"Sauron","CreatedById":69931,"CreatedDateTime":"2014-08-17T22:15:18Z","PageNum":1,"Articles":[{"CreatedByName":"Sauron","CreatedById":69931,"CreatedDateTime":"2014-08-17T22:15:18Z","Content":"\n\u003Cp\u003EObviously, this is a terrible idea with no serious real world applications. Objectively terrible. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EPutting that bit aside, suppose a deranged maniac held a gun to the world\u0027s collective head and \u003Cem\u003Edemanded\u003C/em\u003E that somebody stick a carrier landing with a space shuttle orbiter (or something of a similar size and similar aerodynamic characteristics)...\u003C/p\u003E\u003Cp\u003EA few ground rules:\u003C/p\u003E\u003Cp\u003E-Modest modifications to the orbiter are okay (I assume reinforced landing gear, strengthened airframe, and an arrestor hook are all non-negotiable). Major changes to aerodynamics or any type of propulsion are forbidden.\u003C/p\u003E\u003Cp\u003E-Larger modifications to the carrier are okay (strengthened flight deck, a bespoke arrestor system, etc.).\u003C/p\u003E\u003Cp\u003ESo how would you do this?\u003C/p\u003E\n"},{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2014-08-17T22:19:42Z","Content":"\n\u003Cp\u003EWell, considering that you wouldn\u0027t be coming in much faster than a fighter jet landing on a carrier, why try to reinvent the wheel? Arrestor cables and landing hook, reinforced airframe and landing gear would probably do the trick. Oh, and some atmospheric engines for a possible touch and go if needed. You\u0027d have to be one hell of a pilot to accomplish a carrier landing with a glider.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-08-17T22:29:28Z","Content":"\n\u003Cp\u003EThe space shuttle weighs three times as much and lands 50% faster than a typical fighter jet.\u003C/p\u003E\u003Cp\u003ELanding a fighter jet on a carrier is already considered a controlled crash landing. Even with serious modifications on both ends this would be all but impossible. So how would you do this? You don\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-08-17T23:57:14Z","Content":"\n\u003Cp\u003ESpeaking as someone who has a whole lot of stick time in FSX shooting carrier approaches (some of them engines-out), I would personally avoid it if at all possible \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe carrier approach uses throttles to maintain glideslope, and a shuttle has no throttles on landing. Plus no ability to go around in the event of a \u0022bolter\u0022.\u003C/p\u003E\u003Cp\u003E You can make a successful dead-stick approach to a carrier, but you don\u0027t want to have to. But if you *have* to...\u003C/p\u003E\u003Cp\u003E Take a \u0022charlie\u0022 on arrival. Keep your approach high and clean until you actually see the ball, then dirty up for landing at about 3/4 NM. You will want to maintain a steep glideslope and red/ fast AoA until 1/4 NM. Find your glideslope there and hope that your AoA doesn\u0027t go too slow before you hit the ramp.\u003C/p\u003E\u003Cp\u003E And be prepared to eject, because things can still easily go wrong even if everything goes \u0022right\u0022. \u003C/p\u003E\u003Cp\u003EBeen there done that,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-08-18T00:09:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003ESpeaking as someone who has a whole lot of stick time in FSX shooting carrier approaches (some of them engines-out), I would personally avoid it if at all possible \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EThe carrier approach uses throttles to maintain glideslope, and a shuttle has no throttles on landing. Plus no ability to go around in the event of a \u0022bolter\u0022.\u003C/p\u003E\u003Cp\u003E You can make a successful dead-stick approach to a carrier, but you don\u0027t want to have to. But if you *have* to...\u003C/p\u003E\u003Cp\u003E Take a \u0022charlie\u0022 on arrival. Keep your approach high and clean until you actually see the ball, then dirty up for landing at about 3/4 NM. You will want to maintain a steep glideslope and red/ fast AoA until 1/4 NM. Find your glideslope there and hope that your AoA doesn\u0027t go too slow before you hit the ramp.\u003C/p\u003E\u003Cp\u003E And be prepared to eject, because things can still easily go wrong even if everything goes \u0022right\u0022. \u003C/p\u003E\u003Cp\u003EBeen there done that,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I read you throttle up during carrier landings, this is so you can take off again if you miss, if you grab the engine running is a minor issue. \u003C/p\u003E\u003Cp\u003EAn unpowered landing on carrier, forget it, what if you come in too low? It might have worked during WW2 but not today \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-08-18T00:15:25Z","Content":"\n\u003Cp\u003E^ Reviewing my FSX logbook, I have exactly 3,458 hours, all of it carrier ops. In all that time I have only had the opportunity to shoot 3 dead stick carrier approaches. 2 were successful (1 in an F-35 and 1 in an F-14D) and 1 was not (RA-5C Vigilante).\u003C/p\u003E\u003Cp\u003E IRL, NATOPS excludes dead stick carrier approaches as illegal and the Superbug loses all control authority with engines out, so it\u0027s just plain not possible.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-08-18T00:23:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EAs I read you throttle up during carrier landings, this is so you can take off again if you miss, if you grab the engine running is a minor issue. \u003Cp\u003EAn unpowered landing on carrier, forget it, what if you come in too low? It might have worked during WW2 but not today \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E That\u0027s an important part of it, but it\u0027s not all. The glideslope is a fixed angle coming up from the #3 wire, which the pilot can see from the fresnel lens. Adjusting to stay on glideslope requires a throttle input, while staying \u0022on speed\u0022 according to the AoA indexer requires a pitch correction. Keeping the lineup is a bank and heading thing, which is trickier than it sounds, since the runway is always drifting out to the right from under you.\u003C/p\u003E\u003Cp\u003E Point is, without throttles, you can\u0027t maintain an on speed/ on glideslope indication. You will eventually end up slow and low without the ability to go around. This means a ramp strike, which is very bad news.\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"No one","CreatedById":112131,"CreatedDateTime":"2014-08-18T00:48:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sauron\u0022 data-cite=\u0022Sauron\u0022\u003E\u003Cdiv\u003E-Larger modifications to the carrier are okay (strengthened flight deck, a bespoke arrestor system, etc.).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre modifications which make the carrier larger ok?\u003C/p\u003E\u003Cp\u003EMake the carrier so massive that the difficulties of landing on it disappear. (I assume that they would if you made it large enough. Is there a difficulty other than that the carrier is moving? If you made it large enough then the motion wouldn\u0027t really matter because if you aimed for the middle of the carrier then by the time you arrived it might have moved a bit but you would still be on the carrier. I think.)\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-08-18T02:08:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022No one\u0022 data-cite=\u0022No one\u0022\u003E\u003Cdiv\u003EAre modifications which make the carrier larger ok?\u003Cp\u003EMake the carrier so massive that the difficulties of landing on it disappear. (I assume that they would if you made it large enough. Is there a difficulty other than that the carrier is moving? If you made it large enough then the motion wouldn\u0027t really matter because if you aimed for the middle of the carrier then by the time you arrived it might have moved a bit but you would still be on the carrier. I think.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E The difficulty isn\u0027t in the size of the carrier. The difficulty is in contacting the carrier with just the right AoA, airspeed, and lineup. If any of those are out of limits, your \u0022controlled crash\u0022 becomes a plain old \u0022crash\u0022. Too much sink rate and your landing gear collapses. Too much AoA and you destroy the airframe, rupturing the fuel cells. Too much airspeed and you snap the wire. Too far off center and you flip the plane.\u003C/p\u003E\u003Cp\u003E Carrier landings are *dangerous*! The way they mitigate the hazard is by shooting the approach in the middle of the \u0022safe\u0022 zone. You can\u0027t do that with no engines. You are forced to approach the carrier outside of the safe envelope and hope that you are within the safe parameters when you hit the deck.\u003C/p\u003E\u003Cp\u003E I\u0027d recommend getting some time actually doing carrier ops to see what I\u0027m talking about. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022www.fsxcarrierops.com\u0022 rel=\u0022external nofollow\u0022\u003Ewww.fsxcarrierops.com\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m \u0022K6952\u0022 over there.\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-18T02:11:15Z","Content":"\n\u003Cp\u003EThe Buran landed within feet of its target on its one, unmanned flight.\u003C/p\u003E\u003Cp\u003ENo one said it had to be a manned vessel, right?\u003C/p\u003E\n"},{"CreatedByName":"No one","CreatedById":112131,"CreatedDateTime":"2014-08-18T02:19:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EThe difficulty isn\u0027t in the size of the carrier. The difficulty is in contacting the carrier with just the right AoA, airspeed, and lineup. If any of those are out of limits, your \u0022controlled crash\u0022 becomes a plain old \u0022crash\u0022. Too much sink rate and your landing gear collapses. Too much AoA and you destroy the airframe, rupturing the fuel cells. Too much airspeed and you snap the wire. Too far off center and you flip the plane.\u003Cp\u003E Carrier landings are *dangerous*! The way they mitigate the hazard is by shooting the approach in the middle of the \u0022safe\u0022 zone. You can\u0027t do that with no engines. You are forced to approach the carrier outside of the safe envelope and hope that you are within the safe parameters when you hit the deck.\u003C/p\u003E\u003Cp\u003E I\u0027d recommend getting some time actually doing carrier ops to see what I\u0027m talking about. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.fsxcarrierops.com\u0022 rel=\u0022external nofollow\u0022\u003Ewww.fsxcarrierops.com\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m \u0022K6952\u0022 over there.\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy mistake, I thought the problem was that the carrier was small and (more importantly) moving.\u003C/p\u003E\u003Cp\u003EIf you had a large enough carrier, couldn\u0027t you slow it down without a wire though?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-08-18T02:57:55Z","Content":"\n\u003Cp\u003Eyou need a couple nuclear reactors, but thats ok, carriers have those. then you need a laser, carriers probibly have these too. then you need an atmospheric laser thermal engine that is small enough to cram into a space shuttle and powerful enough to allow it to maintain altitude. ??? profit.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-08-18T03:11:45Z","Content":"\n\u003Cp\u003EIf relatively minor modifications are not allowed, then building bigger carrier is not an option too. Besides, it would take years \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"General Rarity","CreatedById":67829,"CreatedDateTime":"2014-08-18T05:00:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003E, then building bigger carrier is not an option too. Besides, it would take years \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut it\u0027d be \u003Cem\u003Ecool\u003C/em\u003E...\u003C/p\u003E\n"},{"CreatedByName":"No one","CreatedById":112131,"CreatedDateTime":"2014-08-18T05:18:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EIf relatively minor modifications are not allowed, then building bigger carrier is not an option too. Besides, it would take years \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe OP said:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sauron\u0022 data-cite=\u0022Sauron\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E-Larger modifications to the carrier are okay\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI simply want to modify the carrier to make it larger. I don\u0027t know if this would count as one of the accepted \u0022larger\u0022 modifications or if it would be too major. Also, I think the issue is what you\u0027re modifying. The OP said that only modest modifications to the orbiter were OK while larger modifications to the carrier were OK.\u003C/p\u003E\n"},{"CreatedByName":"Nao","CreatedById":23462,"CreatedDateTime":"2014-08-18T05:25:29Z","Content":"\n\u003Cp\u003EIf i had to go \u0022Kerbal\u0022 on the concept... I would set up an aerial refueling of the OMS during the 2minute window of descent with a specially fitted KC-135 to supply hypergolic fuel (lol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E). And having a shallower and more controlled descent with the use of rocket engines. (actually the refueling could be set up in a way so that the shuttle would be towed during it to have more time for fuel transfer)\u003C/p\u003E\u003Cp\u003EAnother thing that comes to mind is the operation Credible Sport, where a C-130 was fitted with short burn rockets to rapidly slow down. It\u0027s a proven concept (within kerbal safety marigins) even thou the mission itself was scrapped, and empty SS is only like twice the weight of C-130 so it\u0027s not that much different (lol2). So in short, MOAR BOOSTERS could do the trick!\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-08-18T06:57:20Z","Content":"\n\u003Cp\u003EThe orbiter has to hit the runway without an engine to throttle too - so I do not see any difference.\u003C/p\u003E\u003Cp\u003EThe carrier might have to be equipped with more cables to grab onto, basically all along the flight deck, but else ... ?\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-08-18T09:04:54Z","Content":"\n\u003Cp\u003EWell, no one said that the carrier had to be able to land OTHER planes, or the shuttle able to land anywhere ELSE, or be re-useable...\u003C/p\u003E\u003Cp\u003EWould it be possible to alter the carrier and/or the shuttle to allow a more intense impact? Replace the landing gear on the shuttle with skids bolted into the frame? Since we don\u0027t need to take off again, would replacing the flight deck with some sort of sand or other more giving material help slow and cushion it?\u003C/p\u003E\u003Cp\u003EThis is coming from someone with 0 hours on any real simulator more complex than Warthunder\u0027s arcade mode, so this might be entirely unworkable.\u003C/p\u003E\n"},{"CreatedByName":"RocketscientistV","CreatedById":80703,"CreatedDateTime":"2014-08-18T10:09:41Z","Content":"\n\u003Cp\u003EAircraft carriers are already equipped with an net to land planes without carrier modifications. If you want to land a carrier this is what you want to modify.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-08-18T11:16:20Z","Content":"\n\u003Cp\u003ETake the main engines out of the orbiter and put them on the launcher. Just have OMS on the orbiter. This would save a lot of weight and make the glideslope and landing speed easier to deal with.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-08-18T11:29:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003ETake the main engines out of the orbiter and put them on the launcher. Just have OMS on the orbiter. This would save a lot of weight and make the glideslope and landing speed easier to deal with.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf this was an option don\u0027t you think NASA would have designed it that way?\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-08-18T11:43:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EIf this was an option don\u0027t you think NASA would have designed it that way?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey didn\u0027t do it because they did recover the engines. However Buran proved that the main engines don\u0027t have to be on the orbiter for shuttles.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-08-18T11:48:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EIf this was an option don\u0027t you think NASA would have designed it that way?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBuran\u003C/p\u003E\u003Cp\u003E10 chars\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2014-08-18T11:55:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022No one\u0022 data-cite=\u0022No one\u0022\u003E\u003Cdiv\u003EMy mistake, I thought the problem was that the carrier was small and (more importantly) moving.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoesn\u0027t matter how big the carrier is, you still have to hit the arrestor. Buran demonstrated the needed precision but I don\u0027t know if a carriers motions are predictable enough. Maybe given perfect weather conditions.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf you had a large enough carrier, couldn\u0027t you slow it down without a wire though?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027d need an 8000\u0027 flight deck, the largest current carriers have a 1092\u0027 flight deck. But if you did have a carrier that big - which the military isn\u0027t interested in, because a fighter doesn\u0027t need that length of runway under any conditions - you could land a shuttle on it so long as you can touch down very close to the start of the runway. The longer the flight deck the more margin for error you have.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2014-08-18T12:47:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022colmo\u0022 data-cite=\u0022colmo\u0022\u003E\u003Cdiv\u003EThe Buran landed within feet of its target on its one, unmanned flight.\u003Cp\u003ENo one said it had to be a manned vessel, right?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Burans target wasn\u0027t moving, though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EIf you could strengthen a shuttle enough to take the force of a carrier landing, and add a hook to it (without compromising the head shield), I think the main thing you need is more and/or bigger spoilers, so you can control your glide slope. I wouldn\u0027t want to do it, though, as you\u0027d only get one shot...\u003C/p\u003E\n"}]}