{"TopicId":84193,"ForumId":44,"TopicTitle":"Devastating Report On Record Greenhouse Gas Levels","CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-09-09T12:34:23Z","PageNum":3,"Articles":[{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-09T23:24:24Z","Content":"\n\u003Cp\u003EIt\u0027s the actual amount that matters, not the percentage. The other gases on earth-the other 99.951%-are going to be a huge part of global warming, despite the lesser per-mole effect, simply because of how much there is of them. We don\u0027t worry about them because adding significantly would be pretty much impossible, but they are most of the existing effect. On mars, you \u003Cem\u003Eonly\u003C/em\u003E have CO\u003Csub\u003E2\u003C/sub\u003E-more than on earth, but far less total atmosphere than on earth. Combine that with less sunshine to work with and you get lower temperatures.\u003C/p\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2014-09-09T23:59:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hal\u0022 data-cite=\u0022Hal\u0022\u003E\u003Cdiv\u003EDarnok, Mars\u0027 atmospheric pressure is, on average, 600 Pa compared to Earth\u0027s average of 101,300 Pa. That, combined with being much farther from the sun than the rest of the terrestrial planets, is the reason that its high CO2 concentration doesn\u0027t make it boiling, because it actually has very little CO2. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt has little that means global warming should be on Mars, just bit slower than on Earth, don\u0027t forget that Mars is smaller and doesn\u0027t have cool oceans.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hal\u0022 data-cite=\u0022Hal\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou say there\u0027s just extreme weather for a short transition period (I\u0027m assuming you mean while the Earth warms up), but if we keep pumping CO2 into the air the world will keep heating up, and even if it stopped 100 years from now for some magical reason, the weather would still more extreme on average (more energy in the system).\u003C/p\u003E\u003Cp\u003EWhile more CO2 is good for plants, technically speaking, we don\u0027t need more oxygen (too much is actually harmful), and the effects of CO2 on the climate are far worse. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe do need more oxygen, 100\u002Bmln years ago there was more oxygen and it was great for plans and animals, why you think it can be bad for humans?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hal\u0022 data-cite=\u0022Hal\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou also seem to be getting climate and weather confused. We kind of suck at predicting day-to-day weather (I think a coin toss for rain over the next 3 days is better than our predictions), but we have a pretty good grip on how climate works. While weather is just day-to-day stuff, climate is the general weather of an area over long periods of time (years or more), and is a completely different deal for prediction compared to weather. Climate includes weather, in a way. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know the difference, but if you can\u0027t predict weather in climate, how can you be sure you can predict climate? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hal\u0022 data-cite=\u0022Hal\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELastly, although this is getting somewhat off topic, governments being in debt is a pretty natural thing (the USA has been for most of its history, and it\u0027s done well enough). Also, just because a country has bad economic policies does not mean you should ignore what it says on scientific matters. Being skeptical is good, but ignoring facts from some of the most reliable sources you can find is not.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECountries being in debt is NOT NATURAL SIR!!! Look at history, every country that had debt was destroyed by stronger country without debt.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-10T00:18:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003EIt has little that means global warming should be on Mars, just bit slower than on Earth, don\u0027t forget that Mars is smaller and doesn\u0027t have cool oceans.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E There seems to be a fundamental misunderstanding here; CO\u003Csub\u003E2\u003C/sub\u003E doesn\u0027t cause global warming, increasing levels of CO\u003Csub\u003E2\u003C/sub\u003E (or other greenhouse gasses) cause global warming. Mars\u0027 levels are constant on average.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI know the difference, but if you can\u0027t predict weather in climate, how can you be sure you can predict climate? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m about to flip a coin. Will it come up heads or tails?\u003C/p\u003E\n"},{"CreatedByName":"Aningaaq","CreatedById":99814,"CreatedDateTime":"2014-09-10T02:25:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m about to flip a coin. Will it come up heads or tails?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs your point that one can predict multiple scenarios? In your analogy: 2 scenarios?\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-10T02:29:48Z","Content":"\n\u003Cp\u003EMy analogy is it\u0027s impossible to tell; but we know if I flip it long enough it\u0027ll come up tails half the time. That\u0027s the difference between climate and weather; short-term random and/or chaotic phenomena v. long-term trends.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-09-10T02:40:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EMy analogy is it\u0027s impossible to tell; but we know if I flip it long enough it\u0027ll come up tails half the time. That\u0027s the difference between climate and weather; short-term random and/or chaotic phenomena v. long-term trends.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept in that analogy, we don\u0027t know what\u0027s flipping it, if it\u0027s being flipped, how many sides the coin has, and have only directly observed the last two outcomes. We have reports and estimations on what the previous ten thousand flips were, and you\u0027re prepared to bet the world economy that the next flip is going to be tails because we think we\u0027ve weighted the coin.\u003C/p\u003E\n"},{"CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2014-09-10T02:57:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003EWe have that kind of weather on some parts of Earth? And it is not apocalypse?\u003Cp\u003ENo I am not kidding. Why Mars isn\u0027t boiling yet? If CO2 is the cause.\u003C/p\u003E\u003Cp\u003EExtreme weather during short transition, but after that many years of stable weather.\u003C/p\u003E\u003Cp\u003EVenus is further from Sun and has higher temp than Mercury? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot much atmosphere, but 95% and 0.039% is devastating difference!!! There should be like 100C, while max is only 35C.\u003C/p\u003E\u003Cp\u003EAnd more CO2 is good for plants, they can evolve and produce more O2, what would be good for us?\u003C/p\u003E\u003Cp\u003EThis is getting insulting... just because someone doesn\u0027t share your view means he is uneducated?\u003C/p\u003E\u003Cp\u003EStart talking about arguments instead keep repeating this. And don\u0027t call \u0022global warming hypothesis\u0022 a \u0022fact\u0022, because it isn\u0027t.\u003C/p\u003E\u003Cp\u003EThere is no \u0022kind of\u0022 either you can predict weather or not. If you can\u0027t that means your entire knowledge about weather and climate is wrong.\u003C/p\u003E\u003Cp\u003EIf you talk about proper weather patterns just after you admited that there are none, because we can\u0027t predict weather, then maybe you Sir should listen your advice first?\u003C/p\u003E\u003Cp\u003E.gov reliable please!!! if .gov sites would be reliable you wouldn\u0027t had public debt in USA at trylions of $, same in EU countries \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI can understand that in single country can be lots of stupid politicias, but in all?\u003C/p\u003E\u003Cp\u003EAs for proper research what is causing Sun spots every 11 years? I hope it is not CO2 again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, I\u0027ve tried. I honestly have, and I have done my best to try and not be insulting. I am basically at my wits end here. How am I to present a logical argument based on proven scientific fact if you refuse to listen? Obviously facts are not going to change your stance on the issue. \u003C/p\u003E\u003Cp\u003EHowever, I suppose I should correct a few other mistakes in your argument. \u003C/p\u003E\u003Cp\u003EVenus is farther from the sun than mercury. Venus is also close to the size of the earth, and has an atmosphere (unlike mercury). This thick, soupy atmosphere traps heat from the sun, hence the planet is hotter than mercury. Venus also happens to have a magnetic field created by it\u0027s molten core, like earth has. This prevents the solar wind from stripping said atmosphere away over time. Mars once had a molten core, but it has solidified for some reason. As a result, it\u0027s magnetic field weakened/ disappeared, and the solar wind stripped the Martian atmosphere away almost completely. Only a very thin remnant of that atmosphere is present today. This is part of the reason why mars can have such high concentrations of CO2 and yet experience temperatures that drop lower than -100 degrees Celsius. The other factor preventing a build-up of heat is the distance mars is from the sun. It may not seem like it\u0027s very far from earth, but that distance is deceptive. Most heat bleeds off into space. \u003C/p\u003E\u003Cp\u003EWebsites that are .gov or .org are reliable under most circumstances. (That debt you mentioned? Funny thing is, the US only owes about 1/3 of that to other nations, with the majority of debt being owed to the US government itself. Yeah. They owe themselves money, most of that for social security.) I mean honestly, if we are going to attack the legitimacy of legitimate sources then bring it. Where are you getting your \u0022facts\u0022 from? Because these websites I am gathering information from are using data gathered by countless scientists who have extensively researched their findings and then submitted them for peer review and confirmation before publication. When you start to question those truths, how can you recognize fact from fiction? Can nothing be proven? Honestly, attacking legitimate source material is a joke.\u003C/p\u003E\u003Cp\u003EEdit: Okay, I suppose you may be having some trouble communicating your points effectively. So, let\u0027s try this; you present your argument(s) as well as what it is you are arguing. Then, after explaining your points to the best of your abilities, provide the source information for where you are getting your information. Legitimacy can be determined easily; websites ending in .gov, .org, and a few .com such as Wikipedia, will be considered legitimate. Tabloids, articles which fail to sport a direct link to the original scientific journal, and news sites (FOX, CBS, NBC, email home pages, etc.) will not be considered legitimate sources. \u003C/p\u003E\u003Cp\u003EHelp us to understand where you\u0027re coming from and present the evidence to back it up. The rest of the community here (including myself) will take a look at what you have written. If it makes sense then we will voice agreement on that point. If it doesn\u0027t make sense then we will correct the point and provide a link to the source information that disproves it. Let\u0027s settle this like gentlemen and scholars. And on that note, I apologize for my exasperation. Now, let\u0027s do some science.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-10T03:14:40Z\u0022 title=\u002209/10/2014 03:14  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 10, 2014\u003C/time\u003E by Dominatus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-09-10T04:11:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dominatus\u0022 data-cite=\u0022Dominatus\u0022\u003E\u003Cdiv\u003EEdit: Okay, I suppose you may be having some trouble communicating your points effectively. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes this maybe help?: \u003C/p\u003E\u003Cp\u003EDarnok and Dominatus at Tenagra. Dominatus, his eyes red! Darnok, his head on backwards!\u003C/p\u003E\u003Cp\u003E... I\u0027ll show myself out.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-09-10T04:30:34Z","Content":"\n\u003Cp\u003EVenus does not have a magnetic field.\u003C/p\u003E\n"},{"CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2014-09-10T05:29:45Z","Content":"\n\u003Cp\u003EHey Everyone,\u003C/p\u003E\u003Cp\u003EThis thread was allowed to be posted because it is of science in nature. BUT because it is a controversial topic the mods have been keeping an eye on it. If posts contain scientific facts and discussion with an absolute minimum of politics it is acceptable. As soon as you start discussing the politics behind Global Warming Advocates and Deniers it becomes a political discussion and is banned under community rule 2.2b. \u003C/p\u003E\u003Cp\u003EAlso some people have said that other members are trolling. As this strives to be a friendly community calling other people wrong or saying that they are trolling and trying to get a rise out of them is prohibited under community rule 2.3b.\u003C/p\u003E\u003Cp\u003EWith both of those points, If you see someone posting in such a manner please use the report this post button to have a mod come look at it. \u003C/p\u003E\u003Cp\u003EIf this thread continues as it is, it is on the short track to get locked. But if you can keep it on the science then this thread is good to go.\u003C/p\u003E\u003Cp\u003EB787\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-09-10T06:28:27Z","Content":"\n\u003Cp\u003E^ Noted. I actually do have some intriguing science to share, regarding the big picture vs. the BIG picture.\u003C/p\u003E\u003Cp\u003ECO2 levels in Earth\u0027s atmosphere may well have been rising meteorically in the last 200 years and likely causing massive upheavals in the ecological status quo. But if you zoom out to the scale of say 200 million years, CO2 levels have been gradually falling for eons. When Earth formed, a significant fraction of its atmosphere, probably over 20%, was carbon dioxide, whereas today it\u0027s less than half a percent, due to the actions of cyanobacteria and other photosynthetic organisms (but not so much trees actually). Should that long-term trend continue, the atmospheric CO2 level will be virtually zero in the next billion years, causing the end of all plant life as we know it (and consequently the end of all life as we know it, barring major changes in the way the food web works).\u003C/p\u003E\u003Cp\u003ESo humans may well be destroying life forms in a cruel manner and on a massive scale, but it can be argued that we\u0027re saving the world in the very long run. The current \u0022suffering\u0022 of the global ecosystem may be more of a growing pain than a mortal wound.\u003C/p\u003E\u003Cp\u003EThere\u0027s also the matter of the grand scale spatially. As we\u0027ve all heard, Earth is the cradle of humanity, and no infant is meant to die in its cradle. But how many infants do you know who didn\u0027t trash their cradle in the process of outgrowing it? On a cosmic scale our species is immature, violent, and thoughtless - not unlike a baby. But we have the ability to grow out of this phase into something that can look after its health and accomplish something that actually is significant, even on a cosmic scale. And perhaps to do that, sad as it seems, we can\u0027t help but spend this phase of our evolution making a smelly mess out of our cradle.\u003C/p\u003E\u003Cp\u003EThat all said, I personally am a strong advocate of sustainability and general respect for the world we inhabit. I\u0027d much rather we find some ingenious way to save the present world AND the future, and grow out of our cradle without making any more mess than we can help.\u003C/p\u003E\n"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2014-09-10T07:09:23Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.bbc.co.uk/science/earth/earth_timeline/first_life\u0022 rel=\u0022external nofollow\u0022\u003EOxygen, and not CO2, is a non-natural pollutant\u003C/a\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo think life cannot have a massive impact on this planet\u0027s climate is insane. To think CO2 is mainly driving the climate is insane too. To believe our current climate models have any use at all save for being mathematical curiosities is insane. To believe nothing\u0027s happening to our planet and everything will be fine anyway is insane.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-09-10T07:18:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENot much atmosphere, but 95% and 0.039% is devastating difference!!! There should be like 100C, while max is only 35C.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause 95% of almost nothing is still almost nothing. So it has almost no effect.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd more CO2 is good for plants, they can evolve and produce more O2, what would be good for us?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlants do grow slightly better with higher concentrations of CO\u003Csub\u003E2\u003C/sub\u003E, but only up to a point. Too much becomes harmful.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-09-10T07:51:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003E if you zoom out to the scale of say 200 million years, CO2 levels have been gradually falling for eons.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFalse, there have been massive flunctiations, but you can\u0027t draw any statistically significant trendline.\u003C/p\u003E\u003Cp\u003EIts pretty much the same as it was back in the Cambrian, though it was much higher in the mesozoic.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E Should that long-term trend continue, the atmospheric CO2 level will be virtually zero in the next billion years, causing the end of all plant life as we know it (and consequently the end of all life as we know it, barring major changes in the way the food web works).[/quote\u003Cp\u003EStarting from a false premise of the long term trend, ignoring feedback mechanisms, like dropping CO2 leads to lower CO2 fixation, the CO2 has been much lower than it is now, and always rebounded.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo humans may well be destroying life forms in a cruel manner and on a massive scale, but it can be argued that we\u0027re saving the world in the very long run.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EArgued poorly by making up facts- yes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-09-10T08:13:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThere\u0027s also the matter of the grand scale spatially. As we\u0027ve all heard, Earth is the cradle of humanity, and no infant is meant to die in its cradle. But how many infants do you know who didn\u0027t trash their cradle in the process of outgrowing it? On a cosmic scale our species is immature, violent, and thoughtless - not unlike a baby. But we have the ability to grow out of this phase into something that can look after its health and accomplish something that actually is significant, even on a cosmic scale. And perhaps to do that, sad as it seems, we can\u0027t help but spend this phase of our evolution making a smelly mess out of our cradle.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBad analogy. And how many viruses and parasites die off by killing their hosts? \u003C/p\u003E\u003Cp\u003EThere is no such thing as \u0022destiny\u0022 in nature. It\u0027s just constant evolution, and nothing lives forever. Everything either evolves into something else or dies off. Humanity is only a few hundred thousand years old, with civilization as we know it only a few thousand. Most of our time here was spent hunting and gathering and sleeping in caves. It\u0027s way too early to consider that we are a durable or successful species. Our rise as the dominant species on Earth is nothing more than a flash in the pan in \u0022the BIG picture\u0022. In a few hundred thousand years, we will either be extinct or a different species, as different from Homo Sapiens as we are from Australopithecus.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-10T08:16:35Z\u0022 title=\u002209/10/2014 08:16  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 10, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2014-09-10T08:51:50Z","Content":"\n\u003Cp\u003EI\u0027d just like to point out again that ALL LIFE IS POLLUTION. Every single modification to its environment that a lifeform causes in order to persist and thrive, diverts the Earth away from its natural state. That\u0027s basic thermodynamics.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-09-10T09:27:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jesrad\u0022 data-cite=\u0022Jesrad\u0022\u003E\u003Cdiv\u003EI\u0027d just like to point out again that ALL LIFE IS POLLUTION. Every single modification to its environment that a lifeform causes in order to persist and thrive, diverts the Earth away from its natural state. That\u0027s basic thermodynamics.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, but I\u0027m not quite sure what point you\u0027re trying to make by pointing this out. What is the \u0022natural state\u0022 anyway? The planet and its biosphere are dynamic systems. The point is that we\u0027ve identified problems with our energy systems that mean are modifying the environment in ways that are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ENot controlled\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENot necessarily to our benefit\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETo me taking action to address this is a no-brainer. It\u0027s in our self-interest to take corrective action.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-10T09:54:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jesrad\u0022 data-cite=\u0022Jesrad\u0022\u003E\u003Cdiv\u003EI\u0027d just like to point out again that ALL LIFE IS POLLUTION. Every single modification to its environment that a lifeform causes in order to persist and thrive, diverts the Earth away from its natural state. That\u0027s basic thermodynamics.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELike \u0022weeds\u0022 (AKA \u0022a plant in the wrong place\u0022), \u0022pollution\u0022 is a purely human concept; it is not an objective, natural-law sort of thing. Yes, you can choose to define \u0022pollution\u0022 in such a way that it includes everything, but by doing so you make it an essentially useless and meaningless concept. It\u0027s Humpty-Dumpty linguistics.\u003C/p\u003E\u003Cp\u003ELife is a \u003Cem\u003Epart \u003C/em\u003Eof the Earth\u0027s \u0022natural state\u0022. The Earth isn\u0027t a static, changeless rock, and never has been; it\u0027s a constantly evolving dynamic system. By giving priority to some hypothetical, abiotic Earth, you\u0027re skirting dangerously close to the naturalistic fallacy.\u003C/p\u003E\u003Cp\u003EThe question is not whether we can or should try to maintain the Earth as if human life had never existed. We can\u0027t, and it would be daft to even try. The question is whether we should continue to actively push the system towards a state [1] that is going to create consequences in the alarmingly near future that will make WWII look like a holiday picnic.\u003C/p\u003E\u003Cp\u003EWe evolved intelligence, we should choose to use it.\u003C/p\u003E\u003Cp\u003E[1] Unambiguously, proven as close to a certainty as the natural sciences are ever able to get. Anthropogenic climate change is about as \u0022hypothetical\u0022 as plate tectonics. And the primary driver of that change is human industrial CO2 emission. This fact is not in doubt by anyone who has the slightest genuine understanding of the topic.\u003C/p\u003E\n"},{"CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2014-09-10T12:04:35Z","Content":"\n\u003Cp\u003ESlightly embarrassed now... \u003Ca href=\u0022http://m.space.com/11187-earth-magnetic-field-solar-wind.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://m.space.com/11187-earth-magnetic-field-solar-wind.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI suppose I should have double-checked my facts before I had posted. I was working off of information I had learned in the past in regards to planetary magnetospheres and their acting as a shield from the solar wind. As it turns out that\u0027s only a partial truth. According to this article, ions are being energized and lost at the poles as a result of the solar wind \u0022bending\u0022 around the magnetic field. The energy transfer results in a net loss of atmosphere roughly equal to mars and Venus. The points I had been making remain valid, though. I apologize in advance for any other facts I may get wrong, as I don\u0027t have the time to properly research the topics being discussed. High school hardly allows for the opportunity to browse the forums, let alone research prior to posting.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-09-10T13:26:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jesrad\u0022 data-cite=\u0022Jesrad\u0022\u003E\u003Cdiv\u003EI\u0027d just like to point out again that ALL LIFE IS POLLUTION. Every single modification to its environment that a lifeform causes in order to persist and thrive, diverts the Earth away from its natural state. That\u0027s basic thermodynamics.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you implying that life is violating thermodynamics? Because it\u0027s not. It behaves 100% according to its laws.\u003C/p\u003E\u003Cp\u003E\u0022All life is pollution\u0022 - that\u0027s a meaningless statement. It\u0027s ill-advised pseudophilosphy. Lifeforms are one of the ways matter aggregates in universe and they\u0027re in constant interaction with other lifeforms and inanimate nature. Some die, some survive, then die, too.\u003C/p\u003E\n"},{"CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2014-09-10T14:43:42Z","Content":"\n\u003Cp\u003EI think he meant \u0022human life\u0022 when he said all life is pollution, which is a rather extreme statement. Truth be told, we are not ruining the environment and dooming life on earth. We are changing the current environment at a alarmingly fast rate which could either doom our species or make life very difficult for us. Either way, life on earth will persist, regardless of climate conditions (to an extent; obviously there will come a day when the planet can no longer sustain life, but that has nothing to do with humanity). Point being, life will find a way, be rid of us and continue to be successful. Why save the environment? Why save yourselves, is more like it.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-09-10T15:02:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dominatus\u0022 data-cite=\u0022Dominatus\u0022\u003E\u003Cdiv\u003EI think he meant \u0022human life\u0022 when he said all life is pollution, which is a rather extreme statement. Truth be told, we are not ruining the environment and dooming life on earth. We are changing the current environment at a alarmingly fast rate which could either doom our species or make life very difficult for us. Either way, life on earth will persist, regardless of climate conditions (to an extent; obviously there will come a day when the planet can no longer sustain life, but that has nothing to do with humanity). Point being, life will find a way, be rid of us and continue to be successful. Why save the environment? Why save yourselves, is more like it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause there might be someone very advanced and powerful watching over us and we don\u0027t wan\u0027t to look like complete jerks eradicating our selfes don\u0027t we? Is\u0027nt there a bit of pride left in us?\u003C/p\u003E\n"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2014-09-10T15:49:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EAre you implying that life is violating thermodynamics?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhaaaaa ? No, nowhere near what I meant. However \u003Ca href=\u0022https://medium.com/the-physics-arxiv-blog/information-theory-and-the-origin-of-life-4cf6b93d156c\u0022 rel=\u0022external nofollow\u0022\u003Eapplying that thinking to life yields\u003C/a\u003E interesting definitions for \u0022life\u0022 in general.\u003C/p\u003E\n"},{"CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2014-09-10T15:57:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EBecause there might be someone very advanced and powerful watching over us and we don\u0027t wan\u0027t to look like complete jerks eradicating our selfes don\u0027t we? Is\u0027nt there a bit of pride left in us?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, I think you misunderstood. It was a rhetorical question.\u003C/p\u003E\n"},{"CreatedByName":"Rondon","CreatedById":73335,"CreatedDateTime":"2014-09-10T21:15:49Z","Content":"\n\u003Cp\u003ESo darko, you\u0027re issue with the \u0022concrete\u0022 example, was that mars is colder than its atmosphereless moons, this may indeed of been a crippling flaw in the logic if not for the fact that Phobos and Demos are two of the darkest objects in the solar system, so what I was going to do was put the moon out to mars\u0027s distance from the sun, and then divide the surface temperature by the fraction of energy it would receive. Which seems a bit dodgy at the best of times, But I don\u0027t have too! the moon and mars share approximately the same mean temperature (220k - 210K), despite the fact moon receives more energy and is in fact darker than mars. Before you ask the moon appears so white due to its stark contrast to pitch black space.\u003C/p\u003E\u003Cp\u003E\u0022Again, antarctic ice will collapse into sea regularly this is nothing new except more satellites taking pictures, an increased temperature will probably give more humid air over Antarctica and increase the ice thickness\u0022 - magnemoe.\u003C/p\u003E\u003Cp\u003EJust to clarify it nearly never rains in Antarctica, there isn\u0027t that much accumulation to increase, even then \u0022global warming will \u003Cem\u003Edecrease\u003C/em\u003E sea levels\u0022 , is a pretty bold claim to make, . it is also contrary to what has been experienced, ie sea levels have and are rising right now, just not that much.\u003C/p\u003E\n"}]}