{"TopicId":85921,"ForumId":44,"TopicTitle":"So Pluto is a planet!?","CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2014-10-02T19:26:07Z","PageNum":5,"Articles":[{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-10-03T16:41:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022N_las\u0022 data-cite=\u0022N_las\u0022\u003E\u003Cdiv\u003EI learned more science from german public television broadcasting than from my teachers. We have this great show: \u0022Sendung mit der Maus\u0022 (Show with the Mouse).\u003Cp\u003EThey had a great broadcast about space travel over 20 years ago. I can\u0027t find it on the internet :/\u003C/p\u003E\u003Cp\u003EBut I found this snippet: It isn\u0027t that old, and it gives a nice idea about the format of the show. I recomment watching it, even if you don\u0027t understand a word. It is entertaining as hell.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=mOORih_yfkU\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=mOORih_yfkU\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow you made me nostalgic...\u003C/p\u003E\u003Cp\u003ESomeone should make a english translation. I think it is still produced, but I don\u0027t know if the quality is the same.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-10-03T17:09:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hannu\u0022 data-cite=\u0022Hannu\u0022\u003E\u003Cdiv\u003EI am envy about quality of your teaching. My teacher \u0022knew\u0022, that we have so cold in Finland, because north latitudes are so much farther (several thousands of kilometers) from the Sun than the equator, and demonstrated it with a slide projector and a globe. Fortunately I had already learned (through the hard way, as real nerd without social skills must do) that it was better to be quiet and not ask \u0022how about the fact that Earth is 5 millions of kilometers closer Sun in January than in July\u0022. I was then about 9.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually there is a grain of truth in your erstwhile teacher\u0027s demonstration: part of the reason high latitudes are colder is because sunlight must travel through a few extra thousand km of atmosphere in order to reach the ground (~3500km at 64Ã‚Â°N during equinox.)\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-10-03T17:16:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EActually there is a grain of truth in your erstwhile teacher\u0027s demonstration: part of the reason high latitudes are colder is because sunlight must travel through a few extra thousand km of atmosphere in order to reach the ground (~3500km at 64Ã‚Â°N during equinox.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the length of atmosphere the sunlight has to traverse is dependent on the angle the surface has to the sun. It has nothing to do with the distance to the sun.\u003C/p\u003E\n"},{"CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2014-10-03T17:28:45Z","Content":"\n\u003Cp\u003E{MOD}Hey Guys, this thread has gotten derailed from its original purpose which is to discuss Pluto and it\u0027s Planethood (is that even a correct term?). This thread should NOT be used to discuss topics such as and not limited too, evolution and climate. \u003C/p\u003E\u003Cp\u003EIf this thread does not get back on rails and stay on said rails, i will have to close the thread.\u003C/p\u003E\u003Cp\u003E{/MOD}\u003C/p\u003E\u003Cp\u003ENOW then, personally i think that it was right of the IAU to reclassify Pluto as a Dwarf Planet. and so what that it was classified as a planet... there are new generations that have no idea what a floppy disk is, there will be a generation that was taught pluto as a Dwarf Planet along with Ceres and Vesta. I always thought that it was wonky that pluto with its VERY inclined orbit and eccentricity was classified as a planet, heck it could be a large comet that was pulled into a semistable orbit. Anyways we will know more next year when NEW HORIZONS gets to pluto. \u003Ca href=\u0022http://www.wolframalpha.com/input/?t=crmtb01\u0026amp;f=ob\u0026amp;i=new%20horizons%20spacecraft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.wolframalpha.com/input/?t=crmtb01\u0026amp;f=ob\u0026amp;i=new%20horizons%20spacecraft\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-10-03T17:33:55Z","Content":"\n\u003Cp\u003EEDIT: Deleted original post here due to non-topical.\u003C/p\u003E\u003Cp\u003EI like having a diverse population of solar system bodies and a variety of ways to refer to them. 2015 will be the Year of the Dwarf Planet, as we\u0027ll have up close looks at the first two dwarf planets ever to be visited by any spacecraft. Ceres and Pluto should be able to wear the label with pride.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-03T17:36:11Z\u0022 title=\u002210/03/2014 05:36  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 3, 2014\u003C/time\u003E by Mr Shifty\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"No one","CreatedById":112131,"CreatedDateTime":"2014-10-03T19:14:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022B787_300\u0022 data-cite=\u0022B787_300\u0022\u003E\u003Cdiv\u003Ethere will be a generation that has never heard of Pluto, just like they won\u0027t have heard of Ceres or Vesta.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFTFY.\u003C/p\u003E\u003Cp\u003EI personally had never heard of Ceres until I started playing KSP. Actually I vaguely remember seeing it while randomly reading wikipedia, but to me it was \u0022some sort of icy asteroidish thingy I think I forget\u0022. And I\u0027m not sure if I remembered it by name or if I only know that that thing I read about was Ceres because I now know what Ceres is. Most people I know don\u0027t play KSP and have never heard of Ceres. When it comes to space, most people have heard of the planets, the sun, the moon, pluto, and then that\u0027s it.\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2014-10-03T19:40:54Z","Content":"\n\u003Cp\u003EWell TBH alot of people at my college can\u0027t even name all the planets.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-10-03T19:53:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EThat means we need to believe these things because we learned them in school:\u003Cp\u003E- The tongue taste map\u003C/p\u003E\u003Cp\u003E- Diamonds are made from coal\u003C/p\u003E\u003Cp\u003E- van Gogh cut off his own ear.\u003C/p\u003E\u003Cp\u003E- Einstein couldn\u0027t do math.\u003C/p\u003E\u003Cp\u003E- Benjamin Franklin discovered electricity by flying a kite which got struck by lighting.\u003C/p\u003E\u003Cp\u003E- Newton discovered gravity when an apple dropped on his head.\u003C/p\u003E\u003Cp\u003E- Columbus discovered that the Earth was round.\u003C/p\u003E\u003Cp\u003E- Napoleon was short.\u003C/p\u003E\u003Cp\u003E- Edison invented the light bulb.\u003C/p\u003E\u003Cp\u003ESome of the things I could think off.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe it\u0027s because I\u0027m older than about 99% of you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E but I learned a lot of these correctly in my public school. I distinctly remember learning the Ben Franklin, Newton, Columbus, and Edison ones in GRADE school. Maybe 4th grade. And I\u0027m not saying I just learned it correctly. I\u0027m saying I learned \u0022Here\u0027s a misconception about Columbus. Here\u0027s why it\u0027s wrong and here\u0027s what actually happened.\u0022\u003C/p\u003E\u003Cp\u003EI don\u0027t remember learning the tongue taste map in school, but I do remember reading about it somewhere and trying it. Seemed real at the time. Most of the diamond/coal references I know stem back to Ferris Bueller, not school \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E And I never heard that Einstein couldn\u0027t do math. Do people say that?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-03T20:24:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022No one\u0022 data-cite=\u0022No one\u0022\u003E\u003Cdiv\u003EI personally had never heard of Ceres until I started playing KSP. Actually I vaguely remember seeing it while randomly reading wikipedia, but to me it was \u0022some sort of icy asteroidish thingy I think I forget\u0022. And I\u0027m not sure if I remembered it by name or if I only know that that thing I read about was Ceres because I now know what Ceres is. Most people I know don\u0027t play KSP and have never heard of Ceres. When it comes to space, most people have heard of the planets, the sun, the moon, pluto, and then that\u0027s it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat the whole thing - I feel people should learn about Pluto. And Ceres, and Makemake and all the other bodies that we can say anything about with a certain degree of accuracy. It turns out these smaller planets are a significant part of our solar system and expand our view on the formation and structure of the whole thing. It would be rather silly to only focus on the big 9 (including the sun), just as it would be silly to only talk about Pluto and none of the other small planets.\u003C/p\u003E\u003Cp\u003EIt might be excessive to expect everyone to learn all those icy bodies out there, but I feel it would be appropriate to teach people about the 15 or 20 largest bodies in the solar system, along with the classes that make up the smaller bodies. As it stands, most even somewhat informed people will say the solar system is just 8 or 9 planets with some comets and asteroids, while a lot more is going on.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-03T20:28:31Z\u0022 title=\u002210/03/2014 08:28  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 3, 2014\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2014-10-03T20:49:32Z","Content":"\n\u003Cp\u003ESimilar to what I just said in another thread, I think that the public getting upset about Pluto being a planet or not shows that they are not being taught astronomy correctly. They need to learn about all the objects in the solar system, not just the few we arbitrarily call \u0022planets\u0022. ALL the interesting and large worlds need to be covered. More time should be spent learning about Europa or Titan than is spent learning about Mercury or Uranus, for example. And yet, more people know what Mercury and Uranus are than know what Europa and Titan are. Astronomy is not being taught correctly, because of this misguided fixation on \u0022planets\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-03T20:53:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003ESimilar to what I just said in another thread, I think that the public getting upset about Pluto being a planet or not shows that they are not being taught astronomy correctly. They need to learn about all the objects in the solar system, not just the few we arbitrarily call \u0022planets\u0022. ALL the interesting and large worlds need to be covered. More time should be spent learning about Europa or Titan than is spent learning about Mercury or Uranus, for example. And yet, more people know what Mercury and Uranus are than know what Europa and Titan are. Astronomy is not being taught correctly, because of this misguided fixation on \u0022planets\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI full-hartedly agree. Picturing the solar system as 9 balls with some other floaty debris between them is painfully simplistic.\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-10-03T21:54:54Z","Content":"\n\u003Cp\u003Ewell, it isn\u0027t like you need to know your way around the solar system for live in society.\u003C/p\u003E\n"},{"CreatedByName":"SolarLiner","CreatedById":41047,"CreatedDateTime":"2014-10-03T22:02:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI full-hartedly agree. Picturing the solar system as 9 balls with some other floaty debris between them is painfully simplistic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. The asteroid debris. SO MUCH people thinks that the asteroid belt is full of dust and asteroids that it is nearly impossible to pass ... because we get told that there is one asteroid belt there ...\u003C/p\u003E\u003Cp\u003EI mean, this is the most boring and unimportant thing about our solar system ! This is time that can better be used to teach about all the satellites our giant planets have!\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-03T22:34:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003Ewell, it isn\u0027t like you need to know your way around the solar system for live in society.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree. Giving people a broader sense of and view on things generally makes them nicer people to live and deal with. Maybe that the specific knowledge is of limited use in day to day life, but the same actually goes for a lot of the stuff taught in school.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2014-10-03T22:42:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SolarLiner\u0022 data-cite=\u0022SolarLiner\u0022\u003E\u003Cdiv\u003EYes. The asteroid debris. SO MUCH people thinks that the asteroid belt is full of dust and asteroids that it is nearly impossible to pass ... because we get told that there is one asteroid belt there ...\u003Cp\u003EI mean, this is the most boring and unimportant thing about our solar system ! This is time that can better be used to teach about all the satellites our giant planets have!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, the asteroid belt is a tiny portion of the mass of the solar system. The difference in mass between Eris and Pluto (Eris is 27% more massive) is larger than the entire combined mass of the asteroid belt. The Kuiper belt is really more important than the asteroid belt, it\u0027s about 100 times more massive, extends across a much larger volume, and contains larger objects. And yet only a tiny portion of the people who learn about the asteroid belt know what the Kuiper belt is (although that might have changed in recent years as textbooks got updated). I\u0027m guessing one of the reasons is that we don\u0027t have any good pictures of any representative objects, but that should change next year.\u003C/p\u003E\u003Cp\u003EI do think kids should learn about the major satellites of the solar system in school, at least Io, Europa, Ganymede, Callisto, Titan, and Triton.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-03T22:52:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metaphor\u0022 data-cite=\u0022metaphor\u0022\u003E\u003Cdiv\u003EI do think kids should learn about the major satellites of the solar system in school, at least Io, Europa, Ganymede, Callisto, Titan, and Triton.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe view that the solar system comprises intricate subsystems and a huge cloud of icy worlds rather than a handful of lone orbs of matter and not much else are quite radically different.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-10-03T23:36:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metaphor\u0022 data-cite=\u0022metaphor\u0022\u003E\u003Cdiv\u003EYeah, the asteroid belt is a tiny portion of the mass of the solar system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, to look at it another way, the solar system, to a good first approximation, is a star surrounded by empty space. The sun itself comprises 99.9% of the mass of the solar system.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-04T00:07:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EWell, to look at it another way, the solar system, to a good first approximation, is a star surrounded by empty space. The sun itself comprises 99.9% of the mass of the solar system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was exactly what I was thinking earlier in this discussion. Why include the 8 bigger balls? Mass wise they are of very little substance compared to the total mass of the solar system. The same argument people are bringing against the smaller planets actually goes for the bigger ones. Why not just talk about the Sun, or the Sun and Jupiter? Or, alternatively, why not ignore the rocky bodies of the inner solar system, as is justified by their lack of mass? Not to mention that some moons are almost as heavy or big as some planets.\u003C/p\u003E\u003Cp\u003EWhen you look at it in a little more detail it becomes clear Uranus and Neptune are an order of magnitude larger than Earth, Jupiter and Saturn two orders while Mercury and Mars are actually one smaller. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://tweakers.net/ext/f/g1LIypLbZr8NfpIb26bOm6bk/full.jpg\u0022 alt=\u0022full.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Sun_vs_planets_en.svg/500px-Sun_vs_planets_en.svg.png\u0022 alt=\u0022500px-Sun_vs_planets_en.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Masses_of_the_planets_en.svg/500px-Masses_of_the_planets_en.svg.png\u0022 alt=\u0022500px-Masses_of_the_planets_en.svg.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-04T00:19:03Z\u0022 title=\u002210/04/2014 12:19  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 4, 2014\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-10-04T00:38:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI disagree. Giving people a broader sense of and view on things generally makes them nicer people to live and deal with. Maybe that the specific knowledge is of limited use in day to day life, but the same actually goes for a lot of the stuff taught in school.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re just making assumptions. I know a lot of people that are nice to live with and don\u0027t know jack about the solar system, not everyone is interested in what lies beyond the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-04T00:48:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EYour complaining seems petty to me, they\u0027re still planets, dwarf planets, which is very accurate considering their relative size compared to the other 8. And even if we go and call everything a planet, people would still separate them, since there\u0027s a clear distinction between the 8 planets and the dwarf ones (being mass, orbit)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is actually not true. Compare the mass or size of Pluto to that of Mercury, then do the same for either with Earth or even one of the four gas giants. The latter are not remotely in the same league, which - following those guidelines - would mean Mercury should be classified as a dwarf planet. When we look at orbits it is Mercury again that refuses to have a neat near round orbit. Less skewed than Pluto for sure, but where do we put the line?\u003C/p\u003E\u003Cp\u003EFor the rest I point to my previous post, which is a decent indication that the subdivision would most likely not be along the same lines we make them now. Those eight planets are only viewed as a group the way they are because of the history behind it all.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-04T00:51:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EYou\u0027re just making assumptions. I know a lot of people that are nice to live with and don\u0027t know jack about the solar system, not everyone is interested in what lies beyond the atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is far from any assumption that developing and teaching people improves society on a broad scale. Some people might not be interested, but then again, some people are also not interested in cars, or in economics, or any other subject. That does not deduct from the value of it.\u003C/p\u003E\u003Cp\u003EI am not going to address the fallacy of explaining my statement to mean that no-one could be nice without knowing about the universe, as that one is obvious.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-04T00:57:52Z\u0022 title=\u002210/04/2014 12:57  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 4, 2014\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-10-04T01:26:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EThis is actually not true. Compare the mass or size of Pluto to that of Mercury, then do the same for either with Earth or even one of the four gas giants. The latter are not remotely in the same league, which - following those guidelines - would mean Mercury should be classified as a dwarf planet. When we look at orbits it is Mercury again that refuses to have a neat near round orbit. Less skewed than Pluto for sure, but where do we put the line?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay. Mercury is twice as big and a lot more massive than Pluto, its orbit isn\u0027t nowhere near as inclined nor as eccentric: at some points Pluto is closer to the Sun than Neptune, really just look at some 3d map of the solar system (like \u003Ca href=\u0022http://www.solarsystemscope.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.solarsystemscope.com/\u003C/a\u003E) for see how out of place Pluto is.\u003C/p\u003E\u003Cp\u003EIn the end, the line is drawn by Soter\u0027s planetary discriminant, the magnitude that quantifies how much a potential planet has cleared the neighbourhood around its orbit: Soter\u0027s planetary discriminant for Mercury is 91000, while Pluto\u0027s is just 0.077, people way more qualified than us already thought this out, it isn\u0027t our place to second guess them.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-04T01:37:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EIn the end, the line is drawn by Soter\u0027s planetary discriminant, the magnitude that quantifies how much a potential planet has cleared the neighbourhood around its orbit: Soter\u0027s planetary discriminant for Mercury is 91000, while Pluto\u0027s is just 0.077, people way more qualified than us already thought this out, it isn\u0027t our place to second guess them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou mean the discriminant that tells us there is about as much difference between Mars and Jupiter as there is between Mars and Eris? People keep comparing what are now called \u003Cem\u003Edwarf planets\u003C/em\u003E to small planets like Mercury, but keep forgetting that the same or bigger differences apply to the big planets and the small planets. Should we eliminate Mercury because its mass is insufficient compared to Jupiter? I mean, when we look at orders of magnitude Jupiter is more off compared to Mercury than Mercury to Pluto. What about removing Mars due to its Soter\u0027s discriminant? Or maybe we should talk about removing all the planets, as they represent less than 0,01% of the mass or volume of the solar system?\u003C/p\u003E\u003Cp\u003ESee some of the trouble there? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003Ereally just look at some 3d map of the solar system (like \u003Ca href=\u0022http://www.solarsystemscope.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.solarsystemscope.com/\u003C/a\u003E) for see how out of place Pluto is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can advise anyone to look at both Universe Sandbox\u003Csup\u003E2\u003C/sup\u003E and SpaceEngine, both of those will give you a wonderful sense of how things relate to each other in the solar system \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E US\u003Csup\u003E2\u003C/sup\u003E even has a chart function that allows you to sort and view all the bodies in a nice line-up. SpaceEngine is better at giving you the feeling of actually being there and the scale of things. It is quite a sight to see Charon rising and, almost as amazing, it is free.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-04T01:55:43Z\u0022 title=\u002210/04/2014 01:55  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 4, 2014\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-10-04T02:06:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EYou mean the discriminant that tells us there is about as much difference between Mars and Jupiter as there is between Mars and Eris? People keep comparing what are now called \u003Cem\u003Edwarf planets\u003C/em\u003E to small planets like Mercury, but keep forgetting that the same or bigger differences apply to the big planets and the small planets. Should we eliminate Mercury because its mass is insufficient compared to Jupiter? What about removing Mars due to its Soter\u0027s discriminant? What about removing all the planets, as they represent less than 0,01% of the mass or volume of the solar system?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou aren\u0027t making much sense. Soter\u0027s planetary discrimant is just a quotient between the planet\u0027s total mass, and the total mass of the objects in the same orbit, a measurement of the planet \u0022dominance\u0022 of its orbit. This value very over 10000 for all the planets (including Mars) and way below 1 for the rest of the known dwarf planets, there\u0027s really not much room for debate here.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhat about removing all the planets, as they represent less than 0,01% of the mass or volume of the solar system?\u003C/div\u003E\u003C/blockquote\u003EThen you would be failing at classifying the objects that orbit the Sun, no? I\u0027m failing to see where are you trying to go with this.\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-04T02:28:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EYou aren\u0027t making much sense. Soter\u0027s planetary discrimant is just a quotient between the planet\u0027s total mass, and the total mass of the objects in the same orbit, a measurement of the planet \u0022dominance\u0022 of its orbit. This value very over 10000 for all the planets (including Mars) and way below 1 for the rest of the known dwarf planets, there\u0027s really not much room for debate here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are missing the point - the difference between the planets is as big as between them and dwarf planets. The actual value is hardly interesting, it is how they relate to each other.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThen you would be failing at classifying the objects that orbit the Sun, no? I\u0027m failing to see where are you trying to go with this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am indicating that all those obvious lines some people see are not as obvious as they are supposed to be. They are arbitrary, which is not necessarily a problem in itself, but the fact that they are vague \u003Cem\u003Eis\u003C/em\u003E a problem. As soon as you add data or apply it to another system your classification system will fall apart. Sure, defining planets by roundness like I advocate also means arbitrarily establishing a threshold value, but is pretty clear-cut beyond that.\u003C/p\u003E\u003Cp\u003EI feel star, planets and moons should simply be a hierarchic matter. Star, then planets, then moons. To avoid any piece of junk being a planet the extra qualification of roundness is added. For sure that means subdividing the resulting planets, but we already do that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-04T02:46:19Z\u0022 title=\u002210/04/2014 02:46  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 4, 2014\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"}]}