{"TopicId":85921,"ForumId":44,"TopicTitle":"So Pluto is a planet!?","CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2014-10-02T19:26:07Z","PageNum":4,"Articles":[{"CreatedByName":"Fingal","CreatedById":109326,"CreatedDateTime":"2014-10-03T11:34:54Z","Content":"\n\u003Cp\u003EThe biggest problem here though is that \u0022planet\u0022 is a historic term, created when all we knew about them is that they moved against the background of otherwise motionless stars. It\u0027s not a phenomenon that\u0027s been observed then categorised, it\u0027s an ancient term that scientists, for some reason, feel the need to retain and define. Other sciences have the same problem. Defining intelligence or emotion is an ongoing argument in neuroscience and artificial intelligence and again these are old terms that we\u0027re trying to classify rather than making observations and then applying terminology that seems most appropriate.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-10-03T11:36:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EI\u0027d rather just reclassify Pluto as a planet, then plug my ears to all criticism of this decision.\u003Cp\u003EProbelm solved?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0060m with you. I don\u0060t care about classification criteria, consistency or any of the things that have been said here so far.\u003C/p\u003E\u003Cp\u003EPluto is a planet and we have 9 planets. The rest lost the lottery.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-10-03T11:39:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EWhat if we placed limites on the inclination?\u003Cp\u003ESay we define a range of inclinations which include 95% of the mass of objects orbitin the sun.\u003C/p\u003E\u003Cp\u003EOr... since the sun rotates (right?), we say \u002B/- 5 degrees from the sun\u0027s equatorial plane.\u003C/p\u003E\u003Cp\u003EOutside of that range... you can at best be a planetoid, not a planet.\u003C/p\u003E\u003Cp\u003EI think dwarf planet isn\u0027t as good of a name as \u0022planetoid\u0022, but it seems they also wanted a group \u0022minor planets\u0022 (which actually includes all the asteroids...)\u003C/p\u003E\u003Cp\u003EThe clearing the orbit thing is related to size, so I can see where \u0022dwarf\u0022 comes in, but if you put Earth in the orbit of Eris, it wouldn\u0027t clear the orbit either.\u003C/p\u003E\u003Cp\u003EClearly the orbit is important, its why we\u0027d consider pluto for planet status, but not the moon.\u003C/p\u003E\u003Cp\u003ESo... why not inclination based definitions too?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESay your star system captured a rogue jupiter in a 90 degree inclined orbit. Following your definition it wouldn\u0027t be a planet.\u003C/p\u003E\u003Cp\u003EWe have a perfectly adequate definition of planet already:\u003C/p\u003E\u003Cp\u003E- Object massive enough to be pulled into a sphere but not massive enough for sustained fusion.\u003C/p\u003E\u003Cp\u003E- Object orbits a star.\u003C/p\u003E\u003Cp\u003E- Object has cleaned its orbit so it contains most of the matter in that orbit.\u003C/p\u003E\u003Cp\u003EWhy would we bother changing it? In the end its just a label that we use to refer to some rocks floating in space.\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-10-03T11:43:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EIs really just nationalism, the states where Pluto\u0027s discoverer was born or lived passed resolutions that made it back a planet. Nobody made a fuss about Pluto being a dwarf planet in all the talks the observatory of my city gave, this is really just an issue for the US.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats true. I don\u0027t know anybody here in Europe who bats an eyelash about Pluto. \u0022So it isn\u0027t calssified as Planet anymore, ok...\u0022. They react like if they heard that some weird reptile thing is now reclassified as amphibian.\u003C/p\u003E\u003Cp\u003EThe only people who react weird are US-Americans I meet on the internet: \u0022NOOO! Why isn\u0027t it a planet anymore? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E !\u0022. As if the label \u0022Planet\u0022 would be something to be proud about.\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-10-03T11:46:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EI\u0060m with you. I don\u0060t care about classification criteria, consistency or any of the things that have been said here so far.\u003Cp\u003EPluto is a planet and we have 9 planets. The rest lost the lottery.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow very scientific. Using science and discarding it at one\u0027s convenience is not really an appropriate thing to do.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-10-03T11:46:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fingal\u0022 data-cite=\u0022Fingal\u0022\u003E\u003Cdiv\u003EI trained as a geologist, so from that perspective it\u0027s difficult to see how they aren\u0027t.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour training as a geologist might not have trained you to recognize the fact that they orbit a planet. After all, earth\u0027s geologists needed until Galileo to figure such a thing out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut seriously, if geology is your main definition, then Jupiter is no planet, for it is completely lacking geology.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2014-10-03T12:02:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EWe have a perfectly adequate definition of planet already:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is adequate only in our current system as it is known today.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E- Object massive enough to be pulled into a sphere but not massive enough for sustained fusion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThese are quite clear limits in our current system, but no natural law disables objects in both limits. So, if we would want to use this for every possible solar systems, we should define what is \u0022sphere\u0022 and how much fusion energy production is accepted. And is it planet, if there was fusion of natural deuterium in history, but it have ceased to be significant energy source. Exact limits do not work because any object in nature is not perfect sphere and there is low but finite probability that two atom nucleii fuse even in normal temperature and density, so probably fusions have happened even in Jupiter\u0027s massive hydrogen mass.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E- Object orbits a star.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is easy to imagine endless arguing is brown dwarf star or planet, if such object would be in our solar system.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E- Object has cleaned its orbit so it contains most of the matter in that orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is also artificial limit, which is practical on known parts of our solar system. If we would be strict, Earth would not be a planet, because some people is worried about near earth asteroids. How about synchronized stuff, like trojans or Pluto versus Neptune? There could be very massive planets in outer solar system, which wave not had enough time to clear their orbits.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhy would we bother changing it? In the end its just a label that we use to refer to some rocks floating in space.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause we all have human tendency to classify everything and we have different opinions how this classification should be done.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-10-03T12:02:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EAny smaller outer system bodies would get a tail if put in earth orbit at least unless mars sized or larger as the cold let it freeze gas who would escape. \u003Cp\u003EThen I thought that putting anything other than rocks very close would give this results, has some hot Jupiters with tails. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut they wouldn\u0027t loose 2/3 of their mass. But of course you could argue, again, that if you put anything close enough it would loose more than 2/3 of it\u0027s mass.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EAnd the cute picture is a cartoon and uses cartoon sizes, a cat in a cartoon is larger than an mouse but not 8 time larger.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know it\u0027s the artists freedom to make it a different size, but it also gives the people who don\u0027t know any better the idea that it\u0027s almost as big as Mars.\u003C/p\u003E\u003Cp\u003EIf it looks almost as big then it must be a planet.\u003C/p\u003E\u003Cp\u003ECan anyone give a real reason, one that makes sense, why Pluto needs to be named a planet? The only reasons I read is that they just want it to be a planet, which isn\u0027t a really good reason for anything.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2014-10-03T12:08:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003ESo would anything if put close enough \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThese funny images are very misleading. Celestial bodies have not changed in couple of billions of years. Only it has, how funny little aliens on one of the planets classify them.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-10-03T12:46:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EIs really just nationalism, the states where Pluto\u0027s discoverer was born or lived passed resolutions that made it back a planet. Nobody made a fuss about Pluto being a dwarf planet in all the talks the observatory of my city gave, this is really just an issue for the US.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think a lot of folks know Pluto was discovered by someone in USA, and I remember those \u0022protests\u0022 with a quite nationalistic (not patriotic, mind that!) accent.\u003C/p\u003E\u003Cp\u003EBasically nobody outside USA gives a flying crap about the new classification. It\u0027s popular to be butthurt in USA only.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-10-03T13:08:19Z","Content":"\n\u003Cp\u003ENow there is this International Astronomical Union which decided it was time to redefine the word planet. They consist of more then 10000 individual members from all around the world (all of them astronomers Ph. D. level and beyond) and they had a vote. So really (not really just sarcastic) , what kind of impudence was it when they decided doing this, especially when many of us learned that pluto is an planet in school.\u003C/p\u003E\u003Cp\u003EIn such types of discussions you just won\u0027t find a solution which will satisfy everybody however i think IAU has found a solution i can live with and it was time to change it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhat cannot be settled by experiment is not worth debating.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-10-03T13:45:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003ESay your star system captured a rogue jupiter in a 90 degree inclined orbit. Following your definition it wouldn\u0027t be a planet.\u003Cp\u003EWe have a perfectly adequate definition of planet already:\u003C/p\u003E\u003Cp\u003E- Object massive enough to be pulled into a sphere but not massive enough for sustained fusion.\u003C/p\u003E\u003Cp\u003E- Object orbits a star.\u003C/p\u003E\u003Cp\u003E- Object has cleaned its orbit so it contains most of the matter in that orbit.\u003C/p\u003E\u003Cp\u003EWhy would we bother changing it? In the end its just a label that we use to refer to some rocks floating in space.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd yet, such an object would be clearly different from the rest.\u003C/p\u003E\u003Cp\u003EThe rest would have formed from the accretion disk of our star, that 90 degree inclined body captured from extrasolar space did not form in this way.\u003C/p\u003E\u003Cp\u003EWe could have \u0022regular planets\u0022 (or \u0022Major Planets\u0022 as someone else suggested), and irregular planets.\u003C/p\u003E\u003Cp\u003EInclinations: Sun\u0027s equator/Invariable plane\u003C/p\u003E\u003Cp\u003EMercury: 3.4/6.3**\u003C/p\u003E\u003Cp\u003EVenus: 3.8/2.2\u003C/p\u003E\u003Cp\u003EEarth: 7.2/1.6\u003C/p\u003E\u003Cp\u003EMars: 5.6/1.7\u003C/p\u003E\u003Cp\u003ECeres: ?/9.2***\u003C/p\u003E\u003Cp\u003EJupiter: 6.1/0.3\u003C/p\u003E\u003Cp\u003ESaturn: 5.5/0.9\u003C/p\u003E\u003Cp\u003EUranus: 6.5/1.0\u003C/p\u003E\u003Cp\u003ENeptune: 6.4/0.7\u003C/p\u003E\u003Cp\u003EPluto: ***11.9/15.5 ***\u003C/p\u003E\u003Cp\u003EEris: ***43.9*** (I don\u0027t know if this is the ecliptic, solar equator, or invariable plane, but when its this large, it doesn\u0027t really matter).\u003C/p\u003E\u003Cp\u003EWe could easily arrive at the same set of \u0022true planets\u0022 using the inclination to the invariable plane as the objective (though still somewhat arbitrary) criteria, instead of \u0022clearing its orbit\u0022\u003C/p\u003E\u003Cp\u003EIf we order the inclinations of the \u0022round\u0022 bodies, and take the Standard deviation of the gas giants, Earth is within 2 sigma of the inclinations of the most inclined gas giant.\u003C/p\u003E\u003Cp\u003EIf we use 2 sigma as the cutoff for an iterative inclusion, incorportating Earth into the list of planets then gets in all the other inner planets except mercury.\u003C/p\u003E\u003Cp\u003EIf we use the average\u002B a multiple of the st dev, then we need to use a multiple of 3 to incorporate Earth (otherwise, only the gas giants meet the criteria), but by incorporating earth, we then have to incorporate Mars and Venus... Mercury still doesn\u0027t make the cut.\u003C/p\u003E\u003Cp\u003EI\u0027d have to go to 8 standard deviations to incorporate mercury... but then by doing that, ceres, pluto, and even Eris make the cut....\u003C/p\u003E\u003Cp\u003EUnless we \u0022weight\u0022 the inclinations in relation to the planets mass\u003C/p\u003E\u003Cp\u003EMaybe Mercury shouldn\u0027t be a planet? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EWe could arbitrarily say that somewhere between 6.3 and 9.2 is the limit, but I like a statistics/standard deviation based approach.\u003C/p\u003E\u003Cp\u003EBut if this \u0022cleared the neighborhood\u0022 approach gets a separation of 5 orders of magnitude between planet and non-planet, then I will support it.\u003C/p\u003E\u003Cp\u003EBut my point is that the inclinations can be used to draw a clear distinction between the inner and outer planets, between Mercury and the rest of the inner planets .... and between the \u0022regular planets\u0022 and the currently named \u0022dwarf planets\u0022 (although its hard to incorporate Mercury in the \u0022regular planets\u0022 with this metric.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-03T13:48:50Z\u0022 title=\u002210/03/2014 01:48  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 3, 2014\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DarkStar64","CreatedById":95057,"CreatedDateTime":"2014-10-03T14:31:10Z","Content":"\n\u003Cp\u003Esorry for spamming but...\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=UUrMePiHCWG4Vwqv3t7W9EFg\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003Epls everyone here just watch is.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-10-03T15:01:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI know it\u0027s the artists freedom to make it a different size, but it also gives the people who don\u0027t know any better the idea that it\u0027s almost as big as Mars.\u003C/p\u003E\u003Cp\u003E If it looks almost as big then it must be a planet.\u003C/p\u003E\u003Cp\u003ECan anyone give a real reason, one that makes sense, why Pluto needs to be named a planet? The only reasons I read is that they just want it to be a planet, which isn\u0027t a really good reason for anything.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe reason is that everybody have learned its a planet so why should it be demoted, nobody remember that Ceres was one so its not very relevant. \u003C/p\u003E\u003Cp\u003EI agree that the size difference between Pluto and Mercury/ Mars is misleading. \u003C/p\u003E\u003Cp\u003EAnd yes I know the real reason, we have found many dwarf planets in the cupier belt and will find lots more, why should only Pluto be included in the public lists?\u003C/p\u003E\u003Cp\u003EIt would end up calling the current 8\u002B pluto \u002B perhaps 1 other the major planets and the \u002B200 other for planets. \u003C/p\u003E\u003Cp\u003EProbably part of the problem with Ceres back in the 19th century, they found it, then they start finding lots of asteroids, where to put the bar, they decided to exclude it but could just have included as the next one on list is far smaller but they did not know.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-10-03T15:36:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EThe reason is that everybody have learned its a planet so why should it be demoted, nobody remember that Ceres was one so its not very relevant. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat means we need to believe these things because we learned them in school:\u003C/p\u003E\u003Cp\u003E- The tongue taste map\u003C/p\u003E\u003Cp\u003E- Diamonds are made from coal\u003C/p\u003E\u003Cp\u003E- van Gogh cut off his own ear.\u003C/p\u003E\u003Cp\u003E- Einstein couldn\u0027t do math.\u003C/p\u003E\u003Cp\u003E- Benjamin Franklin discovered electricity by flying a kite which got struck by lighting.\u003C/p\u003E\u003Cp\u003E- Newton discovered gravity when an apple dropped on his head.\u003C/p\u003E\u003Cp\u003E- Columbus discovered that the Earth was round.\u003C/p\u003E\u003Cp\u003E- Napoleon was short.\u003C/p\u003E\u003Cp\u003E- Edison invented the light bulb.\u003C/p\u003E\u003Cp\u003ESome of the things I could think off.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-10-03T16:00:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EThat means we need to believe these things because we learned them in school:\u003Cp\u003E- The tongue taste map\u003C/p\u003E\u003Cp\u003E- Diamonds are made from coal\u003C/p\u003E\u003Cp\u003E- van Gogh cut off his own ear.\u003C/p\u003E\u003Cp\u003E- Einstein couldn\u0027t do math.\u003C/p\u003E\u003Cp\u003E- Benjamin Franklin discovered electricity by flying a kite which got struck by lighting.\u003C/p\u003E\u003Cp\u003E- Newton discovered gravity when an apple dropped on his head.\u003C/p\u003E\u003Cp\u003E- Columbus discovered that the Earth was round.\u003C/p\u003E\u003Cp\u003E- Napoleon was short.\u003C/p\u003E\u003Cp\u003E- Edison invented the light bulb.\u003C/p\u003E\u003Cp\u003ESome of the things I could think off.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWho teaches this crap? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-10-03T16:04:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EWho teaches this crap? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe same people who teach that \u0022evolution is just a theory\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-03T16:08:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EThe same people who teach that \u0022evolution is just a theory\u0022?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEvolution \u003Cem\u003Eis\u003C/em\u003E just a theory. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The problem lies in misunderstanding what a theory is in a scientific context.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-10-03T16:13:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EWho teaches this crap? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe same teachers that tell you centrifugal forces don\u0027t exist.\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-10-03T16:16:48Z","Content":"\n\u003Cp\u003EMy teacher in ~7th grade told us that seasons are caused by the earths elliptical orbit: If the Earth is at its closest to the sun, we have summer.\u003C/p\u003E\u003Cp\u003EAnd the phases of the Moon are caused by the shadow of the Earth.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-10-03T16:18:08Z","Content":"\n\u003Cp\u003EAre you at least living in australiaÃ‚Â¿ \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-10-03T16:25:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EWho teaches this crap? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor real? You seriously have had a cultural education that includes no mythology? I\u0027ve heard all of those canards at one time or another; in some cases they\u0027re not \u0027crap\u0027 so much as a cultural shorthand, e.g. Newton\u0027s apple represents inspiration, Edison\u0027s invention (he may not have invented the light bulb, but he did create the first practical and manufacturable version of it) represents ingenuity, etc. I can think of many other falsities that underlie almost all of human knowledge: categorization and generalization is the best way to gain systemic understanding, language can convey precise meaning, history is a chained series of causal events, etc. Part of becoming a thinking, reasoning person is discovering how and when the mythologies we absorbed in our chrysalis are and were useful, and when not. But scoffing at them, and particularly scoffing at the supposed cultural naivety of others from afar, is almost never useful.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-03T16:28:39Z\u0022 title=\u002210/03/2014 04:28  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 3, 2014\u003C/time\u003E by Mr Shifty\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-10-03T16:26:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EEvolution \u003Cem\u003Eis\u003C/em\u003E just a theory. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The problem lies in misunderstanding what a theory is in a scientific context.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI realise that (and I think you realise that I realise that), but the problem is how it is presented. There\u0027s a clear bias. Just as there\u0027s a clear bias behind the \u0022Pluto is a planet\u0022 agitators.\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-10-03T16:29:33Z","Content":"\n\u003Cp\u003EI learned more science from german public television broadcasting than from my teachers. We have this great show: \u0022Sendung mit der Maus\u0022 (Show with the Mouse).\u003C/p\u003E\u003Cp\u003EThey had a great broadcast about space travel over 20 years ago. I can\u0027t find it on the internet :/\u003C/p\u003E\u003Cp\u003EBut I found this snippet: It isn\u0027t that old, and it gives a nice idea about the format of the show. I recomment watching it, even if you don\u0027t understand a word. It is entertaining as hell.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=mOORih_yfkU\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=mOORih_yfkU\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2014-10-03T16:31:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022N_las\u0022 data-cite=\u0022N_las\u0022\u003E\u003Cdiv\u003EMy teacher in ~7th grade told us that seasons are caused by the earths elliptical orbit: If the Earth is at its closest to the sun, we have summer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am envy about quality of your teaching. My teacher \u0022knew\u0022, that we have so cold in Finland, because north latitudes are so much farther (several thousands of kilometers) from the Sun than the equator, and demonstrated it with a slide projector and a globe. Fortunately I had already learned (through the hard way, as real nerd without social skills must do) that it was better to be quiet and not ask \u0022how about the fact that Earth is 5 millions of kilometers closer Sun in January than in July\u0022. I was then about 9.\u003C/p\u003E\n"}]}