{"TopicId":87715,"ForumId":44,"TopicTitle":"Which spacecraft would you stay in for a 20 day mission: voskhod or the soyuz 7k-ok?","CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-10-18T01:38:30Z","PageNum":1,"Articles":[{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-10-18T01:38:30Z","Content":"\n\u003Cp\u003ESetting: you are a cosmonaut in the second half of the 60\u0027s, your present mission is a grand state propoganda and scientific mission to celebrate the 50th anniversary of the revolution. In the mission you and another crew member (2 crew) must survive in space for 20 days, doing experiments, broadcasting on state tv, a live tv EVA, oh and to catch up with those pesky americans you will be flying through various layers of the van allen belts. OKB-1 have decided to let you pick your ship out of two, the Voskhod and the Soyuz 7K-OK, these ships are considered the most dangerous to have ever flown, so pick your poison, here is some facts:\u003C/p\u003E\u003Cp\u003EVoskhod:\u003C/p\u003E\u003Cp\u003EComfort-small, slightly cramped but better then Gemini, oh and the walls are padded with soft orange fabric \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E .\u003C/p\u003E\u003Cp\u003ESafety-lacks LES, IVA suits provided for you and your buddy in case of cabin depress, large solid fuelled deorbit emergency motor. Can have have random system failures, includes oxygen percentage increases, guidance computer failure, main deorbit engine failure, service module seperation fail. No room to exercise (may lose bones...).\u003C/p\u003E\u003Cp\u003EEVA-you will be using berkut space suits designed for voskhod, remember Alexis spacewalk...\u003C/p\u003E\u003Cp\u003EVan allen belts-considering the voskhod capsule is a thick vostok reinforced with more \u0022armour\u0022 and a vacuum layer, you should be fine.\u003C/p\u003E\u003Cp\u003E7K-OK:\u003C/p\u003E\u003Cp\u003EComfort-very large, plenty of room to move around in, has a toilet and a wooden desk to do stuff.\u003C/p\u003E\u003Cp\u003ESafety-has a LES, no suits in case of cabin dep, two sets of deorbit engines. LOTS OF RANDOM SYSTEM FAILURES, literally anything that can go wrong could and probably would. Exercise room.\u003C/p\u003E\u003Cp\u003EEVA-you will have the yastreb suit, a grand improvement over the berkut removing problems such as ballooning, over heating, catching the bends and a chance of death. The main problem is a it tends to be stiff and rigid, you will be fine as long as you don\u0027t let go of the handrail.\u003C/p\u003E\u003Cp\u003EVan allen belts-just that thin wall between you and it...\u003C/p\u003E\u003Cp\u003EPersonally I would take my chances on the Voskhod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-10-18T02:03:14Z","Content":"\n\u003Cp\u003EWhile the padded walls of the Voskhod are tempting, I would have to go with the 7K, as I believe it has more cargo straps to keep me tied to the walls after day 10.\u003C/p\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2014-10-18T02:11:23Z","Content":"\n\u003Cp\u003ESoyuz has a space toilet so my vote would be soyuz. You\u0027d be surprised what that little convenience does for your psychological well being.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-10-18T10:16:17Z","Content":"\n\u003Cp\u003EVoskhod\u0027s life support was only rated for ten man-days. I\u0027ll pick danger of failure over certain suffocation any time.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-10-18T10:30:21Z","Content":"\n\u003Cp\u003EVoskhod 3 and 4 were supposed to be a 19 and 20-day missions, but they were cancelled.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-18T10:40:50Z\u0022 title=\u002210/18/2014 10:40  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 18, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-10-18T10:35:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EVoskhod\u0027s life support was only rated for ten man-days. I\u0027ll pick danger of failure over certain suffocation any time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually that was for Voskhod 1 and 2, Voskhod 3 which was meant to launch a 2 man crew on a 18-20 day mission in 1966, it had a newly developed life support system capable of the mission length and it actually worked, unfortunately the launch was cancelled 15 days prior to launch \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2014-10-19T04:40:44Z","Content":"\n\u003Cp\u003ENeither, I\u0027d go for a BA330. 20 days in a glorified tincan sounds like a recipe for cabin fever; at least a BA would let me have some potted(encapsulated?) plants.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-10-19T11:09:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meve12\u0022 data-cite=\u0022meve12\u0022\u003E\u003Cdiv\u003ENeither, I\u0027d go for a BA330. 20 days in a glorified tincan sounds like a recipe for cabin fever; at least a BA would let me have some potted(encapsulated?) plants.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s the mid 60\u0027s, Bigelow doesn\u0027t exist yet, and besides not only have they not launched and operated a ba330, they haven\u0027t manned anything so stop blowing it up as \u0022ermahgerd da future!\u0022.\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2014-10-19T16:00:07Z","Content":"\n\u003Cp\u003ESoyuz, even if it\u0027s not the latest soyuz (so the old one). Thought that it\u0027s designed for a well longer habitation, more crews, and it\u0027s actually proven for it (isn\u0027t soyuz is left attached to stations ?). Radiation... Maybe one actually carries enough water to stop it. Also it\u0027d be less boring - I think that having more room to do more things is better than only to do more things with the same room.\u003C/p\u003E\u003Cp\u003EI read it\u0027s history - I just wish that nobody sets the DRE config to insane level or activating the april fools joke in the RealChute.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-10-19T16:07:32Z","Content":"\n\u003Cp\u003ESoyuz, i\u0027d rather explode into a bunch of pretty sparkles than die slowly from suffocation.\u003C/p\u003E\n"}]}