{"TopicId":88197,"ForumId":44,"TopicTitle":"Cannae/EmDrive","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-10-22T09:54:53Z","PageNum":27,"Articles":[{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-05-07T08:32:14Z","Content":"\n\u003Cp\u003EWhy are you so angry, Leszek? If you\u0027re argumenting for level-headed rationalism in the face of unlikely experimental results, it\u0027s best to do so in a level-headed fashion. I know what you\u0027re trying to say and why, but your style of writing, frequent use of absolutes and extreme emotion really works against you here. You\u0027re sounding more like a zealot than those you wish to remind to not be zealots.\u003C/p\u003E\u003Cp\u003EThe truth of the matter is, Eagleworks doesn\u0027t release conclusive results because they don\u0027t have the funding to produce conclusive results (and likely because the scientists received a gag order after the whole media hubbub). There is no official EMdrive program at NASA. There\u0027s just a bunch of (admittedly highly qualified) enthusiasts with a license to think outside the box and an eagerness to experiment with this thing they got handed because of a third party\u0027s outrageous claim. The only reason this is even moving at any perceptible speed at all is because the device involved is so simple that it could be kludged together in a garden shed. Bigger test articles are under construction, to be used in bigger vacuum chambers with proper vacuum-rated equipment (which Eagleworks themselves does not possess). But this will take time, because again, there\u0027s no budget assigned to this. Only discretionary funding - in other words, whatever can be scraped together by the lab leads.\u003C/p\u003E\u003Cp\u003EUntil that has happened, it is nonsense to claim anything proven. But it is similarly nonsense to claim anything bogus and wrong. There is no \u0022doesn\u0027t work until proven otherwise\u0022 in science. There is only \u0022works if proven to work, doesn\u0027t work if proven to not work\u0022. You need to prove \u003Cem\u003Eeither\u003C/em\u003E case. And \u003Cem\u003Eneither\u003C/em\u003E has been conclusively proven yet. Despite repeated attempts, the Eagleworks team has failed to come up with an experimental setup where it \u003Cem\u003Edoesn\u0027t\u003C/em\u003E work. At the same time the results, while appearing clearly above the noise floor, are not yet good enough to rule out errors.\u003C/p\u003E\u003Cp\u003EThere do however exist simulations that explain the experimental results - down to being able to accurately predict the result of an experiment before it\u0027s been run, and down to being able to explain the experimental results achieved by the Chinese team as well. The simulation does not break any known laws of physics; it simply makes an assumption about the behavior of the quantum field that goes against the commonly accepted assumption. It\u0027s important to keep in mind, however, that the behavior of said quantum field \u003Cem\u003Ealso\u003C/em\u003E falls under things that are not conclusively proven either way. Even the commonly accepted assumption is just an assumption. It can be wrong, it can be right. We don\u0027t know for sure.\u003C/p\u003E\u003Cp\u003EAnd then it\u0027s possible that the simulation just happens to replicate the experimental effects even with a wrong assumption, because that wrong assumption just happens to work in the narrow range of results observed so far, but it stops working outside of that range. It\u0027s even possible that the simulation uses the wrong assumption to accurately predict something that \u003Cem\u003Eactually works\u003C/em\u003E because of a different reason that nobody has considered yet. Sometimes, math works out that way.\u003C/p\u003E\u003Cp\u003EIn the meantime, until the slow process of un-funded science produces a conclusive result, we\u0027re left to speculate. There\u0027s nothing wrong with speculating, so long as you don\u0027t claim it for fact. I also believe that there\u0027s nothing wrong with cautious optimism, based on the data that Eagleworks has released so far (and they shared quite a lot, at least until recently). As of today, there has been more progress made toward explaining why it might work than there has been made towards proving that it doesn\u0027t work, despite attempts to achieve the contrary. This may change wth future experiments - but there will be time to discuss that in the future, when they are published.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-07T08:35:16Z\u0022 title=\u002205/07/2015 08:35  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 7, 2015\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2015-05-07T09:05:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EThere\u0027s nothing wrong with speculating, so long as you don\u0027t claim it for fact. I also believe that there\u0027s nothing wrong with cautious optimism, based on the data that Eagleworks has released so far (and they shared quite a lot, at least until recently).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is something very wrong with undeserved hype (i.e. the kind of completely unbound optimism seen in this thread and all those articles about \u0022warp drive\u0022). The reason for that was already pointed out multiple times.\u003C/p\u003E\u003Cp\u003EThere are three kinds of people here:\u003C/p\u003E\u003Cp\u003Ea) those that don\u0027t see relevant evidence\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E those that think there is sufficient evidence, but want to know the actual mechanism\u003C/p\u003E\u003Cp\u003Ec) those that cry \u0022oh my god this is the best thing ever!!!\u0022\u003C/p\u003E\u003Cp\u003EThose in a) (e.g. Leszek) and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E (e.g. Mazon Del) are mostly being rational and scientific. But the majority here is in c), for example anyone who wants this to be tested in the ISS in the near future is (as has already been explained). Those that dismiss counterarguments based on things like \u0022no better explanation has been found\u0022, \u0022this will allow us to get to mars quicker\u0022, \u0022the effect has been proven to exist\u0022 also belong to that group. And everyone who argues that the \u0027usual\u0027 explanations (quantum foam, virtual particles being pushed around, warping spacetime, ...) are factual instead of either very theoretical or just technobabble is.\u003C/p\u003E\u003Cp\u003EIn short: Most of the people here simple are \u0022science fans\u0022, not scientists. Not unexpected in a KSP forum; but they should learn to listen to reason and those that actually do science.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-07T09:09:09Z\u0022 title=\u002205/07/2015 09:09  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 7, 2015\u003C/time\u003E by ZetaX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-05-07T13:16:46Z","Content":"\n\u003Cp\u003EZetax, last night I was told I was wrong about the article based on the following facts.\u003C/p\u003E\u003Cp\u003EA. I questioned why the author would question the validity of claims that the device was tested in a hard vacuum\u003C/p\u003E\u003Cp\u003EB. The article\u0027s conclusion, The EM Drive is still poppycock\u0022 is correct.\u003C/p\u003E\u003Cp\u003ETherefore, I am in the wrong to cry foul against an argument that the device may have not actually been tested in a hard vacuum\u003C/p\u003E\u003Cp\u003EThere was more I found in the article that was unfair, but I was sticking to that particular point (while ignoring a couple other ones that I felt were unfair) since it seemed even THAT was falling on deaf ears. There was no reason for the author to say that the hard vacuum test may have been falsified or mistaken. But it was being defended by Leszek, even though Leszek is convinced that it WAS tested in a hard vacuum. The only reason I can think of for that, is that Leszek could only see the larger picture, which is me defending the validity of the EM Drive itself. And since that points to me not being as skeptical as I should be, that means I\u0027m wrong about everything I\u0027ve said in this thread. That\u0027s a classic logical fallacy.\u003C/p\u003E\u003Cp\u003EAs has been said multiple times, the odds of the drive working is insanely slim. And if someone wants to write a story about why that is, then fine. But some of the reasons cited IN THAT PARTICULAR ARTICLE, were unfair and borderline nasty. The author basically tried to claim that because it was reported on a forum instead of in a journal, the device may have not actually been tested in a hard vacuum. That is completely illogical, and reads like elitist nonsense, almost in the same way that some writers would accuse a successful self-publisher of not being a real writer because they have never been picked up by a reputable publishing house.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EThe truth of the matter is, Eagleworks doesn\u0027t release conclusive results because they don\u0027t have the funding to produce conclusive results (and likely because the scientists received a gag order after the whole media hubbub). \u003Cp\u003EIn the meantime, until the slow process of un-funded science produces a conclusive result, we\u0027re left to speculate. There\u0027s nothing wrong with speculating, so long as you don\u0027t claim it for fact. I also believe that there\u0027s nothing wrong with cautious optimism, based on the data that Eagleworks has released so far (and they shared quite a lot, at least until recently). As of today, there has been more progress made toward explaining why it might work than there has been made towards proving that it doesn\u0027t work, despite attempts to achieve the contrary. This may change wth future experiments - but there will be time to discuss that in the future, when they are published.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI sure hope that doesn\u0027t end up being permanent. Things like this have a tendency to be swept under the rug. If they find out what is really going on, and it isn\u0027t sensational, will they even bother going through the paperwork to lift such a gag order? To the outside observer, this would create a lot of concern that the device works, but has been permanently classified so it can be turned into some new super-weapon in a top-secret military facility. Or even if they DO announce their findings, the press will ignore it if it isn\u0027t sensational. Conspiracy theorists and religious conservatives would have a field-day, and I don\u0027t want to see the \u0027Area 51\u0027 label getting slapped on NASA. They have more than enough trouble getting funding already. I\u0027ve already seen a lot of comments under articles about people accusing NASA of fabricating the whole thing, in order to get more money.\u003C/p\u003E\u003Cp\u003EAnd PS: Decided this thread needs a bit of lighthearted humor. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4u64ZYf.jpg\u0022 alt=\u00224u64ZYf.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-07T14:20:13Z\u0022 title=\u002205/07/2015 02:20  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 7, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-07T16:50:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NFUN\u0022 data-cite=\u0022NFUN\u0022\u003E\u003Cdiv\u003EModified Newtonian Dynamics, which, last I heard, didn\u0027t work in several areas and explained things more poorly than the theory of Dark Matter. Its main advantage is that it doesn\u0027t absolutely require exotic undiscovered matter, though even it still needs some form of dark matter, according to the wiki.\u003Cp\u003E\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Modified_Newtonian_dynamics\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.m.wikipedia.org/wiki/Modified_Newtonian_dynamics\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWikipedia isn\u0027t the most reliable source, especially on a controversial topic. It tends to reflect the opinions of 1 partisan or the other.\u003C/p\u003E\u003Cp\u003EAnyway, here is the actual MoND source material if you care to look. MoND is still alive and well, last I heard.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://astroweb.case.edu/ssm/mond/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://astroweb.case.edu/ssm/mond/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMoND has it\u0027s strengths and weaknesses. It does indeed to better than Dark Matter in some cases, although seemingly does worse in others, and in others neither does as well as would be liked.\u003C/p\u003E\u003Cp\u003EThe upshot is that neither MoND nor Dark Matter are totally correct in their present forms, and the beauty of having 2 alternative explanations is that they each point out areas where the other can be improved. Why is it that MoND does better, or even just equally well, as Dark Matter in some cases? That\u0027s the sort of thing that needs investigation. And it\u0027s another of those vexing \u0022why?\u0022 questions that seemingly surround EM drives more than the \u0022what?\u0022 questions.\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-05-07T16:57:43Z","Content":"\n\u003Cp\u003EI feel I should clarify something. ONLY the Eagleworks experiments were run near the noise floor and they had very good reasons for doing this as I\u0027ve gone over time and time again. Regardless of what we or the rest of the world believes, they produced enough data to convince the scientifically and fiscally conservative NASA to extend their funding through the end of the fiscal year and to build an actual high power test. Instead of a measly 10-60 watts, they will be able to play around with 1.2 kilowatts. Further funding will be decided based on the results from this test.\u003C/p\u003E\u003Cp\u003EAt this time the team, and apparently the funding distribution group, is taking the experimental results as well as the reported results from the Chinese, Shawyer, and Cannae teams as positive indication that this is worth clarifying and pinning down.\u003C/p\u003E\u003Cp\u003EAn important thing to note about NASA\u0027s funding of this team is that they have done so DESPITE the fact that they disagree with White\u0027s theories on why it works quite heavily.\u003C/p\u003E\u003Cp\u003ENow, don\u0027t take all the above as \u0027an appeal to experts\u0027 so much as just a clarification on the current state of things.\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2015-05-07T17:22:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003E/me looks up N-Rays on the Wiki.\u003Cp\u003EHeh, this sounds familiar:\u003C/p\u003E\u003Cp\u003EIf Eagleworks gave in to the same sort of thinking, they would have abandoned the project after the first experiment with the removed slits. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EA proper scientist aims to find out what is happening, rather than disprove a specific claim and leave it there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t follow you. The experiment with the removed slits was a deliberate change to test a hypothesis. An analog to what Wood did would be to disconnect the power to the EmDrive and not tell anyone. If they then run the experiment and still detect thrust and space warping, that would be a definitive test of a different sort.\u003C/p\u003E\u003Cp\u003EI actually find your post really interesting in that there were many problems with the N-Ray experiments. The whole thing would get you a failing grade in 1st year university if you tried it today. But as the saying goes, experience isn\u0027t something you get until right after you needed it. But even after all it\u0027s flaws, you managed to pick the one thing that was right and criticized it while talking about what a proper scientist would do. I hope you just skimmed the article quickly.\u003C/p\u003E\u003Cp\u003EAnyway, I have to go now so I will not be responding to the other posts right away. But it is hard to miss the first line of the next post so I will just say that I am not angry. Not even a little. Exasperated a bit perhaps...but that is my fault.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-05-07T18:24:52Z","Content":"\n\u003Cp\u003EI think the simplicity of the test rig is actually a pointer that the effect might be real. Fundamental physics dont change because you add more flashing lights. If the effect exists, it\u0027s probably shown up in unrelated tech before, but noone bothered to check for a result of physics we still dont understand. \u003C/p\u003E\u003Cp\u003EIt presumably took a crackpot looking for something that doesnt exist to discover a real thing noone was looking for. Once we go looking, a simple rig and paying attention are enough to demonstrate the effect.\u003C/p\u003E\u003Cp\u003EA higher power rig will be invaluable, of course, as it would allow more resolution on the effect than \u0022something is happening\u0022. Even if the \u0022effect\u0022 it\u0027s just a hyperefficent ion drive, better data would likely let us improve the efficency even more.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-05-07T18:26:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Leszek\u0022 data-cite=\u0022Leszek\u0022\u003E\u003Cdiv\u003EI don\u0027t follow you. The experiment with the removed slits was a deliberate change to test a hypothesis.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo it was. So was Wood\u0027s change to the N-Ray experiments. The obvious difference being that Wood was running his experiments separately from the N-Ray experimenters, and the hypothesis \u003Cem\u003Ehe\u003C/em\u003E was testing, was that the N-Ray experimenters\u0027 experiment was hogwash.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAn analog to what Wood did would be to disconnect the power to the EmDrive and not tell anyone. If they then run the experiment and still detect thrust and space warping, that would be a definitive test of a different sort.\u003C/div\u003E\u003C/blockquote\u003EWasn\u0027t the Eagleworks test likewise definitive? It was testing for the alleged operating principle of the device. That operating principle was definitively proven to be false, because thrust was still observed with a key component of that operating principle removed. I have no idea of the details of the N-Ray experiments, I just saw familiar elements in their description in the quote I posted.\u003Cp\u003EIn both cases, an experiment is performed, and is then modified via removal of a key component of the experiment, with no change to the observed result. With N-Rays the change was discreet, and the result was used to disprove the whole concept of N-Rays, rather than the experimental setup involved, but the similarities are there.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI actually find your post really interesting in that there were many problems with the N-Ray experiments. The whole thing would get you a failing grade in 1st year university if you tried it today. But as the saying goes, experience isn\u0027t something you get until right after you needed it. But even after all it\u0027s flaws, you managed to pick the one thing that was right and criticized it while talking about what a proper scientist would do. I hope you just skimmed the article quickly.\u003C/div\u003E\u003C/blockquote\u003EI read the article, but \u003Cem\u003Eonly\u003C/em\u003E the article, not any of its ancillary documents. I was mildly curious, not enraptured with the concept, to go that far. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E As such, I\u0027m not aware of any \u0027problems\u0027 in the N-Ray experiments, only that they were performed, tampered with, and consequently invalidated along with the thing they were supposed to detect.\u003Cp\u003EMy only criticism of that whole affair, is that unlike the Eagleworks today - who admittedly are working with a known and detectable concept, i.e. thrust - as far as I know so far, back then nobody thought to ask \u0022okay, so their experiment is not what they say it is, but what \u003Cem\u003Eare\u003C/em\u003E these people detecting, if it\u0027s not what they claim?\u0022 and look further into it.\u003C/p\u003E\u003Cp\u003EJust to clarify, I have no stance on N-Rays, and I\u0027ve no idea what all was actually done about them, but the above was my impression from reading the Wiki article on them.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-05-07T20:46:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EIt presumably took a crackpot looking for something that doesnt exist to discover a real thing noone was looking for. Once we go looking, a simple rig and paying attention are enough to demonstrate the effect.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESomehow, for me, I think that would even be cooler than the potential for advanced space travel. Marvelous accidents like that used to happen with experimentation all the time, but it seems like it has become a very rare thing in recent years. At least in physics and chemistry.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-05-07T21:43:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003ESomehow, for me, I think that would even be cooler than the potential for advanced space travel. Marvelous accidents like that used to happen with experimentation all the time, but it seems like it has become a very rare thing in recent years. At least in physics and chemistry.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe because everyone look for big things. To be treated seriously you have to have budget counting in millions and access to a huge collider - LHC preferably \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E If you have less than that, and report something new and unusual you are labelled as crackpot and shunned by scientific community. /end of bitter rant/\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2015-05-07T22:55:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EWhy are you so angry, Leszek? If you\u0027re argumenting for level-headed rationalism in the face of unlikely experimental results, it\u0027s best to do so in a level-headed fashion. I know what you\u0027re trying to say and why, but your style of writing, frequent use of absolutes and extreme emotion really works against you here. You\u0027re sounding more like a zealot than those you wish to remind to not be zealots.\u003Cp\u003EThe truth of the matter is, Eagleworks doesn\u0027t release conclusive results because they don\u0027t have the funding to produce conclusive results (and likely because the scientists received a gag order after the whole media hubbub). There is no official EMdrive program at NASA. There\u0027s just a bunch of (admittedly highly qualified) enthusiasts with a license to think outside the box and an eagerness to experiment with this thing they got handed because of a third party\u0027s outrageous claim. The only reason this is even moving at any perceptible speed at all is because the device involved is so simple that it could be kludged together in a garden shed. Bigger test articles are under construction, to be used in bigger vacuum chambers with proper vacuum-rated equipment (which Eagleworks themselves does not possess). But this will take time, because again, there\u0027s no budget assigned to this. Only discretionary funding - in other words, whatever can be scraped together by the lab leads.\u003C/p\u003E\u003Cp\u003EUntil that has happened, it is nonsense to claim anything proven. But it is similarly nonsense to claim anything bogus and wrong. There is no \u0022doesn\u0027t work until proven otherwise\u0022 in science. There is only \u0022works if proven to work, doesn\u0027t work if proven to not work\u0022. You need to prove \u003Cem\u003Eeither\u003C/em\u003E case. And \u003Cem\u003Eneither\u003C/em\u003E has been conclusively proven yet. Despite repeated attempts, the Eagleworks team has failed to come up with an experimental setup where it \u003Cem\u003Edoesn\u0027t\u003C/em\u003E work. At the same time the results, while appearing clearly above the noise floor, are not yet good enough to rule out errors.\u003C/p\u003E\u003Cp\u003EThere do however exist simulations that explain the experimental results - down to being able to accurately predict the result of an experiment before it\u0027s been run, and down to being able to explain the experimental results achieved by the Chinese team as well. The simulation does not break any known laws of physics; it simply makes an assumption about the behavior of the quantum field that goes against the commonly accepted assumption. It\u0027s important to keep in mind, however, that the behavior of said quantum field \u003Cem\u003Ealso\u003C/em\u003E falls under things that are not conclusively proven either way. Even the commonly accepted assumption is just an assumption. It can be wrong, it can be right. We don\u0027t know for sure.\u003C/p\u003E\u003Cp\u003EAnd then it\u0027s possible that the simulation just happens to replicate the experimental effects even with a wrong assumption, because that wrong assumption just happens to work in the narrow range of results observed so far, but it stops working outside of that range. It\u0027s even possible that the simulation uses the wrong assumption to accurately predict something that \u003Cem\u003Eactually works\u003C/em\u003E because of a different reason that nobody has considered yet. Sometimes, math works out that way.\u003C/p\u003E\u003Cp\u003EIn the meantime, until the slow process of un-funded science produces a conclusive result, we\u0027re left to speculate. There\u0027s nothing wrong with speculating, so long as you don\u0027t claim it for fact. I also believe that there\u0027s nothing wrong with cautious optimism, based on the data that Eagleworks has released so far (and they shared quite a lot, at least until recently). As of today, there has been more progress made toward explaining why it might work than there has been made towards proving that it doesn\u0027t work, despite attempts to achieve the contrary. This may change wth future experiments - but there will be time to discuss that in the future, when they are published.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo as I said, I am not angry or even upset.\u003C/p\u003E\u003Cp\u003EMy use of absolutes are carefully chosen. I never said EmDrive doesn\u0027t work for example. Where I use absolutes I mean them. Because they can\u0027t be ignored or more accurately if you do you are drifting into pseudoscience territory.\u003C/p\u003E\u003Cp\u003EIn fact as I read your post, I find that in general I agree with it. I am left to wonder if we talked past each other or something. So I am going to be explicit about what I disagree with...\u003C/p\u003E\u003Cp\u003EI disagree with just one thing here. People insist on making statements beyond the reasonable limits they can. For example statements like \u0022It is doing something\u0022 are totally false as point of fact. We don\u0027t know, we can\u0027t know, until we have results that are outside of the margins. Until that point, we have nothing concrete. I can answer any result claimed by anyone here with \u0022It doesn\u0027t matter until it is outside the margins.\u0022 That is not the same as claiming the device doesn\u0027t work. That is not the same as claiming the results are fallacious. As long as people are counting their chickens not just before they have hatched, but before the eggs have been laid, I am going to have issue. Any model that claims to explain the results that may or may not actually be there are nice. But if you can\u0027t even be sure you are modeling a real phenomenon they don\u0027t really help. Sure you can use them to inform what experiments to do next. But imagined results can follow any theory or model produced. Even the theory that faeries are how EmDrive works. You don\u0027t know whether you have imagined results until you are outside the margins. It is a failing of human perception, and it has hurt us before. That is why we are sceptical now.\u003C/p\u003E\u003Cp\u003EAnd yes I can get a bit passionate with my speech. Sorry, I am human.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThere was more I found in the article that was unfair, but I was sticking to that particular point (while ignoring a couple other ones that I felt were unfair) since it seemed even THAT was falling on deaf ears. There was no reason for the author to say that the hard vacuum test may have been falsified or mistaken. But it was being defended by Leszek, even though Leszek is convinced that it WAS tested in a hard vacuum. The only reason I can think of for that, is that Leszek could only see the larger picture, which is me defending the validity of the EM Drive itself. And since that points to me not being as skeptical as I should be, that means I\u0027m wrong about everything I\u0027ve said in this thread. That\u0027s a classic logical fallacy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm.\u003C/p\u003E\u003Cp\u003EPerhaps I came off too far to one side. I have dealt with lots of pseudoscience topics before. In those cases, there are lots of claims by \u0022paranormal investigators\u0022 and \u0022UFOlogists\u0022 (Where did they go to school for that?) along lines that sound much the same as the claim they were tested in vacuum. I have learned long ago to be sceptical of such claims until the data is shown in peer reviewed journals. That is not because the people in question are telling falsehoods. It is not because the people in question are not scientists. (There are people with doctorates in pseudoscience.) It is because until you have someone really double checking your work under scrutiny it is very easy for very human scientists to fool themselves.\u003C/p\u003E\u003Cp\u003EHaving said that, I have real hard time with the idea that those involved were unable to tell if they had a vacuum or not. But as a point of principal, and perhaps too generally applied, I am loath to accept any claim until the data is shown. The trust that comes with that is abused so much so often by so many both deliberately and accidentally.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESean Mirrsen\u003C/p\u003E\u003Cp\u003EAs I read your post I am sure you misunderstood the situation.\u003C/p\u003E\u003Cp\u003E\u0022So it was. So was Wood\u0027s change to the N-Ray experiments. The obvious difference being that Wood was running his experiments separately from the N-Ray experimenters, and the hypothesis \u003Cem\u003Ehe\u003C/em\u003E was testing, was that the N-Ray experimenters\u0027 experiment was hogwash.\u0022\u003C/p\u003E\u003Cp\u003EIs wrong.\u003C/p\u003E\u003Cp\u003EBlondlot, was running the experiment as a demonstration to other scientists. Wood removed the prism and the source from Blondlot\u0027s experiment without tell them. Blondlot and his assistant then proceeded to run the experiment with successful results anyway. The fact that the wood he put in as a source was the same kind of wood Blondlot already said didn\u0027t produce N-Rays, or that without the prism there was no way to focus said N-Rays onto the detector didn\u0027t stop the prism from focusing the N-Rays on to the detector and producing the required results.\u003C/p\u003E\u003Cp\u003ESo if I had gone to Eagleworks, and removed various required parts of the EmDrive without telling anyone, and the drive continued to work, that would demonstrate the results are imaginary.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2015-05-07T23:26:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EMaybe because everyone look for big things. To be treated seriously you have to have budget counting in millions and access to a huge collider - LHC preferably \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E If you have less than that, and report something new and unusual you are labelled as crackpot and shunned by scientific community. /end of bitter rant/\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo you are not. You are labeled a crackpot if you actually are. Which mostly includes ludicrous statements, very unplausible claims, no documentation, no accurate descriptions of what you are doing/want to do, and generally everyone else being unable to reproduce anything at all. They normally don\u0027t even use accepted ways to communicate (e.g. using LaTeX, using accepted platforms, ...), but act like nobody is taking thems eriously just because [insert some paranoia here].\u003C/p\u003E\u003Cp\u003EDon\u0027t defend them. The chance that an actual scientific find will go unnoticed because of what you said is very small (probably not nonexistent, but surely pretty small).\u003C/p\u003E\u003Cp\u003ESome of the more recent weird claims are EM drive and the FTL neutrinoes. Neither was considered crackpottery, but obviously (and rightfully) people are/were very sceptical. Actual crackpots are more along the lines of \u0022I invented yet another perpetuum mobile based on the quantum fluctuations in my cat\u0022.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-05-08T00:06:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EMaybe because everyone look for big things. To be treated seriously you have to have budget counting in millions and access to a huge collider - LHC preferably \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E If you have less than that, and report something new and unusual you are labelled as crackpot and shunned by scientific community. /end of bitter rant/\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot everywhere, the medicine industry has looked into any folklore and medicine man inventory an many times. IBM has used 10% of their profit to science in their field for decades. This NASA group is designed to look into weird effects who will change spaceflight, they will not look at stuff who has general interest like cold fusion. Just stuff who is space only. \u003C/p\u003E\u003Cp\u003ESecond they are after the long shots.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-05-08T03:48:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Leszek\u0022 data-cite=\u0022Leszek\u0022\u003E\u003Cdiv\u003ESean Mirrsen\u003Cp\u003EAs I read your post I am sure you misunderstood the situation.\u003C/p\u003E\u003Cp\u003E\u0022So it was. So was Wood\u0027s change to the N-Ray experiments. The obvious difference being that Wood was running his experiments separately from the N-Ray experimenters, and the hypothesis \u003Cem\u003Ehe\u003C/em\u003E was testing, was that the N-Ray experimenters\u0027 experiment was hogwash.\u0022\u003C/p\u003E\u003Cp\u003EIs wrong.\u003C/p\u003E\u003Cp\u003EBlondlot, was running the experiment as a demonstration to other scientists. Wood removed the prism and the source from Blondlot\u0027s experiment without tell them. Blondlot and his assistant then proceeded to run the experiment with successful results anyway. The fact that the wood he put in as a source was the same kind of wood Blondlot already said didn\u0027t produce N-Rays, or that without the prism there was no way to focus said N-Rays onto the detector didn\u0027t stop the prism from focusing the N-Rays on to the detector and producing the required results.\u003C/p\u003E\u003Cp\u003ESo if I had gone to Eagleworks, and removed various required parts of the EmDrive without telling anyone, and the drive continued to work, that would demonstrate the results are imaginary.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay. But what of the next step? Eagleworks would have went \u0022huh\u0022, and tried to determine what creates the thrust, since thrust is a thing you can measure, and they had been measuring it. If the tampered-with, beyond-a-shadow-of-doubt nonfunctional test article \u003Cem\u003Estill\u003C/em\u003E produces measurable thrust, \u003Cem\u003Esomething is going on\u003C/em\u003E. That is, as I said, the one area where Eagleworks is at an advantage. They were not aiming to prove the existence of \u003Cem\u003Ethrust\u003C/em\u003E as a \u003Cem\u003Econcept\u003C/em\u003E. They already know that thrust is a thing that exists, so when their results show that there is thrust, they know that something is happening. Blondlot had to prove that he wasn\u0027t, as it were, \u0022seeing things\u0022 first. \u003C/p\u003E\u003Cp\u003ELike I said, I don\u0027t know if anyone tried to do any follow-up experiments to determine \u003Cem\u003Ewhat\u003C/em\u003E, if anything, the experiments were actually detecting before. But unless the creator of the concept of N-Rays admitted that he made the whole thing up, I think it was a thing that could have been looked into - at the very least so that whatever that factor was does not interfere with any future experiments.\u003C/p\u003E\n"},{"CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-05-08T05:12:49Z","Content":"\n\u003Cp\u003EHowever, it would be nice to see some more negative controls. Remove this and that part - does it still work? Those experiments.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-05-08T05:31:54Z","Content":"\n\u003Cp\u003EI think they\u0027re down to just two parts right now. The RF emitter and the resonance chamber. And they already tested the RF emitter on its lonesome, I believe. (Assuming the \u0022RF Load\u0022 test back during the slits/no-slits experiment series was that) It didn\u0027t produce thrust.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-05-08T06:53:15Z","Content":"\n\u003Cp\u003EThe baffling beauty of EmDrive is in its simplicity. It consists of a metal box and some off the shelf electronic components. There is not much you can remove from this setup. And yet this box, while powered by relatively small current produces more thrust than new and sophisticated ion engines. And i refuse to believe a team of NASA propulsion specialists doesn\u0027t know how to detect and measure thrust of anything resembling a rocket engine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-05-08T17:40:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Leszek\u0022 data-cite=\u0022Leszek\u0022\u003E\u003Cdiv\u003EPerhaps I came off too far to one side. I have dealt with lots of pseudoscience topics before. In those cases, there are lots of claims by \u0022paranormal investigators\u0022 and \u0022UFOlogists\u0022 (Where did they go to school for that?) along lines that sound much the same as the claim they were tested in vacuum. I have learned long ago to be sceptical of such claims until the data is shown in peer reviewed journals. That is not because the people in question are telling falsehoods. It is not because the people in question are not scientists. (There are people with doctorates in pseudoscience.) It is because until you have someone really double checking your work under scrutiny it is very easy for very human scientists to fool themselves.\u003Cp\u003EHaving said that, I have real hard time with the idea that those involved were unable to tell if they had a vacuum or not. But as a point of principal, and perhaps too generally applied, I am loath to accept any claim until the data is shown. The trust that comes with that is abused so much so often by so many both deliberately and accidentally.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuite understandable. And yeah, I\u0027ve seen tensions unusually high on this topic in many places. For me the reaction to the news is almost as fascinating as the news itself. For example, I don\u0027t remember this happening at all when the alleged FTL neutrino news broke. Something about this has gotten people much more excitable than other alleged groundbreaking discoveries that later proved to be the result of a random error.\u003C/p\u003E\u003Cp\u003EI guess if the cold fusion debacle had happened with today\u0027s communication, it might\u0027ve been this crazy. But then lab tests looking for a warp bubble based on the Alcubierre drive have been inconclusive, but still hopeful so far. Yet you don\u0027t even hear a peep about that project anymore - even though it seems that NASA\u0027s PR department tried a lot harder to generate buzz for it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-08T17:45:18Z\u0022 title=\u002205/08/2015 05:45  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-05-08T18:21:05Z","Content":"\n\u003Cp\u003EAnyone know when the next round of tests is going to happen? I\u0027m pretty fed up of this maybe it works maybe it doesn\u0027t debate. Hopefully they can prove or disprove it completely ASAP.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-09T04:40:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003Ealleged FTL neutrino\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, for starters, FTL neutrinos wouldn\u0027t really be nearly as big of a deal. Neither from theoretical nor practical standpoint. It seemed likely that there was an experimental error, but it wouldn\u0027t have uprooted anything fundamentally if it wasn\u0027t. Enough things appear to propagate FTL on both Quantum and Cosmological scales to merit merely a \u0022huh\u0022 on the freaky physics scale. And there were no direct applications. If they could propagate slightly FTL through vacuum, \u003Cem\u003Emaybe\u003C/em\u003E there would be some use. And even that\u0027s a stretch. If you have to send them through a rock, well, that\u0027s just a theoretical curiosity, then, with no practical use.\u003C/p\u003E\u003Cp\u003EEMDrive supposedly generates enough thrust to be practically applicable already. And at power/thrust ratio that blows away all competition. That\u0027s not just a curiosity. That\u0027s something a lot of people would genuinely very much like to have. And that\u0027s even if it turns out to be just an ion drive. It\u0027s not something with maybe some potential applications in the future. We can find fantastic uses for it right now.\u003C/p\u003E\u003Cp\u003EAnd on the flip side, it wouldn\u0027t be just a minor curiosity in theoretical physics. It\u0027s a big fat cross on the entire discipline. It\u0027s not another, \u0022The theory wasn\u0027t quite right, here\u0027s a fix.\u0022 It\u0027s a genuine square one. And square one here goes back to the Greeks. Not only that, but it leaves all of the questions of how theory so wrong could have given predictions so right all along completely open. Which kind of casts doubt on scientific principle overall. And then we\u0027re completely up the creek without a paddle.\u003C/p\u003E\u003Cp\u003ESo if you\u0027re wondering why EMDrive generates so much more tension than superluminal leptons, it\u0027s because the later has not a tiny fraction of conflict between value to application and theory of the former. Whenever something has potential of providing immediate practical benefits, but casts under doubt the system that brought forward advancements before it, there is tension. And few things we\u0027ve encountered have as much potential to do both as a reactionless drive.\u003C/p\u003E\u003Cp\u003EFortunately, it\u0027s also a reason to be absolutely certain that nothing will come out of it, beyond, maybe, new applications in ion propulsion. We just can\u0027t be \u003Cem\u003Ethat\u003C/em\u003E wrong about foundations and only be finding out about it now.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-05-09T04:59:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd on the flip side, it wouldn\u0027t be just a minor curiosity in theoretical physics. It\u0027s a big fat cross on the entire discipline. It\u0027s not another, \u0022The theory wasn\u0027t quite right, here\u0027s a fix.\u0022 It\u0027s a genuine square one. And square one here goes back to the Greeks. Not only that, but it leaves all of the questions of how theory so wrong could have given predictions so right all along completely open. Which kind of casts doubt on scientific principle overall. And then we\u0027re completely up the creek without a paddle.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDidnt someone mention that Dr White figured out a way for it to work while \u0022only\u0022 rewriting quantum mechanics?\u003C/p\u003E\u003Cp\u003EAt the very least it would mean we\u0027re only throwing out 100 years of scientific progess, not ten thousand.\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2015-05-09T06:06:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EDidnt someone mention that Dr White figured out a way for it to work while \u0022only\u0022 rewriting quantum mechanics?\u003Cp\u003EAt the very least it would mean we\u0027re only throwing out 100 years of scientific progess, not ten thousand.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is also the fact Roger Showyer\u0027s original theory and math doesn\u0027t pan out, so that means he built a perfectly functioning drive effectively accidentally.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-05-09T06:14:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Leszek\u0022 data-cite=\u0022Leszek\u0022\u003E\u003Cdiv\u003EThere is also the fact Roger Showyer\u0027s original theory and math doesn\u0027t pan out, so that means he built a perfectly functioning drive effectively accidentally.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s an incredible coincidence, one that boggles the imagination, but even a broken clock is right twice a day.\u003C/p\u003E\u003Cp\u003EAs I said, it presumably took a crackpot looking to prove a bad theory to accidently discover physics that noone had any idea existed.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-09T06:38:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EDidnt someone mention that Dr White figured out a way for it to work while \u0022only\u0022 rewriting quantum mechanics?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, because conserved currents. The momentum has to be carried away by stable particles, or it can\u0027t work in vacuum. That means mass poles. That means you have to have propellant.\u003C/p\u003E\u003Cp\u003EAt best, Dr. White\u0027s hypothesis buys it a greater length scale, which could allow the craft to use low vacuum, such as that found in low orbit, as propellant. It would prevent the craft from operating in interplanetary space, but could still be useful for LEO operations. Of course, even this is a huge if.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-05-09T06:47:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EIt\u0027s an incredible coincidence, one that boggles the imagination, but even a broken clock is right twice a day.\u003Cp\u003EAs I said, it presumably took a crackpot looking to prove a bad theory to accidently discover physics that noone had any idea existed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnyway - as you\u0027ve probably guessed, we now need your help.\u003C/p\u003E\u003Cp\u003ESorry - not intended to be a dig at Rakaydos\u0027 comment but the way it was written would fit right in with some KSP contract or other. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}