{"TopicId":88798,"ForumId":44,"TopicTitle":"I wonder why Gs are higher during reentry than launch","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-10-28T22:21:28Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-10-28T22:21:28Z","Content":"\n\u003Cp\u003EFor example once when i did suborbital flight in ksp, i get 4 G during launch and 11.5 during reentry?\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-10-28T22:27:06Z","Content":"\n\u003Cp\u003EYou pull high Gs because of ballistic reentry, basically the stronger braking speed is, the steeper your ship dives into the atmosphere, and this in turn increases the braking force even more. On takeoff you avoid this (either high drag or high Gs) because you usually don\u0027t have enough thrust to do this. It\u0027s really hard to make a rocket this powerful and still keep it practical.\u003C/p\u003E\u003Cp\u003EIn real life, G loads top at 4-5 just before staging, and reentry is not ballistic, the capsules glide a bit to have a moderate acceleration all the way down.\u003C/p\u003E\u003Cp\u003ELast ballistic reentry I can remember: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Soyuz_TMA-11\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Soyuz_TMA-11\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESaturn V ascent profile:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/8/87/Apollo_8_acceleration.png\u0022 alt=\u0022Apollo_8_acceleration.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Soyuz_7K-T_No.39\u0022 rel=\u0022external nofollow\u0022\u003ESoyuz 18A\u003C/a\u003E had an unusual abort: the 3rd stage failed, when the ship was very high above the atmosphere at almost orbital speed. When reentry started, the orientation radar couldn\u0027t lock correctly in those conditions, and turned the capsule to glide down rather than up, increasing G loads higher than those of ballistic reentry, up to 21.3 g, according to Wikipedia.\u003C/p\u003E\u003Cp\u003ECaptions: (left) Lift force prolongs breaking, lowering the G loads. (right) Lift force increases braking, raising G loads.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://habrastorage.org/files/2ab/83e/e02/2ab83ee027ff436d81dce9b2e023ef8f.jpg\u0022 alt=\u00222ab83ee027ff436d81dce9b2e023ef8f.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-28T22:48:40Z\u0022 title=\u002210/28/2014 10:48  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 28, 2014\u003C/time\u003E by Kulebron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-10-28T23:36:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003EFor example once when i did suborbital flight in ksp, i get 4 G during launch and 11.5 during reentry?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause you took longer to speed up with the rocket than it took the atmosphere to slow you down when you hit it on the way back.\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-10-28T23:52:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003EFor example once when i did suborbital flight in ksp, i get 4 G during launch and 11.5 during reentry?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDuring ascent, you have control over your acceleration, and that ascent is usually not too fast because of issues which crop up when you ascend too quickly. During reentry, you\u0027re quite ballistic: if you\u0027ve got FAR installed, you can control your reentry a little bit with a lifting reentry, but you\u0027re still mostly ballistic.\u003C/p\u003E\u003Cp\u003EIn stock KSP, you\u0027re ascending at ~2 G to avoid exceeding terminal velocity (going faster makes you waste fuel fighting atmosphere). In the real world, or when playing with FAR/NEAR, you generally start your ascent at 1.2-1.6 Gs of acceleration because, were it any higher, you would risk aerodynamic failure. In either, during re-entry, you\u0027re on a ballistic course for lower atmosphere, and no matter what tricks you play to bleed off as much velocity as possible in the upper atmosphere, sooner or later you \u003Cem\u003Ewill\u003C/em\u003E slam into lower atmosphere with a lot of velocity left, where drag will hit very, very hard.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-10-29T00:33:50Z","Content":"\n\u003Cp\u003EThere\u0027s one case when you can have about 3g quite evenly, even with current aerodynamics: on a return to Kerbin from MÃƒÂ¼n or other planets, you can plough down to 29-30Km, still high, but get moderate Gs, then flare a bit to 35-50Km flying at about 1700 m/s, then descend again, hitting about 3g again, not more. In this case, the very eccentric orbit lifts you instead of a lifting body.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-10-29T08:04:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003EThere\u0027s one case when you can have about 3g quite evenly, even with current aerodynamics: on a return to Kerbin from MÃƒÂ¼n or other planets, you can plough down to 29-30Km, still high, but get moderate Gs, then flare a bit to 35-50Km flying at about 1700 m/s, then descend again, hitting about 3g again, not more. In this case, the very eccentric orbit lifts you instead of a lifting body.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes you aerobrake into an ballistic trajectory, so you get 500 m/s less to brake.\u003C/p\u003E\u003Cp\u003ESpaceplanes also get far more gentle braking as they generate lift\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-10-29T10:46:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starman4308\u0022 data-cite=\u0022Starman4308\u0022\u003E\u003Cdiv\u003EIn stock KSP, you\u0027re ascending at ~2 G to avoid exceeding terminal velocity (going faster makes you waste fuel fighting atmosphere).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is only strictly true during the vertical stage of the ascent. Once you begin gravity turn, you briefly need a bit higher TWR. But that tends to work out, since your rocket is getting lighter.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2014-10-29T14:07:32Z","Content":"\n\u003Cp\u003EFor the record, in the real world, the acceleration loading on launch depends on the exact vehicle, while the G-loading on entry depends on the spacecraft AND the trajectory.\u003C/p\u003E\u003Cp\u003EFor example, the Redstone, Atlas, and Titan boosters used in the Mercury and Gemini programs were converted ICBMs, designed to launch (relatively) tough nuclear warheads that didn\u0027t care much about high G-loadings. As a result, they made no effort to limit TWR in the later stages of ascent--the closest they came was the Atlas\u0027s \u0022stage-and-a-half\u0022 staging where the two outboard booster engines (which made about 3/4 of the total launch thrust) were jettisoned two minutes into flight, but that was less for TWR control and more for a more efficient use of propellants. All three of them saw G-loadings exceeding 7g during the ascent; Titan II-Gemini actually did this twice, once near the end of the first stage burn, and once near the end of the second stage burn. I don\u0027t know much about the Saturn IB used for Apollo 7 and the Skylab and ASTP flights, at least in ascent G loads, but when it came to the Saturn V, as Mike Collins put it, \u0022Saturn is a gentleman,\u0022 with maximum G loadings of about 4.5g during ascent, thanks to the planned early shutdown of the center engine in the first and second stages--which was done solely for TWR control without the added complication of a throttle. Shuttle maintained a 3g maximum through throttles on the SSMEs and careful shaping of the SRB propellant castings to control thrust levels.\u003C/p\u003E\u003Cp\u003EAs for entry G loadings, KSP re-entries are currently ballistic, as the aerodynamic model doesn\u0027t simulate spacecraft body lift, only wing lift. In reality, the only manned spacecraft designed for pure ballistic re-entries were the Mercury and Vostok spacecraft. While I don\u0027t have any access to the Vostok\u0027s entry G-loading data, I do know that Mercury\u0027s G-loading soared on entry, particularly on the two suborbital flights (which, by nature, had a steeper entry angle than the orbital flights). If you listen to the cockpit tapes of Al Shepard\u0027s Mercury flight, you\u0027ll hear him reading out G-loadings during the entry. \u0022Three... five... seven... *grunt* nine... ELEVEN... I\u0027m OK... OK... OK...\u0022 After the parachute had deployed, he reported to the ground a peak G-loading of about 11.5g during the entry.\u003C/p\u003E\u003Cp\u003EAll other capsules, as mentioned above, had/have their center of mass *not* along the vehicle centerline, so that their aerodynamically neutrally stable attitude is tilted slightly, to generate some lift and reduce the entry G-loading. For return from low Earth orbit on a normal lifting entry trajectory, there\u0027s a handy rule of thumb--the peak entry G-loading is equal to the reciprocal of the spacecraft\u0027s lift-to-drag ratio. For example, the Gemini capsule had a lift-to-drag ratio of 1:4, which meant that the peak entry G-loading in it was about 4g. (I\u0027m not sure this held true for the Space Shuttle, but it flew an extremely shallow entry profile designed to reduce peak thermal loading at the cost of a much longer thermal soak, to suit the reusable thermal protection system employed; the ablative TPS used on capsule-type spacecraft can handle a much higher peak thermal load, but is more limited in the length of the acceptable exposure.)\u003C/p\u003E\u003Cp\u003EHowever, attempting to use a \u0022normal\u0022 shallow entry profile on Apollo wasn\u0027t an option, except on 7, 9, and the Skylab and ASTP missions. Coming back from the Moon, there was no braking burn into Earth orbit before entry; they flew a direct entry trajectory that saw them plummet straight into the atmosphere to land. Using that shallow of a profile would have resulted in the spacecraft \u0022skipping\u0022 off the atmosphere and off into a high Earth orbit that would not return before the command module\u0027s consumables were used up and the crew was dead (some \u0022skip\u0022 profiles would even see them end up in an orbit that would never re-enter the atmosphere!). As a result, a much steeper profile had to be used, and the L:D rule of thumb didn\u0027t work any more. A normal Apollo lunar re-entry would hit about 7.5g, and if the trajectory was a bit off but still within survivable limits, that could soar as high as 14g. (As a result, all Apollo Command Module Pilots had to be trained to fly the entire entry--solo, in case the Lunar Module crashed or couldn\u0027t launch from the surface--at 14g in a centrifuge, which, according to Collins, was \u0022no fun at all.\u0022)\u003C/p\u003E\u003Cp\u003E(As a side note, there *was* a contingency plan for Apollo, in case the designated landing zone was forecast to be in a typhoon at landing, to deliberately use a trajectory that was shallow enough to create a small atmospheric \u0022skip\u0022 before the terminal entry and shift the landing point a few hundred miles into hopefully better weather. Since this was never tested unmanned, the crews were understandably a bit apprehensive about actually using it...)\u003C/p\u003E\n"}]}