{"TopicId":89198,"ForumId":44,"TopicTitle":"Nerva performances","CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-11-02T11:25:49Z","PageNum":1,"Articles":[{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-11-02T11:25:49Z","Content":"\n\u003Cp\u003EI\u0027ve been reading a bit about Nerva, and there are a few things I don\u0027t understand.\u003C/p\u003E\u003Cp\u003EFirst, the ISP at sea level is really poor (well, still better than chemical). Is it a fundamental problem with using propellant that has lower molecular mass than the atmosphere, or is the result of a design optimized for vacuum operation?\u003C/p\u003E\u003Cp\u003ESecond, the NERVA 2 specs I could find say 380s ISP and 867kN, which gives us a mechanical power of 3.2GW, but the thermal power was 4.5GW. What happened to the remaining 1.3GW? That is a lot of heat, and it should cause all sorts of noticeable effects.\u003C/p\u003E\u003Cp\u003EThird, there is power density, 4.5GW seems a lot, but the Space Shuttle main engine provided 1800kN and 366s of ISP at sea level, for a power of 6.5GW. How come a nuclear engine has a lower power density than a chemical one? Is it some limitation inherent to controlled nuclear reactions, or does it have to do with the difficulty of transferring that kind of power to a coolant?\u003C/p\u003E\u003Cp\u003EAnd then, there is the thrust. Nuclear engines are heavy by design, but they have such great ISPs than single stage to orbit can be considered. The problem is that you need a decent TWR not to waste all your fuel on gravity drag. How difficult would it be to use different mixes of gases for different phases of flight, starting with heavier gases and moving to hydrogen once gravity drag stops being a big issue?\u003C/p\u003E\u003Cp\u003EA good way to do so would be to add some oxygen to the flow, which would result in lower ISP (same temperature, higher average molecular mass), but higher thermal output (through combustion), hence a significantly higher thrust. The way I see it, oxygen would be added to the stream of hot hydrogen, because combustion instabilities are not something you want inside a nuclear reactor.\u003C/p\u003E\u003Cp\u003ETo get an idea about the numbers, the NERVA2 had a mass flow of about 230kg/s, roughly 114000 moles/s. Burning 1mole of H2 releases 240kJ, if we could burn it all, it would release about 27GW, which would make it the most powerful rocket engine ever, it would also require pumping 1.8t/s of O2. A more realistic design could burn 10% of the hydrogen, providing 2.7GW and requiring \u0022only\u0022 180kg/s of O2. Although the temperature would get higher than what a solid fuel nuke can survive, the larger molar mass would likely result in similar or lower ISP, especially at sea level, but a much larger thrust, making the engine a lot more versatile.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T11:28:35Z\u0022 title=\u002211/02/2014 11:28  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by Idobox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-11-02T11:42:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESecond, the NERVA 2 specs I could find say 380s ISP and 867kN, which gives us a mechanical power of 3.2GW, but the thermal power was 4.5GW. What happened to the remaining 1.3GW? That is a lot of heat, and it should cause all sorts of noticeable effects.\u003C/p\u003E\u003Cp\u003EThird, there is power density, 4.5GW seems a lot, but the Space Shuttle main engine provided 1800kN and 366s of ISP at sea level, for a power of 6.5GW. How come a nuclear engine has a lower power density than a chemical one? Is it some limitation inherent to controlled nuclear reactions, or does it have to do with the difficulty of transferring that kind of power to a coolant?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou just answered your own questions. In a chemical engine, the vast majority of the heat is generated within and carried away by the reaction products, you just have to worry about the small proportion radiated into the combustion chamber and nozzle. In a nuclear engine, much of the heat is generated away from the propellant and can\u0027t be easily removed by it, limiting the power levels that can be reached without the engine melting.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-02T12:12:35Z","Content":"\n\u003Cp\u003EInjecting oxygen is a bad idea. It looks good until you ask yourself why they used hydrogen for propellant and not something that\u0027s much easier to store and handle. And the reason is that you get higher I\u003Csub\u003ESP\u003C/sub\u003E at the same chamber temperatures with lighter propellant. To get the same I\u003Csub\u003ESP\u003C/sub\u003E from water, which is what you\u0027ll get in exhaust if you start burning hydrogen, you need 3x higher chamber temperatures. And NERVA is already running close to the limit.\u003C/p\u003E\u003Cp\u003EEven if you were to inject both oxygen and hydrogen from a NERVA-like system, and you happen to have some sort of an impossible to melt chamber to do the afterburn in, you\u0027d still end up with worse performance than NERVA alone.\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-11-02T13:50:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EYou just answered your own questions. In a chemical engine, the vast majority of the heat is generated within and carried away by the reaction products, you just have to worry about the small proportion radiated into the combustion chamber and nozzle. In a nuclear engine, much of the heat is generated away from the propellant and can\u0027t be easily removed by it, limiting the power levels that can be reached without the engine melting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for confirming my suspicion.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EInjecting oxygen is a bad idea. It looks good until you ask yourself why they used hydrogen for propellant and not something that\u0027s much easier to store and handle. And the reason is that you get higher ISP at the same chamber temperatures with lighter propellant. To get the same ISP from water, which is what you\u0027ll get in exhaust if you start burning hydrogen, you need 3x higher chamber temperatures. And NERVA is already running close to the limit.\u003Cp\u003EEven if you were to inject both oxygen and hydrogen from a NERVA-like system, and you happen to have some sort of an impossible to melt chamber to do the afterburn in, you\u0027d still end up with worse performance than NERVA alone. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is no question that hydrogen is optimal if you don\u0027t have to worry about gravity losses, and NERVA was planned to be used as a last stage, so it made complete sense. But if you want SSTO, you need a TWR larger than 1, and preferably around 2 or 3, otherwise you\u0027re going to waste an awful lost of deltaV to gravity drag.\u003C/p\u003E\u003Cp\u003EMy idea is to modulate the molar mass of the exhaust, a bit like VASIMR is supposed to do: high thrust low ISP at sea level to get off the ground, and once you\u0027re high enough, high ISP low thrust to get to orbital speed.\u003C/p\u003E\u003Cp\u003ENerva was limited by the temperature of the core, which would loose rigidity somewhere between 2500 and 3000K. RP1 Lox burns at 3700K, and that doesn\u0027t seem to be an impossible problem to solve for chemical rockets. And then again, the sea level ISP of a chemical rocket is already higher than that of Nerva.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-11-02T13:54:46Z","Content":"\n\u003Cp\u003ESomebody else had already had that idea, it\u0027s called \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/enginelist.php#id--Nuclear_Thermal--Solid_Core--LANTR\u0022 rel=\u0022external nofollow\u0022\u003ELANTR\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-11-02T14:56:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003EBut if you want SSTO, you need a TWR larger than 1, and preferably around 2 or 3, otherwise you\u0027re going to waste an awful lost of deltaV to gravity drag.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUntil the atmosphere is fixed, KSP should drop the realism claim. You\u0027re wrong, 2 or 3 is way too much for any rocket that\u0027s not a missile, \u003Cem\u003Eespecially\u003C/em\u003E an SSTO. You want a SL TWR of 1.2, and you\u0027ll still have to throttle down at the end of the ascent. \u003C/p\u003E\u003Cp\u003EThe main idea with a LANTR is that you inject LOX into hydrogen flow \u003Cem\u003Eafter \u003C/em\u003Ethe reactor. You might heat it (and it\u0027s a good idea to do so), but no combustion takes place inside the reactor itself. Essentially, you turn your nuclear rocket into a chemical one, with performance being improved thanks to both propellants being pre-heated. Also note, you\u0027ll be running very fuel-rich anyway, like most chemical rockets do, so the exhaust would still be mostly hydrogen. Indeed, this is how they manage the 3700K combustion of LOX\u002BRP1. The combustion chamber is never actually at that temperature, excess LOX (I think, it\u0027s got a lower molecular weight than RP1) flows through the engine, lowering the combustion temperature, but improving Isp thanks to its lower molecular weight. Hydrogen engines take this to extremes, with 3 times more LH2 being ran through the engine than the reaction equation would imply. A LANTR would give you a slightly higher thrust than a pure chemical rocket of similar characteristics, along with much better Isp. And it would work at SL just fine, though for SSTO use, it\u0027d be good to install some altitude compensation (extendable nozzle, aerospike, you name it).\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-03T02:18:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003EThere is no question that hydrogen is optimal if you don\u0027t have to worry about gravity losses, and NERVA was planned to be used as a last stage, so it made complete sense. But if you want SSTO, you need a TWR larger than 1, and preferably around 2 or 3, otherwise you\u0027re going to waste an awful lost of deltaV to gravity drag.\u003Cp\u003EMy idea is to modulate the molar mass of the exhaust, a bit like VASIMR is supposed to do: high thrust low ISP at sea level to get off the ground, and once you\u0027re high enough, high ISP low thrust to get to orbital speed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHm. Might work. TWR of NERVA isn\u0027t as bad as I thought it\u0027d be. I still think you\u0027ll get much better milage out of having a proper chemical first stage, but you might be able to make it into an SSTO with a chemical afterburner instead if you really wanted to. It\u0027d be one big SSTO, though.\u003C/p\u003E\u003Cp\u003EIf it\u0027s just a matter of making it recyclable, I\u0027d rather make first stage an entirely chemical space-plane. That stage wouldn\u0027t quite make it to orbit with payload, but it\u0027d get the NERVA stage onto high enough trajectory to take over, and then return safely to the ground.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-11-03T04:50:08Z","Content":"\n\u003Cp\u003ESince we have a NERVA thread anyway...\u003C/p\u003E\u003Cp\u003E...two questions. I love nuclear propulsion ideas (hence my username) but the problem is politics of launching nuclear material*. Could you mine thorium in the thorium-rich region of the moon to produce nuclear fuels?\u003C/p\u003E\u003Cp\u003EAnd, if so, what kind of specific impulse would a NERVA using liquid oxygen get? I know it wouldn\u0027t be good, but oxygen is easily available on the moon whereas hydrogen and other light elements aren\u0027t (except in the polar craters). Would it be good enough to SSTO from the Moon (at which point you could fuel with hydrogen from Earth or asteroids or whatever).\u003C/p\u003E\u003Cp\u003E*this is silly because we launch RTGs and plutonium is vastly more radioactive than U-235, but...\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-03T06:16:05Z","Content":"\n\u003Cp\u003EIf isotope composition is about the same, then sure, there shouldn\u0027t be any problems with using Thorium for NTR fuel. In fact, haven\u0027t there been some discussions of Thorium-based NTR projects on this forum?\u003C/p\u003E\u003Cp\u003EOxygen is pretty bad for propellant, though. You\u0027ll get about 1/4 of the I\u003Csub\u003ESP\u003C/sub\u003E compared to hydrogen. All other things being the same, it drops as inverse square root of molecular mass of the propellant. Oxygen being 16 times heavier gives you that factor of 4 drop.\u003C/p\u003E\u003Cp\u003EThat\u0027s still well over 200s, though, so if it\u0027s abundant enough, it might still be a cheaper option.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-11-03T10:26:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EUntil the atmosphere is fixed, KSP should drop the realism claim. You\u0027re wrong, 2 or 3 is way too much for any rocket that\u0027s not a missile, \u003Cem\u003Eespecially\u003C/em\u003E an SSTO. You want a SL TWR of 1.2, and you\u0027ll still have to throttle down at the end of the ascent. \u003Cp\u003EThe main idea with a LANTR is that you inject LOX into hydrogen flow \u003Cem\u003Eafter \u003C/em\u003Ethe reactor. You might heat it (and it\u0027s a good idea to do so), but no combustion takes place inside the reactor itself. Essentially, you turn your nuclear rocket into a chemical one, with performance being improved thanks to both propellants being pre-heated. Also note, you\u0027ll be running very fuel-rich anyway, like most chemical rockets do, so the exhaust would still be mostly hydrogen. Indeed, this is how they manage the 3700K combustion of LOX\u002BRP1. The combustion chamber is never actually at that temperature, excess LOX (I think, it\u0027s got a lower molecular weight than RP1) flows through the engine, lowering the combustion temperature, but improving Isp thanks to its lower molecular weight. Hydrogen engines take this to extremes, with 3 times more LH2 being ran through the engine than the reaction equation would imply. A LANTR would give you a slightly higher thrust than a pure chemical rocket of similar characteristics, along with much better Isp. And it would work at SL just fine, though for SSTO use, it\u0027d be good to install some altitude compensation (extendable nozzle, aerospike, you name it).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUmmm no.\u003C/p\u003E\u003Cp\u003EThe space shuttle had a TWR well over that. The engines throttle down during asccent to limit it to 4gs.\u003C/p\u003E\u003Cp\u003EIf you are doing vertical ascent, you want at least a TWR of 2.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-03T11:03:24Z","Content":"\n\u003Cp\u003EReal rockets are a bad example of it, because they tend not to be very efficient away from full throttle. So it ends up being more efficient to lift up balls to the wall, rather than throttle down for optimal TWR.\u003C/p\u003E\u003Cp\u003ETWR = 2 is optimal under two assumptions. Your ascent is perfectly vertical, and drag is quadratic. Neither of these are true. Quadratic drag model does not apply anywhere in the vicinity of transonic region, which is basically all of early ascent. Once the rocket gets into mach-independence region, you are well into gravity turn, and density starts to play a role as well.\u003C/p\u003E\u003Cp\u003EAt any rate, claiming that TWR should be exactly 2, or certainly over 2, for a real rocket is a bit reaching. But there will certainly be times when you need TWR in that vicinity during ascent. TWR of 1.2 is not going to cut it for a good ascent. Some rockets might be built to have a 1.2 from the pad, simply because they will also be running balls to the wall and will get up to higher TWR further in flight, but no rocket will ever be built to intentionally maintain 1.2 or anything like it.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-11-03T12:45:34Z","Content":"\n\u003Cp\u003E\u0022TWR = 2 is optimal under two assumptions.\u0022\u003C/p\u003E\u003Cp\u003EYou forgot a 3rd assumption: the scale height is so high compared to your vertical velocity, that your terminal velocity does not increase significantly.\u003C/p\u003E\u003Cp\u003ETWR of two will fight gravity drag \u002B air drag at terminal velocity, but if terminal velocity is increasing at 500 m/s^2, a TWR of 2 is not going to cut it.\u003C/p\u003E\u003Cp\u003EIt won\u0027t cut it if terminal velocity is increasing at 50 m/s^2, and its still a bit sub optimal if TWR is increasing at 5 m/s^2 (though your lag behind terminal velocity won\u0027t be so bad in that case)\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-03T13:55:50Z","Content":"\n\u003Cp\u003EYes, good catch. Thank you.\u003C/p\u003E\n"},{"CreatedByName":"11of10","CreatedById":90592,"CreatedDateTime":"2014-11-03T14:20:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EIf isotope composition is about the same, then sure, there shouldn\u0027t be any problems with using Thorium for NTR fuel. In fact, haven\u0027t there been some discussions of Thorium-based NTR projects on this forum?\u003Cp\u003EOxygen is pretty bad for propellant, though. You\u0027ll get about 1/4 of the I\u003Csub\u003ESP\u003C/sub\u003E compared to hydrogen. All other things being the same, it drops as inverse square root of molecular mass of the propellant. Oxygen being 16 times heavier gives you that factor of 4 drop.\u003C/p\u003E\u003Cp\u003EThat\u0027s still well over 200s, though, so if it\u0027s abundant enough, it might still be a cheaper option.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can\u0027t use O2, it\u0027s corrosive when hot. It\u0027d wreck the engine.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-03T14:36:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E\u0022TWR = 2 is optimal under two assumptions.\u0022\u003Cp\u003EYou forgot a 3rd assumption: the scale height is so high compared to your vertical velocity, that your terminal velocity does not increase significantly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EAnd, I would say, there\u0027s a zeroth assumption here - what \u0022optimal\u0022 means. In real life, \u0022optimal\u0022 usually means cheap and reliable. If your rocket is cheap and reliable then you don\u0027t give two hoots that it uses up more delta-V and has less payload fraction. Considering that in general fuel is cheap, tankage is pretty cheap, and engines are expensive, then using as little thrust as you can get away with makes sense.\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2014-11-03T15:34:53Z","Content":"\n\u003Cp\u003EHmm, I could have sworn one of the proposed expansions on the original NERVA project was to combine the NERVA tech with a chemical rocket to see what sort of efficiency gain there was to be had. I could be wrong though.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-11-03T17:52:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mazon Del\u0022 data-cite=\u0022Mazon Del\u0022\u003E\u003Cdiv\u003EHmm, I could have sworn one of the proposed expansions on the original NERVA project was to combine the NERVA tech with a chemical rocket to see what sort of efficiency gain there was to be had. I could be wrong though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can add oxygen after the hydrogen leaves the reactor, this will work like an afterburner and have much of the same effect, it will increase trust but reduce ISP. it would be worth doing if you needed higher trust or if the oxygen was free anyway like if you mine ice from moon or asteroids.\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2014-11-04T15:36:12Z","Content":"\n\u003Cp\u003EAh! Thanks!\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2014-11-05T17:08:03Z","Content":"\n\u003Cp\u003EThe reason for the extremely low SL Isp. is not due to any fundamental problem with nuclear-powered reaction motors, but purely because it was (understandably!) considered politically unacceptable to be using nuclear rocket engines in any application that doesn\u0027t see them put into orbit. Consider how much the people of the Azores, for example, would like having Saturn V first stages powered by nuclear engines being dropped into the Atlantic just a few hundred miles away... and then consider what happens to Titusville and Cocoa Beach if the rocket explodes at tower clear when it\u0027s being driven by nuclear engines--the NERVA design wouldn\u0027t generate significant fallout in an explosion *before* it was lit, but once you powered up the reactor, it became, essentially, a flying Chernobyl. Indeed, even if you didn\u0027t have an abort, the pad and mobile launcher would basically be single-use items with a nuclear first stage, due to the sheer level of contamination rendering it unsafe to have personnel attempt to refurbish them or otherwise work on them. (The only reason it was considered safe for manned flights was the bulk of propellant and tankage that were between the reactor and the crew, attenuating the radiation with distance and acting as shielding. IIRC, the S-N stage designed for use included RCS tankage to keep it oriented with the engine facing directly away from the spacecraft until it was a few kilometers away.)\u003C/p\u003E\u003Cp\u003ENuclear reaction motors CAN be made to work well in an atmosphere; look up Project Pluto, a program to design a nuclear ramjet engine for an American cruise missile project of the 1950s. The only reason NERVA had nigh-nonexistent SL Isp. was because it was designed as a purely exoatmospheric engine, with the appropriate expansion ratio for that application.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-11-06T07:47:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002211of10\u0022 data-cite=\u002211of10\u0022\u003E\u003Cdiv\u003EYou can\u0027t use O2, it\u0027s corrosive when hot. It\u0027d wreck the engine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh - I thought you could make the reactor fuel elements out of oxides to prevent O2 issues (the Atomic Rockets site talks about that, I think).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003EIndeed, even if you didn\u0027t have an abort, the pad and mobile launcher would basically be single-use items with a nuclear first stage, due to the sheer level of contamination rendering it unsafe to have personnel attempt to refurbish them or otherwise work on them. (The only reason it was considered safe for manned flights was the bulk of propellant and tankage that were between the reactor and the crew, attenuating the radiation with distance and acting as shielding. IIRC, the S-N stage designed for use included RCS tankage to keep it oriented with the engine facing directly away from the spacecraft until it was a few kilometers away.).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA NERVA doesn\u0027t emit radioactive material unless something goes wrong, so wouldn\u0027t the pad be fine after the (terribly radioactive) active reactor departed?\u003C/p\u003E\n"},{"CreatedByName":"DerpenWolf","CreatedById":83222,"CreatedDateTime":"2014-11-06T08:06:41Z","Content":"\n\u003Cp\u003EFunny thing is I was just about to ask similar questions on NERVA before I saw this! So one thing I\u0027m wondering is what the efficiency is for the engine if you use water instead of hydrogen (the engine is optimized for water as a propellent), does it have any advantages, whats its ISP? Also for the whole oxygen thing, why don\u0027t you just break up waste water you don\u0027t want to really recycle and use the Hydrogen for fuel and the oxygen for breathing (less strain on filters?). Would that work?\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-11-06T09:07:01Z","Content":"\n\u003Cp\u003E^^ You need water on board, and it\u0027s a bad idea to not recycle it. Disposing of water will be a significant waste, especially in long trips like to Mars or other planets. This will make a much bigger start mass.\u003C/p\u003E\u003Cp\u003EThe efficiency if 1 / square root( molecular mass ). MM of H is 1, MM of H2O is 18, so it\u0027s 4 times worse if same energy is applied.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-11-06T10:12:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EA NERVA doesn\u0027t emit radioactive material unless something goes wrong, so wouldn\u0027t the pad be fine after the (terribly radioactive) active reactor departed?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt would emit plenty of neutron radiation, which would produce radioactive material.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-11-06T11:40:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EThe space shuttle had a TWR well over that. The engines throttle down during asccent to limit it to 4gs.\u003Cp\u003EIf you are doing vertical ascent, you want at least a TWR of 2.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003ELaunch \u003C/strong\u003ETWR. On the Shuttle, it wasn\u0027t too large, either, and certainly less than 2. It did throttle down, but it was because its fuel depleted during flight and thus, its TWR increased. If you mean \u003Cstrong\u003EEngine \u003C/strong\u003ETWR, then we\u0027re talking a different thing altogether, and 2 is \u003Cem\u003Etoo little \u003C/em\u003Efor any practical lower stage engine. The real lower stage engines TWR range from 70 to over 150. So you\u0027re wrong either way. It\u0027s either 1.2-1.6 or 70\u002B depending on which TWR you mean.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-06T11:44:27Z\u0022 title=\u002211/06/2014 11:44  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 6, 2014\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"}]}