{"TopicId":91282,"ForumId":44,"TopicTitle":"For Questions That Don\u0026#039;t Merit Their Own Thread","CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-11-26T04:12:34Z","PageNum":247,"Articles":[{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2021-10-01T13:22:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038125\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633048766\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s still a MAD, MAD, MAD world.\n\u003C/p\u003E\n\u003Cp\u003E\nMIRVs basically ensure that we should not get stupid enough as a species to try it. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(Mind you - the D in MAD actually stands for \u0027Destruction\u0027 not \u0027Annihilation\u0027).  One estimate I read years ago is that the Northern Hemisphere economies would be reduced to something that resembles the 17th century (population numbers reduced to those levels as well).  Africa, most Islands and much of South America, OTOH survives largely unscathed - but subject to a crippled world economy.  (Note: this shouldn\u0027t relieve you... that world would be \u003Cem\u003Every \u003C/em\u003Edifficult to survive in.  However, if you\u0027re just looking at survival of the species - chances are good humans will remain to pick up the pieces.  What comes out of that will be a very different place than we live now.).\n\u003C/p\u003E\n\u003Cp\u003E\nBack to your original question - at some point we might get good enough with (or field enough) ABM platforms to shelter certain urban areas - but there\u0027s going to be stuff that gets through the best defenses.\n\u003C/p\u003E\n\u003Cp\u003E\nAs one smarty once said: the only way to win is not play the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRelic populations have a chance, and if it was 1983 I would agree, but the economy is too interconnected and different populations are too dependent on the more technologically advanced nations for things like food and other necessities. I don\u0027t think modern civilization would ever have a chance of returning- food, water, and shelter come way above maintaining knowledge for the hundreds of years- more likely thousands- necessary to restore some form of civilization (and not just tribes).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038203\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633066350\u0022 data-ipsquote-userid=\u0022146349\u0022 data-ipsquote-username=\u0022DDE\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, DDE said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere\u0027s no good asnwer without considering the numerical match-up. It\u0027s why ABM has always been touted as a counter to \u0022nuclear rogue states\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nParticularly, ABM should be effective against many forms of ASAT - but it would find itself swamped by targets or could simply run out of ammo defending itself. Can\u0027t tell more without narrowing down the particular types of weapons on either side.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNation C, Nation D, and Nation E are locked in a cold war. Nation E is the upstart, having risen in silence following the previous planet-wide conflict. Nation A and Nation B have already collapsed after a limited nuclear war. Nation A was better off than Nation B, with much of its nuclear arsenal surviving and the successor states to nation A (referred to from here forth as Nation F) have allied with Nation C.\n\u003C/p\u003E\n\u003Cp\u003E\nNation C suffered the worst of the economic fallout (no pun intended) of the limited war between A and B, Nation D is doing relatively fine, while Nation E has devolved into total totalitarianism and expansionism. Nation E has reached its limit, and is \u0022at the borders\u0022 of the other nations.\n\u003C/p\u003E\n\u003Cp\u003E\nThe C-F alliance have a combined force of 30 SSBNs, each with 16 SLBMs, with 10 MIRVs each. They also have an ICBM force of 950 missiles each with one warhead. 18 IRBMs are also operated by Nation C, within striking range of major cities under the control of Nation D. Nation F also has 285 strategic bombers capable of carrying four bombs and eight cruise missiles each, along with 72 stealth bombers capable of carrying 16 bombs each.\n\u003C/p\u003E\n\u003Cp\u003E\nNation D has seven old SSBNs with 20 SLBMs each, with 10 MIRVs per SLBM, and 10 new SSBNs with 16 SLBMs each, with 10 MIRVs per SLBM. It also has 1400 ICBMs, each with one warhead. Nation D also possesses a small force of 100 four engine turboprop bombers carrying six cruise missiles each, and 50 jet powered swept wing bombers also capable of carrying six cruise missiles each.\n\u003C/p\u003E\n\u003Cp\u003E\nNation E has 50 SSBNs with 18 SLBMs each, with 10 MIRVs per SLBM. It also has 20 ICBMs each with 10 MIRVs. Nation E also possesses a large number of strategic bombers but only 100 weapons for them, resulting in an operational nuclear bomber force of six subsonic stealth bombers.\n\u003C/p\u003E\n\u003Cp\u003E\nA conflict has erupted between the C-F alliance and Nation D at a historical flash point and has escalated to a full scale nuclear exchange. Their entire ICBM forces and Nation C\u0027s IRBMs are depleted and their strategic bombers are well underway to each other\u0027s homeland and rerouting is unfeasible due to positioning of airborne tanker assets and the destruction of their bases by missiles. This leaves their SSBN force, about 2/10ths of which has been fired.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the forces look like this-\n\u003C/p\u003E\n\u003Cp\u003E\nC-F Alliance- 27 SSBNs, with 432 SLBMs, with 4320 MIRVs in total. A 30% weapon absolute failure rate (not even a fizzle) will occur, although of course the participants in this conflict have no way of knowing this.\n\u003C/p\u003E\n\u003Cp\u003E\nNation D- 16 SSBNs with 295 SLBMs, with 2950 MIRVs in total. A 37% weapon absolute failure rate (not even a fizzle) will occur, again, no one knows this and it is of no value to either side but I thought I would mention it anyway just in case.\n\u003C/p\u003E\n\u003Cp\u003E\nNation E- 50 SSBNs with 900 SLBMs, with 9000 MIRVs in total. Also 20 ICBMs with a total of 200 MIRVs between each other. A 30% weapon absolute failure rate (not even a fizzle) will occur.\n\u003C/p\u003E\n\u003Cp\u003E\nNation E must split its forces between Nation D and the C-F alliance. It has utilized real time reconnaissance footage and AI to calculate the optimum targets (remaining population centers, ground based military forces of D and C-F have been annihilated and there is no point in hitting the cities that have already been destroyed). However, D and C-F have agreed to a cease fire and will launch their remaining forces against Nation E, resulting in a total of 7270 warheads targeting Nation E.\n\u003C/p\u003E\n\u003Cp\u003E\nMoving to ABM forces-\n\u003C/p\u003E\n\u003Cp\u003E\nNation E- ICBMs are defended by 60 KKV interceptor missiles. Space based ABM forces consist of 10 single launch Smart Rocks type crewed battle stations with 100 Brilliant Pebble type missiles each. Accompanied by 10000 Brilliant Pebble type satellites. Brilliant Pebble type satellites are unarmed while the Smart Rocks type battle stations are equipped with anti-satellite-interceptor grenades similar to the Shield-2 anti-satellite system (complex?) and a 30mm chaff dispenser. A Brilliant Eyes type targeting system exists with unarmed satellites. There are also four large tracking stations in GEO built upon re-directed asteroids, with ASAT defences including anti-satellite-interceptor grenades, a carbon dioxide laser, and chaff dispensers. Nation E\u0027s ASAT forces include sea based interceptor missiles (similar to SM-3), with an assumption that in this scenario ultimately 10 will end up being in the dynamic launch zone necessary to hit an enemy satellite, air launched ASAT missiles, 50 of which will be assumed to end up in the dynamic launch zone necessary to hit an enemy satellite, and Skif type ASAT sats, which are controlled from the Smart Rocks type battle stations. There are around 60 of these Skif type satellites.\n\u003C/p\u003E\n\u003Cp\u003E\nC-F alliance- no ABM forces. ASAT forces consist of a limited number of sea based interceptor missiles (similar to SM-3), with an assumption that in this scenario 2 will ultimately end up being in the dynamic launch zone necessary to hit an enemy satellite. Nation C possesses 20 Skif type ASAT sats with one laser per satellite.\n\u003C/p\u003E\n\u003Cp\u003E\nNation D- Nation D has built numerous ground based interceptor missile sites armed with nuclear warheads but these have already been overwhelmed during the initial exchange with the C-F alliance. Nation D does not possess any other ABM forces- unfortunately, it was just about to begin ground tests of production ABM sats when the war broke out. Nation D does possess a vast ASAT force, including 110 Skif type satellites with both a laser and a recoilless rifle with 4 shots, 2 Soyuz-PPK type crewed ASAT spacecraft with 8 ASAT munitions, 20 nuclear weapon (1 kt yield) armed \u0022suicide attack\u0022 space probes (10 in LEO and 10 in GEO shadowing enemy ABM platforms), and 30 Skif type probes with a laser in GEO shadowing enemy ABM platforms. The ASAT platforms in GEO are themselves being shadowed by enemy ASAT platforms.\n\u003C/p\u003E\n\u003Cp\u003E\nA 10% failure rate is assumed for Brilliant Pebble type missiles.\n\u003C/p\u003E\n\u003Cp\u003E\nA 97% hit rate is assumed for surface based (including air launched) ASAT missiles. A 70% hit rate is assumed for kinetic orbital ASAT munitions. I am unfamiliar with effective lasers are in combat in real life so I don\u0027t have a comment on that. 20% of the nuclear armed space probes will fail completely. 5% of the laser weapons for Skif type satellites for Nation D and E can be expected to fail shortly after (2 minutes) combat begins.\n\u003C/p\u003E\n\u003Cp\u003E\nNation E decides to launch a full scale attack on both Nation D and the C-F alliance 15 minutes after the nuclear exchange between D and the C-F alliance ended.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-10-01T13:44:06Z","Content":"\n\u003Cp\u003E\nNation Z wins\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022A10a0QXTazL._RI_.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022160.00\u0022 height=\u0022900\u0022 width=\u00221200\u0022 src=\u0022https://images-na.ssl-images-amazon.com/images/I/A10a0QXTazL._RI_.jpg\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-10-01T14:18:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038289\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633094559\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRelic populations have a chance\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor first few months, before the forager teams start arriving from the less relic but a little glowing territories for food.\n\u003C/p\u003E\n\u003Cp\u003E\nStill better to be a little radioactive but developed than unite with nature.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038289\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633094559\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think modern civilization would ever have a chance of returning- food, water, and shelter come way above maintaining knowledge for the hundreds of years- more likely thousands- necessary to restore some form of civilization (and not just tribes).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s hard to fall lower than early XX, and unlike in early XX the humans will have clear vision and knowledge what to do,\n\u003C/p\u003E\n\u003Cp\u003E\nSo, probably a whole half-century would be required to restore to the 1970s level, enough comfy for living.\n\u003C/p\u003E\n\u003Cp\u003E\nThe XVIII century population is also not a problem, as the XX problems were caused by the overpopulation of the developed territories.\n\u003C/p\u003E\n\u003Cp\u003E\nJust think how many monasteries were there in XVIII.\u003Cbr\u003E\nAll those people were intentionally excluded from the repopulation process. Peasants without plowland, knights without peasants.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-01T14:21:52Z\u0022 title=\u002210/01/2021 02:21  PM\u0022 data-short=\u00222 yr\u0022\u003EOctober 1, 2021\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2021-10-01T16:45:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038289\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633094559\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think modern civilization would ever have a chance of returning- food, water, and shelter come way above maintaining knowledge for the hundreds of years- more likely thousands- necessary to restore some form of civilization (and not just tribes).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI most heartily challenge this \u0027not even wrong\u0027 guess that so many people enjoy while thinking about a possibly-longed-for dystopian future.  This is a luxury of the bored.  Anyone who\u0027s lived in or even been to the fringes of \u0027modern civilization\u0027 can recognize the \u0027things\u0027 we are dependent upon in the \u0027first world\u0027 are a thin sheen of nice to haves.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EFirst Premise: People are tough.\u003C/strong\u003E \n\u003Cul\u003E\u003Cli\u003E\nWay tougher than most people realize.\n\u003Cul\u003E\u003Cli\u003E\n600,000 years of evolution created 150lb-300lb endurance/pack hunters that can shape their own environment through collective action.  (for comparison, wolves are 60lb-180lb and African wild dogs are 40lb-80lb endurance-pack hunters, and they can\u0027t compete with us.  Lions outweigh us, and as opportunistic-pack hunters, they can\u0027t compete with us.)\n\u003C/li\u003E\n\u003Cli\u003E\nWe have no major predators that threaten us\n\u003C/li\u003E\n\u003Cli\u003E\nWe can kill and eat pretty much every animal on the planet and a whole host of plants\n\u003C/li\u003E\n\u003Cli\u003E\nWe can pass down vast amounts of learned lessons from generation to generation - and even sideways (c.f. Books).\n\u003C/li\u003E\n\u003Cli\u003E\nWe can survive 30 days-ish with ZERO FOOD and up to 3 days with no water.  In that time an individual can forage 20-100 miles w/o water or 400-ish miles with no food.  Likelihood of finding sustenance in that range is exceptionally high.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nBored people who live in cities and have stuff brought to them are not helpless - like a holstered gun, or one in a drawer that\u0027s never used... if necessary, it can still kill.  An ability, like a tool, isn\u0027t completely lost or useless because it\u0027s never had to be used.\n\u003C/li\u003E\n\u003Cli\u003E\nPeople have survived every single natural or man-made disaster.  Whether Nagasaki, Mt. St. Helens, the Black Plague, Boxing Day tsunami, Camp Fire, San Francisco Earthquake or the Galveston Hurricane - individuals have pulled themselves from the wreckage and gone on.\n\u003C/li\u003E\n\u003Cli\u003E\nOur toughness and stubbornness are why we can delve into the earth for minerals, choke out a mountain lion and reach for the stars.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESecond Premise: People are resilient\u003C/strong\u003E.\n\u003Cul\u003E\u003Cli\u003E\nWe\u0027ve been through a lot - and we\u0027re still here.\n\u003C/li\u003E\n\u003Cli\u003E\nIn every disaster - the real story isn\u0027t the death and destruction and loss of economic power; its the story about how people have rebuilt, and not only survived but thrived in the aftermath.  Revisit any of those places affected by the disasters listed above and you will find not only survivors - but people who waded into the wreckage unwilling to give up on the chance of finding survivors - because they know people will have survived.  We rebuild.\n\u003C/li\u003E\n\u003Cli\u003E\nSome people have been through the worst - and then had it happen again, the worst, and when they survive that... they go on.\n\u003C/li\u003E\n\u003Cli\u003E\nWe have few records - but know - that European, African and Asian diseases unknown to the populations of the Americas swept through and devastated both continents 300-500 years ago.  And yet, the survivors continued and enjoyed thriving communities. (I won\u0027t delve too deeply into this; mismatched population pressures, rather than mismatched technology explain the aftermath... but when you think about it - there\u0027s a reason Africa had a different experience through the age of European expansion and Empire than the Americas.  Disease and disease resistance.  Despite this -indigenous communities still exist all over the world.).\n\u003C/li\u003E\n\u003Cli\u003E\nResilience is a survival trait - the ability to go through unbelievable horrors and keep going?  Brilliant.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EThird Premise: People are kind\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nRural areas are not unpopulated wilderness - The survivors of the cities will wander exposed into... populated areas prepared to help\n\u003C/li\u003E\n\u003Cli\u003E\nThere are a lot of people who rush TOWARD disaster - ready and willing to help people they\u0027ve never seen before, just because its what we do.\n\u003C/li\u003E\n\u003Cli\u003E\nBarn-raising is a human survival trait.  Modern cities are just barn-raising writ large\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFourth Premise: People are cruel\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nConquer your neighbor, and you are faced with a dilemma; three choices - let them live, enslave them, or kill them all.  There are problems with each decision. \n\u003Cul\u003E\u003Cli\u003E\nScratch the surface of the human history of slavery, and you discover every single population on the planet has practiced it - and its roots are in necessity.  Human labor is an exceptionally expensive and valuable economic commodity.  History shows we know how to manage that capital; its merely our modern choice to limit the ways in which we use that human capital.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nRefugees can be both beneficial and dangerous - humans have driven refugees into their enemies\u0027 lands to overwhelm and weaken them, or at times welcomed them or enslaved them.  Capriciousness and self-interest are a survival trait.\n\u003C/li\u003E\n\u003Cli\u003E\nPeople will not hesitate to use other people in a myriad of ways to make their own lives easier.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFifth Premise: People are lazy\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nWe like to automate stuff and let others do our work for us.\n\u003C/li\u003E\n\u003Cli\u003E\nModern conveniences like clean water that allow our kids to survive childhood have been automated - no reason to think this capacity won\u0027t be rebuilt after even a global disaster.  All we have to do is survive.\n\u003C/li\u003E\n\u003Cli\u003E\nWith clean water assured, food provided and shelter available, people will do extraordinary things to give themselves more free time for leisure. \n\u003C/li\u003E\n\u003Cli\u003E\nLazy time allows for creativity and thus is a survival trait.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHence, civilization will rise again\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.yahoo.com/entertainment/overlooked-american-survivors-hiroshima-nagasaki-171743804.html\u0022 rel=\u0022external nofollow\u0022\u003EThe Overlooked American Survivors of Hiroshima and Nagasaki (yahoo.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.discovernikkei.org/en/interviews/clips/1710/\u0022 rel=\u0022external nofollow\u0022\u003EHis Memory of August 6, 1945 | Real People | Discover Nikkei\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.akfusa.org/our-stories/houston-volunteers-respond-harvey-2/\u0022 rel=\u0022external nofollow\u0022\u003EHow Houston Volunteers Responded to Hurricane Harvey : Aga Khan Foundation USA (akfusa.org)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.nbcnews.com/id/wbna6798912\u0022 rel=\u0022external nofollow\u0022\u003EA relief worker\u0027s diary (nbcnews.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.huffpost.com/entry/japan-earthquake-2011-sur_n_836196\u0022 rel=\u0022external nofollow\u0022\u003EJapan Earthquake 2011: Survivors Share \u0027Miracle\u0027 Stories (PHOTOS) | HuffPost\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://gizmodo.com/the-woman-who-survived-the-titanic-britannic-and-olym-1510790217\u0022 rel=\u0022external nofollow\u0022\u003EThe Woman Who Survived the Titanic, Britannic, and Olympic Disasters (gizmodo.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.forces-war-records.co.uk/blog/2014/10/10/army-medics--the-unsung-heroes-of-world-war-one\u0022 rel=\u0022external nofollow\u0022\u003EArmy medics- the unsung heroes of World War One (forces-war-records.co.uk)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.insider.com/travis-kauffman-colorado-choked-mountain-death-attacked-2019-2#:~:text=A%20man%20who%20choked%20a%20mountain%20lion%20to,with%20a%20rock%2C%20but%20couldn%27t%20stop%20the%20attack.\u0022 rel=\u0022external nofollow\u0022\u003EColorado Jogger Recounts Choking Mountain Lion to Death When Attacked (insider.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-01T16:53:46Z\u0022 title=\u002210/01/2021 04:53  PM\u0022 data-short=\u00222 yr\u0022\u003EOctober 1, 2021\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2021-10-01T18:39:53Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206402-sunlitzelkova/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022206402\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206402-sunlitzelkova/\u0022 rel=\u0022\u0022\u003E@SunlitZelkova\u003C/a\u003E - rereading my post, I want to make clear that I am critical of the idea of civil collapse and a return to primitivism.  Hope it doesn\u0027t come off as offensive or personal.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nS/F \n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-10-01T20:35:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038424\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633113593\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206402-sunlitzelkova/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022206402\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206402-sunlitzelkova/\u0022 rel=\u0022\u0022\u003E@SunlitZelkova\u003C/a\u003E - rereading my post, I want to make clear that I am critical of the idea of civil collapse and a return to primitivism.  Hope it doesn\u0027t come off as offensive or personal.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nS/F \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI agree.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHumans are so tough they went without toilet paper for most of their existence.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYes..... they stunk more, but that\u0027s why France became really good at making fancy perfumes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBesides... the initial toilet paper shortage due to Covid-19 made me research modern alternatives to toilet paper... they do exist.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf nothing else, if Joe is a former marine, then he surely has seen the fringes of civilization.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps he has even done. #2 without toilet paper too LOL.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-01T20:36:08Z\u0022 title=\u002210/01/2021 08:36  PM\u0022 data-short=\u00222 yr\u0022\u003EOctober 1, 2021\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2021-10-01T21:03:34Z","Content":"\n\u003Cp\u003E\nSnow is the best \u0022toilet paper\u0022, unless it is too icy.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2021-10-01T21:22:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038493\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633120520\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n47 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPerhaps he has even done. #2 without toilet paper too LOL\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf I acknowledge this fact, can we not make a celebrity meme out it? \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(I\u0027ve also gone 76 days without bathing - did not kill me) \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2021-10-01T22:04:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038370\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633106724\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://gizmodo.com/the-woman-who-survived-the-titanic-britannic-and-olym-1510790217\u0022 rel=\u0022external nofollow\u0022\u003EThe Woman Who Survived the Titanic, Britannic, and Olympic Disasters (gizmodo.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOkay, she’s bad luck, pure and simple. Lucky herself, but not for those around her, apparently.  Teela Brown complex?\n\u003C/p\u003E\n\u003Cp\u003E\nYou’d think she’d stop going aboard ships. How many crossings did she make, I wonder?\n\u003C/p\u003E\n\u003Cp\u003E\nGreat post!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-01T22:05:26Z\u0022 title=\u002210/01/2021 10:05  PM\u0022 data-short=\u00222 yr\u0022\u003EOctober 1, 2021\u003C/time\u003E by StrandedonEarth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2021-10-01T23:48:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038320\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633097915\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor first few months, before the forager teams start arriving from the less relic but a little glowing territories for food.\n\u003C/p\u003E\n\u003Cp\u003E\nStill better to be a little radioactive but developed than unite with nature.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s hard to fall lower than early XX, and unlike in early XX the humans will have clear vision and knowledge what to do,\n\u003C/p\u003E\n\u003Cp\u003E\nSo, probably a whole half-century would be required to restore to the 1970s level, enough comfy for living.\n\u003C/p\u003E\n\u003Cp\u003E\nThe XVIII century population is also not a problem, as the XX problems were caused by the overpopulation of the developed territories.\n\u003C/p\u003E\n\u003Cp\u003E\nJust think how many monasteries were there in XVIII.\u003Cbr\u003E\nAll those people were intentionally excluded from the repopulation process. Peasants without plowland, knights without peasants.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThinking back on it, I concede that relic populations was too far. But I don\u0027t think you will get \u003Cem\u003EGhost in the Shell\u003C/em\u003E type civilizations, with fully functioning major cities complete with all amenities- just 20 years after the conflict. That was my point.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038424\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633113593\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n- rereading my post, I want to make clear that I am critical of the idea of civil collapse and a return to primitivism.  Hope it doesn\u0027t come off as offensive or personal.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have also re-read my post and would like to clarify it was my own personal opinion, not intended to be hostile.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038370\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633106724\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI most heartily challenge this \u0027not even wrong\u0027 guess that so many people enjoy while thinking about a possibly-longed-for dystopian future.  This is a luxury of the bored.  Anyone who\u0027s lived in or even been to the fringes of \u0027modern civilization\u0027 can recognize the \u0027things\u0027 we are dependent upon in the \u0027first world\u0027 are a thin sheen of nice to haves.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EFirst Premise: People are tough.\u003C/strong\u003E \n\u003Cul\u003E\u003Cli\u003E\nWay tougher than most people realize.\n\u003Cul\u003E\u003Cli\u003E\n600,000 years of evolution created 150lb-300lb endurance/pack hunters that can shape their own environment through collective action.  (for comparison, wolves are 60lb-180lb and African wild dogs are 40lb-80lb endurance-pack hunters, and they can\u0027t compete with us.  Lions outweigh us, and as opportunistic-pack hunters, they can\u0027t compete with us.)\n\u003C/li\u003E\n\u003Cli\u003E\nWe have no major predators that threaten us\n\u003C/li\u003E\n\u003Cli\u003E\nWe can kill and eat pretty much every animal on the planet and a whole host of plants\n\u003C/li\u003E\n\u003Cli\u003E\nWe can pass down vast amounts of learned lessons from generation to generation - and even sideways (c.f. Books).\n\u003C/li\u003E\n\u003Cli\u003E\nWe can survive 30 days-ish with ZERO FOOD and up to 3 days with no water.  In that time an individual can forage 20-100 miles w/o water or 400-ish miles with no food.  Likelihood of finding sustenance in that range is exceptionally high.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nBored people who live in cities and have stuff brought to them are not helpless - like a holstered gun, or one in a drawer that\u0027s never used... if necessary, it can still kill.  An ability, like a tool, isn\u0027t completely lost or useless because it\u0027s never had to be used.\n\u003C/li\u003E\n\u003Cli\u003E\nPeople have survived every single natural or man-made disaster.  Whether Nagasaki, Mt. St. Helens, the Black Plague, Boxing Day tsunami, Camp Fire, San Francisco Earthquake or the Galveston Hurricane - individuals have pulled themselves from the wreckage and gone on.\n\u003C/li\u003E\n\u003Cli\u003E\nOur toughness and stubbornness are why we can delve into the earth for minerals, choke out a mountain lion and reach for the stars.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESecond Premise: People are resilient\u003C/strong\u003E.\n\u003Cul\u003E\u003Cli\u003E\nWe\u0027ve been through a lot - and we\u0027re still here.\n\u003C/li\u003E\n\u003Cli\u003E\nIn every disaster - the real story isn\u0027t the death and destruction and loss of economic power; its the story about how people have rebuilt, and not only survived but thrived in the aftermath.  Revisit any of those places affected by the disasters listed above and you will find not only survivors - but people who waded into the wreckage unwilling to give up on the chance of finding survivors - because they know people will have survived.  We rebuild.\n\u003C/li\u003E\n\u003Cli\u003E\nSome people have been through the worst - and then had it happen again, the worst, and when they survive that... they go on.\n\u003C/li\u003E\n\u003Cli\u003E\nWe have few records - but know - that European, African and Asian diseases unknown to the populations of the Americas swept through and devastated both continents 300-500 years ago.  And yet, the survivors continued and enjoyed thriving communities. (I won\u0027t delve too deeply into this; mismatched population pressures, rather than mismatched technology explain the aftermath... but when you think about it - there\u0027s a reason Africa had a different experience through the age of European expansion and Empire than the Americas.  Disease and disease resistance.  Despite this -indigenous communities still exist all over the world.).\n\u003C/li\u003E\n\u003Cli\u003E\nResilience is a survival trait - the ability to go through unbelievable horrors and keep going?  Brilliant.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EThird Premise: People are kind\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nRural areas are not unpopulated wilderness - The survivors of the cities will wander exposed into... populated areas prepared to help\n\u003C/li\u003E\n\u003Cli\u003E\nThere are a lot of people who rush TOWARD disaster - ready and willing to help people they\u0027ve never seen before, just because its what we do.\n\u003C/li\u003E\n\u003Cli\u003E\nBarn-raising is a human survival trait.  Modern cities are just barn-raising writ large\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFourth Premise: People are cruel\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nConquer your neighbor, and you are faced with a dilemma; three choices - let them live, enslave them, or kill them all.  There are problems with each decision. \n\u003Cul\u003E\u003Cli\u003E\nScratch the surface of the human history of slavery, and you discover every single population on the planet has practiced it - and its roots are in necessity.  Human labor is an exceptionally expensive and valuable economic commodity.  History shows we know how to manage that capital; its merely our modern choice to limit the ways in which we use that human capital.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nRefugees can be both beneficial and dangerous - humans have driven refugees into their enemies\u0027 lands to overwhelm and weaken them, or at times welcomed them or enslaved them.  Capriciousness and self-interest are a survival trait.\n\u003C/li\u003E\n\u003Cli\u003E\nPeople will not hesitate to use other people in a myriad of ways to make their own lives easier.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFifth Premise: People are lazy\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nWe like to automate stuff and let others do our work for us.\n\u003C/li\u003E\n\u003Cli\u003E\nModern conveniences like clean water that allow our kids to survive childhood have been automated - no reason to think this capacity won\u0027t be rebuilt after even a global disaster.  All we have to do is survive.\n\u003C/li\u003E\n\u003Cli\u003E\nWith clean water assured, food provided and shelter available, people will do extraordinary things to give themselves more free time for leisure. \n\u003C/li\u003E\n\u003Cli\u003E\nLazy time allows for creativity and thus is a survival trait.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHence, civilization will rise again\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.yahoo.com/entertainment/overlooked-american-survivors-hiroshima-nagasaki-171743804.html\u0022 rel=\u0022external nofollow\u0022\u003EThe Overlooked American Survivors of Hiroshima and Nagasaki (yahoo.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.discovernikkei.org/en/interviews/clips/1710/\u0022 rel=\u0022external nofollow\u0022\u003EHis Memory of August 6, 1945 | Real People | Discover Nikkei\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.akfusa.org/our-stories/houston-volunteers-respond-harvey-2/\u0022 rel=\u0022external nofollow\u0022\u003EHow Houston Volunteers Responded to Hurricane Harvey : Aga Khan Foundation USA (akfusa.org)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.nbcnews.com/id/wbna6798912\u0022 rel=\u0022external nofollow\u0022\u003EA relief worker\u0027s diary (nbcnews.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.huffpost.com/entry/japan-earthquake-2011-sur_n_836196\u0022 rel=\u0022external nofollow\u0022\u003EJapan Earthquake 2011: Survivors Share \u0027Miracle\u0027 Stories (PHOTOS) | HuffPost\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://gizmodo.com/the-woman-who-survived-the-titanic-britannic-and-olym-1510790217\u0022 rel=\u0022external nofollow\u0022\u003EThe Woman Who Survived the Titanic, Britannic, and Olympic Disasters (gizmodo.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.forces-war-records.co.uk/blog/2014/10/10/army-medics--the-unsung-heroes-of-world-war-one\u0022 rel=\u0022external nofollow\u0022\u003EArmy medics- the unsung heroes of World War One (forces-war-records.co.uk)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.insider.com/travis-kauffman-colorado-choked-mountain-death-attacked-2019-2#:~:text=A%20man%20who%20choked%20a%20mountain%20lion%20to,with%20a%20rock%2C%20but%20couldn%27t%20stop%20the%20attack.\u0022 rel=\u0022external nofollow\u0022\u003EColorado Jogger Recounts Choking Mountain Lion to Death When Attacked (insider.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027d like to offer a response to your challenge, although not as a hostile attempt to change your opinion but for the purposes of discussion \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs I said above, I think \u0022relic populations\u0022 was too far. Human civilization *will* likely continue to exist in some form, but that said, I don\u0027t think it will be pretty- even unaffected societies like those in the Southern Hemisphere would be in danger of collapse.\n\u003C/p\u003E\n\u003Cp\u003E\nThe sources you listed are all good examples of \u003Cem\u003Eindividuals\u003C/em\u003E surviving or \u0022individual disasters\u0022 (one city hit by a tsunami), and I don\u0027t doubt that could happen, but I think the closest example to total nuclear war in human history is not Hiroshima and/or Nagasaki, but instead the bombing of Japan as a whole. So many cities in Japan had been bombed (apart from those being saved for nuclear attacks) that in early August (prior to Hiroshima) Major General LeMay warned that the B-29s would probably run out of targets to bomb by October.\n\u003C/p\u003E\n\u003Cp\u003E\nJapan was on the verge of a major famine at that point, and malnutrition was virtually universal. Industry had either been destroyed or ceased to operate. Drug use was common, use of a black market had ensued, and crime was rampant. There was not much \u0022we\u0022, only \u0022I\u0022. The only thing that kept everything from completely falling apart was the Allied Occupation. Obviously, after a nuclear war there will be no occupation.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother example is the current global crisis (a disaster that reaches everywhere)- lots of division, and you have people working together to \u003Cem\u003Eget by\u003C/em\u003E, and they are getting by, but nonetheless, this crisis is unlikely to end in a pretty manner. But with total nuclear war there will be no authority to save people, so *some* who work together will survive, but will also have to contend with the *many* who don\u0027t, but being humans, also survive too. This is not a good recipe for preserving \u0022high\u0022 knowledge or rebuilding.\n\u003C/p\u003E\n\u003Cp\u003E\nHumans will continue to exist, and \u0022civilization\u0022 might arise again some day, but I don\u0027t think it will ever reach the level present in 2019/2021. It might not be relic populations, at best it could be like the Wild West, but I think 17th century \u003Cem\u003Eempires and cities\u003C/em\u003E- with that level of organization-\u003Cem\u003E \u003C/em\u003Eare too far fetched. Some form of city could exist however. Perhaps this is what you actually meant.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, I would be delighted to be disproven should the unfortunate events we are discussing come to pass.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-10-01T23:53:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038512\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633123363\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf I acknowledge this fact, can we not make a celebrity meme out it? \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(I\u0027ve also gone 76 days without bathing - did not kill me) \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd now I want to know more.... sorry... I am a curious person... and you just piqued my curiousity.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully you can either find a way to say it via the forum rules or respectfully decline but I will ask any how.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n1. You wiped with WHAT? Because I am aware of various options... some more optimal and safer than others. The ancient greeks? Used shards of hard clay I read... ouch.\n\u003C/p\u003E\n\u003Cp\u003E\nRomans in rome shared communal bath toilets with plumbing and shared multiple sponges... sanitizing them by dipping them in vinegar. That... probably contributed to shorter lifespans, unless the Romans were just that tough... probably were LOL.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n2. You must have bathed somehow or wiped somehow. i know people sometimes dip in a body of water or wipe with a rag and call it good. Not a proper bath but something better than nothing no? Otherwise you would have had rashes where you.... do #2.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-01T23:57:07Z\u0022 title=\u002210/01/2021 11:57  PM\u0022 data-short=\u00222 yr\u0022\u003EOctober 1, 2021\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2021-10-02T02:57:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038558\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633132382\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd now I want to know more.... sorry... I am a curious person... and you just piqued my curiousity.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully you can either find a way to say it via the forum rules or respectfully decline but I will ask any how.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n1. You wiped with WHAT? Because I am aware of various options... some more optimal and safer than others. The ancient greeks? Used shards of hard clay I read... ouch.\n\u003C/p\u003E\n\u003Cp\u003E\nRomans in rome shared communal bath toilets with plumbing and shared multiple sponges... sanitizing them by dipping them in vinegar. That... probably contributed to shorter lifespans, unless the Romans were just that tough... probably were LOL.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n2. You must have bathed somehow or wiped somehow. i know people sometimes dip in a body of water or wipe with a rag and call it good. Not a proper bath but something better than nothing no? Otherwise you would have had rashes where you.... do #2.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think I can do this within the rules and general public decorum.  Please remember - we are peeling back the sheen of civilization that so many take for granted - and yet what I describe is normal life for a whole lot of people.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my early days in the Corps, I heard a phrase; \u0022I\u0027ve spent more time [*pooping*] in the field than you\u0027ve spent in the Corps\u0022 - a salty way of welcoming the new kid.  Little did I know how prophetic those words would be.  Over the course of the next 20 years, much of it spent in the infantry and tanks, I lived outside.  A lot.  When you live outside all day, every day for days on end - you have to do what we all have to do... outside.  There were no conveniences like port-a-potties on Marine base training areas, or clever little things like a wall, hose and hole in the ground like training areas in Spain and North Africa enjoy.  True luxury is a plastic chair with a hole cut in it, but a wooden box or trailer hitch helps - otherwise, the good lord has already given us everything we need.  Usually, when it\u0027s time to download your food, it\u0027s just a Marine, a shovel and whatever you can grab.  TP is a feature of MREs by the way - so you don\u0027t always have to improvise... but sometimes you do.  Cardboard and other trash (plastic spoons, magazine pages (folded, not crinkled - this is important like non-icy snow)), leaves, shells, rags, smooth bits of wood, snow, and if necessary fingers soap and water all work. \n\u003C/p\u003E\n\u003Cp\u003E\nYou will note that in some cultures it is considered rude to gesture or hand something to someone using the left hand, for... reasons.\n\u003C/p\u003E\n\u003Cp\u003E\nPrivacy, too is a luxury.  I\u0027ve spent a lot of time doing my business in full view of other people.  (Not just Marines, but \u003Cem\u003Epeople \u003C/em\u003E- in all that implies).  After the first time... you just get used to it.  People who have to live that way also do a thing with their eyes to give you a sense of privacy, even when there is none.  It\u0027s a small kindness - but still appreciated.  We recognize each other in a vulnerable and private moment - and even without true privacy, we just respect each other.  This was true of the people of many countries I\u0027ve visited/trained in during peace-time, as well as the civilians of Iraq.  Sitting here in my living room in America, I recognize this might sound \u0027weird\u0027 - but frankly, it\u0027s \u0027us\u0027 who are weird.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, you want to keep yourself clean - as much as possible.  Cleanliness rituals are important.  I typically washed my hands before eating - bar of soap from a ziploc and dribbles from a canteen - and tried to wash my face at least once every day.  When water is scarce - you conserve water.  Sometimes it was just my fingertips, mouth and eyes.  Sometimes even that could not happen.  Still, cleanliness is important - so you do what you can.  With more time and water, a washcloth, dishsoap and a helmet\u0027s worth of water (when we had enough) took care of the hairy places - but depending upon OpTempo could be days to weeks before the opportunity arose.  But once the opportunity arose, you took it.  The \u0027field expedient shower\u0027 (washcloth and helmet) still leaves a lot of skin unwashed.  My 76 days comment refers to the time between when I left Camp Shoup and was again able to get all of me clean.  When that opportunity arose - I took my time and enjoyed every moment.\n\u003C/p\u003E\n\u003Cp\u003E\nCivilization is, in many ways, a set of agreements, customs, expectations and burdens we put on - and carry, often without knowing or understanding the weight.  Different cultures define these differently - but when you take a person who is so rooted to their customary norms and put them into a different environment... occasionally they fail to adjust.  Look up the word \u0027impacted\u0027 and you will recognize what can happen to someone overly wedded to Western social norms in a place that does not cater to those norms.  Adaptability is a survival skill - and not every human is equally skilled.  Still, we adapt or die.  (The same disconnect can happen the other way around, by the way; take a person used to living rough and drop them into your hometown?  It can take some getting used to).\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2021-10-02T03:51:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038557\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633132139\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027d like to offer a response to your challenge, ...for the purposes of discussion \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLet\u0027s Do Dis! \u003Cimg alt=\u0022\u0026amp;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 title=\u0022\u0026amp;)\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038557\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633132139\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe sources you listed are all good examples of \u003Cem\u003Eindividuals\u003C/em\u003E surviving or \u0022individual disasters\u0022 (one city hit by a tsunami), and I don\u0027t doubt that could happen, but I think the closest example to total nuclear war in human history is not Hiroshima and/or Nagasaki, but instead the bombing of Japan as a whole.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou bring up a good point - which I should elucidate, because it exposes potential bias.  My opinion is heavily rooted in my background - American.  People who survived the war in Japan and Eastern Europe (and their descendants / cultural history) may have a totally different take on the question presented.  I recognize this.  Further, as you point out - most of the disasters I listed were from the individual, to the city, to regional at best.  Like Japan and Europe, the post war reconstruction of entire regions was aided by outside economies; they did not have to boot-strap it completely alone.  This social-safety net (for whatever political reasons may have existed) allowed those areas devastated by human conflict to recover and then thrive in record time. \n\u003C/p\u003E\n\u003Cp\u003E\nWhile this is true - and I recognize that you posit if not a full Soviet/NATO cold-war level nuclear exchange, something close to it* - I would still argue that civilization will recover.  Your scenario would be a Northern Hemisphere catastrophe - and would take a longer time to recover from given that the most vibrant economies would be eliminated - and that there would be no continuation of \u0027the way things are\u0027 that happened after WW2.  (The British Empire handed off \u0027world police\u0027 duty to the Americans, but rather than a dramatic shift, the WEIRD economies continued largely on the path they had been on before.)  Take out the Northern economies and their economic, political and military might, and the regional Southern Hemisphere powers will likely contest with one another for spherical hegemony.  So - yes, you have a major, sudden, human catastrophe in the Northern and a cascade of regional catastrophes in the Southern Hemisphere (as well as those over-looked places in the Northern).  Those likely resolve themselves in a matter of years or decades and stability (no matter how uneasy) reasserts itself. \n\u003C/p\u003E\n\u003Cp\u003E\nI think there is another aspect that might be overlooked - and that\u0027s something else that America enjoyed; the freedom from external threat.  The survivors of nuclear war may have to bootstrap themselves - but the fear of the aftermath may allow them the luxury of time and freedom from invasion.  It\u0027s highly unlikely that a successful military government arising out of the conflicts in South America is going to want to lead an expedition of conquest into the USA (or Africans into Europe, or Southeast Asians into China).  (Fear of three-eyed monsters and all that).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038557\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633132139\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHumans will continue to exist, and \u0022civilization\u0022 might arise again some day, but I don\u0027t think it will ever reach the level present in 2019/2021. It might not be relic populations, at best it could be like the Wild West, but I think 17th century \u003Cem\u003Eempires and cities\u003C/em\u003E- with that level of organization-\u003Cem\u003E \u003C/em\u003Eare too far fetched. Some form of city could exist however.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo - here, I think the quibble is \u0027in what timeframe\u0027?  I\u0027ve had the privilege to live not only in a variety of places around the world (where resilience and industry are on display) but also around the U.S. - in rural areas so easily mocked and discounted by City Elites.  And yet, in those places we find doctors, engineers, teachers, universities, as well as farmers, mechanics, miners and dreamers; in other words all the people necessary to revive civilization.\n\u003C/p\u003E\n\u003Cp\u003E\nTen years to self recover is likely unrealistic.  Yet think about how much stuff changes in a decade.  A hundred is probably too long.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nVis your scenario: the total number of nuclear weapons still active is way down from US/Soviet Cold War levels.  Between the US and Russia, there\u0027s about 4k per \u0027side\u0027 and they\u0027re not all aimed at each other.  Russia has to \u0027spread the love\u0027 between the US, Europe, China and Australia.  The US has Russia and China (close to 30 percent of the total landmass).  China has weapons pointed at everybody.  Now - most targets are the cities and littorals, along with major military installations - that leaves broad swathes of the landmasses untargeted.  The US has 310 major cities (targeted) and 19,500 some-odd towns and villages (partly targeted).  America\u0027s share of Russia\u0027s 4k weapons plus China\u0027s bonus gifts won\u0027t get everyone.  The \u0027rural\u0027 population of America is over 57,000,000.  That\u0027s a lot of people who rely on cities for luxuries - but don\u0027t require cities for survival.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.reference.com/geography/many-cities-united-states-cfb3be08284e6a62\u0022 rel=\u0022external nofollow\u0022\u003EHow Many Cities Are There in the United States? (reference.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://worldpopulationreview.com/country-rankings/nuclear-weapons-by-country\u0022 rel=\u0022external nofollow\u0022\u003ENuclear Weapons By Country 2021 (worldpopulationreview.com)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.macrotrends.net/countries/USA/united-states/rural-population#:~:text=U.S.%20rural%20population%20for%202019%20was%2057%2C592%2C357%2C%20a,2017%20was%2058%2C333%2C412%2C%20a%200.45%25%20decline%20from%202016.\u0022 rel=\u0022external nofollow\u0022\u003EU.S. Rural Population 1960-2021 | MacroTrends\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-02T03:53:25Z\u0022 title=\u002210/02/2021 03:53  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 2, 2021\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-10-02T03:52:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038632\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633143440\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n57 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think I can do this within the rules and general public decorum.  Please remember - we are peeling back the sheen of civilization that so many take for granted - and yet what I describe is normal life for a whole lot of people.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my early days in the Corps, I heard a phrase; \u0022I\u0027ve spent more time [*pooping*] in the field than you\u0027ve spent in the Corps\u0022 - a salty way of welcoming the new kid.  Little did I know how prophetic those words would be.  Over the course of the next 20 years, much of it spent in the infantry and tanks, I lived outside.  A lot.  When you live outside all day, every day for days on end - you have to do what we all have to do... outside.  There were no conveniences like port-a-potties on Marine base training areas, or clever little things like a wall, hose and hole in the ground like training areas in Spain and North Africa enjoy.  True luxury is a plastic chair with a hole cut in it, but a wooden box or trailer hitch helps - otherwise, the good lord has already given us everything we need.  Usually, when it\u0027s time to download your food, it\u0027s just a Marine, a shovel and whatever you can grab.  TP is a feature of MREs by the way - so you don\u0027t always have to improvise... but sometimes you do.  Cardboard and other trash (plastic spoons, magazine pages (folded, not crinkled - this is important like non-icy snow)), leaves, shells, rags, smooth bits of wood, snow, and if necessary fingers soap and water all work. \n\u003C/p\u003E\n\u003Cp\u003E\nYou will note that in some cultures it is considered rude to gesture or hand something to someone using the left hand, for... reasons.\n\u003C/p\u003E\n\u003Cp\u003E\nPrivacy, too is a luxury.  I\u0027ve spent a lot of time doing my business in full view of other people.  (Not just Marines, but \u003Cem\u003Epeople \u003C/em\u003E- in all that implies).  After the first time... you just get used to it.  People who have to live that way also do a thing with their eyes to give you a sense of privacy, even when there is none.  It\u0027s a small kindness - but still appreciated.  We recognize each other in a vulnerable and private moment - and even without true privacy, we just respect each other.  This was true of the people of many countries I\u0027ve visited/trained in during peace-time, as well as the civilians of Iraq.  Sitting here in my living room in America, I recognize this might sound \u0027weird\u0027 - but frankly, it\u0027s \u0027us\u0027 who are weird.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, you want to keep yourself clean - as much as possible.  Cleanliness rituals are important.  I typically washed my hands before eating - bar of soap from a ziploc and dribbles from a canteen - and tried to wash my face at least once every day.  When water is scarce - you conserve water.  Sometimes it was just my fingertips, mouth and eyes.  Sometimes even that could not happen.  Still, cleanliness is important - so you do what you can.  With more time and water, a washcloth, dishsoap and a helmet\u0027s worth of water (when we had enough) took care of the hairy places - but depending upon OpTempo could be days to weeks before the opportunity arose.  But once the opportunity arose, you took it.  The \u0027field expedient shower\u0027 (washcloth and helmet) still leaves a lot of skin unwashed.  My 76 days comment refers to the time between when I left Camp Shoup and was again able to get all of me clean.  When that opportunity arose - I took my time and enjoyed every moment.\n\u003C/p\u003E\n\u003Cp\u003E\nCivilization is, in many ways, a set of agreements, customs, expectations and burdens we put on - and carry, often without knowing or understanding the weight.  Different cultures define these differently - but when you take a person who is so rooted to their customary norms and put them into a different environment... occasionally they fail to adjust.  Look up the word \u0027impacted\u0027 and you will recognize what can happen to someone overly wedded to Western social norms in a place that does not cater to those norms.  Adaptability is a survival skill - and not every human is equally skilled.  Still, we adapt or die.  (The same disconnect can happen the other way around, by the way; take a person used to living rough and drop them into your hometown?  It can take some getting used to).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks... it\u0027s always fun to live vicariously through the stories of others.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat you said about rough living... I met an italian once. Was visiting the states in the hope of finding an Ametical lady to date and marry.\n\u003C/p\u003E\n\u003Cp\u003E\nOne problem... he was only here a week... which is hardly enough time. He was short, and not exactly handsome, but not ugly either. Just... short and kinda pudgy.\n\u003C/p\u003E\n\u003Cp\u003E\nOne of the things he had difficulty with (beyond communication due to a thick accent) was when he suddenly washed his hands and face, and brushed his teeth and spat in the kitchen sink, since where he was from they only had ONE sink and none in the bathroom. I think he may have made a few more cultural miistakes because people were... sadly holding back barely suppressed chuckles at him.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHe ultimately failed to find an American lady to date amd went back home.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-02T03:54:46Z\u0022 title=\u002210/02/2021 03:54  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 2, 2021\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2021-10-02T04:00:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038642\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633146759\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\na few more cultural miistakes because people were... sadly holding back barely suppressed chuckles at him.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nImagine yourself in someone\u0027s home in France or Japan and there\u0027s no paper - just a bidet or techno-toilet.  The funny look on your face when you come out of the necessary will get some chuckles.\n\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2021-10-02T04:50:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038643\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633147248\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n47 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nImagine yourself in someone\u0027s home in France or Japan and there\u0027s no paper - just a bidet or techno-toilet.  The funny look on your face when you come out of the necessary will get some chuckles.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022il_794xN.2189751605_9122.jpg\u0026amp;f=1\u0026amp;nofb=1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022397\u0022 width=\u0022794\u0022 src=\u0022https://external-content.duckduckgo.com/iu/?u=https://i.etsystatic.com/6709817/r/il/aa472a/2189751605/il_794xN.2189751605_9122.jpg\u0026amp;f=1\u0026amp;nofb=1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-10-02T06:06:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038512\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633123363\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n(I\u0027ve also gone 76 days without bathing - did not kill me) \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA two-month lunar expedition is proven.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038504\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633122214\u0022 data-ipsquote-userid=\u0022137807\u0022 data-ipsquote-username=\u0022mikegarrison\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, mikegarrison said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSnow is the best \u0022toilet paper\u0022, unless it is too icy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut regolith isn\u0027t. It\u0027s like a glass wool.\n\u003C/p\u003E\n\u003Cp\u003E\nThey can mine the lunar ice, of course, but should turn it into lunar snow.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, that\u0027s the way to supply an interplanetary ship, a snow making machine.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038493\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633120520\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthey stunk more, but that\u0027s why France became really good at making fancy perfumes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey were suffering, others enjoyed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038528\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633125852\u0022 data-ipsquote-userid=\u002289439\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, StrandedonEarth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOkay, she’s bad luck, pure and simple. Lucky herself, but not for those around her, apparently.  Teela Brown complex?\n\u003C/p\u003E\n\u003Cp\u003E\nYou’d think she’d stop going aboard ships. How many crossings did she make, I wonder?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne woman  has a greater sunk tonnage than a wolfpack of subs.\n\u003C/p\u003E\n\u003Cp\u003E\nAchievement achieved.\n\u003C/p\u003E\n\u003Cp\u003E\nBut her ambiguous luck has a simple and clear explanation.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#ffffff;color:#222222;font-size:18px;\u0022\u003EBorn in 1887 in Argentina to Irish immigrants\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLeprechauns.\n\u003C/p\u003E\n\u003Cp\u003E\nEither among the ancestors, or a familiar one.\n\u003C/p\u003E\n\u003Cp\u003E\nThey redistributed the total luck in favour of their protegee.\n\u003C/p\u003E\n\u003Cp\u003E\n***\n\u003C/p\u003E\n\u003Cp\u003E\nAlso this makes to look at the Titanic disaster at another angle.\n\u003C/p\u003E\n\u003Cp\u003E\nAs we can remember, it almost missed the iceberg, but just almost. Not rammed, but scratched a meter deep. If it rammed, it would probably survive.\n\u003C/p\u003E\n\u003Cp\u003E\nIsn\u0027t it how the leprechauns work?\n\u003C/p\u003E\n\u003Cp\u003E\nWhile others blame gremlins, they forgot about the leprechauns, and weren\u0027t forgiven.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-02T06:15:45Z\u0022 title=\u002210/02/2021 06:15  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 2, 2021\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-10-02T07:10:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038557\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633132139\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut with total nuclear war there will be no authority to save people, so *some* who work together will survive,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut there would be a lot of authorities requiring army, so weapon, so industry, to protect their resources from the neighbor authorities.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, everyone would be immediately forced to join one and work for it.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile the tribes, gangs, and lonely rangers would be quickly eradicated as those who \u0022is stealing our resources, eats snacks while we are hrdly working, and is definitely spying for the competing gang\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, irl any individual and tribal survivalism would end very soon.\n\u003C/p\u003E\n\u003Cp\u003E\n(But of course, \u003Cem\u003EFallout\u003C/em\u003E is nice, and other postapocs, too.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038557\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633132139\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nat best it could be like the Wild West\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe Wild West is not a survivalism. It\u0027s a colonisation of steppe for cattle herding performed by a developed industrial urban civilisation.\n\u003C/p\u003E\n\u003Cp\u003E\nThe WW colonists were not lonely romantics, they were excessive human resources expanding from the industrial areas of Europe and... Transatlantic Europe, \u003Cspan\u003ECiseuropeans and Transeuropeans.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTheir cowboy attitude is just a showing-off. They were wearing the  European clothes, drinking whiskey, and using guns instead of arrows.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-02T07:10:33Z\u0022 title=\u002210/02/2021 07:10  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 2, 2021\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2021-10-02T09:56:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038641\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633146686\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo - here, I think the quibble is \u0027in what timeframe\u0027?  I\u0027ve had the privilege to live not only in a variety of places around the world (where resilience and industry are on display) but also around the U.S. - in rural areas so easily mocked and discounted by City Elites.  And yet, in those places we find doctors, engineers, teachers, universities, as well as farmers, mechanics, miners and dreamers; in other words all the people necessary to revive civilization.\n\u003C/p\u003E\n\u003Cp\u003E\nTen years to self recover is likely unrealistic.  Yet think about how much stuff changes in a decade.  A hundred is probably too long.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe \u0022things\u0022 are indeed there for revival of civilization, but I am skeptical whether people would have the will to work towards restoring things to their pre-war state- the state which lead them to the war in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nCivilization has advanced up to its point now because each generation advancing it felt they had to- had been raised to have to. After a war once things reach to a certain minimum level (the Wild West and/or 17th century towns and villages) I do not believe the population would feel any need to go further than that, as they will continually be raised in an environment where food and child rearing is the number one priority- and beyond that is a distraction. It might be a \u0022Wild West\u0022 with 1990s level medical care- but not the continental spanning singular societies/civilizations from before the war. These are mainly just the aftermath of religiously or power driven* empires from earlier history that eventually got to the point where no one in the general population realized what they were doing and have become the numerous democracies or republics we have today.\n\u003C/p\u003E\n\u003Cp\u003E\n*power driven, but this \u0022power drive\u0022 was bound by a sense that power was necessary to advance because they had to in order to extend their life and interests (the same need to advance described earlier) and would not exist for the same reason given earlier.\n\u003C/p\u003E\n\u003Cp\u003E\nI think we agree on the facts- there will be lots of surviving towns (intact pieces of civilization) and the resources needed to rebuild wider civilization will be available- but our disagreement would lie in our views of human nature in a major (nation-wide) disaster situation, which are outside the field of science and other analytics.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038641\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633146686\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nVis your scenario: the total number of nuclear weapons still active is way down from US/Soviet Cold War levels.  Between the US and Russia, there\u0027s about 4k per \u0027side\u0027 and they\u0027re not all aimed at each other.  Russia has to \u0027spread the love\u0027 between the US, Europe, China and Australia.  The US has Russia and China (close to 30 percent of the total landmass).  China has weapons pointed at everybody.  Now - most targets are the cities and littorals, along with major military installations - that leaves broad swathes of the landmasses untargeted.  The US has 310 major cities (targeted) and 19,500 some-odd towns and villages (partly targeted).  America\u0027s share of Russia\u0027s 4k weapons plus China\u0027s bonus gifts won\u0027t get everyone.  The \u0027rural\u0027 population of America is over 57,000,000.  That\u0027s a lot of people who rely on cities for luxuries - but don\u0027t require cities for survival.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, my scenario for whether civilization could revive itself or not was with Cold War arsenals and tactics. With real life modern day arsenals it is a completely different question and my opinion basically aligns with yours.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038682\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633158608\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut there would be a lot of authorities requiring army, so weapon, so industry, to protect their resources from the neighbor authorities.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, everyone would be immediately forced to join one and work for it.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile the tribes, gangs, and lonely rangers would be quickly eradicated as those who \u0022is stealing our resources, eats snacks while we are hrdly working, and is definitely spying for the competing gang\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, irl any individual and tribal survivalism would end very soon.\n\u003C/p\u003E\n\u003Cp\u003E\n(But of course, \u003Cem\u003EFallout\u003C/em\u003E is nice, and other postapocs, too.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut arms related factories will either be targets themselves or lie close to targeted cities. I don\u0027t think the prior authority figures will survive as they too will be targets themselves. And the civilians will not rely on the army to get them food either because of a lack of trust or reasons related to certain beliefs.\n\u003C/p\u003E\n\u003Cp\u003E\nPeople will work together, but not nation or state/province sized organizations.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038682\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633158608\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Wild West is not a survivalism. It\u0027s a colonisation of steppe for cattle herding performed by a developed industrial urban civilisation.\n\u003C/p\u003E\n\u003Cp\u003E\nThe WW colonists were not lonely romantics, they were excessive human resources expanding from the industrial areas of Europe and... Transatlantic Europe, \u003Cspan\u003ECiseuropeans and Transeuropeans.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTheir cowboy attitude is just a showing-off. They were wearing the  European clothes, drinking whiskey, and using guns instead of arrows.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe Wild West thing wasn\u0027t related to the state of survivors in the immediate aftermath, it was about how civilization would ultimately end up- relatively modern amenities spread here and there, but no nation level cooperation and also frequent lawlessness.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-10-02T10:31:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038725\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633168618\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut arms related factories will either be targets themselves or lie close to targeted cities.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA nuke doesn\u0027t devastate the territory, and most of fabrics are reinforced against it. Also there is nothing special in the arms fabrics of XX. They wouldn\u0027t need to produce submarines with SLBM and stealth bombers.\n\u003C/p\u003E\n\u003Cp\u003E\nThe civilians would either rely on the army or be forced to rely on it.\u003Cbr\u003E\nBecause any authorities would first of all take under control any available resource, including food.\u003Cbr\u003E\nAlso they would need working arms to restore the territory.\u003Cbr\u003E\nAnd everyone who doesn\u0027t rely, would automatically become their competitor and declared an out-of-laws bandit.\u003Cbr\u003E\nThat\u0027s why any survived individual postapocaliptic survivor is just a romantic hero of fantasy movies.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038725\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633168618\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPeople will work together, but not nation or state/province sized organizations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe system of the state/province/nation authorities is exactly the form which had forced the people work together widely, not locally.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038725\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633168618\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Wild West thing wasn\u0027t related to the state of survivors in the immediate aftermath, it was about how civilization would ultimately end up- relatively modern amenities spread here and there, but no nation level cooperation and also frequent lawlessness.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe Wild West was just a peripheral rural area of industrial civilisation, populated by lawful farmers and bartenders, and was far from the cinematographic lawlessness.\n\u003C/p\u003E\n\u003Cp\u003E\n(Also, the spaghetti westerns were filmed by the Italian director in Spain, lol.)\n\u003C/p\u003E\n\u003Cp\u003E\nAlso it was serviced by the railroad built exactly for that.\n\u003C/p\u003E\n\u003Cp\u003E\nThe purpose of the Wild West was to herd Lawful Good cows instead of Chaotic Neutral bisons on the grassland useless to the date as plowland due to the climate.\u003Cbr\u003E\nNothing like anarchia was there.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-02T10:41:02Z\u0022 title=\u002210/02/2021 10:41  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 2, 2021\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2021-10-02T14:12:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038665\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633154782\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLeprechauns\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMorning laughter achieved. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLevel Up! \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u002B1\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206402-sunlitzelkova/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022206402\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206402-sunlitzelkova/\u0022 rel=\u0022\u0022\u003E@SunlitZelkova\u003C/a\u003E-we gonna have some fun quibbling later, when I can devote the time your post deserves.\n\u003C/p\u003E\n\u003Cp\u003E\nFor now, I\u0027m going to eat chili and shoot guns\n\u003C/p\u003E\n\u003Cp\u003E\n\u0027Murica! \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-02T16:10:41Z\u0022 title=\u002210/02/2021 04:10  PM\u0022 data-short=\u00222 yr\u0022\u003EOctober 2, 2021\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2021-10-03T02:05:48Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I do not understand about Project Orion... the hole where the injector pops out the bomb is not far from where the plasma plume hits the plate.\n\u003C/p\u003E\n\u003Cp\u003E\nMeaning some will fly through the hole and hit the injector.\n\u003C/p\u003E\n\u003Cp\u003E\nThat sounds like a problem waiting to happen, since every pulse the injector is flashed with  what remains of a focused plasma cone.\n\u003C/p\u003E\n\u003Cp\u003E\nIt sounds like the only way to mitigate this is to increase the piston length holding the plates and keep the injector closer to the ship\u0027s main body... meaning the bomb travels farther before passing through the plate to detonate.\n\u003C/p\u003E\n\u003Cp\u003E\nAm I right or wrong?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-03T02:06:54Z\u0022 title=\u002210/03/2021 02:06  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 3, 2021\u003C/time\u003E by Spacescifi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2021-10-03T02:54:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224039035\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633226748\u0022 data-ipsquote-userid=\u0022197504\u0022 data-ipsquote-username=\u0022Spacescifi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, Spacescifi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I do not understand about Project Orion... the hole where the injector pops out the bomb is not far from where the plasma plume hits the plate.\n\u003C/p\u003E\n\u003Cp\u003E\nMeaning some will fly through the hole and hit the injector.\n\u003C/p\u003E\n\u003Cp\u003E\nThat sounds like a problem waiting to happen, since every pulse the injector is flashed with  what remains of a focused plasma cone.\n\u003C/p\u003E\n\u003Cp\u003E\nIt sounds like the only way to mitigate this is to increase the piston length holding the plates and keep the injector closer to the ship\u0027s main body... meaning the bomb travels farther before passing through the plate to detonate.\n\u003C/p\u003E\n\u003Cp\u003E\nAm I right or wrong?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn many diagrams they shoot the next bomb then the pistons are most compressed but you don\u0027t want the bomb to explode until before the pistons are at least half expanded. \u003Cbr\u003E\nIn short the bomb is just moving 2-4 time faster than the pistons. In many design they have the injector poke trough the hole. I assume this is to push away an set of spring loaded hatches halves who cover the hole at other times. \n\u003C/p\u003E\n"},{"CreatedByName":"eee","CreatedById":202855,"CreatedDateTime":"2021-10-03T03:08:09Z","Content":"\n\u003Cp\u003E\nAbout how much radiation would you need to mess with radiation hardened electronics?\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-10-03T05:05:50Z","Content":"\n\u003Cp\u003E\nWidely varies, but the usual one is from hundreds to hundred thousands Grays, especially microchips and capacitors, and the \u0022special\u0022 materials arren\u0027t from unobtanium, too.\n\u003C/p\u003E\n"}]}