{"TopicId":92361,"ForumId":44,"TopicTitle":"Cycler Ships","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-12-09T10:41:52Z","PageNum":4,"Articles":[{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-12-13T13:01:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EMicrowave Transmitters are *already* economically viable for rocket and spaceplane-launches without needing to power a Cycler Ship. The ISS consumes up to 80 metric tons in consumables (includes life-support, fresh clothes, etc.) a year- so that demand alone is capable of supporting a 1000 MW array of Microwave Transmitters (which could launch 1 metric ton of payload to LEO per launch using rockets, or significantly heavier payloads using spaceplanes- would cost about $2 billion if transmitter costs remained fixed at $2 million/MW-capacity, and would last about 10 years before starting to wear out... Current launch costs are about $10,000/kg, so the system would need to launch at least 20 rockets/year to pay for itself...)\u003Cp\u003EJust IMAGINE what electric thrusters could do with 1 GW of electric power, and only the weight of a small rectenna (1 GW is enough to power a Dual-Stage 4-Grid Ion Thruster with a thrust of 10 kN and ISP of 19,300 seconds, to give a rather absurd example... And with electric thrusters, the lower your ISP, the higher your thrust.) Now you\u0027re starting to see why Microwave Electric is the highest-performance option for a Cycler Ship...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem with microwave transmitters is that it requires an upfront investment in a gigawatt-scale powerplant situated not far from the launch pad. A cryogenic fuel production facility of a similar size would have been cheaper.\u003C/p\u003E\u003Cp\u003EAlso, no one is going to fly microwave-beam engines if there are no gigawatt-class gyrotrons operational. No one is going to build gigawatt-class gyrotrons if there are nobody around using microwave-beam engines to buy energy from them. It\u0027s a chicken-and-egg problem.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-12-14T00:03:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EThe problem with microwave transmitters is that it requires an upfront investment in a gigawatt-scale powerplant situated not far from the launch pad. A cryogenic fuel production facility of a similar size would have been cheaper.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not the purpose of Microwave Transmitters. The Microwaves don\u0027t act as \u003Cstrong\u003Epropellant\u003C/strong\u003E, they act as an \u003Cstrong\u003Eenergy source\u003C/strong\u003E. You can get a much better ISP (more than double) and TWR than with chemical rocketry- and you should know from playing KSP what that means...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EAlso, no one is going to fly microwave-beam engines if there are no gigawatt-class gyrotrons operational. No one is going to build gigawatt-class gyrotrons if there are nobody around using microwave-beam engines to buy energy from them. It\u0027s a chicken-and-egg problem.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHahaha, you made me chuckle. You DON\u0027T use GW-class Microwave Transmitters to beam a few GW of power. That would be an *extremely* silly way of doing it. Instead, you use literally thousands of MW-class Microwave Transmitters, all of which focus on the same target. \u003Cstrong\u003EIt\u0027s MUCH more cost-effective\u003C/strong\u003E, and the array still works fine if a handful of transmitters fail (allowing year-round operation without down-time for maintenance, since you can individually power down and fix broken transmitters while everything else still works).\u003C/p\u003E\u003Cp\u003EMW-class transmitters are already available off-the-shelf at a reasonable price ($2 million/MW). Purchase 1000 of them (for approx. $2 billion, maybe less if you get a discount for buying in bulk) and you can launch 100\u002B 1-ton payload SSTO rockets (or 2-3 ton payload spaceplanes) a year for almost no marginal cost (electricity is, comparatively, dirt-cheap). It costs over $10 million to launch a metric ton of cargo to orbit using chemical rockets, by contrast. The official cost-estimate is that using disposable SSTO *rockets* (not reusables, or spaceplanes, which are even more cost-effective) you can get $6 million/ton to LEO.\u003C/p\u003E\u003Cp\u003EAdditional cost-savings (via higher payload capacity per-MW, and thus reduced need for beamed power for the same payload demand) might be possible if you use the atmosphere for propulsion in the lower atmosphere (via microwave-powered Thermal Turbojets: which require ZERO internal fuel to operate) instead of relying solely on internal propellant stores. As the rocket/spaceplane climbs and the air becomes thinner, it would eventually switch over to thermal-rocket propulsion... (ideally through \u0022Hybrid Thermal Turbojets\u0022 which would simply switch from external air to internal propellant, or even a design with a \u0022conventional\u0022 LH2 \u002B Intake Air stage in between)\u003C/p\u003E\u003Cp\u003EAll of this (minus the Thermal Turbojet part) is the official plan for how to (theoretically) implement Microwave Beamed Power by NASA and Escape Dynamics, by the way. It\u0027s not just my own ideas talking.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E Thermal Turbojets/ Hybrid Thermal Turbojets are really just designs to take in gas and superheat it with a nuclear reactor or Microwave Receiver before spitting it out the rear end for thrust from thermal expansion. It\u0027s completely oblivious to whether it utilizes external atmosphere or internal propellant, and you could probably mix the two if you wanted when the air became too thin to run the TTJ purely off atmosphere. You could pass through a stage where there was combustion of the internal propellant with external air that would start to occur with a fuel mix- similar to in a conventional turbojet, but with a lot of added heat from the reactor/receiver... So, the *ideal* pattern would be: Intake Air only --\u0026gt; Intake Air \u002B LH2 --\u0026gt; LH2-only or LH2 \u002B LOX. Every one of these stages has been individually tested in either Thermal Turbojets tests back in the 1960\u0027s (Intake Air- only mode), SABRE jets (Intake Air \u002B LH2), Thermal Rocket tests (LH2 only), or in conventional rockets (LH2 \u002B LOX). The tricky part is integrating all these fuel-modes into a single engine, that operates with added heat from a reactor or Microwave Receiver...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-14T00:24:56Z\u0022 title=\u002212/14/2014 12:24  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 14, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-12-14T01:37:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kibble\u0022 data-cite=\u0022Kibble\u0022\u003E\u003Cdiv\u003EIs zero boil-off even possible? I was under the impression that even with perfect cooling, hydrogen atoms are small enough to just leak thru the molecules of the tank!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely no boil-off is technically impossible, but it CAN be reduced to completely negligible levels.\u003C/p\u003E\u003Cp\u003ELike most thermodynamic processes, boil-off occurs MUCH more quickly at higher temperatures. The only reason boil-off is a real problem for rockets is because the fuels start to heat up from the moment they are placed in the tank. Insulating the fuel tanks can slow this process, but the only real way to STOP or even reverse the rise in temperature is to actively cool the fuel tanks. If you keep the fuel tanks cold enough, boil-off becomes a non-issue.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-12-14T07:35:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EThat\u0027s not the purpose of Microwave Transmitters. The Microwaves don\u0027t act as \u003Cstrong\u003Epropellant\u003C/strong\u003E, they act as an \u003Cstrong\u003Eenergy source\u003C/strong\u003E. You can get a much better ISP (more than double) and TWR than with chemical rocketry- and you should know from playing KSP what that means...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo? A microwave-beam engine would still need propellant. That means either having some propellant production/storage facility nearby (cryogenic, if we\u0027re using liquid hydrogen), or an expensive precooled thermal turbojet/hybrid engine, the kind that\u0027s used in REL\u0027s Skylon, if it ever flies.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHahaha, you made me chuckle. You DON\u0027T use GW-class Microwave Transmitters to beam a few GW of power. That would be an *extremely* silly way of doing it. Instead, you use literally thousands of MW-class Microwave Transmitters, all of which focus on the same target. \u003Cstrong\u003EIt\u0027s MUCH more cost-effective\u003C/strong\u003E, and the array still works fine if a handful of transmitters fail (allowing year-round operation without down-time for maintenance, since you can individually power down and fix broken transmitters while everything else still works).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not just talking about individual plants. What I\u0027m saying is that a plant, or several plants, that have a total production capability \u003Cem\u003Eeven close\u003C/em\u003E to a gigawatt would not be cheap. Even if you split the load between \u003Cem\u003Ethousands\u003C/em\u003E of plants, the total costs wouldn\u0027t be very far off.\u003C/p\u003E\u003Cp\u003EP.S. Try to emphasize with italics rather than all caps. Caps are like shouting. Thank you.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-14T07:49:03Z\u0022 title=\u002212/14/2014 07:49  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 14, 2014\u003C/time\u003E by shynung\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-12-15T03:14:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EIt costs over $10 million to launch a metric ton of cargo to orbit using chemical rockets, by contrast. \u003Cp\u003E The official cost-estimate is that using disposable SSTO *rockets* (not reusables, or spaceplanes, which are even more cost-effective) you can get $6 million/ton to LEO.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E$10 million? Maybe with Atlas/Delta, but Falcon 9 can launch 13150 kg to LEO, and the listed price is $61.2 million. That\u0027s $4.65 million/metric ton. I\u0027ve heard the final price is higher when you include other services... but it would have to be 2.15 times higher to reach $10 million.\u003C/p\u003E\u003Cp\u003E(And Falcon 9\u0027s actual performance is higher, the official number includes some margin for reusability testing, IIRC).\u003C/p\u003E\u003Cp\u003ESo this really doesn\u0027t sound massively game-changing. Competitive, definitely... but if SpaceX\u0027s first-stage reusability turns out to be practical (without massive refurbishment like Shuttle) the costs may drop quite a bit lower.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-12-15T23:29:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003ESo? A microwave-beam engine would still need propellant. That means either having some propellant production/storage facility nearby (cryogenic, if we\u0027re using liquid hydrogen), or an expensive precooled thermal turbojet/hybrid engine, the kind that\u0027s used in REL\u0027s Skylon, if it ever flies.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA Thermal Turbojet isn\u0027t *necessarily* expensive, unless you pre-cool it. Pre-cooling *does* allow you to operate the TTJ up to much higher speeds, and add a LH2/Atmosphere stage in between the Atmosphere-only and LH2-only stages, like I suggested. But it\u0027s not strictly necessary.\u003C/p\u003E\u003Cp\u003EAs for the Cryogenic fuel-production facility, that cost isn\u0027t exactly new. We already have plenty of capacity in those already built up. Since Microwave Thermal Rokcetry actually \u003Cstrong\u003E\u003Cem\u003Ereduces\u003C/em\u003E\u003C/strong\u003E the amount of propellant mass necessary to get each ton to LEO (although it shifts mass from LOX to LH2, resulting in a net increase in LH2 demand), it shouldn\u0027t require a whole lot of new capacity to be built...\u003C/p\u003E\u003Cp\u003EThe cost of getting a chemical rocket to orbit \u003Cem\u003E\u003Cstrong\u003Eisn\u0027t\u003C/strong\u003E\u003C/em\u003E fuel. It\u0027s in engineering and construction of space-grade chemical rocket engines, mostly- and Microwave Thermal Rocket Engines are comparatively cheaper (at space-grade engineering levels- the cost is relatively flat at lower engineering standards). Fuel costs only add 0.1% of the cost to a rocket launch, according to Elon Musk (the CEO of Space-X).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EI\u0027m not just talking about individual plants. What I\u0027m saying is that a plant, or several plants, that have a total production capability \u003Cem\u003Eeven close\u003C/em\u003E to a gigawatt would not be cheap. Even if you split the load between \u003Cem\u003Ethousands\u003C/em\u003E of plants, the total costs wouldn\u0027t be very far off.\u003Cp\u003EP.S. Try to emphasize with italics rather than all caps. Caps are like shouting. Thank you.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Microwave Thermal Rocketry cost of $6000/kg (vs. $10,000/kg for conventional rockets) accounts for the cost of Microwave Transmitters. It accounts for the cost of electricity generation. It accounts for ground facilities and operational costs. It\u0027s based on a total-costs estimate by experts that includes everything and the kitchen sink.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-12-15T23:51:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003E$10 million? Maybe with Atlas/Delta, but Falcon 9 can launch 13150 kg to LEO, and the listed price is $61.2 million. That\u0027s $4.65 million/metric ton. I\u0027ve heard the final price is higher when you include other services... but it would have to be 2.15 times higher to reach $10 million.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe final price is MUCH higher when you include other services. I believe it comes out to around $8 or $9 million/ton with Space-X? The figure of $10 million/ton \u003Cstrong\u003E*was*\u003C/strong\u003E indeed based off Atlas/Delta rockets from everything I could find, though.\u003C/p\u003E\u003Cp\u003EThe cost-estimate of $6 million/ton for Microwave Thermal Rockets already includes all those additional services, on the other hand. So it\u0027s still a bit cheaper in its most basic form. And with Microwave Thermal Spaceplanes, you can bring that cost a \u003Cstrong\u003E*lot*\u003C/strong\u003E further down due to reusability and increased payload capacity, perhaps by as much as an order of magnitude (true spaceplanes, as opposed to shuttle-type designs, theoretically have much higher maximum payload capacity per kN of thrust in their engines: which is the major cost-determining factor for Microwave Thermal propulsion, as determined by available MW/GW of beamed-power from the ground...)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003E(And Falcon 9\u0027s actual performance is higher, the official number includes some margin for reusability testing, IIRC).\u003Cp\u003ESo this really doesn\u0027t sound massively game-changing. Competitive, definitely... but if SpaceX\u0027s first-stage reusability turns out to be practical (without massive refurbishment like Shuttle) the costs may drop quite a bit lower.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn its most basic form (disposable SSTO rockets) it\u0027s a superior but not massively game-changing option for a launch system. However, Microwave Beamed-Power \u003Cem\u003E\u003Cstrong\u003Etruly\u003C/strong\u003E\u003C/em\u003E shines when it\u0027s used in Microwave Electric propulsion schemes (for the orbital stages of rockets), drastically reducing the total payload requirement to reach GEO or beyond with a certain satellite/spacecraft design, or with Microwave Thermal Spaceplanes: which can reach orbit with between 1/2 and 1/3rd the amount of beamed power, and *drastically* bring down costs due to their easy reusability.\u003C/p\u003E\u003Cp\u003EEven if you simply scale-up the Microwave Thermal Rockets, you should achieve economies of scale. Remember, the cost-estimate of $6000/kg assumes \u003Cem\u003E\u003Cstrong\u003E*absolutely no economies of scale*\u003C/strong\u003E\u003C/em\u003E. It\u0027s based on the current Gyrotron market-price of $2 million/MW. If you were purchasing a thousand or more of these units (1000 units is necessary just to get 1 ton of payload to LEO per rocket-launch, and is part of the basis of the $6000/kg cost-estimate), you could \u003Cstrong\u003Ealmost certainly\u003C/strong\u003E get a bulk-discount on the Gyrotrons, due to being able to cut down profit margins a bit (Gyrotrons are currently a type of highly-specialized equipment sold under a high-profit sales model) and mass-produce the Gyrotrons instead of manufacturing a small number of units in specialized workshops (currently maybe only a few dozen 1 MW units are made/sold worldwide each year...)\u003C/p\u003E\u003Cp\u003EThe small scale of a 1 ton-to-LEO rocket is also what drives the SSTO launch profile. Staging is a cost that does not scale the same way as rocket size (it becomes *relatively* cheaper with larger rockets)- it would actually *increase* costs to try and stage a 1-ton payload-capacity rocket, but it would *reduce* costs to stage a 10-ton payload-capacity Microwave Thermal rocket...\u003C/p\u003E\u003Cp\u003EFinally, Microwave Electric propulsion is just an *amazing* orbital propulsion system. Currently, electric engines are designed under the assumption that the most power one might possibly have available is 200-250 kW (and probably a lot less). However, the cost and mass-per-kg of many types of electric thruster comes \u003Cstrong\u003E*drastically*\u003C/strong\u003E down when scaled to higher power-levels (this is especially true of Magentoplasmodynamic designs). Consider that, and then consider that the smallest economical Microwave Beamed Power system would provide nearly an entire \u003Cstrong\u003EGigawatt\u003C/strong\u003E of available electricity (and for a *fraction* of the onboard mass of a 250 kW solar array). That\u0027s a \u003Cem\u003E\u003Cstrong\u003Ehuge\u003C/strong\u003E\u003C/em\u003E (4000-fold!) increase in the amount of available power to play around with in electric engine designs, and for a \u003Cem\u003E\u003Cstrong\u003E*reduction*\u003C/strong\u003E\u003C/em\u003E in the [onboard] mass vs. even a much weaker solar array...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E NASA is already designing Mars missions around a theoretical 250 MW nuclear reactor and scaled-up VASIMR propulsion system (which has \u003Cstrong\u003E*much*\u003C/strong\u003E lower ISP than many other types of electric thruster, but much higher thust-per-kiloWatt...) and an onboard nuclear reactor (which might never happen, for political reasons). So I hardly imagine they would reject a much less expensive (and politically safer) mission proposal that relied on accelerating to Mars with 1 GW of Microwave Beamed Power from an Earth-based array already utilized to launch rockets/spaceplanes.\u003C/p\u003E\u003Cp\u003EAnd, if you used a Cycler Ship instead of a \u0022traditional\u0022 mission architecture, you could drastically reduce crew times in orbit- as the 250 MW Vasimr design assumes *over a month* or acceleration-time at each end of the journey (which could be performed on a previous, unmanned initial cycle with a Cycler Ship). A Cycler trajectory also only takes 5 months on each manned leg of the journey (you use a different Cycler ship to get back, with a 5-month return-leg), whereas the 250 MW Vasimr proposals rely on crew spending nearly twice as much time off-planet (thanks to the long acceleration times, but a shorter surface-stay on Mars)...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T00:10:57Z\u0022 title=\u002212/16/2014 12:10  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-12-18T05:42:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EThe final price is MUCH higher when you include other services. I believe it comes out to around $8 or $9 million/ton with Space-X? The figure of $10 million/ton \u003Cstrong\u003E*was*\u003C/strong\u003E indeed based off Atlas/Delta rockets from everything I could find, though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, NASA just gave SpaceX the contract for TESS, and that was $87 million - 42% more than the $61.2 million base price.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-01-01T17:40:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003EWell, NASA just gave SpaceX the contract for TESS, and that was $87 million - 42% more than the $61.2 million base price.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich price is the base price? I don\u0027t really want to go and look up the payload of TESS right now and use that to back-calculate expected prices...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-01-29T06:28:20Z","Content":"\n\u003Cp\u003EJust a rather odd thought to add to this discussion- what if theoretically you built a small onboard Mass Driver into the Cycler Ship?\u003C/p\u003E\u003Cp\u003EWhat I\u0027m thinking is something like this- at the point where the interceptor ship departs the Cycler Ship again to meet up with any cargo or landers in orbit of the planet it is heading to (which would have been sent unmanned ahead of time on a slower transfer orbit, which would be more fuel-efficient for cargo), it would normally have to perform a burn to place itself on a closer approach to the planet/moon than the Cycler Ship (which skirts by the planet at a large distance to minimize the need for course-corrections due to gravitational perturbations of its orbit by the planet).\u003C/p\u003E\u003Cp\u003EWhat if the Cycler Ship had a small Mass Driver onboard (an electromagnetic accelerator similar to a rail-gun), and used that to place the ship on the closer approach instead? That way, the Cycler Ship could be on a trajectory that heads more directly towards the planet until that point, and use that impulse to place itself on an orbit that passes at a greater distance from the planet. Meanwhile, the interceptor-ship doesn\u0027t have to perform any burn at all, which reduces the opportunities for a potential mission-critical engine-failure, and saves on fuel mass that has to be launched for the mission...\u003C/p\u003E\u003Cp\u003EThe Cycler Ship may have to perform some course-corrections as a result of this, of course (although, as stated, it may be possible to design the impulse to create desirable changes in trajectory for *both* vessels), but it has the luxury of a lot more time to make these than the interceptor-ship, which means it can make these corrections with higher-ISP, lower-thrust engines (or even with Solar Sails) that it would have onboard for regular course-corrections anyways...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHeh, I\u0027m starting to imagine an entire mission-architecture here that creates regular shuttle flights between Earth and Mars at EXTREMELY low marginal cost... (that is, with a high set-up cost, but that can be re-used until parts wear out virtually for free...)\u003C/p\u003E\u003Cp\u003E(1) A computer/remote-controlled \u003Ca href=\u0022http://authors.library.caltech.edu/3303/1/PARaipcp04a.pdf\u0022 rel=\u0022external nofollow\u0022\u003EMicrowave Thermal Rocket spaceplane\u003C/a\u003E shuttles crew members to Low Earth Orbit onboard a small interceptor-ship to be used later in the mission (the Earth-based Microwave Beamed Power will be needed for other mission-components anyways...) The extremely high ISP and TWR rating of Microwave Thermal Rockets (850-1000s and 2-3x comparable chemical rocket engines, respectively), as well as the ability to use Microwave Beamed Power for Thermal Turbojets (which use the atmosphere as their only propellant), makes spaceplanes possible...\u003C/p\u003E\u003Cp\u003E(2) Once in orbit, the spaceplane docks with a fuel depot containing Liquid Nitrogen gathered from Earth\u0027s Thermosphere using a microwave-powered \u003Ca href=\u0022https://en.wikipedia.org/wiki/Propulsive_fluid_accumulator\u0022 rel=\u0022external nofollow\u0022\u003EPropulsive Fluid Accumulator\u003C/a\u003E... (the Propulsive Fluid Accumulator carries a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Rectenna\u0022 rel=\u0022external nofollow\u0022\u003Erectenna\u003C/a\u003E and uses the electrical power to cool/compress scooped Nitrogen, and to run a Nitrogen-electric plasma thruster such as a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Helicon_Double_Layer_Thruster\u0022 rel=\u0022external nofollow\u0022\u003EHelicon Double Layer Thruster\u003C/a\u003E for orbital station-keeping and maneuvering back to the fuel depot in a higher orbit...) The spaceplane then refuels with a small quantity of Liquid Nitrogen (which can also be utilized in Microwave Thermal Rocket thrusters, which are *extremely* fuel-flexible, and require no retro-fitting...) and uses it to perform a powered/controlled re-entry, while the crew continue on with the mission in the interceptor-ship...\u003C/p\u003E\u003Cp\u003E(3) The interceptor-ship docks with the fuel depot. The interceptor-ship is launched with empty fuel tanks, which are meant for holding cryogenic liquids for short periods of time (and are only lightly insulated). It is equipped with a Microwave Thermal Thruster, and is a small, lightweight, possibly *unpressurized* capsule (the emphasis is on low mass so that it can be carried to orbit by a relatively small spaceplane, and high TWR so that it can perform its purpose effectively... Think a thin metal can with walls designed to do nothing more than stop loose objects from floating off into space, astronauts sit in EVA suits inside... Guidance is remote-controlled like a probe...) The fuel depot is equipped with a pressurized living-quarters that the crew transfer over to while awaiting the arrival of the outbound Cycler Ship...\u003C/p\u003E\u003Cp\u003E(4) When the outbound Cycler Ship (in an Aldrin Cycler Orbit with the \u0022short\u0022 5-month leg of its cycle going from Earth to Mars) is nearing closest-approach to Earth, the crew suits up and transfers over to the interceptor-ship: which fuels up on Liquid Nitrogen stored in the depot just before the arrival of the Cycler Ship. Using Microwave Beamed Power transmitted from Earth\u0027s surface, the interceptor-ship \u0022burns\u0022 to intercept the Cycler Ship when the Earth\u0027s rotation is such as to allow the ground-based transmitters to focus on the interceptor-ship... (alternatively, orbital Microwave Relays are scientifically/technologically possible- which can reflect and re-focus a microwave beam around the curvature of the Earth...)\u003C/p\u003E\u003Cp\u003E(5) The interceptor-ship performs small course-correction \u0022burns\u0022 (with a thermal rocket, no actual combustion occurs- thermal expansion of superheated propellants drives the entire thrust effect) and matches velocity at closest approach to the Cycler Ship, then proceeding to initiate a hard-dock (the interceptor will remain docked with the Cycler Ship for the next 5 months) and transfer over crew (via airlock if the interceptor was unpressurized), life-support consumables, and any scientific experiments designed to be performed in deep-space rather than in orbit of Mars...\u003C/p\u003E\u003Cp\u003E(6) The interceptor-ship also transfers over surplus Liquid Nitrogen for storage/use on the Cycler Ship (the interceptor-ship should carry MUCH more than is needed for rendezvous: the Nitrogen has a variety of uses on the Cycler Ship including being used in course-corrections with Nitrogen-electric thrusters, to dilute Oxygen in the Cycler Ship\u0027s breathable atmosphere, and in jets of compressed Nitrogen for Reaction Control Thrusters... The massive surplus of Nitrogen also gives the interceptor-ship abort capabilities if it is necessary to turn around and return to Earth instead of rendezvous with the Cycler Ship...) The Cycler Ship should have been accelerated to its cycler-trajectory using microwave-powered Nitrogen-electric propulsion in the first place, and thus be equipped with significant Liquid Nitrogen storage-tanks. These tanks should be actively-cooled and/or heavily-insulated to allow for long-term storage without extensive boil-off (although Nitrogen gas can also be removed from the tanks and put to use diluting the otherwise Oxygen-rich atmosphere of the Cycler Ship...) unlike the lightly-insulated tanks of the interceptor ship only designed for short-term storage...\u003C/p\u003E\u003Cp\u003E(7) Equipment on board the Cycler Ship allows for a largely regenerative life-support system, thus reducing the need for consumables shipped onboard the interceptor-ship. The crews spends most of the next 5 months onboard the Cycler Ship enjoying the spacious (for a spaceship) centrifugal living accommodations (to prevent bone-loss and other health effects of zero-gravity), greenhouses (part of the regenerative life-support system), abundant electrical power from Microwave Beamed Power (from Earth) and solar panels or a nuclear reactor, and possibly even a well-equipped science laboratory. The Cycler Ship is also equipped with a small mass-driver that will provide the interceptor ship with the tiny course-correction it needs to depart on its Mars-intercept near closest-approach (and doubles as a system to eject useless non-recyclable garbage as reaction-mass for course-corrections...)\u003C/p\u003E\u003Cp\u003E(8) Shortly before closest approach to Mars, the interceptor ship is launched on a Mars intercept-trajectory by the Cycler Ship\u0027s mass driver. The Cycler Ship is equipped with small Nitrogen-electric thrusters (TWR is a lot less of an issue with regards to how long it took to reach the cycler-orbit in the first place, as there were no crew onboard at that time...) and possibly solar sails to reduce propellant usage, and performs any necessary course-corrections to adjust after ejecting the incerceptor ship with the luxury of time...\u003C/p\u003E\u003Cp\u003E(9) The interceptor ship captures into Mars orbit using a combination of aerobraking and propulsive capture (the atmosphere is too thin for a pure aerocapture). The propellant for the capture-burn is Liquid Nitrogen (originally scooped from Earth using a Propulsive Fluid Accumulator) stored aboard the outbound Cycler Ship during the 5-month voyage. The power-source is Microwave Beamed Power from a large nuclear reactor either onboard the Cycler Ship, or sent in a cargo module to Mars orbit (via minimal-energy Hohman Trajectory) ahead of the crew, as Mars will be too far away from Earth art this point for large amounts of concentrated Microwave Beamed Power to reach the interceptor-ship (due to the problems of microwave beam-diffusion over long distances: although one option is to convert the microwaves to a tight-beam laser in Earth-orbit, send the energy to Mars orbit, and convert it back to microwaves with a satellite orbiting there...) Either way, the nuclear reactor would have been be a lot more than deadweight up until this point- it could have also been utilized to power a Nuclear Thermal Rocket or Nuclear Electric Propulsion system onboard the spacecraft that brought it out to the vicinity of Mars...\u003C/p\u003E\u003Cp\u003E(10) The crew rendezvous with any (preferably reusable) landers, pressurized orbital habitats, laboratories, fuel tankers, etc. as necessary in Mars orbit, and carry out the mission there. Ideally, Nitrogen for the interceptor-ship to rendezvous with the return-trip Cycler Ship (a separate Cycler Ship from the outbound ship, also in an Aldrin Cycler Orbit, with the \u0022short\u0022 5-month leg of its journey headed from Mars to Earth rather than the other way around) should have been sent ahead of time to Mars on a small fuel-tanker (possibly simply as fuel tanks attached to a larger vessel) on a slower, minimal-energy Hohman transfer-orbit... (as this takes less energy than accelerating to a cycler orbit and than capturing at Mars from there...) The cargo sent ahead of the crew could have all been accelerated to Mars and captured into orbit there via Nitrogen-electric propulsion (utilizing Microwave Beamed Power from Earth on the outbound burn, and from the local nuclear reactor on the capture-burn: with arrival times at Mars staggered such as to allow each to capture before the next begins its capture-burn, thus allowing each to receive the full load of microwave-power available at any given time...)\u003C/p\u003E\u003Cp\u003E(11) When the mission is complete, the crew transfer to the interceptor-ship and utilize Microwave Thermal propulsion (using either cryogenic Nitrogen from Earth, or cryogenic Methane produced on Mars by Sabatier Reaction) to rendezvous with it and transfer back over as before (however any life-support consumables stored onboard *this* Cycler Ship would have been transferred to the Cycler Ship by an unmanned tanker when it last swung by Earth, and stored for the past 15\u002B months of the \u0022long\u0022 leg of the journey, as it would cost *MUCH* more energy to send the consumables to Mars orbit and then to a Mars-Earth cycler-orbit than just to send it to the Mars-Earth cycler-orbit in the first place...)\u003C/p\u003E\u003Cp\u003E(12) When the return-journey Cycler Ship nears Earth, the interceptor-ship is ejected via Mass Driver (which also does double-duty ejecting garbage as reaction-mass) onto an Earth-intercept trajectory, and captures into Earth orbit using a combination of aerobraking (limited by heat-management and dynamic-pressure concerns rather than rthe atmosphere being too thin) and propulsive-capture via Microwave Thermal propulsion (using either Nitrogen sent to the Cycler Ship via unmanned tanker with the life-support consumables, or Methane manufactured on Mars using the Sabatier Reaction and locally-extracted Hydrogen from water-ice... Methane has a higher ISP, and a lower fuel-density then Nitrogen, and can be combined with Oxygen for an afterburning-effect following the thermal expansion of the Methane: to add thrust but reduce ISP further... In either case, the power-source is Microwave Beamed Power from Earth...) The interceptor-ship then docks back with the fuel depot, transfers over the crew to the larger/pressurized crew quarters onboard, and awaits the launch of a spaceplane identical to the one in (1) to take the crew down to the surface, and the interceptor-ship for inspection and refusrbishing... (since the interceptor-ship was designed to be carried to orbit by the spaceplane in the first place, it only makes sense that the spaceplane should be able to carry it back to the surface for inspection/refurbishing... Of all the ships utilized, the interceptor-ship would be the most likely to sustain fatigue/damage due to its ultra-lightweight design and repeated long burns: most other ships in this mission profile, except the Mars lander, only perform one or two major burns and then remain in Mars orbit, cycler orbit, etc. for the remainder of the mission...)\u003C/p\u003E\u003Cp\u003ENow \u003Cstrong\u003ETHAT\u003C/strong\u003E was a long and detailed mission architecture. But I\u0027m glad I took the time to draw it out. ALL of these steps are actually reproducible in KSP (with the right mods). Maybe somebody will even try this mission out some day... (I think my computer would *DIE* with this many sophisticated craft in a single save, but I\u0027ll probably give it a try... Setting up a ship in a cycler-orbit in KSP will be the most challenging aspect- but it\u0027s possible, and I might skip out on the life-support and centrifugal habitats because I\u0027m already reaching my memory-limit...) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-01-29T08:17:46Z","Content":"\n\u003Cp\u003E^ totally not thought that out at all.\u003C/p\u003E\u003Cp\u003EThough your mention if the mass driver did remind me. Catapaults do work in space, and having a smaller craft launched off from the cycler, without having to use its onboard fuel, could save a solid chunk of delta-v for the landers\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-01-31T05:08:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linkxsc\u0022 data-cite=\u0022linkxsc\u0022\u003E\u003Cdiv\u003E^ totally not thought that out at all.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, hopefully I made you think about it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linkxsc\u0022 data-cite=\u0022linkxsc\u0022\u003E\u003Cdiv\u003EThough your mention if the mass driver did remind me. Catapaults do work in space, and having a smaller craft launched off from the cycler, without having to use its onboard fuel, could save a solid chunk of delta-v for the landers\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was kind of the point. Although, you don\u0027t use the interceptor-ships as landers.\u003C/p\u003E\u003Cp\u003EThe whole point of this Mission Architecture was specialization for efficiency and re-usability. You have a specialized ship for Earth-Mars transfers and another for Mars-Earth transfers: each of which you only need to accelerate to a Mars/Earth-crossing trajectory ONCE (and then can perform minor course-corrections each cycle with electric thrusters and Solar-Sails...) You have a specialized reusable lander that you can send down to the Martian surface and back again over and over... You have a specialized lightweight interceptor-ship that ferries crew to and from the Cycler Ships in relatively cramped and/or unpressurized conditions. You may even have specialized Nitrogen-tankers from Earth, or even better yet Propulsive Fluid Accumulator satellites that scoop CO2 from the Martian atmosphere and use THAT for propulsion around Mars and to the Mars-Earth return-journey Cycler Ship... (it might even make more sense for the Cycler Ships to rely on CO2-electric propulsion for course-corrections, as it takes less Delta-V to rendezvous withe the Cycler Ship near Mars than near Earth, as it is moving more slowly there...)\u003C/p\u003E\u003Cp\u003EMass Drivers (electromagnetic catapults) fill just *ONE* niche in this infrastructure-driven paradigm. And there are a LOT of potential uses for them. To de-orbit landers around Mars, and assist with the ejection of interceptor ships towards rendezvous with the Cycler Ships (the Mass Driver can accelerate itself with de-orbiting landers, solar sails and CO2-electric engines: and eject the interceptor-ship prograde near periapsis of an elliptical orbit- thus reducing the Delta-V requirements the interceptor-ship needs to meet on internal fuel). To assist with launch of reusable landers from the Martian surface (even a few hundred m/s of initial speed helps dramatically), or assist in the launches of payloads from Earth for that matter (once again, the most cost-effective Mass Drivers only provide a few hundred m/s initial boost...) Or even, as I pointed out, to utilize garbage as reaction-mass for course-corrections aboard the Cycler Ship...\u003C/p\u003E\u003Cp\u003ESpace infrastructure is cool stuff. Really cool stuff. \u003Cstrong\u003EIt\u0027s a shame we have none of it\u003C/strong\u003E- because often one type of infrastructure enables another (simple orbital propellant depots around Earth that allow larger satellites to reach Geosynchronous orbit by splitting their orbit-boosting fuel and the satellite itself into separate, smaller launches; in turn develop experience and expertise in transferring cryogenic fuels in orbit that will be useful/necessary for Propulsive Fluid Accumulators, for instance...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-31T05:19:16Z\u0022 title=\u002201/31/2015 05:19  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 31, 2015\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-01-31T06:32:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESpace infrastructure is cool stuff. Really cool stuff. \u003Cstrong\u003EIt\u0027s a shame we have none of it\u003C/strong\u003E- because often one type of infrastructure enables another (simple orbital propellant depots around Earth that allow larger satellites to reach Geosynchronous orbit by splitting their orbit-boosting fuel and the satellite itself into separate, smaller launches; in turn develop experience and expertise in transferring cryogenic fuels in orbit that will be useful/necessary for Propulsive Fluid Accumulators, for instance...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat would you consider the \u0022endgame\u0022 of space infrastructure, given our current understanding of physics? If space exploitation became a global priority, what would you like to see in our skys?\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-02-02T02:07:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EWhat would you consider the \u0022endgame\u0022 of space infrastructure, given our current understanding of physics? If space exploitation became a global priority, what would you like to see in our skys?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll just give a list with short notes, because in-depth explanations of the value of each would take several pages (you can ask me about specific responses if you\u0027d like, though)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESpace Infrastructure that will help mankind conquer the \u0022final frontier\u0022:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1. Orbital and surface-based Mass Drivers (optimized for cost-effectiveness, i.e. 1 km/s exit-velocity is much more worthwhile than 4 km/s; useful on Luna/LLO etc.)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2. Mountaintop Launch Sites (tiny reduction in Delta-V requirement, large increase in TWR/ISP due to reduced atmospheric pressure)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3. Microwave Power-Transmission Stations (better TWR/ISP, can be combined with Mass Drivers *and* built on mountaintops)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E4. Reusable low-maintenance Spaceplanes (wide engineering margins reduce need for refurbishment/maintenance, can be Microwave-powered for better ISP/TWR...)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E5. Cryogenic, actively-cooled Orbital Propellant Depots\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E6. Propulsive Fluid Accumulator satellites (Microwave-powered)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E7. Orbital Tugs (Microwave-powered)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E8. Microwave Power-Relay satellites (similar to comm satellites, but relay microwaves instead of radio wavelengths...)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E9. Manned \u0022recuperation\u0022 and limited orbital-manufacturing/assembly space stations (\u003C/strong\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Orbital_Piloted_Assembly_and_Experiment_Complex\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Esimilar to what the Russians are planning\u003C/strong\u003E\u003C/a\u003E\u003Cstrong\u003E)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E10. Cycler Ships (paired- one for outbound and one for return journey to/from each celestial body)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E11. Off-world ISRU stations (Sabatier Reactors on Mars, regolith and water-electrolysis on the Moon, etc.)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E12. Fully-reusable landers and fuel-ferries (designed to carry fuel and crew to/from the surface of Luna, Mars, and other celestial bodies)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAll of these types of infrastructure can also be built on other planets/moons, and some of them are more useful there: Mass Drivers on bodies without an atmosphere (such as the Moon), for instance...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"CjStaal","CreatedById":112518,"CreatedDateTime":"2015-02-02T22:33:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EAll cyclers do have a serious flaw. In order to transfer fuel, crew, cargo and whatever you\u0027ll need to dock. And to dock you\u0027ll have to match velocities. If you match velocities with a cycler to for example Mars you will be on a trajectory to Mars. Since you\u0027ve already spend a lot of fuel to get into that trajectory it makes a lot more sense to stay on that orbit and actually go to Mars yourself. Why would you waste another great amount of fuel to stay in Earth orbit?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause you\u0027re using a much smaller ship to dock. You\u0027re saving fuel and gaining space. [pun intended.]\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-02-02T23:43:40Z","Content":"\n\u003Cp\u003EI envision a cycler \u0022ship\u0022 as something closer to a Gundam Space Colony- huge, built out of an asteroid that was shifter into a cycler orbit. So you launch a small capsule into a cycler intercept, dock, and spend the next few months as tourists looking around the Cycler. before getting back onboard your (refueled) capsule and getting off at the next planet.\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-02-02T23:43:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CjStaal\u0022 data-cite=\u0022CjStaal\u0022\u003E\u003Cdiv\u003EBecause you\u0027re using a much smaller ship to dock. You\u0027re saving fuel and gaining space. [pun intended.]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMain point of a cycler would be a reuseable station with the radiation shielding and space and comfort for several crewmembers for a longer duration mission (to mars) than could be provided for in a ship.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-02-04T05:04:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E NASA is already designing Mars missions around a theoretical 250 MW nuclear reactor and scaled-up VASIMR propulsion system (which has \u003Cstrong\u003E*much*\u003C/strong\u003E lower ISP than many other types of electric thruster, but much higher thust-per-kiloWatt...) and an onboard nuclear reactor (which might never happen, for political reasons).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVASIMR has variable ISP, at high thrust it has an ISP of 3000, but at a lower thrust it has an ISP of 5000. This is a critical part of its design, in order to shift between times when you need thrust (such as making an oberth manuever) and other times when you simply need days and days of thrust. \u003C/p\u003E\u003Cp\u003EAs you have stated the problem with VASIMR is that it needs the electricity of a small city to run. But then all the high ISP technology requires nuclear. The difference is that with NERVA the uranium is inexorably tied to a rocket and is preinserted, and accident in low earth orbit or below is a nuclear accident. In nuclear powerplants the fuel rods can be inserted after stable orbit is reached can be packed in graphite and kept separate until that point. \u003C/p\u003E\u003Cp\u003EI would point out the rather 800 lb gorilla in this thread. Low energy transfers between Earth and Venus and Earth and Mars have one common simple problem. Neither are a suitable destination for humans. Without some sort of solar shielding, Venus is uninhabitable by any known or hypothetical means. It has a dense hot atmosphere described as greenhouse effect run amok. Soluble sulfer has been volatized and oxidized creating an acidic atmosphere that is more hostile than a high temperature protein acid hydrolysis apparatus. Even if venus cooled its reactive atmosphere would react violently with the surface for 1000s of years, only the highest elevations would be habitable. \u003C/p\u003E\u003Cp\u003EMars is not a destination either. Before you send people to Mars, one needs to send resource production (greenhouses, O2, etc) and energy production (Since your sunlight is 1/10th that of earths). The atmosphere is too thin to maintain a living pressure, which means there needs to be pressure balance (which has been a problem in earth-bound versions). No doctors, no hospitals, no way off means no means of dealing with life threatening issues. Little water means growth is problem, little energy means construction is a problem. This talk of going to Mars is either suicide minded or fantasy. \u003C/p\u003E\u003Cp\u003ENear Earth Asteroids are the way to go, if an asteroid is the destination, then hop on and off and learn about living in space. Since roids are generally softer than planets you can dig down and shield from the cosmic nut busters. \u003C/p\u003E\u003Cp\u003EBetter yet, build a colony at L2 and make a mega-telescope and do something useful.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-02-04T05:38:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI would point out the rather 800 lb gorilla in this thread. Low energy transfers between Earth and Venus and Earth and Mars have one common simple problem. Neither are a suitable destination for humans. Without some sort of solar shielding, Venus is uninhabitable by any known or hypothetical means. It has a dense hot atmosphere described as greenhouse effect run amok. Soluble sulfer has been volatized and oxidized creating an acidic atmosphere that is more hostile than a high temperature protein acid hydrolysis apparatus. Even if venus cooled its reactive atmosphere would react violently with the surface for 1000s of years, only the highest elevations would be habitable. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPoint of order- there are entire threads on this forum about how to manage a venus habitat and mine the atmosphere for materials to steadilly expand the habitat, without ever touching the hellish surface. side effect would be to reduce the atmospheric pressure, which is a bonus for long term terraforming.\u003C/p\u003E\u003Cp\u003EStill no -reason- to go, but we could go there and stay if we wanted to.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-02-04T12:05:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EAs you have stated the problem with VASIMR is that it needs the electricity of a small city to run. But then all the high ISP technology requires nuclear. The difference is that with NERVA the uranium is inexorably tied to a rocket and is preinserted, and accident in low earth orbit or below is a nuclear accident. In nuclear powerplants the fuel rods can be inserted after stable orbit is reached can be packed in graphite and kept separate until that point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow make one step further - what if we could mine the nuke-fuel somewhere else than Earth?\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2015-02-04T14:02:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003ENow make one step further - what if we could mine the nuke-fuel somewhere else than Earth?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUranium mines are several hundred feet deep, and usually strip pit mines. \u003C/p\u003E\u003Cp\u003EThen you need to refine it; a process that requires very energy-hungry, very precise centrifuges. \u003C/p\u003E\u003Cp\u003EHow are we doing that in space any time soon?\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-02-04T17:33:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EPoint of order- there are entire threads on this forum about how to manage a venus habitat and mine the atmosphere for materials to steadilly expand the habitat, without ever touching the hellish surface. side effect would be to reduce the atmospheric pressure, which is a bonus for long term terraforming.\u003Cp\u003EStill no -reason- to go, but we could go there and stay if we wanted to.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is nothing you can get on Venus atmosphere that you couldn\u0027t as easily get from a near earth asteroid or earth (Much much easier). For the most part until you have a stationary colony you don\u0027t need carbon, because it takes minerals (as in metal and substrate) to build the capacity to expand, you need oxygen more than carbon because oxygen is a carbon sink for all the expendables that reach the station. Energy is alot more easily obtained at Venus orbit, but that orbit does not need to be close to Venus, it could be on an asteroid that is near to Venus. \u003C/p\u003E\u003Cp\u003ETo even think about terraforming Venus you would need a radiation shield at the Lagrangian Venus-Sun position that removed more than 2/3 of insolance, and at the initial more than 90% since venus has a problem with heat conservation as well as being hot. Given that the Venus radius is 3760 and sun is 395,000 km, and the Lagrangian point is more than 1 million miles we can estimate that a completely blocking sheild would need to cover a radius of 8000 km. At a 2/3rds coverage its around 6500 km. The weight of 1 m^2 of 1 mil plastic is around .025 Kg. The area of coverage is 132732600000000 x 0.025 = 3 x 10^12 Kg this is not including the weight of the embedded reflectors or the structure holding the plastic, more or less its 10^13 mass that would need to be maintained at the Lagrangian in rotation along all three axis sufficient to keep the reflector deployed and facing the sun. Thats a pretty big plastic refinery floating around in the Venuses upper atmosphere. In addition Venus\u0027s future is bright, very bright and red, solar radiation will increase to the point that it will prolly start loosing the lighter elements in its atmosphere (if it already has not lost water and hydrogen).\u003C/p\u003E\u003Cp\u003E It is easier to mine low gravity objects in space than to deal with the graved hostile celestials. 67P will gradually move toward the inner solar system, and we have shown (snickering) that we can land (and easily bounce off) such wanderers. All we have to do is make them stop wandering. A better choice than Mars would be either of its two moons. Phobos ag = 0.0057 m/s, Deimos 0.003 m/s. Steal this asteroid from mars and park in an orbit of choice or leave it on mars. \u0022Deimos is composed of rock rich in carbonaceous material, much like C-type \u003Ca href=\u0022https://en.wikipedia.org/wiki/Asteroid\u0022 rel=\u0022external nofollow\u0022\u003Easteroids\u003C/a\u003E and \u003Ca href=\u0022https://en.wikipedia.org/wiki/Carbonaceous_chondrite\u0022 rel=\u0022external nofollow\u0022\u003Ecarbonaceous chondrite\u003C/a\u003E meteorites.\u0022.....\u0022It has an \u003Ca href=\u0022https://en.wikipedia.org/wiki/Escape_velocity\u0022 rel=\u0022external nofollow\u0022\u003Eescape velocity\u003C/a\u003E of 5.6 m/s\u0022. If you park your colonist here, you can bring them back home, and they can make excursions to Deimos to study mars-like planet.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EUranium mines are several hundred feet deep, and usually strip pit mines. Then you need to refine it; a process that requires very energy-hungry, very precise centrifuges. \u003Cp\u003EHow are we doing that in space any time soon?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUranium gravitates toward the earths core. It is expected that asteroid derived from impacted small bodies or small bodies that never underwent accretion driven melting would have Uranium more evenly distributed throughout, and easier to access. Centrifuges can be brought from earth and energy from solar, but isolation of Uranium from other elements is not an easy task. The assumption is that while isolating one metal you will also get other useful metals (like iron, copper, nickle, aluminum, chrome) and that you can use these to expand. I think a more useful goal early game is to recycle space junk in space and build stuff. The graveyard orbit for many satellites is only a few dV from escape velocity. Some of these have radioactive sources. I am not advocating Asteroid mining, I am only saying that they are better choices than the planet alternative. I have a big problem for space exploration if the next manned mission after ISS is a suicide mission. The first best choice is to show that we can do the moon thing again, cause it appears that our space program is no very efficient at doing things it once routinely did 40 years ago.\u003C/p\u003E\u003Cp\u003EWe need new parts for the game.\u003C/p\u003E\u003Cp\u003E1. A space junk grabber (Rollable chain-link fencing with radial arms that can extend and wrap around rotating junk\u003C/p\u003E\u003Cp\u003E2. a recycler. \u003C/p\u003E\u003Cp\u003E3. a smelter forge\u003C/p\u003E\u003Cp\u003E4. Part assembler\u003C/p\u003E\u003Cp\u003EThen\u003C/p\u003E\u003Cp\u003E5. Crude mineral processor\u003C/p\u003E\u003Cp\u003EWe can use our science points on these.\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-02-06T01:35:07Z","Content":"\n\u003Cp\u003EWould an earth ceres cycler be possible?\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-02-06T02:46:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linkxsc\u0022 data-cite=\u0022linkxsc\u0022\u003E\u003Cdiv\u003EWould an earth ceres cycler be possible?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETheoretically, yes.\u003C/p\u003E\u003Cp\u003EPractically, that\u0027s another story.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-02-06T03:10:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linkxsc\u0022 data-cite=\u0022linkxsc\u0022\u003E\u003Cdiv\u003EWould an earth ceres cycler be possible?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe earth ceres Syndic period is 1.278 years. A first order approximation (with a lot of corrective burns each orbit) would suggest that you could get away with 4 outbound and 4 inbound cyclers, and need to adjust their orbits by .028x360 degrees per year (about 10 degrees, by my math)\u003C/p\u003E\u003Cp\u003EFor a more efficent cycler system, you need orbits tha are 100 degrees appart each year. Counting on my metaphorical fingers, here...\u003C/p\u003E\u003Cp\u003E0 degrees\u003C/p\u003E\u003Cp\u003E100 degrees\u003C/p\u003E\u003Cp\u003E200 degrees\u003C/p\u003E\u003Cp\u003E300 degrees\u003C/p\u003E\u003Cp\u003E40 degrees\u003C/p\u003E\u003Cp\u003E140\u003C/p\u003E\u003Cp\u003E240\u003C/p\u003E\u003Cp\u003E340\u003C/p\u003E\u003Cp\u003E80\u003C/p\u003E\u003Cp\u003E180\u003C/p\u003E\u003Cp\u003E280\u003C/p\u003E\u003Cp\u003E20\u003C/p\u003E\u003Cp\u003E120\u003C/p\u003E\u003Cp\u003E220\u003C/p\u003E\u003Cp\u003E320\u003C/p\u003E\u003Cp\u003E60\u003C/p\u003E\u003Cp\u003E160\u003C/p\u003E\u003Cp\u003E260\u003C/p\u003E\u003Cp\u003E-back to start at 360-\u003C/p\u003E\u003Cp\u003E18 cyclers with only .08 degrees of course correction per year.\u003C/p\u003E\n"}]}