{"TopicId":92402,"ForumId":44,"TopicTitle":"Relatavistic Impactors : would the craters be radioactive?","CreatedByName":"EzinX","CreatedById":118288,"CreatedDateTime":"2014-12-09T20:16:14Z","PageNum":1,"Articles":[{"CreatedByName":"EzinX","CreatedById":118288,"CreatedDateTime":"2014-12-09T20:16:14Z","Content":"\n\u003Cp\u003ESuppose a group of beings with advanced technology decided to bombard earth. Rather than using fission/fusion bombs, they use a mass driver so long and powerful that the projectiles exiting it travel at 0.99c . The projectiles are iron slugs.\u003C/p\u003E\u003Cp\u003ESince any object made of matter traveling above 86% of the speed of light has more energy than the equivalent mass in antimatter, how would this terrible energy be expressed upon impact? Would it cause spontaneous fusion or fission between the matter it impacts? Would the neutrons released cause enough neutron activation to be significant? \u003C/p\u003E\u003Cp\u003ETo throw in some numbers, each projectile has 100 megatons of kinetic energy relative to the earth.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-12-09T20:24:00Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://what-if.xkcd.com/1/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://what-if.xkcd.com/1/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI guess that means yes. There would be a lot of radioactivity - not that it would matter to anyone anymore.\u003C/p\u003E\n"},{"CreatedByName":"sndrtj","CreatedById":110589,"CreatedDateTime":"2014-12-09T20:34:06Z","Content":"\n\u003Cp\u003EThat suggests the iron slugs wouldn\u0027t get much further than the upper atmosphere. Interesting thought.\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2014-12-09T20:34:45Z","Content":"\n\u003Cp\u003Ei think what you would basically get in that situation is the equivalent of a short-lived omnidirectional particle collider beam, with a gamma ray burst followed immediately by any matter around the impact site being packed with enough energy to ignite a whole chain of exotic particle interactions. you wouldn\u0027t just get radioactive events, you\u0027d get a whole zoo of particle and nuclear physics events, many of which humanity would likely have never been able to observe before (or ever again). what it would do to ground zero in the medium or long term i can hardly imagine but i think it\u0027s fair to assume there would be unstable radioactive species amongst the debris.\u003C/p\u003E\n"},{"CreatedByName":"EzinX","CreatedById":118288,"CreatedDateTime":"2014-12-09T20:46:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sndrtj\u0022 data-cite=\u0022sndrtj\u0022\u003E\u003Cdiv\u003EThat suggests the iron slugs wouldn\u0027t get much further than the upper atmosphere. Interesting thought.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPresumably you could adjust the slug speeds so that time dilation keeps them cohesive until they reach the lower atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-12-09T20:56:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EzinX\u0022 data-cite=\u0022EzinX\u0022\u003E\u003Cdiv\u003EPresumably you could adjust the slug speeds so that time dilation keeps them cohesive until they reach the lower atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think time dilation has anything to do with it. The slugs would get eaten away by the air molecules just like the baseball. The solution is larger slugs.\u003C/p\u003E\n"},{"CreatedByName":"EzinX","CreatedById":118288,"CreatedDateTime":"2014-12-09T21:08:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EdFred\u0022 data-cite=\u0022EdFred\u0022\u003E\u003Cdiv\u003EI don\u0027t think time dilation has anything to do with it. The slugs would get eaten away by the air molecules just like the baseball. The solution is larger slugs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom the slug\u0027s reference frame, their encounters with the air molecules take the same amount of time as always to resolve, converting the slugs to gas and then probably subatomic particles.\u003C/p\u003E\u003Cp\u003EBut from the earth\u0027s reference frame, the slugs take longer to break up.\u003C/p\u003E\n"},{"CreatedByName":"sndrtj","CreatedById":110589,"CreatedDateTime":"2014-12-09T21:13:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EzinX\u0022 data-cite=\u0022EzinX\u0022\u003E\u003Cdiv\u003EFrom the slug\u0027s reference frame, their encounters with the air molecules take the same amount of time as always to resolve, converting the slugs to gas and then probably subatomic particles.\u003Cp\u003EBut from the earth\u0027s reference frame, the slugs take longer to break up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat also means the ball, from Earth\u0027s reference frame, can interact (because interaction takes time from the ball\u0027s reference frame!) with air molecules only at a slower rate.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-12-09T21:17:38Z","Content":"\n\u003Cp\u003EI think the Tunguska event might be a good starting point to imagine what would happen.\u003C/p\u003E\u003Cp\u003EIt has been estimated to have release around 15 Megatons of energy.\u003C/p\u003E\u003Cp\u003EIt can\u0027t be confirmed, but there were a number of unusual deaths that were similar to radiation exposure, electromagnetic pulse like anomalies and reports of compass not working for a time.\u003C/p\u003E\u003Cp\u003EI think it would be completely vaporized in the air almost instantly and hitting the ground wouldn\u0027t really matter.\u003C/p\u003E\u003Cp\u003EIn fact, air bursting weapons do more damage over a larger area. \u003C/p\u003E\u003Cp\u003EI\u0027m guessing the fusion reaction would be cleaner than what you would see with a fusion bomb.\u003C/p\u003E\u003Cp\u003EYou might even want to look at the Tsar Bomba atomic test that air burst a weapon of up to 58 megatons.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E I wonder if making the slugs out of cobalt would make any difference in the fallout?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-09T21:21:00Z\u0022 title=\u002212/09/2014 09:21  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 9, 2014\u003C/time\u003E by Tommygun\u003C/strong\u003E\n\u003C/span\u003E\n"}]}