{"TopicId":93905,"ForumId":44,"TopicTitle":"Nasa is considering a Manned Mission to Venus before Mars!","CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-12-20T21:38:24Z","PageNum":11,"Articles":[{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2015-04-25T05:54:22Z","Content":"\n\u003Cp\u003Ewell said, RedPine. \u003C/p\u003E\u003Cp\u003EI\u0027m not working in science at the moment, but saw the signs on the wall even while doing grad work 20 years ago.\u003C/p\u003E\u003Cp\u003EGuy in the next office over was doing environmental research, not atmospheric but relating to the dispersal of nuclear waste seepage from reactor cores and waste dumped in the Barentz sea.\u003C/p\u003E\u003Cp\u003EHis (and he wasn\u0027t alone, it was a multinational, multidisciplinary study performed on UN, EA, and Russian Academy of Sciences grants) results contradicted the alarmist headlines about how those dump sites were polluting the oceans for thousands of miles around, destroying fishing all over the north Atlantic because of the massive amounts of radioactive materials leaking into the oceans.\u003C/p\u003E\u003Cp\u003EInstead he found that within a few hundred meters, in extreme theoretical cases like sudden total containment failure a few kilometers, the dispersal of the spill would be so rapid that there\u0027d be no risk to wildlife, humans in the area, or anything, that within a few tens of kilometers there were no detectable levels of contamination or radiation.\u003C/p\u003E\u003Cp\u003EHe found it impossible to publish the study. None of the publishing houses would accept it, even though it was heavily peer reviewed and verified independently by multiple other groups.\u003C/p\u003E\u003Cp\u003EWhen asked, one publisher came clean and stated bluntly that they would not publish anything that contradicted the official agenda from the environmental movement because it would be financial suicide for them, would lead to their main income stream (subsidies and sponsorships from environmental groups and \u0022scientists\u0022 and government agencies controlled by them) drying up.\u003C/p\u003E\u003Cp\u003EAnd that\u0027s been the case ever since from what I understand from scientists and engineers I have contact with. Try getting anything published that doesn\u0027t conform to the alarmist agenda and you\u0027re ostracised, lose your funding, lose your job, and likely end up with death threats (which sometimes are acted on, people have ended up dead or injured in attacks on themselves, their lives, and their property for daring to speak out against the environmentalist alarmist crowd).\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-04-25T07:17:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RedPine\u0022 data-cite=\u0022RedPine\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhen mass media, politicians, and forum readers like you guys claim that we meteorologists \u0022know\u0022 that global warming is happening, I feel a little offended. Nobody asked me about my opinion, instead they pay university researchers millions of dollars to study global warming, ask those researchers for their opinion on global warming, and then stop funding those researchers if they deny global warming.\u003C/p\u003E\u003Cp\u003EYou guys claiming to know that meteorologists like me believe in global warming is like you guys claiming to know what NASA scientists believe in sending people to other planets. The world of space travel is far more complicated than layman like us understand, especially since the experts don\u0027t fully understand the complicated issues either.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003EHe found it impossible to publish the study. None of the publishing houses would accept it, even though it was heavily peer reviewed and verified independently by multiple other groups.\u003Cp\u003EWhen asked, one publisher came clean and stated bluntly that they would not publish anything that contradicted the official agenda from the environmental movement because it would be financial suicide for them, would lead to their main income stream (subsidies and sponsorships from environmental groups and \u0022scientists\u0022 and government agencies controlled by them) drying up.\u003C/p\u003E\u003Cp\u003EAnd that\u0027s been the case ever since from what I understand from scientists and engineers I have contact with. Try getting anything published that doesn\u0027t conform to the alarmist agenda and you\u0027re ostracised, lose your funding, lose your job, and likely end up with death threats (which sometimes are acted on, people have ended up dead or injured in attacks on themselves, their lives, and their property for daring to speak out against the environmentalist alarmist crowd).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think there\u0027s quite a bit to be said here. While I, personally, do not believe the \u0022alarmist agenda\u0022, I do feel that their message is often lost as they cling to the extremes. \u0022What are we doing to the environment.\u0022 The truth... probably isn\u0027t that interesting to people with the changes, if any, affecting the non-human inhabitants more than the human inhabitants and only after a much longer period of time than people think about.\u003C/p\u003E\u003Cp\u003ENuclear waste is absolutely disgusting stuff; and the effects it can have on PEOPLE is terrifying. Sure, the likelihood of incident may be 0.001% (It may be far lower than this while still being non-zero.) That 0.001% somehow matters more than the 99.999% chance of nothing happening... and getting people to talk about some 0.001% chance, something that seems insignificant, ends up happening only if you bring it up to 100% chance and start making people scared of something happening.\u003C/p\u003E\u003Cp\u003EI don\u0027t doubt that they come to believe the insanity. Undetectable nuclear waste, hurricanes that destroy a country, the world flooding with water and leaving only a spec of land around Mt. Everest. Lie often enough, and you will come to believe your own lies. I just feel that the message behind it all isn\u0027t terrible; though it could do without the whole \u0022we\u0027re gonna kill each other off if we don\u0027t switch to renewable energy\u0022\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2015-04-25T12:13:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fel\u0022 data-cite=\u0022Fel\u0022\u003E\u003Cdiv\u003ENuclear waste is absolutely disgusting stuff; and the effects it can have on PEOPLE is terrifying. Sure, the likelihood of incident may be 0.001% (It may be far lower than this while still being non-zero.) That 0.001% somehow matters more than the 99.999% chance of nothing happening... and getting people to talk about some 0.001% chance, something that seems insignificant, ends up happening only if you bring it up to 100% chance and start making people scared of something happening.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve worked in nuclear research, on nuclear waste classification issues (in fact I graduated on the study of classifying nuclear waste).\u003C/p\u003E\u003Cp\u003EYou might be surprised to hear that a lot of things classify as nuclear waste that you\u0027d never even consider to be such. Things like sludge flushed from the burners of coal fired powerplants.\u003C/p\u003E\u003Cp\u003EThings like the clothes of lab technicians working with radio pharmaceuticals.\u003C/p\u003E\u003Cp\u003EAnd silly enough, a lot of our nuclear waste could be condensed into far smaller volumes, separated out by range of half life values, and stored or processed into other things depending on that.\u003C/p\u003E\u003Cp\u003EBut it\u0027s illegal to do so, even as (or rather because) doing so would reduce the amount of waste in long term storage by 95% or so.\u003C/p\u003E\u003Cp\u003EThe vast majority of \u0022nuclear waste\u0022 isn\u0027t, it\u0027s just whatever else was in the batch of material that contained that radioactive material. And that goes even for exhausted reactor fuel. If we separated out the \u0022hot\u0022 components, with half lives of a few years to decades at most, and stored those separate for that period of time, nuclear waste disposal would become a lot cheaper and more manageable, but it\u0027s illegal because of laws pushed by the anti-nuclear lobby in the 1970s that used the fear of anything nuclear as their sole argument.\u003C/p\u003E\u003Cp\u003EThe spent Uranium and other elements in that waste can be either reprocessed into new fuel elements, handled as chemical waste (it\u0027s not much over background radiation levels, if at all), or used as raw materials for other stuff. For example the steel that could be recovered from those fuel elements could easily be smelted down and used for underwater construction projects where the slightly increased radiation levels (if at all) are irrelevant.\u003C/p\u003E\u003Cp\u003EMind, I\u0027m not saying the USSR dumping those reactor cores in the relatively shallow Barentz sea, in direct violation btw of international treaties they had signed and ratified, was a good idea. But it\u0027s a far better idea than storing them on land, in unguarded warehouses where every wannabe nuclear terrorist can just walk in with a bucket and collect some of it to turn into a dirty bomb (which sadly was and in part still is the status of nuclear materials security in the late USSR and in Russia).\u003C/p\u003E\u003Cp\u003EAt least now anyone wanting to steal the stuff has to rent a submarine and support ship, which is far harder to hide and a lot more expensive.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-25T15:17:37Z","Content":"\n\u003Cp\u003ETry to not derail the topic.. global warming and climate models are kinda related to this mission so is not problem.. Nuclear talks not so much.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RedPine\u0022 data-cite=\u0022RedPine\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis is my personal experience and might not be representative of my field but... look, my job revolves around pattern recognition using images, graphs, and text. If it were easy to prove global warming did or didn\u0027t exist using scientific evidence, the debate would have ended long ago. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou may find pattern in weather with that, not on climate.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso, meteorologists don\u0027t understand clouds. I\u0027m not joking, we really don\u0027t. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI pointed this in this topic, but is more related on the reflective effect than clouds had.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhen mass media, politicians, and forum readers like you guys claim that we meteorologists \u0022know\u0022 that global warming is happening, I feel a little offended. Nobody asked me about my opinion, instead they pay university researchers millions of dollars to study global warming, ask those researchers for their opinion on global warming, and then stop funding those researchers if they deny global warming.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou research for weather or climate? To study global warming you need to take the average world temperatures, the co2, methane and different global values parameters depending its location on the globe and compare it with previous world average data.\u003C/p\u003E\u003Cp\u003EIs not about weather.. is about climate.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou guys claiming to know that meteorologists like me believe in global warming is like you guys claiming to know what NASA scientists believe in sending people to other planets. The world of space travel is far more complicated than layman like us understand, especially since the experts don\u0027t fully understand the complicated issues either.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI was in a seminar last year, it was a geologist talking about earth history and he also talk about global warming. He did not believe in global warming, then after the seminar I exchange mails with him to discuss about that.\u003Cp\u003EWhat was super clear, that all its hypothesis were based on inaccurate data, some times just picking evidences and ignoring the ones that point in opposite way.\u003C/p\u003E\u003Cp\u003EHis bigger error was to claim that the CO2 emitted by volcanos was much more higher than the caused by human activity.. When in fact is all the opossite, the co2 emitted by us is 100 times greater than by natural causes. He also claim that the heat wasted of all our machines was the cause of the higher temperatures. But if you do the math, even converting all the energy used in the world as waste heat, that amount of heat is nothing in comparison with the needed to rise the world temperature. But if you use the actual co2 and other gases values to calculate the increase in temperature, then all numbers match.\u003C/p\u003E\u003Cp\u003EHere there is a good resume:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/OWXoRSIxyIU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhen asked, one publisher came clean and stated bluntly that they would not publish anything that contradicted the official agenda from the environmental movement because it would be financial suicide for them, would lead to their main income stream (subsidies and sponsorships from environmental groups and \u0022scientists\u0022 and government agencies controlled by them) drying up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you are saying that the 2% of the energy players who just barely enter in play few years ago with huge waste of money in development to try to compete with a world already ruled by fossil fuels.. You are saying that these 2% of people had the money to buy the 98.5% of the climate scientist? Meanwhile all the fossil players (90% of the energy sources) who won money all these years and they keep doing it, are \u0022victims\u0022 of the injustice propaganda that came from the other 2%?????\u003C/p\u003E\u003Cp\u003EPlease.. use your common sense..\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd that\u0027s been the case ever since from what I understand from scientists and engineers I have contact with. Try getting anything published that doesn\u0027t conform to the alarmist agenda and you\u0027re ostracised, lose your funding, lose your job, and likely end up with death threats ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was true.. but it was all around.. The first scientist blamming the fossil fuels were persecuted.. But the true always win.. The overwhelming evidence can not be stopped.. that is why global warming is a fact supported by 99% of scientist that study this phenomenon.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-25T15:46:53Z\u0022 title=\u002204/25/2015 03:46  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 25, 2015\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-04-25T17:06:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fel\u0022 data-cite=\u0022Fel\u0022\u003E\u003Cdiv\u003EI think there\u0027s quite a bit to be said here. While I, personally, do not believe the \u0022alarmist agenda\u0022, I do feel that their message is often lost as they cling to the extremes. \u0022What are we doing to the environment.\u0022 The truth... probably isn\u0027t that interesting to people with the changes, if any, affecting the non-human inhabitants more than the human inhabitants and only after a much longer period of time than people think about.\u003Cp\u003ENuclear waste is absolutely disgusting stuff; and the effects it can have on PEOPLE is terrifying. Sure, the likelihood of incident may be 0.001% (It may be far lower than this while still being non-zero.) That 0.001% somehow matters more than the 99.999% chance of nothing happening... and getting people to talk about some 0.001% chance, something that seems insignificant, ends up happening only if you bring it up to 100% chance and start making people scared of something happening.\u003C/p\u003E\u003Cp\u003EI don\u0027t doubt that they come to believe the insanity. Undetectable nuclear waste, hurricanes that destroy a country, the world flooding with water and leaving only a spec of land around Mt. Everest. Lie often enough, and you will come to believe your own lies. I just feel that the message behind it all isn\u0027t terrible; though it could do without the whole \u0022we\u0027re gonna kill each other off if we don\u0027t switch to renewable energy\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E0.001% of the time it happens 100% of the time.\u003C/p\u003E\u003Cp\u003EWhich is still 0.001%, after all.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2015-04-25T17:06:47Z","Content":"\n\u003Cp\u003Efollow the money trail, kid. The global warming crowd has an order of magnitude more money than everyone else combined. \u003C/p\u003E\u003Cp\u003EOf course your highly indoctrinated mind, flooded with \u0022evil Big Oil\u0022, \u0022Big Coal\u0022, etc. etc. can\u0027t grasp that.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-04-25T17:09:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Efollow the money trail, kid. The global warming crowd has an order of magnitude more money than everyone else combined. \u003Cp\u003EOf course your highly indoctrinated mind, flooded with \u0022evil Big Oil\u0022, \u0022Big Coal\u0022, etc. etc. can\u0027t grasp that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWho is that aimed towards?\u003C/p\u003E\u003Cp\u003EOil companies and similar entities do support those who deny climate change...\u003C/p\u003E\u003Cp\u003EBut climate change happens anyways, so...\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-04-25T17:22:00Z","Content":"\n\u003Cp\u003EI see it like littering. Yes, the world wont end if we dont clean up our Co2 emissions, but if we dont start picking up our trash, or paying someone to pick up our trash, or making less trash to start with, the world will start to resemble a landfill. And THAT\u0027s when the dire predictions start coming into play, the global equivilant of catching bubonic plague from the rats in the trash all around us. We need to do something, or we deserve what we end up with.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-04-25T17:46:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Efollow the money trail, kid. The global warming crowd has an order of magnitude more money than everyone else combined. \u003Cp\u003EOf course your highly indoctrinated mind, flooded with \u0022evil Big Oil\u0022, \u0022Big Coal\u0022, etc. etc. can\u0027t grasp that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry but your little green guys conspiracy has not base or evidence to support it. In fact all the evidence point 100% to the contrary from any angle.\u003C/p\u003E\u003Cp\u003EOne more things, scientist compete between them all the time.. the best achievement that a scientist can do is prove everybody else wrong. But in this case there is a 98.5% of agreement and that % is rising...\u003C/p\u003E\u003Cp\u003EThe same as the sea levels.\u003C/p\u003E\u003Cp\u003EOk.. to those who wanna keep talking of global warming conspiracies they can make a new thread or use those already made it for that. Because the relation with Venus is due the potential that it has to improve our climate models, and it will do it even if there is not global warming.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-04-25T19:16:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EOk.. to those who wanna keep talking of global warming conspiracies they can make a new thread or use those already made it for that. Because the relation with Venus is due the potential that it has to improve our climate models, and it will do it even if there is not global warming.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI respect your wish, AngelLestat, but I hope you\u0027ll allow me to point out a problem with RedPine\u0027s post that may not be clear to some. I realise that you have touched on it already but I wanted to highlight it:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RedPine\u0022 data-cite=\u0022RedPine\u0022\u003E\u003Cdiv\u003EI\u0027d like to clear up a misconception about my field, meteorology (the real kind that airplanes use, not the weather channel or scientists). \u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EWhen mass media, politicians, and forum readers like you guys claim that we meteorologists \u0022know\u0022 that global warming is happening, I feel a little offended. Nobody asked me about my opinion, instead they pay university researchers millions of dollars to study global warming, ask those researchers for their opinion on global warming, and then stop funding those researchers if they deny global warming.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERedPine is making an argument from authority. He (I assume RedPine is a he) is a meteorologist but not just any meteorologist. He\u0027s an aviation meteorologist! He claims to share an opinion with all of the aviation meteorologist colleagues with whom he works. \u003C/p\u003E\u003Cp\u003ETrouble is that meteorology does not equal climatology. Being qualified to forecast changes in weather does not necessarily qualify one to forecast changes in climate. That and the accusations of a conspiracy in academia, and in particular the field of climatology, is ridiculous. \u003C/p\u003E\u003Cp\u003EIf RedPine were a climatologist and backed up his argument with data that solidly refuted the vast body of evidence that supports the existence of climate change, I and many others would listen. As it is, the argument in his post is nothing more than an unscientific logical fallacy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-27T14:53:47Z\u0022 title=\u002204/27/2015 02:53  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 27, 2015\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003Cbr\u003EOn sober second thought, removed an ad hominem\n\u003C/span\u003E\n"},{"CreatedByName":"RedPine","CreatedById":95532,"CreatedDateTime":"2015-04-30T01:47:06Z","Content":"\n\u003Cp\u003EThe nuclear waste guys will get a kick out of the carbon dating scandals, if they don\u0027t know about it already. \u003Ca href=\u0022http://newgeology.us/presentation48.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://newgeology.us/presentation48.html\u003C/a\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ERedPine is making an argument from authority. He (I assume RedPine is a he) is a meteorologist but not just any meteorologist. He\u0027s an aviation meteorologist! He claims to share an opinion with all of the aviation meteorologist colleagues with whom he works. \u003C/p\u003E\u003Cp\u003ETrouble is that meteorology does not equal climatology...the argument in his post is nothing more than an unscientific logical fallacy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am very well aware of the gaps in my weather education. I do know, however, that when a 200 year old science we barely understand, is presented to the public who doesn\u0027t understand weather at all, a little... \u0022simplification\u0022 and \u0022generalization\u0022 takes place. Depending on how you simplify the raw data, we can prove or disprove global warming on a whim. If you have taken a class on statistics, I think you can understand how you can \u0022honestly\u0022 lie with \u0022real\u0022 data.\u003C/p\u003E\u003Cp\u003EThat\u0027s why I choose to look at global warming from a political/economic point of view. It makes things so much easier to understand.\u003C/p\u003E\u003Cp\u003EType of Meteorologist---\u002B-Believes in Global Warming?--\u002B-Paid to Believe in Global Warming?--\u002B----Actually Studies Global Warming \u003C/p\u003E\u003Cp\u003E------------------------\u002B-----------------------------\u002B-----------------------------------\u002B---------------------------------- \u003C/p\u003E\u003Cp\u003EAviation Meteorologist---\u002B---------------No------------\u002B--------------------No------------\u002B---------------No-----------------\u003C/p\u003E\u003Cp\u003ETV Forecaster-----------\u002B-------Half Yes, Half No------\u002B-----------------I Don\u0027t Know------\u002B------------I Don\u0027t Know----------\u003C/p\u003E\u003Cp\u003EResearcher/Student------\u002B--------------Yes-----------\u002B--------------------Yes------------\u002B--------------Yes----------------\u003C/p\u003E\u003Cp\u003E\u0022If itÃ¢â‚¬â„¢s consensus, it isnÃ¢â‚¬â„¢t science. If itÃ¢â‚¬â„¢s science, it isnÃ¢â‚¬â„¢t consensus. Period.... Consensus is invoked only in situations where the science is not solid enough. Nobody says the consensus of scientists agrees that E = mcÃ‚Â².\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Well, I think we can all at least agree that meteorology is not a \u0022solid\u0022 science. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E (except hail, snow, volcanic ash, etc.) In any case, since both aviation meteorologists and climatology researches supposedly have 100% consensus, both groups should be ignored. Get your opinion from the daily TV weather guy instead.\u003C/p\u003E\u003Cp\u003EBringing the discussion back to Venus, studying Venusian weather - although fascinating - will have the same if not worse problems than with studying earth weather. Last I checked, weather models go off of weather balloons, not satellite images - so attempting to model Venus would require sending thousands of balloons throughout the Venusian atmosphere that would have to survive at least a year of extraterrestrial turbulence, chemicals, and radiation. Studying Venus would be fascinating, but by the time we figure out how to study Venus we will already have tools needed to understand our own planet without the need for extraplanetary exploration. Tools like, satellite soundings, satellite calibrated models, and quantum/photon/organic computer models, are all already in the prototype stage. Wait 20 years and we will have an unprecedented understanding of our atmosphere. \u003C/p\u003E\u003Cp\u003EThe benefit to be gained from studying Venus is a complete unknown. There is no tried and proven way to profit from going into the void. We can\u0027t go into an adventure like a Venus mission thinking that we already know what we will find when we get there.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2015-04-30T02:05:49Z","Content":"\n\u003Cp\u003EYour table is wrong, and the last column shows why you have no authority on the subject. Studies intended to disprove global warming have confirmed it. Every single time. Recently there\u0027s only been ONE author rejecting global warming, of over 12000.\u003C/p\u003E\u003Cp\u003EScientific consensus is the easiest way of finding the correct answer. Of course, one should still look at the data - which, by the way, shows a clear warming trend, correlating strongly with the level of CO2 in the atmosphere.\u003C/p\u003E\u003Cp\u003EIf it\u0027s consensus, it\u0027s settled science. If it\u0027s not consensus, it\u0027s not.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-04-30T04:34:35Z","Content":"\n\u003Cp\u003ENothing posted in this thread has had anything to do with the topic for days now. Time to put it out of its misery.\u003C/p\u003E\n"}]}