{"TopicId":126024,"ForumId":148,"TopicTitle":"Forum Migration Nov 27th!","CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2015-11-21T00:01:03Z","PageNum":10,"Articles":[{"CreatedByName":"ModZero","CreatedById":89470,"CreatedDateTime":"2015-11-21T09:37:29Z","Content":"\nHm, so, have you considered Discourse? I don\u0026#39;t mean \u0022OMG change decision 6 days before pulling the trigger\u0022, I\u0026#39;m just occasionally involved in picking such things, and wondering if other people doing that found reasons to avoid it besides \u0022it\u0026#39;s not PHP\u002BMySQL\u0022 (which is quite a big one in itself).\u003Cbr\u003E\n\u003Cbr\u003E\nI do like the new layout, by thee way, and if it\u0026#39;s actually usable on phones, that\u0026#39;d be great.\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2015-11-21T09:39:20Z","Content":"\n[quote name=\u0027stibbons\u0027]I don\u0026#39;t have an RB thread. :) And was asking if there was a simpler way to do that for a large number of a posts, just in case. Was hoping for, say, a BB code export, but can make do with just saving the pages. Thanks.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nWell my problem is I have a 250 page thread with all my craft releases, descriptions, developments, on it. And i have a 390 page thread that got locked that has all my old craft time-capsuled away that I still go back to and download and update occasionally. If this goes away I lose all my old data because it\u0026#39;s pretty much gone on my PC (or at least the old screenshots are, I started Zokesia before I got my new computer).\n"},{"CreatedByName":"JPLRepo","CreatedById":114736,"CreatedDateTime":"2015-11-21T09:55:18Z","Content":"\nI tried a search and read most of this thread.. but a question I didn\u0026#39;t see an answer for..\u003Cbr\u003E\nSo the old blogs will disappear altogether? I rather like going over some of the old dev blogs and toher modders blogs. Is there any way to save them except if I take a local copy?\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-11-21T10:02:33Z","Content":"\nAre craft repositories still allowed like Cupcake\u0026#39;s Dropship Dealership and RSUV?\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;ll be very upset to see it go. So much work lost.\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-11-21T10:07:16Z","Content":"\nThe thing I don\u0026#39;t understand is that the \u0022role play\u0022 in Rocket Builders is almost never more than occasionally calling requests customers or a couple of sentences worth of back story. I\u0026#39;ve never seen it get argumentative and there\u0026#39;s rarely even more than one person involved.\u003Cbr\u003E\n\u003Cbr\u003E\nMost of the mission reports/fan works section seems to be at least as role-playey as rocket builders, and those threads aren\u0026#39;t deleted, in fact many become extremely popular.\u003Cbr\u003E\n\u003Cbr\u003E\nThis seems a really wierd reaction to a barely existent problem, less \u0022sledgehammer to crack a nut\u0022 and more \u0022nuking the nut farm because eventually some of them might need cracking\u0022.\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2015-11-21T10:11:53Z","Content":"\n[quote name=\u0027JPLRepo\u0027]I tried a search and read most of this thread.. but a question I didn\u0026#39;t see an answer for..\u003Cbr\u003E\nSo the old blogs will disappear altogether? I rather like going over some of the old dev blogs and toher modders blogs. Is there any way to save them except if I take a local copy?[/QUOTE]\u003Cbr\u003E\nYes, they\u0026#39;ll disappear. I guess the only way to keep them available to yourself is indeed to make a copy. \u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Frozen_Heart\u0027]Are craft repositories still allowed like Cupcake\u0026#39;s Dropship Dealership and RSUV?\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;ll be very upset to see it go. So much work lost.[/QUOTE]\u003Cbr\u003E\nDefinitely.\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-11-21T10:20:16Z","Content":"\nInterestingly enough, I\u0026#39;ve seen a lot of conflict in the spacecraft exchange too, as RevanCorana and other replica builders will tell you. Trolls will log on and criticize everything. I think Columbia had his b-17 treated the same way\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2015-11-21T10:23:26Z","Content":"\nGood to see you dropping vBulletin. v5 of the software was a disaster from the outset and the parent company has been driven the brand into the ground.\u003Cbr\u003E\n\u003Cbr\u003E\nManagement of v4 is not without its problems - especially given its legacy status and the fact that most modders have given up on the company.\u003Cbr\u003E\n\u003Cbr\u003E\nI think I would have preferred to see you go for XenForo, given the modding support that exists there, but if you\u0026#39;re wanting an easy vanilla install (which you appear to adhere to), IPB is probably the right choice.\u003Cbr\u003E\n\u003Cbr\u003E\nSurprised that you\u0026#39;re dropping blogs. IPB has that functionality. Have you considered the effect on self-serving threads?\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027BlueCanary\u0027]The thing I don\u0026#39;t understand is that the \u0022role play\u0022 in Rocket Builders is almost never more than occasionally calling requests customers or a couple of sentences worth of back story. I\u0026#39;ve never seen it get argumentative and there\u0026#39;s rarely even more than one person involved.\u003Cbr\u003E\n\u003Cbr\u003E\nMost of the mission reports/fan works section seems to be at least as role-playey as rocket builders, and those threads aren\u0026#39;t deleted, in fact many become extremely popular.\u003Cbr\u003E\n\u003Cbr\u003E\nThis seems a really wierd reaction to a barely existent problem, less \u0022sledgehammer to crack a nut\u0022 and more \u0022nuking the nut farm because eventually some of them might need cracking\u0022.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nPretty much.\u003Cbr\u003E\n\u003Cbr\u003E\nSometimes administrators enforce rules for the sake of simplicity, not necessarily because it will improve their community.\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-11-21T10:27:08Z","Content":"\n[quote name=\u0027KasperVld\u0027]Yes, they\u0026#39;ll disappear. I guess the only way to keep them available to yourself is indeed to make a copy. \u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nDefinitely.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nIn that case i beg you to immediately save those old dev blogs as an archive.\n"},{"CreatedByName":"Mat2ch","CreatedById":139755,"CreatedDateTime":"2015-11-21T10:38:15Z","Content":"\n[quote name=\u0027KasperVld\u0027]Rocket Builders is a place that actually breaks our community rules constantly, in particular the \u0026#39;thou shallt not roleplay\u0026#39; rule. You\u0026#39;re still welcome to offer the craft you make, or even take requests in the Spacecraft Exchange forum though, the only thing that will change is the \u0026#39;company\u0026#39; part of it, with the employee/director/ceo roles and inter-company drama that comes with it.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nUhm, I may be to new here, to know the answer to this question. But why not extend the rules to \u0022you may roleplay, but only in the rocketbuilders forum and in a thread and it has to be marked as roleplay\u0022 instead of taking away that particular forum? I just started a thread there to keep pictures of my achievments...\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2015-11-21T10:42:46Z","Content":"\n[quote name=\u0027Mat2ch\u0027]Uhm, I may be to new here, to know the answer to this question. But why not extend the rules to \u0022you may roleplay, but only in the rocketbuilders forum and in a thread and it has to be marked as roleplay\u0022 instead of taking away that particular forum? I just started a thread there to keep pictures of my achievments...[/QUOTE]\u003Cbr\u003E\nBecause we\u0026#39;ve seen many times that it will was not contained to those areas, both in Rocket Builders and in the old roleplay forums from way back when. We\u0026#39;re not on a witch hunt to destroy people\u0026#39;s work here, but rather we\u0026#39;re getting rid of an element of it (the roleplay) that has caused many issues.\n"},{"CreatedByName":"Mat2ch","CreatedById":139755,"CreatedDateTime":"2015-11-21T10:42:55Z","Content":"\n[quote name=\u0027Alshain\u0027]I can\u0026#39;t tell you how many times I\u0026#39;ve seen it. \u0022I wasn\u0026#39;t breaking the [insert rule here], I was just in character!\u0022 Roleplay is a headache.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nWell, this is like \u0022it wasn\u0026#39;t me, my account was hacked\u0022. The correct answer is: Your account broke the rules, deal with it.\u003Cbr\u003E\n\u003Cbr\u003E\nBut, I get it, I\u0026#39;ll loose my thread. And the spacecraft exchange is not a place to put it up again. It\u0026#39;s an exchange, I don\u0026#39;t want that part, it is too much hassle.\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-11-21T10:44:29Z","Content":"\n[quote name=\u0027KSK\u0027]I\u0026#39;ll be blunt - I don\u0026#39;t like the new look but then again I never did like this modern \u0026#39;white space and flat tiles\u0026#39; aesthetic. Call me a crusty old gamer if you like. Hopefully the new forum software will have a decent search function, which would be one very good reason for migrating in my opinion, despite the other problems already noted on this thread.\u003Cbr\u003E\n\u003Cbr\u003E\nRegarding Rocket Builders. I never used it so can\u0026#39;t really comment either way, but would it really be so hard to add it as an archived forum? It does seem very harsh to just delete it.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd on a final, personal, note, I do not like the decision to merge Live from Mission Control into Fanworks and respectfully request that this decision be reversed. Having a discrete sub forum for video gives the other fan works room to be recognised - I fear that merging the forums will mean that those other works simply become lost under a pile of video threads.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nI also dislike the new look. Far too flat.\u003Cbr\u003E\n\u003Cbr\u003E\nHaving said that, if the user gets a better experience feature wise I can\u0060t complain.\n"},{"CreatedByName":"CAKE99","CreatedById":150099,"CreatedDateTime":"2015-11-21T10:49:15Z","Content":"\n[quote name=\u0027KasperVld\u0027]We\u0026#39;re not on a witch hunt to destroy people\u0026#39;s work here, but rather we\u0026#39;re getting rid of an element of it (the roleplay) that has caused many issues.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nDeleting the entire subforum would be destroying peoples work.\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2015-11-21T10:53:48Z","Content":"\nI can understand if change needs to be made. The mods and admins have to do what the mods and admins have to do, particularly when it comes to the back end stuff which sucks away their time, and no-one wants them to suffer such a thankless task just for our amusement. A couple of questions though:\u003Cbr\u003E\n\u003Cbr\u003E\n1) I really like the look of the current forum compared to the new one. The new look just seems so sterile and I think it will turn off a lot of new users from looking at it. Can the new forum be skinned so it looks more like the old one?\u003Cbr\u003E\n\u003Cbr\u003E\n2) I didn\u0026#39;t really use the RB forum much. However, can people still make a \u0022my stuff\u0022 thread on the Spacecraft exchange provided it doesn\u0026#39;t do any of the role-playing aspects? Can they still ask for help from other members for certain builds or styles of builds?\u003Cbr\u003E\n\u003Cbr\u003E\nThanks.\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2015-11-21T11:02:11Z","Content":"\n[quote name=\u0027Redshift OTF\u0027]I can understand if change needs to be made. The mods and admins have to do what the mods and admins have to do, particularly when it comes to the back end stuff which sucks away their time, and no-one wants them to suffer such a thankless task just for our amusement. A couple of questions though:\u003Cbr\u003E\n\u003Cbr\u003E\n1) I really like the look of the current forum compared to the new one. The new look just seems so sterile and I think it will turn off a lot of new users from looking at it. Can the new forum be skinned so it looks more like the old one?\u003Cbr\u003E\n\u003Cbr\u003E\n2) I didn\u0026#39;t really use the RB forum much. However, can people still make a \u0022my stuff\u0022 thread on the Spacecraft exchange provided it doesn\u0026#39;t do any of the role-playing aspects? Can they still ask for help from other members for certain builds or styles of builds?\u003Cbr\u003E\n\u003Cbr\u003E\nThanks.[/QUOTE]\u003Cbr\u003E\nReskinning is definitely something we can look into, but it\u0026#39;s hard to please everyone. Plus having a new skin made is a sizeable investment in both time and money so that\u0026#39;s something that we have to discuss. As for your second question the answer is definitely yes.\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-11-21T11:04:00Z","Content":"\nWhat people need to understand in terms of UI design (Im referring to complaints about the new look) is that of course a computer screen is divided into pixels, Those pixels are squares, the result is that anything that attempts to be anything other than square in general shape or solid color ends up looking like minecraft, look closely at your start button if your running windows 7, its pretty from a distance but up close all that beauty divides up into ugly little squares, whereas the new design look deliberately glorifies squares and solid colors so as to make this ugly pixel effect dissipate into nothing, because honestly it does look better on lower res screens and is also easier to design in that it doesnt require a professional artist to make a single icon or massive amounts of RAM to display those glossy buttons of old. not to mention that they took away from app developers time what they could have used to make an app that was far more productive and efficient compared to a glossy shell.\u003Cbr\u003E\n\u003Cbr\u003E\nMicrosoft tried too hard with the gloss on windows vista, they wanted to highlight new features with a futuristic 3d look, but because they went too far with the look: those very features they had designed the look to highlight ended up being incomplete on the day vista shipped to consumers. Gloss does nothing more than slow down computers, take users attention away from the content itself leaving them all \u0022Oooh, aaaaahhh, Preeetty!\u0022 not to mention that the look exacerbated the existing pixel issue as well as reduce the quality of products because of the amount of time and work required to make even the simplest icons.\u003Cbr\u003E\n\u003Cbr\u003E\nI hope that helps the old timers realize that the new look is better, (Besides actually looking pretty cool) and easier on their machines.\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-11-21T11:18:11Z","Content":"\nI would be satisfied if the majority of old threads were archived, but I would like to see the KMC moved to the new spacecraft exchange. All I want to do is allow for it to be a place of a group craft archive, nothing RP and nothing hard to manage. Can the KMC get that?\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-11-21T11:30:16Z","Content":"\nWell, I better pack my bags and hope this goes smoothly. Good luck Kasper. :D\n"},{"CreatedByName":"The White Guardian","CreatedById":148627,"CreatedDateTime":"2015-11-21T11:41:55Z","Content":"\n[quote name=\u0027KasperVld\u0027]Note that [B]not all data will be transferred to the new forums[/B][/QUOTE]\u003Cbr\u003E\nHmm. In that case I will make a local backup of the contents of the only thread I\u0026#39;ve started so far. Thanks for the heads up.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027KasperVld\u0027]and is scheduled to last between 30 and 40 hours[/QUOTE]\u003Cbr\u003E\nAh, so the KSP forums will be down the entire next weekend. Dang. Oh well, I\u0026#39;ll live, and so will Kerbalkind. This does mean, however, that during that weekend it will be impossible to download mods from the forums, so I\u0026#39;ll download the most recent version of every mod I use Thursday afternoon.\u003Cbr\u003E\n\u003Cbr\u003E\nGood luck [s]Bob[/s] everyone with the forum migration! :D\n"},{"CreatedByName":"Halban","CreatedById":89536,"CreatedDateTime":"2015-11-21T11:43:29Z","Content":"\nWhen Live From Mission Control is merged, will my cinematics enthusiasts thread remain sticky? I also have to say that I\u0026#39;m not a big fan of the new look, it\u0026#39;s as simple as it not meeting my tastes though. The basic design and wasted space make it feel less homely than this forum; though I\u0026#39;m glad to hear that you\u0026#39;re looking into a getting a different skin.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-23T20:19:02Z\u0022 title=\u002211/23/2015 08:19  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 23, 2015\u003C/time\u003E by HatBat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CAKE99","CreatedById":150099,"CreatedDateTime":"2015-11-21T12:39:01Z","Content":"\nWhat\u0026#39;s the \u0022New look\u0022 thing I keep seeing being mentioned?\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-11-21T12:39:49Z","Content":"\nSave the blog feature. Please.\n"},{"CreatedByName":"Mat2ch","CreatedById":139755,"CreatedDateTime":"2015-11-21T12:41:01Z","Content":"\n[quote name=\u0027KasperVld\u0027]As for your second question the answer is definitely yes.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThis would be great! I\u0026#39;d totally start a new thread there :)\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-11-21T12:59:01Z","Content":"\n[quote name=\u0027Frozen_Heart\u0027]Are craft repositories still allowed like Cupcake\u0026#39;s Dropship Dealership and RSUV?\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;ll be very upset to see it go. So much work lost.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nErmagerd, R-SUV! That thing is in the rocket builders subforum! Can I perhaps beg some mod to move it to the exchange before you wipe out the repository where ALL of the ships I\u0026#39; ve released over the years are linked? Only abot 10% is in the OP, and some f the dicussions I had there were awesome.... I promise no RP\u0026#39;ing was involved ;)\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nRune. Othe than that, I trust your judgement it\u0026#39;ll be better.\n"}]}