{"TopicId":178891,"ForumId":148,"TopicTitle":"Kerbal Space Program 1.5: “Dressed for Success” is now available!","CreatedByName":"UomoCapra","CreatedById":167737,"CreatedDateTime":"2018-10-11T15:48:59Z","PageNum":1,"Articles":[{"CreatedByName":"UomoCapra","CreatedById":167737,"CreatedDateTime":"2018-10-11T15:49:00Z","Content":"\n\u003Cp\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:11pt; vertical-align:baseline\u0022\u003E\u003Cimg alt=\u0022kfdiZJqqTzwNgJN6IdkY6cKZyh_zim6no_tmJwuK\u0022 height=\u0022351\u0022 src=\u0022https://lh3.googleusercontent.com/kfdiZJqqTzwNgJN6IdkY6cKZyh_zim6no_tmJwuKWuPVn6iahDF01fQzQJCbXBvarwPNQIao1RLYl5vdo1q7MM1N8gPIqf6IfH4AxU-hXrD0akBZ_pQuGv1BUXNQBi6ORsk_xUVm\u0022 style=\u0022border:none\u0022 width=\u0022624\u0022\u003E\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cmeta charset=\u0022utf-8\u0022\u003E\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EHello everyone!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cem\u003EKerbal Space Program 1.5 Dressed for Success\u003C/em\u003E has launched and with it we bring new content that brings your game experience forward. We are driven to continue with our never-ending quest of making KSP the best game it can be through continuous support and substantial updates. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cem\u003EKerbal Space Program 1.5: Dressed for Success\u003C/em\u003E has something for everyone, as both the base game and the expansion are getting their share of enhancements. With that in mind, a key aspect in this update is the optimization and fresh makeover of various parts, as well as the classic EVA and IVA Space Suit. Additionally, players will find a number of brand new features, as well as good ol’ bug sweeping. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003ELet’s go through some of this update’s highlights:\u003C/span\u003E\n\u003C/p\u003E\n\u003Ch2 dir=\u0022ltr\u0022\u003E\nNew Suits\n\u003C/h2\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EBoth the recruit and veteran classic EVA and IVA Space Suits have been given a well-deserved overhaul. We knew that such an iconic element of the game needed to stay true to its identity, so we are keeping its style, while also giving it a sleeker look.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:16pt; vertical-align:baseline\u0022\u003E\u003Cimg alt=\u00220wOutsqEIrY3w_jasTLIcTVgbS0nheY6T3r3ClAj\u0022 height=\u0022757\u0022 src=\u0022https://lh5.googleusercontent.com/0wOutsqEIrY3w_jasTLIcTVgbS0nheY6T3r3ClAjE40LIkJ1af42S2oYRjYAYn2JSqFugYaUS5ZO-OohVwiQhnKddeq8RkSBGR9jtuyhgrUH4fsH6tgtF5Fg84iPWppVWc8vYnkV\u0022 style=\u0022border:none\u0022 width=\u0022624\u0022\u003E\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:16pt; vertical-align:baseline\u0022\u003ERevamped Parts\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EMany parts have been given a fresh new look in an effort to have a more cohesive parts catalog. While staying true to the game’s original essence, the geometry and texture maps of these parts were completely redone. Some of these parts also include new texture variants for you to choose at will, and others have a new shader that makes their metallic bits interact better with light.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:16pt; vertical-align:baseline\u0022\u003EImproved Burn Time information\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EWe improved the burn time indicator by recalculating based on \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E and not acceleration. Additionally, we’ve added a staging indicator that shows which stages contain the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E needed to complete each part of the maneuver. Go to the advanced settings to turn on this exciting new feature.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:16pt; vertical-align:baseline\u0022\u003E\u003Cimg alt=\u0022Hv1K0OzSb89EVBIQTA5ZKPnKuRTnwOwctsIoiPyV\u0022 height=\u0022380\u0022 src=\u0022https://lh4.googleusercontent.com/Hv1K0OzSb89EVBIQTA5ZKPnKuRTnwOwctsIoiPyVFbxtyuNXbENDlMQVCm64tsqX086j3eXLXTjflq3uGT1_qf73aIXTWXYGSUcz-6J-0hNNIBIiEJ08wSTrZUV7jceb1p2qAV8c\u0022 style=\u0022border:none\u0022 width=\u0022540\u0022\u003E\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:11pt; vertical-align:baseline\u0022\u003E...\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Ch3 dir=\u0022ltr\u0022\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#434343; font-size:13.999999999999998pt; vertical-align:baseline\u0022\u003EUpdate 1.5 has also a few improvements exclusive to the\u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022background-color:transparent; color:#434343; font-size:13.999999999999998pt; vertical-align:baseline\u0022\u003E Making History Expansion\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022background-color:transparent; color:#434343; font-size:13.999999999999998pt; vertical-align:baseline\u0022\u003E:\u003C/span\u003E\u003C/b\u003E\n\u003C/h3\u003E\n\u003Cp\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:16pt; vertical-align:baseline\u0022\u003EThe Part Count Node\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EThis node makes a comparison between the state of a vessel in two separate moments and by defining the number of parts itself; with it you’ll be able to test whether a vessel has or hasn’t lost parts (destroyed or decoupled) during any point on a mission.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:16pt; vertical-align:baseline\u0022\u003EUnderwater Fly Through Nodes\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EWith Dressed for Success you’ll be able to place Fly Through Nodes underwater, expanding mission creation possibilities.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb id=\u0022docs-internal-guid-3370592d-7fff-1a0d-a7f8-7985a40fe31a\u0022\u003E\u003Cspan style=\u0022background-color:transparent; color:#000000; font-size:16pt; vertical-align:baseline\u0022\u003EAnd much more!\u003C/span\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003ETo learn more you can read the full Changelog here\u003C/span\u003E\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022 id=\u0022ips_uid_9769_6\u0022 style=\u0022\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003E=================================== v1.5.0 ============================================================\n1.5 Changelog - BaseGame ONLY (see below for MH changelog)\n\u002B\u002B\u002B Improvements\n*Optimized the game for 4K resolution and increased the UI scale to 200%\n* Added higher impact tolerance to retracted solar panels.\n* Deployable parts now use separate value for their impact resistance when retracted.\n* Implemented a new version of the kerbal suits for the base game. This includes IVA suits for recruits and veterans as well as EVA suits.\n* Revised the behaviour of asteroids within Kerbin\u0027s SOI and gave them better VFX.\n* Added a \u0022What\u0027s New\u0022 dialog to the main menu, where you can quickly see the highlights of the release as well as the full change log. (you\u0027re probably reading this from that very dialog).\n* Improved Burn Time information on Maneuver nodes. Includes correctly calculated burn time and Stage Information; Burn bar indication when vessel does not have enough DeltaV to perform the maneuver.\n* Staging of docking ports now available in flight. Changing staging of docking ports allows the player to change the Delta-V of the vessel for docked vessels which changes the Burn Time Information on Maneuver nodes.\n* Kerbals can now be placed in external command seats in the VAB/SPH.\n* Wheel suspension now has auto spring/damper to combat bouncing wheels. This can be turned on and off via Advanced Tweakables per wheel (in symmetry).\n* Added a Burn Time Indicator slide to KSPedia.\n* In editor (VAB/SPH) switch symmetry mode back to what it was set to after hovering over a node.\n* Allow pinning of PAWs and resource transfer for highlighted parts from Resources App.\n\n\u002B\u002B\u002B Localization\n* Fix lingoona gender tags in resource names in PAWs.\n* Localization of bulkhead size and other automatic search string tags.\n* Fix community localization feedback for the Fly Through? Node pt.2\n* Fix Community localization feedback for fly through Node pt. 2 in Japanese.\n* Fix German community localization feedback for \u0022Schwerkraft mindern\u0022, changed to \u0022Sanfte Schwerkraft Aktivierung\u0022\n* Did a general grammar and lexical pass on KSPedia.\n* Localized Debug menu UI titles.\n\n\u002B\u002B\u002B Parts\nUpdated Parts (reskinned):\n* Mk1 Command Pod\n* HECS\n* HECS2\n* OKTO\n* OKTO2\n* QBE\n* RoveMate\n* Stayputnik\n* FL-T100 \n* FL-T200\n* FL-T400\n* FL-T800\n* RT-5 \u0022Flea\u0022 Solid Fuel Booster\n* RT-10 \u0022Hammer\u0022 Solid Fuel Booster\nColor Variants:\n* Mk1 Command Pod (New  \u0022Dark\u0022, \u0022White\u0022 and \u0022Gray and White\u0022 color variants)\n* RoveMate (New  \u0022White\u0022, \u0022Silver\u0022 and \u0022Gold\u0022 color variants)\n* FL-T100 (New “Dark”, “Black and White”, “White” and “Gray and Orange” variants)\n* FL-T200 (New “Dark”, “Black and White”, “White” and “Gray and Orange” variants)\n* FL-T400 (New “Dark”, “Black and White”, “White” and “Gray and Orange” variants)\n* FL-T800 (New “Dark”, “Black and White”, “White” and “Gray and Orange” variants)\n* RT-5 Flea (New  “White”, “Orange” and “Yellow and White” variants)\n* RT-10 Hammer (New  “White”, “Orange” and “Yellow and White” variants)\nOther Part changes:\n* Some parts now take advantage of the new \u0022Bumped Specular (Mapped)\u0022 shader which achieves significantly better metallic reflections.\n* Fix issue where engine shrouds were becoming offset on vessel focus.\n* Improved OKTO and OKTO2 mesh colliders to fit them better.\n* Improved Stayputnik attach node positions to make better contact with other parts.\n* Rotated the RoveMate ninety degrees to make it match with its Navball orientation; also added  4 new attachment nodes to the sides.\n* HECS rotation fixed - rotated 30 degrees. - NB:This does rotate the control orientation for old vessels using this part.\n* Fixed Rockomax Jumbo-64 Fuel Tank normal map alignment issue.\n\n\u002B\u002B\u002B Bugfixes\n* Fix issue where incorrect tooltip icons were being displayed in the R\u0026amp;D scene.\n* Fix icon blurring for flags, icons, tutorial images (and more) at different texture settings.\n* Fix mini-biomes persisting after touching one and then moving vessel away from it.\n* Fix mini-biome structure detection around the KSC.\n* Fix log spam and messages related to stock launch sites if Making History DLC is not installed.\n* Fix issues with decouplers in symmetry being staged via the Part Action Window.\n* Fix issues with decouplers in symmetry being staged separately.\n* Fix transparent materials in Part Picker Icons.\n* Fix Gigantor XL panel when using Undo in editor.\n* Fix transparent materials showing in part highlighting in editor.\n* FIx for ship orbit line not rendering when burning straight from a physics bounce on flight load.\n* Music volume settings are now applied as soon as the player leaves the settings menu in the KSC. \n* Ambient noise in KSC and VAB/SPH is now controlled by ambient volume setting and not the music setting.\n* Fix music problems when switching between VAB and SPH.\n* Remove Gender on Resource displayName in PAW.\n* The game no longer locks up when attempting to create a save file, vessel or mission using a reserved DOS name.\n* Fix for Kerbal EVA\u0027s clipping through vessel model when forcefully dismounted from an external command seat.\n* Fix for auto localization keys coming up in the target icon when a vessel with a localized name was targeted and moused-over\u0027d.\n* The sun flare no longer shines through Jool.\n* Fix for reentry VFX disappearing when the camera is far from the vessel.\n* Fix for asteroids not displaying reentry VFX.\n* Fix bug where kerbal parachute lifting surfaces weren\u0027t active when loading a quicksave.\n* Fix camera positioning on entering editor scene/loading vessel to show vessel correctly.\n* Fix bulkhead filter strings to work for all valid sizes.\n* Fix when a part is selected and the user attempts to write a ship description the hotkeys will still trigger.\n* Fix In the editor-based tutorials, Werhner\u0027s window overlaps the ship so you can\u0027t place parts.\n* Fix hard points reporting the wrong stage to the StageManager.\n* Fix wheel friction being applied incorrectly based on Celestial Body G. Stops sliding on slopes.\n* Fix wheel suspension bouncing.\n* Fix exploding landing legs when docking/undocking.\n* Fix landing legs applying massive spring setting when fully compressed.\n* Fix Engine plates for all engine plates now show short on their first variant choice.\n* Fix Stations in orbit now complete contracts as they should.\n* Fix Map nodes, Maneuver nodes and other elements display correctly when changing the UI Scale while playing.\n* Fix Part filters with size 1.5 not being filtered when selecting size 1.\n* Fix double carets displaying in some Scenario text descriptions.\n* Fix log error removing wheel debris.\n* Fix error in docking tutorial when player unsets target vessel.\n* Fix jetpack rotates correctly in all scenes\n\n\u002B\u002B\u002B Mods\n* ModuleDeployablePart now has KSPField impactResistanceRetracted.\n* ModuleWheelSuspension now has KSPField maximumLoad.\n* Added IsUIShowing property to UIMasterController.\n\n\u002B\u002B\u002BMiscellaneous\n1.5 Changelog - Making History DLC ONLY\n\u002B\u002B\u002B Improvements\n* Improved the Builder canvas system and connectors for speed and performance.\n* Fly through node volumes can now be set with negative values for the volume to work with submarines.\n\n\u002B\u002B\u002B Localization\n* English grammar, spelling, and punctuation fixes.\n\n\u002B\u002B\u002B Parts\nUpdated Parts (reskinned):\n* SM-18 Service Module.\nColor Variants:\n* Structural Panels (Improved \u0022Gold\u0022 variant and added a new \u0022Silver\u0022 variant).\nOther Part changes:\n* SM-18 bottom lid uses the new \u0022Bumped Specular (Mapped) shader\u0022.\n* Fix issue where engine shrouds were becoming offset on vessel focus.\n* Fix size 1.5 items showing in size 1 sort filter in VAB/SPH.\n\n\n\u002B\u002B\u002B Bugfixes\n* Fix Updating Steam Workshop Missions were creating duplicated workshop items.\n* Fix for NRE when saving a mission where the craft files used in vessel situations have been deleted\n* Fix Kerbals Exploding when resuming a test mission checkpoint taken on a Kerbal EVA node\n* Fix issues with connector lines in Builder when changing planets in the GAP\n* Fix where when boarding the EAS command seats were not triggering when a kerbal boarded for the node to pass.\n* Fix when a vessel is spawned in an orbit, the orbit was getting the reference of the celestial bodies rotation, giving different results like a rotated orbit with the same orbit values on another node.\n* Fix connector lines when in some cases they were badly rendered.\n* \u0022Selected part\u0022 option now appears when selecting one part in the repair node.\n* Don\u0027t reset available and unavailable part lists when changing the part filter and update the list to handle the required parts nicely.\n* Fix weights and costs of all the engine plate variants being the same.\n* Solved discrepancy between the start mission time in the Mission editor and in the actual mission.\n* Fixed GAP parts filter on some nodes so they work similar to the part restrictions on Vessel Spawn Node.\n* Fixed normal map on mobile launchpads, Woomerang and Dessert launchpad.\n* Fix for localization tags for localized vessel and node names coming up in various parts of the UI.\n* Fix for incorrect information about docked nodes order of evaluation in intermediate tutorial.\n* Fix mission Builder banners appear in low resolution with the \u0027Texture Quality\u0027 setting lowered.\n* Fix Clicking “Stay on Editor” in the Mission Builder, no longer auto-fills empty pod seats with available kerbals.\n *Fix *Clicking “Stay on Editor” in the Mission Builder, no longer removes the assigned kerbal on the EAS-1 Command Chair.\n* Fix Assigned crew dragged and dropped on the VAB and SPH, updates the crew count correctly.\n* Fix NRE when \u0022Kerbal Rescued\u0022 node with \u0022Any Crew/Tourist\u0022 option is activated during Missions.\n\n\n\u002B\u002B\u002B Missions\n* Removed erroneous info about event node processing order from intermediate tutorial.\n* Added the Part Count node, so player can check a vessel\u0027s part count, even if the vessel is unloaded.\n\n\u002B\u002B\u002BMiscellaneous\n* Implemented new text for agent descriptions and mentality.\n\n\u003C/span\u003E\u003C/pre\u003E\n\u003Cp dir=\u0022ltr\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cem\u003EKerbal Space Program 1.5: Dressed for Success\u003C/em\u003E is now available on \u003Cem\u003E\u003Ca href=\u0022https://store.steampowered.com/app/220200/Kerbal_Space_Program/\u0022 rel=\u0022external nofollow\u0022\u003ESteam\u003C/a\u003E\u003C/em\u003E and will soon be available on \u003Cem\u003E\u003Ca href=\u0022https://www.gog.com/game/kerbal_space_program\u0022 rel=\u0022external nofollow\u0022\u003EGOG\u003C/a\u003E\u003C/em\u003E and other third party resellers. You will also be able to download it from the \u003Cem\u003E\u003Ca href=\u0022https://www.kerbalspaceprogram.com/kspstore/\u0022 rel=\u0022external nofollow\u0022\u003EKSP Store\u003C/a\u003E\u003C/em\u003E if you already own the game.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EClick here to enter the \u003Cem\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/178890-kerbal-space-program-update-15-grand-discussion-thread/\u0022 rel=\u0022\u0022\u003EGrand Discussion Thread\u003C/a\u003E\u003C/em\u003E for this release.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EHappy launchings!\u003C/span\u003E\n\u003C/p\u003E\n"}]}