{"TopicId":47393,"ForumId":148,"TopicTitle":"KSP-TV Broadcaster Applications [Open]","CreatedByName":"Yargnit","CreatedById":57535,"CreatedDateTime":"2013-10-04T20:05:50Z","PageNum":1,"Articles":[{"CreatedByName":"Yargnit","CreatedById":57535,"CreatedDateTime":"2013-10-04T20:05:50Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EKSP-TV is now accepting applications!\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESQUAD is happy to announce that applications for KSP-TV Broadcasters are once again open! If you are a Twitch live-streamer, or an experienced YouTuber wanting to start live-streaming, this is your opportunity to shine. We\u0027re looking for mature individuals that know how to showcase KSP and all of it\u0027s amazing facets. We\u0027re interested in any type of KSP related or themed programming. We\u0027re going to have live streams, pre-recorded shows, live interview/talk shows, as well as any other type of show that we think the fans will watch. This is your chance to work with SQUAD and the the KSP-TV group to promote KSP to it\u0027s fullest potential!\u003C/p\u003E\u003Cp\u003EYou will be expected to hold to a certain level of broadcast standards as our rules for KSP-TV are no different from our other properties. Each broadcaster will be expected to be punctual and on time both starting and ending their show in consideration of each other. You will need a Google account (so we can share documents and the Schedule Calendar) and Skype for access to the KSP-TV Control Room. You will also need 2 video clips (15 sec \u0026amp; 30 sec) promoting your show. This can be as simple as static screens with text or some fancy animation.\u003C/p\u003E\u003Cp\u003EWe are currently looking to bolster the KSP-TV roster with streamers able to commit reliably to regular weekly shows. If you feel you fit this criteria you may apply immediately at \u0027\u003Ca href=\u0022http://bit.ly/KSPTVApp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bit.ly/KSPTVApp\u003C/a\u003E\u0027. If you are interested in seeing more of what KSP-TV is about check us out at \u0027\u003Ca href=\u0022http://www.twitch.tv/ksptv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/ksptv\u003C/a\u003E\u0027. And finally if you have any questions please feel free to PM \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/private.php?do=newpm\u0026amp;u=59246\u0022 rel=\u0022external nofollow\u0022\u003EYargnit\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EWe look forward to having some of you join our ranks in the near future!\u003C/p\u003E\n"},{"CreatedByName":"Luxmaster-CZ","CreatedById":21176,"CreatedDateTime":"2013-10-04T21:31:13Z","Content":"\n\u003Cp\u003EHow I wish I was capable of quality streams \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-10-05T00:37:12Z","Content":"\n\u003Cp\u003EI stream, and I try to engage my few viewers by taking requests mid-stream, but sadly I don\u0027t have enough of a regular fan base to really get that going.\u003C/p\u003E\n"}]}