{"TopicId":205029,"ForumId":112,"TopicTitle":"Resources sketch","CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-09-28T02:38:00Z","PageNum":1,"Articles":[{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-09-28T02:38:00Z","Content":"\n\u003Cp\u003E\nThis is not so much a suggestion as a thought experiment exploring the ways a game like KSP2 could make some of the ideas from real-world \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E into a fun, playable experience. There are a few essential principles in this, to my mind, in this order of priority: fun gameplay, efficient mechanics, and allusions to real life physics. Im going to focus on the 2nd, as I think it\u0027s the hardest part and mitigates the other two. Its important to realize in this that real-life will always be much, much too complicated to emulate exactly and be fun, and given how complex KSP1\u0027s basic framework is its critical that colonization not utterly dominate player time. So the question for me is \u003Cem\u003Ehow few resources and processing steps are necessary to convey the idea of \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E?\u003C/abbr\u003E\u003C/em\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EFuels, Parts, and Life Support\u003C/strong\u003E\u003Cbr\u003E\u003Cbr\u003E\nStarting with fuels we have some guesses: Methalox, Monoprop, Xenon, Uranium, He3, MH, And likely H2 and Antimatter. From a purely chemical standpoint the raw materials for these are relatively few: Hydrogen, Oxygen, Carbon, Xenon, Helium-3, and Uranium. But from a harvesting standpoint even these can be simplified. From my perspective H2O and CO2 could be gathered together from the surface as \u0022Ices\u0022, Xenon and O2 could be extracted directly from some atmospheres, He3 from surface regolith, and Uranium from mining. Thats only 3 basic resources: Ore, Regolith, and Gasses, which could then be processed into CH4, O2, H2O2, Xe, U, He3, and H2 and further into MH and Antimatter with the appropriate processors. Each of the 3 basic resources could be scanned and understood with values from low to high, which would only effect the rate at which they could be harvested. Or it could be that concentrations for things like He3 and Ices are displayed independently in scans, but this might make it more complicated to harvest raw regolith and process it later and know what you\u0027re going to get. \u003Cbr\u003E\u003Cbr\u003E\nNext come Parts, and I\u0027ll include both rocket parts and colony modules in this. Again to me this about maximizing simplicity while creating good gameplay, and fortunately I think real life does us some favors here. Im going to simplify the raw materials for most parts as Metals, Uranium, and Plastics. I say this because I think both Metals and Uranium could be produced from Ore, and Plastics could be produced from Regolith as an analog to either ethylene or basalt fibre. The reason for the latter distinction is it would cause players to consider both high-quality Ore and Regolith concentrations when picking colony and mining sites, or come up with ways to transport and combine them. Again Ore could have a single concentration rating and be separated using different processors, or Metals and Uranium could have their own individual concentrations depending on the location.\u003Cbr\u003E\u003Cbr\u003E\nLast is LS. Now, I understand many players trepidation at this topic, but I think there are ways to make this both manageable and fun. Given understandable concerns about players time-warping and accidentally killing whole colonies I think there are 2 ways to approach LS as a resource.\u003Cbr\u003E\u003Cbr\u003E\n1:  LS would be an engrained requirement for increasing crews and populations. In order to add more crew to a large vessel or take advantage of population booms you would need to add Hab modules that increase max crew capacities. We could assume onboard systems are closed loop and that LS is a static resource necessary only for building new habitable modules. In that way it would be just like Metals or Plastics  as a part cost, but would instead be produced with greenhouses or MELiSSA style regenerative LS modules fed with Ice rich regolith and nutrients from Ore.\u003Cbr\u003E\u003Cbr\u003E\n2: LS would be a resource thats consumed over time, but the consequences for running out would be relatively minor. It could be created by greenhouses, extended by recyclers, and made indefinite with regenerators. You\u0027d need to pump it around just like any fuel, and you\u0027d be inclined to make sure you have enough on any vessel without a regenerator, but if you ran out it would only make Kerbals Grumpy and less productive, not dead. Using an overall vessel-wide Happiness rating could also encourage players to add other more luxurious habitation modules like centrifuges and recreation facilities and diversify the kinds of later-game modules you\u0027d want to add to growing colonies. \u003Cbr\u003E\u003Cbr\u003E\nThat would lead to a resource flow that looked roughly like this:\u003Cbr\u003E\u003Cbr\u003E\nOre\u0026gt; Metals, Uranium\u003Cbr\u003E\nRegolith\u0026gt; Plastics, Methalox, Monoprop, He3, H2, MH, Antimatter\u003Cbr\u003E\nGasses\u0026gt; Xenon, O2\u003Cbr\u003E\nOre\u002BRegolith\u0026gt; LS\u003Cbr\u003E\u003Cbr\u003E\nAnd the following processors:\u003Cbr\u003E\u003Cbr\u003E\nRefinery \u0026gt; Metals\u003Cbr\u003E\nEnrichment Centrifuge \u0026gt; Uranium\u003Cbr\u003E\nPolymator \u0026gt; Plastics\u003Cbr\u003E\nFuel Processor \u0026gt; Methane, Oxygen\u003Cbr\u003E\nMonoprop Processor \u0026gt; Monoprop\u003Cbr\u003E\nHe3 Factory \u0026gt; He3\u003Cbr\u003E\nElectrolyzer \u0026gt; H2\u003Cbr\u003E\nMetalic Hydrogen Foundry \u0026gt; MH\u003Cbr\u003E\nAntimatter Plant \u0026gt; Boomsauce\u003Cbr\u003E\nGreenhouse \u0026gt; LS\u003Cbr\u003E\u003Cbr\u003E\nNone of which sounds crazy overwhelming, but I think is just enough to get players thinking carefully about surface concentrations as they\u0027re developing and expanding their capabilities. \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-28T12:13:43Z\u0022 title=\u002209/28/2021 12:13  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 28, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jastrone","CreatedById":208489,"CreatedDateTime":"2021-09-28T07:17:06Z","Content":"\n\u003Cp\u003E\nwhile i do think this is possible i still think they want to focus on the rocket part of the game and keep colonies simple so we could also get a similar system to ksp1 with a few or lot of improvement. i think the things affecting how much and what fuel you can make being what planet you are on and how upgraded your colony is mostly\n\u003C/p\u003E\n"},{"CreatedByName":"Timmon26","CreatedById":1897,"CreatedDateTime":"2021-09-28T16:11:38Z","Content":"\n\u003Cp\u003E\nI\u0027ve been thinking along these lines for a while too. Put this flowchart together recently. Was working on some kind of kerbal resources \u0022thesis\u0022 and got sidetracked...\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022O2SlFKD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022103.75\u0022 height=\u0022778\u0022 style=\u0022font-family:Lato, \u0027-apple-system\u0027, BlinkMacSystemFont, \u0027Segoe UI\u0027, Roboto, Helvetica, Arial, sans-serif, \u0027Apple Color Emoji\u0027, \u0027Segoe UI Emoji\u0027, \u0027Segoe UI Symbol\u0027;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/O2SlFKD.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nHere I was trying to reduce \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E into something simplified that also reflected reality. Came up with just a handful of raw resources like you did. I was inspired a bit by the simplified resource gathering in RTS games and Age of Empires in particular, which uses Food and Wood as your army\u0027s basic \u0022fuel\u0022 and \u0022building material\u0022 and Gold and Stone as rarer special resources you need for upgrades or unique units. Here, Volatiles (ices) fuel your rockets and kerbals, Metal (ore) is basic building material, and Uranium and Helium-3 are your special resources for building advanced stuff. Things like plastics or xenon are handwaved and rolled into volatiles and metal for simplicity\u0027s sake.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIncoming Wall of Text\u003Cbr\u003E\n_____\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem with any colony \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E system as I see it, no matter how simplified, is that timewarp will throw a wench into it.  Option 1 for life support in colonies (but maybe not in ships?) is definitely preferable to life support that\u0027s consumable and needs to be replenished. If you don\u0027t have enough habs or snack production, then you just can\u0027t add more kerbals to the colony, period. If the colony loses production of one or both of these resources, because you crashed a rocket into a greenhouse, then a corresponding number of your kerbals will stop working and consequently shut down non-essential buildings they\u0027re running, like refineries. \n\u003C/p\u003E\n\u003Cp\u003E\nBut I think we could take that concept even further than life support though. This principle of colony life support being in a steady state and always expressed as an \u003Cem\u003Eincome \u003C/em\u003Eor \u003Cem\u003Erate\u003C/em\u003E can be applied to all the other colony resources as well. Why? Because free timewarp makes resource collection speed, efficiency, and stockpiling meaningless. If a colony has even a tiny surplus of, say, metal income, then the player can simply timewarp until they have enough metal to build a giant supership. Moreover, they can build as many giant superships as they want by timewarping further, no matter how inefficient their resourcing operations are. We\u0027ve all used timewarp this way to refuel in KSP1. Because of timewarp, an inefficient mining vehicle is just as good as an efficient one. \n\u003C/p\u003E\n\u003Cp\u003E\nA possible solution is for colony resources to always be expressed as \u003Ci\u003Eincome rates \u003C/i\u003Eand never as stockpiles or reservoirs. If a colony has 100 Metal, then it just has 100 Metal all the time, and can build ships or buildings that cost \u0026lt;= 100 Metal. Doesn\u0027t that mean the player can build infinite ships from that colony? Yes, but they could do that anyway with timewarp. What the 100 Metal cap does is restrict the colony\u0027s capabilities until the player does something, i.e. flies a mission, to upgrade those capabilities. If a young colony with 50 Volatiles can\u0027t launch a ship with tanks that take 100 Volatiles to fill, that creates an incentive for the player to upgrade that colony somehow so they can launch bigger ships from it. Yes, they could launch smaller ships and dock them together or something, but future convenience is plenty motivating. Every Career player knows the pain of hitting the early part count cap in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and wishing they could add just one more part to their rocket. Better upgrade the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E then! \n\u003C/p\u003E\n\u003Cp\u003E\nNot only can colony resources be expressed this way, \u003Cem\u003Eraw resources in the ground could as well\u003C/em\u003E. Metal, Volatiles, U, and He3 (or whatever the resources will be) would all be found in deposits with a limited \u003Cem\u003Eoutput\u003C/em\u003E of 10 or 200 or whatever. Sending a vehicle to mine from that deposit and return it to the colony will reduce the deposit\u0027s output and increase the colony\u0027s income by the capacity of the vehicle. The game would need to remember that resources are being taken from a deposit continuously, but this should be possible because of the delivery routes system. Mining a deposit with a delivery route is conceptually the same as transferring resources from one colony to another with a delivery route. In addition, delivery routes should probably be unaffected by synodic periods or travel times, again, because of timewarp. If a delivery route has reduced throughput because of time between launch windows, there\u0027s nothing to stop the player from stockpiling supply ships at one base between the windows and sending them all at once during the next window. It\u0027s simpler to just let players transfer their darn resources in one mission and let them move on to designing new missions elsewhere.\n\u003C/p\u003E\n\u003Cp\u003E\nSo for example:\n\u003C/p\u003E\n\u003Cp\u003E\nSay your Mun Colony Alpha has 20 Uranium income, and you need 30 to build a ship with 3 NERV engines instead of just 2. So you need more Uranium at that colony. There\u0027s a U deposit nearby that you\u0027re currently mining the 20 U from, but it\u0027s depleted. There\u0027s another deposit on the other side of the Mun with 10 U. You could fly a mission there to mine that and return it, establish that as a delivery route, and now have 30 U at your base, minus the Volatiles you spent fueling the mining vehicle (you get to keep the mining vehicle\u0027s Metal because it returned to the base, unless it uses expendable drop tanks or something that costs metal). Alternatively, you could launch a delivery flight from your second Mun Base Beta with 10 U carrying the 10 U for your first base. This would get you the U you need, plus the salvaged Metal cost from the ship, unless you return the ship to the other base, but the second Mun base now has no U and can\u0027t launch nuclear ships from there or run any reactors. \n\u003C/p\u003E\n\u003Cp\u003E\nThis essentially turns colony building into a game of increasing consolidation of resources, with the ultimate goal of building a single massive colony with the resource capacity to build a whole interstellar ship like the one from the trailer. The giant space station seen in the trailer is just such a colony. Also, because delivery routes track the loss of expendable ship parts and fuel between launch and destination, this creates an incentive to design efficient and reusable delivery flights to minimize those losses and get the most out of each delivery or mining mission. Needless to say, this also affects colony placement.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n[TL:DR]\u003Cbr\u003E\nTimewarp makes stockpiling resources meaningless and running out of them frustrating. Therefor, all resources, be they in ground deposits or colony coffers, are expressed as steady state income rates that cap production of ships or the feeding of kerbals. Mining missions and delivery flights can transfer this resource income from deposits to colonies or between colonies. Your Mission: use miners, colonies, and delivery routes to collect resource income from around the Kerbin system and put it in one place so you can build a mega ark ship in space.\n\u003C/p\u003E\n"},{"CreatedByName":"shdwlrd","CreatedById":113880,"CreatedDateTime":"2021-09-28T18:27:31Z","Content":"\n\u003Cp\u003E\nI\u0027m thinking that concrete along with metals will be necessary for the permanent colony structures. Concrete can be made with regolith and water.\n\u003C/p\u003E\n\u003Cp\u003E\nOh another missing resource is good old dihydrogenmonoxide.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-28T22:49:43Z\u0022 title=\u002209/28/2021 10:49  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 28, 2021\u003C/time\u003E by shdwlrd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-09-28T22:33:36Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0026amp;do=hovercard\u0022 data-mentionid=\u00221897\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0022 rel=\u0022\u0022\u003E@Timmon26\u003C/a\u003E Thats awesome! I love it. Im still wrapping my mind around thinking of everything in terms of collection rates... wouldn\u0027t storage capacity effectively do the same thing? As in you could time-warp until they were full and then that would be your cap for new launches? I also understand from something Nate said that launch sizes and mass would be controlled more tightly in the early stages with \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E upgrades. There might also be other scaleable and un-punishing ways to discourage players from time-warping to infini-money. But I think its a really interesting idea and I\u0027ll spend a bit of time pondering all that. \n\u003C/p\u003E\n\u003Cp\u003E\nI also really like your flow-chart. It\u0027s really well thought out. Im guessing Intercept proooobbbabbly has already got this kind of thing mostly nailed, but it\u0027s fun to think about, and I think we\u0027re close to the same page in terms of the kind of complexity scale that makes sense give or take a resource or two. For me its like... what is the right number of raw, harvestable resources, what are the minimum necessary intermediate resources, and how do end-products relate to other fundamental game systems. I think you\u0027ve done a great job diagramming a way that could work.\u003Cbr\u003E\u003Cbr\u003E\nStarting with harvestable resources, more and more I think we want at least 3 or 4  minable resources--volatiles, metal ore, uranium ore and He3 seem great. I say this because I think we want to have areas of overlap where two but not all of those resources are prevalent. If there are only two basic resources from which you can draw basically everything any area of overlap will give you everything you need, and if there are no areas of overlap there\u0027s nothing special about any given place. With 3 or 4 you create a topography of opportunity where some resources overlap without giving players everything. Its also the reason I think Plastics are important as a building resource, because it means you\u0027d need at least 2 basic resources to build new rockets and colony modules (Volitiles \u002B Metals) and leaves Uranium as a rare resource for energy production, orion fuel, and hi-tech parts.\u003Cbr\u003E\u003Cbr\u003E\nThe wild cards for landscape resources might be energy--wind and geothermal, or potentially areas with higher research value. Finding clusters of these kinds of overlapping areas of higher value would then be a big part of the surveying and prospecting process prior to putting down stakes. Maybe tomorrow I\u0027ll do a couple diagrams to show what I mean. \u003Cbr\u003E\u003Cbr\u003E\nPS Have you ever played Frostpunk? What did you think of its worker management system? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-29T00:59:33Z\u0022 title=\u002209/29/2021 12:59  AM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 29, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Timmon26","CreatedById":1897,"CreatedDateTime":"2021-09-29T13:15:36Z","Content":"\n\u003Cp\u003E\nYou could timewarp until your colony\u0027s tanks are full, then set that as a production cap, but if we know the player\u0027s just going to do that anyway, might as well just assume the tanks are full and spare the player the timewarping; let them go design and fly their next rocket.  \n\u003C/p\u003E\n\u003Cp\u003E\nAn economy management sim where a) the player can freely fast-forward to see the results of their actions, and b) where the player needs to also not be distracted by the economy management, creates really weird design constraints. The more I thought about it, the more I realized that time as a variable shouldn\u0027t really be a thing in such a system. Any of the player\u0027s changes to a colony need to ignore time as a factor, and simply alter the colony system\u0027s steady state to reflect the change. \n\u003C/p\u003E\n\u003Cp\u003E\nThe obvious exception to this is ships themselves. So much of spacecraft design and mission planning revolves around time passage and resource consumption, so for a steady state colony system to work, there has to be some fundamental division between what is a \u0022colony\u0022 and what is a \u0022ship\u0022, because different rules apply to each. This division could get hairy when it comes to establishing colonies. If I land a ship with a hitchhiker on a moon, is that a \u0022colony\u0022? When does it become a colony, or are only BAE-constructed buildings part of the colony? Does a landed ship become a colony when I click an \u0022Establish Colony\u0022 button, and can I un-establish it? Blurriness around the division between ships and colonies is a problem for this steady state idea, and I\u0027m still trying to noodle through it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI completely agree about having maybe 3-4 resources, and that these should be found in different places, and sometimes in the same place. This is enough to create interesting decisions for the player, not to mention piloting challenges, but also not enough to be overwhelming and confusing. \n\u003C/p\u003E\n\u003Cp\u003E\nThe the idea of atmospheric resources and air mining is something I glossed over in my proposal, which is silly of me considering how big a deal atmospheric resources are in real \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E systems, like MOXIE. In a steady state, air mining would have to be modeled as if the whole atmosphere was one big \u0022deposit\u0022 with a finite, if high, output that any colony on the planet could tap into. In the case of Kerbin, Laythe, and maybe Duna and Eve, the air would be a volatile deposit. Jool would be the obvious source of He3, assuming we can build aerostat colonies (fingers crossed). This also opens the door for atmospheric scooping or PROFAC systems. An orbital colony could deploy a hypersonic scoop ship to collect atmospheric volatiles and return them to the station, establishing that as a delivery route and increasing the station\u0027s steady state volatile stock.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I haven\u0027t played Frostpunk, but it sounds like I probably should.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-09-29T15:21:50Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0026amp;do=hovercard\u0022 data-mentionid=\u00221897\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0022 rel=\u0022\u0022\u003E@Timmon26\u003C/a\u003E Frostpunk is great. Much different game, (kind of brutal actually) but as a case study in well-tailored game mechanics its just brilliant. Population management is similar to Banished or Rimworld in that you set tasks and the AI workers go do it, and it has a day-night cycle which would obviously not be a thing for a game like KSP2. But one nugget that might be useful is the ability to click on a building and allocate 10 or 15 workers and that lets you modulate its output. If some modules like greenhouses and fuel plants required a certain number of personnel to maintain you could quickly click around your colony and assign them. It seems like a streamlined way to use Kerbals as a resource without totally bogging players down with individual assignments. And to my mind if you\u0027re loading dozens of kerbals at a time into transport and colony ships you\u0027ll need a way to move them around en masse anyway.\u003Cbr\u003E\u003Cbr\u003E\nIn terms of the steady-state stuff time warp creates all kinds of weird dynamics and I think its a really clever solution. I hear what you\u0027re saying about ship/colony distinctions,... its tricky. To my mind time has always been a factor, and we should learn to lean into it. One of the helpful things in that is the cyclical nature of launch windows creates a kind of rhythm in the timings of most launches. A round trip to the Mun takes a few days, because of its inclination there are efficient windows every 25 days to Minmus, Duna windows open about every 500 days with 300 day transits, Jool a little more frequently but with much longer transits, etc. Over long periods time warp isn\u0027t regrettable, it\u0027s just something you have to do. The best I\u0027ve come up with is to use the dates produced by these rhythms as goals for players. I guess we don\u0027t know much about these \u0027boom events\u0027, but if they\u0027re anything like milestones you just give bonus rewards for accomplishing them before a given date. Say if you landed your first Kerbal on Duna by day 1000 you\u0027d get a 10% boost in kerbal population, or if you landed a probe on Laythe by day 1500 you\u0027d get a free tech unlock. These would be on top of permanent, deadline free rewards just for accomplishing the task. Time-based bonuses for specific tasks would create a subtle incentive to do things relatively quickly without punishing players for time-warping when they actually need to. This doesn\u0027t fix the whole problem, because there\u0027s still plenty of time to build a whole civilization on the Mun before your first probe arrives at Duna, so you\u0027d also have to restrict tech based on exploration more carefully and tailor \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E\u003C/abbr\u003E rates to be challenging but not grueling based on the tech players are likely to have at any given point (no easy feat). But creating time based bonuses does alleviate the time-warp to infinity problem. \u003Cbr\u003E\u003Cbr\u003E\nThe deeper question you\u0027ve already posed though. The truth is if you\u0027re collecting resources and building colonies an economy management sim \u003Cem\u003Eis what you have\u003C/em\u003E. The question is, what kind is it? How streamlined can it be so that it feeds into and informs the central gameplay--building rockets and flying them--without utterly dominating? Whether its steady state and results are instantaneous or whether its collection rates and converters its still a matter of balancing inputs and outputs to produce the desired result. This kind of mechanical resource management is already something we do with KSP1--making sure we have enough fuel for each stage, making sure we\u0027ve got sufficient power supply and heat dissipation for Convertotrons, feeding some back into fuel cells to save mass or to deal with low light-levels far from Kerbol, etc. I, personally, love these little engineering puzzles, and would love to see colony management follow the same logic so there\u0027s a consistent theme from vessels to colonies that grows steadily in sophistication as you develop. And I think understanding time as a factor in that is absolutely possible, just tricky. For instance life support. Everyone freaks out about it because they\u0027re afraid everyone\u0027s going to die. But if your colony is producing it in the black all that will happen is the tanks will fill up and then it will coast. If you miscalculate and fall behind on power generation and the greenhouses shut down then kerbals get grumpy and their production drops to 60%. Nothing catastrophic, you just re-jigger your power supply and move on. I think this kind of challenging but not punishing resource puzzle sounds really fun. \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-29T17:04:33Z\u0022 title=\u002209/29/2021 05:04  PM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 29, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-09-29T22:13:37Z","Content":"\n\u003Cp\u003E\nHere are a couple of diagrams showing what I mean about the number of basic resources. The first shows what happens if you only have 2:\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u002237PYDAy.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002282.00\u0022 height=\u0022656\u0022 width=\u0022800\u0022 src=\u0022https://i.imgur.com/37PYDAy.jpg\u0022\u003E\u003Cbr\u003E\nWith 4 though the game challenges you to think more dynamically about expansion. These could be close enough by for an over-land supply run, or on a nearby moon even:\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00229b92zpw.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002282.00\u0022 height=\u0022656\u0022 width=\u0022800\u0022 src=\u0022https://i.imgur.com/9b92zpw.jpg\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nAnd things get more interesting when you have whole planets that lack some resources and you have to think creatively about living off the land:\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00226JyZOuE.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002282.00\u0022 height=\u0022656\u0022 width=\u0022800\u0022 src=\u0022https://i.imgur.com/6JyZOuE.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-10-01T20:51:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224037719\u0022 data-ipsquote-contentid=\u0022205029\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221632953617\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/30/2021 at 12:13 AM, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHere are a couple of diagrams showing what I mean about the number of basic resources. The first shows what happens if you only have 2:\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://i.imgur.com/37PYDAy.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u002237PYDAy.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002282.00\u0022 height=\u0022656\u0022 width=\u0022800\u0022 src=\u0022https://i.imgur.com/37PYDAy.jpg\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\nWith 4 though the game challenges you to think more dynamically about expansion. These could be close enough by for an over-land supply run, or on a nearby moon even:\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://i.imgur.com/9b92zpw.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00229b92zpw.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002282.00\u0022 height=\u0022656\u0022 width=\u0022800\u0022 src=\u0022https://i.imgur.com/9b92zpw.jpg\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\nAnd things get more interesting when you have whole planets that lack some resources and you have to think creatively about living off the land:\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://i.imgur.com/6JyZOuE.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00226JyZOuE.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002282.00\u0022 height=\u0022656\u0022 width=\u0022800\u0022 src=\u0022https://i.imgur.com/6JyZOuE.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA consideration about specifically this out of the whole argument:\n\u003C/p\u003E\n\u003Cp\u003E\nA site never having all the required resources (or at least not all the advanced ones) it\u0027s exactly the kind of complexity that benefits KSP as a spacecraft sim as opposed to the \u0022Factorio-like\u0022 game of conversion rates and production lines.\n\u003C/p\u003E\n\u003Cp\u003E\nWith a strong supply route system and multiple, more spread, resources you\u0027ll pass most of your time building and flying rockets to set up mining operations and cargo runs, on the other hand with less raw resources and more production steps you\u0027ll pass most of your time in the BAE setting up production lines.\n\u003C/p\u003E\n"},{"CreatedByName":"Timmon26","CreatedById":1897,"CreatedDateTime":"2021-10-03T17:46:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224038502\u0022 data-ipsquote-contentid=\u0022205029\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633121476\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/1/2021 at 4:51 PM, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA consideration about specifically this out of the whole argument:\n\u003C/p\u003E\n\u003Cp\u003E\nA site never having all the required resources (or at least not all the advanced ones) it\u0027s exactly the kind of complexity that benefits KSP as a spacecraft sim as opposed to the \u0022Factorio-like\u0022 game of conversion rates and production lines.\n\u003C/p\u003E\n\u003Cp\u003E\nWith a strong supply route system and multiple, more spread, resources you\u0027ll pass most of your time building and flying rockets to set up mining operations and cargo runs, on the other hand with less raw resources and more production steps you\u0027ll pass most of your time in the BAE setting up production lines.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is a really good point. Ideally, each resource location should present a unique landing or navigation challenge, so that getting more resources for a colony becomes a piloting and mission design puzzle instead of a Factorio puzzle. Once the resources have been got, turning them into ships should be as straightforward as possible so the player can get back to designing and flying new ships.\n\u003C/p\u003E\n\u003Cp\u003E\nKeeping with this idea, resource locations should be widely scattered about a body, so that you\u0027ll be forced to change orbital inclinations, precision land, and choose orbits for new stations or depots carefully. Maybe close bodies like the Mun or Minmus would have more equatorial resources to be convenient in the early game, while farther-flung locations have more poleward deposits to ramp up the difficulty.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause all essential resources are rarely found in the same place, colonies would have to trade to be self sufficient. Here\u0027s how Munar resources could work, as an example:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224TdQNVD.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4TdQNVD.png\u0022\u003E\u003Cimg alt=\u0022kUBd107.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kUBd107.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnother thing to consider is that the resources should also be widely scattered about the solar system, so that players are forced to venture out to get enough to go interstellar. The Mun might be a good source for starting metal and building material, and Minmus makes a good fuel base, but they\u0027ll give you just enough of a leg up to start colonizing the other planets. \n\u003C/p\u003E\n"},{"CreatedByName":"t_v","CreatedById":213541,"CreatedDateTime":"2021-10-03T18:31:05Z","Content":"\n\u003Cp\u003E\nWow, this latest iteration of things looks incredible. I don\u0027t have ideas of comparable quality to bring to this particular table, but I do have some information and thoughts that might help with later ideas. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFirst, for the income rate idea, while I agree that it solves a lot of problems, in the KSP2 podcast made a while ago, Nate Simpson mentioned that supply routes will actually vary their output based on launch windows. The assumption is that the ship that you flew for the supply route the first time is replicated and flown again when the same launch window rolls around. So, to make this compatible with income rates, it would probably have to factor in the frequency of the supplies. So a rover mining a deposit could go out every day, every 20 days, or every hour, changing the income rate up to a maximum cap determined by the deposit. But a transfer to Duna would be every 500 days, or longer if you only want 2/3 or 1/2 of the resources transferred. this would complicate things a bit though, and add complexity. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe second comment is based on this concept. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224037559\u0022 data-ipsquote-contentid=\u0022205029\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221632928910\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/29/2021 at 11:21 AM, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSay if you landed your first Kerbal on Duna by day 1000 you\u0027d get a 10% boost in kerbal population, or if you landed a probe on Laythe by day 1500 you\u0027d get a free tech unlock\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile I agree that this provides an incentive against timewarping, there are a few other problems that I see with this feature. First off, the easiest to solve is balance. You can make the events trivially easy for anyone trying, allowing them to space their missions out and not have multiple missions running simultaneously, so that the only people who \u0022lose\u0022 are the ones who timewarp ridiculously far. But that would remove the reward from the boom events, as it wouldn\u0027t seem like an achievement to get them. And because different players play at different paces and with different skill level, any meaningful balance will leave out good chunks of the player base. this would have to be scaled in a difficulty setting, and the devs would have to do a lot of play testing to make sure that everything is well balanced. The second, bigger issue is a psychology one, namely the massive influence of loss aversion in games. At the start of the game, you can reasonably assume that if you play well, you can get boom events. So when you miss one, it doesn\u0027t feel like missing an optional challenge, it feels like being locked out of an important upgrade. Players will go to extreme lengths to not lose a single boom event, sometimes reverting through several important missions because they discovered that they had to be several centuries ahead of their actual place in progression. Good idea, but in practice I think it would result in an unhealthy dynamic. \n\u003C/p\u003E\n\u003Cp\u003E\nanyways, sorry for the long winded explanation, hopefully the first part is useful in some way. Good luck to you all!\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-10-03T20:17:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224039221\u0022 data-ipsquote-contentid=\u0022205029\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633283184\u0022 data-ipsquote-userid=\u00221897\u0022 data-ipsquote-username=\u0022Timmon26\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Timmon26 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is a really good point. Ideally, each resource location should present a unique landing or navigation challenge, so that getting more resources for a colony becomes a piloting and mission design puzzle instead of a Factorio puzzle. Once the resources have been got, turning them into ships should be as straightforward as possible so the player can get back to designing and flying new ships.\n\u003C/p\u003E\n\u003Cp\u003E\nKeeping with this idea, resource locations should be widely scattered about a body, so that you\u0027ll be forced to change orbital inclinations, precision land, and choose orbits for new stations or depots carefully. Maybe close bodies like the Mun or Minmus would have more equatorial resources to be convenient in the early game, while farther-flung locations have more poleward deposits to ramp up the difficulty.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause all essential resources are rarely found in the same place, colonies would have to trade to be self sufficient. Here\u0027s how Munar resources could work, as an example:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022\u0022\u003E \u003C/a\u003E \u003Cspan\u003EHide contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/4TdQNVD.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00224TdQNVD.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/4TdQNVD.png\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://i.imgur.com/kUBd107.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022kUBd107.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002290.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/kUBd107.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnother thing to consider is that the resources should also be widely scattered about the solar system, so that players are forced to venture out to get enough to go interstellar. The Mun might be a good source for starting metal and building material, and Minmus makes a good fuel base, but they\u0027ll give you just enough of a leg up to start colonizing the other planets. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly what I was thinking, BTW your infographics are amazing.\n\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2021-10-04T01:09:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224037256\u0022 data-ipsquote-contentid=\u0022205029\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221632853651\u0022 data-ipsquote-userid=\u0022113880\u0022 data-ipsquote-username=\u0022shdwlrd\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/29/2021 at 4:27 AM, shdwlrd said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m thinking that concrete along with metals will be necessary for the permanent colony structures. Concrete can be made with regolith and water.\n\u003C/p\u003E\n\u003Cp\u003E\nOh another missing resource is good old dihydrogenmonoxide.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWouldn\u0027t regolith and water cover most starting points for other resources add to that rich gas or just gas for hydrogen/Helium. Most things that are needed would be found together would be in one of the 3. Each makes for interesting challenges in the games both in terms of getting to the obvious locations and scanning finding less obvious places. \n\u003C/p\u003E\n\u003Cp\u003E\nEach kicks in new options without stopping more basic processes with out them. ie Water for early colonies could be recycled to maintain LS the colony couldn\u0027t product fuel for export till it had a water source. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-04T01:11:04Z\u0022 title=\u002210/04/2021 01:11  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 4, 2021\u003C/time\u003E by mattinoz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-10-04T14:30:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224039271\u0022 data-ipsquote-contentid=\u0022205029\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633292237\u0022 data-ipsquote-userid=\u002268648\u0022 data-ipsquote-username=\u0022Master39\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Master39 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExactly what I was thinking, BTW your infographics are amazing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes one important thing we\u0027ve learned is Timmon\u0027s graphic illustration skills are much better than mine haha\u003Cbr\u003E\u003Cbr\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0026amp;do=hovercard\u0022 data-mentionid=\u00221897\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0022 rel=\u0022\u0022\u003E@Timmon26\u003C/a\u003E Seriously excellent. Agreed on all points. I would emphasize the value of clustering and overlapping resources though too. It should be a slightly open-ended strategic puzzle  picking your colony and extraction sites to make things as lucrative and streamlined as you can make them.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224039228\u0022 data-ipsquote-contentid=\u0022205029\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633285865\u0022 data-ipsquote-userid=\u0022213541\u0022 data-ipsquote-username=\u0022t_v\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, t_v said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhile I agree that this provides an incentive against timewarping, there are a few other problems that I see with this feature. First off, the easiest to solve is balance. You can make the events trivially easy for anyone trying, allowing them to space their missions out and not have multiple missions running simultaneously, so that the only people who \u0022lose\u0022 are the ones who timewarp ridiculously far. But that would remove the reward from the boom events, as it wouldn\u0027t seem like an achievement to get them. And because different players play at different paces and with different skill level, any meaningful balance will leave out good chunks of the player base. this would have to be scaled in a difficulty setting, and the devs would have to do a lot of play testing to make sure that everything is well balanced. The second, bigger issue is a psychology one, namely the massive influence of loss aversion in games. At the start of the game, you can reasonably assume that if you play well, you can get boom events. So when you miss one, it doesn\u0027t feel like missing an optional challenge, it feels like being locked out of an important upgrade. Players will go to extreme lengths to not lose a single boom event, sometimes reverting through several important missions because they discovered that they had to be several centuries ahead of their actual place in progression. Good idea, but in practice I think it would result in an unhealthy dynamic. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood points, and who knows, Timmon might have the right of it in flattening things out. I completely agree that balance is a big part of it and that these dates would need to be adjusted from one difficulty setting to the next. In fact I think it could be one of the most important ways difficulties are managed. The dates couldn\u0027t be arbitrary, but based specifically on the timing of launch windows and more-or-less generous hohmann transfers, giving a bit of padding for imperfect maneuvers. On normal difficulty there\u0027s no need for these dates to be difficult to achieve. They\u0027re only there to prevent time-warp abuse. And yes, Im definitely using FOMO as the main tool to discourage endless time-warping. I think its important though that these date-based rewards are optional bonuses--maybe 20-30% on top of the main \u0022Boom\u0022 reward that would pay out whether you missed the date or not.  I think a lot of players will make sure that they get a probe off to Duna on the first window and a crewed mission on the second window to gobble up all the bonus rewards. This would probably incentivize having a few simultaneous missions going, which isn\u0027t everyone\u0027s taste. I tend to think though if we\u0027re setting up colonies and establishing supply routes and multi-planet infrastructure that simultaneous missions are more or less inevitable, that one-off missions would be more of a KSP1 thing. But of course if you just wanted to kick back and play it one mission at a time and not worry about missing bonuses you\u0027d still be able to progress and grow at your leisure. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-04T14:58:03Z\u0022 title=\u002210/04/2021 02:58  PM\u0022 data-short=\u00222 yr\u0022\u003EOctober 4, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ahres","CreatedById":180308,"CreatedDateTime":"2021-10-04T23:16:44Z","Content":"\n\u003Cp\u003E\nThis is an incredible thread and I\u0027m excited to see more.  Thanks for the good read, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105624-pthigrivi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022105624\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105624-pthigrivi/\u0022 rel=\u0022\u0022\u003E@Pthigrivi\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0026amp;do=hovercard\u0022 data-mentionid=\u00221897\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0022 rel=\u0022\u0022\u003E@Timmon26\u003C/a\u003E. Timmon, your charts are exquisite. And Pthigrivi, your thoughts on resource flow are really well-thought.\n\u003C/p\u003E\n\u003Cp\u003E\nConsider a question from the audience to Pthigrivi: could you elaborate further on the %bonus on top of the Boom event? I understand that it\u0027s to discourage unrealistic use of timewarp to bolster resource supplies from inefficient resource gathering, but if you go the \u0022rate\u0022 route that Timmon is proposing instead of the \u0022stockpile\u0022 route then timewarp couldn\u0027t be used in that regard anyway, correct?\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2021-10-05T01:00:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224039706\u0022 data-ipsquote-contentid=\u0022205029\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221633389404\u0022 data-ipsquote-userid=\u0022180308\u0022 data-ipsquote-username=\u0022Ahres\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Ahres said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is an incredible thread and I\u0027m excited to see more.  Thanks for the good read, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105624-pthigrivi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022105624\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/105624-pthigrivi/\u0022 rel=\u0022\u0022\u003E@Pthigrivi\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0026amp;do=hovercard\u0022 data-mentionid=\u00221897\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/1897-timmon26/\u0022 rel=\u0022\u0022\u003E@Timmon26\u003C/a\u003E. Timmon, your charts are exquisite. And Pthigrivi, your thoughts on resource flow are really well-thought.\n\u003C/p\u003E\n\u003Cp\u003E\nConsider a question from the audience to Pthigrivi: could you elaborate further on the %bonus on top of the Boom event? I understand that it\u0027s to discourage unrealistic use of timewarp to bolster resource supplies from inefficient resource gathering, but if you go the \u0022rate\u0022 route that Timmon is proposing instead of the \u0022stockpile\u0022 route then timewarp couldn\u0027t be used in that regard anyway, correct?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDefinitely. Usually folks on the internet feel like they have to put a stake in the ground and defend one position to the last but I think both systems are entirely workable, and Timmon\u0027s might even be simpler, which all things being equal is usually better. The only thing thing I\u0027d add in defense of some date-based rewards is endless time-warp doesn\u0027t just effect resource collection, and there are other reasons why you might want to discourage it. Another big one is interstellar travel. If, as I hope, there are ways to create closed-loop LS there is nothing really preventing you from making a big Methalox rocket, reaching solar escape velocity, and leaving your computer to time-warp over night through a 100y low velocity journey to another star system.  It kind of voids the entire tech tree, which is insane. There really should be something to discourage this.  \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/213541-t_v/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022213541\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/213541-t_v/\u0022 rel=\u0022\u0022\u003E@t_v\u003C/a\u003E was not wrong to say that I am altering the psychology of the game, but I happen to think its a good thing rather than a bad thing. It\u0027s something you learn when you make games: single player games tend to be fun about as long as there\u0027s something to strive for, some final reward that you can\u0027t have until you\u0027ve accomplished X. After that the tension deflates and only hardcore completionists will stay involved. Everyone else will start over and hopefully get some replay value. To start, since KSP2\u0027s scope is so, so huge, probably at least a couple of other star systems, you really want to hold the final tech rewards at least until players have landed kerbals on an exoplanet or two. Maybe it\u0027s the Antimatter engine or some really cool colony modules, or both. Whatever that thing is really sets the scope, and after that, hopefully, players find colony building fun and rewarding enough to just be in pure-creation mode as they visit other star systems with their fancy new engines and parts. In other words the only reward that outstrips the tech tree is \u003Cem\u003Egrowth\u003C/em\u003E. \u003Cbr\u003E\u003Cbr\u003E\nWe don\u0027t know much about adventure mode, but what I find really clever about the idea of Boom events is the direct linkage between discovery and kerbal population values, that the more planets you land on and the more you\u0027re able to find the greater your population will be. This could and should directly control your overall production capacity, be it flight-crews, research, food, energy, and/or resource harvesting rates. It could define not just how big and how cool your colonies can be, but also what kind of technologies they can support. What I think time-based rewards do besides discouraging tedious warp-grind is to create a kind of temporal architecture for growth. If you want your colonies to be as big and as bad as they can be you really want to get those extra 20-30% boosts. It creates a small sense of urgency, and asks players to consider time not just as something to warp through to the next window, but as a resource to be utilized and make the most of each mission. It would be an extra reason to make really efficient resource processing systems or consider the advantages and disadvantages to harvesting and growing locally vs shipping everything from Kerbin on long transfers. It\u0027s just an extra, optional layer to consider and I think would add a huge amount of depth to the gameplay without punishing casual players too much. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-05T01:13:03Z\u0022 title=\u002210/05/2021 01:13  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 5, 2021\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rextable","CreatedById":119784,"CreatedDateTime":"2021-10-10T14:18:42Z","Content":"\n\u003Cp\u003E\nOn the topic of landing site choice as alluded to by Pthigrivi\u0027s diagram:\n\u003C/p\u003E\n\u003Cp\u003E\nHow many times have people picked a landing site for their new base in the KSP1 map view, only to plop down and realise the site is totally inappropriate in one way or another for the given mission? Maybe it\u0027s too steep and your habitation module is on the wonk. Maybe you\u0027re too deep into the atmosphere and you can\u0027t get back into orbit? We\u0027ve all been there..... right..... chaps....???  \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyway...\n\u003C/p\u003E\n\u003Cp\u003E\nThe Scansat mod - as we all know and love - has various planetary overlays that help mitigate the potential for frustration in landing site selection. Variables - terrain/slope, biome, resources, etc - can all be collected and displayed on their own map projections. Aside from being incredibly useful, these maps are also a feast for the eyes. They transform the experience of choosing a landing site from a potentially tedious and frustrating one into an \u003Cem\u003Ealmost-fun\u003C/em\u003E and visually appealing game mechanic in its own right. I say \u0027almost-fun\u0027 because there are serious limitations and omission in functionality to the ScanSat mod and the stock game as they currently stand. Like Star Trek\u0027s Data - \u003Cem\u003Ewho just luuuves scanning for life forms\u003C/em\u003E -  I personally really enjoy the whole scanning/landing-site-reconnaissance concept that ScanSat kind-of-almost-but-not-quite achieves. It\u0027s almost there but just doesn\u0027t go far enough. The KSP2 devs could (imho) very easily build on what Scansat has demonstrated to be potentially a visually stunning, engaging, educational and fun aspect of real-life \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E.\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently (with or without Scansat installed), one selects one\u0027s landing site by a mixture of blind guesswork, peering at one overlay at a time and memorising where the good spots are for each one. I\u0027ve always thought that surely it\u0027d be easy and worthwhile to add a further layer of functionality - an automatic detection function that displays potential landing sites or \u003Cem\u003EPOI\u003C/em\u003E (\u003Cstrong\u003EP\u003C/strong\u003Eoint \u003Cstrong\u003EO\u003C/strong\u003Ef \u003Cstrong\u003EI\u003C/strong\u003Enterest) in the map view based on the data available and within player\u0027s specified requirements. EG \u0022Show me POI within \u003Cem\u003Ethis\u003C/em\u003E slope range, between \u003Cem\u003Ethat\u003C/em\u003E elevation range, within x \u0026amp; y biome, with a, b \u0026amp; c resources and within x radius of z anomaly.\u0022 If the player has yet to scan for a particular data type, that data isn\u0027t taken into account. With all those factors involved, there will likely be only a very small - thus manageable - number of suitable locations on any one body. The player can then select one or more of these POI, name and store them to be recalled at any point as targets/waypoints/landing-sites for future missions.\n\u003C/p\u003E\n\u003Cp\u003E\nIn real life, this is more or less what NASA does. They don\u0027t just rock up to a planet and say \u0022right nerds - where shall we plop down?\u0022 Obviously NASA takes months, nay years to analyse the recon data they collect and make decisions on potential sites based on the information available to them. But in \u003Cem\u003Egameymcgamegame\u003C/em\u003E land we don\u0027t need to wait this long. The comparatively tiny number of variables and volume of data a Scansat-type of game mechanic would collect would be computationally very easy to whittle down to a handful of POI that your average gamer - and their PC - can handle.\n\u003C/p\u003E\n\u003Cp\u003E\nOne could go even further and gamify the POI generation process if the magic-do-all-the-work-for-me button doesn\u0027t appeal. For example: in the tracking centre (or some other asyettobebroughtintoexistence science processing building), POI could be represented graphically as Pthigrivi\u0027s diagram illustrates; as layers of overlapping circles on a planet\u0027s surface. The player could draw them photoshop-shape-tool-style on a body\u0027s surface by surveying the various terrain/biome/resource maps they\u0027ve collected. From there, the player can ascertain a handful of locations, create an X-marks-the-spot type target (as Mechjeb kind of does already) that can be saved and recalled as described earlier. This could be just one of a load of \u0027science minigames\u0027  within the game.... but I\u0027m getting off topic now.... I\u0027ll stop typing now. \u003Cimg alt=\u0022:sealed:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 title=\u0022:sealed:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat is all.... carry on \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nx\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-13T09:17:58Z\u0022 title=\u002210/13/2021 09:17  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 13, 2021\u003C/time\u003E by rextable\u003C/strong\u003E\n\u003Cbr\u003Espelling \u0026amp; grammar kraken be damned\n\u003C/span\u003E\n"}]}