{"TopicId":205996,"ForumId":112,"TopicTitle":"A tweakable to change the durability of parts","CreatedByName":"DJDoesKSP","CreatedById":210414,"CreatedDateTime":"2021-12-15T21:20:51Z","PageNum":1,"Articles":[{"CreatedByName":"DJDoesKSP","CreatedById":210414,"CreatedDateTime":"2021-12-15T21:20:51Z","Content":"\n\u003Cp\u003E\nA feature I feel would be nice is the ability to tweak the durability of parts, along with data showing how much pressure the parts can withstand, how fast of a collision it can withstand, and how well they can withstand entry of an atmosphere. Money wise, a lower durability means a lower cost, and higher durability means higher cost, duh. Now, the reason for doing this: There is no reason to have super durable parts on a low gravity planet/moon with no atmosphere like Minmus or Gilly, while it also makes sense for you to have high durability on a planet like Eve, for example.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-07-10T01:08:23Z\u0022 title=\u002207/10/2022 01:08  AM\u0022 data-short=\u00222 yr\u0022\u003EJuly 10, 2022\u003C/time\u003E by DJDoesKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jastrone","CreatedById":208489,"CreatedDateTime":"2021-12-16T07:23:38Z","Content":"\n\u003Cp\u003E\nmaybe yhea. one thing i have been thinking about before wich is that parts have customizable insides. if you want to bring lots of kerbals but you dont like the look of having lots of command pods then just take a fuel tank and fill it with seats. one of these things you could add could be armor. but the thing is what would happen if you hit thee ground to hard with stronger parts. wouldnt the crashes be less realistic?\n\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2021-12-22T02:11:41Z","Content":"\n\u003Cp\u003E\nI\u0027m open to the idea of tweakable node strength in particular. But, well, that\u0027s effectively just rigid attachment as seen in KSP1, although that obly has a single level and there is no monetary or weight cost. With autostruts, the added node brittleness never became a problem.\n\u003C/p\u003E\n\u003Cp\u003E\nConsidering interstellar travel and the sort of huge ships that will be required, I\u0027m really more looking forward to more gigantic truss sets with modularity in mind.\n\u003C/p\u003E\n\u003Cp\u003E\nLow V impacts are kind of a \u0027niche\u0027 thing in KSP as it is. The line between soft landing and vaporization is pretty thin, especially on airless worlds. Only parachutes really lead to not-quite soft landings where added structural strength would be useful.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-12-22T02:14:20Z\u0022 title=\u002212/22/2021 02:14  AM\u0022 data-short=\u00222 yr\u0022\u003EDecember 22, 2021\u003C/time\u003E by Axelord FTW\u003C/strong\u003E\n\u003C/span\u003E\n"}]}