{"TopicId":211278,"ForumId":112,"TopicTitle":"Journal of your records for Progression mode","CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2023-01-02T14:10:29Z","PageNum":1,"Articles":[{"CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2023-01-02T14:10:29Z","Content":"\n\u003Cp\u003E\nI thought about KSP2 game mode, which will replace career mode, and decide that this \u0022progression\u0022 mode must have some important details to correspond to its name or/and meaning\u003Cbr\u003E\n\u003Cbr\u003E\nWhen you played career in original game, you after achieving records have messages in game mails from Kerbin World-Firsts Record-Keeping Society about your achievements. You could see them in your contracts journal. But in KSP2 I\u0027m not sure we will have contracts and journal, maybe only archive with science notes. And I suggest my idea of improved journal\n\u003C/p\u003E\n\u003Cp\u003E\nAfter reaching orbit or surface of some celestial object or another important event you will have in your journal date and description of event: where and what you did, name of spacecraft, names of kerbals if it had it. For example:\u003Cbr\u003E\n\u003Cbr\u003E\nYear 245 Date 5/6 11:34 First landing on Mun by autonomus spacecraft Lander-1\u003Cbr\u003E\nYear 245 Date 7/9 22:57 First fly-by of Duna by autonomus spacecraft Dun-3\u003Cbr\u003E\nYear 246 Date 2/1 16:04 First landing on Mun with crew Jeb Kerman and Bill Kerbal by spacecraft Mun-lander\u003Cbr\u003E\nYear 246 Date 4/3 00:48 First fly-by of Minmus with crew Bob Kerval, Bill Kerbal and Tim Kervin by spacecraft Orbit_minmus\u003Cbr\u003E\n...\u003Cbr\u003E\nYear 259 Date 9/1 08:45 The Duna colony Duna-Startown population reached 500 kerbals\n\u003C/p\u003E\n\u003Cp\u003E\nHow it will fit into the game depends of developers\u0027 view, maybe it will be in archieve with science or there will be another special journal\u003Cbr\u003E\nThis will highlight all your steps and achievements on the path of space exploration, and they will not be forgotten, but rather enshrined in the journal. You can easily turn your gaze to the past and see all the path you have passed. This journal will be the history of space exploration of kerbalkind\u003Cbr\u003E\nIt will encourgae players to reach new limits, thereby adding to the list of achievements in the journal.  It can be comfortble fuction for speedrunners because they will have be able  to record their achievements in pleasant form. For multiplayer space race can be also added name of player\u0027s agency in message\n\u003C/p\u003E\n\u003Cp\u003E\nOverall I expect also improved writing in game, and not only parts, but agencies, sciences experiments, bodies will have interesting and important descriptions with lore of game\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"zeekzeek22","CreatedById":223169,"CreatedDateTime":"2023-01-06T16:45:01Z","Content":"\n\u003Cp\u003E\nI think this could also be linked to the flags...plant a flag, generate an event in your journal with the text you write in the flag.\n\u003C/p\u003E\n"},{"CreatedByName":"Vortygont","CreatedById":223549,"CreatedDateTime":"2023-01-07T21:02:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224216212\u0022 data-ipsquote-contentid=\u0022211278\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221673023501\u0022 data-ipsquote-userid=\u0022223169\u0022 data-ipsquote-username=\u0022zeekzeek22\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/6/2023 at 7:45 PM, zeekzeek22 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think this could also be linked to the flags...plant a flag, generate an event in your journal with the text you write in the flag.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot quite so. Meaning is not about random events, but to capture your important milestones in space exploration. If it is flag in a new place it can be added in journal of your milestones, but not other steps that are completely passed. And not only flags of course.  This journal will be storymap of your spacee program\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2023-01-08T10:53:39Z","Content":"\n\u003Cp\u003E\nI like the idea, but there may need to be some \u0027filters\u0027 to select which events get added,.  How is the game supposed  to know if a given event is of personal  significance?  Perhaps \u0027pop-ups\u0027 asking if you want to log it could also  be useful.\n\u003C/p\u003E\n"},{"CreatedByName":"zeekzeek22","CreatedById":223169,"CreatedDateTime":"2023-01-08T15:17:22Z","Content":"\n\u003Cp\u003E\nWell, that’s why I think it makes sense to have pre-determined “firsts”, but outside of that, the personal aspect would be being able to manually add events by planting flags or some orbital equivalent. Seems like a simple combo!\n\u003C/p\u003E\n"}]}