{"TopicId":212221,"ForumId":112,"TopicTitle":"Is two new star systems enough?","CreatedByName":"VlonaldKerman","CreatedById":225683,"CreatedDateTime":"2023-02-22T23:28:39Z","PageNum":1,"Articles":[{"CreatedByName":"VlonaldKerman","CreatedById":225683,"CreatedDateTime":"2023-02-22T23:28:39Z","Content":"\n\u003Cp\u003E\nI know this is a long ways away, but I was just looking at the EA roadmap and noticed that it only included two new star systems. It strikes me, a former player of the Galaxies Unbound mod, like this is not enough. What do you guys think? I know that this will only matter to dedicated/experienced players, but those players will probably go interstellar pretty quickly and easily, and \u0022Interstellar\u0022 is a major selling point of the game. It bothers me that there hasn\u0027t been any official word on how many star systems to expect (correct me if I\u0027m wrong) especially in light of the current state of the early access, which, without getting into a whole separate issue, is definitely... earlier... than many people likely expected.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-02-22T23:54:24Z","Content":"\n\u003Cp\u003E\nMore systems are coming after 1.0, confirmed.\n\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2023-02-23T05:58:35Z","Content":"\n\u003Cp\u003E\nWould assume most major theme updates and DLC will each have a new system to well offer challengers specific to the each new game mechanic. \n\u003C/p\u003E\n"},{"CreatedByName":"Cailean_556","CreatedById":12297,"CreatedDateTime":"2023-02-23T06:02:11Z","Content":"\n\u003Cp\u003E\nI got the impression, from what has been released and discussed in interviews and such so far, that while Debdeb is going to be the first new star system, and a (TBA named) star system is planned prior to the multiplayer update, they intend to add more. To the right of the \u0027Multiplayer\u0027 milestone is a very obvious quarter/fifth of a new development milestone \u0027box\u0027. While the (very) partial image it contains is pixelated (at best), it does seem to imply that development is not stopping there.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile I wouldn\u0027t expect a while galaxy of star systems to explore, it would not surprise me if either we got more than a handful of handcrafted star systems to explore and/or procedurally generated star systems ended up being a thing. Time will tell.\n\u003C/p\u003E\n"}]}