{"TopicId":13120,"ForumId":35,"TopicTitle":"[Win][With Auto-Updater!] Kerbal Space Program: Mod Manager","CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2012-06-23T12:43:55Z","PageNum":6,"Articles":[{"CreatedByName":"Pontiac","CreatedById":62216,"CreatedDateTime":"2013-05-09T16:14:14Z","Content":"\n\u003Cp\u003EI was using Generic Game Mod Manager until I stumbled across this after watching videos from Lord Stimpy on YouTube. Insta-downloaded, insta-started over since I couldn\u0027t remember what plugins were what, where, etc, etc.\u003C/p\u003E\u003Cp\u003EI did notice an issue though. The \u0022RENAME\u0022 function doesn\u0027t seem to work. I highlight, select Edit\u0026gt; Rename, and I get no action.\u003C/p\u003E\u003Cp\u003EWhat I might also suggest is in your about page is to add a link that opens up to this forum page for further updates. I realize you have the auto-update function, but, I\u0027d still like to go to the forum page to find out if someone else has found a problem. :]\u003C/p\u003E\u003Cp\u003ENow, off to find some new and interesting plugins!\u003C/p\u003E\u003Cp\u003EEDIT: I also found that if you RIGHT-Click on the Title/Version/Status bar, you get a break in the program. You can continue use though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-09T16:27:37Z\u0022 title=\u002205/09/2013 04:27  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 9, 2013\u003C/time\u003E by Pontiac\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-10T13:26:14Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Pontiac:\u003C/strong\u003E Thanks for downloading KSPMM. The rename function is not yet implemented. Never got around to it. It never got mentioned. So I never set it as any priority. Same with \u0022New\u0022 and \u0022Open\u0022. Although those a obsolete by now because of the Dev-Kit.\u003C/p\u003E\u003Cp\u003EAs for the RIGHT-Click bug you found, I just confirmed it. I think it the method I\u0027m using to detect which entry in the list that\u0027s been clicked. Since the title bar is not actually an entry, but a header. It still checks. And then throws an error.\u003C/p\u003E\u003Cp\u003EAnd the idea to add a link to this page is pretty good. I can definitively see the usefulness in that.\u003C/p\u003E\n"},{"CreatedByName":"Soulshifter","CreatedById":58039,"CreatedDateTime":"2013-05-10T22:32:53Z","Content":"\n\u003Cp\u003EYeah I have dealt with that pesky little problem using datagridview in VB Net. Most of it was solved by \u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Eif e.rowindex = -1 then exit sub\u003C/pre\u003E\u003Cp\u003E as the first line in the sub.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-10T22:35:58Z\u0022 title=\u002205/10/2013 10:35  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 10, 2013\u003C/time\u003E by Soulshifter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-11T01:05:34Z","Content":"\n\u003Cp\u003EMhm. Yea. Thanks.\u003C/p\u003E\u003Cp\u003EWill be fixed in the next update. Which is just around the corner.\u003C/p\u003E\u003Cp\u003ESpeaking of next version, this update will mostly be focused on the Bridge Web-Browser I have.\u003C/p\u003E\u003Cp\u003EFor example, I set the new homepage to be the SpacePort.\u003C/p\u003E\u003Cp\u003EBecause I FINALLY figured out how to get the direct link to a mod file on there. Yes, you heard right. Next version will allow directly downloading files from the SpacePort using KSPMM Bridge.\u003C/p\u003E\u003Cp\u003ENo Save As... dialog or anything. It will automatically detect the file type and download it to the appropriate folder. When you press the Download button.\u003C/p\u003E\u003Cp\u003ERight now I\u0027m working on a effective way of bulk downloading files. And storing the logs.\u003C/p\u003E\u003Cp\u003EWould you guys be fine with store and forget for each session? It will remember what you\u0027ve downloaded till you close KSPMM. Then it forgets it. The easiest method.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOr\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWould it be referred to store that info somewhere? And load it back up again next you run KSPMM? So it will always remember what you\u0027ve downloaded. And let you re-download it. This would require saving another file on your PC somewhere.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E Just a quick update to let everyone know it works perfectly! It will now downloads mods from SpacePort, add it in the MODS folder. And reload the main mods list. All with one click of a button. The big red \u0022Download Now!\u0022.\u003C/p\u003E\u003Cp\u003EI still need to do some minor tweaks and fixes and some more testing before I release this version.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-11T14:57:07Z\u0022 title=\u002205/11/2013 02:57  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 11, 2013\u003C/time\u003E by Norway174\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Soulshifter","CreatedById":58039,"CreatedDateTime":"2013-05-11T21:24:01Z","Content":"\n\u003Cp\u003EIt shouldn\u0027t really need to save it since the mod list is basically shows you what you downloaded. It would just be nice if there was a standard way of putting a mod version and everyone would use it so we could tell what we had and if there was an update. Of course if you store the information you could add the option to delete the old file before downloading the new one to save drive space and keep things tidy.\u003C/p\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-12T01:42:23Z","Content":"\n\u003Cp\u003EYeah. Already made it work. I took another approach. It won\u0027t save a log of any kind. Nor trough the session. \u003C/p\u003E\u003Cp\u003EAnd to deal with multiple downloads. You\u0027ll have to wait till the first one is done. Since mods aren\u0027t generally too big anyways. I figured it wouldn\u0027t be a too long of a wait.\u003C/p\u003E\u003Cp\u003ENow my last problem, changing the button text from \u0022Download Now!\u0022 to \u0022Download with KSPMM!\u0022 (Feel free to suggest something better.), I thought that would be the easiest part.\u003C/p\u003E\u003Cp\u003EOh god, was I wrong. For some reason it won\u0027t let me modify the source code page and set it as the new one. Without treiggering the same event again, and causing it to be set again and trigger the event.\u003C/p\u003E\u003Cp\u003EIn an endless loop. \u003C/p\u003E\u003Cp\u003EThis is really bad. And the trick I used on the welcome screen, doesn\u0027t seem to be working for this one.\u003C/p\u003E\u003Cp\u003EIf anyone with VB.net experience wish to give any pointers, on how to read the source code, replace a line, and then set it back again with the new line.\u003C/p\u003E\u003Cp\u003EHere\u0027s my current sub I\u0027m using:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[COLOR=\u0022#0000FF\u0022]Sub[/COLOR] Navigated() [COLOR=\u0022#0000FF\u0022]Handles[/COLOR] WebBrowser1.Navigated\u003Cbr\u003E\u003Cbr\u003E        [COLOR=\u0022#0000FF\u0022]Dim[/COLOR] orginaltxt = [COLOR=\u0022#FF8C00\u0022]\u0022\u0026lt;input class=\u0022\u0022red_btn\u0022\u0022 type=\u0022\u0022submit\u0022\u0022 name=\u0022\u0022send\u0022\u0022 value=\u0022\u0022Download Now!\u0022\u0022 /\u0026gt;\u0022[/COLOR]\u003Cbr\u003E        [COLOR=\u0022#0000FF\u0022]Dim[/COLOR] newtxt = [COLOR=\u0022#FF8C00\u0022]\u0022\u0026lt;input class=\u0022\u0022red_btn\u0022\u0022 type=\u0022\u0022submit\u0022\u0022 name=\u0022\u0022send\u0022\u0022 value=\u0022\u0022Download with KSPMM!\u0022\u0022 /\u0026gt;\u0022[/COLOR]\u003Cbr\u003E\u003Cbr\u003E        [COLOR=\u0022#0000FF\u0022]Dim[/COLOR] txt [COLOR=\u0022#0000FF\u0022]As String[/COLOR] = WebBrowser1.DocumentText\u003Cbr\u003E\u003Cbr\u003E        txt = txt.Replace(orginaltxt, newtxt)\u003Cbr\u003E\u003Cbr\u003E        WebBrowser1.DocumentText = txt\u003Cbr\u003E\u003Cbr\u003E[COLOR=\u0022#0000FF\u0022]End Sub[/COLOR]\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EProblem is that when I set the \u0022WebBrowser1.DocumentText = txt\u0022, it will trigger this whole sub again. And loop endlessly.\u003C/p\u003E\u003Cp\u003ESuggestions? If not, I\u0027ll probably end up solving it myself after some time.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E Never mind. I solved it! Will probably release next version really soon.\u003C/p\u003E\u003Cp\u003EHoping you guys will check out the Bridge. It can be accessed under File, or by pressing Ctrl \u002B B.\u003C/p\u003E\u003Cp\u003EAlso, a fun fact; I called the web-browser for Bridge, because it \u0027connects\u0027 the users to the mods easier. What is easier than walking over a bridge?\u003C/p\u003E\u003Cp\u003EThis is even easier! Just one click of a button.\u003C/p\u003E\u003Cp\u003EJust note though, it will download any .zip file automatic. but as a security precaution, the download bar will be annoying in the middle. With a cancel button. So you will know if it downloads something regardless. Any other file types, you will get a pop-up asking if you want to save it. And where to save it. Like standard IE.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT2:\u003C/strong\u003E Just released version 1.5.5.0. I highly suggest everyone check out Bridge. There should be a new button right next to \u0022Launch KSP\u0022.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T03:10:26Z\u0022 title=\u002205/12/2013 03:10  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by Norway174\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-05-12T04:15:51Z","Content":"\n\u003Cp\u003EAnyway, after closer examination of this program, I have decided to add new features to this program, and not make a new one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI plan to add lots of batch processing and new features (which I have in mind, and will be a secret until I make it). Also Norway, could you upload this to Github? It\u0027ll be easier for me to fork this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Soulshifter","CreatedById":58039,"CreatedDateTime":"2013-05-12T12:27:53Z","Content":"\n\u003Cp\u003EThe new Bridge works good. I am curious as to how you solved the button problem. And also have you tried doing something in a Navigat\u003Cstrong\u003Eing\u003C/strong\u003E sub, maybe change the button before it is displayed. It still shows the Download Now button for a couple seconds, if someone is having lag it might cause problems. I haven\u0027t used web browsers that much in VB so not sure if that is possible. Most of my work has been on data grids or local browsers over the LAN. There I could just modify the page I didn\u0027t need to do it mid-stream.\u003C/p\u003E\u003Cp\u003EOne small request. Add a \u0022Stay On Top\u0022 toggle option to the menu. At home I have dual monitor but when I play on my laptop it would be nice to be able to shrink the window down and move it to the corner. That way I could still see my mod list while I cruise the space port.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T12:35:05Z\u0022 title=\u002205/12/2013 12:35  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by Soulshifter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-12T14:33:31Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@ROFLCopter64bit:\u003C/strong\u003E Oh, I can do better than that. What about read/write access to the DropBox folder? PM me if you\u0027re interested in joining the team. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Soulshifter:\u003C/strong\u003E Actually, I changed Navigated to DocumentLoad. Which I did before the fix I added. I don\u0027t think I tested it back with Navigated. I will test it quickly. And if it still works, I\u0027ll keep it that way. Navigated is much faster than DocumentLoad. So there should be no lag then.\u003C/p\u003E\u003Cp\u003EAs for the lag, it\u0027s not a technical problem. It would always update the text. Even if happens 10 mins later. Obviously it would be bad. Would it still be updated.\u003C/p\u003E\u003Cp\u003EAs for the fix, all I did was loop trough every element. Finding the one that matches red_btn.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[COLOR=\u0022#0000FF\u0022]Dim[/COLOR] theElementCollection [COLOR=\u0022#0000FF\u0022]As[/COLOR] [COLOR=\u0022#00FFFF\u0022]HtmlElementCollection[/COLOR]\u003Cbr\u003EtheElementCollection = WebBrowser1.Document.GetElementsByTagName([COLOR=\u0022#FF8C00\u0022]\u0022input\u0022[/COLOR])\u003Cbr\u003E\u003Cbr\u003E[COLOR=\u0022#0000FF\u0022]For Each[/COLOR] curElement [COLOR=\u0022#0000FF\u0022]As[/COLOR] [COLOR=\u0022#00FFFF\u0022]HtmlElement[/COLOR] [COLOR=\u0022#0000FF\u0022]In[/COLOR] theElementCollection\u003Cbr\u003E       [COLOR=\u0022#0000FF\u0022]If[/COLOR] curElement.OuterHtml.Contains([COLOR=\u0022#FF8C00\u0022]\u0022red_btn\u0022[/COLOR])[COLOR=\u0022#0000FF\u0022] Then[/COLOR]\u003Cbr\u003E           curElement.SetAttribute([COLOR=\u0022#FF8C00\u0022]\u0022InnerText\u0022[/COLOR], [COLOR=\u0022#FF8C00\u0022]\u0022Download with KSPMM!\u0022[/COLOR])\u003Cbr\u003E       [COLOR=\u0022#0000FF\u0022]End If[/COLOR]\u003Cbr\u003E[COLOR=\u0022#0000FF\u0022]Next[/COLOR]\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EPutting this in the navigating sub, would get the old document. Or page.\u003C/p\u003E\u003Cp\u003EAnd your request has been noted. Seems like a good idea. And very easy to do.\u003C/p\u003E\u003Cp\u003ESo I\u0027ll probably do it in the next release.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E Just tried changing DocumentLoad to Navigated. Didn\u0027t work for some reason. So I\u0027ll just leave it as it is now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T14:39:46Z\u0022 title=\u002205/12/2013 02:39  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by Norway174\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Soulshifter","CreatedById":58039,"CreatedDateTime":"2013-05-12T18:13:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norway174\u0022 data-cite=\u0022Norway174\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EPutting this in the navigating sub, would get the old document. Or page.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, you would think there would be some way to intercept the stream and change it before it is displayed. You got my interest peaked, I am going to have to look into this(in between working on my own app \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-12T18:21:09Z","Content":"\n\u003Cp\u003EWell... You could get the new URI fairly quickly, then using a WebClient to get the web-page code before loading it with the Web-Browser. Tweak it. Then display the result in the Web-Browser.\u003C/p\u003E\u003Cp\u003EHowever, using that method, the Web-Browser won\u0027t actually display the real page. It would display a modified copy locally.\u003C/p\u003E\u003Cp\u003EFeel free to contact me on skype if you wish to communicate this further. Or would like some assistance. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"betaking","CreatedById":58281,"CreatedDateTime":"2013-05-12T20:47:42Z","Content":"\n\u003Cp\u003EI cannot install interiors\u003C/p\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-12T21:24:17Z","Content":"\n\u003Cp\u003EI know. Check the changelog. It\u0027s already fixed. Just not released yet. But I will soon. Probably right after I post this in fact.\u003C/p\u003E\n"},{"CreatedByName":"Pontiac","CreatedById":62216,"CreatedDateTime":"2013-05-17T14:49:49Z","Content":"\n\u003Cp\u003EI like the new addition to the Bridge. Now, pending SpacePort doesn\u0027t change the linking method.... {grin}\u003C/p\u003E\u003Cp\u003EI was actually thinking of writing this kind of application prior to running into this one, in that it links with SpacePort, scrapes all links and descriptions it can find on each page, then presents simple links. I\u0027m not a fan of the 3x3 layout and tonnes of clicking to get through whats offered. But, the fact that the site is there to begin with, I CAN DEAL!\u003C/p\u003E\u003Cp\u003EExcellent work, and thanks again!\u003C/p\u003E\u003Cp\u003EBTW, when I right-click on a row, is it possible to move the popup to near where the mouse cursor is, instead of the app hitting the dropdown on Edit menu?\u003C/p\u003E\n"},{"CreatedByName":"Phenom Anon X","CreatedById":66562,"CreatedDateTime":"2013-05-17T16:02:26Z","Content":"\n\u003Cp\u003EWell, I\u0027ve finally gone and done it; found a good reason to register an account here on the forums.\u003C/p\u003E\u003Cp\u003EI do so to say, Thank You!\u003C/p\u003E\u003Cp\u003EI probably would not have spent nearly as many hours playing and experimenting with KSP if it wasn\u0027t for the easy removal and addition of other mods. Hands down (next to MechJeb), this is the single most useful tool I have for the game. \u003C/p\u003E\u003Cp\u003EThe reason I ended up here today was to figure out what Bridge does and I have to say, WOW! Why I didn\u0027t just click the button before to figure out what it does is beyond me, but I was floored at how much more simple it makes things for me :-)\u003C/p\u003E\u003Cp\u003EOnce again, Thank You for your continued work on this incredibly useful tool :-)\u003C/p\u003E\u003Cp\u003ESincerely,\u003C/p\u003E\u003Cp\u003EPAX\u003C/p\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-17T16:33:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pontiac\u0022 data-cite=\u0022Pontiac\u0022\u003E\u003Cdiv\u003EI like the new addition to the Bridge. Now, pending SpacePort doesn\u0027t change the linking method.... {grin}\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHonestly, I don\u0027t think it will be a problem. Because of the method I\u0027m using. It will work with any link. (As a security precaution, you \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ewill always\u003C/span\u003E be able to cancel the download. Which will automatically delete the file.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBTW, when I right-click on a row, is it possible to move the popup to near where the mouse cursor is, instead of the app hitting the dropdown on Edit menu?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a small bug I\u0027ve yet to fix. It only happens once. If you close the pop-up and right click again, it will be at the mouse, like it should.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Phenom Anon X\u0022 data-cite=\u0022Phenom Anon X\u0022\u003E\u003Cdiv\u003EWell, I\u0027ve finally gone and done it; found a good reason to register an account here on the forums.\u003Cp\u003EI do so to say, Thank You!\u003C/p\u003E\u003Cp\u003EI probably would not have spent nearly as many hours playing and experimenting with KSP if it wasn\u0027t for the easy removal and addition of other mods. Hands down (next to MechJeb), this is the single most useful tool I have for the game. \u003C/p\u003E\u003Cp\u003EThe reason I ended up here today was to figure out what Bridge does and I have to say, WOW! Why I didn\u0027t just click the button before to figure out what it does is beyond me, but I was floored at how much more simple it makes things for me :-)\u003C/p\u003E\u003Cp\u003EOnce again, Thank You for your continued work on this incredibly useful tool :-)\u003C/p\u003E\u003Cp\u003ESincerely,\u003C/p\u003E\u003Cp\u003EPAX\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you!!! That really does mean a lot to me. :-)\u003C/p\u003E\u003Cp\u003EIf you have any questions about Bridge (or KSPMM), feel free to ask.\u003C/p\u003E\n"},{"CreatedByName":"JeBuSBrian","CreatedById":66324,"CreatedDateTime":"2013-05-17T17:21:29Z","Content":"\n\u003Cp\u003EGot a feature request, if you\u0027re feeling up to it.\u003C/p\u003E\u003Cp\u003EI would like to be able to select which parts of a mod I want to install. Basically, there are some large packs that come with adapters that I\u0027ll never use, so they just end up cluttering my VAB menus. At the moment, I delete them by hand. But an \u0022advanced\u0022 installation method in the manager, which gave you a list of parts that you can check on/off would be nice. Sort of like a real software installer.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EJust ran across an exception, too. I had 5 mods installed. I deleted the 2nd in the list. Then I deleted the last in the list. ArgumentOutOfRangeException.\u003C/p\u003E\u003Cp\u003EAlso, you don\u0027t need tooltips on all of the menu buttons. They only serve to obstruct the sub-menu items.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-17T17:35:55Z\u0022 title=\u002205/17/2013 05:35  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 17, 2013\u003C/time\u003E by JeBuSBrian\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-17T22:54:42Z","Content":"\n\u003Cp\u003EAbility to disable certain parts of a mod has been suggested before. Along with Mod overwrite compatibility. I\u0027m currently working on a system to deal with both of them at the same time. But I\u0027m still wondering on how to implement it programmatic wise without breaking the advanced unpacking/installing sub I currently have.\u003C/p\u003E\u003Cp\u003EI will look into the \u0022ArgumentOutOfRangeException\u0022-error you have. If I can reproduce it, I am 99.9% certain I will be able to fix it.\u003C/p\u003E\u003Cp\u003EAnd I suppose you are right about the ToolTip. The name on them itself should hopefully have enough explanation. I\u0027ll leave it on for a few in some scenarios.\u003C/p\u003E\u003Cp\u003EThanks for the feedback.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E I\u0027m wondering if anyone who does YouTube reads this thread? I\u0027ve tried contacting Lord Stimpy again, but no response yet.\u003C/p\u003E\u003Cp\u003EIf anyone would be so kind to make a new and more updated YouTube video, I would appreciate it a ton. PM me if you wish to make it a bit more \u0022official\u0022 for KSPMM. So I can feature in the WelcomePage in KSPMM. The reason of that, I have a few requirements that needs to be met before I want to use it the Welcome Page. The requirements aren\u0027t that hard or ridiculous, so I would encourage anyone who wants to give it a shot to PM me.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-17T23:13:01Z\u0022 title=\u002205/17/2013 11:13  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 17, 2013\u003C/time\u003E by Norway174\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JeBuSBrian","CreatedById":66324,"CreatedDateTime":"2013-05-18T00:40:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norway174\u0022 data-cite=\u0022Norway174\u0022\u003E\u003Cdiv\u003EAbility to disable certain parts of a mod has been suggested before. Along with Mod overwrite compatibility. I\u0027m currently working on a system to deal with both of them at the same time. But I\u0027m still wondering on how to implement it programmatic wise without breaking the advanced unpacking/installing sub I currently have.\u003C/div\u003E\u003C/blockquote\u003EI\u0027d suggest looking at the mod manager over at NexusMods.com. Over the years, they\u0027ve built up two different mechanisms for modders to script install packages. A simple XML path, or a more precise C# script framework.\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-18T01:52:22Z","Content":"\n\u003Cp\u003EMhm. Yeah. I\u0027ve kinda designed mine with inspiration from theirs. At least for the kspmm:// downloadable links. But I couldn\u0027t get any site to include a download link with kspmm:// so instead I made Bridge.\u003C/p\u003E\u003Cp\u003EI have been thinking about making scripts to let modders setup install packages. But I don\u0027t know how popular it would be. Same with the info.txt KSPMM uses.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EAs far as I know, only one mod actually has a Info.txt. And that is MechJeb.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-18T12:26:42Z\u0022 title=\u002205/18/2013 12:26  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 18, 2013\u003C/time\u003E by Norway174\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2013-05-18T05:19:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norway174\u0022 data-cite=\u0022Norway174\u0022\u003E\u003Cdiv\u003EAs far as I know, only one mod actually has a Info.txt. And that is MechJeb.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbal Alarm Clock has it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-18T12:25:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trigger Au\u0022 data-cite=\u0022Trigger Au\u0022\u003E\u003Cdiv\u003EKerbal Alarm Clock has it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice! I endorse and approve of every mod that uses the Info.txt. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mosheen","CreatedById":64122,"CreatedDateTime":"2013-05-18T23:09:58Z","Content":"\n\u003Cp\u003EChrome flags the download as malicious. Any explanation for that? I really don\u0027t like hearing the browser click all of the time either. What\u0027s going on with external connections?\u003C/p\u003E\n"},{"CreatedByName":"Norway174","CreatedById":29247,"CreatedDateTime":"2013-05-19T17:59:54Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Mosheen:\u003C/strong\u003E I wouldn\u0027t know about Chrome. As I personally use Opera. But isn\u0027t that just what Chrome does? Flag everything as malicious before you accept it?\u003C/p\u003E\u003Cp\u003EI can assure you that there is nothing malicious with KSPMM. As the Sourcecode is freely available, you are welcome to check yourself.\u003C/p\u003E\u003Cp\u003EAs for the browser click, I assume you mean the Bridge? I\u0027m sorry about that, as it is the browser control I am using that\u0027s doing it. And there is very little to nothing I can do to solve it.\u003C/p\u003E\u003Cp\u003EI personally don\u0027t have my sounds on speakers anymore, as I usually only use Headphones when I play games or watch YouTube.\u003C/p\u003E\u003Cp\u003EAnd the URL\u0027s for the external connections are also available in my sourcecode. They should mostly be declared at the top on the main form.\u003C/p\u003E\u003Cp\u003EI hope this clear up a bit of confusion and possible any suspicion? If there is anything else, I\u0027d be happy to help.\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-05-20T16:53:40Z","Content":"\n\u003Cp\u003EA few things:\u003C/p\u003E\u003Cp\u003E-The shoutbox displays the timeStamp wrong if you click it to order from the earliest post. It should sort posts by day and hour, not hour and day. Posts from early in the morning but from other days end up at the top of the list.\u003C/p\u003E\u003Cp\u003E-This bug is strange and I\u0027m not sure it\u0027s because the OS I\u0027m running the Mod Manager in (Windows 8 Pro x64), but here it comes: The Mod Manager renames mods on the list to the exact same name and info of another mod at the list. I figured that might have been my fault for not downloading the mods using Bridge, but it happens even with them being downloaded from Bridge. The mods in question are Kerbal Alarm Clock and Deadly Reentry. Both appear on the list as Deadly Reentry. Since it\u0027s not possible to rename Mods on the list, I\u0027m left to wonder which is which. I stopped adding mods to the list in fear more of them end being renaming to the same name of other mod on the list.\u003C/p\u003E\n"}]}