{"TopicId":63185,"ForumId":35,"TopicTitle":"[Web project] KSP configurable pre-launch Checklist","CreatedByName":"nobody44","CreatedById":66369,"CreatedDateTime":"2014-02-14T15:24:25Z","PageNum":1,"Articles":[{"CreatedByName":"nobody44","CreatedById":66369,"CreatedDateTime":"2014-02-14T15:24:25Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI guess everyone of us has launched some probes or ships into space that turned out to be a modern trashcan (sometimes with Kerbals in it), simply because it was missing some very crucial parts, like solar panels, a Kethane drill, batteries, you name it.\u003C/p\u003E\u003Cp\u003ERecently I launched a Kethane miner and right when I decided to land on Pol (in the Joolian system) I noticed that I am missing something: A Kethane drill. So again: Launch a new Kethane mining ship and put it in a Jool-Transfer-Orbit. And to fasten things up I decided to launch another mission, a Kethane miner to Duna. They both had one thing in common: They did not have a Kethane storage apparatus. Three missions wasted (plus time).\u003C/p\u003E\u003Cp\u003EThat was when I decided that I need a checklist. Some checklists I have seen so far are very static (except the plugin I have seen), so the vision was, that the user selects the mission targets for the craft he is building, and the web page produces all necessary items on that checklists.\u003C/p\u003E\u003Cp\u003ESo, here is the result: \u003Ca href=\u0022http://pweingardt.github.io/kspchecklist/\u0022 rel=\u0022external nofollow\u0022\u003EPages hosted on github\u003C/a\u003E. \u003Ca href=\u0022https://github.com/pweingardt/kspchecklist\u0022 rel=\u0022external nofollow\u0022\u003E(Project on github, GPLv3)\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMaybe some of you find it helpful.\u003C/p\u003E\n"},{"CreatedByName":"Dr. Kriger","CreatedById":107995,"CreatedDateTime":"2014-04-09T08:09:16Z","Content":"\n\u003Cp\u003ESuper helpful, I am constantly forgetting parts on my rockets and this will help me greatly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T10:18:47Z\u0022 title=\u002204/12/2014 10:18  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by Dr. Kriger\u003C/strong\u003E\n\u003Cbr\u003Efixed some weird format issue\n\u003C/span\u003E\n"},{"CreatedByName":"Boosterspice","CreatedById":58629,"CreatedDateTime":"2014-04-09T17:41:25Z","Content":"\n\u003Cp\u003EIt\u0027s a very good initiative, I must say. Great checklist \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"}]}