{"TopicId":96640,"ForumId":35,"TopicTitle":"[Early Access][Web app] metaedit: CKAN meta-file online editor","CreatedByName":"avivey","CreatedById":98217,"CreatedDateTime":"2015-01-14T06:35:27Z","PageNum":1,"Articles":[{"CreatedByName":"avivey","CreatedById":98217,"CreatedDateTime":"2015-01-14T06:35:27Z","Content":"\n\u003Cp\u003EIt\u0027s a browser based tool to assist in editing CKAN meta files.\u003C/p\u003E\u003Cp\u003EThe longer-term goal of the tool is to allow non-technical users to edit these sorts of things directly, without needing to understand git, or even how to write a JSON. This is probably not a huge problem for the modding community, but I have hopes to use the same tool as a base for similar cases[1].\u003C/p\u003E\u003Cp\u003EIt is (Or, at least, should be) a little more convenient then using a text editor to edit the content directly.\u003C/p\u003E\u003Cp\u003EIt\u0027s very early in it\u0027s lifecycle, but it is kinda usable already: You can edit files, save/save as, have multiple \u0022projects\u0022 (branches), and issue a pull-request. \u003C/p\u003E\u003Cp\u003EThe editor is a schema-aware JSON editor: It follows the schema defined for CKAN, and will validate the content before saving.\u003C/p\u003E\u003Cp\u003E(For the sake of consistency, the resulting json file has it\u0027s keys sorted; This means that consecutive edits of the same file will show up nicely in the diff page. It also means that the first edit will not show up nicely in a diff page).\u003C/p\u003E\u003Cp\u003EI would appreciate feedback on usability, and active help on the whole \u0022make it pretty\u0022 side - I\u0027m pretty bad at that.\u003C/p\u003E\u003Cp\u003EIt\u0027s live at \u003Ca href=\u0022https://avivey.github.io/metaedit/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://avivey.github.io/metaedit/\u003C/a\u003E, and as source at \u003Ca href=\u0022https://github.com/avivey/metaedit\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/avivey/metaedit\u003C/a\u003E \u003C/p\u003E\u003Cp\u003E[1] This is actually a pattern I\u0027ve seen in the real world many times.\u003C/p\u003E\n"}]}