{"TopicId":101058,"ForumId":34,"TopicTitle":"[1.0.x] Civilian Population 1.4","CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2015-03-01T22:38:20Z","PageNum":1,"Articles":[{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2015-03-01T22:38:20Z","Content":"[Civilian Population Mod on KerbalStuff](https://kerbalstuff.com/mod/620/%5B.90%5D%20Civilian%20Population)\n\nLicensed under a CC-BY-NC-4.0\n\nTurn your Kerbal society into a Type 1 Civilization ([Kardashev_scale Type_I](https://en.wikipedia.org/wiki/Kardashev_scale#Type_I) by adding civilian exploration! Your agency as research goes on gains the ability to have civilians take part on your exploration, ultimately letting you recruit new crew members from the population (the motivation for taking civilians with you). Scroll to the bottom of this post for a quick howto!\n\nPart List:\n\nCivilian quarters (3 sizes)\n\nCivilian contractor dock: allows civilian population to grow while in kerbin space\n\nGarden modules and farm biodome to feed the civilian population\n\nResource containers\n\nLaser drill for in-situ resources\n\nRecruitment centers : Movie theater, university, flight school\n\n ![5vkYakn.png](http://i.imgur.com/5vkYakn.png)\n\n**How to manage your civilian population**\n\nCivilian kerbals are not like your astronaut kerbals. They require food to survive and have not been trained on how to eat a diet of snacks. The management of your civilian population relies on generating enough food for them. If you have enough food they\u0027ll live. If you don\u0027t they\u0027ll die off. It\u0027s that simple. \n\n*Space Tourism*\n\nCivilians will flock to your space stations and bases which can support them. You can either transport them yourself or you can hire Civilian space agencies to transport them for you. The space agencies gave Netherdyne plans for a universal docking port which their transports will use. Attach the port to your station or base and you civilians will come. Space tourism is limited to the kerbin system (Kerbin, Mun, Minmus).\n\n*Civilian reproduction and long voyages*\n\nIf your civilian population is big enough (more than 50) they\u0027ll start reproducing. This will produce a new recruitment able Kerbal every 3 kerbin months. \n\n**Understanding the stats on the Civilian Quarters parts**\n\nEvery civilian quarters part will show you the statistics for your population\u0027s voyage\n\n- Food per pop: This is the minimum amount of food your ship\u0027s stores must have on hand to support the population. To get the required amount multiply this by the size of your civilian population. It\u0027s easy: 1:1. So 50 population requires a minimum of 50 food to support. Each farm module is scaled to support a 1:1 quarters to farm size. The large biospheres support the largest of population capacities. Each farm tells you how much population it can support.\n- Population Growth Rate: this is the time in seconds it takes for your population to grow through reproduction.\n- Population Decay Rate: this is the time in seconds it takes for your population to decay.\n- Growth and Decay timers: these show the current state of growth or decay. When these pass their respective rate the population will change by 1.\n- Reproduction rate: this is the minimum population your ship needs to start reproduction. The speed your population grows at scales based on how big it is beyond this. A population of 150 will reproduce 3 times faster than a population of 50.\n- Total consumption rate: this is how fast your population is consuming food\n- civilianDock: If you have a civilian contractor dock attached to your ship this indicates it.\n- civilianDockGrowthRate: this scales your ship\u0027s growth rate by the number indicated. Scale is 1000 for kerbin and kerbin orbit, 100 for Mun, 10 for Minmus.\n- GrowthRate: This is how fast your population is growing.\n- Recruit Kerbal: You can recruit a new crew member from the population onboard the module. Each Civilian module except the dock supports a number of Crew slots.\n\n*Population changes over time, even when you\u0027re not watching!*\n\nThe civilian population on your ship or base will change over time even when you\u0027re doing something else (flying another mission perhaps). How the population fares depends on how well you managed the food on your ship. Make sure your ship, station, or base has food and all the farms are operational before you leave it!\n\n**Individual Parts**\n\n*Civilian Contractor Dock*\n\n![MJ8p3AT.png](http://i.imgur.com/MJ8p3AT.png)\n\nThe Civilian Contractor dock allows civilian space agencies to deliver passengers to your station or base. You must have enough food to receive the passengers before they arrive.\n\n*Small Civilian Apartment*\n\n![NrcUaTc.png](http://i.imgur.com/NrcUaTc.png)\n\nThis gives a small but adequate place to stay for 8 civilians. Has 3 slots for crew. This fits a 2.5 meter diameter ship.\n\n*Large Civilian Quarters*\n\n![ZazyODV.png](http://i.imgur.com/ZazyODV.png)\n\nHas enough room for 25 civilians and 4 crew. The core is 3 meters wide.\n\n*Civilian Apartment Complex*\n\n![0GU8BEa.png](http://i.imgur.com/0GU8BEa.png)\n\nHas enough room for 60 civilians and 8 crew. The core is 3 meters wide.\n\n*Farm Biodome*\n\n![gSAXepj.png](http://i.imgur.com/gSAXepj.png)\n\nIntended for use on a surface the farm biodome supports up to 60 civilians. \n\n*Garden Biosphere*\n\n![Q64kxiO.png](http://i.imgur.com/Q64kxiO.png)\n\nThe garden biosphere supports 50 civilians and is better suited for orbit and flight than the ground. The white core is 3 meters diameter.\n\n*Small Garden Biosphere*\n\n![xwyJkU2.png](http://i.imgur.com/xwyJkU2.png)\n\nThe small garden biosphere supports 25 civilians. The white core is 3 meters diameter.\n\n**Small Hydroponic Garden**\n\n![xeGlATe.png](http://i.imgur.com/xeGlATe.png)\n\nThe small Hydroponic garden supports up to 8 civilians. This module fits a 2.5 meter diameter ship\n\n**Netherdyne Construction Drone**\n\n![9Yp43Z1.png](http://i.imgur.com/9Yp43Z1.png)\n\nThe netherdyne construction drone allows users of Extraplanetary Launchpads to build bases and stations with \u0022robots\u0022 before sending a crew up. This would make sense in a way: in real life we would probably build a moon base with robots before the first crew arrive. This part does nothing if you don\u0027t have Extraplanetary Launchpads\n\n**University**\n\n![gPtqYCz.png](http://i.imgur.com/gPtqYCz.png)\n\nThe orbital university has a science lab built in for processing research experiments. Can recruit Level 3 engineers and scientists\n\n**Flight school**\n\n![qm1PoQ0.png](http://i.imgur.com/qm1PoQ0.png)\n\nThe flight school has attach points on the landing pads (though one of them has the door for the crew). Can recruit Level 3 pilots.\n\n**Movie Theater**\n\n![gzavwPF.png](http://i.imgur.com/gzavwPF.png)\n\nKerbals must be inspired to work on a specific job. Select a type of movie to play to gain a discount on recruiting that type of crew member.\n\n**Resource pods**\n\n![zrrQbih.png](http://i.imgur.com/zrrQbih.png)\n\nLeft to right:\n\nFertilizer container (biomass, water)\n\nGas container(oxygen, carbon dioxide)\n\nSustenance container (food, water)\n\nWaste container (waste, wastewater)\n\nThese pods will store various resources your ship or base needs. All of them are surface attach. Most are less than 1 ton weight. The fertilizer one can get up to 7 tons though (that provides a lot of food).\n\n**inline substrate/water pod**\n\n![RIIDiQU.png](http://i.imgur.com/RIIDiQU.png)\n\nThis pod carries 1000 units of water and substrate mined from a surface.\n\n**Laser Drill** (the green lasers on the right)\n\n![zSfhiuC.png](http://i.imgur.com/zSfhiuC.png)\n\nThe laser drill allows you to extract the substrate and water from a planetary surface for your colony. It contains the converter to change the materials into biomass. This converter uses water to convert the substrate to biomass. Turns out bacteria like that material.\n\n**Managing your Civilian Population**\n\n**Basics**\n\nCivilian Population requires food, water, and oxygen to survive. They will produce Carbon Dioxide, Waste Water, and Waste. Each civilian module (except the contractor dock) has space for 1 kerbin-day\u0027s worth of waste and 1 kerbin day-s worth of needs for the population that it supports.\n\nProduction of food requires biomass and water. Food is produced at a garden module or at the farm biodome.\n\nGarden modules and the farm biodome are equipped with recyclers which can convert the waste water and waste back into water and biomass. The plants inside also act as natural scrubbers, clearing out the CO2 and producing Oxygen. The farms do not come with biomass storage. These must be attached through way of the fertilizer pod. Use of the other resource pods is recommended for an extra buffer of resources. If a waste resource builds up to the cap the excess will be dumped out into space. It is thus imperative that you keep the recycler running. The recyclers will outpace the waste production for their intended population size. \n\nThe biodomes and civilian modules are paired together to make managing this simple. The civilian population will grow once it is larger than 50 members. This growth requires a kerbal\u0027s mass in food (about 380 food). They may also come to your base or station through way of the civilian contractor dock. When they immigrate to your station, ship, or base this way they don\u0027t consume 380 food per growth. Farm food stores can be quite massive, equating to roughly 120 days worth of food for one kerbal on the small garden. That is because the colony\u0027s population growth will need the food.\n\n![zSfhiuC.png](http://i.imgur.com/zSfhiuC.png)\n\nThe pictured land crawler shows everything you need to maintain your civilian population and to grow it. Left to right: mining container, garden, fertilizer for garden, Civilian pod, laser drill.\n\n**In-situ resource utilization**\n\nWater and substrate must be present in some amount at the landing site for your colony (much like MKS) for you to get the resources to grow the civilian population. The laser drill can be used to grab these resources. If you have MKS then you can use those parts to get the resources as well. The laser drill has the same efficiency as those parts.\n\n**Recruiting specific job kerbals**\n\nIf you wish to recruit kerbals with specific jobs (pilot, engineer, scientist) you can use the movie theater, university, and flight school.\n\nThe **movie theater** is the basic part required for this. Your kerbals need inspiration for them to decide that they want to do a specific job. To get that inspiration you play movies for them in the theater. Select a type of movie to get a bonus to recruitment for the job it matches:\n\n- Racing movies: Engineer kerbals are inspired by the act of tuning up a vehicle to win races. Playing these movies makes engineer recruitment 10% cheaper.\n\n- Scifi movies: Pilot kerbals are inspired by dogfights, things blowing up, basically what Jeb grew up on. Play these movies to get a 10% cost reduction on pilots.\n\n- Documentaries: Scientist kerbals love documentaries about the solar system, plants, animals, and space exploration. They especially love the ones they wrote ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Play documentaries to get a 10% cost reduction on scientist recruitment.\n\n\\*\\* All recruitment costs 50 inspiration, unless you\u0027re playing a matching movie type.\n\nThe **University** comes in when you want an educated kerbal Scientist or Engineer. See the movie theater makes a kerbal think he knows what he\u0027s doing. A university makes sure he knows. The university has a science lab for the scientists to process research experiments.\n\nTo recruit a level 3 Scientist or Engineer requires 5000 education and 50 inspiration. Open Classes to start the education. Educating a new kerbal will take roughly 10 kerbin days.\n\nThe **Flight school** comes in when you want a pilot who crashes less than Jeb. \n\nTo recruit a level 3 Pilot requires 5000 flight experience and 50 inspiration. Open classes to start the training. Training a new pilot takes roughly 10 kerbin days.\n\n**Rent**\n\nCivilians generate Rent now! Earn 100 funds per civilian per day as they live in your apartments on your station, ship or base.\n\n**Robotic construction facilities**\n\nThe laser drill now has an ore drill on it. The netherdyne smelters return as well. Combine the Cnc Mill, smelter, Construction drone, and laser drill to enable construction of bases or stations in situ without the need for a kerbal present (though you may want one or two to place survey stakes). You still need to find suitable ore deposits. In situ construction requires Extraplanetary Launchpads. \n\n ****  **1.4 released!**  **** \n\n1.4 updates Civilian Population for 1.0.x KSP (tested with 1.0: 1.0.x currently does not have significant changes that impact my testing)\n\nI\u0027ve allowed the use of Ore in the converters to serve as a commonly dug up resource which you can then extract other resources from with the Civilian Population Converters. Note that the Karbonite smelter is obsolete with stock fuel system. Other than that...\n\n\\* The laser drill\u0027s converter will extract Water, Biomass, and Carbon Dioxide from ore. Stock Ore can be converted into rocket fuel so this assumes that the stock ore contains hydrocarbons which would convert into biomass and water. \n\n\\* Civilian Population also assumes the stock ore contains metals which allows the original Ore-Metal-RocketParts resource path for Extraplanetary Launchpads. This should make locating your industrialized base simpler than before.\n\nI\u0027m taking a break from Kerbal Space program after this update, gettin into other games. I\u0027ll be watching to keep Civ Pop current with the KSP releases. Godspeed!\n\n**New in 1.3**\n\n**New textures on pretty much everything**\n\nSome parts were sufficiently detailed to not receive new textures. Others got brand new texture work. Biosphere domes, civlian pods, farms all got reworked.\n\n**New IVAs for most of the parts**\n\nAll of the pods got new IVAs except the movie theater and the airlock. The movie theater is because I don\u0027t have the plugin made for it. The airlock is because it operates with 2 doors so you can get in and out of a biosphere or biodome.\n\n**New part: MK2 Cruiser Landing Gear**\n\n![cUWABEh.png](http://i.imgur.com/cUWABEh.png)\n\n**Balance updates**\n\n- Rent generated from a single city now meets diminishing returns. Up to 50 civilians will get the full 100 rent per civilian. After that it drops off by 1 per extra civilian. By 150 civilians you will only receive 10 funds per civilian with each rent cycle.\n- Farms are re-balanced to have the correct energy consumption. The large biosphere farm will require about 12 Gigantor XL solar panels to keep powered up.\n- The large Biosphere farm now supports 70 kerbals (roughly)\n- The Biodome Farm Mark 2 now supports 70 Kerbals (roughly)\n- The substrate converter on the Laser Drill no longer creates extra water (previously it would produce 5x the water that was input into it)\n- The construction drone now produces 30 productivity at the cost of 5kw electricity per second\n- The biosphere airlock can now store science experiments. Go do that EVA you wanted to!\n\n**Bug fixes**\n\n- The Construction Drone now properly works with 5.1.2 Extraplanetary Launchpads\n- The duplicated Regolith.dll is no longer needed. I added the KSPDependency information.\n- Extraplanetary Launchpads is added in the KSPDependency information. It is required to use the construction drone.\n\n**About the Movie Theater and why it does not have an IVA yet** \n\nThis is because I do not have the necessary plugin created to play movies inside of it! This will come probably in 1.4 with the cruiser parts expansion.\n\n**New in 1.2**\n\n**New civilian house and landing pads**\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/yQsaZ)\n\n**Jumbo Truss system**\n\nFacilitate the construction of huge generation ships with the jumbo truss system. \n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/IShJT)\n\n**Biodome and Biosphere system**\n\nBuild your Type 1 civilization base with biodomes, and the generation ships with biospheres. The construction of a permanent city on a body without any atmosphere would require the use of biodomes to contain atmosphere. \n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/vCCwG)\n\n**Cruiser landing gear**\n\nThe cruiser landing gear was born out of necessity. When operating a base where the weight can change the base can shift angle slightly by several degrees, causing some parts to clip into the ground when they really shouldn\u0027t have. Landing gear is proven the only thing that prevents this kind of shifting. To make very well sure that this glitch never kills a base again I created the cruiser landing gear. With 3 meters of play and up to 6 meters off the ground your base will never clip into the ground ever again, at least unless you made it 1km wide, then I can\u0027t save you.\n\n![WgtNhqe.png](http://i.imgur.com/WgtNhqe.png)\n\n**City and ship album**\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/hK4M9)\n\n**Some FAQS**\n\n**Is TAC Life support needed** \n\nNo. If you have it this mod may make it easier to manage though. I balanced the civies to consume 1kg of food/water per day and .1kg of oxygen per day. These are in kerbin days (6 hours). Depending on how you\u0027ve configured TAC life support your crew may use more or less resources. They are the same resources. Unfocused ship simulation should be compatible as I use Regolith and MKS uses it and MKS is compatible with TAC.\n\n**Do I need MKS?**\n\nNo. It enhances the experience though, providing parts to expand your base or station with. MKS unfocused simulation is now compatible.\n\n **Other mods which may help the experience** \n\nScansat (for resources)\n\nExtraplanetary launchpads (for building huge cities on a planet)\n\nHangar Extender: For building Generation ships with the new parts in 1.2\n\nChange list:\n\n1.2: new biodome/biosphere framework, large truss parts. Fixed issue where civilians stop using resources when undocking from a station or base, and where docking may have caused double the resource consumption.\n\n1.1: moved everything to regolith. Civilian population regulation extends regolith. This should make my mod MKS and TAC LS compatible (I didn\u0027t test TAC tho).\n\n1.0: initial release of the completed system. Uses food from other life support mods\n\n0.1.2 \n\nChanged the Food definition to a new Civilian\\_food, which encompasses all of their current life support needs.\n\nFixed the door on the civilian quarters\n\n0.1.1\n\nFixes a bug in all of the modules added so that they start properly.\n\n**Edited \u003Ctime datetime=\u00222015-05-30T14:01:31Z\u0022 title=\u002205/30/2015 02:01  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 30, 2015\u003C/time\u003E by DuoDex**\n  \n1.4 release (forgot to mention the new part)"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-03-01T22:42:19Z","Content":"I\u0027ll check this out! Is TAC Life Support needed?"},{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2015-03-01T22:50:16Z","Content":"TAC life support is not needed, it uses the Open Resource System food definition."},{"CreatedByName":"micr0wave","CreatedById":136352,"CreatedDateTime":"2015-03-01T22:54:07Z","Content":"Ohh nice. Does it collaborate with TAC and MKS ?"},{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2015-03-01T23:06:02Z","Content":"I didnt collaborate with those. I\u0027ll check out MKS and how it works with it. Only problem I foresee right now is that the civies will eat food at a different rate from the crew on a MKS base. So long as you use the packed farms that should be fine.\n\n**Edited \u003Ctime datetime=\u00222015-03-01T23:08:48Z\u0022 title=\u002203/01/2015 11:08  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 1, 2015\u003C/time\u003E by michaelhester07**"},{"CreatedByName":"micr0wave","CreatedById":136352,"CreatedDateTime":"2015-03-01T23:43:49Z","Content":"as long it\u0027s the same kind of food all the brave kerbonauts have to eat, i\u0027m fine ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Joshwoo70","CreatedById":111345,"CreatedDateTime":"2015-03-02T01:24:46Z","Content":"I looked through the parts.cfg and realised it goes well with tac which specifies food As a resource. So I may make a MM patch for tac ls.\n\nEDIT:\n\nlooked through again i think the bio domes needs some tweaking to work with TAC...\n\nedit 2:\n\ndecided to let someone do the CFG. should totally work with TAC.\n\n**Edited \u003Ctime datetime=\u00222015-03-02T11:47:30Z\u0022 title=\u002203/02/2015 11:47  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 2, 2015\u003C/time\u003E by Joshwoo69**"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-03-02T03:55:30Z","Content":"Amazing pack. This is under cosideration for,my kerbal space colonies youtube series"},{"CreatedByName":"Xaver","CreatedById":46640,"CreatedDateTime":"2015-03-02T11:15:35Z","Content":"Uh, i like it! It adds a nice amount of a strategy game to ksp. I think i miss that amount a little bit in 1.0.\n\n**Edited \u003Ctime datetime=\u00222015-03-02T11:19:43Z\u0022 title=\u002203/02/2015 11:19  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 2, 2015\u003C/time\u003E by Xaver**"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-02T13:32:06Z","Content":"So basically, we can create legitimate colonies on other planets where the population grows on its own?"},{"CreatedByName":"Ratzap","CreatedById":75982,"CreatedDateTime":"2015-03-02T13:53:56Z","Content":"Good lord, what a large chunk of work you\u0027ve been sitting on. /applause"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-03-02T14:07:17Z","Content":"Mmm nice, looks like I\u0027ll give this a try ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2015-03-02T14:29:19Z","Content":"**Beautiful biodomes!!!** Do they also have beautiful illumination?"},{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2015-03-02T14:37:28Z","Content":"Few questions... all answers:\n\nYes, you can build a legitimate colony on another world and have it grow on its own. \n\nSadly no, the biospheres don\u0027t have lights. At least the large one doesn\u0027t. The small ones do have em. You can fix that by adding them separately. I had to take the lights out due to rendering performance."},{"CreatedByName":"Cornholio","CreatedById":94349,"CreatedDateTime":"2015-03-02T14:41:59Z","Content":"This looks really cool. I would love to see collaboration with TAC."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-03-02T14:50:11Z","Content":"ThatÃ‚Â´s a very nice idea. I really like it!"},{"CreatedByName":"mysteriosmind","CreatedById":128626,"CreatedDateTime":"2015-03-02T21:01:12Z","Content":"I totally agree that this a really nice idea! Civilian colonization could be a really fun thing to do later in the career. Would be really interesting to see the base building/managing aspect expanded (maybe through a modmod) adding things to keep civilian population happy, healthy, sane and maybe adding a thing like a training compound you need to draft civilians into astronauts (maybe give some starting experiance), maybe give the civilians some things to do like a factory building to expand the base offworld (construct megastructures with enough workers), build ships, maybe man research stations or work in resource extraction. But even in its current state it is a really cool addition!"},{"CreatedByName":"Joshwoo70","CreatedById":111345,"CreatedDateTime":"2015-03-03T01:24:44Z","Content":"\u003E \n\u003E -SNIP!-\n\nit was planned in ksp to have space tourism ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nBut this guy jumped the gun and made the mod"},{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2015-03-03T03:00:20Z","Content":"Im sure Squad\u0027s implementation will be different. I had thought about the ideas Mind posted. Those may appear in a later update."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-03-03T05:28:33Z","Content":"What the heck? They can\u0027t live off of snacks? Blasphemy! Jeb has no use for Kerbals such as these....\n\nand they produce a recruitable (adult?) Kerbal every 3 *Kerbin months???*\n\nWell that definitely kills the \u0027Kerbals are plants\u0027 myth... Kerbals are obviously rabbits ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nWell, humor aside, this definitely looks interesting"},{"CreatedByName":"Joshwoo70","CreatedById":111345,"CreatedDateTime":"2015-03-03T09:00:52Z","Content":"\u003E \n\u003E Im sure Squad\u0027s implementation will be different. I had thought about the ideas Mind posted. Those may appear in a later update.\n\nNice! Maybe you can make a MM patch for tac?\n\n\u003C--- is bad at make mm patches ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"SyberSmoke","CreatedById":73912,"CreatedDateTime":"2015-03-03T10:17:20Z","Content":"I could see this as also a tie in to MKS. MKS has a lot of good qualities, but it depends on Kerbalnoughts. For me it would be interesting to see this have some effect on MKS so once the colony or station is past the pioneer phase, a kerbal population could grow and have a small blanket efficiency bonus (They would crew the facilities). In return may be allow your agri units to work (optionally) as mks compatible units for the production of food, air, etc.\n\nIt would be interesting to see what could be done after building a large colony with a population of hundreds."},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-03-03T14:28:18Z","Content":"This is looking good so far. Good work!"},{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2015-03-03T15:10:58Z","Content":"I\u0027ll get TAC tonight and see where I can go with this. I tried MKS and as fun and deep as it looked there was an aspect that I didn\u0027t like: How abysmally slow it was to get ore out of a rock. It wasn\u0027t just that it was slow, it was that I couldn\u0027t time warp it or the resource management glitched. It\u0027s in the way that resource management is handled on a ship. All the modules update sequentially so it is possible for modules later in the pipe to get resource starved even though your ship shows that it has enough resources onboard. I\u0027ll try MKS again with TAC tonight now that I\u0027m thinking of it, to add a bigger buffer for electricity, which is the big bottleneck. I feel like I have to have enough power on hand for 1 tick at max warp for each module before gains are added.\n\nI\u0027ve been working on making the generators in my farms timewarp compatible and some of that\u0027s already in the mod. My farm module generators will calculate their resource expenses before submitting them with the part.RequestResource function. This pre-calculation I hope prevents jumping resources at high timewarps. It seems to work on my end. \n\nAs of right now my farms are simple generators. I didn\u0027t want to make this too complex. Once I get into TAC and MKS and understand how the resource flow works I can add that to my farms and my civies."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-03-03T15:31:28Z","Content":"You might be a bit misinformed RE resources, etc. - generally if you have a resource starvation issue you are probably having issues with intermediary resources - I\u0027ve had zero issue doing unattended background mining and processing, including very long resource chains, over massive time differences (I usually test a harvesting and four-process resource chain over a decade or so when testing). EC is handled separately, and due to battery storage limitations operates on a different max-delta than other converters.\n\nRE the earlier post for efficiency, you would have to either subclass or rebuild the efficiency code to include non-kerbonaughts, though I\u0027d think it would make more sense to leave the actual base operations to the existing kerbonaughts.\n\nRE getting ore slow... Resource harvesting works in the background, no problemo"}]}