{"TopicId":105202,"ForumId":34,"TopicTitle":"[1.12.x] USI Life Support","CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-27T17:37:19Z","PageNum":89,"Articles":[{"CreatedByName":"BevoLJ","CreatedById":77242,"CreatedDateTime":"2016-04-28T00:34:29Z","Content":"[@Rhedd](https://forum.kerbalspaceprogram.com/index.php?/profile/112088-rhedd/) All the USI mods are well documented on their github wikis.  =)  Here is USI-LS\u0027 [https://github.com/BobPalmer/USI-LS/wiki](https://github.com/BobPalmer/USI-LS/wiki)"},{"CreatedByName":"Rhedd","CreatedById":112088,"CreatedDateTime":"2016-04-28T02:05:38Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, BevoLJ said:\n\u003E \n\u003E \n\u003E [@Rhedd](https://forum.kerbalspaceprogram.com/index.php?/profile/112088-rhedd/) All the USI mods are well documented on their github wikis.  =)  Here is USI-LS\u0027 [https://github.com/BobPalmer/USI-LS/wiki](https://github.com/BobPalmer/USI-LS/wiki)\n\u003E \n\nThank you! That\u0027s exactly what I was looking for. I could only find the one for MKS processing, for some reason."},{"CreatedByName":"Kerbal Pig","CreatedById":162989,"CreatedDateTime":"2016-04-28T05:05:00Z","Content":"I think I may have found a new bug:\n\nAll the new tanks provided in this mod, don\u0027t have their corresponding resources, it\u0027s no that they aren\u0027t filled, the resources are non-existent....\n\nAlso where it would normally say Rmb for more info, instead it says no more info.\n\nAnother thing:\n\nAre any other mods required for this mod to function correctly.\n\nMy Mod list(all on ksp 1.1):\n\n1)Planetary base mods\n\n2)USI-ls\n\n3)Kerbal engineer\n\n4)dock-alignment indicator\n\n5)Kerbal Alarm clock"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2016-04-28T10:10:24Z","Content":"\u003E \n\u003E \n\u003E 5 hours ago, Kerbal Pig said:\n\u003E \n\u003E \n\u003E My Mod list(all on ksp 1.1):\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 1)Planetary base mods\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 2)USI-ls\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 3)Kerbal engineer\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 4)dock-alignment indicator\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 5)Kerbal Alarm clock\n\u003E \n\nDo you have the community resource mod? [https://github.com/BobPalmer/CommunityResourcePack/releases](https://github.com/BobPalmer/CommunityResourcePack/releases)"},{"CreatedByName":"Tandoori","CreatedById":125040,"CreatedDateTime":"2016-04-28T15:43:01Z","Content":"I recently installed this mod. Last night, I sent a manned mission to Minmus for orbital scanning/mapping and landing/exploration. While I was scanning the surface from high orbit, my grace period ran out - and I then realized forgot to add supply containers. This was suprising because I had two orange-suited kerbals (Val and Bob) and a tourist on board. At first, I thought it was a glitch, but I found out from this thread that a more recent update defaulted the veterans to get \u0022grouchy\u0022 and refuse to work by default. I adjusted the config file and restarted the game, but I guess it was too late at that point, so I decided to \u0022play it as it lies\u0022. This turned out to be the much more fun option....  \n\nThe engineers at the Kerbin Space Center frantically put together an emergency probe to launch with a docking port that attaches to a small module consisting of 2 small supply canisters attached to a Science Jr, along with a couple extra goo canisters. and a docking port on each and for easy transfer and re-use. This was because the stuffed shirts up in Administration figured they might as well squeeze some more science out of it while they were at it.\n\nLaunch and rendezvous went without incident. I was only when it was time to begin the docking procedures that something was realized that caused the entirety of Kerbin to sigh and shake their heads -  Val\u0027s ship has a shielded docking port, and the hungry Kerbals were refusing to open it to allow their supply probe to dock. And so, they were still dead in space.  \n\nMeanwhile, back at the KSC, the R\u0026D department had just finished processing the Science data transmitted just before the Kerbals on the Minmus mission went on strike. From this, they barely managed to gain enough science data to create a new technological breakthrough - the KLAW! Quickly, the prototype was rushed to the VAB and retrofitted onto an identical ship as the Minmus exploration vessel currently adrift in orbit. They also had the foresight to add a 2.5m supply canister this time, too.   \n\nWith Jeb at the helm, the ship launched successfully, and, after a few misaligned attempts at grabbing the stranded vessel (causing it to tumble away a little, making the entire process that much more difficult), eventually was able to latch on. Val and her crew were able to finally have some snacks and perform the arduous task of flipping the switch that opens the docking port shield on the front of the command module. After that, the probe was able to deliver the supplies and science module without further incident, as well as transfer some fuel to top off the tanks in both ships as well. Once Jeb released the Klaw from Val\u0027s ship, both ships were ready to continue the mission - and a good thing too, because the space program was very nearly in the red after two unplanned emergency launches for this one mission. Luckily, we now have two ships in orbit around Minmus, ready to make multiple biome landings, which should help make up the budget overextension.\n\nIn the words of S.R. Hadden from Contact: First rule of government spending: why build one when you can build two at twice the price?  \n\nHowever, in an uncharacteristic display of fiscal responsibility from the Kerbal Space Administration, It was also decided that Val and her crew would NOT be receiving overtime pay for the unplanned extension of their mission time.  \n\nI love this game, and I love this mod. Thanks, @RoverDude !\n\nNext up - Duna! And on that note, how do you guys plan for long missions? I don\u0027t know of any easy way in-game to account for travel time to other planetary systems, particularly when that means waiting for a return window.\n\n**Edited \u003Ctime datetime=\u00222016-04-28T15:53:32Z\u0022 title=\u002204/28/2016 03:53  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 28, 2016\u003C/time\u003E by Tandoori**\n  \nEdited for clarity and to fix grammatical errors."},{"CreatedByName":"Kerbal Pig","CreatedById":162989,"CreatedDateTime":"2016-04-28T16:31:31Z","Content":"\u003E \n\u003E \n\u003E 6 hours ago, tomf said:\n\u003E \n\u003E \n\u003E Do you have the community resource mod? [https://github.com/BobPalmer/CommunityResourcePack/releases](https://github.com/BobPalmer/CommunityResourcePack/releases)\n\u003E \n\nNo, I don\u0027t, is it required?"},{"CreatedByName":"RailgunSpoon","CreatedById":54930,"CreatedDateTime":"2016-04-28T16:38:48Z","Content":"I installed this mod today, and it doesn\u0027t seem to be working. My status window is blank (I have a ongoing flight with 5 kerbals) and my kerbals aren\u0027t consuming/producing anything. \n\nMods List:\n\nSpaceY-Expanded \u0026 Lifters  \n\nPlanetary Base Inc  \n\nRLA\\_Stockalike  \n\nKerbal Alarm Clock  \n\nKerbal Engineer  \n\nFuel Tank Plus  \n\nDMagicOrbitalScience  \n\nKIS/KAS  \n\nDocking Port Alignment Indicator\n\nThanks!\n\n**Edited \u003Ctime datetime=\u00222016-04-28T16:48:23Z\u0022 title=\u002204/28/2016 04:48  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 28, 2016\u003C/time\u003E by RailgunSpoon**"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-04-28T16:51:37Z","Content":"Add Community Resource Pack - link in my sig."},{"CreatedByName":"RailgunSpoon","CreatedById":54930,"CreatedDateTime":"2016-04-28T16:58:11Z","Content":"Whoops I skipped that one.\n\nThe last entry in the changelog for CRP is \n\n0.5.0 - 2016.03.29  \n\n------------------  \n\nCompatibility with KSP 1.1  \n\nLowered cost of Supplies, Mulch and Fertilizer\n\nUsing AVC:\n\nKSP: 1.1 (Win32) - Unity: 5.2.4f1 - OS: Windows 10  (10.0.0) 64bit  \n\nUSI Tools - 0.7.1  \n\nCommunity Resource Pack - 0.5  \n\nDMagic Orbital Science - 1.2.3  \n\nFuel Tanks Plus - 1.8.1  \n\nKerbal Attachment System - 0.5.6.7  \n\nKerbal Engineer Redux - 1.1.0.2  \n\nKerbal Inventory System - 1.2.7.6  \n\nKSP-AVC Plugin - 1.1.6.1  \n\nDocking Port Alignment Indicator - 6.3  \n\nKerbal Planetary Base Systems - 1.0.8  \n\nSpaceY Expanded - 1.1.8  \n\nSpaceY Lifters - 1.12.2  \n\nKerbal Alarm Clock - 3.6.1  \n\nUSI-LS - 0.4.2\n\n**Edited \u003Ctime datetime=\u00222016-04-28T17:02:12Z\u0022 title=\u002204/28/2016 05:02  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 28, 2016\u003C/time\u003E by RailgunSpoon**"},{"CreatedByName":"Businfu","CreatedById":116782,"CreatedDateTime":"2016-04-28T17:37:46Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Tandoori said:\n\u003E \n\u003E \n\u003E Next up - Duna! And on that note, how do you guys plan for long missions? I don\u0027t know of any easy way in-game to account for travel time to other planetary systems, particularly when that means waiting for a return window.\n\u003E \n\nOnce you start dealing with interplanetary missions, the game takes on a whole new level of planning.  For one, you\u0027ll want to get an efficient LS recycler on board (science lab!).  In terms of actual planning, probably the best way is to use a combination of:\n\nKerbal Alarm Clock\n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/22809-11x-kerbal-alarm-clock-v3610-april-25/\u0026do=embed\u0022\u003E\u003C/iframe\u003E\n\nAND Transfer Window Planner \n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/84005-10x-transfer-window-planner-v1400-dec-3/\u0026do=embed\u0026page=13\u0022\u003E\u003C/iframe\u003E\n\nAND some scribbled notes on your desk that you hopefully don\u0027t recycle on accident! Oh and you\u0027ll also want to pick up Precise Node if you haven\u0027t already.  \n\nSo to be clear; to plan for your duna mission, you can use transfer window planner to calculate both the time of your departure and your return. That way you can get a good estimate of how much time Jeb and friends will be away from home. Then give yourself some wiggle room, because there is always the chance you\u0027ll have to play it as it lies... \n\nand it looks like transfer window planner isn\u0027t quite 1.1 compatible, but hopefully soon!\n\n**Edited \u003Ctime datetime=\u00222016-04-28T17:39:14Z\u0022 title=\u002204/28/2016 05:39  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 28, 2016\u003C/time\u003E by Businfu**"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-04-28T17:39:55Z","Content":"[@Tandoori](https://forum.kerbalspaceprogram.com/index.php?/profile/125040-tandoori/) - glad you had fun ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)  The way your mission played out is the reason I made this mod (i.e. there\u0027s always an \u0027out\u0027)."},{"CreatedByName":"Kerbal Pig","CreatedById":162989,"CreatedDateTime":"2016-04-28T18:33:02Z","Content":"\u003E \n\u003E \n\u003E 8 hours ago, tomf said:\n\u003E \n\u003E \n\u003E Do you have the community resource mod? [https://github.com/BobPalmer/CommunityResourcePack/releases](https://github.com/BobPalmer/CommunityResourcePack/releases)\n\u003E \n\nThank you so much, it worked! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)"},{"CreatedByName":"RailgunSpoon","CreatedById":54930,"CreatedDateTime":"2016-04-28T19:57:00Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, RoverDude said:\n\u003E \n\u003E \n\u003E Add Community Resource Pack - link in my sig.\n\u003E \n\nI made sure I had the latest version, still not working D: Full mods list using AVC in previous reply."},{"CreatedByName":"jofwu","CreatedById":94705,"CreatedDateTime":"2016-04-28T21:52:07Z","Content":"\u003E \n\u003E \n\u003E 6 hours ago, Tandoori said:\n\u003E \n\u003E \n\u003E And on that note, how do you guys plan for long missions? I don\u0027t know of any easy way in-game to account for travel time to other planetary systems, particularly when that means waiting for a return window.\n\u003E \n\nJust adding to what [@Businfu](https://forum.kerbalspaceprogram.com/index.php?/profile/116782-businfu/) had to say, as far as estimating Supply requirements goes... I\u0027ll use Transfer Window Planner to find the next transfer window that works. It will tell you how long that journey takes. Then you\u0027ve got to determine how long they\u0027ll be there. Leaving the next available window or staying for a few? Go ahead and use Transfer Window Planner to choose a return transfer window. Make sure it doesn\u0027t have you leaving before you arrive in the first place! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) So now you\u0027ve got a set of two departure and arrival times. Add up the two trip durations and the time in between trips to estimate for Supplies. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2016-04-29T03:04:06Z","Content":"[@Tandoori](https://forum.kerbalspaceprogram.com/index.php?/profile/125040-tandoori/) One more addition to [@Businfu](https://forum.kerbalspaceprogram.com/index.php?/profile/116782-businfu/)\u0027s and [@jofwu](https://forum.kerbalspaceprogram.com/index.php?/profile/94705-jofwu/)\u0027s: The Delta-V map on my sig contains generalized time of flight and time between return windows to help you on the planning as well."},{"CreatedByName":"RailgunSpoon","CreatedById":54930,"CreatedDateTime":"2016-04-29T03:38:56Z","Content":"\u003E \n\u003E \n\u003E 10 hours ago, RoverDude said:\n\u003E \n\u003E \n\u003E Add Community Resource Pack - link in my sig.\n\u003E \n\nI think I found why USI wasn\u0027t working properly, my save files created previously don\u0027t work. New saves work perfectly."},{"CreatedByName":"Andrew2448","CreatedById":161738,"CreatedDateTime":"2016-04-29T22:49:14Z","Content":"I\u0027m not sure if it\u0027s a bug but all resource usage/creation is not calculated when at the two highest warp speeds. I just spent hours planning a Duna mission and calculating all the supplies and such that I would need only to discover that while warping during the 293 day transfer, no supplies were used. Once I stopped warping, everything immediately began to go back to how it normally works. Is this intended or what? Seems like a very easy way to get around the difficulty of long distance missions.\n\n**Edited \u003Ctime datetime=\u00222016-04-29T22:49:48Z\u0022 title=\u002204/29/2016 10:49  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 29, 2016\u003C/time\u003E by Andrew2448**"},{"CreatedByName":"karamazovnew","CreatedById":63072,"CreatedDateTime":"2016-04-30T06:01:12Z","Content":"Hi Rover, I\u0027ve decided to switch from TAC to USI because I like some of the features when combining with UKS. I\u0027ve pumped the difficulty to the max, I like my kerbals dying from lack of resources (not habitation tho... they just go on strike, hehe). However, I have a few issues:\n\n1. I don\u0027t see electrical charge being used by manned pods, and this is a feature I sorely miss from TAC. Would it be possible to add this as well? From what I see in the Settings.cfg file, there already is a ECAmount = 0.01  variable, but it doesn\u0027t seem to work, my electrical charge always remains the same, plus there is no indication of \u0022time to die\u0022, which I would expect to be different from the normal supplies timer. Yes I could add a constant electric charge usage by myself to all pods, but the kerbals still won\u0027t die from the lack of it. Or maybe I\u0027m missing something?\n\n2. In the Life Support Window, after supplies/EC runs out would it be possible to change the timer indication to \u0022time remaining until effect\u0022?\n\n3. Habitation wasn\u0027t doing anything until I changed the Settings.cfg file. Took me a while to realize why my habitation time was infinite. Would it be too much trouble to ask for an ingame menu instead of the cfg file? Remotetech just did that and it\u0027s so useful to be able to change settings in the game, plus new players looking for the habitation effect won\u0027t need to search for why it doesn\u0027t work ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)\n\n4. In the same file, the \u0022HabMultiplier = 5 //Bonus to hab values (1 = default = 100% of the part\u0027s rated value)\u0022 line is by default, so does that mean by default we are working at 500%?\n\n5. I\u0027m about to go to the UKS page to post a suggestion there as well, but it affects USI too, so here it goes: These two mods combined use too many buttons in the stock toolbar. Maybe just add one window and a few tabs for the various features?"},{"CreatedByName":"invultri","CreatedById":92101,"CreatedDateTime":"2016-04-30T10:36:42Z","Content":"More doodling after dealing with some terrible mistakes:\n\n[https://docs.google.com/spreadsheets/d/1ewlbEVwGbxUke23M84C7ZUU5vieG7yIFLovNLY5hz-o/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1ewlbEVwGbxUke23M84C7ZUU5vieG7yIFLovNLY5hz-o/edit?usp=sharing)\n\nNow to verify the mass of stuff in game as well, making the curves visible helps a lot with the overall planning of the supplies!"},{"CreatedByName":"FletcherDragon","CreatedById":142670,"CreatedDateTime":"2016-04-30T13:58:06Z","Content":"It seems like this mod is really having serious problems operating in this version of KSP. I never had a single issue with it the first time I downloaded and used it in 1.0.5 but now in 1.1 It simply refuses to work regardless of how or where I download it from... install it. or what other mods I do or don\u0027t have along side it.\n\nThe Life-support UI is always completely blank. No numbers and no functions.. All the resource tanks show their content and can be placed on a ship but are never used throughout the mission. Community resource pack doesn\u0027t fix it. Firespitter doesn\u0027t fix it. Module manager doesn\u0027t fix it. Making it the only mod in the the list doesn\u0027t fix it. I\u0027ve tried many other things and I am completely out of ideas. \n\nPlease tell me its not just me having these problems?"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2016-04-30T14:16:43Z","Content":"\u003E \n\u003E \n\u003E 22 minutes ago, FletcherDragon said:\n\u003E \n\u003E \n\u003E It seems like this mod is really having serious problems operating in this version of KSP. I never had a single issue with it the first time I downloaded and used it in 1.0.5 but now in 1.1 It simply refuses to work regardless of how or where I download it from... install it. or what other mods I do or don\u0027t have along side it.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The Life-support UI is always completely blank. No numbers and no functions.. All the resource tanks show their content and can be placed on a ship but are never used throughout the mission. Community resource pack doesn\u0027t fix it. Firespitter doesn\u0027t fix it. Module manager doesn\u0027t fix it. Making it the only mod in the the list doesn\u0027t fix it. I\u0027ve tried many other things and I am completely out of ideas. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Please tell me its not just me having these problems?\n\u003E \n\nI would surmise that the last  many pages of posts would easily show you are in the minority.\n\nThat being said since 1.1.2 just released there could be new issues with that.  There are indications that a newer modulmanager could be needed. That being said you were light on details of exactly what version you are running.\n\n**Edited \u003Ctime datetime=\u00222016-04-30T14:21:11Z\u0022 title=\u002204/30/2016 02:21  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 30, 2016\u003C/time\u003E by goldenpsp**"},{"CreatedByName":"VaPaL","CreatedById":150974,"CreatedDateTime":"2016-04-30T14:47:08Z","Content":"\u003E \n\u003E \n\u003E 8 hours ago, karamazovnew said:\n\u003E \n\u003E \n\u003E Would it be too much trouble to ask for an ingame menu instead of the cfg file?\n\u003E \n\n\u003E \n\u003E \n\u003E 8 hours ago, karamazovnew said:\n\u003E \n\u003E \n\u003E These two mods combined use too many buttons in the stock toolbar. Maybe just add one window and a few tabs for the various features?\n\u003E \n\nI vote in favor of these!"},{"CreatedByName":"drazed","CreatedById":90680,"CreatedDateTime":"2016-04-30T22:13:18Z","Content":"When using earth-time (24hour, specifically in RSS), LifeSupport Status shows:  \n\n  \u0022Earth/Orbiting - #1 supplies (#2/day) hab for indefinite\u0022  \n\nBut the supply time seems to get calculated based on the standard KSP day?  Specifically #1/#2 != total time.  \n\nWith my personal settings example shown:\n\n ![screenshot0.png](http://anyx.org/ksp/screenshot0.png)\n\n8967 / 6.5/day = 1379.53 days  \n\nWhich is NOT 345 days!  But, 1376.53/4 = 344.88 days\n\nSince a kerbal day is 1/4 a normal day I suspect there is some relation there.  So either the total time is wrong, or the supplies per day (6.5 in this case, settings at SupplyAmount = 0.00015) is wrong.  One of them should be 4X more.\n\n**Edited \u003Ctime datetime=\u00222016-04-30T22:20:18Z\u0022 title=\u002204/30/2016 10:20  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 30, 2016\u003C/time\u003E by drazed**"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-04-30T23:17:31Z","Content":"\u003E \n\u003E \n\u003E On 4/29/2016 at 6:49 PM, Andrew2448 said:\n\u003E \n\u003E \n\u003E I\u0027m not sure if it\u0027s a bug but all resource usage/creation is not calculated when at the two highest warp speeds. I just spent hours planning a Duna mission and calculating all the supplies and such that I would need only to discover that while warping during the 293 day transfer, no supplies were used. Once I stopped warping, everything immediately began to go back to how it normally works. Is this intended or what? Seems like a very easy way to get around the difficulty of long distance missions.\n\u003E \n\nMore specificity please.  Resources should absolutely be used during warp...  What does the UI show?\n\n\u003E \n\u003E \n\u003E 17 hours ago, karamazovnew said:\n\u003E \n\u003E \n\u003E Hi Rover, I\u0027ve decided to switch from TAC to USI because I like some of the features when combining with UKS. I\u0027ve pumped the difficulty to the max, I like my kerbals dying from lack of resources (not habitation tho... they just go on strike, hehe). However, I have a few issues:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 1. I don\u0027t see electrical charge being used by manned pods, and this is a feature I sorely miss from TAC. Would it be possible to add this as well? From what I see in the Settings.cfg file, there already is a ECAmount = 0.01  variable, but it doesn\u0027t seem to work, my electrical charge always remains the same, plus there is no indication of \u0022time to die\u0022, which I would expect to be different from the normal supplies timer. Yes I could add a constant electric charge usage by myself to all pods, but the kerbals still won\u0027t die from the lack of it. Or maybe I\u0027m missing something?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 2. In the Life Support Window, after supplies/EC runs out would it be possible to change the timer indication to \u0022time remaining until effect\u0022?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 3. Habitation wasn\u0027t doing anything until I changed the Settings.cfg file. Took me a while to realize why my habitation time was infinite. Would it be too much trouble to ask for an ingame menu instead of the cfg file? Remotetech just did that and it\u0027s so useful to be able to change settings in the game, plus new players looking for the habitation effect won\u0027t need to search for why it doesn\u0027t work ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E 4. In the same file, the \u0022HabMultiplier = 5 //Bonus to hab values (1 = default = 100% of the part\u0027s rated value)\u0022 line is by default, so does that mean by default we are working at 500%?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 5. I\u0027m about to go to the UKS page to post a suggestion there as well, but it affects USI too, so here it goes: These two mods combined use too many buttons in the stock toolbar. Maybe just add one window and a few tabs for the various features?\n\u003E \n\n1.  You\u0027re missing something ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)  EC is on the same timer.  That being said, it should be going down.\n\n2.  I don\u0027t understand, more specificity please.\n\n3.  Sure, log a github issue.\n\n4.  Yes, it\u0027s a lot gentler by default until you install something like UKS, etc. that have more hab parts.\n\n5.  Log an issue, but new UI work is a low priority at the moment - lots of fish to fry\n\n\u003E \n\u003E \n\u003E 12 hours ago, invultri said:\n\u003E \n\u003E \n\u003E More doodling after dealing with some terrible mistakes:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [https://docs.google.com/spreadsheets/d/1ewlbEVwGbxUke23M84C7ZUU5vieG7yIFLovNLY5hz-o/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1ewlbEVwGbxUke23M84C7ZUU5vieG7yIFLovNLY5hz-o/edit?usp=sharing)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Now to verify the mass of stuff in game as well, making the curves visible helps a lot with the overall planning of the supplies!\n\u003E \n\nNice - let me know if you have any issues\n\n\u003E \n\u003E \n\u003E 9 hours ago, FletcherDragon said:\n\u003E \n\u003E \n\u003E It seems like this mod is really having serious problems operating in this version of KSP. I never had a single issue with it the first time I downloaded and used it in 1.0.5 but now in 1.1 It simply refuses to work regardless of how or where I download it from... install it. or what other mods I do or don\u0027t have along side it.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The Life-support UI is always completely blank. No numbers and no functions.. All the resource tanks show their content and can be placed on a ship but are never used throughout the mission. Community resource pack doesn\u0027t fix it. Firespitter doesn\u0027t fix it. Module manager doesn\u0027t fix it. Making it the only mod in the the list doesn\u0027t fix it. I\u0027ve tried many other things and I am completely out of ideas. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Please tell me its not just me having these problems?\n\u003E \n\nIt\u0027s just you ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)  More details please, also be sure to use the 1.1.2 version on KSP 1.1.2\n\n\u003E \n\u003E \n\u003E 1 hour ago, drazed said:\n\u003E \n\u003E \n\u003E When using earth-time (24hour, specifically in RSS), LifeSupport Status shows:  \n\u003E \n\u003E   \u0022Earth/Orbiting - #1 supplies (#2/day) hab for indefinite\u0022  \n\u003E \n\u003E But the supply time seems to get calculated based on the standard KSP day?  Specifically #1/#2 != total time.  \n\u003E   \n\u003E \n\u003E With my personal settings example shown:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  [![screenshot0.png](http://anyx.org/ksp/screenshot0.png)](http://anyx.org/ksp/screenshot0.png \u0022Enlarge image\u0022)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 8967 / 6.5/day = 1379.53 days  \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Which is NOT 345 days!  But, 1376.53/4 = 344.88 days\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Since a kerbal day is 1/4 a normal day I suspect there is some relation there.  So either the total time is wrong, or the supplies per day (6.5 in this case, settings at SupplyAmount = 0.00015) is wrong.  One of them should be 4X more.\n\u003E \n\nLog a github issue, given I don\u0027t use RSS, I don\u0027t generally account for it."},{"CreatedByName":"drazed","CreatedById":90680,"CreatedDateTime":"2016-05-01T01:29:03Z","Content":"\u003E \n\u003E \n\u003E 10 hours ago, RoverDude said:\n\u003E \n\u003E \n\u003E More specificity please.  Resources should absolutely be used during warp...  What does the UI show?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 1.  You\u0027re missing something ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)  EC is on the same timer.  That being said, it should be going down.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 2.  I don\u0027t understand, more specificity please.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 3.  Sure, log a github issue.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 4.  Yes, it\u0027s a lot gentler by default until you install something like UKS, etc. that have more hab parts.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 5.  Log an issue, but new UI work is a low priority at the moment - lots of fish to fry\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Nice - let me know if you have any issues\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E It\u0027s just you ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)  More details please, also be sure to use the 1.1.2 version on KSP 1.1.2\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Log a github issue, given I don\u0027t use RSS, I don\u0027t generally account for it.\n\u003E \n\nLogged [https://github.com/BobPalmer/USI-LS/issues/112](https://github.com/BobPalmer/USI-LS/issues/112)\n\nNo rush fixing this doesn\u0027t bother me much just gets my OCD a little ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)  The bug is present even without RSS installed provided you set Earth Time in general settings.\n\nThanks much for your time and awesome mods!\n\n**Edited \u003Ctime datetime=\u00222016-05-01T01:29:58Z\u0022 title=\u002205/01/2016 01:29  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 1, 2016\u003C/time\u003E by drazed**"}]}