{"TopicId":109207,"ForumId":34,"TopicTitle":"[1.12.X] Orbital Survey Plus v2.3.6","CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2015-05-14T13:47:28Z","PageNum":4,"Articles":[{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2016-05-07T07:46:11Z","Content":"[@DMagic](https://forum.kerbalspaceprogram.com/index.php?/profile/57416-dmagic/) lovely! Are the scaled textures generated on the fly or during the game loading? Does the game lag a bit when switching textures? And yeah, I\u0027m with you that bump map should be turned off untill the original high res texture is revealed. I agree with [@CaptRobau](https://forum.kerbalspaceprogram.com/index.php?/profile/41695-captrobau/), 64x32 texture size hides the details beautifully while giving the idea of the planet\u0027s color.\n\nThis was one the first images of Mars from Earth.\n\n![sred2_s02.jpg](http://www.lpi.usra.edu/publications/slidesets/redplanet2/images/sred2_s02.jpg)\n\n**Edited \u003Ctime datetime=\u00222016-05-07T07:58:28Z\u0022 title=\u002205/07/2016 07:58  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 7, 2016\u003C/time\u003E by Enceos**"},{"CreatedByName":"ShotgunNinja","CreatedById":159391,"CreatedDateTime":"2016-05-08T02:03:30Z","Content":"In OpenGL/DX you can specify an arbitrary base mipmap level (the bottom of the pyramid, the default is 0) on the fly, this parameter is then used directly by the hardware when filtering the texture.  \n\nThe base mipmap level is exposed as a texture property by many 3D engines, haven\u0027t checked about unity however.\n\nNote that this will not work if that particular texture is using linear filtering."},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2016-05-10T19:51:33Z","Content":"[@DMagic](https://forum.kerbalspaceprogram.com/index.php?/profile/57416-dmagic/) Is this function any good for tweaking the displayed mipMaps?\n\n[http://docs.unity3d.com/ScriptReference/Texture-mipMapBias.html](http://docs.unity3d.com/ScriptReference/Texture-mipMapBias.html)\n\n[@Wheffle](https://forum.kerbalspaceprogram.com/index.php?/profile/74893-wheffle/) sorry that we went a little offtopic in your thread.\n\n**Edited \u003Ctime datetime=\u00222016-05-10T19:54:16Z\u0022 title=\u002205/10/2016 07:54  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 10, 2016\u003C/time\u003E by Enceos**"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-05-11T01:16:01Z","Content":"[@Enceos](https://forum.kerbalspaceprogram.com/index.php?/profile/110725-enceos/) Not a big deal ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) There\u0027s some good info being discussed."},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2016-05-13T16:40:47Z","Content":"Thanks to KottabosGames YT, I learned about this.\n\n[KottabosGames Review](https://www.youtube.com/watch?v=W9MaOf6qORM)\n\n**Edited \u003Ctime datetime=\u00222016-05-13T23:37:46Z\u0022 title=\u002205/13/2016 11:37  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 13, 2016\u003C/time\u003E by Apollo13**"},{"CreatedByName":"Genolution","CreatedById":54840,"CreatedDateTime":"2016-05-13T21:18:16Z","Content":"\u003E \n\u003E \n\u003E 4 hours ago, Apollo13 said:\n\u003E \n\u003E \n\u003E Thanks to KottabosGames YT, I learned about this.\n\u003E \n\nSame with me just now. And like others have said, How did I miss this?  [@Wheffle](https://forum.kerbalspaceprogram.com/index.php?/profile/74893-wheffle/) I really like how this stands out from MAPSAT with its stock-alike feel. Does this work with other planet packs assuming they have resources and biomes defined? And what about Sigma Dimensions rescale mod?"},{"CreatedByName":"ShotgunNinja","CreatedById":159391,"CreatedDateTime":"2016-05-13T21:18:47Z","Content":"[@Enceos](https://forum.kerbalspaceprogram.com/index.php?/profile/110725-enceos/) That is used in the selection of the mipmap level when the hardware is sampling the texture. Putting a positive number in there will make the hardware sample from higher mipmap levels (meaning smaller image, with more \u0027blurry\u0027 results). I suggest using integers. Setting that to \u0027*1.0*\u0027 will make the hardware sample from half-resolution texture, setting it to \u0027*2.0*\u0027 from 1/4 resolution texture and so on. The max level that can be choosen is limited to *log2(max(width, height))* where width and height are the dimension of the base level of the mipmap pyramid (meaning: the dimension of the original texture).\n\nNote that the above is a simplification of the thing, I suggest reading about mipmapping online. Anyway, here is an eagle view of how it works:\n\nSpoiler\n\n- during execution of a shader for a particular \u0027region\u0027 of pixel (usually 2x2 pixels), some texture sampling instructions are emitted referring to a texture unit and coordinates *in texture-space*\n- depending on the texture coordinates used in the region, an horizontal and vertical txcoord derivative *in texture-space* is found\n- if the texture unit is configured for mipmapping, the derivatives are used to select the appropriate level in the mipmap pyramid  \n*(farther away from the camera means bigger derivatives in texture-space, and an higher [meaning lower resolution] level in the mipmap pyramid is selected)*\n- then, the *mipmap bias* is added to the computed level (**this is what you are changing**)\n- the level selected can be an integer or a fractional number, depending on the particular mipmap filter used (there are multiple ones)\n- so now in addition to the texture coordinate (fractional) there is also a mipmap level (possibly fractional)\n- the hardware sample up to 8 *texels* from up to *2 adjacent mipmap levels* and mix them, then return the result (that is now *filtered*)\n- the sampling instructions return, the shader happily goes about doing whatever it was doing\n\n**Edited \u003Ctime datetime=\u00222016-05-13T22:06:54Z\u0022 title=\u002205/13/2016 10:06  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 13, 2016\u003C/time\u003E by ShotgunNinja**\n  \ntypos"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2016-05-13T23:41:59Z","Content":"delete this post\n\n**Edited \u003Ctime datetime=\u00222016-05-14T18:01:57Z\u0022 title=\u002205/14/2016 06:01  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 14, 2016\u003C/time\u003E by Apollo13**"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-05-14T16:31:40Z","Content":"\u003E \n\u003E \n\u003E 23 hours ago, Apollo13 said:\n\u003E \n\u003E \n\u003E Thanks to KottabosGames YT, I learned about this.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [KottabosGames Review](https://www.youtube.com/watch?v=W9MaOf6qORM)\n\u003E \n\nOh hey, cool!\n\n\u003E \n\u003E \n\u003E 19 hours ago, Genolution said:\n\u003E \n\u003E \n\u003E Same with me just now. And like others have said, How did I miss this?  [@Wheffle](https://forum.kerbalspaceprogram.com/index.php?/profile/74893-wheffle/) I really like how this stands out from MAPSAT with its stock-alike feel. Does this work with other planet packs assuming they have resources and biomes defined? And what about Sigma Dimensions rescale mod?\n\u003E \n\nSo, it *should* work with any kind of mod that adds planets (based on how the mod works), although there\u0027s an old post on this thread that I noticed saying there might have been a bug on an old version with extra planets. I might do some testing myself, as I\u0027m curious. As far as scaled planets go, the size of the scan data depends on the planet\u0027s size, so a mod that scales up, say, 10x, will scale up the scan data 100x. This could cause slow-downs. If it turns out to be a huge performance issue, I might try to address it.\n\n\u003E \n\u003E \n\u003E 16 hours ago, Apollo13 said:\n\u003E \n\u003E \n\u003E ddddddddddddd\n\u003E \n\nCool."},{"CreatedByName":"Genolution","CreatedById":54840,"CreatedDateTime":"2016-05-15T01:08:19Z","Content":"I can now confirm this works just fine with the current Sigma Dimensions based Kscale2. My PC may be a bit better than most but I don\u0027t see any real performance drops. This mod should be stock. [@Wheffle](https://forum.kerbalspaceprogram.com/index.php?/profile/74893-wheffle/) Have some magic internet points."},{"CreatedByName":"curiousepic","CreatedById":60039,"CreatedDateTime":"2016-05-21T15:21:18Z","Content":"Hope the shrouding is coming along. Couple more questions/feature hopes...\n\n- Would it be possible to customize the width of the scan?\n- Is there any way to see the names of biomes, like a color key?\n- I know this is coming close to crossing the streams with SCANSat, but is there any possibility of altitude/topographic and/or slope data?\n\n**Edited \u003Ctime datetime=\u00222016-05-21T15:51:33Z\u0022 title=\u002205/21/2016 03:51  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 21, 2016\u003C/time\u003E by curiousepic**"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-05-22T20:33:50Z","Content":"If you look in the \u0022patches\u0022 directory in the OSP folder, you can make changes to the module patch there. It includes scan radius, electric charge drain, and science bonus I believe.\n\nIt would be cool to have some kind of biome key. I will look into it, but I have no idea how feasible it will be.\n\nI most likely will never add any other kinds of maps, like altitude or anomolies or whatever. My goal is to keep OSP as simple and stockalike as possible."},{"CreatedByName":"aeroeng14","CreatedById":116148,"CreatedDateTime":"2016-06-26T20:22:08Z","Content":"Just tried this in KSP v1.1.3 and everything seems to work fine! Thanks for making such a great mod!"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-06-27T23:04:28Z","Content":"\u003E \n\u003E \n\u003E On 6/26/2016 at 2:22 PM, aeroeng14 said:\n\u003E \n\u003E \n\u003E Just tried this in KSP v1.1.3 and everything seems to work fine! Thanks for making such a great mod!\n\u003E \n\nThanks for testing it for me! I\u0027ll officially update it when I get the chance, along with a few small improvements probably."},{"CreatedByName":"Grizzington","CreatedById":167442,"CreatedDateTime":"2016-08-05T19:56:40Z","Content":"So by my understanding, this mod will work very well with AntennaRange, because the data needs to be transmitted back to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, correct? My only other question: any idea if the scan will continue when out of Line Of Sight with a relay satellite?"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-08-08T05:28:02Z","Content":"\u003E \n\u003E \n\u003E On 8/5/2016 at 1:56 PM, Grizzington said:\n\u003E \n\u003E \n\u003E So by my understanding, this mod will work very well with AntennaRange, because the data needs to be transmitted back to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E, correct? My only other question: any idea if the scan will continue when out of Line Of Sight with a relay satellite?\n\u003E \n\nAlthough I haven\u0027t personally tested it, yes, the mapping data/science transmission should need a connection when you\u0027re using AntennaRange. I\u0027m not familiar with AntennaRange\u0027s internal workings so I can\u0027t guarantee it (if you test it, let me know!).\n\nTo answer your second question, the scan will definitely continue while it is out of range or has no line of site. It stores up the map data it has scanned without any need for transmission, and then the map is revealed once it is transmitted back. So theoretically you can scan the entire planet with no active connection, bring it into range and transmit the whole map back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E all at once."},{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-09-29T09:05:42Z","Content":"![a72c78e804c14b3fb791c1dea32da9fe.png](http://image.prntscr.com/image/a72c78e804c14b3fb791c1dea32da9fe.png)\n\nHi\n\nCan i ask for a feature request? I am not sure if it\u0027s possible or not or how hard it would be to implement. but...\n\nAs you can see in the image above, that is a single orbit around kerbin and a very wide strip of the planet is being scanned, that means scanning a planet would take very few minutes with time warp. Is it possible to add a config to change the cone angle of the scanner? So if we desire, we could change it to lower numbers to reduce the width of the strip it would scan?\n\nThanks\n\n**Edited \u003Ctime datetime=\u00222016-09-29T09:05:53Z\u0022 title=\u002209/29/2016 09:05  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 29, 2016\u003C/time\u003E by Jiraiyah**"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-09-30T17:36:53Z","Content":"\u003E \n\u003E \n\u003E On 9/29/2016 at 3:05 AM, Jiraiyah said:\n\u003E \n\u003E \n\u003E Can i ask for a feature request? I am not sure if it\u0027s possible or not or how hard it would be to implement. but...\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E As you can see in the image above, that is a single orbit around kerbin and a very wide strip of the planet is being scanned, that means scanning a planet would take very few minutes with time warp. Is it possible to add a config to change the cone angle of the scanner? So if we desire, we could change it to lower numbers to reduce the width of the strip it would scan?\n\u003E \n\nI believe I made it adjustable in the config file for the scanner. If you\u0027ve messed with KSP config files before, it should be easy to find. If not, let me know and I will walk you through it. It\u0027s a simple value change that will reduce the radius of the region scanned every tick."},{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-10-01T03:21:46Z","Content":"Hi, I think I found it? ScanRadius = 8, now, how does this 8 being used? for example, if i set it to 2, what will happen?"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-10-02T01:39:04Z","Content":"Yes, that\u0027s it. The radius units unfortunately are in arbitrary grid cells, so you might just have to tinker with it to get a radius you like. If you set it to 2, the radius of the scan area will be 1/4 of the default."},{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-10-02T10:02:29Z","Content":"Ok, now i have a problem in 1.1.3, not sure if i am doing something derpy or not, but when i toggle the biome map or Ore map either in \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u0027s track station or map view in the flight, it\u0027s not updating in real time and i need to toggle the map off/on again to update it.\n\nthanks\n\n**Edited \u003Ctime datetime=\u00222016-10-02T10:20:00Z\u0022 title=\u002210/02/2016 10:20  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 2, 2016\u003C/time\u003E by Jiraiyah**"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-10-03T05:07:08Z","Content":"[@Jiraiyah](https://forum.kerbalspaceprogram.com/index.php?/profile/97667-jiraiyah/)  That\u0027s normal behavior. Unfortunately the map update is too laggy to do auto updates. You\u0027ll notice a small stutter when you bring up the ore or biome map; that would not be fun to deal with if it was happening automatically every second or multiple times a second."},{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-10-03T12:38:42Z","Content":"how about adding a cool down to at least auto update it every 3 secs? would it still stutter? honestly, i am surprised to hear that it does that ! but I am still cool with your mod, specially when i set the radius to 1 (Miny Tiny Little Time Consuming Devil) and using tweak scale i rescaled the part to 1/8th of original size, also balanced the electric charge usage so when the whole planet is finished, the same amount of electric charge would be used. All in All, GREAT MOD. thanks for making it possible for us sir."},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-10-03T22:15:28Z","Content":"Thanks! With KSP 1.2 on the doorstep, OSP is due for an update. Unfortunately I have to give the usual caveat: I\u0027m in the middle of a semester at university and have been pretty busy, so I can\u0027t give a time frame on the next update. I haven\u0027t figured out how (design-wise or technical-wise) OSP will integrate into some of the new features, namely KerbNet, so that might take some time as well.\n\nAll-in-all, when I get the ball rolling again, I\u0027d like to roll the next update out with new and improved features as well as 1.2 compatibility. Specifically I\u0027d like to fix the scan-skipping on high warp times and improve the method of data storage in the persistence file. I will also take a look at the much-asked-for-but-probably-given-up-on-by-now planet shroud feature and auto-updating the resource and biome map."},{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-10-04T08:49:50Z","Content":"take your time, i am medical doctor and i still get nightmares seeing univ exams after 12 years of getting out of that hell ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022) :D"}]}