{"TopicId":109207,"ForumId":34,"TopicTitle":"[1.12.X] Orbital Survey Plus v2.3.6","CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2015-05-14T13:47:28Z","PageNum":5,"Articles":[{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-10-04T13:22:22Z","Content":"one more thing now that we are talking about making things better, how about doing the scan overlay somewhat close to what we had in kethane? the hex grid was really an eye candy if you ask me."},{"CreatedByName":"M3Henry","CreatedById":159326,"CreatedDateTime":"2016-10-14T01:56:11Z","Content":"Loving the stockalike feel of this mod!\n\nPersonally I\u0027d say that the Sentinel Telescope should cover biome scanning and resource scanning, as current space based prospecting technologies use infrared imaging instead of radar. [http://earthobservatory.nasa.gov/Features/ASTERProspecting/](http://earthobservatory.nasa.gov/Features/ASTERProspecting/)\n\nUnfortunately, that would leave the M700 with no purpose, unless it would be possible to add a custom resource map for altimetry (which wouldn\u0027t be minable) for each celestial body.\n\nAs for the narrowband scanner? I\u0027d say it\u0027s fine as it is."},{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-10-14T19:22:54Z","Content":"any news about 1.2 sir? i want to start scanning the hell out of galaxy ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-10-18T04:56:15Z","Content":"I\u0027ll get on it when I can, but currently I can\u0027t give a set time frame. As they say, \u0022soon (tm)\u0022. I\u0027m pretty swamped in school at the moment. I would rather have OSP updated before I start my 1.2 career (so I can use it) and I am really looking forward to playing 1.2, so I have personal motivations that ensure it will get done eventually..."},{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-10-18T16:31:18Z","Content":"\u003E \n\u003E \n\u003E 11 hours ago, Wheffle said:\n\u003E \n\u003E \n\u003E I\u0027ll get on it when I can, but currently I can\u0027t give a set time frame. As they say, \u0022soon (tm)\u0022. I\u0027m pretty swamped in school at the moment. I would rather have OSP updated before I start my 1.2 career (so I can use it) and I am really looking forward to playing 1.2, so I have personal motivations that ensure it will get done eventually...\n\u003E \n\nno pressure sir, but i thought it could be one of those open solution hit release button updates, ofcourse i don\u0027t know the details of the mod so if it needs time, we all can wait. take your time"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-10-20T01:00:18Z","Content":"I actually haven\u0027t tried it to see if it works at all. I have no idea how it will interact with KerbNet and the new communication system, which is why I was holding off until I could do testing. If anyone has tried it, feel free to let me know what weirdness or lack of weirdness resulted."},{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2016-10-20T03:51:06Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, Wheffle said:\n\u003E \n\u003E \n\u003E I actually haven\u0027t tried it to see if it works at all. I have no idea how it will interact with KerbNet and the new communication system, which is why I was holding off until I could do testing. If anyone has tried it, feel free to let me know what weirdness or lack of weirdness resulted.\n\u003E \n\nok, tried it, take a look [http://prntscr.com/cwiofx](http://prntscr.com/cwiofx)\n\nas you see, it\u0027s doing stock behavior like your mod is not even there."},{"CreatedByName":"RealGecko","CreatedById":162682,"CreatedDateTime":"2016-10-23T21:25:32Z","Content":"Adopted for KSP 1.2, looks like working ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)\n\n[https://www.dropbox.com/s/qlpn2kt5y2vabun/OrbitalSurveyPlus-2.1.1-KSP-1.2.zip?dl=0](https://www.dropbox.com/s/qlpn2kt5y2vabun/OrbitalSurveyPlus-2.1.1-KSP-1.2.zip?dl=0)\n\nEdit: source inside\n\n**Edited \u003Ctime datetime=\u00222016-10-23T21:26:14Z\u0022 title=\u002210/23/2016 09:26  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 23, 2016\u003C/time\u003E by RealGecko**"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-11-02T21:16:15Z","Content":"Just an update: I\u0027ve taken a look and made changes for KSP 1.2 (code turned out to look almost exactly like [@RealGecko](https://forum.kerbalspaceprogram.com/index.php?/profile/162682-realgecko/)\u0027s changes for his recompile, thanks for picking that up!), but it looks like there are some subtle and not-so-subtle issues that need to be ironed out, including the resource map shrouds not being applied correctly. I\u0027ll try to get these issues ironed out and bring it back to pre-1.2 functionality and release an update before I dive into any \u0022extra\u0022 stuff I was planning on trying to include soon."},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-11-04T02:11:06Z","Content":"Just pushed the update! It\u0027s nothing more than a migration to KSP 1.2 really. Soon I\u0027d like to push out a more extensive update to make some needed improvements and maybe add features. Also, this was not very exhaustively tested, so please post any bugs you run into."},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-11-14T04:27:16Z","Content":"Pushed out another update that I worked on over the weekend. Scan area no longer gets distorted at high latitudes, scanning at high time warp works a lot better, and overlays can auto-refresh if that\u0027s what you like. A few bugs have been squashed as well, including stuff that was really hitting performance.\n\nI looked at using [Kethane\u0027s](https://forum.kerbalspaceprogram.com/index.php?/topic/119480-12-kethane-plugin-and-parts-097-new-maintainer/) geodesic grid to resolve the scan area distortion problems, but I ended up using simple [mercator projection](https://en.wikipedia.org/wiki/Mercator_projection) scaling instead. While the hex grid looked pretty cool, it added a lot of complexity and performance issues. I\u0027m pretty happy with the new scaling though.\n\nShould be compatible with current saves!\n\n**Download**\n\n[Spacedock](http://spacedock.info/mod/574/Orbital%20Survey%20Plus?ga=%3CGame\u002B3102\u002B%27Kerbal\u002BSpace\u002BProgram%27%3E) | [Curse](http://kerbal.curseforge.com/ksp-mods/230505-orbital-survey-plus)\n\n**Edited \u003Ctime datetime=\u00222016-11-21T09:19:53Z\u0022 title=\u002211/21/2016 09:19  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 21, 2016\u003C/time\u003E by Wheffle**\n  \ndownload links are no longer 2.3.0"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-11-21T09:19:22Z","Content":"Small-ish patch deployed. Made a few optimizations that should improve performance. Saves are backwards compatible, but the wise will backup their saves anyway. After a bit of testing, seems to be fully compatible with KSP 1.2.2. No update needed.\n\n[Spacedock](http://spacedock.info/mod/574/Orbital%20Survey%20Plus?ga=%3CGame\u002B3102\u002B%27Kerbal\u002BSpace\u002BProgram%27%3E)  |  [Curse](http://kerbal.curseforge.com/ksp-mods/230505-orbital-survey-plus)\n\n**Edit:** After a bit of testing, seems to be fully compatible with KSP 1.2.2. No update needed.\n\n**Edited \u003Ctime datetime=\u00222016-12-09T06:32:15Z\u0022 title=\u002212/09/2016 06:32  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 9, 2016\u003C/time\u003E by Wheffle**\n  \nconfirmation for KSP 1.2.2"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-12-10T21:55:11Z","Content":"[@curiousepic](https://forum.kerbalspaceprogram.com/index.php?/profile/60039-curiousepic/) [@Enceos](https://forum.kerbalspaceprogram.com/index.php?/profile/110725-enceos/)\n\nAfter a billion years I have started poking around with unexplored planet blur. Not sure if anyone is still interested, but there you have it. I\u0027ve managed to find the normal and bump map textures for planets and set a \u0027mipMapBias\u0027 Unity setting to a large number, presumably causing Unity to choose a smaller mipmap even at close camera ranges. Here are some comparison examples:\n\nMoho:\n\nSpoiler\n\n![070xVdR.png](http://imgur.com/070xVdR.png)\n\nEve:\n\nSpoiler\n\n![ZpoP1gw.png](http://imgur.com/ZpoP1gw.png)\n\nDuna:\n\nSpoiler\n\n![oZxkqhe.png](http://imgur.com/oZxkqhe.png)\n\nDres:\n\nSpoiler\n\n![fvCXIE7.png](http://imgur.com/fvCXIE7.png)\n\nGilly:\n\nSpoiler\n\n![2GojDJn.png](http://imgur.com/2GojDJn.png)\n\nAs you can see, the results are mixed and sometimes kind of weird. It looks like planets with atmospheres (like Eve) get completely washed out, which is fine because that\u0027s kind of what we realistically see when we point telescopes at planets like Venus. There is obvious detail loss on Moho, Dres and Duna, but Duna seems to be very pale for some reason and the physical shapes of rocky planets isn\u0027t being obscured, so peaks and valleys are still pretty visible. There is almost zero difference with Gilly probably because its extreme non-spherical shape cannot be masked by altering textures alone.\n\nGranted I did this on my laptop which is pretty low-end and the textures don\u0027t look that good even without alteration. I might hop over to my desktop and see what happens there. I\u0027m worried that the results might vary between hardware and platforms because the changes are fairly low-level, but that fear might be unfounded as part of the reason engines like Unity are popular is that it does its best to standardize results across platforms.\n\nFor anyone that has more experience with Unity (especially with rendering and stuff) I\u0027d love to know any alternative methods that could be tried. I\u0027m not much of a graphics person and I\u0027ve only just put myself through a small Unity rendering crash course for this.\n\nMost importantly, would anyone still be interested in something like this? My ideas are that the planets outside of the Kerbin system would be blurred until a spacecraft with either a Kerbal or active comms entered the system, at which point the planet and its moons would be revealed in more detail. As a bonus, I was thinking upgrading the tracking station could grant you slightly more detail for unvisited systems. I\u0027m also thinking it best to break this off into a separate mod altogether. Thoughts?\n\n**Edited \u003Ctime datetime=\u00222016-12-10T22:02:29Z\u0022 title=\u002212/10/2016 10:02  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 10, 2016\u003C/time\u003E by Wheffle**\n  \nimages were missing"},{"CreatedByName":"RealGecko","CreatedById":162682,"CreatedDateTime":"2016-12-10T21:57:20Z","Content":"Hmmm, can\u0027t see screenshots."},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-12-10T22:03:32Z","Content":"\u003E \n\u003E \n\u003E 5 minutes ago, RealGecko said:\n\u003E \n\u003E \n\u003E Hmmm, can\u0027t see screenshots.\n\u003E \n\nYeah, had to coax them out. They should be there now."},{"CreatedByName":"RealGecko","CreatedById":162682,"CreatedDateTime":"2016-12-10T22:09:16Z","Content":"\u003E \n\u003E \n\u003E 10 minutes ago, Wheffle said:\n\u003E \n\u003E \n\u003E Thoughts?\n\u003E \n\nThat sounds interesting actually, something similar to Research Bodies, but more adequate IMO, cause flying to space without knowing solar system is a bit odd, but not having info on bodies until you actually reach them sounds sane ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2016-12-10T22:14:24Z","Content":"How does this interact with ScanSat mod? Completely separate, or do they overlap?"},{"CreatedByName":"RealGecko","CreatedById":162682,"CreatedDateTime":"2016-12-10T22:15:50Z","Content":"\u003E \n\u003E \n\u003E 20 minutes ago, Wheffle said:\n\u003E \n\u003E \n\u003E unexplored planet blur\n\u003E \n\nBy the way: will it work with Kopernicus oriented mods like OPM?"},{"CreatedByName":"curiousepic","CreatedById":60039,"CreatedDateTime":"2016-12-10T22:22:29Z","Content":"\u003E \n\u003E \n\u003E 21 minutes ago, Wheffle said:\n\u003E \n\u003E \n\u003E Most importantly, would anyone still be interested in something like this? My ideas are that the planets outside of the Kerbin system would be blurred until a spacecraft with either a Kerbal or active comms entered the system, at which point the planet and its moons would be revealed in more detail. As a bonus, I was thinking upgrading the tracking station could grant you slightly more detail for unvisited systems. I\u0027m also thinking it best to break this off into a separate mod altogether. Thoughts?\n\u003E \n\nAbsolutely!  Cool stuff. My real hope is still that a resource-overlay-like \u0022veil\u0022 covers areas not scanned by a camera or visible from a vessel with a Kerbal. If that\u0027s possible, perhaps requirements for unveiling would be configurable.\n\nAs you describe would still be great, though!"},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2016-12-10T22:34:07Z","Content":"[@Wheffle](https://forum.kerbalspaceprogram.com/index.php?/profile/74893-wheffle/) JPLRepo has implemented this feature a while ago into the [Research Bodies](https://forum.kerbalspaceprogram.com/index.php?/topic/139473-113-researchbodies-v181-30th-july-2016/\u0026do=findComment\u0026comment=2573477) mod, DMagic kindly shared his mipmaps code.\n\n**Edited \u003Ctime datetime=\u00222016-12-10T22:34:57Z\u0022 title=\u002212/10/2016 10:34  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 10, 2016\u003C/time\u003E by Enceos**"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2016-12-10T23:19:11Z","Content":"I actually didn\u0027t mess with mipmaps. My method was to take the planet textures and rescale them. It worked really well, even though there was some very odd behavior with planets that don\u0027t use color texture maps, like Kerbin.\n\nAnd changing mipmap settings wouldn\u0027t work with SCANsat anyway, because I needed an ability to scan specific areas of the surface, so I would have to combine different textures. The problem is that a significant amount of detail comes from the normal map, which don\u0027t work with this kind of combining textures, you end up with sharp seems. The other problem is that all of this texture swapping used a tremendous amount of memory, 100s of MBs (for each planet, and you have to consider situations where multiple planets and moons are visible) when refreshing."},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-12-11T00:13:52Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, sardia said:\n\u003E \n\u003E \n\u003E How does this interact with ScanSat mod? Completely separate, or do they overlap?\n\u003E \n\nIf you want a deeper and more detailed scanning experience with different types of maps (like altitude maps and such), SCANsat will probably interest you. It adds a lot of stuff to KSP that simply wasn\u0027t there before and provides you with a lot of cool projections and different types of scanners. There are a lot of options available to keep the stock resource surveying in place while using SCANsat or let SCANsat replace it with its own system, to varying degrees.\n\nMy goal for OSP was to simply augment the stock resource system. If you generally are satisfied with the stock system except for the surveyor\u0027s magic instant scan ability, or you just want to keep your mods light, OSP might interest you. It\u0027s what I feel the stock system should have been like.\n\nTechnically I don\u0027t think they will fight with each other if you use both, but honestly it\u0027s pointless to use both.\n\n\\* \\* \\*\n\n[@RealGecko](https://forum.kerbalspaceprogram.com/index.php?/profile/162682-realgecko/) Yes, this would technically work with any planet packs, as long as the textures use mipmaps (I\u0027m not positive whether the planet authors have to do it manually or Unity produces them automatically).\n\n[@Enceos](https://forum.kerbalspaceprogram.com/index.php?/profile/110725-enceos/) Ah, interesting, I missed this mod. Well, no need to reinvent the wheel! Looks like a great mod.\n\n[@curiousepic](https://forum.kerbalspaceprogram.com/index.php?/profile/60039-curiousepic/) Seeing as how Research Bodies seems to basically be doing what I was messing around with, it would make sense to move in a different direction and try using the overlays like what you were describing. I can already foresee some issues, but it could be cool as a \u0022hardcore\u0022 option. I\u0027ll think about it!"},{"CreatedByName":"ShotgunNinja","CreatedById":159391,"CreatedDateTime":"2016-12-12T02:45:27Z","Content":"Hi, this is a very interesting mod. I have a suggestion but didn\u0027t seem you have a repository so I\u0027m posting it here.\n\nYou are currently (ab)using the subject id to store an unique id for your internal use, like \u0027-184610\u0027. What I suggest instead is to use a subject id like \u0027orbitalSurvey@-184610\u0027. In that way you can extract back the id for your internal use, and other third-party mods that deal with science data have a chance of obtaining some short description for the data. Even if the associated experiment definition doesn\u0027t exist."},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2016-12-12T02:54:48Z","Content":"\u003E \n\u003E \n\u003E 16 minutes ago, ShotgunNinja said:\n\u003E \n\u003E \n\u003E Hi, this is a very interesting mod. I have a suggestion but didn\u0027t seem you have a repository so I\u0027m posting it here.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E You are currently (ab)using the subject id to store an unique id for your internal use, like \u0027-184610\u0027. What I suggest instead is to use a subject id like \u0027orbitalSurvey@-184610\u0027. In that way you can extract back the id for your internal use, and other third-party mods that deal with science data have a chance of obtaining some short description for the data. Even if the associated experiment definition doesn\u0027t exist.\n\u003E \n\nUnfortunately it might have been one of those \u0022it\u0027s working, don\u0027t touch it!\u0022 moments. Thanks for the heads up, I\u0027ll take a look.\n\n**Edit**\n\nYeah, it\u0027s coming back to me after taking a look. The experiment definition doesn\u0027t exist because the stock survey system doesn\u0027t use an experiment definition either, it\u0027s just a transmission that is thrown out there and caught by the callback. Yes, it\u0027s very strange Squad did it this way, and it probably would be cool to set up proper experiments for my add-on, but it is what it is.\n\nCurrently I\u0027m using the ScienceData subject to identify the module that sent it. In the next update I\u0027ll be sure to at least make the subject unique with your suggestion.\n\n**Edited \u003Ctime datetime=\u00222016-12-12T03:08:18Z\u0022 title=\u002212/12/2016 03:08  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 12, 2016\u003C/time\u003E by Wheffle**\n  \nextra info"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2016-12-13T20:09:03Z","Content":"Liking the stockalike mechanic design here. That discovery blur looks pretty good, too. Any idea on time-scale for implementation there?"}]}