{"TopicId":112635,"ForumId":34,"TopicTitle":"[1.0.4] Maritime Pack - 0.1.4","CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-06-11T04:21:13Z","PageNum":19,"Articles":[{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-09-13T20:00:28Z","Content":"\u003E \n\u003E Cool, so you found a way for keeled hulls to work? Because the hull of the patrol boat is definetly non-flat.\n\n\u003E \n\u003E Will you take over boat parts? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\n**Boat Parts \u002B Maritime Pack**\n\nWell, it\u0027s been hinted at for weeks now so, time to make it semi official.\n\n**Here\u0027s how it began.**\n\nIf you go back in this thread a good ways, you\u0027ll see some posts from InfiniteDice (ID) saying if he could be of any assistance to let him know. We exchanged a few private mails on the forums and he ended up giving me his skype name. A few weeks ago, I started working on Subs and knew he\u0027d solved the problem with the fact that when viewed from below, the surface of water in KSP is... well... not there. So, I got into a chat with him and he gladly gave me rights to use his code that fixed that problem. I went to work. Not knowing a DAMN thing about C# but having some coding background in Pascal and PHP, I started tinkering. In the midst of that tinkering, ID and I got to chatting pretty frequently. ID is working on another project based on the Unity engine. He\u0027s pretty heavily involved in it and as a result, indicated he doesn\u0027t really have time to manage the Boat Parts thread or keep up with the parts themselves. As a matter of fact, his parts haven\u0027t been updated since the big \u0027Node Debacle\u0022 with .90 when all of the connection nodes in the .cfg files got nerfed. Which means, his parts didn\u0027t connect any more. What ID does enjoy doing is coding. And he\u0027s good at it. So, we began discussing the possibility of putting both of our salty heads together and making both of our packs better in the process.\n\n**Where it is now.**\n\nWhile we haven\u0027t hashed out all the details, here\u0027s what we discussed. And keep in mind, this may change. Since ID doesn\u0027t really have the time to manage his pack, I agreed to help him in that area. The Boat Parts thread will (remember this is tentative) will be shut down. We haven\u0027t decided if this thread will shut down as well or not. Either way, this thread or a new thread will become the home for both Maritime Pack and Boat Parts. I\u0027ll basically be working with the parts. Redoing all the .cfg files (which is already mostly done) and managing the combined forum thread. ID is going to handle the vast majority of the coding with me bashing the keyboard doing some coding. This way, he can focus on what he\u0027s good at. I have a background in Public Affairs and Journalism so managing the forum thread is right up my alley (hence all the WOT posts). With the two of us working together, hopefully, both packs will be improved as a result.\n\n**What\u0027s to come.**\n\nThis is where things get fun. First, ID has been working on an entirely new \u0027float code\u0027 for boats. Your first question may be, \u0022why?\u0022 AFAIK there\u0027s only 2 other mods that mess with KSP flotation: Firespitter and Better Buoyancy. Firespitter\u0027s code was written to handle aircraft pontoons. While it works, it leaves a lot to be desired. V hull ships still don\u0027t work with it. Better Buoyancy was written because apparently Ferram can\u0027t fly using his aerodynamic mod without crashing into the ocean. Rather than learn how to fly, he changed the physics of water. It does little or nothing to help boats. This will be the first plugin specifically designed for maritime usage. And, it\u0027s impressive.\n\nI\u0027m still working on a civilian submarine but I\u0027ve been diving into code as well. I just completed a plugin that works with engines and animations. When the engine is started, the animation plays. When the engine is shut down, the animation reverses itself. Optionally, it can be throttle based. If your throttle is at 50%, the animation plays to the 50% point and stops. And there\u0027s smoothing so that if you instantly drop the throttle from 100% to 0, the animation plays gradually rather than instantly.\n\nI also have working code to close air intakes underwater and to shut down engines specifically designed for water usage. I know that\u0027ll put a serious thorn in Jatwaa\u0027s behind but realistically guy, paddlewheels should not make good aircraft.\n\nEventually, I\u0027m hoping both the plugins that ID is working on and the one I\u0027m working on will be generic enough that they can be used on any mod.\n\nAnd there\u0027s lots... LOTS more changes coming.\n\nFor now, our primary goal is getting Boat Parts with his carrier and his sub back on the board with a new set of code that works.\n\n- - - Updated - - -\n\n\u003E \n\u003E Hello everyone, \n\u003E I do not want to seem as if I am advertising my mod at all but I saw a while back someone ask about new parts to move a vessel into the sea; especially since KerbinSide\u0027s ocean bases have not been updated yet.\n\nYou\u0027re more than welcome to dive in Whitecat. Since your mod is pretty specific to boats and since the only two mariners on Kerbin appear to be joining forces, this would be the place to advertise.\n\nI can tell you though that when this merger does happen, ID has water launch code. I\u0027m not certain if I\u0027m going to apply it to Maritime as it\u0027s just too much like hyperedit cheating to me.\n\n- - - Updated - - -\n\n\u003E \n\u003E Actually i had a look and there was only really the clipper parts.\n\nThen you may have gotten a bad download or you downloaded an old pack. Make sure to delete the entire Maritime Pack directory before installing 0.1.4. It creates a new directory structure. If you don\u0027t delete it, it\u0027ll produce some odd results.\n\n- - - Updated - - -\n\n\u003E \n\u003E you posted this back in June this is exactly what i meant when i said ship of the line, except bigger\n\u003E now i only need cannons...\n\nAcually, that was from the steampunk mod and he does have cannons. It just doesn\u0027t float all that well.\n\n- - - Updated - - -\n\n\u003E \n\u003E I\u0027d like to report a bug that I\u0027ve been having issues with but have not seen reported here before. It seems that the clipper deck adapter likes to randomly overheat like I\u0027ve heard cubic octagonal struts like to do in stock (I use stock bugfix modules). This issue only happened on my paddle-replica of the USS Langley, probably because it used a ton of them for the runway. This issue actually led to it\u0027s demise when I turned on physics warp while testing Lack\u0027s nuclear ramjet within physics range of the KSC. The crew survived, but the entire runway was separated from the ship.\n\nOk, this is a new one to me. I looked into the config and the heat tolerances are in line with the rest of the parts. So, questions arise. Are you blasting these parts with engines? Do you have non-Maritime Pack parts on your boat that generate heat? Unlike CVE parts, the crash tolerance on that part isn\u0027t that high. I really didn\u0027t expect anyone to use it for a flight deck. You may want to try upping that tolerance in the .cfg and see if that solves the problem.\n\n**Edited \u003Ctime datetime=\u00222015-09-13T20:19:12Z\u0022 title=\u002209/13/2015 08:19  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 13, 2015\u003C/time\u003E by Fengist**"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-09-13T20:09:38Z","Content":"\u003E \n\u003E **Boat Parts \u002B Maritime Pack**\n\u003E -snip-\n\nAwesome.\n\n\u003E \n\u003E **What\u0027s to come.**\n\u003E \n\u003E This is where things get fun. First, ID has been working on an entirely new \u0027float code\u0027 for boats. Your first question may be, \u0022why?\u0022 AFAIK there\u0027s only 2 other mods that mess with KSP flotation: Firespitter and Better Buoyancy. Firespitter\u0027s code was written to handle aircraft pontoons. While it works, it leaves a lot to be desired. V hull ships still don\u0027t work with it. Better Buoyancy was written because apparently Ferram can\u0027t fly using his aerodynamic mod without crashing into the ocean. Rather than learn how to fly, he changed the physics of water. It does little or nothing to help boats. This will be the first plugin specifically designed for maritime usage. And, it\u0027s impressive.\n\nPersonally, I prefer Better Buoyancy over stock because stock water is really bouncy to the point of near absurdity.\n\nAlso, do either you or Infinite Dice know anything about water simulation in Unity 5.2? While SQUAD hasn\u0027t said much about the water simulation, there likely will be changes.\n\n\u003E \n\u003E I also have working code to close air intakes underwater and to shut down engines specifically designed for water usage. I know that\u0027ll put a serious thorn in Jatwaa\u0027s behind but realistically guy, paddlewheels should not make good aircraft.\n\nLol! I had also found that out myself too, totally by accident.\n\n\u003E \n\u003E I\u0027d like to report a bug that I\u0027ve been having issues with but have not seen reported here before. It seems that the clipper deck adapter likes to randomly overheat like I\u0027ve heard cubic octagonal struts like to do in stock (I use stock bugfix modules). This issue only happened on my paddle-replica of the USS Langley, probably because it used a ton of them for the runway. This issue actually led to it\u0027s demise when I turned on physics warp while testing Lack\u0027s nuclear ramjet within physics range of the KSC. The crew survived, but the entire runway was separated from the ship.\n\nIt might have something to do with part clipping. The outrigger main part and the outrigger sections ABSOLUTELY HATE parts clipping into them and will heat up extremely quickly when you launch.\n\nI\u0027ve also run into issues when doing physics warp where the boat parts will heat up. That may have had to do with the blisters though."},{"CreatedByName":"crasher925","CreatedById":44578,"CreatedDateTime":"2015-09-13T20:39:40Z","Content":"\u003E \n\u003E Acually, that was from the steampunk mod and he does have cannons. It just doesn\u0027t float all that well.\n\ncan i have a link?"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-09-13T20:44:30Z","Content":"MY CARRIERS WILL BE BACK ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nand what about swimming/diving plugin from ID?"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-09-13T21:26:10Z","Content":"\u003E \n\u003E MY CARRIERS WILL BE BACK ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\u003E and what about swimming/diving plugin from ID?\n\nSwimming code.... included ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n- - - Updated - - -\n\n\u003E \n\u003E can i have a link?\n\n[linky](https://forum.kerbalspaceprogram.com/threads/74625-1-02-Vertical-Propulsion-Emporium-v0-22b-%2810th-may-2015%29)"},{"CreatedByName":"crasher925","CreatedById":44578,"CreatedDateTime":"2015-09-13T22:25:38Z","Content":"\u003E [linky](https://forum.kerbalspaceprogram.com/threads/74625-1-02-Vertical-Propulsion-Emporium-v0-22b-%2810th-may-2015%29)\n\nthanks!"},{"CreatedByName":"mike9606","CreatedById":90275,"CreatedDateTime":"2015-09-14T00:02:06Z","Content":"I think my problem may be related to the fact that I am running the last pre-release version of the new parts, not the actual release version even though I remember it being said redownloading was not required."},{"CreatedByName":"ThatOneBritishGuy...","CreatedById":144135,"CreatedDateTime":"2015-09-14T00:06:35Z","Content":"Fengist! Have you seen [this?](https://forum.kerbalspaceprogram.com/threads/132390-WIP-Kopernicus-Expansion-v0-1-2-comets-animated-gas-giants-and-more?p=2194384#post2194384)\n\nWe now have an actual reason to send subs to other planets (or at least we will soom^tm). Time to recreate the 2045 Europe submarine mission in 2015! ![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)\n\nAlso big congrats on the merge. As I supporter of this mod from (almost) day 1, I\u0027ve watched the mod since the beginning and I\u0027ll say with certainty that this is the largest step forward you\u0027ve taken since release ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif). Best of luck to both you and ID.\n\n**Edited \u003Ctime datetime=\u00222015-09-14T00:20:39Z\u0022 title=\u002209/14/2015 12:20  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by ThatOneBritishGuy...**"},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2015-09-14T00:12:19Z","Content":"Hey Fengist, whatever it is you embedded in your opening post of this thread HATES either IE or Adblock Plus. It locks the browser window up and even CTD\u0027d my browser at least twice. You might want to lighten the load.\n\nAlso, just got done setting a container ship up. Put giant tracks on the bottom to get it to the water, and once there, got it going at 90 knots. If I had downloaded the BDArmory cannon turrets, I\u0027d be all of going along to\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uvmCyW3OPes?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n tune."},{"CreatedByName":"ThatOneBritishGuy...","CreatedById":144135,"CreatedDateTime":"2015-09-14T00:28:41Z","Content":"\u003E \n\u003E Hey Fengist, whatever it is you embedded in your opening post of this thread HATES either IE or Adblock Plus. It locks the browser window up and even CTD\u0027d my browser at least twice. You might want to lighten the load.\n\u003E Also, just got done setting a container ship up. Put giant tracks on the bottom to get it to the water, and once there, got it going at 90 knots. If I had downloaded the BDArmory cannon turrets, I\u0027d be all of going along to\n\u003E \n\u003E \n\u003E \u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uvmCyW3OPes?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\u003E  tune.\n\nYou mean Sketchfab? I use Adblock Plus and it works great for me. No idea what you mean by IE."},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2015-09-14T01:04:49Z","Content":"\u003E \n\u003E You mean Sketchfab? I use Adblock Plus and it works great for me. No idea what you mean by IE.\n\nI don\u0027t know what he\u0027s got on the page, but it\u0027s causing significant lockups with Internet Explorer (IE)\\*. And by lockups, I mean, I navigate onto the page with the OP, and the browser tab for it locks up and doesn\u0027t so much as allow me to scroll or even interact with it. Then it \u0027might\u0027 let me burst scroll before it either crashes the window entirely, or flashes the \u0027[location] is unresponsive\u0027 message. I tried neutralizing ABP after last time when a similar chain of events actually killed the ABP engine. Jury\u0027s still out on that one. Seems like it both did, and didn\u0027t work. (Worked well enough to nab the DL, still had sketchy behavior on the OP.) I don\u0027t know.\n\n\\*(And before anyone comes in here and goes \u0027Don\u0027t use X browser, use Y browser!\u0027, no. We\u0027re not going to start an argument about which browser and/or software is best while everyone else has the wool pulled over their eyes. This is a standard browser and there is something wrong with whatever was implemented on the front page. I should have zero issue with going to the OP and... Interacting at all.)"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-09-14T03:23:14Z","Content":"\u003E \n\u003E I don\u0027t know what he\u0027s got on the page, but it\u0027s causing significant lockups with Internet Explorer (IE)\\*. And by lockups, I mean, I navigate onto the page with the OP, and the browser tab for it locks up and doesn\u0027t so much as allow me to scroll or even interact with it. Then it \u0027might\u0027 let me burst scroll before it either crashes the window entirely, or flashes the \u0027[location] is unresponsive\u0027 message. I tried neutralizing ABP after last time when a similar chain of events actually killed the ABP engine. Jury\u0027s still out on that one. Seems like it both did, and didn\u0027t work. (Worked well enough to nab the DL, still had sketchy behavior on the OP.) I don\u0027t know.\n\u003E \\*(And before anyone comes in here and goes \u0027Don\u0027t use X browser, use Y browser!\u0027, no. We\u0027re not going to start an argument about which browser and/or software is best while everyone else has the wool pulled over their eyes. This is a standard browser and there is something wrong with whatever was implemented on the front page. I should have zero issue with going to the OP and... Interacting at all.)\n\n\u003E \n\u003E Hey Fengist, whatever it is you embedded in your opening post of this thread HATES either IE or Adblock Plus. It locks the browser window up and even CTD\u0027d my browser at least twice. You might want to lighten the load.\n\u003E Also, just got done setting a container ship up. Put giant tracks on the bottom to get it to the water, and once there, got it going at 90 knots. If I had downloaded the BDArmory cannon turrets, I\u0027d be all of going along to\n\u003E \n\u003E \n\u003E \u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uvmCyW3OPes?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\u003E  tune.\n\nNormally I use Chrome or Edge which has no problem. I hadn\u0027t fired up IE in quite a while, but the instant I did and loaded the page, I saw the problem (I used a naked copy that came with Win 10 that I\u0027ve never even started before). It\u0027s the sketchfab 3D imbeds. For some reason, the new IE has issues with WebGL, which is what sketchfab uses. I\u0027ll refrain from embedding any more until that\u0027s fixed. Thanks for pointing it out.\n\nAnd there\u0027s no argument. You should be able to use any browser you want. If one has issues with some images I embedded, the images go away. Fact is, there\u0027s this big donate button on the OP and I want everyone to see it regardless of their browser ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif). There are some more embeds somewhere in the middle of this thread, pardon me if I don\u0027t go digging for them.\n\n- - - Updated - - -\n\n\u003E \n\u003E I think my problem may be related to the fact that I am running the last pre-release version of the new parts, not the actual release version even though I remember it being said redownloading was not required.\n\nThe prerelease is almost identical (change to the Bathysphere causing a crash) to the final release. I have no idea why you\u0027re not seeing parts. Can you do a screenshot of the directory structure?\n\n- - - Updated - - -\n\n\u003E \n\u003E Fengist! Have you seen [this?](https://forum.kerbalspaceprogram.com/threads/132390-WIP-Kopernicus-Expansion-v0-1-2-comets-animated-gas-giants-and-more?p=2194384#post2194384)\n\u003E We now have an actual reason to send subs to other planets (or at least we will soom^tm). Time to recreate the 2045 Europe submarine mission in 2015! ![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)\n\nBecause all my days are now spent in a stripped down \u0027dev\u0027 copy of KSP, I almost never download and install other mods. Hell, I haven\u0027t played my \u0027game\u0027 copy now in... several months. When you have to restart KSP 30 times in one sitting just to find out why your .dll is causing null ref\u0027s, you quickly learn that more mods = more waiting.\n\nWhile I\u0027m aware of Kopernicus, I\u0027ve never used it. But, you informing me of this has changed my mind about one thing. I\u0027ve been discussing with ID of setting a hard limit for dives to 1,000m (the point where the stock sea floor becomes penetrable). What you have made me realize is that should be an option in the .cfg for the main sub part so that should someone be using this mod, it\u0027ll allow for deeper dives.\n\nThanks\n\n\u003E \n\u003E Also big congrats on the merge. As I supporter of this mod from (almost) day 1, I\u0027ve watched the mod since the beginning and I\u0027ll say with certainty that this is the largest step forward you\u0027ve taken since release ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif). Best of luck to both you and ID.\n\nThanks, it\u0027s going to mean a lot more work trying to manage 2 mods but, the end result will be lots more boats for you guys (and the bigger carrier monkey will be off my back for a while). I\u0027ve already resigned myself to the fact that getting done what I want is gonna take a long... long time and Maritime will probably be so large in the end that you\u0027ll have to select which parts you really want and ditch the rest. Someone said early in my modding that, together, Dice and I could rule the oceans. We\u0027ll, just like every country that has tried to rule the oceans I\u0027m learning that while the imagination sets the limits, accomplishing that task won\u0027t be done overnight.\n\n**Edited \u003Ctime datetime=\u00222015-09-14T03:28:42Z\u0022 title=\u002209/14/2015 03:28  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by Fengist**"},{"CreatedByName":"mike9606","CreatedById":90275,"CreatedDateTime":"2015-09-14T03:30:35Z","Content":"The problem I\u0027m having isn\u0027t that parts are not appearing but that the clipper deck adapter likes to overheat and explode, especially when there are a lot of them together."},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-09-14T03:46:06Z","Content":"\u003E \n\u003E The problem I\u0027m having isn\u0027t that parts are not appearing but that the clipper deck adapter likes to overheat and explode, especially when there are a lot of them together.\n\nAh right, getting 2 problems confused. When exactly do they overheat? When sitting still, when moving, etc? Just wondering how I can reproduce these results.\n\n**Edited \u003Ctime datetime=\u00222015-09-14T05:13:20Z\u0022 title=\u002209/14/2015 05:13  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by Fengist**"},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2015-09-14T03:57:21Z","Content":"\u003E \n\u003E Normally I use Chrome or Edge which has no problem. I hadn\u0027t fired up IE in quite a while, but the instant I did and loaded the page, I saw the problem (I used a naked copy that came with Win 10 that I\u0027ve never even started before). It\u0027s the sketchfab 3D imbeds. For some reason, the new IE has issues with WebGL, which is what sketchfab uses. I\u0027ll refrain from embedding any more until that\u0027s fixed. Thanks for pointing it out.\n\u003E And there\u0027s no argument. You should be able to use any browser you want. If one has issues with some images I embedded, the images go away. Fact is, there\u0027s this big donate button on the OP and I want everyone to see it regardless of their browser ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif). There are some more embeds somewhere in the middle of this thread, pardon me if I don\u0027t go digging for them.\n\nNo worries. I was just preempting. I\u0027ve got a friend whom I was actually talking to on Skype while perusing the page, and he was all critical of my browser choice almost the moment I started expressing my irritation. It irritates me when something I have works just fine forever, and then the one time I run into a problem, everyone comes out of the woodwork to tell me how horrible the thing I\u0027m using is and how typical it is of developer X that said problem appears.\n\nI\u0027m like:\n\n\u0022Really? Naught but the occasional one-off problem every six to eight months considering almost non-stop 6 to 12 hour use every day, and that is \u0027horrible\u0027?\u0022 \n\nEspecially if it concerns people taking a chance for an At Bat at Microsoft to try and \u0027sell\u0027 Firefox or Google Chrome, or whatever. The behavior can be tiresome. So yeah, like I said, I was preempting before someone decided when they spotted that comment to come in here and proselytize at me."},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2015-09-14T18:43:39Z","Content":"\u003E \n\u003E **Boat Parts \u002B Maritime Pack**\n\nYes!\n\n\u003E \n\u003E I\u0027m still working on a civilian submarine but I\u0027ve been diving into code as well.\n\n Baddum-tish!\n\n\u003E \n\u003E I also have working code to close air intakes underwater and to shut down engines specifically designed for water usage. I know that\u0027ll put a serious thorn in Jatwaa\u0027s behind but realistically guy, paddlewheels should not make good aircraft.\n\nCan engines be made non-air driven by aggressively curtailing their performance curves, such that their thrust hits zero as soon as they reach \u003E0m altitude?\n\n\u003E \n\u003E And there\u0027s lots... LOTS more changes coming.\n\u003E \n\u003E For now, our primary goal is getting Boat Parts with his carrier and his sub back on the board with a new set of code that works.\n\nLooking forward to this a lot - I\u0027ve wondering what a carrier with a civilian Maritime texture theme will look like. And if that untidy broken stuff (there for a damange mod that never was) on the underside of the landing deck can be removed, that\u0027d be great. Dice had a destroyer hull quite a while ago (\u003E1 year), even showed it off on YouTube. Will that finally see light of day?"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-09-14T20:26:02Z","Content":"\u003E \n\u003E Hey Fengist, whatever it is you embedded in your opening post of this thread HATES either IE or Adblock Plus. It locks the browser window up and even CTD\u0027d my browser at least twice. You might want to lighten the load.\n\u003E Also, just got done setting a container ship up. Put giant tracks on the bottom to get it to the water, and once there, got it going at 90 knots. If I had downloaded the BDArmory cannon turrets, I\u0027d be all of going along to\n\u003E \n\u003E \n\u003E \u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uvmCyW3OPes?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\u003E  tune.\n\nYes, I get that too with IE. It\u0027s sketchfab, a while ago it just didn\u0027t load the model, but now..."},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2015-09-14T21:19:05Z","Content":"As a thought after playing a bit with this, I might make a suggestion to the construction of ships and ship parts.\n\nInstead of large, individual boat/ship segments, layer ships in three or four specialized layers.\n\nStarting from the bottom:\n\nKeel layer.\n\n- In shipbuilding, the keel of a vessel is considered to be its spine, allowing both the structure to be built around it and in some types, to serve as a hydrodynamic \u0027fin\u0027 of sorts. It can also act as a point of weight on the hull, improving balance and preventing capsizing. While modern shipbuilding methods have turned to prefabbed hull section in large chunks, weight distribution can still be enforced and massive physical weights lined down near the keel itself to keep a vessel balanced. In KSP, a part\u0027s mass is centered on the part, or specifically placed, so giant prefab sections are actually not very stable, leading to your implementation of outriggers.\n\nI suggest the implementation of \u0027keel\u0027 parts that are snapped together the way your main clipper hulls are put together now. Low buoyancy and high mass, but narrow with nodes on top for laying other parts..\n\nHull Layer:\n\n- Your \u0027main\u0027 parts can be converted to this with some modifications. Hull parts clip onto the keel parts to create the tub-shape design of a ship and make it float upright. The modification is to uncap the top of them (remove the deck) and make the parts physically hollow. In doing so, equipment such as fuel tanks, cargo pods, and various machinery can be placed into the hull of the ship, instead of on top of it, keeping the center of gravity low, and the vessel stable in the water. Said hull parts would have a \u0027floating\u0027 connect node over the open middle part, that way the next part type can be snapped to the top of them to seal them up (or not, depends on your preference.)\n\nDeck Layer:\n\n- Instead of a big hull \u0027chunk\u0027, a deck layer would just be the lid to put on your hulls. They would connect directly to the floating nodes over hull parts to create the solid surface on the top of the ship. Like the current setup for this mod, the deck would still have its nodes, allowing the player to stack more pods onto the ship, increasing its cargo capacity. Or, with something like opening decks, clever use of KAS, and some patience, an entire cargo dock and crane setup could be employed.\n\nEither way, I think customizability would improve, and vessel design would look more like real world designs, since now fuel doesn\u0027t have to be PART of the hull part (clipper fuel hull), but placed strategically inside the hull, same with cargo pods, etc.\n\nIncidentally, I tested a design that had a hull loaded down with 1300 TONS of metal in a cargo container on the deck. Either physics acceleration hates that level of mass, or KSP just hates 1300 metric tons of mass on a vessel, period."},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-09-15T00:58:57Z","Content":"\u003E \n\u003E As a thought after playing a bit with this, I might make a suggestion to the construction of ships and ship parts.\n\u003E Instead of large, individual boat/ship segments, layer ships in three or four specialized layers.\n\u003E \n\u003E Starting from the bottom:\n\u003E \n\u003E Keel layer.\n\u003E \n\u003E - In shipbuilding, the keel of a vessel is considered to be its spine, allowing both the structure to be built around it and in some types, to serve as a hydrodynamic \u0027fin\u0027 of sorts. It can also act as a point of weight on the hull, improving balance and preventing capsizing. While modern shipbuilding methods have turned to prefabbed hull section in large chunks, weight distribution can still be enforced and massive physical weights lined down near the keel itself to keep a vessel balanced. In KSP, a part\u0027s mass is centered on the part, or specifically placed, so giant prefab sections are actually not very stable, leading to your implementation of outriggers.\n\nAh hah! Someone else who thinks like a human and not a member of Squad. Not to worry, I made that same mistake when I first started modding. Allow me to demonstrate Squad\u0027s IMPROVED laws of physics:\n\n![diagram1.jpg](http://www.datainterlock.com/Kerbal/Shipyard/diagram1.jpg)\n\n\u003E \n\u003E I suggest the implementation of \u0027keel\u0027 parts that are snapped together the way your main clipper hulls are put together now. Low buoyancy and high mass, but narrow with nodes on top for laying other parts..\n\nSo, for your keel idea. While it would add mass, it wouldn\u0027t add a balancing effect even on a flat bottomed hull. What it WOULD do, is increase the drag to the point that you\u0027d only be moving at 3-4m/s\n\n\u003E \n\u003E Hull Layer:\n\u003E \n\u003E - Your \u0027main\u0027 parts can be converted to this with some modifications. Hull parts clip onto the keel parts to create the tub-shape design of a ship and make it float upright. The modification is to uncap the top of them (remove the deck) and make the parts physically hollow. In doing so, equipment such as fuel tanks, cargo pods, and various machinery can be placed into the hull of the ship, instead of on top of it, keeping the center of gravity low, and the vessel stable in the water. Said hull parts would have a \u0027floating\u0027 connect node over the open middle part, that way the next part type can be snapped to the top of them to seal them up (or not, depends on your preference.)\n\nProblems:\n\n- Any mass below the surface adds drag.\n- Any part node that comes into contact with the surface is checked for breakage.\n\nSo, putting cargo inside hulls, until collision checks and reduced mass on water can be fixed will only result in drag and explosions. Sorry.\n\n\u003E \n\u003E Deck Layer:\n\u003E \n\u003E - Instead of a big hull \u0027chunk\u0027, a deck layer would just be the lid to put on your hulls. They would connect directly to the floating nodes over hull parts to create the solid surface on the top of the ship. Like the current setup for this mod, the deck would still have its nodes, allowing the player to stack more pods onto the ship, increasing its cargo capacity. Or, with something like opening decks, clever use of KAS, and some patience, an entire cargo dock and crane setup could be employed.\n\nIn coming up with ideas for this mod, I think we\u0027re on the same track. I actually tested cargo containers using a crane built with Infernal Robotics and KAS. The containers had docking ports on them so they could be stacked. I even designed a rack system to store them in when placing them on the deck didn\u0027t work.\n\nI\u0027ll say this. I haven\u0027t completely given up on the idea but currently, those parts are in the junkyard. When KAS attaches to a part, docked or undocked, trying to dock what\u0027s on the end of a KAS winch becomes nearly impossible.\n\n\u003E \n\u003E Either way, I think customizability would improve, and vessel design would look more like real world designs, since now fuel doesn\u0027t have to be PART of the hull part (clipper fuel hull), but placed strategically inside the hull, same with cargo pods, etc.\n\nAs it stands now, there are 6 basic hull parts and already I have the first complaint about the memory usage of this mod (I\u0027ll be working on that). What you\u0027re suggesting is... I think... tripling the number of parts... textures... memory.... etc.\n\nWhile I don\u0027t disagree with you on any part of this. I\u0027d love to be able to put out a pack that allows that level of customization, the first hurdle to overcome would be part count/textures. The second hurdle, I\u0027m working on. I\u0027ve been modding now for just over 3 months. When I first came up with this idea, planning for 6 months down the road was NOT even considered as I honestly didn\u0027t think this mod would.... float.\n\nHopefully, I\u0027ve managed to explain why developing this mod is an ongoing headache. I keep trying to think like a human when making these parts. I should instead be thinking like a member of Squad and, after months now of studying their thought process, I\u0027m still not sure how to do that.\n\n\u003E Incidentally, I tested a design that had a hull loaded down with 1300 TONS of metal in a cargo container on the deck. Either physics acceleration hates that level of mass, or KSP just hates 1300 metric tons of mass on a vessel, period.\n\nBoth. More than anything, it\u0027s the fact that it\u0027s 1300 metric tons on a vessel that\u0027s sitting on Squad water.\n\nBut... the upcoming code that Dice is working on... he floated nearly 500 tons with 0 issues. So, here\u0027s hoping."},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-09-15T01:06:23Z","Content":"You may have missed my question earlier. Fengist, do either you or Infinite Dice know anything about the water simulation in Unity 5.2? I\u0027m not hoping for a very realistic water simulation in 1.1, but I\u0027m sure whatever basic package that\u0027s in Unity 5.2 will be improved over whatever basic package (or whatever they did) that SQUAD used."},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2015-09-15T01:52:46Z","Content":"I get it Fengist. Though with the engine update on the way, it might be prudent to start prepping parts now and have them ready to slap code to.\n\nAlso, it wasn\u0027t 1300 tons in Squad water, it was 1300 metric tons sitting on a series of track wheels on the runway... That I was moving towards the water. (Why do you think I was using physics acceleration in the first place? Tracks are slow.) The Unity engine itself seemed not to like it. Lost control of my buttons and keyboard commands and had to force-kill the program.\n\nAnd what was Dice working on, the Better Bouyancy mod? I\u0027ve got I think the Dev Build of that installed.\n\nEDIT: Nope, that\u0027s Ferram. Do we have a link floating around? Or is this modder dev chatter?\n\n**Edited \u003Ctime datetime=\u00222015-09-15T01:56:16Z\u0022 title=\u002209/15/2015 01:56  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 15, 2015\u003C/time\u003E by AdmiralTigerclaw**"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-09-15T01:57:54Z","Content":"since you will take over boat parts can you do a ship like the nimitz ones? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\n![CVN-69-SPIE-training.jpg](https://upload.wikimedia.org/wikipedia/commons/8/8d/CVN-69-SPIE-training.jpg)\n\n(may not that big, just shaped like that ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) )"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-09-15T04:58:19Z","Content":"\u003E \n\u003E I get it Fengist. Though with the engine update on the way, it might be prudent to start prepping parts now and have them ready to slap code to.\n\u003E Also, it wasn\u0027t 1300 tons in Squad water, it was 1300 metric tons sitting on a series of track wheels on the runway... That I was moving towards the water. (Why do you think I was using physics acceleration in the first place? Tracks are slow.) The Unity engine itself seemed not to like it. Lost control of my buttons and keyboard commands and had to force-kill the program.\n\u003E \n\u003E And what was Dice working on, the Better Bouyancy mod? I\u0027ve got I think the Dev Build of that installed.\n\u003E \n\u003E EDIT: Nope, that\u0027s Ferram. Do we have a link floating around? Or is this modder dev chatter?\n\nNope, only Dice and I have a copy of what he\u0027s working on. But, I made the video below to show you where the thought process is going. Some things to keep in mind when viewing this:\n\n- This is merely a proof of concept. It\u0027s still in the very early stages.\n- The \u0027boxes\u0027 you see won\u0027t be in the final product. This is just so we have a visual reference while in development.\n- Many things are not yet working as they should. While linear drag is something we can set, drag when at an angle doesn\u0027t exist yet. So, turning vessels doesn\u0027t work well, which is why this video is all straight line sailing.\n- Many of the things you see in the GUI won\u0027t be adjustable via the GUI but will be via the config.\n- There are other options in the config that you don\u0027t see on the gui.\n- No, we have no idea as to when. Dice is doing this in his spare time.\n- We have not tested this with tweakscale. While it does work on parts ranging from my clippers to Dice\u0027s carrier I won\u0027t make any promises that we\u0027ll even test it with tweakscale. I know you guys want big boats but to me, tweakscale is like a band-aid.\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/KtuZwGkxO9Y?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n- - - Updated - - -\n\n\u003E \n\u003E since you will take over boat parts can you do a ship like the nimitz ones? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\u003E [https://upload.wikimedia.org/wikipedia/commons/8/8d/CVN-69-SPIE-training.jpg](https://upload.wikimedia.org/wikipedia/commons/8/8d/CVN-69-SPIE-training.jpg)\n\u003E \n\u003E (may not that big, just shaped like that ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) )\n\nI\u0027ll put it this way. Dice has carrier parts in his pack and we\u0027ll get those working. He has no plans to expand that any further. I have no plans to expand that any further. If you can take his parts and make a Nimitz, then yes. If you can\u0027t, then no.\n\n**Edited \u003Ctime datetime=\u00222015-09-15T10:25:01Z\u0022 title=\u002209/15/2015 10:25  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 15, 2015\u003C/time\u003E by Fengist**"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-09-15T12:16:22Z","Content":"Are you ignoring my question or something? If you don\u0027t know, then okay, just say you don\u0027t know."},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-09-15T13:46:14Z","Content":"\u003E \n\u003E You may have missed my question earlier. Fengist, do either you or Infinite Dice know anything about the water simulation in Unity 5.2? I\u0027m not hoping for a very realistic water simulation in 1.1, but I\u0027m sure whatever basic package that\u0027s in Unity 5.2 will be improved over whatever basic package (or whatever they did) that SQUAD used.\n\nAh sorry, you know I don\u0027t ignore you typically. Just saw the question and forgot to answer.\n\nI\u0027m currently working with Unity 5.1 and am writing code using the 5.1 dll\u0027s. AFAIK, there are no changes to the way the code works, merely changes in the way it\u0027s accessed. It means, a lot of mods that are written prior to 5.1, should the modder upgrade, will find they have to rewrite large chunks of their code.\n\nI\u0027m pretty sure though that the way water works in KSP is the result of Squad\u0027s coding. I\u0027ve seen other aquatic games/sims written in Unity and their water is nothing like KSP.\n\nSo, if there\u0027s going to be any changes, it\u0027ll be because Squad either wants to change it or has to change it."}]}