{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":167,"Articles":[{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-12-10T21:27:58Z","Content":"\n\u003Cp\u003ESince you talk about sat you must be using RT2. You need the dev version of MJ to fix that bug. Or disable delay in RT2 config.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-12-10T21:31:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DerekL1963\u0022 data-cite=\u0022DerekL1963\u0022\u003E\u003Cdiv\u003EOK, upgraded to the 123 build this AM and found a minor oddity in Smart A.S.S.. When I select ORBT/Normal \u002B, it orients the vehicle to the proper attitude, but unlike 102 (which I was upgrading from) it leaves the vehicle with a roll rate.\u003Cp\u003E(And thanks for warp-to-time!)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnother build already? I used 122 last night and saw a similar issue. Enable kill rotation or use one of the orbit pointing functions with force roll then turn SASS off and the ship will start rolling without any control inputs and the pitch/yaw/roll meters all in the middle.\u003C/p\u003E\u003Cp\u003ETurn SASS on and it goes back to holding orientation, off and it immediately begins to roll again.\u003C/p\u003E\u003Cp\u003EWhat would be nice is if KSP simulated what happens to the orientation of things in orbit, they align to point radially out from the planet they\u0027re orbiting because of tidal effect. Objects like the Hubble telescope and the ISS have to constantly use reaction wheels or thrusters to counteract the gravity tidal effect trying to orient them like spokes on a wheel. The effect can be used to advantage for things like communication satellites by making them long enough and distributing mass towards the ends so they\u0027ll keep the antenna aimed down without needing constant attitude control.\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-12-10T21:34:22Z","Content":"\n\u003Cp\u003EHello to all. I am / have been trying to get MJ and FAR to work together, just a little bit.... I am only working with rockets, no planes, ssto or shuttles. All working great,,,,, until time to deorbit and try to use landing guidance. I have all tabs on FAR turned off, but still problems when trying to use LG to get me down. I have loaded latest MJ, FAR, MJFAR and all other that i know of. \u003C/p\u003E\u003Cp\u003EAm I just wasting my time for now and would be better just to pull FAR, or is there some \u0027special\u0027 trick or something that I am doing wrong.\u003C/p\u003E\u003Cp\u003EMany thanks for all previous support and all work that Sarbian has done. This is my #1 MUST HAVE mod.... Cheers.\u003C/p\u003E\n"},{"CreatedByName":"skips","CreatedById":89142,"CreatedDateTime":"2013-12-10T21:39:53Z","Content":"\n\u003Cp\u003E@sarbian\u003C/p\u003E\u003Cp\u003EI am pleased to say that the latest release of MechJeb fixes the problem with warping to the SOI transition point from an enclosed SOI to an outer SOI. (i.e., from orbiting Mun to a Kerban orbit) I am still having problems with the return from moon failing to generate an orbit that has a periapsis at the correct distance. It appears to be worse for orbits that are highly inclined from the equatorial orbit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003Eskips\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Awesome_Guy","CreatedById":96161,"CreatedDateTime":"2013-12-10T21:44:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003ESince you talk about sat you must be using RT2. You need the dev version of MJ to fix that bug. Or disable delay in RT2 config.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethanks a bunch\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-12-10T23:21:22Z","Content":"\n\u003Cp\u003EBuild 122. Another landing test on Eve. Almost working.\u003C/p\u003E\u003Cp\u003ESince I\u0027ll be needing to do on-surface refueling, I got out the functional but pointless* drill rover I tested on Mun and added four more of the white radial mount engines, bringing the total to six.\u003C/p\u003E\u003Cp\u003EFirst test it was going down nicely, almost down to the right landing speed... then it began to rapidly wobble back and forth with the engines at full throttle, eventually hard landing, breaking all four landing legs in the down position, breaking 7 of the 8 wheels and breaking off some of the engines and fuel tanks. It\u0027s built to jettison them with separatrons after landing. There\u0027s no RCS on it, just reaction wheels.\u003C/p\u003E\u003Cp\u003ESecond test I stuck on four radial mount parachutes on the fuel tanks. Comes down nice and stable... hey, is it going to light up or not? Gear down... engines? Hello computer? We could use some thrust about now! Hard landing at 8 meters per second after yet another too late burn at less than full throttle, only broke one landing leg which I was able to get rid of by driving forward a bit to make it explode. But still unsatisfactory because the design uses the legs for stability and if needed a bit of extra height to connect to the lander.\u003C/p\u003E\u003Cp\u003EPerhaps using only a couple of chutes would keep enough vertical velocity to push MechJeb into starting the burn higher and harder to get the speed down to the requested .5 meter/second? Or perhaps going up to 1 would change things?\u003C/p\u003E\u003Cp\u003EFuel tanks used are an X200-8 and four FL-T400. MechJeb is a miserly user of this supply. Without the parachutes it landed with over 70% of it left. It has enough engine thrust, it has more than enough fuel to make a safe one way trip down to Eve, but MechJeb is being too conservative on the final landing burn.\u003C/p\u003E\u003Cp\u003EI\u0027ve had landers run out of fuel many times testing on Kerbin, Mun and Duna with MechJeb, so why can\u0027t I get it to burn it all landing on Eve? This is a situation where I\u0027d be happy if it\u0027d burn almost all the way down, as long as it\u0027d calculate the trajectory to leave just fumes in the tanks at touchdown.\u003C/p\u003E\u003Cp\u003EWhen running out of fuel on other planets, the solution is to add more fuel, then add more engine if the additional weight makes it crash. Eve appears to need little fuel but lots of engine to land, but requires a supertanker\u0027s worth of fuel to get back to orbit.\u003C/p\u003E\u003Cp\u003EIt should be possible to put together a single stage orbit to surface to orbit Eve lander with a TWR greater than 1 in Eve gravity with full tanks. Give it just enough fuel to land with an aggressive burn profile then refuel on the surface, filling up all the tanks so the engines can run long enough to push the ship back up.\u003C/p\u003E\u003Cp\u003E*No fuel savings moving the heavy drills from the lander to the separate rover on Mun, but a bunch of work to get the rover\u0027s arm docked to the lander. Before I added the additional four engines I tried it as-is to see how bad it would fail with only 2. I don\u0027t consider that a test flight since it was known in advance it wasn\u0027t going to be able to land slow enough. If it had been able to kill horizontal velocity and hadn\u0027t flipped upside down after crashing it would\u0027ve worked for an intentionally hard landed stationary probe.\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-12-11T04:24:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drtedastro\u0022 data-cite=\u0022drtedastro\u0022\u003E\u003Cdiv\u003EHello to all. I am / have been trying to get MJ and FAR to work together, just a little bit.... I am only working with rockets, no planes, ssto or shuttles. All working great,,,,, until time to deorbit and try to use landing guidance. I have all tabs on FAR turned off, but still problems when trying to use LG to get me down. I have loaded latest MJ, FAR, MJFAR and all other that i know of. \u003Cp\u003EAm I just wasting my time for now and would be better just to pull FAR, or is there some \u0027special\u0027 trick or something that I am doing wrong.\u003C/p\u003E\u003Cp\u003EMany thanks for all previous support and all work that Sarbian has done. This is my #1 MUST HAVE mod.... Cheers.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFAR changes the stock drag model, that is everythin atmosphere related. Because of that, MJ won\u0027t do the calculations for the landing guidance correctly. \u003C/p\u003E\u003Cp\u003EEven though that does not work, that\u0027s no reason to uninstall FAR, FAR is awesome! and MJ still works for everything except landing on bodies with atmospheres! \u003C/p\u003E\u003Cp\u003EA technique I use: Press F5, set periapsis to, let\u0027s say 30Km (for example\u0027s sake), with the surface tab check my longitude when I perform the burn, wait until I land, then check my final longitude. Press F9, find the difference between initial and final longitude, let\u0027s say it\u0027s 150 deg. Now you have to make your deorbit burn 150 deg before your target longitude, and that\u0027s it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LameFrog","CreatedById":75711,"CreatedDateTime":"2013-12-11T07:42:04Z","Content":"\n\u003Cp\u003ECant find Ascent Guidance on the VJ panel after instal MJ 2.1. Any ideas were is it?\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-12-11T08:17:08Z","Content":"\n\u003Cp\u003EOk, sounds good. I really want to keep FAR in and this is the type of \u0027fix\u0027 that will help me do that. Many thanks AbeS..... And to Farram and Sarbian.... Really good stuff....\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-12-11T09:59:30Z","Content":"\n\u003Cp\u003EThanks the original author, without them MJ would not be here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lazurkri","CreatedById":16624,"CreatedDateTime":"2013-12-11T10:01:29Z","Content":"\n\u003Cp\u003EI got a question for you guys; I just downloaded the newest version of mechjeb then started a Career mode game, and am powering through it. Only thing is, I can\u0027t seem to find the radially attached Mechjeb in my parts list ( I\u0027m nearly done the techtree, the only thing left is Mod tech tree stuff like the Interstellar engines mod), just the actual Mechjeb command pod and the ar202 case that only does attitude control. AM I missing something stupidly obvious or does the Default AR202 case take the place of the fully functional one?\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-12-11T10:07:07Z","Content":"\n\u003Cp\u003EDo you play with a modded tree ? The case use the node name to unlock function, so if you use a tree with different node name then the function won\u0027t unlock.\u003C/p\u003E\n"},{"CreatedByName":"sjwt","CreatedById":9268,"CreatedDateTime":"2013-12-11T10:15:59Z","Content":"\n\u003Cp\u003EBeen a while since I used mechjeb, but I\u0027ve just installed 2.1 on a clean install of 0.22 and can not find the \u0027Ascent statics\u0027 or what ever it was called that used to tell you how much DV you had burnt since launch and where it went to ie Speed, Gravity loss, Steering, Drag.. Has this been removed or is it hidden?\u003C/p\u003E\u003Cp\u003ENever mind, found options in the customers window section!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-11T10:22:41Z\u0022 title=\u002212/11/2013 10:22  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 11, 2013\u003C/time\u003E by sjwt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-12-11T10:22:28Z","Content":"\n\u003Cp\u003EIt\u0027s not here by default. You can rebuild it with by adding a window with the custom window editor and adding item from the Recorder category (and maybe others, not in front of KSP now)\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-12-11T11:12:40Z","Content":"\n\u003Cp\u003EFinally got the Tinker landing instead of crashing on Eve.\u003C/p\u003E\u003Cp\u003EAdded some RCS thrusters and a small 50 unit mono tank and a single parachute. Landing on Eve is still a very dicey process. It tries to wobble back and forth but the chute keeps enough drag and stability on it without having *too much* drag - making MechJeb use enough thrust to cut the vertical speed down to the point where things won\u0027t break.\u003C/p\u003E\u003Cp\u003EStrange that with four parachutes it wouldn\u0027t use enough throttle to cut vertical speed enough for a damage free landing but with one it does. With no parachutes it will use full throttle but not soon enough and it\u0027s very unstable, makes three or four swoops then crashes and flips upside down. With only the two center engines (and pipes to them from the side tanks) it would land perfectly stable on Mun.\u003C/p\u003E\u003Cp\u003EI also test landed this on Kerbin from 71KM and when it came time to start the landing burn it went right to full throttle, which had the chute dragging below the lander for a bit.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pastebin.com/jJ1VDBch\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/jJ1VDBch\u003C/a\u003E Uses KSPX, ReStock, Quantum Struts, Kethane, Infernal Robotics, DROMOMAN.\u003C/p\u003E\u003Cp\u003EAfter landing, transfer fuel to the center tank then hit the spacebar a couple of times to jettison the engines and fuel tanks. The remains of the decouplers will vanish when you switch away and back to the rover. Raise and unfold the arm then decouple the RCS tank. Drop it from high enough and you won\u0027t have to delete the debris.\u003C/p\u003E\u003Cp\u003ENext step, convert this to a rover (Evers) with a Kethane converter, using the same robot arm plus add a docking port somewhere to connect the drill rover\u0027s arm to.\u003C/p\u003E\u003Cp\u003EThe manned lander (to be named Chance) is going to be the hard one to do.\u003C/p\u003E\n"},{"CreatedByName":"Lazurkri","CreatedById":16624,"CreatedDateTime":"2013-12-11T11:42:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EDo you play with a modded tree ? The case use the node name to unlock function, so if you use a tree with different node name then the function won\u0027t unlock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I have the tree modded so I can use the Interstellar stuff.....\u003C/p\u003E\u003Cp\u003EAlso, assume like a I\u0027m a idiot and explain a little more; I haven\u0027t played KSP for a few months so I\u0027m not up on all the new tricks to mods and stuff.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-12-11T13:04:01Z","Content":"\n\u003Cp\u003ESome people don\u0027t like it when I assume there are idiot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst the only part available in 2.x is the pod and ar202. I forgot that there was more part in 1.x ^^\u003C/p\u003E\u003Cp\u003EThe current version of mechjeb use the tree to unlock the case and then unlock some function. The case unlock at the \u0022flightControl\u0022 node and then other function unlock at advFlightControl, fieldScience, unmannedTech and advUnmanned (Those are the node internal name but you should match them easily with the displayed name). So the menu won\u0027t show all its options until you have all those node.\u003C/p\u003E\u003Cp\u003EIf you use the \u0022Interstellar\u0022 tree from treeloader those node should be present and the function should unlock since it\u0027s not that different from the stock tree.\u003C/p\u003E\u003Cp\u003EI understand you unlocked a lot already but did you unlock those ? Or maybe you did not check the AR case since earlier in the tree ?\u003C/p\u003E\u003Cp\u003EGalane : I\u0027ll take a look at your newer creation. If I replace the monoprop and 1 parachute by 4 parachute it should crash ?\u003C/p\u003E\n"},{"CreatedByName":"Lazurkri","CreatedById":16624,"CreatedDateTime":"2013-12-11T16:12:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003ESome people don\u0027t like it when I assume there are idiot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EFirst the only part available in 2.x is the pod and ar202. I forgot that there was more part in 1.x ^^\u003C/p\u003E\u003Cp\u003EThe current version of mechjeb use the tree to unlock the case and then unlock some function. The case unlock at the \u0022flightControl\u0022 node and then other function unlock at advFlightControl, fieldScience, unmannedTech and advUnmanned (Those are the node internal name but you should match them easily with the displayed name). So the menu won\u0027t show all its options until you have all those node.\u003C/p\u003E\u003Cp\u003EIf you use the \u0022Interstellar\u0022 tree from treeloader those node should be present and the function should unlock since it\u0027s not that different from the stock tree.\u003C/p\u003E\u003Cp\u003EI understand you unlocked a lot already but did you unlock those ? Or maybe you did not check the AR case since earlier in the tree ?\u003C/p\u003E\u003Cp\u003EGalane : I\u0027ll take a look at your newer creation. If I replace the monoprop and 1 parachute by 4 parachute it should crash ?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI unlocked the AR202 case, yes, but when I try to use it it\u0027s the \u0022Attitude control\u0022 variant, not the full up autopilot one. I CAN make a usable craft with the pod, but it\u0027s clunky as hell and I hate having to put it on the top of my craft where the (Manned) pod should go....\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-12-11T16:22:18Z","Content":"\n\u003Cp\u003EOk, something is strange.\u003C/p\u003E\u003Cp\u003EFor now : Edit your GameData/Mechjeb2/Parts/MechJeb2_AR202/part.cfg and replace this part :\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = MechJebCore\u003Cbr\u003E        MechJebLocalSettings {\u003Cbr\u003E            MechJebModuleCustomWindowEditor { unlockTechs = flightControl }\u003Cbr\u003E            MechJebModuleSmartASS { unlockTechs = flightControl }\u003Cbr\u003E            MechJebModuleManeuverPlanner { unlockTechs = advFlightControl }\u003Cbr\u003E            MechJebModuleNodeEditor { unlockTechs = advFlightControl }\u003Cbr\u003E            MechJebModuleTranslatron { unlockTechs = advFlightControl }\u003Cbr\u003E            MechJebModuleWarpHelper { unlockTechs = advFlightControl }\u003Cbr\u003E            MechJebModuleAttitudeAdjustment { unlockTechs = advFlightControl }\u003Cbr\u003E            MechJebModuleThrustWindow { unlockTechs = advFlightControl }\u003Cbr\u003E            MechJebModuleRCSBalancerWindow { unlockTechs = advFlightControl }\u003Cbr\u003E            MechJebModuleRoverWindow { unlockTechs = fieldScience }\u003Cbr\u003E            MechJebModuleAscentGuidance { unlockTechs = unmannedTech }\u003Cbr\u003E            MechJebModuleLandingGuidance { unlockTechs = unmannedTech }\u003Cbr\u003E            MechJebModuleSpaceplaneGuidance { unlockTechs = unmannedTech }\u003Cbr\u003E            MechJebModuleDockingGuidance { unlockTechs = advUnmanned }\u003Cbr\u003E            MechJebModuleRendezvousAutopilotWindow { unlockTechs = advUnmanned }\u003Cbr\u003E            MechJebModuleRendezvousGuidance { unlockTechs = advUnmanned }\u003Cbr\u003E        }\u003Cbr\u003E    }\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eby \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = MechJebCore        \u003Cbr\u003E    }\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis will change you AR202 to have all the module unlocked whatever your progression in the tech tree. \u003C/p\u003E\u003Cp\u003EThen could you send me you /save/\u0026lt;nameofSaveGame\u0026gt;/tree.cfg and /save/\u0026lt;nameofSaveGame\u0026gt;/persistent.sfs (not sure of the name) so I can try to understand you bug.\u003C/p\u003E\u003Cp\u003EUse dropbox or pastebin. Thanks\u003C/p\u003E\n"},{"CreatedByName":"Lazurkri","CreatedById":16624,"CreatedDateTime":"2013-12-11T19:36:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E-Snip-\u003C/p\u003E\u003Cp\u003EThen could you send me you /save/\u0026lt;nameofSaveGame\u0026gt;/tree.cfg and /save/\u0026lt;nameofSaveGame\u0026gt;/persistent.sfs (not sure of the name) so I can try to understand you bug.\u003C/p\u003E\u003Cp\u003EUse dropbox or pastebin. Thanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, got it posted.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pastebin.com/3iUmN12H\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/3iUmN12H\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pastebin.com/Ch3GJLFt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/Ch3GJLFt\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHaven\u0027t had time to test out the fix, but when I have the chance I\u0027ll try it out.\u003C/p\u003E\n"},{"CreatedByName":"Briarknit","CreatedById":1424,"CreatedDateTime":"2013-12-11T20:43:48Z","Content":"\n\u003Cp\u003EAm I doing something wrong here? I installed mechjeb and all the plugins, but I only have Custom Window Editor and Settings. What am I missing here? How do I get access the ascent autopilot, landing autopilot, docking autopilot, etc?\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-12-11T20:55:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EGalane : I\u0027ll take a look at your newer creation. If I replace the monoprop and 1 parachute by 4 parachute it should crash ?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027ll land hard enough to break one or more of the landing legs. I put the radial chutes on top of the four side mounted tanks. The last time I tried it with four chutes I had a quantum core on the end of the arm (where the mono tank is) and used the larger clampotrons instead of the juniors. Dunno if weight is enough different to have an effect.\u003C/p\u003E\u003Cp\u003EWhat I posted on pastebin will land without breakage but it gets very unstable. Try it without using the parachute to see how bad it can get. Leave on just the two middle engines, connect the side tanks to them with fuel pipes and it\u0027s a perfectly stable Mun lander, even without RCS.\u003C/p\u003E\n"},{"CreatedByName":"Gaius","CreatedById":66495,"CreatedDateTime":"2013-12-11T21:06:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EEdit bis : and added a new \u0022Resonant Orbit\u0022 option in the Manoeuver Planner. It puts you in a new orbit having an orbital period equal to fraction of your original orbit. So you can launch a ship with 3 satellites attached, go to a synchronous orbit and ask MJ to put you in a 2/3 resonant orbit. Then if you launch a sat each time you are at the AP they\u0027ll be at a 120Ã‚Â° angle from each other.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is all kinds of awesome, thanks!\u003C/p\u003E\n"},{"CreatedByName":"AstroRick","CreatedById":78064,"CreatedDateTime":"2013-12-11T23:19:47Z","Content":"\n\u003Cp\u003EOddness - I have four inertial stabilizers and mechjeb 2 on a ship comprised of 7 orange tanks (one orange surrounded by 6 outer), all interconnected with fuel lines. This group of tanks is powered by 7 nerva engines. I use this setup to push probes and landers to all parts of the Kerbol system.\u003C/p\u003E\u003Cp\u003ESometimes, even when mechjeb is in control and the engines are gimbling and thusting away the roll pitch and yaw indicators will start to creep to the extremes, and then finally the ship tumbles wildly out of control. Turning off the engines and turning SAS -on- sometimes helps, and other time the gyrations will continue until the ship tears itself apart!\u003C/p\u003E\u003Cp\u003EThree smaller inertial stabilizers are at the top of the orange tanks, distributed in a triangle pattern on three thanks, with a tank spaced between and a docking port on the central tank. A forth, large stabilazer is mounted on the end of the central core just above the engines. The ship, sans attached probe or lander, weighs about 260 tons.\u003C/p\u003E\u003Cp\u003EHas anyone else experienced this oddness?\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-12-11T23:21:49Z","Content":"\n\u003Cp\u003EGalane \u0026amp; Lazurkri : I\u0027ll look at your problem later. Less free time than anticipated.\u003C/p\u003E\u003Cp\u003EBriarknit : you\u0027ll have to read my post on the previous page.\u003C/p\u003E\u003Cp\u003EGaius : nice to have some feedback on that one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAstroRick can I get a picture of the ship ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-11T23:25:15Z\u0022 title=\u002212/11/2013 11:25  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 11, 2013\u003C/time\u003E by sarbian\u003C/strong\u003E\n\u003C/span\u003E\n"}]}