{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":417,"Articles":[{"CreatedByName":"mcdjfp","CreatedById":142713,"CreatedDateTime":"2015-05-25T17:41:45Z","Content":"\n\u003Cp\u003EWith the Dev version 466 it is not reporting the dV of R.A.P.I.E.R engines properly. Started in air breathing mode and switched over once the air got too thin. After leaving atmosphere MechJeb claimed 37 dV left. It completed the 550\u002BdV circularization and still had enough in the tanks to deorbit as well. All the while reporting 0 dV left. This was a SSTO space plane.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-05-25T18:48:59Z","Content":"\n\u003Cp\u003EQuick question here. I\u0027ve noticed that deploying airbrakes throws MJ\u0027s landing estimation way off (the calculation that shows impact point, not the AP). Any chance this could be addressed?\u003C/p\u003E\n"},{"CreatedByName":"EtsijÃƒÂ¤","CreatedById":145007,"CreatedDateTime":"2015-05-26T19:55:29Z","Content":"\n\u003Cp\u003EHi all. #466 in use. Did the launch, trying to get into a circularized orbit. Autostaging works, manouver node planning creates a burn for the circularisation job. Mechjeb warps into the node - and nothing happens. It does not orient the spacecraft at all, nor does it do the actual burn.\u003C/p\u003E\u003Cp\u003EWhat\u0027s up? Anyone else seeing the same problem?\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-05-26T23:37:12Z","Content":"\n\u003Cp\u003EYeah, about 1 in 3 poster for the last 200 posts.\u003C/p\u003E\n"},{"CreatedByName":"Phil deCube","CreatedById":120897,"CreatedDateTime":"2015-05-27T07:11:37Z","Content":"\n\u003Cp\u003EYeah, Manoeuvre Planner Stopped working for me last night. Working one minute. not the next. Still Not working tonight. Bizarre. The Landing Guidance just put me down on Minmus while I typed this, so that is still good.\u003C/p\u003E\u003Cp\u003EEdit: Yikes! Landed ok, but after a quicksave and a restore I lost the whole moon of Minmus. My base, with the ship I was having problems with attached to it via KAS/KIS, was just floating on its own, alone in the cosmos. No Minmus. \u003Ca href=\u0022http://www.hostpic.org/images/1505271312430108.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.hostpic.org/images/1505271312430108.jpg\u003C/a\u003E I had to go back to a save from last night, before I landed and connected the ship to the base. Are these issues connected? I don\u0027t know.\u003C/p\u003E\u003Cp\u003ESarbian, I **love** Mechjeb. It is the greatest mod in the KSP Moderverse. KSP would be a very tedious game without it. Thanks for all your hard work on it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T08:08:16Z\u0022 title=\u002205/27/2015 08:08  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Phil deCube\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ecat","CreatedById":68747,"CreatedDateTime":"2015-05-27T07:51:52Z","Content":"\n\u003Cp\u003EMany thanks for all your hard work sarbian \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn control issues: The only problem I\u0027ve noticed was about a week ago, I had a nose cone attached to the top of my vessel via one of those small red and white decouplers - arrow pointing up towards the cone. Ascent guidance created the node for final orbital burn but when it came time to start the engines, nothing happened. If I disabled the engines the throttle jumped to 100% but re-enabling them the throttle jumped back to zero. \u003C/p\u003E\u003Cp\u003EThe problem? \u003C/p\u003E\u003Cp\u003EIt was related to the decoupler. I had decoupled the nose cone during ascent, the decoupler with arrows up had fired off the cone but whatever was left of it, the inert ring, remained attached and its image remained in the staging list as part of the current stage. Once I created a new dummy stage 0 and move the ghost of the decoupler into it the MechJeb burn executed without a hitch.\u003C/p\u003E\u003Cp\u003EAs a further test I recreated the flight but this time the cone decoupler was placed with the arrow pointing down so it would fly off attached to the nose cone. This flight had no issues.\u003C/p\u003E\u003Cp\u003EMaybe this is a known problem, maybe it has been fixed, but given the number of \u0027no control\u0027 posts I thought it worth mentioning \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2015-05-27T08:20:15Z","Content":"\n\u003Cp\u003EStrange glitch last night landing on Minmus. The landing legs extended up but failed to hinge out and down and the lander set down on its engine nozzles. Poking the gear button a couple of times got the legs down. Most likely a KSP glitch. Never seen it before.\u003C/p\u003E\n"},{"CreatedByName":"EtsijÃƒÂ¤","CreatedById":145007,"CreatedDateTime":"2015-05-27T08:50:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EYeah, about 1 in 3 poster for the last 200 posts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell I didn\u0027t check all 200 latest posts, but I did flip through the last three pages. I guess this issue escaped from my eyes. So it is a known bug? I am not using any other mods, just MJ, so the issue is certainly not a conflict with other mods.\u003C/p\u003E\u003Cp\u003EAlso some seem to say node execution was fixed some builds ago...but obviously it is broken (again?) in #466.\u003C/p\u003E\u003Cp\u003EI hope this will get fixed soon. MJ is awesome and really makes playing KSP worthwhile.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T09:03:44Z\u0022 title=\u002205/27/2015 09:03  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by EtsijÃƒÂ¤\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Newbinator","CreatedById":83130,"CreatedDateTime":"2015-05-27T09:24:05Z","Content":"\n\u003Cp\u003EI seem to only have an issue with the landing guidance function. Firstly it creates the calculations and then adjusts flight path for landing, no problems there. It then sort of goes haywire by the landing marker bouncing around all over, the mechjeb doing heaps of adjustments, it goes weird. Then when it finally sorts itself out, it then changes the orbit rotation and height, sort of punches right out into Kerbol system.\u003C/p\u003E\u003Cp\u003EAll other functions seem to work right\u003C/p\u003E\u003Cp\u003ESo in summary, I think the landing guidance is broken but others seem to think its working. Also I am using the latest 25/05/15 build.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-05-27T09:28:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ecat\u0022 data-cite=\u0022ecat\u0022\u003E\u003Cdiv\u003EMaybe this is a known problem, maybe it has been fixed, but given the number of \u0027no control\u0027 posts I thought it worth mentioning \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, most of the reported problems comes from the state of the dV stats. I pulled an unfinished KER code and it create some problems. But if I revert to an older version it will create others.\u003C/p\u003E\u003Cp\u003EPadishar worked a bit more on that code so the next dev version may fix most if not all those bugs. I can find of the easy bug in there but those that involve the fuel plumbing require to know that system much more than I do.\u003C/p\u003E\u003Cp\u003EI would really like for that to work because seeing the thread move that fast with most of the post about the same issue is not fun at all. And I want to work on other things\u003C/p\u003E\u003Cp\u003EIn the mean time I can only give the usual advice : install the last \u003Ca href=\u0022http://jenkins.mumech.com/job/MechJeb2/\u0022 rel=\u0022external nofollow\u0022\u003Edev release\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ArkaelDren","CreatedById":57992,"CreatedDateTime":"2015-05-27T09:40:03Z","Content":"\n\u003Cp\u003EI know you get told thx for all your hard work, but after reading the above post i could feel your frustration. Sorry bud, most of us would be glad to help you if we knew how to program, but I\u0027m gonna say thx even though it doesn\u0027t help much\u003C/p\u003E\u003Cp\u003EThanks for all your hard work, with out it, some of us wouldn\u0027t even be playing.\u003C/p\u003E\n"},{"CreatedByName":"jtaylor996","CreatedById":82966,"CreatedDateTime":"2015-05-27T14:32:55Z","Content":"\n\u003Cp\u003EAre there any features planned for dealing with asteroids?\u003C/p\u003E\u003Cp\u003EHere are some issues, either with the way MJ currently acts, or with things that could really use some MJ assists on:\u003C/p\u003E\u003Cp\u003E1. You can \u0022target center of mass\u0022 on the asteroid, but then MJ thinks no target is selected. This makes it super hard to align the thrust vector with the center of mass. A work around is that if you go to the ADV part of SmartASS, and then select target, forward, it seems to kinda maybe work, but I can\u0027t quite verify this.\u003C/p\u003E\u003Cp\u003E2. Auto alignment of the locking arm to the center of mass would be super awesome. This would: \u003C/p\u003E\u003Cp\u003E a. free swivel the coupler \u003C/p\u003E\u003Cp\u003E b. align the CoT with the center of mass (to like .001 degree if possible) \u003C/p\u003E\u003Cp\u003E c. lock the coupler\u003C/p\u003E\u003Cp\u003E3. Maybe use the thrust vector corrections along with the coupler to keep it centered around the center of mass during a burn. This would be like #2, but I think could use all of the same calculations that are used for ascent guidance. \u003C/p\u003E\u003Cp\u003E4. RCS balancer doesn\u0027t seem to work well with asteroids. You would use the outboard ports for alignment CoT to CoM, then use the inboard ones (by the nose of the ship) to rotate the the asteroid/ship assembly.\u003C/p\u003E\u003Cp\u003E5. Something like docking guidance would be cool for getting the coupler attached to the asteroid. In fact, using docking guidance for this might be possible, but since MJ doesn\u0027t recognize asteroid CoM as a target it won\u0027t run.\u003C/p\u003E\u003Cp\u003EAny other ideas? \u003C/p\u003E\u003Cp\u003EAre there currently any other tools out there that handle any of this?\u003C/p\u003E\u003Cp\u003EEdit: Just in case some of this was already done, I\u0027m running dev build 455 right now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T14:41:48Z\u0022 title=\u002205/27/2015 02:41  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by jtaylor996\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-05-27T14:45:32Z","Content":"\n\u003Cp\u003Euh, the asteroid targeting and aligning with the CoM was patched \u003Ca href=\u0022https://github.com/MuMech/MechJeb2/pull/358\u0022 rel=\u0022external nofollow\u0022\u003E1 year ago\u003C/a\u003E. \u003C/p\u003E\u003Cp\u003EI guess something broke... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nemesis666first","CreatedById":145065,"CreatedDateTime":"2015-05-27T15:57:56Z","Content":"\n\u003Cp\u003E@OP : I dont like mod who add parts very well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E , can you make an other version who dont add parts plz \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E !\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-05-27T16:36:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nemesis666first\u0022 data-cite=\u0022nemesis666first\u0022\u003E\u003Cdiv\u003E@OP : I dont like mod who add parts very well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E , can you make an other version who dont add parts plz \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E !\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere IS an MM config that bypasses the part so that you don\u0027t need to use it, but uh, maybe I\u0027ll just let you find it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jtaylor996\u0022 data-cite=\u0022jtaylor996\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEdit: Just in case some of this was already done, I\u0027m running dev build 455 right now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee if it works with 466? Unless that\u0027s a typo and you did mean 466 and not 455.\u003C/p\u003E\u003Cp\u003EEdit: Really minor bug, if you have unretractable panels on your ship and you deactivate and then reactivate ascent AP while above atmosphere, it gets stuck on the retracting panels phase. I wanted to reset the AP since I had a stage which was almost out of fuel and the next stage has quite a bit lower ISP. I simply used the maneuver planner instead.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oYfznQy.png\u0022 alt=\u0022oYfznQy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESteps for better explaination:\u003C/p\u003E\u003Cp\u003E1. Create a ship with retractable and unretractable panels.\u003C/p\u003E\u003Cp\u003E2. Launch like normal.\u003C/p\u003E\u003Cp\u003E3. When above the atmosphere but haven\u0027t circularized yet, deactivate the AP\u003C/p\u003E\u003Cp\u003E4. Remove the maneuver node (probably optional, but that\u0027s what I had done) and reactivate the AP.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T17:53:52Z\u0022 title=\u002205/27/2015 05:53  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by smjjames\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoskoNikov","CreatedById":145097,"CreatedDateTime":"2015-05-27T22:21:40Z","Content":"\n\u003Cp\u003EI\u0027ve been searching for an answer to the following and so far no success... hopefully I just missed something obvious.\u003C/p\u003E\u003Cp\u003ESometimes - though more often than not - Mechjeb sort of stops functioning. Won\u0027t auto warp or execute nodes at all. It will turn and point in the right direction of the nodes and even sets them, for rendezvous as an example. But, it won\u0027t fire the engines or auto warp at all. \u003C/p\u003E\u003Cp\u003EI have checked power/fuel/enough reaction wheels pr RCS to turn the ship etc. nothing.\u003C/p\u003E\u003Cp\u003EStrangely, it seems to work on some vessels just fine and occasionally starts working again on vessels that it didn\u0027t for a while. \u003C/p\u003E\u003Cp\u003ENot very technical and I do use a few mods, so if info provided is not enough, just let me know. \u003C/p\u003E\u003Cp\u003EThanks in advance.\u003C/p\u003E\n"},{"CreatedByName":"RoskoNikov","CreatedById":145097,"CreatedDateTime":"2015-05-27T22:44:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022slaintemaith\u0022 data-cite=\u0022slaintemaith\u0022\u003E\u003Cdiv\u003EMight have the node bug reproduced. I doubt this will help you, since it\u0027s essentially the same one I wrote up yesterday, but here we go:\u003Cp\u003EMJ Version: 2.5.1.0-462\u003C/p\u003E\u003Cp\u003EKerbal Version: 1.0.2.842\u003C/p\u003E\u003Cp\u003EClean Install, Mechjeb is the only mod installed.\u003C/p\u003E\u003Cp\u003ESteps to reproduce:\u003C/p\u003E\u003Cp\u003E1) Extract \u0022To Save Folder.zip\u0022 in your save game folder.\u003C/p\u003E\u003Cp\u003E2) Open KSP\u003C/p\u003E\u003Cp\u003E3) Select \u0022Start Game\u0022\u003C/p\u003E\u003Cp\u003E4) Select \u0022Resume Saved\u0022\u003C/p\u003E\u003Cp\u003E5) Select \u0022To Save Folder\u0022 and Continue\u003C/p\u003E\u003Cp\u003E6) Press \u0022Esc\u0022 at the KSC screen\u003C/p\u003E\u003Cp\u003E7) Select \u0022Load Save...\u0022\u003C/p\u003E\u003Cp\u003E8) Select \u0022quicksave\u0022 and Select.\u003C/p\u003E\u003Cp\u003E9) From the open Manuever Planner, select \u0022Fine Tune Closest Approach With Target\u003C/p\u003E\u003Cp\u003E10) Select \u0022Remove All Nodes\u0022\u003C/p\u003E\u003Cp\u003E11) Select \u0022Create and Execute\u0022\u003C/p\u003E\u003Cp\u003E(Further Steps, although the fault is here)\u003C/p\u003E\u003Cp\u003E12) Warp until \u0022Node in T-\u0022 reaches a period you\u0027re comfortable waiting out.\u003C/p\u003E\u003Cp\u003E13) Wait that time.\u003C/p\u003E\u003Cp\u003ENoted Result:\u003C/p\u003E\u003Cp\u003EAlthough the burn node is created, time is not accelerated to the node time, and if the node time is waited out, the burn still does not occur. Est. Burn shows N/A even though delta-V information is displayed in the nav ball.\u003C/p\u003E\u003Cp\u003EExpected Result: \u003C/p\u003E\u003Cp\u003ETime should automatically accelerate to the node time, Est. Burn should display properly, and the burn should occur automatically.\u003C/p\u003E\u003Cp\u003ENotes:\u003C/p\u003E\u003Cp\u003E***Important*** (maybe): This only seems to happen with -unkerballed- craft. When you have kerbals flying, everything seems to work just fine.\u003C/p\u003E\u003Cp\u003EThere only appears to be one MJ2.AR202 unit on the current craft.\u003C/p\u003E\u003Cp\u003EOutput_Log: \u003Ca href=\u0022https://www.dropbox.com/s/ewoioshmtjemkqi/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ewoioshmtjemkqi/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESave Folder: \u003Ca href=\u0022https://www.dropbox.com/s/vildk2c14q6irgz/To%20Save%20Folder.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/vildk2c14q6irgz/To%20Save%20Folder.zip?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EScreenshot1: \u003Ca href=\u0022https://www.dropbox.com/s/bb1yxbl7hopiyhs/screenshot1.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/bb1yxbl7hopiyhs/screenshot1.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EScreenshot2: \u003Ca href=\u0022https://www.dropbox.com/s/5pamc9bwcl2t7vo/screenshot2.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/5pamc9bwcl2t7vo/screenshot2.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks for your time!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoesn\u0027t seem to be any answers to this... I\u0027m having this issue too but can\u0027t get any info.\u003C/p\u003E\n"},{"CreatedByName":"Monthar","CreatedById":117764,"CreatedDateTime":"2015-05-27T23:40:04Z","Content":"\n\u003Cp\u003EI had the same thing happen with a new ship I launched today. However, ships I launched yesterday have their MJ working just fine. I didn\u0027t add or update any mods before the problem started. I tried removing mods, but that didn\u0027t fix the problem. I even removed and reinstalled MJ mod, but the problem persists. \u003C/p\u003E\u003Cp\u003EI don\u0027t know if this is related to the problem, but I also noticed some orbit and biome info text in the lower right corner of the screen, right were we get the quicksave notification text. This text appears no matter which ship I\u0027m flying even if I don\u0027t have the MJ part installed on that ship.\u003C/p\u003E\u003Cp\u003EHere\u0027s a screenshot showing the weird text. \u003Ca href=\u0022https://www.dropbox.com/s/6agrnnmc1h9n4yo/KSP%20Wierd%20Text.jpg?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/6agrnnmc1h9n4yo/KSP%20Wierd%20Text.jpg?dl=0\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T23:44:08Z\u0022 title=\u002205/27/2015 11:44  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Monthar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-05-27T23:47:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Monthar\u0022 data-cite=\u0022Monthar\u0022\u003E\u003Cdiv\u003EI had the same thing happen with a new ship I launched today. However, ships I launched yesterday have their MJ working just fine. I didn\u0027t add or update any mods before the problem started. I tried removing mods, but that didn\u0027t fix the problem. I even removed and reinstalled MJ mod, but the problem persists. \u003Cp\u003EI don\u0027t know if this is related to the problem, but I also noticed some orbit and biome info text in the lower right corner of the screen, right were we get the quicksave notification text. This text appears no matter which ship I\u0027m flying even if I don\u0027t have the MJ part installed on that ship.\u003C/p\u003E\u003Cp\u003EHere\u0027s a screenshot showing the weird text. \u003Ca href=\u0022https://www.dropbox.com/s/6agrnnmc1h9n4yo/KSP%20Wierd%20Text.jpg?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/6agrnnmc1h9n4yo/KSP%20Wierd%20Text.jpg?dl=0\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat other mods do you have? MJ doesn\u0027t generate text over there AFAIK.\u003C/p\u003E\n"},{"CreatedByName":"autumnalequinox","CreatedById":114782,"CreatedDateTime":"2015-05-28T00:11:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smjjames\u0022 data-cite=\u0022smjjames\u0022\u003E\u003Cdiv\u003EWhat other mods do you have? MJ doesn\u0027t generate text over there AFAIK.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d swear this no-manuever node problem sounds like antenna range mod with a probe out of range. I haven\u0027t gotten to use one yet but still.. any problem with just lining up and doing the burn manually? Or is it impossible?\u003C/p\u003E\u003Cp\u003ELove Mechjeb..let me just say that. I play the game more from a mission management/engineering/admin side and while I made sure to try everything manual I do a great many things and love having an autopilot handle the mundane. Plus I work many hours in the real world and my games would grind to a halt if I had to work everything out through trial and error. So sabian: Thank you so much!. Don\u0027t let others make this feel like a job. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh and to everyone with flipping rockets, etc. It\u0027s all about power. I played with this problem for a bit and realized I was simply using engines with too much thrust. I scaled down to smaller engines and got perfect ascents every time. Play with thrust % and terminal setting and other stuff. It\u0027s an autopilot, not an A.I. Don\u0027t forget that are bazillions of incidents in the history of spaceflight with autopilot failures and work-arounds. I consider it part of the fun, honestly.. it\u0027s realism. Quirky realism. Think of Mechjeb as the DISKY but you still need a pilot to punch in programs and occasional workarounds.\u003C/p\u003E\n"},{"CreatedByName":"Monthar","CreatedById":117764,"CreatedDateTime":"2015-05-28T00:23:09Z","Content":"\n\u003Cp\u003EThe other mods I\u0027m running are Toolbar, Active Texture Management, Contract Filter, Kerbal Alarm Clock, KAS/KIS, Kerbal Engineer, Kerbal Joint Reinforcement, Mission Controller EC, Docking Port Alignment Indicator, Science Alert, Serious Kerbal Business, Stage Recovery, Stock Bug Fixes and Temperature Gauge Killer.\u003C/p\u003E\u003Cp\u003EThat text didn\u0027t show up until today. If it\u0027s not related to this bug that\u0027s fine. I wasn\u0027t sure since both this text and the bug with MJ started today.\u003C/p\u003E\u003Cp\u003EI was using MJ 2.5.1.0 when the bug started. I removed this install and reinstalled the 2.5.0.0-460 dev build. This solved the problem with execute next node on the ship that it stopped working on. I suspect the bug is something that changed between the 460 dev build and the current release build. The reason I went back to the 460 build is it was the most recent dev build I had downloaded prior to the latest release build.\u003C/p\u003E\u003Cp\u003E@\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/117948-autumnalequinox\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E autumnalequinox\u003C/strong\u003E\u003C/a\u003E I\u0027ve never used the antenna range mod and this bug happened on a manned ship that was just carrying 5 tourists and rescuing 3 crew. It was a very basic manned rocket.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-28T00:27:32Z\u0022 title=\u002205/28/2015 12:27  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 28, 2015\u003C/time\u003E by Monthar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoskoNikov","CreatedById":145097,"CreatedDateTime":"2015-05-28T00:23:31Z","Content":"\n\u003Cp\u003EWell i don\u0027t have any antennae mods... and MJ works in other vessels etc. It seems sporadic and not very clear when it works and when it doesn\u0027t. I am having 100% failure during a launch lately. It starts out fine, gets to \u0027coasting to edge of atmos\u0027 then turns for circularize burn and then nothing... auto warp does not kick in again and the ship sails past the node and just crashes to the ground without ever burning.\u003C/p\u003E\u003Cp\u003EI can, and do turn off the AP and burn manually to get into orbit... fine. But that sort of not the point... I \u0027can\u0027 launch to orbit and rendezvous and all that manually, but like MJ to skip the routine bits. \u003C/p\u003E\u003Cp\u003EI just updated every mod I have with a freshly downloaded version even if it wasn\u0027t needed... they were all up to date. And still same issue.\u003C/p\u003E\u003Cp\u003Eone last thing - occasionally, the mechjeb unit will explode on the launch pad as soon as physics kicks in... very strange to see... not always, so hard to say why. But it used to be funny... not any more \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-05-28T00:40:13Z","Content":"\n\u003Cp\u003ETry 466? It\u0027s the most current dev build.\u003C/p\u003E\n"},{"CreatedByName":"autumnalequinox","CreatedById":114782,"CreatedDateTime":"2015-05-28T01:34:45Z","Content":"\n\u003Cp\u003EI use 466 and run the following.. get ready for this: Toolbar, USITtools, atmospheric effects (just clouds), corvus, cryoengines, dangit, dmagic orbital sci, field exp, KAS, KCT, KIS, KW rocketry, infernal robo, mission controller, near future con \u002B solar \u002B spacecraft, final fronteir, realchute, scansat, stage recovery, temp guage killer, TAC-LS, tweakscale (only for future tech stuff), most of the USI catalog, and KSP interstellar extended..phew.\u003C/p\u003E\u003Cp\u003ESo far 466 has worked fine, caught all my nodes and everything. No unmanned yet, I\u0027ll let everyone know.\u003C/p\u003E\u003Cp\u003EOh yea haha and antenna range.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-28T02:10:22Z\u0022 title=\u002205/28/2015 02:10  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 28, 2015\u003C/time\u003E by autumnalequinox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"autumnalequinox","CreatedById":114782,"CreatedDateTime":"2015-05-28T02:11:40Z","Content":"\n\u003Cp\u003ENo problem with probes and 466. Node came and probe did it\u0027s thing. Only problem was some heating at the boundry layer of atmo during ascent which lasted about 2 seconds and did no damage.\u003C/p\u003E\n"}]}