{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":34,"Articles":[{"CreatedByName":"BloodyRain2k","CreatedById":50835,"CreatedDateTime":"2012-10-03T01:46:05Z","Content":"\n\u003Cp\u003EWhile trying to get some things to Duna I noticed that MechJeb tries to correct the course mid-way way too soon, it kept swinging back and forth (was a rather heavy lump) and maybe, just maybe, pulsed the engines once. After like 5 min of 4x I gave up and tried my luck myself.\u003C/p\u003E\u003Cp\u003EUsing SASS I got it done faster than it, though probably not as fuel efficient but then again, done in a few min is probably better than trying for a day.\u003C/p\u003E\u003Cp\u003EBut the slow response of that lump wasn\u0027t the problem, when I tried it with a lightweight satellite it had the same problem for some reason.\u003C/p\u003E\u003Cp\u003EMaybe it should aim for multiple corrections to get closer than just that one that seems to start way too soon. \u0022Way too soon\u0022 here being 2 / 3 from Kerbin to Duna.\u003C/p\u003E\u003Cp\u003EOr just try to turn more carefully when the ship\u0027s heavy but I guess the question is how to define \u0022heavy\u0022...\u003C/p\u003E\u003Cp\u003EIt would also for these cases be nice if it could continue an encounter attempt if you have manually fixed something like the above but don\u0027t really know where to aim now (or not have the fuel to do guessing).\u003C/p\u003E\u003Cp\u003EAnother thing I was wondering, does Autom8 have file writing access? Cause if I could maybe write a logger for the Kethane Scanner so I won\u0027t have to measure out a pocket\u0027s position from the ever again resetting map data : /\u003C/p\u003E\u003Cp\u003EWell that is if it also could access that scanner which I bet it can\u0027t (yet?)\u003C/p\u003E\u003Cp\u003EI also found out my other idea from the other day works, abusing Smart A.S.S.\u0027s Retrograde and Translatrons Keep Vert as landing assistant. Thought the results can be unexpected.\u003C/p\u003E\u003Cp\u003EI just had to turn off Kill H/S : / didn\u0027t know that when I suggested this as new feature while it was already there XD\u003C/p\u003E\u003Cp\u003EAnyways, MechJeb\u0027s great and I\u0027m really glad it was made, I\u0027m just too lazy (and most times not even able) to fly the pieces of junk I\u0027m building so it\u0027s a great help for that ^^\u003C/p\u003E\u003Cp\u003EOne thing I hope that could be added (I know you could Autom8 that probably, but I couldn\u0027t calculate that for my life) is using a rather direct encounting way instead of the fuel efficient one.\u003C/p\u003E\u003Cp\u003EThough there\u0027s only one case where you can really afford this and that\u0027s with the rare solar powered things.\u003C/p\u003E\u003Cp\u003EI already had more than enough problems packing all the fuel into the lump to even get to Duna.\u003C/p\u003E\n"},{"CreatedByName":"sneezedr424","CreatedById":33670,"CreatedDateTime":"2012-10-03T02:07:11Z","Content":"\n\u003Cp\u003EFirstly: I thought that MechJeb couldnt transfer to planets because the velocities and altitudes of said planets constantly change.\u003C/p\u003E\u003Cp\u003ESecondly: MechJeb has issues with landing on other planets. It brakes way too late. How can I fix this, because every time I\u0027ve tried to land on Duna, I put in coords, and always come in too fast.\u003C/p\u003E\n"},{"CreatedByName":"Zaekon","CreatedById":53268,"CreatedDateTime":"2012-10-03T05:07:38Z","Content":"\n\u003Cp\u003EYou should add a button that allows you auto pilot to other planets/moons and land on them ( if there is already one, I haven\u0027t tested every button).\u003C/p\u003E\n"},{"CreatedByName":"Raven Coldheart","CreatedById":38015,"CreatedDateTime":"2012-10-03T10:38:36Z","Content":"\n\u003Cp\u003E1.: I am sure, this was already mentioned, but would it be possible to include an after-aerobraking apoapsis in the orbital informations? The Landing operation only displayes this if engaged to land. I personally use aerobraking maneuvers to adjust the apoapsis of my satelites getting an exact orbit out of it is impossible.\u003C/p\u003E\u003Cp\u003E2.: Is it possible to start transfer to Duna, Eve and so forth inside of Kerbin SOI? Currently I\u0027m more relying on luck, than on actual facts, regarding the initial burn out of Kerbin SOI.\u003C/p\u003E\u003Cp\u003EGreets Raven\u003C/p\u003E\n"},{"CreatedByName":"sneezedr424","CreatedById":33670,"CreatedDateTime":"2012-10-03T11:54:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Raven Coldheart\u0022 data-cite=\u0022Raven Coldheart\u0022\u003E\u003Cdiv\u003E Is it possible to start transfer to Duna, Eve and so forth inside of Kerbin SOI? Currently I\u0027m more relying on luck, than on actual facts, regarding the initial burn out of Kerbin SOI.\u003Cp\u003EGreets Raven\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. Use ksp.olex.biz to find your phase angle ejection angle, and ejection velocity needed, and you will be able to go straight from Kerbin directly to Duna, Jool, etc. without any pesky adjustments until you get there. It\u0027s one long burn.\u003C/p\u003E\n"},{"CreatedByName":"Raven Coldheart","CreatedById":38015,"CreatedDateTime":"2012-10-03T12:24:40Z","Content":"\n\u003Cp\u003E@sneezedr424: Thanks for the quick reply!\u003C/p\u003E\n"},{"CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2012-10-03T15:00:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sneezedr424\u0022 data-cite=\u0022sneezedr424\u0022\u003E\u003Cdiv\u003EYes. Use ksp.olex.biz to find your phase angle ejection angle, and ejection velocity needed, and you will be able to go straight from Kerbin directly to Duna, Jool, etc. without any pesky adjustments until you get there. It\u0027s one long burn.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUse what? and how do you calculate the burn times and angles?\u003C/p\u003E\n"},{"CreatedByName":"ModernArc","CreatedById":32152,"CreatedDateTime":"2012-10-03T19:00:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rodder37\u0022 data-cite=\u0022Rodder37\u0022\u003E\u003Cdiv\u003EYes. You just get into sun orbit and the options will be there (where Mun \u0026amp; Minmus were).\u003Cp\u003EI just get into orbit, then when I\u0027m on the dark side of Kerbin I go max throttle until my orbit gets past Minmus and then turns yellow indicatin sun orbit. I then warp until the yellow line turns blue. The planets will show up under the transfer button. Once transfered to the planet orbit, the moons for that planet will show up under the transfer button.\u003C/p\u003E\u003Cp\u003EThe transfer button will only show the things in the orbit the ship is in....when in Kerbin orbit it will show Mun and Minmus, when in sun orbit it will show all the planets, when in Duna orbit it will show Ike...etc.\u003C/p\u003E\u003Cp\u003EThe best way for me to get to the inner planets of Eve and Moho is to retro burn from sun orbit to an orbit between the Sun and the planet I want to go to.... it seems Mechjeb finds planets further out much easier than finding planets going closer to the sun from MechJeb\u0027s orbit......(I\u0027m not sure this sentence made sence, but I hope you know what I mean).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Yay, thanks man!!\u003C/p\u003E\n"},{"CreatedByName":"sneezedr424","CreatedById":33670,"CreatedDateTime":"2012-10-03T21:01:38Z","Content":"\n\u003Cp\u003Eif you go to that site, it has a calculator that will do all of the equations for you! AND it explains what everything is, nd how to find it. I put a protracter up to my screen, and all ofmy injections have worked out perfectly.\u003C/p\u003E\n"},{"CreatedByName":"Peewee","CreatedById":5338,"CreatedDateTime":"2012-10-04T07:47:07Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://ksp.olex.biz\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESilly nonstandard URLs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lead_poisoning","CreatedById":33556,"CreatedDateTime":"2012-10-04T17:45:29Z","Content":"\n\u003Cp\u003EI can\u0027t remember if I\u0027ve posted in this thread before, so brace for incoming mod praise. MechJeb completely changed the game for me in a wonderful way. I\u0027m not particularly talented at math and absolutely awful at manually piloting any kind of vehicles in KSP, but with MechJeb I\u0027ve visited every body in the solar system that I had any interest in at all. Excellent work, and please keep it up. \u003C/p\u003E\u003Cp\u003EOn another note the manual appears to be somewhat out of date. It hasn\u0027t been updated since May, and there have been several new features added since then.\u003C/p\u003E\n"},{"CreatedByName":"TG_bigboss","CreatedById":24189,"CreatedDateTime":"2012-10-04T18:47:36Z","Content":"\n\u003Cp\u003EI don\u0027t know if anyone has had this already but it seems Mechjeb is lagging when im close to orbit with duna. I turn it off and the frames go back to normal. Its weird. I never have had this issue before. It is random too and not always. I guess Mechjeb is spamming all the math equations causing issues maybe?\u003C/p\u003E\n"},{"CreatedByName":"jpkerman","CreatedById":14965,"CreatedDateTime":"2012-10-04T19:56:39Z","Content":"\n\u003Cp\u003E\u0022...I put a protracter up to my screen,...\u0022\u003C/p\u003E\u003Cp\u003E Squad clearly wants to prove that one does not have to be a big budget, software giant to make a commercially viable, top level game. Any add-on, user created mod that relies on a protractor being held up to a monitor cannot be considered a competent addition to the game. As this game evolves and flight operation difficulty increases, the automated \u0027flight computer\u0027 mod that has the best chance to help this product meet it\u0027s high aim will be the one that is all inclusive of beginners and space game grognards and provides all support on-screen and in-game.\u003C/p\u003E\n"},{"CreatedByName":"TheHistoricalMan","CreatedById":37114,"CreatedDateTime":"2012-10-04T21:36:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jpkerman\u0022 data-cite=\u0022jpkerman\u0022\u003E\u003Cdiv\u003E\u0022...I put a protracter up to my screen,...\u0022\u003Cp\u003E Squad clearly wants to prove that one does not have to be a big budget, software giant to make a commercially viable, top level game. Any add-on, user created mod that relies on a protractor being held up to a monitor cannot be considered a competent addition to the game. As this game evolves and flight operation difficulty increases, the automated \u0027flight computer\u0027 mod that has the best chance to help this product meet it\u0027s high aim will be the one that is all inclusive of beginners and space game grognards and provides all support on-screen and in-game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to agree with you. The notion that users must understand and master basic calculus and trigonometry in order to play the game properly and visit other planets is a ridiculous one.\u003C/p\u003E\n"},{"CreatedByName":"kk0425","CreatedById":50851,"CreatedDateTime":"2012-10-04T23:15:40Z","Content":"\n\u003Cp\u003EMaybe this is an opportunity to learn those skills? Not every game needs to be like call of duty.\u003C/p\u003E\n"},{"CreatedByName":"khyperia","CreatedById":25539,"CreatedDateTime":"2012-10-04T23:32:15Z","Content":"\n\u003Cp\u003EIs it at all possible to make a ComputerModule plugin (or similar) in MechJeb? Right now, I don\u0027t see a way you can.\u003C/p\u003E\u003Cp\u003ELooking at the source, it seems like you hardcoded nothing except the actual addition of the modules to the \u0022modules\u0022 list. This would make enabling plugins quite easy (plugin of a plugin, ha)... the only problem is if Squad decided to load each dll inside the plugins folder into a separate appdomain (1 appdomain per dll), but I don\u0027t think this is the case. I hope. (Basically, instead of hardcoding the creation, go into AppDomain.CurrentDomain, get all loaded assemblies and their types, get the ones that extend from ComputerModule, and create them.)\u003C/p\u003E\u003Cp\u003EIf you did this, the community would (hopefully) spam new modules, of which a few might be pretty good, which you could add to vanilla mechjeb. Basically, really good modules without any work. The framework you already have set up is wonderful, it would be much easier to make a plugin of mechjeb then a plugin of ksp. For example, my idea for a plugin that got me started on this plugin-for-a-plugin idea- A \u0022closest approach\u0022 module for a body on your flight path. I could simply use the current mechjeb target, stuff like that, re-using mechjeb\u0027s data instead of reinventing the wheel myself.\u003C/p\u003E\u003Cp\u003EIt would be very awesome if you did this, I would be forever grateful. Sorry for the long post, too. I kind of tend to write textwalls. (also, the first time posting this told me it failed, sorry if this doubleposts)\u003C/p\u003E\n"},{"CreatedByName":"Rodder37","CreatedById":32121,"CreatedDateTime":"2012-10-05T00:10:43Z","Content":"\n\u003Cp\u003EI love MechJeb. I figure if NASA can use computers, then I can use MechJeb. I love this thing! \u003C/p\u003E\u003Cp\u003EI am not a good pilot and MechJeb allows me to have fun. I play this game to relax and to explore. I think of ships to build and crazy missions to send the Kerbals to explore new planets and moons.\u003C/p\u003E\u003Cp\u003EIf MechJeb was not here, then I would not be here. Thank you r4m0n!!\u003C/p\u003E\n"},{"CreatedByName":"Lead_poisoning","CreatedById":33556,"CreatedDateTime":"2012-10-05T17:53:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022prozach\u0022 data-cite=\u0022prozach\u0022\u003E\u003Cdiv\u003Eautothrottle appears to be broken in 1.9.3\u003Cp\u003Eeven if I throttle up before engaging, mechjeb fails to circularize properly and I end up in a kerbin escape trajectory\u003C/p\u003E\u003Cp\u003EI haven\u0027t tested any of the orbital maneuver stuff to see if the throttle problem exists there.\u003C/p\u003E\u003Cp\u003EI am running the new remotetech, isa map, and protractor plugins and I haven\u0027t started eliminating conflicts to see if there is an issue.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve had the same problem. It is a compatibility issue with RemoteTech, not a glitch in MechJeb.\u003C/p\u003E\n"},{"CreatedByName":"DeltaBravo","CreatedById":9356,"CreatedDateTime":"2012-10-05T21:50:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheHistoricalMan\u0022 data-cite=\u0022TheHistoricalMan\u0022\u003E\u003Cdiv\u003EI have to agree with you. The notion that users must understand and master basic calculus and trigonometry in order to play the game properly and visit other planets is a ridiculous one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a flipping alpha, stop your bitching.\u003C/p\u003E\n"},{"CreatedByName":"Cepheus","CreatedById":10683,"CreatedDateTime":"2012-10-06T01:06:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheHistoricalMan\u0022 data-cite=\u0022TheHistoricalMan\u0022\u003E\u003Cdiv\u003EI have to agree with you. The notion that users must understand and master basic calculus and trigonometry in order to play the game properly and visit other planets is a ridiculous one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo be honest, I see this as a bonus, not a \u0022problem.\u0022 Imagine that, not too long ago, NASA was doing these very same calculations, except with a slide rule. Just imagine that. Stop complaining. It\u0027s just math.\u003C/p\u003E\n"},{"CreatedByName":"Festivefire","CreatedById":9808,"CreatedDateTime":"2012-10-06T01:36:28Z","Content":"\n\u003Cp\u003Ethey did this kind of math in the carcass of an exploded vessel on apollo 13, and told Houston that their orbital correction burn didn\u0027t cut it before Houston had finished the math. you can do it with a calculator if they can do it with a pencil and scrap paper.\u003C/p\u003E\n"},{"CreatedByName":"ilikemoneygreen","CreatedById":10776,"CreatedDateTime":"2012-10-06T09:45:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cepheus\u0022 data-cite=\u0022Cepheus\u0022\u003E\u003Cdiv\u003ETo be honest, I see this as a bonus, not a \u0022problem.\u0022 Imagine that, not too long ago, NASA was doing these very same calculations, except with a slide rule. Just imagine that. Stop complaining. It\u0027s just math.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo offense dude, but im not NASA. Lol, im not good at math either. NASA is the best of the best. They still use computers for calcs as well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E The difference is they can double check the math. And a slide rule is a tool, just because its an older one doesnt mean its worse then a calc. My father constantly goes on about how he is faster with a slide then he is with a calc....So saying that they were using them doesnt mean its huge challenge, its just a skill they used alot back then.\u003C/p\u003E\n"},{"CreatedByName":"8balls40","CreatedById":40820,"CreatedDateTime":"2012-10-06T14:44:30Z","Content":"\n\u003Cp\u003EDon\u0027t know if this has been posted as a problem yet, but I moved my Orbital Operations tab and Landing tab one day, I exited, saved, came back the next day, and every time I open those 2 tabs they aren\u0027t there, everything else works though. Help please?\u003C/p\u003E\n"},{"CreatedByName":"8balls40","CreatedById":40820,"CreatedDateTime":"2012-10-06T14:48:47Z","Content":"\n\u003Cp\u003EAlso is there anyway to reset the positions of the tabs on your screen?\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-10-06T15:16:36Z","Content":"\n\u003Cp\u003EDelete the folder mumechlib in PluginData I believe fixes that.\u003C/p\u003E\n"}]}