{"TopicId":146720,"ForumId":34,"TopicTitle":"[KSP 1.2] [2016-10-22] Contract Pack: Parts Unlimited, Ltd. [v0.1] Unlock parts with cash instead of science","CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-08-28T22:48:48Z","PageNum":1,"Articles":[{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-08-28T22:48:48Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EWARNING:\u003C/strong\u003E This not just a contract pack! It is a totally different way to play career mode. Do not install this on a currently-running career, or uninstall it once installed; I\u0027m not sure what would happen. But if you DO try it, tell me what happens \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWARNING:\u003C/strong\u003E This is an alpha release! What does that mean? It means if it screws up your career game, it\u0027s not my fault \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E. Please report it but do not expect sympathy, only thanks for the bug report. You should NEVER install this and use it on a current career anyway, even when it\u0027s considered a solid release. This is for advanced users who want to modify some of the core gameplay mechanics of Kerbal Space Program\u0027s career mode.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PU_256.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://pulpaudio.com/ksp/PU_256.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDESCRIPTION:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis contract pack does 3 things:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nScrews up R\u0026amp;D to the point where you can\u0027t use it. Science - therefore - is meaningless in your career. You can ignore it, convert it via a Strategy, or whatever.\n\u003C/li\u003E\n\u003Cli\u003E\nAdds one contract per part, the cost of which is relative to the part\u0027s cost and the reward of which is the use of the part. There is no part testing, no going to Moho or traveling 1500m/s. No right clicking. You take a contract, pay the up-front cost, and get the part. Easy peasy.\n\u003C/li\u003E\n\u003Cli\u003E\n(You don\u0027t notice this in-game, but will see its effects) Sets up each part in it\u0027s own hidden tech tree node. This means you don\u0027t get to - or have to - unlock a \u003Cstrong\u003Eset\u003C/strong\u003E of parts. You \u003Cstrong\u003Eonly\u003C/strong\u003E unlock those parts you \u003Cstrong\u003Eneed\u003C/strong\u003E. For many of us, this could \u003Cstrong\u003Esignificantly\u003C/strong\u003E lessen the visible parts while building in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. Never use that micronode? Don\u0027t take the contract. Ever. It\u0027ll never show up in your list.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\n\u003Cstrong\u003ENOTES:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe basic starter parts are still available from the start. You gotta have SOMETHING to attach your test parts to!\n\u003C/li\u003E\n\u003Cli\u003E\nYou should turn negative funds ON, or you may accidentally cheat by accepting a contract you can\u0027t pay for!\n\u003C/li\u003E\n\u003Cli\u003E\nThe first time you load Mission Control the game may pause as it generates over 200 contracts, one for each part. It will be much quicker from that point on.\n\u003C/li\u003E\n\u003Cli\u003E\nYou pretty much MUST use the new \u0022All\u0022 tab that Contract Configurator provides. The Available tab will be way too crowded whenever you have a lot of money. If you have a low resolution, you may have to scroll to see all contracts even when everything is collapsed. There\u0027s not much I can do about this. Ironically, this was better before they added the new part categories.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003EDOWNLOAD:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://spacedock.info/mod/927/Parts%20Unlimited\u0022 rel=\u0022external nofollow\u0022\u003ESpacedock\u003C/a\u003E\u003Cbr\u003E\u003Ca href=\u0022https://github.com/5thHorseman/PartsUnlimited\u0022 rel=\u0022external nofollow\u0022\u003EGitHub\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EINSTALLATION:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWithin the install zip file is a GameData folder. Within that folder is a ContractPacks folder. Within THAT folder is a PartsUnlimited folder. Put that folder in your KSP GameData\\ContractPacks folder that you got when you installed ContractConfigurator. See \u003Cstrong\u003ERequirements\u003C/strong\u003E below.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EREQUIREMENTS:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/91625-a\u0022 rel=\u0022\u0022\u003EContract Configurator\u003C/a\u003E (This is a set of configs for that mod, after all)\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/50533-M\u0022 rel=\u0022\u0022\u003EModule Manager\u003C/a\u003E (but what doesn\u0027t these days?)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECOMPATIBILITY:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis mod will hopefully be compatible with most if not all other part mods. I tested it quickly with \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E and it seems to work just fine. It may have trouble with any procedural parts mods that unlock size upgrades incrementally, but honestly I don\u0027t know how those mods work and don\u0027t use them. I\u0027d love to know if they work or not, and if they don\u0027t work I\u0027ll see what I can do.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECHANGELOG:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n0.1: Initial test release - missing only balancing of part costs, agency art, and descriptions. Any and all mods should be supported unless they add their own part categories (like Utilities, Pods, Aero, etc)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBUGS:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nYou can accept contracts in many situations when you don\u0027t have the available money to pay for them. This is outside of my control, but I\u0027m releasing anyway because in KSP 1.2 you can enable \u0022Allow Negative Funds\u0022 and your funds show up in red. In previous KSP versions, negative funds was an option but didn\u0027t display in red so were confusing.\n\u003C/li\u003E\n\u003Cli\u003E\nContracts do not auto-complete in Mission Control. You must exit out, let them complete, and then to back in. It\u0027s clunky, but not too bad as you generally won\u0027t be taking more than a few of these contracts at a time.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003ETO DO:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBalance part costs. Right now most of the contract costs are 30 times the part\u0027s cost to unlock in the stock game. I think that\u0027ll be okay but I want to balance it between being able to unlock things super quick (which is bad) and slogging through endless missions to earn enough cash to unlock an I-beam (which is also bad). Let me know if you think costs should be higher or lower, and I\u0027ll be testing this myself.\n\u003C/li\u003E\n\u003Cli\u003E\nPart images in the contracts. I don\u0027t know if this is possible but if it is, I\u0027ll find a way to do it \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E If it\u0027s not, I\u0027m working on a \u0022descriptive.cfg\u0022 to modify those parts with particularly uninformative descriptions, to better describe what part they are and what they do.\n\u003C/li\u003E\n\u003Cli\u003E\nTo keep the number of contract folders down, I may combine certain categories, like say Payload and coupling with structural. I\u0027m not sure yet if this would be better or worse. Opinions welcome.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003ELICENSE:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGNU GPL3.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETHANKS:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTo nightingale. Not only for making Contract Configurator and making countless changes to it to accommodate my inane requests, but also for endless patience in helping me understand his frighteningly configurable mod.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDONATIONS\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI do not need donations, but if you want to contribute, please donate to SpaceDock:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.patreon.com/user?u=2903335\u0026amp;ty=h\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022patreonSD.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.52k.de/spacedock/patreonSD.png\u0022 style=\u0022width:200px;height:auto;\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-04T00:15:44Z\u0022 title=\u002211/04/2016 12:15  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 4, 2016\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003Cbr\u003EKSP 1.2 Release!\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-08-28T23:03:34Z","Content":"\n\u003Cp\u003E\nI made a bad choice.\n\u003C/p\u003E\n\u003Cp\u003E\nI totally forgot - in my excitement - that the features I\u0027m utilizing for my pack require the version of Contract Configurator AFTER 1.18.1 to work. You\u0027ll have to wait for that to release before downloading this mod.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-28T23:09:09Z\u0022 title=\u002208/28/2016 11:09  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 28, 2016\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2016-08-29T02:29:07Z","Content":"\n\u003Cp\u003E\nI am super glad you\u0027ve made this. It\u0027ll be very exciting to try it out!\n\u003C/p\u003E\n"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2016-08-29T05:40:27Z","Content":"\n\u003Cp\u003E\nCongrats on the release!  I\u0027ll try to get the update out in the next day or so.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as the contract descriptions go, you may want to consider utilizing @part.Description() in some way (it tends to be more flavour text than useful stuff, but it\u0027s better than something generic).\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-08-29T16:03:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222734132\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472449227\u0022 data-ipsquote-userid=\u0022119307\u0022 data-ipsquote-username=\u0022nightingale\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, nightingale said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCongrats on the release!  I\u0027ll try to get the update out in the next day or so.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as the contract descriptions go, you may want to consider utilizing @part.Description() in some way (it tends to be more flavour text than useful stuff, but it\u0027s better than something generic).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks. I\u0027m happy with what I\u0027ve got so far. The tiny bit of testing I\u0027ve done so far is very promising. I\u0027m really going to beef up the descriptions. In lieu of pictures, I want to give the player as much info as I possibly can to determine what part they\u0027re really unlocking.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222734009\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472437747\u0022 data-ipsquote-userid=\u002244217\u0022 data-ipsquote-username=\u0022BigFatStupidHead\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, BigFatStupidHead said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am super glad you\u0027ve made this. It\u0027ll be very exciting to try it out!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI hope you like it! It has a lot of potential I think \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2016-09-02T13:57:54Z","Content":"\n\u003Cp\u003E\nWow\n\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2016-09-05T19:07:37Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73725-5thhorseman/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273725\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73725-5thhorseman/\u0022 rel=\u0022\u0022\u003E@5thHorseman\u003C/a\u003E, a quick poke to say Contract Configurator has updated. I\u0027d love to give this a try, if you\u0027d put up the download link?\n\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2016-09-05T20:56:54Z","Content":"\n\u003Cp\u003E\nI\u0027d love to test this out, too!\n\u003C/p\u003E\n\u003Cp\u003E\nJust to be sure I understand:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nContracts have negative advances, so you need cash up front to accept them\n\u003C/li\u003E\n\u003Cli\u003E\nYou get a prototype part, slap in on your rocket and get the part for real\n\u003C/li\u003E\n\u003Cli\u003E\nYou said something about techtree. Can you unlock all parts at start (assuming money available), or is there some progression among them?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI\u0027d suggest you use some conditionals in the pricing; like, if it is a structural part the contract price is 4 times part price, if it is a command module then it is 15. Or something (I just pulled these numbers out of... thin air) - edit: check the link on my sig for reference, I use the \u0027ship type\u0027 variable on command pods to choose the amount of supplies to stock them, multipliers and conditionals.\n\u003C/p\u003E\n\u003Cp\u003E\nI would also suggest some parts (or classes of parts, such as \u0027all engines\u0027 or \u0027all reaction wheels\u0027) have \u003Cem\u003Esomething\u003C/em\u003E more to the contract than just slapping on, but don\u0027t know \u003Cem\u003Ewhat \u003C/em\u003Eto suggest for that something at the moment \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E Static firing tests for engines, perhaps? (like, fire for 10 seconds while stable at ~0m/s, or something)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-05T20:58:40Z\u0022 title=\u002209/05/2016 08:58  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 5, 2016\u003C/time\u003E by monstah\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-09-06T04:52:51Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/44217-bigfatstupidhead/\u0026amp;do=hovercard\u0022 data-mentionid=\u002244217\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/44217-bigfatstupidhead/\u0022 rel=\u0022\u0022\u003E@BigFatStupidHead\u003C/a\u003E There is a problem in the new Contract Configurator update, that has a new fix that I\u0027m testing in a few moments. Assuming that works this will be available as quick as I can make it come after that becomes official. Right now, you can accept contracts in many situations when you should not be able to which makes it very easy to progress - even by accident without intending to \u0022cheat.\u0022 If it was something that was easier to avoid I\u0027d consider releasing, but I\u0027ve decided to hold off if I can.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/95210-monstah/\u0026amp;do=hovercard\u0022 data-mentionid=\u002295210\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/95210-monstah/\u0022 rel=\u0022\u0022\u003E@monstah\u003C/a\u003E Actually I\u0027ve simplified the busy-work somewhat for the player. The \u0022put the part on your vessel\u0022 was a bit clunky so I\u0027m trying to make it so the contracts simply auto-complete. Literally, if you have the money you can just unlock all the parts in the game if you so choose. Of course, unless you really give yourself tons of cash to start, you\u0027ll not be starting with nearly enough money to unlock a lot of parts. However, by the time you get to orbit you\u0027ll be able to unlock enough parts to do most anything you want (in a general sense. You can unlock a nice probe core, or enough plane parts to get started there, or maybe unlock the bare minimum ISRU parts or early solar panels).\n\u003C/p\u003E\n\u003Cp\u003E\nRegarding cost balancing, that will be the #1 hardest part for me in this mod. I\u0027ll consider all suggestions (and I like your conditional one. It\u0027s very easy to modify one part category as they\u0027re all in separate config files so balancing in that way is trivial. It\u0027s just getting the numbers right that\u0027s the hard part \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E )\n\u003C/p\u003E\n\u003Cp\u003E\nI may - after initial release and balancing - go back to the idea of actually testing parts. However I will NOT accept any test that you can do at the launch pad for free or nearly free. For me, this mod is a way to cut out the drudgery of collecting science. I\u0027m not going to replace it with drudgery in testing parts. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Oh, and you are correct about negative advances. You accept the contract for -18,000 funds, and that money is instantly deducted from your account. You can consider it the cost to pay people to develop the engine, or the cost to license its use. Your call.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-06T04:57:00Z\u0022 title=\u002209/06/2016 04:57  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 6, 2016\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2016-09-06T12:26:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222743821\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473137571\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s very easy to modify one part category as they\u0027re all in separate config files so balancing in that way is trivial. It\u0027s just getting the numbers right that\u0027s the hard part \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI know what you mean. That config on my signature took me a long time, and I never got satisfied with it (I\u0027m not even playing \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS at the moment)\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222743821\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473137571\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI may - after initial release and balancing - go back to the idea of actually testing parts. However I will NOT accept any test that you can do at the launch pad for free or nearly free. For me, this mod is a way to cut out the drudgery of collecting science. I\u0027m not going to replace it with drudgery in testing parts. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYup! That\u0027s why I hadn\u0027t suggested anything yet. A static fire test would work if it was hard to keep the rocket in place, and/or if overheat was more of a problem early career. But we can test and balance the basics for now (as soon as it\u0027s available), and worry about that later.\n\u003C/p\u003E\n\u003Cp\u003E\nCheers.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-09-12T22:15:01Z","Content":"\n\u003Cp\u003E\nYusssssssssssssss!\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-10-22T22:49:19Z","Content":"\n\u003Cp\u003E\nWith the release of Contract Configurator for KSP 1.2, and a few changes to KSP (most notably RED NUMBERS for negative funds) I\u0027ve decided to release this. It should work great, but please note I consider this an ALPHA release.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat does that mean? It means if it screws up your career game, it\u0027s not my fault \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E. Please report it but do not expect sympathy, only thanks for the bug report. You should NEVER install this and use it on a current career anyway, even when it\u0027s considered a solid release. This is for advanced users who want to modify some of the core gameplay mechanics of Kerbal Space Program\u0027s career mode.\n\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2016-10-23T03:36:02Z","Content":"\n\u003Cp\u003EYay, finally released! Thanks!\u003C/p\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2016-10-23T10:36:53Z","Content":"\n\u003Cp\u003E\nThis mod will be incredible with KR\u0026amp;D. That one uses science points in order to upgrade existing parts. I\u0027m going to use this mod in conjunction with that for my new long-term career (which will involve, amongst other things, a very extensive Eve program).\n\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2016-10-23T17:54:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222819326\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477219013\u0022 data-ipsquote-userid=\u0022160814\u0022 data-ipsquote-username=\u0022eloquentJane\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, eloquentJane said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis mod will be incredible with KR\u0026amp;D. That one uses science points in order to upgrade existing parts. I\u0027m going to use this mod in conjunction with that for my new long-term career (which will involve, amongst other things, a very extensive Eve program).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat sounds like a good way to do things.\n\u003C/p\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2016-10-23T19:18:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222819885\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477245250\u0022 data-ipsquote-userid=\u002244217\u0022 data-ipsquote-username=\u0022BigFatStupidHead\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, BigFatStupidHead said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat sounds like a good way to do things.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAfter some testing, I\u0027ve realised that I might not be able to do it. This mod causes every part contract to appear at once, which induces severe lag when opening mission control, as well as making it incredibly difficult to find other contracts.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-10-23T19:25:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222819994\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477250329\u0022 data-ipsquote-userid=\u0022160814\u0022 data-ipsquote-username=\u0022eloquentJane\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, eloquentJane said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAfter some testing, I\u0027ve realised that I might not be able to do it. This mod causes every part contract to appear at once, which induces severe lag when opening mission control, as well as making it incredibly difficult to find other contracts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne important thing with this mod, you MUST use the \u0022all\u0022 tab that Contract Configurator added, and the folder-like structure it uses. Also, that delay (which was never even a full second for me) is only the first time you start, as it generates all the contracts.\n\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2016-10-23T20:01:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222820002\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477250703\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne important thing with this mod, you MUST use the \u0022all\u0022 tab that Contract Configurator added, and the folder-like structure it uses. Also, that delay (which was never even a full second for me) is only the first time you start, as it generates all the contracts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAn important addendum. Thanks for the info.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-10-24T08:09:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222820056\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477252913\u0022 data-ipsquote-userid=\u002244217\u0022 data-ipsquote-username=\u0022BigFatStupidHead\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, BigFatStupidHead said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAn important addendum. Thanks for the info.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve added it to the first post, where it should have been originally \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TwoThe","CreatedById":167385,"CreatedDateTime":"2016-11-02T11:18:09Z","Content":"\n\u003Cp\u003E\nThis mod sounds like it was made to be used together with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/128204-120-kerbal-research-development/\u0022 rel=\u0022\u0022\u003EKerbal R\u0026amp;D mod\u003C/a\u003E: get parts through contracts, improve them with science points. I am really excited to try that combination in a career game. =)\n\u003C/p\u003E\n"},{"CreatedByName":"MysterySloth","CreatedById":175082,"CreatedDateTime":"2017-04-01T00:41:33Z","Content":"\n\u003Cp\u003E\n1) Is this still being developed?\n\u003C/p\u003E\n\u003Cp\u003E\n2) Does it work with custom tech trees?\n\u003C/p\u003E\n\u003Cp\u003E\n3) Does it work with custom categories, and, if not, ho could i manually add support?\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2017-07-04T23:41:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223005057\u0022 data-ipsquote-contentid=\u0022146720\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221491007293\u0022 data-ipsquote-userid=\u0022175082\u0022 data-ipsquote-username=\u0022MysterySloth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/31/2017 at 8:41 PM, MysterySloth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n1) Is this still being developed?\n\u003C/p\u003E\n\u003Cp\u003E\n2) Does it work with custom tech trees?\n\u003C/p\u003E\n\u003Cp\u003E\n3) Does it work with custom categories, and, if not, ho could i manually add support?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry I\u0027ve been pretty lax lately.\n\u003C/p\u003E\n\u003Cp\u003E\nI do not know if this works in 1.3. It did work fine in the last version of 1.2 though.\n\u003C/p\u003E\n\u003Cp\u003E\nIt should work with custom tech trees, in that all the parts will have contracts and the trees will be chopped down and used for firewood (i.e., the trees themselves will be not useful at all).\n\u003C/p\u003E\n\u003Cp\u003E\nIt will not work with custom categories, as I wrote a config for each category. I don\u0027t recall if I wrote a config for \u0022everything else\u0022 but think I may have. To add support, look at the config for any category. Utility is pretty generic, and Engines shows some custom pricing based on things like Isp.\n\u003C/p\u003E\n"}]}