{"TopicId":157157,"ForumId":34,"TopicTitle":"Add-on updates, a public service announcement.","CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2017-03-01T14:11:51Z","PageNum":1,"Articles":[{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2017-03-01T14:11:51Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003EAbout mod update inquiries, aka \u0022Please update your mod to (\u003Cem\u003Einsert just-released KSP version here\u003C/em\u003E)\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFor everyone interested in updates to their favorite add-ons, please do not pester modders in the add-on thread, modders volunteer their time and requests or inquiries for updates just derail threads and will not make updates come any sooner.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn case new KSP version is released and the mod is not advertised as compatible or supports only previous version:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Please make sure that at least a reasonable amount of time has passed since new KSP release. Modders may be well aware of new version and could announce the release themselves - asking them for update on the same day will not make it happen faster.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Before posting a request, please make sure that update was not already asked or announced in mod thread:\u003Cbr\u003E\n- check the first post of the addon for news,\u003Cbr\u003E\n- check the last pages on the thread,\u003Cbr\u003E\n- use the search function in the thread with \u0022update\u0022 as keyword.\u003Cbr\u003E\nIf the mod has an additional \u0022development thread\u0022 please do a search there as well.\n\u003C/p\u003E\n\u003Cp\u003E\n3. If someone has already requested the update or the modder announced it, please refrain from duplicating the inquiry.\u003Cbr\u003E\nTo add yourself to the appreciation crowd and/or show that you are a fan waiting for an update - consider using the Like-system and giving a \u0022\u002B\u003Cspan style=\u0022color:#ffffff;\u0022\u003E\u003Cspan style=\u0022background-color:#3498db;\u0022\u003E Like \u003C/span\u003E\u003C/span\u003E\u0022  to corresponding post: this will not result in an additional (distracting) email notification in the modder inbox,  - but it will still be visible and noticeable for him/her on the forum.\n\u003C/p\u003E\n\u003Cp\u003E\n4. If there is no news in the first post and no response - there is likely no update.\n\u003C/p\u003E\n\u003Cp\u003E\n5. Modders are asked to keep their first posts up to date so their fans can stay informed.\n\u003C/p\u003E\n\u003Cp\u003E\n6. If someone broke this guideline and pestered  - please hit the \u0022report\u0022 button, type \u0022Mod update pestering\u0022 into the field and hit \u0022send\u0022.\u003Cbr\u003E\nPlease refrain from responding with advisory post, aka \u0022You should not pester for mods\u0022 - as that would fall into \u0022backseat moderation\u0022. Thanks! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESummary:\u003C/strong\u003E If sufficient time has passed and update is neither announced, nor already asked by someone -  a polite inquiry about an update is OK. Pestering is NOT OK, - just hit \u0022\u002B\u003Cspan style=\u0022color:#ffffff;\u0022\u003E\u003Cspan style=\u0022background-color:#3498db;\u0022\u003E Like \u003C/span\u003E\u003C/span\u003E\u0022 next to existing update instead of making a duplicate post - and then just give it some time. Please hit \u0022report\u0022 button if you notice pestering.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThank you.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-21T01:54:50Z\u0022 title=\u002204/21/2018 01:54  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 21, 2018\u003C/time\u003E by Kerbal101\u003C/strong\u003E\n\u003C/span\u003E\n"}]}