{"TopicId":17833,"ForumId":34,"TopicTitle":"[1.3.0] Kerbal Engineer Redux 1.1.3.0 (2017-05-28)","CreatedByName":"cybutek","CreatedById":32393,"CreatedDateTime":"2012-08-26T08:42:03Z","PageNum":40,"Articles":[{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2014-06-26T08:49:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ETWR is shown in compact mode, too. I suspect TheReaper is really after lift-to-weight, i.e. the lift generated by aerodynamic surfaces versus the weight of the craft. \u003Cp\u003EI don\u0027t think KER (or any mod that I know of) calculates this, and it seems like it is a fairly complex calculation as lift varies by speed, atmospheric density and attitude.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E well,it looks like i just have to build wings to last, kinda disapointing though, considering people always complain about stock aerodynamics is so simple and total nonesense yet no one can calculate it it would make plane construction a lot easier\u003C/p\u003E\u003Cp\u003Ethanks though\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2014-06-26T13:56:12Z","Content":"\n\u003Cp\u003EI actually have a hack method of calculating Lift-to-Weight I use to compensate for lift from wings for my Velocity Control mod.\u003C/p\u003E\u003Cp\u003EThe limitation is that this would be a real-time report while in flight, I don\u0027t have any way of getting the number in the SPH. \u003C/p\u003E\u003Cp\u003EThe reason being is that my method calculates backwards from what\u0027s actually happened, it does not simulate it, as follows:\u003C/p\u003E\u003Cp\u003E1) Get vertical acceleration from our last physics update, convert to the force exerted on the plane.\u003C/p\u003E\u003Cp\u003E2) Get the amount of vertical thrust from engines, subtract from force exerted on plane.\u003C/p\u003E\u003Cp\u003E3) Remaining force on plane was lift from wings, calculate Lift-to-Weight.\u003C/p\u003E\u003Cp\u003EI\u0027d have to look into landing gear wheels and see if I can distinguish between \u0027lift\u0027 from those resting on the ground and actual lift from wings, otherwise this method will never show a Lift-to-Weight of less then 1 while on the ground as it would could the force the ground is exerting on the wheels as lift.\u003C/p\u003E\u003Cp\u003EIt also technically shows your Lift-to-Weight for the previous physics frame update, but as there are 50 updates per second that is not a big deal.\u003C/p\u003E\u003Cp\u003EI have no clue if this could be incorporated into KER at all, does the current simulation engine it uses have atmospheric variables at all?\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2014-06-26T17:11:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheReaper\u0022 data-cite=\u0022TheReaper\u0022\u003E\u003Cdiv\u003Ecertainly 2 other guys before me told you what i really meant, but i d like to say, its called you misunderstod and you are WRONG\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell gee, thanks for being so understanding. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-06-27T04:55:09Z","Content":"\n\u003Cp\u003EAll I ask for the next release is the KER window not popping up by default all the time\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-27T13:34:28Z","Content":"\n\u003Cp\u003EThis is probably more a job for Cybutek in the new version than for the current 0.6 series. There are a number of odd effects with the window visibility and there isn\u0027t a huge amount of point fixing them in the current version as it isn\u0027t exactly a critical bug, more a slight inconvenience...\u003C/p\u003E\n"},{"CreatedByName":"Agathorn","CreatedById":99662,"CreatedDateTime":"2014-06-27T16:10:36Z","Content":"\n\u003Cp\u003EI keep running into the problem where KER isn\u0027t showing data in the VAB on all my stages. I double/triple check all the staging and its all correct, but KER refuses to show more than one stage (it actually looks like the last stage (IE the in orbit stage) based on the shown ISP, but i\u0027m not positive on that). Its like it gets stuck and refuses to update. If I go through and delete all the actual parts for the stages, tanks, engines, decouplers, then it still doesn\u0027t update! It still shows that one, now non-existent, stage. No errors appear in the log.\u003C/p\u003E\u003Cp\u003EEDIT: ok, seriously WTF. I hit the NEW button to clear everything and start a brand new rocket. I added the probe as part 1, then the KER chip as part 2. KER immediately once again showed me that one stage form the PREVIOUS rocket! I then exited the VAB completely went back in, and its doing the same thing!\u003C/p\u003E\u003Cp\u003EAre there any mods KNOWN to cause bugs in KER?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-27T16:13:42Z\u0022 title=\u002206/27/2014 04:13  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 27, 2014\u003C/time\u003E by Agathorn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-27T16:38:02Z","Content":"\n\u003Cp\u003EIt sounds like the simulation code is stalling for some reason. This should happen much less with 0.6.2.4 (or my dev version based on it) than it used to. If you are using 0.6.2.4 then can you upload your output_log.txt somewhere so I can look for problems?\u003C/p\u003E\u003Cp\u003EDoes KER work correctly if you just start KSP and build a simple rocket? Does it then always go wrong when you load this particular craft? If so, can you please post a screenshot of the VAB with KER\u0027s \u0022show all stages\u0022 button pressed and the KSP staging list visible, and also upload the craft file? If it uses part mods then please also give a list of all the different mods.\u003C/p\u003E\n"},{"CreatedByName":"Agathorn","CreatedById":99662,"CreatedDateTime":"2014-06-27T19:47:45Z","Content":"\n\u003Cp\u003ERestarting KSP completely fixes it, but it isn\u0027t 100% reproducible that i\u0027ve seen. It just randomly happens.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-27T20:55:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Agathorn\u0022 data-cite=\u0022Agathorn\u0022\u003E\u003Cdiv\u003ERestarting KSP completely fixes it, but it isn\u0027t 100% reproducible that i\u0027ve seen. It just randomly happens.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENext time it happens, if you can upload your output_log.txt it may help me to track down the cause. I can see one place where a problem could go unnoticed and unreported in the log so I will be updating my development version to fix this later this evening...\u003C/p\u003E\n"},{"CreatedByName":"gm537","CreatedById":66746,"CreatedDateTime":"2014-06-29T07:18:15Z","Content":"\n\u003Cp\u003EI am getting a glitch where KER is showing dV\u0027s a lot above the actual. The problem seems to occur when using two types of engine, one with much higher ISP than the other. I am using Future Propulsion and thus the higher ISP engine is running a different fuel. Not exactly sure where the problem is coming from but it seems to be fine with just NFP engines it\u0027s only when I combine the engines with standard engines that I see a problem. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Eptm0Ku.png\u0022 alt=\u0022Eptm0Ku.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote stage S3 which claims to have 12km/s dV but in reality will only have about 3km/s dV. Not sure what the problem is but it was definitely screwing up my designs...\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-29T08:14:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gm537\u0022 data-cite=\u0022gm537\u0022\u003E\u003Cdiv\u003EI am getting a glitch where KER is showing dV\u0027s a lot above the actual. The problem seems to occur when using two types of engine, one with much higher ISP than the other. I am using Future Propulsion and thus the higher ISP engine is running a different fuel. Not exactly sure where the problem is coming from but it seems to be fine with just NFP engines it\u0027s only when I combine the engines with standard engines that I see a problem. \u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Eptm0Ku.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Eptm0Ku.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote stage S3 which claims to have 12km/s dV but in reality will only have about 3km/s dV. Not sure what the problem is but it was definitely screwing up my designs...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve never looked at Near Future Propulsion so there may well be issues with the engines. If you aren\u0027t already, then can you try the dev version of KER linked in my sig? Then, assuming that also gives the wrong values, open the tweakable panel for the engineer part (or the pod if you use the MM config) and hit the \u0022Log Sim\u0022 button. This will dump a large amount of logging into output_log.txt. Then upload your output_log.txt somewhere for me to have a look at. A copy of your craft file and a full list of the part mods used would also be very useful...\u003C/p\u003E\n"},{"CreatedByName":"gm537","CreatedById":66746,"CreatedDateTime":"2014-06-29T19:23:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003EI\u0027ve never looked at Near Future Propulsion so there may well be issues with the engines. If you aren\u0027t already, then can you try the dev version of KER linked in my sig? Then, assuming that also gives the wrong values, open the tweakable panel for the engineer part (or the pod if you use the MM config) and hit the \u0022Log Sim\u0022 button. This will dump a large amount of logging into output_log.txt. Then upload your output_log.txt somewhere for me to have a look at. A copy of your craft file and a full list of the part mods used would also be very useful...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay so I got the dev version and frankly is seems to be more wrong... It seems to be confused about how the staging is even happening and I\u0027m not quite sure why... but regardless a number of the stages that were wrong before seem to still be wrong (and now some stages that were right also appear to be incorrect, at least in VAB) \u003C/p\u003E\u003Cp\u003EAs for the \u0022log sim\u0022 thing do I do that in the VAB and then just fly it for a bit? Or do I fly it for a bit and then hit it? The parts mods being used here are: Near Future Propulsion, Near Future Solar, and KW Rocketry. Though, as mentioned I only seem to be having problems when combining (burning simultaneously) engines from NFP, and traditional engines (either stock or KW, both are incorrect)\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-29T19:46:16Z","Content":"\n\u003Cp\u003EThe \u0022Log Sim\u0022 button will simply make the next run of the simulation code (so, the next time the build engineer or the VES tab of flight engineer updates) dump out debug info, so you can quit a few seconds after. I\u0027ve set up a test install of KSP with all the Near Future packs and will add KW so I can run some tests. Are you able/willing to upload the .craft?\u003C/p\u003E\n"},{"CreatedByName":"gm537","CreatedById":66746,"CreatedDateTime":"2014-06-29T19:51:01Z","Content":"\n\u003Cp\u003EOk so I tried flying the ship and the live version was additionally incorrect being confused by even standard asparagus staging. I tried doing the \u0022Log Sim\u0022 thing for a while and I don\u0027t I did it correctly as I don\u0027t see the output_log.txt\u003C/p\u003E\u003Cp\u003EThe link to the craft file is below.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./view/u8q6p7og6corc9h/Kerbol_Altitudinator_IV.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./view/u8q6p7og6corc9h/Kerbol_Altitudinator_IV.craft\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-29T20:03:15Z","Content":"\n\u003Cp\u003EThe output_log.txt is created by KSP in the KSP_Data folder (on windows at least). I\u0027ll take a look at your craft...\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-30T10:07:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gm537\u0022 data-cite=\u0022gm537\u0022\u003E\u003Cdiv\u003EOk so I tried flying the ship and the live version was additionally incorrect being confused by even standard asparagus staging.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, there does appear to be a bug or two with the simulation staging logic in my latest dev build. I\u0027ll get a fixed version up as soon as I can...\u003C/p\u003E\n"},{"CreatedByName":"velve","CreatedById":112979,"CreatedDateTime":"2014-07-02T20:20:21Z","Content":"\n\u003Cp\u003EHi there, any way to remove the in-flight monitoring added by KER? I\u0027ve got one on each ship and did not realize the amount of lag they build up over a while. Setting the calculation time to 1000 has helped a bit but I would much rather get rid of them altogether.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-07-02T22:42:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022velve\u0022 data-cite=\u0022velve\u0022\u003E\u003Cdiv\u003EHi there, any way to remove the in-flight monitoring added by KER? I\u0027ve got one on each ship and did not realize the amount of lag they build up over a while. Setting the calculation time to 1000 has helped a bit but I would much rather get rid of them altogether.\u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESimply close the VES tab of the flight engineer window. It only ever runs on the active vessel (the one you are actually flying) and only when the VES window is showing.\u003C/p\u003E\n"},{"CreatedByName":"IronStar","CreatedById":107928,"CreatedDateTime":"2014-07-15T11:48:27Z","Content":"\n\u003Cp\u003EI have a weird issue- like in Agathorn s case engineer shows only one stage. In my case it shows only lowest stage- it updates it when something is changed but still, never anything except lover stage. But what is strange is that engineer works ok if i load pre-made craft(stock or from mods)- i can load, make changes and engineer updates ok(however even there there is an issue of upper stage inflated numbers) but when i make my own craft from scratch- everything happens just as i ve described. I ve tried making my craft stock one by putting files to the main ships folder but same happens when i load it.\u003C/p\u003E\u003Cp\u003EIt also must be noted that i have absolutely same issues with mechjeb dv calculator.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-07-15T11:51:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IronStar\u0022 data-cite=\u0022IronStar\u0022\u003E\u003Cdiv\u003EI have a weird issue- like in Agathorn s case engineer shows only one stage. In my case it shows only lowest stage- it updates it when something is changed but still, never anything except lover stage. But what is strange is that engineer works ok if i load pre-made craft(stock or from mods)- i can load, make changes and engineer updates ok(however even there there is an issue of upper stage inflated numbers) but when i make my own craft from scratch- everything happens just as i ve described. I ve tried making my craft stock one by putting files to the main ships folder but same happens when i load it.\u003Cp\u003EIt also must be noted that i have absolutely same issues with mechjeb dv calculator.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich version of KER are you using? Can you upload your craft for me to take a look at or, at least, a screenshot of the engineer window showing the problem (with \u0022show all stages\u0022 clicked if in the editor)? There is probably some quirk of your ship design that is confusing the calculation code...\u003C/p\u003E\u003Cp\u003EEdit: Also, an screenshot example of \u0022upper stage inflated numbers\u0022 with a description of which numbers you think are wrong would be useful.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-15T11:58:33Z\u0022 title=\u002207/15/2014 11:58  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 15, 2014\u003C/time\u003E by Padishar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"IronStar","CreatedById":107928,"CreatedDateTime":"2014-07-15T15:35:49Z","Content":"\n\u003Cp\u003Ei am using 0.6.2.4\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/yP2oaNC\u0022 alt=\u0022yP2oaNC\u0022\u003E\u003Ca href=\u0022http://i.imgur.com/yP2oaNC.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/yP2oaNC.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/znreTND.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/znreTND.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EStock KerbX- all is ok and engineer responds to changes\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/CszDhuH.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ehttp://i.imgur.com/CszDhuH.jpg\u003C/p\u003E\u003Cp\u003EFreya from NovaPunch- same\u003C/p\u003E\u003Cp\u003EAnd now the craft made from scratch\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/GQTiUsz.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/GQTiUsz.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI ve tried many - everything is same\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.filedropper.com/spacecraft2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/spacecraft2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Elink to file\u003C/p\u003E\u003Cp\u003EI ll try to reproduce the case with inflated numbers a bit later\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-07-15T15:48:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IronStar\u0022 data-cite=\u0022IronStar\u0022\u003E\u003Cdiv\u003EI ve tried many - everything is same\u003Cp\u003E\u003Ca href=\u0022http://www.filedropper.com/spacecraft2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/spacecraft2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Elink to file\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKER (and MJ) both have issues when the root part of the vessel (the part you place first in the editor) is dropped in an earlier stage. The root part of your craft is the fuel tank with the 3 launch clamps attached and this gets dropped when stage 1 is activated. Once this is done the craft only consists of the empty fuel tank, engine and decoupler so has no deltaV left. The only way to work around this at present it to redesign your ship so that one of the parts that doesn\u0027t get decoupled is the root part (usually the command pod). You can use the SelectRoot mod to switch the root part of your vessel and KER should immediately start updating correctly.\u003C/p\u003E\u003Cp\u003EThere are other staging related issues in KER (see my development thread) and you should probably be using the dev version in preference as it does fix some of them (and others are being worked on)...\u003C/p\u003E\n"},{"CreatedByName":"IronStar","CreatedById":107928,"CreatedDateTime":"2014-07-15T17:29:38Z","Content":"\n\u003Cp\u003EThank you very much, i ll try this mod, and if it doesnt work.....so be it, going to make rockets the new way. And what you ve said actually partly solves inflated upper stage dv- i ive used pre made heavy launcher from KW and attached pod with fuel tank and engine- i think that it just didnt see the new parts.\u003C/p\u003E\n"},{"CreatedByName":"Rakh","CreatedById":111948,"CreatedDateTime":"2014-07-17T21:46:59Z","Content":"\n\u003Cp\u003EConfirmed not currently working with .24. I forgot to take a screenshot so you\u0027ll just have to take my word or test yourself \u0026gt;_\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-07-17T22:14:55Z","Content":"\n\u003Cp\u003EYes, the simulation code is failing to calculate the part costs because something has changed in the core game API. I will release a fix over in my development thread asap...\u003C/p\u003E\n"}]}