{"TopicId":17833,"ForumId":34,"TopicTitle":"[1.3.0] Kerbal Engineer Redux 1.1.3.0 (2017-05-28)","CreatedByName":"cybutek","CreatedById":32393,"CreatedDateTime":"2012-08-26T08:42:03Z","PageNum":8,"Articles":[{"CreatedByName":"Aphox","CreatedById":32691,"CreatedDateTime":"2013-06-25T22:09:20Z","Content":"\n\u003Cp\u003EGave this thread a much needed \u003Cstrong\u003E[Plugin]\u003C/strong\u003E tag. Can\u0027t tell you how many times I just passed over this because it wasn\u0027t tagged. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-06-26T22:12:48Z","Content":"\n\u003Cp\u003EI\u0027m having a hard time figuring out the longitude display. I\u0027m looking at my longitude to figure out when I should make a transfer to geostationary orbit...and from what I can tell after a few orbits, the counter\u0027s range runs from -400 degrees to \u002B60 degrees... I would have expected either 0 through 360 degrees or -180 through \u002B180. How am I supposed to interpret the display?\u003C/p\u003E\u003Cp\u003EOther than that, I love the extra information especially regarding inclination.\u003C/p\u003E\n"},{"CreatedByName":"aeronerd","CreatedById":72590,"CreatedDateTime":"2013-06-28T01:03:44Z","Content":"\n\u003Cp\u003Eyup. same here.\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-06-28T05:14:28Z","Content":"\n\u003Cp\u003EAfter more testing, it seems the longitude will consistently be accurate for part of an orbit (using -x for degrees west, \u002Bx for degrees east), but will be bogus for the rest of it. It\u0027s quite strange.\u003C/p\u003E\n"},{"CreatedByName":"velusip","CreatedById":60676,"CreatedDateTime":"2013-06-28T07:15:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snillum101\u0022 data-cite=\u0022Snillum101\u0022\u003E\u003Cdiv\u003EI\u0027m also having this problem. It seems to happen when I attach SRBs to decouplers. If I attach the SRB to the rocket directly the deltaV is added correctly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA work-around/hack is to place an Oscar B (tiny fuel tank) between the SRB and the rest of the rocket to get a decent reading while building, then remove them before launch.\u003C/p\u003E\u003Cp\u003ENot quite so easy when using radial decouplers, but I\u0027ll figure something out...\u003C/p\u003E\u003Cp\u003EEdit: You can place the Oscar B over a radially attached SRB for the same effect.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-29T15:55:57Z\u0022 title=\u002206/29/2013 03:55  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 29, 2013\u003C/time\u003E by velusip\u003C/strong\u003E\n\u003Cbr\u003Efigured it out\n\u003C/span\u003E\n"},{"CreatedByName":"dapullia","CreatedById":72580,"CreatedDateTime":"2013-06-29T17:00:25Z","Content":"\n\u003Cp\u003EI am having serious issues with this add-on. On my ships the game is literally freezing up within 30 seconds of launching if these parts are on my rockets. I also have the KW-Rocketry parts addon as well and these are being used in my rocket in addition to standard parts.\u003C/p\u003E\n"},{"CreatedByName":"gerryrbd","CreatedById":66061,"CreatedDateTime":"2013-06-30T01:18:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dapullia\u0022 data-cite=\u0022dapullia\u0022\u003E\u003Cdiv\u003E \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe game only freezes for me if I try to use KER with very large and complex vessels, usually big space stations. Which is kinda understandable since no program could make sense of the stuff I end up putting together.. In those cases its best to just right click on the part and toggle the Flight Engineer off until its needed again.\u003C/p\u003E\u003Cp\u003EIve never experienced crashes on launch though.. And Im using several mods including KW Rocketry. I\u0027d say check that you are running the latest version of everything, disable other plugins to look for incompatibilities (part mods shouldnt have issues - and obviously dont run MechJeb alongside KER), and try with smaller vessels or different designs to see if it keeps crashing.\u003C/p\u003E\u003Cp\u003EOn a related note, any news from Cybutek? Havent heard from him since his last post about rewriting the code for v1.0, and its been a while... This and Kethane are the only mods I cant imagine playing KSP without\u003C/p\u003E\n"},{"CreatedByName":"someones","CreatedById":64508,"CreatedDateTime":"2013-07-06T18:10:19Z","Content":"\n\u003Cp\u003EHi!\u003C/p\u003E\u003Cp\u003EI love the build stat table, it is very useful especially for interplanetary mission where I have to land on various planet.\u003C/p\u003E\u003Cp\u003EThere is only a minor suggestion, is it possible to make the build window remember its last location?\u003C/p\u003E\u003Cp\u003EI tried to edit the numbers in the \u0022build_engineer\u0022 cfg file but every time i enter VAB, it resets itself to the default position.\u003C/p\u003E\n"},{"CreatedByName":"Core Xii","CreatedById":74219,"CreatedDateTime":"2013-07-13T06:45:19Z","Content":"\n\u003Cp\u003EBug report: If a stage consists of nothing but a solid fuel booster, the Engineer chip doesn\u0027t calculate delta V for that stage. If I add any part with resources on it, like a small battery or fuel tank, dV is calculated.\u003C/p\u003E\u003Cp\u003EFeature request: When designing a rocket, I aim for some specific amount of delta V for each stage. Since the Engineer chip calculates dV for each stage, finding a configuration of parts that produces the desired amount is easy. However, there are different configurations of parts that give approximately equal dV, but have wildly different mass. Since these stages are often followed by subsequent launch stages below, their weight does matter. What I\u0027d like is a column that displays \u003Cstrong\u003Edelta V per mass\u003C/strong\u003E for each stage. With that, I\u0027d be able to search for the lightest configuration of parts that gives me the desired dV. For example, if two distinct sets of parts both give 2000 m/s dV, but one weighs 4 tons while the other 3, I\u0027d be able to conveniently pick the more efficient one, ~667 dV/m compared to 500.\u003C/p\u003E\n"},{"CreatedByName":"xtremeqg","CreatedById":74327,"CreatedDateTime":"2013-07-14T15:08:37Z","Content":"\n\u003Cp\u003ESmall optimization:\u003C/p\u003E\u003Cp\u003EI noticed that the model and textures for the EngineerChip and EngineerChipFlight are identical. Rather than creating copies and making the game load things twice, you should put the part definition for both parts into a single part.cfg file. If the recently reworked parts loader is reasonably smart (have not exactly tested it), it should figure out that these parts are using the same models and textures and thus reuse them. If anything, it saves a bit on download size for users.\u003C/p\u003E\n"},{"CreatedByName":"xtremeqg","CreatedById":74327,"CreatedDateTime":"2013-07-14T19:06:14Z","Content":"\n\u003Cp\u003ESorry for the duplicate post, did not realize that my post was awaiting moderation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-18T09:28:04Z\u0022 title=\u002207/18/2013 09:28  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 18, 2013\u003C/time\u003E by xtremeqg\u003C/strong\u003E\n\u003Cbr\u003EDuplicate post\n\u003C/span\u003E\n"},{"CreatedByName":"SeaofYork","CreatedById":74281,"CreatedDateTime":"2013-07-16T17:55:08Z","Content":"\n\u003Cp\u003EJust DL\u0027d the plugin, and I\u0027ve got the chips available in the science tab, but no window pops up when I install them. Thoughts?\u003C/p\u003E\u003Cp\u003ERunning Mountain Lion on a Macbook Pro\u003C/p\u003E\n"},{"CreatedByName":"Oinker","CreatedById":62538,"CreatedDateTime":"2013-07-17T01:10:40Z","Content":"\n\u003Cp\u003EInterface request: please make the skin like MechJeb 2 or make it selectable like chatterer\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-17T02:02:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SeaofYork\u0022 data-cite=\u0022SeaofYork\u0022\u003E\u003Cdiv\u003EJust DL\u0027d the plugin, and I\u0027ve got the chips available in the science tab, but no window pops up when I install them. Thoughts?\u003Cp\u003ERunning Mountain Lion on a Macbook Pro\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow\u0027d you install the plug-in? Are you sure you\u0027re not using the chip that only gives in-flight information and not build information?\u003C/p\u003E\n"},{"CreatedByName":"Cashen","CreatedById":71281,"CreatedDateTime":"2013-07-17T23:11:08Z","Content":"\n\u003Cp\u003EOne thing I noticed when using KER, on the Surface tab for the flight engineer, it has Atmospheric Pressure and Atmospheric Density mixed up.\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-07-18T13:45:59Z","Content":"\n\u003Cp\u003Ein some instances it would be very helpful if we could change / modify the units / precision shown for the data output.\u003C/p\u003E\u003Cp\u003ESome examples, Time in pure sec; etc things like that... and items like axis, in meters not Mm\u003C/p\u003E\u003Cp\u003Eor be able to show more significant fig\u0027s...\u003C/p\u003E\u003Cp\u003Ethanks.\u003C/p\u003E\u003Cp\u003EDrTedAstro.\u003C/p\u003E\n"},{"CreatedByName":"The_mad","CreatedById":75214,"CreatedDateTime":"2013-07-21T10:55:10Z","Content":"\n\u003Cp\u003EI am not that good at C# but i have several questions pertaining to your code Cybutek.\u003C/p\u003E\u003Cp\u003EGeek Mode\u003C/p\u003E\u003Cp\u003EIn partsim.cs i found some magic numbers in it, wouldn\u0027t it be more consistent for the code to declare a variable for it?(declare 9.81d along with flowrate because it\u0027s a static)\u003C/p\u003E\u003Cp\u003EAnd IIRC in C float\u0027s are promoted to double\u0027s.(Saw a lot of floats declared)\u003C/p\u003E\u003Cp\u003EBool\u0027s are also promoted to Int\u0027s IIRC and same with Char\u0027s.(the main reason i use struct to encapsulate boolians)\u003C/p\u003E\u003Cp\u003E/Geek Mode\u003C/p\u003E\u003Cp\u003Eworst first post ever. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"bigdad84","CreatedById":49379,"CreatedDateTime":"2013-07-21T21:40:42Z","Content":"\n\u003Cp\u003EIs there any plans on making it a \u0022part-free\u0022 plug-in. Similar to how Chatterer automatically comes up without having to add a part to your ship?\u003C/p\u003E\n"},{"CreatedByName":"The_mad","CreatedById":75214,"CreatedDateTime":"2013-07-23T11:35:39Z","Content":"\n\u003Cp\u003EI would have to disagree partialy with bigdad84 because i do not want the free meal deal.\u003C/p\u003E\u003Cp\u003EI would like the move the requirements around a bit though, For instance gravity and G force have a device made by Squad use that as a requiremnt for G-force measurements.\u003C/p\u003E\u003Cp\u003EThe engineer could be part-free because it is in the planning stage.\u003C/p\u003E\n"},{"CreatedByName":"Oinker","CreatedById":62538,"CreatedDateTime":"2013-07-23T19:01:36Z","Content":"\n\u003Cp\u003EWhen comparing MechJeb\u0027s Delta-V stats to Engineer, I see the same TWR and burn time, but MechJeb shows slightly higher Delta-V for both atmospheric and vacuum. Which is correct and why is there a discrepancy?\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-23T19:34:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Oinker\u0022 data-cite=\u0022Oinker\u0022\u003E\u003Cdiv\u003EWhen comparing MechJeb\u0027s Delta-V stats to Engineer, I see the same TWR and burn time, but MechJeb shows slightly higher Delta-V for both atmospheric and vacuum. Which is correct and why is there a discrepancy?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve heard, but not confirmed, that MechJeb takes into account the fact that some parts, while having a mass in the VAB, have no mass on the launchpad, and KER doesn\u0027t take that into effect. Landing gear and some of the struts come to mind.\u003C/p\u003E\n"},{"CreatedByName":"TheFluffiestThing","CreatedById":69748,"CreatedDateTime":"2013-07-24T10:52:55Z","Content":"\n\u003Cp\u003EIs there any way to re-set the window position in the VAB? I\u0027ve accidentally moved it off screen and the mod is now next to useless \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-24T22:10:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheFluffiestThing\u0022 data-cite=\u0022TheFluffiestThing\u0022\u003E\u003Cdiv\u003EIs there any way to re-set the window position in the VAB? I\u0027ve accidentally moved it off screen and the mod is now next to useless \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOpen \u003Cem\u003EGameData\\Engineer\\Plugins\\PluginData\\engineer\\build_engineer.txt\u003C/em\u003E. Change the first line to this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E_WINDOW_POSITION = 300, 70, 714, 224\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s the position of my window, which should be visible.\u003C/p\u003E\n"},{"CreatedByName":"JackGruff","CreatedById":63760,"CreatedDateTime":"2013-07-25T16:38:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_mad\u0022 data-cite=\u0022The_mad\u0022\u003E\u003Cdiv\u003EI would have to disagree partialy with bigdad84 because i do not want the free meal deal.\u003Cp\u003EI would like the move the requirements around a bit though, For instance gravity and G force have a device made by Squad use that as a requiremnt for G-force measurements.\u003C/p\u003E\u003Cp\u003EThe engineer could be part-free because it is in the planning stage.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow at all would it be a free meal? The parts are already nearly zero in weight.\u003C/p\u003E\u003Cp\u003EVOID has already done this while still including the old parts so that crafts that still have the part can be used.\u003C/p\u003E\u003Cp\u003EIt would also allow you to see the information on crafts that were launched without the part.\u003C/p\u003E\n"},{"CreatedByName":"birrhan","CreatedById":62148,"CreatedDateTime":"2013-07-25T18:04:36Z","Content":"\n\u003Cp\u003EJust want to clarify that while orbital and flight info are largely OK in 0.21, the RDV button crashes the KER interface (goes to gray). Otherwise dv per stage, TWR, altitude, etc are good.\u003C/p\u003E\n"}]}