{"TopicId":182679,"ForumId":34,"TopicTitle":"[1.12.3] Restock - Revamping KSP\u0026#039;s art (Feb 25)","CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2019-03-06T08:20:16Z","PageNum":22,"Articles":[{"CreatedByName":"Dafni","CreatedById":149636,"CreatedDateTime":"2019-04-17T12:34:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223585391\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555503698\u0022 data-ipsquote-userid=\u0022128643\u0022 data-ipsquote-username=\u0022Poodmund\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Poodmund said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there any way I can un-see that chrome garbage above, it\u0027s now burnt into my retinas and I may need to see medical advice. Can anyone help at all?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nImmediately drink some holy water, and rinse your eyes with prime adult entertainment. Always works for me.\n\u003C/p\u003E\n"},{"CreatedByName":"Electrocutor","CreatedById":109593,"CreatedDateTime":"2019-04-17T12:35:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223585391\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555503698\u0022 data-ipsquote-userid=\u0022128643\u0022 data-ipsquote-username=\u0022Poodmund\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Poodmund said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there any way I can un-see that chrome garbage above, it\u0027s now burnt into my retinas and I may need to see medical advice. Can anyone help at all?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI never understood why some people prefer a flat gray paint instead of an actual metal; is it because KSP originally didn\u0027t have it? In real-life, these things are far shinier. To be fair, without the great normal maps from the pack, metal is far less enticing as can be seen when comparing the trusses versus the rockomax tanks. I would personally love to see restock have a set of spec maps so it\u0027s proper metal instead of a generic/meh one.\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2019-04-17T12:53:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223585395\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555504513\u0022 data-ipsquote-userid=\u0022109593\u0022 data-ipsquote-username=\u0022Electrocutor\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, Electrocutor said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI never understood why some people prefer a flat gray paint instead of an actual metal; is it because KSP originally didn\u0027t have it? In real-life, these things are far shinier. To be fair, without the great normal maps from the pack, metal is far less enticing as can be seen when comparing the trusses versus the rockomax tanks. I would personally love to see restock have a set of spec maps so it\u0027s proper metal instead of a generic/meh one.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI never understood why some people prefer mismatched, blah textures instead of moar \u0022realistic\u0022, matched textures...\u003Cbr\u003E\nBut I also dont understand why some people prefer unrealistic, solid metal/chrome on everything, everywhere...\u003Cbr\u003E\nI\u0027ve always thought you and Shadowmage did a great thing when Textures Unlimited unlocked the ability to use PBR and expose the use of metallic specs in KSP.\u003Cbr\u003E\nI think it is an awesome tool that can be used to improve the game asthetics, and to make the parts look top notch, to fit in with many of the top notch visual graphics mods that have pushed the graphics envelope of KSP.\u003Cbr\u003E\u003Cbr\u003E\nHowever, I think most of the revulsion people have shown to the use of it, is that it has been far over-used and abused in many cases.\u003Cbr\u003E\u003Cbr\u003E\nI think it has its place, and subtler, lower-key use of it is where it would really \u0022shine\u0022 (pun intended), in KSP... NOT overpowering the existing aesthetic of the game.\u003Cbr\u003E\nYou know what they say about \u0022...too much of a good thing...\u0022\u003Cbr\u003E\nWhile I love a good, black cup of espresso, I\u0027m not keen on plain black coffee.\u003Cbr\u003E\nI absolutely love a good amount of vanilla creamer in my coffe...\u003Cbr\u003E\nHowever, at a 75-to-25 ratio of creamer to coffee...\u003Cbr\u003E\n*NOT* so much \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\u003Cbr\u003E\nBut thats just IMHO vOv\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-17T12:59:46Z\u0022 title=\u002204/17/2019 12:59  PM\u0022 data-short=\u00225 yr\u0022\u003EApril 17, 2019\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Electrocutor","CreatedById":109593,"CreatedDateTime":"2019-04-17T12:58:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223585405\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555505618\u0022 data-ipsquote-userid=\u002277721\u0022 data-ipsquote-username=\u0022Stone Blue\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Stone Blue said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think it is an awesome tool that can be used to improve the game asthetics, and to make the parts look top notch, to fit in with many of the top notch visual graphics mods that have pushed the graphics envelope of KSP.\u003Cbr\u003E\nHowever, I think most of the revulsion people have shown to the use of it, is that it has been far over-used and abused in many cases.\u003Cbr\u003E\u003Cbr\u003E\nI think it has its place, and subtler, lower-key use of it is where it would really \u0022shine\u0022 (pun intended), in KSP... NOT overpowering the existing aesthetic of the game.\u003Cbr\u003E\nBut thats just IMHO vOv\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is uplifting at least; I am no artist and do not pretend to be. I can only use the resources that are already there. Obviously, using a diffuse as the specular will not be correct, but it at least gets 20-30% of the way there. I don\u0027t want to veer the thread too far off-topic, I just wanted to let people know that you can add a metal variant that uses the new shaders if you wish; in my opinion it\u0027d be awesome if the restock metal parts and \u0027Metal\u0027 variants were actually metal, but it would seem I am in the minority.\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2019-04-17T13:25:32Z","Content":"\n\u003Cp\u003E\nI wouldnt have minded subtle use of metallics in Restock, that TU exposes to KSP. I think with the talented team who put Restock together, it would only have made Restock even that much better.\u003Cbr\u003E\nI have no idea if it was ever a consideration or even under discussion at any point, but I have a feeling that the final decision would have come down to the mod having an external dependency.\u003Cbr\u003E\nYou\u0027ll note that they wrote a custom .dll for the mod, that covers everything they needed, rather than adding dependencies on mods that may already offer the functionality they needed.\u003Cbr\u003E\nOther than ModuleManager... but then, *what* mod *doesnt* need \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E at this point? \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/109593-electrocutor/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022109593\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/109593-electrocutor/\u0022 rel=\u0022\u0022\u003E@Electrocutor\u003C/a\u003E may I suggest maybe switching your perspective a little. Instead of starting with speccing the overall structures of parts and working down to the details, maybe look at the small details of the parts first, and try converting only those to start with, and then work your way up... again, IMHO, I think subtle accents of metallic will go over much better with a wider audience.\u003Cbr\u003E\u003Cbr\u003E\nI wouldnt take any negativity to heart. As you admitted, you may not be an artist, but everyone has to start somewhere. *NO* KSP mod dev has ever had perfect early results, and *every* mod has needed refinements and tweaking.\u003Cbr\u003E\nTake pride in and thanks for, at least pioneering the way with the use of PBR, if not for the actual texture changes themselves. I for one, hope you continue your texturing efforts, to refine and improve on them.\u003Cbr\u003E\u003Cbr\u003E\nIt might be a good idea to continue previewing your efforts in a seperate thread. I know a lot of devs (not necessarily those of Restock), may show resistance to other people previewing efforts to improve/modify/change their mods, on said mods threads...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-17T13:32:42Z\u0022 title=\u002204/17/2019 01:32  PM\u0022 data-short=\u00225 yr\u0022\u003EApril 17, 2019\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2019-04-17T13:46:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223585395\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555504513\u0022 data-ipsquote-userid=\u0022109593\u0022 data-ipsquote-username=\u0022Electrocutor\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Electrocutor said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI would personally love to see restock have a set of spec maps so it\u0027s proper metal instead of a generic/meh one.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere is a specular map in the alpha channel on most of the parts (because that is how most of the KSP shaders work). Not sure if that is suitable for your purposes, but at least it is there.\n\u003C/p\u003E\n"},{"CreatedByName":"Cruzo","CreatedById":159784,"CreatedDateTime":"2019-04-17T16:44:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223585267\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555474725\u0022 data-ipsquote-userid=\u0022189162\u0022 data-ipsquote-username=\u0022Challyss\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Challyss said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve been playing for years and I just discovered this mod.... I don\u0027t have enough thumbs to show gratitude.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell it\u0027s only been out for a month, you haven\u0027t been missing out that long\n\u003C/p\u003E\n"},{"CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2019-04-17T17:15:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223585395\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555504513\u0022 data-ipsquote-userid=\u0022109593\u0022 data-ipsquote-username=\u0022Electrocutor\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Electrocutor said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI never understood why some people prefer a flat gray paint instead of an actual metal; is it because KSP originally didn\u0027t have it? In real-life, these things are far shinier. To be fair, without the great normal maps from the pack, metal is far less enticing as can be seen when comparing the trusses versus the rockomax tanks. I would personally love to see restock have a set of spec maps so it\u0027s proper metal instead of a generic/meh one.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t particularly care what the end user does myself. But uh, since you asked, essay time. \n\u003C/p\u003E\n\u003Cp\u003E\nFirst, let\u0027s think about the overall look of the game. PBR and KSP is, art-wise, problematic in the game\u0027s current state. By providing PBR parts, you are essentially injecting a modern rendering technique into a game built around pretty old shading technologies. Obviously the engine is capable of so much more than flat rendering, but the core elements of the game are completely built around techniques that are really, well, late 2000s-looking. Building parts with full PBR support creates a great look in the object itself, but then, well, it doesn\u0027t match the rest of the game at all. Loading a nicely built PBR part onto the launchpad is like nails on a chalkboard when you glance at the launch pad itself and its environment. This is mitigated in space to some extent because you can\u0027t see the poorly rendered environment except the parts, which is helpful. \n\u003C/p\u003E\n\u003Cp\u003E\nOf course, you can mitigate these issues by doing things like installing Scatterer, a quality visual pack or two, maybe some new skyboxes, but that starts to become a fairly heavy installation, and if we want Restock to look like a cohesive whole for the maximum variety of users, we can\u0027t mandate a gigantic visual overhaul pack for users to. We have to work within certain constraints, and one of those constraints (to me at least) is ensuring that we\u0027re upgrading the look of the game without changing the feel of the game. This is an esoteric concept of course, but I think you break the feel when large parts of the game start using different shading techniques. This is even more annoying because Restock is a work in progress, and we try to leverage existing good art in the game. Pushing PBR to all parts would require reworking of the part textures that were designed for a different shading workflow, which is a hell of a lot of extra work for us. \n\u003C/p\u003E\n\u003Cp\u003E\nOk, so let\u0027s say, somehow, we ignore the visual cohesiveness issues with environments, and commit to building specular and roughness maps for all parts, plus revisions to the albedo maps to support the new workflow. There are still problems - let\u0027s talk a bit about the technical state of PBR in KSP. Because of the DX9 state of the game, we firstly get crappy dynamic cubemaps. This of course fixable by pushing DX11 onto the user, which causes its own issues - not the least of which that your average user now needs to know how to specify startup flags (increases barrier to entry). You can fix this by installing more community fixes but again, lightweight is the goal, and we\u0027re now working in a rendering mode that is not officially supported by the devs. So we have to deal with as a first problem, crappy cubemaps. Next, we have to deal with the state of that Mapped shader itself. Until quite recently, it lacked self illumination support, which immediately disqualified it from say 50% of all KSP uses, some of which were arguably you would get the largest set of benefits (windows, engine bells). Now that the shader has been slightly upgraded with 1.7, this specific issue isn\u0027t a problem, but now, well, we lack pixel-specifiable smoothness/roughness. For the layman, let\u0027s drag out the Unity PBR chart...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022UnitySpecularChart.png\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022https://blogs.unity3d.com/wp-content/uploads/2014/11/UnitySpecularChart.png\u0022 width=\u0022543\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEffectively, that Smoothness value can only be specified on a per-mesh basis. This means that we lack the tools to create variable glossiness in a part - we have to split the meshes and do different materials if we even want to try. This sucks and really limits the range of realistic metals we can provide - it is all or nothing. With some hacky tweaking, you can kinda affect this with the spec map, but really, it does not have a good enough result to build a full part workflow around it. I tried, believe me. It\u0027s the key reason why, for example, the metallic 2.5m tanks that Restock ships aren\u0027t reflective - the results without variable roughness were not what I\u0027d want them to be. So what can we do without variable smoothness? In my experiments:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBrushed aluminum is ok\n\u003C/li\u003E\n\u003Cli\u003E\nObviously foil (though roughness would help here)\n\u003C/li\u003E\n\u003Cli\u003E\nThings we want ultra-shiny and chrome\n\u003C/li\u003E\n\u003Cli\u003E\nPurely reflective things, like solar panels and windows. \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nEffectively, in its current state, I think PBR is best used as a tool to represent a new set of surfaces, some of which were not realizable before, but is not a viable, fully usable art asset workflow. Every upgrade to KSP\u0027s art pipeline gets us closer to solving this and having access a native full PBR approach. Maybe we\u0027ll get roughness in 1.9 or something - but not holding my breath. You might argue, this is all solveable by bundling TU. Again though - we need to consider the whole of the game, and even if we have native roughness support, the visual cohesion of a full (or partial) PBR conversion is going to be a problem. That said, everything I\u0027ve built from the beginning of Restock has support for a full PBR path at least in theory - it requires a bunch of work, but the psds have been constructed such that creating proper albedo, specular and roughness maps is something that is doable without a full repaint. So it\u0027s an option to keep in the back pocket for the far future. \n\u003C/p\u003E\n\u003Cp\u003E\nSpecifically, what \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/109593-electrocutor/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022109593\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/109593-electrocutor/\u0022 rel=\u0022\u0022\u003E@Electrocutor\u003C/a\u003E has done is copy the diffuse map to the albedo and specular channels - observe the chart above (also albedo != diffuse, but you know that for sure). This produces results like reflective paint on the hub\u0027s handles, which is well, off-putting. Additionally the windows there are dark in the diffuse As \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/20296-neistridlar/\u0026amp;do=hovercard\u0022 data-mentionid=\u002220296\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/20296-neistridlar/\u0022 rel=\u0022\u0022\u003E@neistridlar\u003C/a\u003E pointed out, you\u0027d have slightly better results using the information in the alpha channel as the specular, but because the Mapped shader sucks and the alpha channel is monochromatic, this is not going to work well (and would require actually exporting the alphas to a new file). This solution well... I think this is why people don\u0027t like it. It\u0027s not because we don\u0027t like reflecting metal, it\u0027s because as picky artists, we can see in our minds what it would look like with the full set of surface data and feel sad. I prefer a handcrafted, well engineered blinn-phong workflow to the half-measures we currently have access to as per my giant blob of text above.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTL:DR - KSP\u0027s PBR sucks and even if it was great, really doesn\u0027t match the rest of the game without a comprehensive environmental revamp. \n\u003C/p\u003E\n"},{"CreatedByName":"cineboxandrew","CreatedById":63646,"CreatedDateTime":"2019-04-17T17:49:40Z","Content":"\n\u003Cp\u003E\nI have messed around with a drop-in replacement for the built in shaders that attempts to convert them to PBR, but haven\u0027t been able to figure out how to get them in-game\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-04-17T19:45:30Z","Content":"\n\u003Cp\u003E\nI wouldn\u0027t mind an environment revamp, as a companion mod, though I\u0027m not sure if it\u0027s a realistic proposition due to how much work it\u0027d be. The existing visual mods help, but they don\u0027t use PBR. Even disregarding issues with art style compatibility (which we might, Squad doesn\u0027t seem concerned with that, either \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E) KSP\u0027s planets suck as much as stock parts, if not more. That\u0027s why I found designing spacecraft much more fun than exploring the system with them. The planets look just too bland, and even with \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E and Scatterer they look their best from orbit.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-17T19:46:42Z\u0022 title=\u002204/17/2019 07:46  PM\u0022 data-short=\u00225 yr\u0022\u003EApril 17, 2019\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2019-04-19T02:29:58Z","Content":"\n\u003Cp\u003E\nhey Nertea, I really like these new part but they are a few parts that I prefer the stock textures for a few parts like the original mk-1 rocket fuel tanks(flt-800). can you tell me how you can bring back the original texture for certain parts? \n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2019-04-19T05:16:34Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/196943-spaceface545/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022196943\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/196943-spaceface545/\u0022 rel=\u0022\u0022\u003E@SpaceFace545\u003C/a\u003E They have provided an excellent wiki with instructions on how to do exactly what you want on the Github Wiki.\u003Cbr\u003E\nits a lot of reading, but its a super simple method, and will take you longer to read it, than to make your own whitelist of selected parts. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nhere it is:\u003Cbr\u003E\u003Ca href=\u0022https://github.com/PorktoberRevolution/ReStocked/wiki/Asset-Blacklist-and-Whitelist\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/PorktoberRevolution/ReStocked/wiki/Asset-Blacklist-and-Whitelist\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2019-04-19T20:44:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223586479\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555650994\u0022 data-ipsquote-userid=\u002277721\u0022 data-ipsquote-username=\u0022Stone Blue\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Stone Blue said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/196943-spaceface545/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022196943\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/196943-spaceface545/\u0022 rel=\u0022\u0022\u003E@SpaceFace545\u003C/a\u003E They have provided an excellent wiki with instructions on how to do exactly what you want on the Github Wiki.\u003Cbr\u003E\nits a lot of reading, but its a super simple method, and will take you longer to read it, than to make your own whitelist of selected parts. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nhere it is:\u003Cbr\u003E\u003Ca href=\u0022https://github.com/PorktoberRevolution/ReStocked/wiki/Asset-Blacklist-and-Whitelist\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/PorktoberRevolution/ReStocked/wiki/Asset-Blacklist-and-Whitelist\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks alot\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2019-04-19T20:52:00Z","Content":"\n\u003Cp\u003E\nhow can you create a whitelist file it isn\u0027t that clear in the GitHub wiki\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2019-04-20T00:26:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223586769\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555707120\u0022 data-ipsquote-userid=\u0022196943\u0022 data-ipsquote-username=\u0022SpaceFace545\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, SpaceFace545 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhow can you create a whitelist file it isn\u0027t that clear in the GitHub wiki\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, you can use any plain text editor to \u0022write\u0022 the file in (NotePad, or Wordpad will work).\u003Cbr\u003E\nThen save as, using the file extension .restockwhitelist instead of .txt\u003Cbr\u003E\nFile can be saved anywhere in your /GameData folder.\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2019-04-20T00:36:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223586859\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555720018\u0022 data-ipsquote-userid=\u002277721\u0022 data-ipsquote-username=\u0022Stone Blue\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Stone Blue said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOh, you can use any plain text editor to \u0022write\u0022 the file in (NotePad, or Wordpad will work).\u003Cbr\u003E\nThen save as, using the file extension .restockwhitelist instead of .txt\u003Cbr\u003E\nFile can be saved anywhere in your /GameData folder.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks again \n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2019-04-20T13:37:31Z","Content":"\n\u003Cp\u003E\nIf you dont mind can you provide a blank whitelist file in the next version of restock because I\u0027m trying to make one but it is ignoring it and still loads the models\n\u003C/p\u003E\n"},{"CreatedByName":"Brigadier","CreatedById":147109,"CreatedDateTime":"2019-04-20T19:22:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223587051\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555767451\u0022 data-ipsquote-userid=\u0022196943\u0022 data-ipsquote-username=\u0022SpaceFace545\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, SpaceFace545 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you dont mind can you provide a blank whitelist file in the next version of restock because I\u0027m trying to make one but it is ignoring it and still loads the models\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhy don\u0027t you post the file here, along with a screen shot of where you put it, and the experts can have a look.  The best way is to use a file sharing site, such as Imgur, Dropbox or Google Drive, and post the links to them.\n\u003C/p\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2019-04-20T21:40:20Z","Content":"\n\u003Cp\u003E\nWhitelisting the old model/textures isn\u0027t sufficient - you also need to remove the Restock patch which uses the new stuff on the actual part.\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2019-04-20T22:37:40Z","Content":"\n\u003Cp\u003E\nSo I set up a restock whitelist file to bring back some of the original Squad textures but, it isn\u0027t working. I put links below to the restock file and what my whitelist file looks like.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/gFA5bSz\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/gFA5bSz\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/9JcEq12\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/9JcEq12\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Tonka Crash","CreatedById":189552,"CreatedDateTime":"2019-04-21T02:44:10Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/196943-spaceface545/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022196943\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/196943-spaceface545/\u0022 rel=\u0022\u0022\u003E@SpaceFace545\u003C/a\u003E Your problem isn\u0027t just a whitelist issue only. The whitelist only controls whether or not the Squad assets are loaded and available for other parts. To actually use the Squad parts instead of the Restock version, you also have to change the .cfg file Restock uses to replace the Squad model and textures.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the FL-T800 this is in GameData\\Restock\\Patches\\FuelTank\\restock-fueltanks-125.cfg. If you want all Squad Tanks instead of Restock in this size, just change the file extension from .cfg to .txt. It\u0027s easy to go back if you change your mind. If you only want some of them, you\u0027ll have to edit the .cfg file to comment out the sections you don\u0027t want. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso you will have to remember to do this every time you update Restock.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SpaceFace545","CreatedById":196943,"CreatedDateTime":"2019-04-21T12:48:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223587329\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555814650\u0022 data-ipsquote-userid=\u0022189552\u0022 data-ipsquote-username=\u0022Tonka Crash\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Tonka Crash said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/196943-spaceface545/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022196943\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/196943-spaceface545/\u0022 rel=\u0022\u0022\u003E@SpaceFace545\u003C/a\u003E Your problem isn\u0027t just a whitelist issue only. The whitelist only controls whether or not the Squad assets are loaded and available for other parts. To actually use the Squad parts instead of the Restock version, you also have to change the .cfg file Restock uses to replace the Squad model and textures.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the FL-T800 this is in GameData\\Restock\\Patches\\FuelTank\\restock-fueltanks-125.cfg. If you want all Squad Tanks instead of Restock in this size, just change the file extension from .cfg to .txt. It\u0027s easy to go back if you change your mind. If you only want some of them, you\u0027ll have to edit the .cfg file to comment out the sections you don\u0027t want. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso you will have to remember to do this every time you update Restock.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat do I do to the .cfg file if I only want a few of the squad textures like the terrier engine but keep the restock textures for the swivel and the reliant engines.\n\u003C/p\u003E\n"},{"CreatedByName":"Tonka Crash","CreatedById":189552,"CreatedDateTime":"2019-04-21T12:57:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223587454\u0022 data-ipsquote-contentid=\u0022182679\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555850925\u0022 data-ipsquote-userid=\u0022196943\u0022 data-ipsquote-username=\u0022SpaceFace545\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, SpaceFace545 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat do I do to the .cfg file if I only want a few of the squad textures like the terrier engine but keep the restock textures for the swivel and the reliant engines.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOpen the appropriate .cfg file (restock-engines-liquid-125.cfg) in a text editor and either delete or comment out the sections that do you don\u0027t want. The .cfg files are pretty well documented. Comments are anything after a double slash \u0027//\u0027.  If you are not familiar with editing config files, copy a backup to your desktop, just in case you make mistakes and need to go back.\n\u003C/p\u003E\n"},{"CreatedByName":"HansonKerman","CreatedById":185809,"CreatedDateTime":"2019-04-22T18:46:24Z","Content":"\n\u003Cp\u003E\n\u003Cfont face=\u0022Lucida Sans Unicode, Lucida Grande, sans-serif\u0022\u003EWOAH! Amazing content! I only just discovered this, and \u003C/font\u003E\u003Cfont face=\u0022Lucida Sans Unicode, Lucida Grande, sans-serif\u0022\u003E\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E WOW does this seem awesome! I\u0027ll be sure to get this (as soon as it updates). \u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon2.png\u0022 title=\u0022:o\u0022\u003E\u003C/font\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Barzon","CreatedById":185383,"CreatedDateTime":"2019-04-22T20:56:45Z","Content":"\n\u003Cp\u003E\nIt works fine with 1.7 \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/185809-hansonkerman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022185809\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/185809-hansonkerman/\u0022 rel=\u0022\u0022\u003E@HansonKerman\u003C/a\u003E \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E. The only bug I can think of is the revamped engines, and \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E not using the ReStock models and textures\u003C/span\u003E\n\u003C/p\u003E\n"}]}