{"TopicId":19082,"ForumId":34,"TopicTitle":"cBBp Dragon Rider Pod/Capsule","CreatedByName":"CardBoardBoxProcessor","CreatedById":10179,"CreatedDateTime":"2012-09-11T18:51:34Z","PageNum":3,"Articles":[{"CreatedByName":"drwolf","CreatedById":29259,"CreatedDateTime":"2012-09-12T23:08:49Z","Content":"\n\u003Cp\u003Elove the pod \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E and thanks for all the hard werk. \u003C/p\u003E\u003Cp\u003Eps can whe get sume parachutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E for it.\u003C/p\u003E\n"},{"CreatedByName":"CAPFlyer","CreatedById":8575,"CreatedDateTime":"2012-09-12T23:11:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EAnother niggle: the dome fairing fires of in front of the spacecraft, and sometimes hits you when you accelerate. A split fairing would be better (and would allow to mount a docking adapter or a spare chute under the fairing.\u003Cp\u003EThere also seems to be some kind of light source inside the pod. On my screen, it washes out the capsule and the faces of the Kerbals.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe dome is supposed to be solid. Simpler/lighter that way. Like was suggested, simply move off-vector to release it out of your flight path. That\u0027s how the real one gets removed too, a slight pitch maneuver.\u003C/p\u003E\n"},{"CreatedByName":"Stalvet","CreatedById":27689,"CreatedDateTime":"2012-09-13T15:37:58Z","Content":"\n\u003Cp\u003EThank you for a wonderful add-on. I tried to create the capsule, but it is impossible to correctly install RCS. Is it possible to make a video for the assembly (how to collect the capsule use of the parts)?\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2012-09-13T16:12:33Z","Content":"\n\u003Cp\u003EYou can\u0027t build it yourself. You need to load the .craft file.\u003C/p\u003E\n"},{"CreatedByName":"Stalvet","CreatedById":27689,"CreatedDateTime":"2012-09-13T19:24:36Z","Content":"\n\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Ok. Thanks\n"},{"CreatedByName":"CardBoardBoxProcessor","CreatedById":10179,"CreatedDateTime":"2012-09-13T21:30:46Z","Content":"\n\u003Cp\u003EJust load the craft man. Hopefully it is just temporary till more part modules happen. but just load the craft\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2012-09-13T22:01:02Z","Content":"\n\u003Cp\u003EYES! minimus! i made it to minimus! a bit hard to get there, but it all went well. amazingly, the timing was perfect, i didnt have to wait, i just burned my enginge addmetiatley and got to minimus. PLUS! i had and amazing view of mun and kerbin. O_O ive never had so precise timing!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i47.tinypic.com/wl8z7c.png\u0022 alt=\u0022wl8z7c.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, i didnt just have the capsule, i had underneath it a spacedock part (for base \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E) and a cart. heres a tip: make sure you land perfectly if you jump. if not, it will tumble.\u003C/p\u003E\u003Cp\u003EI tumbled, and sas modules, thrusters, rcs blocks, broke off. thankfully, the capsule, spacedock and the rover survived. i tried to brake and went tumblnig more. but stilll all intact. Well, Have a nice day on minimus kerbs! ill post craft file. (needs ANVIL and some orange sas thingys (for extra support during launch) (forget where it came from) )\u003C/p\u003E\u003Cp\u003E[ATTACH]32870[/ATTACH]\u003C/p\u003E\u003Cp\u003EAnd of course, the Orbital construction mod and cart mod \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Space_Coyote","CreatedById":37107,"CreatedDateTime":"2012-09-14T02:13:13Z","Content":"\n\u003Cp\u003EWell I downloaded and tried the pod out and i must say it\u0027s very impressive..\u003C/p\u003E\u003Cp\u003ENow as for suggestions as to how to improve the item.. Maybe I can help a little with some constructive help\u003C/p\u003E\u003Cp\u003EThe Additional Kerbalnauts: Now I noticed when I loaded the file and got it out to the launch pad it seems that 4 of the Kerbalnauts show up on screen (while the other 3 do not.. Also other than the three located in the lower right corner of the screen, the 4th Kerbalnaut (and I\u0027m guessing the 5th, 6th, and 7th, showed up in the upper left hand corner of the screen. And therein the trouble lies.\u003C/p\u003E\u003Cp\u003EFor the Kerbal(s) in the upper right corner cover the warp and the MET timer.. so if you wanted to manually warp your ship (instead of using the Mechjeb Warp system), you could accidentally shove one of the Kerbalnauts out into the void of space... and we don\u0027t want 6 people to land on the Mun or Minmus in the future.. but hopefully all 7..\u003C/p\u003E\u003Cp\u003ESecond, maybe a \u0022redundancy\u0022 parachute is in order, just in case of an emergency abort to orbit.. A simple radial chute placement and the capsule is then 100% safe (it\u0027s not that I don\u0027t like using the Main engine feature), but if you run low on fuel, you may actually run out, and thus plummet those hapless Kerbalnauts to their doom.\u003C/p\u003E\u003Cp\u003EOther than that, the capsule handles well and I like the retractable gear I think with the appropriate pieces the dragon Rider is a fine addition to the system of capsules already out there..\u003C/p\u003E\u003Cp\u003ESo I give this one a Jebadiah Thumbs up! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2012-09-14T05:29:45Z","Content":"\n\u003Cp\u003EYou can just edit the cfg to set the CrewCapacity to 3. Dragon can shuttle 7 people to the space station, but you wouldn\u0027t want to be cramped like that for a Mun mission.\u003C/p\u003E\u003Cp\u003EI stick on a service module containing RCS fuel. The internal fuel is only used for deorbit and landing so no risk of running out.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img821/9739/screenshot23cy.png\u0022 alt=\u0022screenshot23cy.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-15T06:09:56Z\u0022 title=\u002209/15/2012 06:09  AM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 15, 2012\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CardBoardBoxProcessor","CreatedById":10179,"CreatedDateTime":"2012-09-14T17:03:01Z","Content":"\n\u003Cp\u003Eyeah i jsut noticed the slowing down thing. no idea wtf would cause that :/\u003C/p\u003E\n"},{"CreatedByName":"Grand Lander","CreatedById":31521,"CreatedDateTime":"2012-09-15T03:06:19Z","Content":"\n\u003Cp\u003EDislike this mod\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2012-09-15T06:13:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grand Lander\u0022 data-cite=\u0022Grand Lander\u0022\u003E\u003Cdiv\u003EDislike this mod\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs that supposed to be constructive criticism?\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2012-09-15T06:22:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grand Lander\u0022 data-cite=\u0022Grand Lander\u0022\u003E\u003Cdiv\u003EDislike this mod\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you run into any problems or was it something else?\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2012-09-15T21:34:25Z","Content":"\n\u003Cp\u003EI found a little bug that tripped me up when I tried to edit the CrewCapacity of this capsule in the part.cfg\u003C/p\u003E\u003Cp\u003EWhen I edited it the first time, i found the CrewCapacity = 7 line, and changed it to 3, but when i loaded up the Dragon_Rider.craft file again in KSP, \u003Cem\u003Eit still had 7 kerbals in it!!!\u003C/em\u003E That threw me for a bit of a loop, but i found the issue when I looked at the .cfg again, problem is, it calls out CrewCapacity = 7 in two different lines! (thar\u0027s yer problem!) so, i removed the first \u0022CrewCapacity = 7\u0022 line (the one i changed the first time) and changed the second one to 3, and that fixed it.\u003C/p\u003E\u003Cp\u003EI\u0027m alright with having a 3-seater Dragon Rider capsule, but a 7 seat version would be even better. Hold on, hold on, I can already hear you asking \u0022but you just had that! Why did you change it from 7 seats to 3 if you want 7 to begin with?\u0022 and the answer is simple, really. I changed it because, quite frankly, the present state of the UI means that it looks fine when you have 3 or less kerbals in a pod, but it if you try to put in any more than that, it \u0022works\u0022, but TBH, it looks ugly, not to mention that it covers up the Time-warp/MET timer portion of the UI (as others have said).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EI have an idea for how to fix the UI to allow more than 3 kerbals to be displayed in the lower-right corner, but it has problems.\u003C/p\u003E\u003Cp\u003EI know one problem with this solution, and that is \u003Cem\u003EI have no idea if it is even possible\u003C/em\u003E to move or rescale the crew portraits in 0.16 or any future version.\u003C/p\u003E\u003Cp\u003E I suspect that the problem is that the crew portraits locations have been hard-coded into the CommandPod PartModule, and that the positions of the portrait for crewmembers 4 and up is simply undefined, so they default to being placed at x=0, y=0 (which in this case, happens to be the upper-left corner). \u003C/p\u003E\u003Cp\u003EIf there was a way to define the position and scale of the crew portraits in the .cfg, that would solve the issue.\u003C/p\u003E\u003Cp\u003EThat could be handled by 2 new lines in the part.cfg, and they \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eonly need to be used if the command pod has more than 3 seats\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003EThe first new line would be:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EforceCustomPortraitPositions = (true/false)\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethis tells the game that you want to define the crew portrait positions yourself, if its not there, or if it is set to false, the game acts the same as it does now.\u003C/p\u003E\u003Cp\u003EThe second new line would be:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EcrewPic_\u0022name\u0022 =  v, w, x, y\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethis line tells the game what order to fill the crew portraits in, how big they are, and where to put them, broken down like so:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Ev = Seat Priority, valid values are integers 1 and up. This tells the game what order to fill the images in, 1= filled first, 2= filled 2nd, etc \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ew = Image Scale, valid values are nonzero decimals from 0 to 1 inclusive. This tells the game how much to scale down the image, 1.0 = full size, 0.5= half size, etc. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ex = Horizontal Position, y= Vertical Position, valid values are any decimal from 0 to 1 inclusive. This tells the game where to put the image in the UI, (0.0, 0.0) is the upper-left-hand corner, (0.5, 0.5) is the center of the screen, (0.0, 0.5) is the center-left, etc. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis is not how it works currently, (to my knowledge) but I took cues from how values and flags are assigned for other variables in other partModules, and would hopefully be more \u0022familiar\u0022 to someone already used to editing .cfg files\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"willow","CreatedById":13072,"CreatedDateTime":"2012-09-15T21:55:28Z","Content":"\n\u003Cp\u003EGood points SciMan... That throws me too all the time I put more than 3 kerbals in a rocket with whatever mod. The idea is awesome. But the messed up ui is too much of a penalty. I too changed the number of kerbals down to 3. Perhaps the squad guys will fix it. And then more IS better!!!\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-09-15T22:17:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grand Lander\u0022 data-cite=\u0022Grand Lander\u0022\u003E\u003Cdiv\u003EDislike this mod\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery constructive. I like your very well written criticism. I am certain you have changed CardboardBoxProcessor\u0027s point of view.\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2012-09-15T22:58:30Z","Content":"\n\u003Cp\u003Eindeed, i think it would probably take the Squad guys providing some way to move and rescale the crew portraits, but it might also be doable with a plugin, but i have no idea if that is possible in 0.16 or not\u003C/p\u003E\n"},{"CreatedByName":"CardBoardBoxProcessor","CreatedById":10179,"CreatedDateTime":"2012-09-16T00:02:25Z","Content":"\n\u003Cp\u003Eyou do it then.\u003C/p\u003E\n"},{"CreatedByName":"Sbowyer28","CreatedById":4338,"CreatedDateTime":"2012-09-16T00:46:18Z","Content":"\n\u003Cp\u003ENice Red Dragon Mockup for KSP, All we need is Mars (Or Duna) You should make a Falcon Heavy for this Or Rescale your old parts.\u003C/p\u003E\n"},{"CreatedByName":"John Bedlam","CreatedById":36337,"CreatedDateTime":"2012-09-22T07:46:10Z","Content":"\n\u003Cp\u003EI really like this thing, but the engine might be a little too efficient.\u003C/p\u003E\u003Cp\u003EI strapped two of the new large RCS tanks to it. It made it into orbit. It made it to Duna. It landed. It went back into Duna orbit. It then made it back into Kerbin\u0027s SOI before I had to dump the external tanks. The capsule itself had more than enough left for the final aerocapture and precision landing at KSC, which is the only part of this journey that\u0027s realistic.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E[ATTACH=CONFIG]33251[/ATTACH]\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Lazurkri","CreatedById":16624,"CreatedDateTime":"2012-09-22T08:21:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John Bedlam\u0022 data-cite=\u0022John Bedlam\u0022\u003E\u003Cdiv\u003EI really like this thing, but the engine might be a little too efficient.\u003Cp\u003EI strapped two of the new large RCS tanks to it. It made it into orbit. It made it to Duna. It landed. It went back into Duna orbit. It then made it back into Kerbin\u0027s SOI before I had to dump the external tanks. The capsule itself had more than enough left for the final aerocapture and precision landing at KSC, which is the only part of this journey that\u0027s realistic.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E[ATTACH=CONFIG]33251[/ATTACH]\u003C/p\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Have you considered that since its already a pain in the ass to GET to Duna in the first place that its not a bug but careful planning that I\u0027m thanking Cardboard for? Dragonrider is thus far the only craft I can get to Duna without failing badly, even with Mechjeb ( Mechjebs \u0022Transfer\u0022 Option for some reason shatters my ships if they\u0027re too big)\u003C/p\u003E\n"},{"CreatedByName":"John Bedlam","CreatedById":36337,"CreatedDateTime":"2012-09-22T08:31:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lazurkri\u0022 data-cite=\u0022Lazurkri\u0022\u003E\u003Cdiv\u003EHave you considered that since its already a pain in the ass to GET to Duna in the first place that its not a bug but careful planning that I\u0027m thanking Cardboard for? Dragonrider is thus far the only craft I can get to Duna without failing badly, even with Mechjeb ( Mechjebs \u0022Transfer\u0022 Option for some reason shatters my ships if they\u0027re too big)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDuna is supposed to be a little difficult to get to, it\u0027s a whole other planet. I think it\u0027s unreasonable for a ship like the one I attached to get from the surface of Kerbin to the surface of another planet and back to Kerbin. Note that there isn\u0027t a lifter stage attached at all, it\u0027s using those tiny little capsule engines and less than 2500 units of RCS fuel for the entire trip. It\u0027s a fun ship, but its performance is absolutely ludicrous.\u003C/p\u003E\n"},{"CreatedByName":"Lazurkri","CreatedById":16624,"CreatedDateTime":"2012-09-22T09:06:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John Bedlam\u0022 data-cite=\u0022John Bedlam\u0022\u003E\u003Cdiv\u003EDuna is supposed to be a little difficult to get to, it\u0027s a whole other planet. I think it\u0027s unreasonable for a ship like the one I attached to get from the surface of Kerbin to the surface of another planet and back to Kerbin. Note that there isn\u0027t a lifter stage attached at all, it\u0027s using those tiny little capsule engines and less than 2500 units of RCS fuel for the entire trip. It\u0027s a fun ship, but its performance is absolutely ludicrous.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Wait, you used nothing but the CAPSULES ENGINES the whole way?! ****, okay, then yes, that is a little OP. I\u0027ve never noticed since by default I mount a giant assed launcher underneath it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-22T09:09:19Z\u0022 title=\u002209/22/2012 09:09  AM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 22, 2012\u003C/time\u003E by Lazurkri\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2012-09-22T09:22:58Z","Content":"\n\u003Cp\u003EThe engines should be reduced to something 4x30 instead of 4x50, and the fuel consumption should be doubled. The internal fuel should really only be enough to deorbit and land. Anything else should require a service module for the extra RCS fuel.\u003C/p\u003E\n"},{"CreatedByName":"John Bedlam","CreatedById":36337,"CreatedDateTime":"2012-09-22T09:54:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lazurkri\u0022 data-cite=\u0022Lazurkri\u0022\u003E\u003Cdiv\u003EI\u0027ve never noticed since by default I mount a giant assed launcher underneath it.\u003C/div\u003E\u003C/blockquote\u003EWhat can I say? I aim to misbehave.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThe engines should be reduced to something 4x30 instead of 4x50, and the fuel consumption should be doubled. The internal fuel should really only be enough to deorbit and land. Anything else should require a service module for the extra RCS fuel.\u003C/div\u003E\u003C/blockquote\u003EI agree. Those changes should make my example incapable of Kerbin launches, yet still a somewhat viable Duna lander and return vehicle, if flown properly.\n"}]}