{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":440,"Articles":[{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-09-05T23:23:19Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@CrisK: \u003C/strong\u003EAnd I am telling you, no I cannot reproduce deploying/undeploying gear changing AoA, and the graphs that you are showing in the latest pictures are correct. I have been unable to create any vehicle that suffers from the issues you describe in the dev build. AFAICT, there are no issues to solve.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@123nick: \u003C/strong\u003EYes, and I believe them just as much as the people who were saying the original 0.23.5 win64 hack was stable. Those people downplayed and made excuses for any instability, blaming mods for all of it, and I know that the same will occur now. No win64 support from FAR until a confirmed-stable official win64 KSP build exists.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Johnhii: \u003C/strong\u003EIt works perfectly fine assuming you follow the instructions in the message and place the mod directory in the correct place. That\u0027s why that message is there; to tell you \u003Cem\u003Ehow\u003C/em\u003E to make it work correctly.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@zomos: \u003C/strong\u003ERead the first post; CKAN installs are not supported here thanks to frequent screwups on their part. Go complain to them, not me.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-09-05T23:51:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnhiii\u0022 data-cite=\u0022Johnhiii\u0022\u003E\u003Cdiv\u003EDoes this mod work with steam on macs? I cant get it to work as there is a file in the folder that is not working with the my KSP. I tried removing all my other mods but still get \u003Ca href=\u0022https://imgur.com/NRYxeqH\u0022 rel=\u0022external nofollow\u0022\u003Ethis message\u003C/a\u003E.\u003C/div\u003E\u003C/blockquote\u003EYou\u0027ve got\u003Cp\u003E(ksp folder)/GameData/GameData/FerramAerospaceResearch\u003C/p\u003E\u003Cp\u003Eand you *should* have \u003C/p\u003E\u003Cp\u003E(ksp folder)/GameData/FerramAerospaceResearch\u003C/p\u003E\n"},{"CreatedByName":"123nick","CreatedById":27488,"CreatedDateTime":"2015-09-06T00:08:36Z","Content":"\n\u003Cp\u003Ebut you see, im using the ksp 64 unfixer, which makes all mods which disable themselves on 64-bit ksp to not disable themselves. it worked with FAR, and it worked when i flew a pre-built airplane. but when i tried building a new one, the center of lift didn\u0027t show up, i got arithmetic exceptions, and an out of index or array exception, or similar, and the calculate aoa button didn\u0027t work either.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-09-06T00:11:49Z","Content":"\n\u003Cp\u003ESo, let\u0027s review.\u003C/p\u003E\u003Cp\u003EFAR doesn\u0027t support win64 \u003Cem\u003Ebecause win64 is buggy.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESo you used someone else\u0027s hack to get around that lock, and now you\u0027re claiming things are buggy?\u003C/p\u003E\u003Cp\u003EDo you see the problem here?\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-09-06T00:27:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022123nick\u0022 data-cite=\u0022123nick\u0022\u003E\u003Cdiv\u003Ebut you see, im using the ksp 64 unfixer, which makes all mods which disable themselves on 64-bit ksp to not disable themselves. it worked with FAR, and it worked when i flew a pre-built airplane. but when i tried building a new one, the center of lift didn\u0027t show up, i got arithmetic exceptions, and an out of index or array exception, or similar, and the calculate aoa button didn\u0027t work either.\u003C/div\u003E\u003C/blockquote\u003EAn excellent demonstration of why ferram doesn\u0027t support Windows 64-bit versions of KSP, and indeed why \u003Cem\u003ESquad\u003C/em\u003E stopped supporting it or even releasing it with 1.0.\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-09-06T04:39:50Z","Content":"\n\u003Cp\u003EI originally posted this on the DRE forum thinking my heating issue was related to that mod. But with some assistance from Starwaster, it looks like the problem is actually with FAR. Here\u0027s what I\u0027m experiencing. I\u0027m playing with RO/RSS/RP0, all their respective required mods and most of their suggested mod (plus FASA). I recently upgraded from FAR 0.15.4.1 to 0.15.5. Prior to the upgrade, I had successfully launch and recovered 6 Mercury Atlas rockets. After upgrading to 0.15.5, however, I launched a 7th and have been experiencing issues during recovery. Reentry seems to be going initially fine. Skin temp will slowly increase from space to around 1600 at 62km (speed: 7km/s, vert speed: -238m/s, 2.1375g). At this point, skin temp starts to slowly drop until its down to under 1350 at just over 50.5km (speed: 5.6km/s, vert speed: -305m/s, 5.1374g). But as soon as I hit 50.5km, skin temp immediately jumps back up to over 1950 and begins climbing. Without the \u0022Ignore Max Temperature\u0022 cheat turned on, the Mercury capsule explodes moments after falling below 50.5km do to overheating. With the cheat turned on, skin temp continues to climb until it peaks at about 2550 at 45.6km. Obviously, the issue is this phantom \u002B600 in skin temp that seems to be added as soon as I hit 50.5km. \u003C/p\u003E\u003Cp\u003EIf I remove FAR and reinstall the older 0.15.4.1 version (and Starwaster was using 0.15.3 which worked for him), then reload the exact same save that resulted in the failed reentry above, the reentry works just fine. The Mercury pods skin temp slowly increases to just shy of 1700 but that doesn\u0027t happen until I\u0027m already below 15.5km. And when skin temp starts to fall, it never has any sudden increase and makes it all the way down to the ground. I don\u0027t know enough about modding to have the first clue as to what changed between 0.15.4.1 and 0.15.5 that might be causing this strange heating issue, but I wanted to report it so it can be investigated.\u003C/p\u003E\n"},{"CreatedByName":"zomos","CreatedById":147495,"CreatedDateTime":"2015-09-06T10:13:15Z","Content":"\n\u003Cp\u003EYou say the FAR is unsupported when downloaded from CKAN. I got rid of FAR installed with CKAN. Downloaded the FAR \u0022Haack\u0022 and installed it manually. Nothing has changed. The plane gets rip apart due too aerodynamic stress for no reason, randomly during flight. Sometimes at 40km sometimes at start. I made a 3 videos of this happening. A lot of FAR null reference errors. Sometimes it drops a few parts... I even removed the thermalnuclear jets cause I thought they can be the reason... at 40 km the plane ripped apart and dropped the gears at lift off... I flew it gently.\u003C/p\u003E\u003Cp\u003EWith last FAR about 3 weeks ago when i played it was ok...\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/0VuTP4D_FFg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/VdHv_G-ToXM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003Ewithout thermalnuclear engine rips at ~40km...\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/2pRHFG8KKKg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003EEvery single plane rips apart at some point...\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EMost of my planes use the OPT parts such engines. Removed the OPT ScramJet Engine and no log issues. Also no problem with catastrophic failures at flight. How to make the OPT Space Plane parts repaired ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-06T12:11:26Z\u0022 title=\u002209/06/2015 12:11  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 6, 2015\u003C/time\u003E by zomos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zomos","CreatedById":147495,"CreatedDateTime":"2015-09-06T14:01:58Z","Content":"\n\u003Cp\u003ESome nasty thing happen when i put the OPT TurboRamJet on a plane... Even at runaway when standing there are multiple errors... While flying no matter using the OPT engine or not. At some random point your plane will be broken to pieces... Without the part everything is ok... \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/97525-1-0-4-WIP-OPT-Space-Plane-v1-7?p=2181308\u0026amp;viewfull=1#post2181308\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/97525-1-0-4-WIP-OPT-Space-Plane-v1-7?p=2181308\u0026amp;viewfull=1#post2181308\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"CrisK","CreatedById":133945,"CreatedDateTime":"2015-09-06T14:49:09Z","Content":"\n\u003Cp\u003EFerram, I\u0027m not sure what I can do to convince you. Here\u0027s a series of screenshots.\u003C/p\u003E\u003Cp\u003EPlane A. I can raise and lower the landing gear and the AoA chart is the same. I can load the file, raise and lower the landing gear, and the chart remains consistent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HHQONrh.png\u0022 alt=\u0022HHQONrh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPlane B. This is the exact same body and wings. The bug has occurred, god knows why. The body is identical in every way other than BDArmory missiles being added.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/P1COU6v.png\u0022 alt=\u0022P1COU6v.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow if I reload plane A I get this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LThw10e.png\u0022 alt=\u0022LThw10e.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAgain, that\u0027s the same craft file. Then every time I raise and lower the gear I get a different graph.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jxSAmhA.png\u0022 alt=\u0022jxSAmhA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow if I load craft C, a completely different design, the same graph shows.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ssXZejJ.png\u0022 alt=\u0022ssXZejJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is craft C\u0027s graph when the bug is NOT occurring. I can raise and lower the landing gear all day, reload the craft, etc. and the analysis remains consistent:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pNphkhv.png\u0022 alt=\u0022pNphkhv.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"123nick","CreatedById":27488,"CreatedDateTime":"2015-09-06T16:03:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EAn excellent demonstration of why ferram doesn\u0027t support Windows 64-bit versions of KSP, and indeed why \u003Cem\u003ESquad\u003C/em\u003E stopped supporting it or even releasing it with 1.0.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou know, i think your right. i should probably just dualboot linux, run ksp 64bit on that, and then play ksp 64bit with all the cool mods.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-09-06T18:47:03Z","Content":"\n\u003Cp\u003ECan someone tell me how to change the speed from m/s to km/h?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-09-06T20:46:47Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@zomos: \u003C/strong\u003E1) OPT does not appear to have any nuclear thermal jet parts, so until you tell me which mod includes that, I can\u0027t hope to test what\u0027s up with that part.\u003C/p\u003E\u003Cp\u003E2) The remaining OPT parts show no issues and I could not reproduce any errors with them.\u003C/p\u003E\u003Cp\u003EYour reproduction steps are incomplete; provide more complete steps and a problem craft file with no extra mod parts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@CrisK: \u003C/strong\u003EHere\u0027s what you can do: provide reproduction steps that function. Absolutely none of yours have. I covered a plane in BDArmory missles seeking differences after loading and the only difference I found is that I had added enough missiles for them to interfere with the lift on the wing they were mounted under; other than that, nothing. Provide your craft files with every non-necessary mod part removed, and complete and exact reproduction steps. As of right now, I haven\u0027t managed to reproduce anything that indicates that there is an issue.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Veeltch: \u003C/strong\u003EFAR GUI in flight -\u0026gt; Settings -\u0026gt; Dropdown -\u0026gt; AirSpeed Settings\u003C/p\u003E\n"},{"CreatedByName":"zomos","CreatedById":147495,"CreatedDateTime":"2015-09-06T22:15:57Z","Content":"\n\u003Cp\u003E@ferram4: Maybe I spoke unclear sorry. Problem is with OPT TurboRamJet. Not tried other OPT parts with FAR \u0022Haack\u0022 yet. Thermalnuclear is other mod I thought was causing the issue(beta version). Other engines than OPT, stock or mods work good and I do not get random catastrophic failures in-flight.... OPT TurboRamJet causes the problem even when it is not working. It is needed to only have OPT TurboRamJet attached and I get plane broken in multiple parts at random time. I will try to make logs next time i will play. When I have OPT TurboRamJet attached to any ship I see in log(game F2 log, KSP.log) a lot of FAR null reference errors or argument out of range errors.\u003C/p\u003E\u003Cp\u003ECraft I built and disintegrates for me a lot:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalx.com/zomos/Passanger-SSTO---tst\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalx.com/zomos/Passanger-SSTO---tst\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI think I need to disable the FAR aero failures...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-06T22:24:49Z\u0022 title=\u002209/06/2015 10:24  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 6, 2015\u003C/time\u003E by zomos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-09-06T23:25:39Z","Content":"\n\u003Cp\u003EBeen having troubles with engines counted as occluded, seemingly randomly sometimes but not always when I go to the ship.\u003C/p\u003E\u003Cp\u003EAny workarounds for this, like a way to make engines activate and thrust ignoring that they\u0027re supposedly blocked?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-09-06T23:35:30Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@zomos: \u003C/strong\u003EWell, if it\u0027s supposed to be the turboramjet that\u0027s the problem, it certainly doesn\u0027t seem to be. Can\u0027t cause any issues with it. I\u0027d suspect problems with something else breaking and then causing FAR to break once everything else is broken.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@cantab: \u003C/strong\u003EIf they\u0027re occluded, there are two options: A) main axis error somewhere, but that should be fixed with being occluded when they shouldn\u0027t be in the next update. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E they actually are completely occluded, in which case, intended behavior.\u003C/p\u003E\n"},{"CreatedByName":"CrisK","CreatedById":133945,"CreatedDateTime":"2015-09-06T23:41:18Z","Content":"\n\u003Cp\u003E@ferram4, Okay, here are a couple of bugged craft files.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/a2caxxixxawgktp/CrisK%20Bugged%20Example%20A.craft.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECraft A: This craft sometimes loads with a Mach 1 wave drag area of 0 m^2. \u003Cstrong\u003EThe only mod is b9 wings\u003C/strong\u003E. The analysis lines do not display at all. To be 100% perfectly clear so that there is zero confusion, here is a screenshot:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KEhFWiq.png\u0022 alt=\u0022KEhFWiq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESometimes the AoA displays properly, other times it displays the same chart that I already posted with the AoA capped at roughly 20.\u003C/p\u003E\u003Cp\u003ESteps to reproduce: load this craft file. Load ANY OTHER craft file in the SPH afterwards. The analysis for the other crafts will also be bugged. You can also raise/lower the landing gear (there is none) and the static analysis and transonic design numbers will change. Again, there is no landing gear.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/28962313/Kerbal/Crafts/Ferram/CrisK%20Bugged%20Example%20B.craft.zip\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECraft B. This craft sometimes loads correctly, other times the AoA is capped at 20. Steps to reproduce: change the root. Load any other craft in the SPH. Load this craft again. Raising and lowering the (non-existent) landing gear causes the analysis numbers to change.\u003C/p\u003E\u003Cp\u003ESometimes you see this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mlOgV6j.png\u0022 alt=\u0022mlOgV6j.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOther times you see this (AoA capped at 20):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YYTTL2U.png\u0022 alt=\u0022YYTTL2U.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI can provide more examples if they would be helpful.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-09-07T01:19:53Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@CrisK: \u003C/strong\u003EI can reproduce the craft second craft, which I see is a main axis error; I\u0027ll look to add something to make it more consistent. Not sure why it\u0027s affecting the wings though, but the stall at 20 degrees AoA is correct. Even highly swept delta wings stall at 30-35 degrees, they don\u0027t maintain it to 45 degrees, that\u0027s just wrong.\u003C/p\u003E\u003Cp\u003EI can\u0027t reproduce any errors with the first craft. \u0022sometimes\u0022 is a cop-out reproduction step; you did \u003Cem\u003Esomething\u003C/em\u003E different when it loaded broken, what was it?\u003C/p\u003E\u003Cp\u003EEdit: if this can\u0027t be reproduced without pWings, then it\u0027s likely a pWings issue and I can\u0027t fix anything then. So far I\u0027ve seen no indication that stock wings show behavior like this, so it\u0027s likely a pWings issue then.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-07T01:22:11Z\u0022 title=\u002209/07/2015 01:22  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 7, 2015\u003C/time\u003E by ferram4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CrisK","CreatedById":133945,"CreatedDateTime":"2015-09-07T01:41:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@CrisK: \u003C/strong\u003EI can reproduce the craft second craft, which I see is a main axis error; I\u0027ll look to add something to make it more consistent. Not sure why it\u0027s affecting the wings though, but the stall at 20 degrees AoA is correct. Even highly swept delta wings stall at 30-35 degrees, they don\u0027t maintain it to 45 degrees, that\u0027s just wrong.\u003Cp\u003EI can\u0027t reproduce any errors with the first craft. \u0022sometimes\u0022 is a cop-out reproduction step; you did \u003Cem\u003Esomething\u003C/em\u003E different when it loaded broken, what was it?\u003C/p\u003E\u003Cp\u003EEdit: if this can\u0027t be reproduced without pWings, then it\u0027s likely a pWings issue and I can\u0027t fix anything then. So far I\u0027ve seen no indication that stock wings show behavior like this, so it\u0027s likely a pWings issue then.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with you that it\u0027s a b9 wings issue and not a FAR issue.\u003C/p\u003E\u003Cp\u003EI did not do \u003Cem\u003Eanything\u003C/em\u003E different with the first craft when it loaded broken. I opened KSP, loaded the craft, and opened the FAR screen.\u003C/p\u003E\u003Cp\u003EOut of curiosity, I flew two versions of the exact same craft file. They both flew differently: one stalled properly at an AoA of 30 degrees, one didn\u0027t stall until 65 degrees (based on the FAR flight data screen). Same craft file.\u003C/p\u003E\u003Cp\u003EI\u0027m trying to be helpful by reporting this. I feel a little bit as though you and others in the thread have jumped on me for daring to report a bug. My intention is to be helpful and contribute to a great mod, not to criticize your work.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-09-07T02:00:08Z","Content":"\n\u003Cp\u003EI understand that you\u0027re trying to be helpful, but the problem with any report that includes \u0022I did the absolute same thing and got different results\u0022 is that since computers are deterministic, that can\u0027t happen in this situation. If this involved multithreading here, I\u0027d see, but this particular situation doesn\u0027t, which means that some step is missing. Unfortunately, nearly every bug report that I can\u0027t reproduce always involves people leaving out \u003Cem\u003Ethe\u003C/em\u003E crucial step in causing it, which puts fixing the bug off for over a month in some cases. It\u0027s incredibly frustrating for everyone, which is why I keep asking about that because there has to be \u003Cem\u003Esomething\u003C/em\u003E different if I can\u0027t reproduce it.\u003C/p\u003E\u003Cp\u003EOkay, so I made some changes that makes the second plane consistent; although I think it\u0027s wrong, apparently my code reports that the stall-at-45-degrees solution is correct (this hints at some errors in the large-sweep lift calculations though, but that\u0027s for another fix down the road). The other one, no idea, can\u0027t reproduce it.\u003C/p\u003E\u003Cp\u003EI hope you\u0027ll understand if I don\u0027t follow up much more on these issues; both look like bugs that run into the legacy wing code, which is slated to be replaced for the next big FAR release, so more time wasted on that means more time until awesome good wing code. Thanks for the report, at least it\u0027s consistent again.\u003C/p\u003E\u003Cp\u003EAnyway, \u003Cstrong\u003Ev0.15.5.1 \u003C/strong\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Wallace_D._Hayes\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EHayes\u003C/strong\u003E\u003C/a\u003E is out, which has some very nice bugfixes, changelog knows all.\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-09-07T05:10:05Z","Content":"\n\u003Cp\u003EJust want to say thank you for such a great mod.\u003C/p\u003E\n"},{"CreatedByName":"CrisK","CreatedById":133945,"CreatedDateTime":"2015-09-07T14:28:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EI understand that you\u0027re trying to be helpful, but the problem with any report that includes \u0022I did the absolute same thing and got different results\u0022 is that since computers are deterministic, that can\u0027t happen in this situation. If this involved multithreading here, I\u0027d see, but this particular situation doesn\u0027t, which means that some step is missing. Unfortunately, nearly every bug report that I can\u0027t reproduce always involves people leaving out \u003Cem\u003Ethe\u003C/em\u003E crucial step in causing it, which puts fixing the bug off for over a month in some cases. It\u0027s incredibly frustrating for everyone, which is why I keep asking about that because there has to be \u003Cem\u003Esomething\u003C/em\u003E different if I can\u0027t reproduce it.\u003Cp\u003EOkay, so I made some changes that makes the second plane consistent; although I think it\u0027s wrong, apparently my code reports that the stall-at-45-degrees solution is correct (this hints at some errors in the large-sweep lift calculations though, but that\u0027s for another fix down the road). The other one, no idea, can\u0027t reproduce it.\u003C/p\u003E\u003Cp\u003EI hope you\u0027ll understand if I don\u0027t follow up much more on these issues; both look like bugs that run into the legacy wing code, which is slated to be replaced for the next big FAR release, so more time wasted on that means more time until awesome good wing code. Thanks for the report, at least it\u0027s consistent again.\u003C/p\u003E\u003Cp\u003EAnyway, \u003Cstrong\u003Ev0.15.5.1 \u003C/strong\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Wallace_D._Hayes\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EHayes\u003C/strong\u003E\u003C/a\u003E is out, which has some very nice bugfixes, changelog knows all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the future, I\u0027ll snap a video of any bugs that I find, post it privately on YouTube, and direct message it to you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThank you for giving my bug report the attention that you did, and for continuing to develop FAR!\u003C/p\u003E\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-09-07T15:11:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chrisl\u0022 data-cite=\u0022chrisl\u0022\u003E\u003Cdiv\u003EI originally posted this on the DRE forum thinking my heating issue was related to that mod. But with some assistance from Starwaster, it looks like the problem is actually with FAR. Here\u0027s what I\u0027m experiencing. I\u0027m playing with RO/RSS/RP0, all their respective required mods and most of their suggested mod (plus FASA). I recently upgraded from FAR 0.15.4.1 to 0.15.5. Prior to the upgrade, I had successfully launch and recovered 6 Mercury Atlas rockets. After upgrading to 0.15.5, however, I launched a 7th and have been experiencing issues during recovery. Reentry seems to be going initially fine. Skin temp will slowly increase from space to around 1600 at 62km (speed: 7km/s, vert speed: -238m/s, 2.1375g). At this point, skin temp starts to slowly drop until its down to under 1350 at just over 50.5km (speed: 5.6km/s, vert speed: -305m/s, 5.1374g). But as soon as I hit 50.5km, skin temp immediately jumps back up to over 1950 and begins climbing. Without the \u0022Ignore Max Temperature\u0022 cheat turned on, the Mercury capsule explodes moments after falling below 50.5km do to overheating. With the cheat turned on, skin temp continues to climb until it peaks at about 2550 at 45.6km. Obviously, the issue is this phantom \u002B600 in skin temp that seems to be added as soon as I hit 50.5km. \u003Cp\u003EIf I remove FAR and reinstall the older 0.15.4.1 version (and Starwaster was using 0.15.3 which worked for him), then reload the exact same save that resulted in the failed reentry above, the reentry works just fine. The Mercury pods skin temp slowly increases to just shy of 1700 but that doesn\u0027t happen until I\u0027m already below 15.5km. And when skin temp starts to fall, it never has any sudden increase and makes it all the way down to the ground. I don\u0027t know enough about modding to have the first clue as to what changed between 0.15.4.1 and 0.15.5 that might be causing this strange heating issue, but I wanted to report it so it can be investigated.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust wanted to report that 0.15.5.1 seems to resolve the issue I reported.\u003C/p\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2015-09-07T15:59:23Z","Content":"\n\u003Cp\u003EHi All,\u003C/p\u003E\u003Cp\u003EIm not sure if Im experienceing a bug or just seeing physics at work, I assume its the latter, but...\u003C/p\u003E\u003Cp\u003ESo basically I can\u0027t really get any benefit out of fairings at all, every rocket I build has worse characteristic with a fairing deployed.\u003C/p\u003E\u003Cp\u003EAt first I thought, well, my fairings are usually quite wide, wider than the payload, that thing must be draggy, but it happens for every craft. Yesterday I launched a probe with the M700 survey dish (\u002Bsolar panels, orbital telescope, RTantenna\u002Bsome other science experiments) on top unprotected, perfectly stable without a fairing, needs 8 fins to stabilise with the fairing (fairing just wide enough to enclose the folded M700 dish). In fact, any rocket I build with a fairing needs a complex rosette of fins at the base to keep from tumbling.\u003C/p\u003E\u003Cp\u003EThe change in stability is reflected both in the stock CoM/CoL behaviour, and also in the FAR static analysis tools. FAR also shows base drag is much higher with a fairing as well.\u003C/p\u003E\u003Cp\u003ESo I have started just ignoring fairings and launching unprotected, messy payloads without them, and I get better performance and better handling.\u003C/p\u003E\u003Cp\u003EI take it fairings are supposed to be significant and not just window dressing, so am I just designing the worlds most streamlined spacecraft or is something awry? I\u0027d really like them to be useful, everyone loves that part where you jettison the fairing! Ptshhhhhhhh!\u003C/p\u003E\u003Cp\u003ENext time I have a craft that demonstrates it well, I can take some screenies, if there is any other information that could help let me know and I\u0027ll see what I can do.\u003C/p\u003E\u003Cp\u003EIts almost like my payloads have no aerodynamic presence at all...and that fairings have a ridiculous aerodynamic cross section...thats what it feels like.\u003C/p\u003E\u003Cp\u003EAm I missing something obvious? Does it sound like there is something wrong? Are there any mods that are known to mess with fairings or that could otherwise exhibit an effect like this?\u003C/p\u003E\u003Cp\u003E(I have been in KSP for years - has it been years? - I know all the basics, lift, drag, fins, atmosphere, dV, gravity turns, pressure, all that stuff, I don\u0027t think Im making basic mistakes, Im not trying to blast through the atmosphere at 10Gs or anything)\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\u003Cp\u003E**edit**\u003C/p\u003E\u003Cp\u003EUhh..I just realised this might not be the best thread to post this in, if it isn\u0027t FAR causing it (if it is even a thing that is being caused at all)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-07T16:06:56Z\u0022 title=\u002209/07/2015 04:06  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 7, 2015\u003C/time\u003E by p1t1o\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-09-07T16:10:27Z","Content":"\n\u003Cp\u003EIf you\u0027re throwing on the smallest, most blunt fairing you can, yes, the payload might be more streamlined, especially if it\u0027s a typical KSP payload, since then what you\u0027re putting in a fairing doesn\u0027t really need the fairing. If you\u0027re making a longer, more smoothed out fairing, especially one that isn\u0027t significantly wider than the vehicle, then you won\u0027t get more drag. If your fairing\u0027s radius is twice that of the rest of the rocket (read: you made the stock fairing as wide as you could), you\u0027re talking about taking up 4x the area of the rest of the rocket cross-section, which should be a sign that your fairing design is silly and will produce a lot of drag at transonic and supersonic speeds.\u003C/p\u003E\u003Cp\u003EFinally, stability is not a sign that the fairing is poor at it\u0027s job. Its job is to reduce drag and to protect the payload; the engines have enough control authority to keep the rocket on course with thrust vectoring. Extra stability is nice, but a properly designed fairing will probably produce more body lift than the payload will and make the rocket less stable.\u003C/p\u003E\u003Cp\u003EI guess I\u0027ll have to add some extra code to make unstreamlined payloads really come apart at high speeds then just to make things absolutely sure.\u003C/p\u003E\u003Cp\u003EPictures are helpful. Pictures tell us if you\u0027re doing something reasonable and that there\u0027s a bug or if you\u0027re doing something really silly.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-09-07T17:40:12Z","Content":"\n\u003Cp\u003EI know that Roverdude has stated there is no FAR support for his Sounding Rockets mod, but with the recent FAR versions the only thing that should require specific configs are the rocket fins correct? Because I have this rocket that keeps flipping after takeoff, and it seems to have a high amount of cl and cd on its nose immediately when it launches:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/7Z7B8Z2.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/7Z7B8Z2m.png\u0022 alt=\u00227Z7B8Z2m.png\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://i.imgur.com/sHiiqG2.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/sHiiqG2m.png\u0022 alt=\u0022sHiiqG2m.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is the full raw launch video:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/mTUnJTqH-Uo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAlso as soon as I launch I\u0027m way off my prograde vector for some reason. This is a ballistic rocket, I\u0027m using \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/102502-1-0-Sounding-Rockets!-Start-small-Dream-big!-0-2-0-2015-04-27?p=1926503\u0026amp;viewfull=1#post1926503\u0022 rel=\u0022external nofollow\u0022\u003Ethese FAR configs\u003C/a\u003E for the fins, they are pitched 1.5 degrees I was hoping to get some spin going but that didn\u0027t work either.\u003C/p\u003E\u003Cp\u003EWhen I remove FAR, the rocket flies a proper parabolic arc and does not flip.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.blade-edge.com/misc/output_logFAR.zip\u0022 rel=\u0022external nofollow\u0022\u003Eoutput_log after a launch\u003C/a\u003E (not the original, but the same thing happens every time I launch).\u003C/p\u003E\u003Cp\u003EAlso, I recall now that when I first flew this rocket design in 0.90 once before upgrading to 1.0.4, the rocket flew fine with FAR installed. In fact when I took the same \u003Ca href=\u0022http://www.blade-edge.com/misc/Model%20Rocket%20V5.zip\u0022 rel=\u0022external nofollow\u0022\u003Ecraft file\u003C/a\u003E from my 0.90 game into 1.0.4 it flipped out, despite the 0.90 version flying fine (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/82506-The-Kerbal-Space-Agency-Plot-Summary-Orbital-Mapping?p=2131195\u0026amp;viewfull=1#post2131195\u0022 rel=\u0022external nofollow\u0022\u003Ealbeit unsuccessfully in arcing high enough\u003C/a\u003E). I completely forgot to go back and confirm if it was a FAR issue - I was still getting my 1.0.4 install set up and at that time it could have been any number of things causing the rocket to be unstable.\u003C/p\u003E\n"}]}