{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":347,"Articles":[{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-05-03T07:15:17Z","Content":"\n\u003Cp\u003E@\u003Cstrong\u003Eferram4\u003C/strong\u003E: what\u0027s the reasoning behind the engine gimbal increase? I only ask because Vens Revamp adds specific gimbalResponseSpeeds to certain engines, would be nice to keep them (though, I guess I could just remove those lines).\u003C/p\u003E\u003Cp\u003EEDIT: I\u0027m an idiot, I completely missed the % operator. Question still stands though - why the increase? Not complaining or anything, just wondering why.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T08:13:21Z\u0022 title=\u002205/03/2015 08:13  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jofwu","CreatedById":94705,"CreatedDateTime":"2015-05-03T08:31:46Z","Content":"\n\u003Cp\u003ELooking for some help...\u003C/p\u003E\u003Cp\u003EI thought I\u0027d give the new pre-release version a try, and ran into a brick wall designing airplanes. I never had this much trouble with FAR before... I couldn\u0027t get all of the stability derivatives looking decent for the life of me. So then I thought I\u0027d grab some of the FAR airplanes from the current 0.90 compatible version and see if I could find some guidance. Turns out they\u0027re unstable as well. What gives? Surely the new FAR is not going to be so realistic that the old FAR ships don\u0027t work... The numbers look sad, and I tried flying a few without much luck. Can\u0027t think of any mods that might conflict somehow...\u003C/p\u003E\u003Cp\u003EObviously I don\u0027t \u003Cem\u003Eexpect \u003C/em\u003Ethe pre-release version to work perfectly. But it sounds like other people aren\u0027t having this problem. Have I done something wrong? I grabbed \u003Ca href=\u0022https://github.com/ferram4/Ferram-Aerospace-Research/tree/voxelAeroPort\u0022 rel=\u0022external nofollow\u0022\u003Ethis download \u003C/a\u003Eand put the FerramAerospaceResearch folder into my Gamedata folder. I\u0027ve got the current versions of ModuleManager and ModularFlightIntegrator. \u003C/p\u003E\u003Cp\u003EAnd if I\u0027m just crazy, can anyone point me to a good guide on how to design airplanes for FAR, and how to make the most of the info it gives you? I only have a weak grasp of what the stability derivatives say, so I\u0027m not sure how to correct the red ones.\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2015-05-03T08:38:38Z","Content":"\n\u003Cp\u003EI\u0027m just saying what I did to my little test plane, first thing you want to do is clip the landing gear in the body. This is huge for the stability (use the new awesome overlay to see just how big it is). Other than that it doesn\u0027t seem that different, you\u0027re going to need small delta wings if you want to go supersonic at low altitudes for example.\u003C/p\u003E\n"},{"CreatedByName":"Virindi","CreatedById":84021,"CreatedDateTime":"2015-05-03T09:32:37Z","Content":"\n\u003Cp\u003EBeen trying out tonight\u0027s nufar build, and it\u0027s really awesome. Who cares about what they added to stock, voxel aerodynamics are the best!\u003C/p\u003E\u003Cp\u003EUnfortunately though, spoilers seem to be bugged. If I attach them directly to any part, they have absolutely zero effect (like I can deploy a spoiler the size of my entire plane and my speed does not change). However, if I then offset the spoiler a tiny amount away from the parent part, the spoiler has an effect and I crash when I deploy it.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-05-03T09:39:16Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@KillerRaccoon: \u003C/strong\u003ESoon, hopefully. I\u0027m doing some diagnostics and stuff to make sure it\u0027s good, and possibly adding one more tweak to voxelization before calling it good. Maybe some more polish since the cross-section overlay is drawn underneath see-through parts instead of on top like it should be.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@ObsessedWithKSP: \u003C/strong\u003EThe reasoning is that it\u0027s somewhat necessary for rockets with wide fairings. Those create a lot of drag and body lift and using stock gimbal ranges makes those rockets prone to flipping even though they should be fine. A 1.5x increase is rather small, but it makes a big difference.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@jofwu: \u003C/strong\u003EPlanes built without accounting for the same kind of body lift and with no need to area rule don\u0027t work well? That\u0027s not surprising at all. The stock craft are being redesigned. Yes, things are changing that much.\u003C/p\u003E\n"},{"CreatedByName":"Virindi","CreatedById":84021,"CreatedDateTime":"2015-05-03T10:08:29Z","Content":"\n\u003Cp\u003EStock airbrakes do seem to work just fine, too bad they are just one size only.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-05-03T10:16:09Z","Content":"\n\u003Cp\u003EI tried flying some planes in the dev version and the stock planes, like ravenspear etc fly OK\u003C/p\u003E\u003Cp\u003EI even got the albatross into the air although a lot of them seemed... floppy.\u003C/p\u003E\u003Cp\u003ECouldn\u0027t get over 400m/s or over 19km with any of them though.\u003C/p\u003E\u003Cp\u003EThere was something very real about the aero breakup. It happened during a maneuver where I thought it might and it did not all happen at once, just the parts that were stressed broke off and of course this made the handling of the plane troublesome as they were the wings.\u003C/p\u003E\u003Cp\u003EI found the higher settings in realism to be less fussy about the craft, on lower settings I couldn\u0027t fly anything. YMMV\u003C/p\u003E\u003Cp\u003EI also turned voxels up to 40k and min frames down to 20.\u003C/p\u003E\n"},{"CreatedByName":"Spire","CreatedById":114603,"CreatedDateTime":"2015-05-03T10:31:43Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003EIs this mod basically going to go now? Since KSP 1.02 is out I don\u0027t really think there\u0027s much point of this. Except for the Speedomter settings where you can Change from m/s to knots etc... Just curious.. -Hawk.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-05-03T10:32:15Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Virindi: \u003C/strong\u003EYeah, I\u0027ve got an idea on how to handle that. Should be relatively simple.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@John FX: \u003C/strong\u003EInteresting. We\u0027ll see how things pan out, but since the drag multipliers don\u0027t change much, with most of it going into how it processes the cross-section, I guess that\u0027s not surprising if you\u0027ve already got something good. Also, Glad to see someone wants more detail on their debris. I mean, the default vessel count is 250k, and if I can get the voxelization efficient enough to push that higher I will.\u003C/p\u003E\n"},{"CreatedByName":"Nerd1000","CreatedById":47230,"CreatedDateTime":"2015-05-03T10:46:53Z","Content":"\n\u003Cp\u003EI\u0027ve been messing around with the beta build from github. This is the consequence of a photograph of a Dassault Mirage III (for general layout) and a couple of hours of trial and error. I call it \u0027Le renflement\u0027.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/39748012119112413/838D632D3D5CC9D9545378D079081A6CCDE5D589/\u0022 alt=\u0022838D632D3D5CC9D9545378D079081A6CCDE5D589\u0022\u003E\u003C/p\u003E\u003Cp\u003EThose delta wings increase the cross section a lot near the tail. Without any way to taper the fuselage, I initially tried to area rule it with careful placement of the parts. On testing the thing I discovered that its top speed was Mach 1.1 at around 9000m and that lowering the landing gear reduced wave drag (!). After that I resorted to applying hideous bulges and managed to reduce the wave drag area from around 1.3 sq.m to 0.78 sq.m, which increased my top speed to mach 1.85 at around 9000m. The real Mirage III was about the same size and weight but it managed mach 2 on a 60 kN engine, as opposed to our near miraculous \u0027Basic jet engine\u0027 with 115 kN, so I reckon I\u0027ve got a long way to go when it comes to supersonic drag \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Surefoot","CreatedById":89084,"CreatedDateTime":"2015-05-03T11:11:36Z","Content":"\n\u003Cp\u003EArent the side intakes bigger on the real thing ? They might contribute to area balancing.\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2015-05-03T11:17:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HawkedUpSpace\u0022 data-cite=\u0022HawkedUpSpace\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:\u0027century gothic\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003EIs this mod basically going to go now? Since KSP 1.02 is out I don\u0027t really think there\u0027s much point of this. Except for the Speedomter settings where you can Change from m/s to knots etc... Just curious.. -Hawk.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt isn\u0027t going anywhere, quite the opposite. 1.0.2 brought back most of the soup and 1.0 wasn\u0027t that realistic either. nuFAR destroys stock aerodynamics still.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-05-03T11:20:48Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@HawkedUpSpace: \u003C/strong\u003EYes, FAR is completely gone. There is absolutely no room for aerodynamics improvement since Squad hacked together a barely functioning model. There have been no improvements at all, and all the posts including my status updates are simply a ruse. You\u0027ve figured us out, time to go home now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Nerd1000: \u003C/strong\u003EI can see that happening. One of the things that \u003Cem\u003Eshould\u003C/em\u003E be accounted for is the area ducted through the fuselage for the intakes, but I think the first version is going to be released without that. The gear changing the area that much is likely an issue of it changing where the voxels are relative to the wing, causing less voxels to exist for the wing in the gear-down case than the gear-up case. I\u0027ve got an idea of how to fix that though.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-05-03T12:35:45Z","Content":"\n\u003Cp\u003EConsidering the change in approach, I think it\u0027s fair to say \u003Cem\u003EFAR is dead, Long live FAR!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EAnd nice example from Nerd1000. I\u0027ve had my concern that area-rule constraints might be hard to meet with KSP\u0027s lego-brick-style craft building, but you seem to have done a good job of it.\u003C/p\u003E\n"},{"CreatedByName":"jonrd463","CreatedById":116868,"CreatedDateTime":"2015-05-03T12:55:08Z","Content":"\n\u003Cp\u003EI really can\u0027t wait to give this a whirl. I\u0027m not adventurous enough to try the dev build, so I\u0027ll wait for release. One thing I\u0027ve always been a stickler for when making my planes is keeping a somewhat real world form factor. Form follows function, after all, and the closer to realistic, the better imho. I\u0027m not an engineer or pilot, but I do work in the manufacturing side of things for a major aerospace company, and when you can understand some of the nuts and bolts \u0022why?\u0022\u0027s of things, it makes building in KSP interesting. If I\u0027m understanding this voxel feature correctly, form following function just got turned up to 11, and I can\u0027t wait!\u003C/p\u003E\u003Cp\u003EHere\u0027s one of my favorite designs so far. The wings are loosely based on the Boeing 777. Gotta come clean, though, I hacked the crap out of the engines to give more bang for their size. \u003Cimg src=\u0022http://i.imgur.com/mxcOY5M.png\u0022 alt=\u0022mxcOY5M.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nerd1000","CreatedById":47230,"CreatedDateTime":"2015-05-03T13:25:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003E@Nerd1000: \u003C/strong\u003EI can see that happening. One of the things that \u003Cem\u003Eshould\u003C/em\u003E be accounted for is the area ducted through the fuselage for the intakes, but I think the first version is going to be released without that. The gear changing the area that much is likely an issue of it changing where the voxels are relative to the wing, causing less voxels to exist for the wing in the gear-down case than the gear-up case. I\u0027ve got an idea of how to fix that though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI should clarify- Lowering the gear reduced wave drag before I added the bulges. Once the bulges were in place lowering the gear increased the wave drag area, which is more in line with what you\u0027d expect. I suspect that my landing gears just happened to be in the right place to reduce the wave drag when they were deployed- a fact that was no doubt partly a result of my forgetting to retract the gear while I was working on the layout.\u003C/p\u003E\u003Cp\u003EAn example of the \u0027happy accident\u0027 effect is perhaps illustrated by that bulge I added just below and in front of the cockpit. It\u0027s placed directly over the nose wheel because it turns out that the nose gear was in just the right place to smooth out the changes in cross section caused by the cockpit when it was extended. The bulge emulates that effect while keeping the gear retracted.\u003C/p\u003E\u003Cp\u003EEdit: I fixed my grammar.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T13:32:41Z\u0022 title=\u002205/03/2015 01:32  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by Nerd1000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lorunification","CreatedById":135645,"CreatedDateTime":"2015-05-03T13:26:10Z","Content":"\n\u003Cp\u003EI am sorry if you guys are already annoyed by this question, but what exactly do i need to get the dev branch working?\u003C/p\u003E\u003Cp\u003EI read through the last few pages and couldn\u0027t find any information.\u003C/p\u003E\u003Cp\u003EDo i just merge the GameData folder from the voxelAeroPort into my ksp?\u003C/p\u003E\u003Cp\u003EThank you very much in advance!\u003C/p\u003E\n"},{"CreatedByName":"Tarheel1999","CreatedById":123965,"CreatedDateTime":"2015-05-03T13:28:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lorunification\u0022 data-cite=\u0022Lorunification\u0022\u003E\u003Cdiv\u003EI am sorry if you guys are already annoyed by this question, but what exactly do i need to get the dev branch working?\u003Cp\u003EI read through the last few pages and couldn\u0027t find any information.\u003C/p\u003E\u003Cp\u003EDo i just merge the GameData folder from the voxelAeroPort into my ksp?\u003C/p\u003E\u003Cp\u003EThank you very much in advance!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou also need this. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/118088-1-00-ModularFlightIntegrator-1-0-%28Apr-30%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/118088-1-00-ModularFlightIntegrator-1-0-%28Apr-30%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Darkway","CreatedById":142879,"CreatedDateTime":"2015-05-03T13:39:51Z","Content":"\n\u003Cp\u003EI\u0027ve been lurking around on these forums since I started playing the game about 6 months ago, but as Im a huge fan of FAR, i decided to register cuz - as NuFAR is coming - I\u0027d like to give a few suggestions. Sorry in advance if my english is not that proper, Ive not been using it for quite a long time now (I\u0027m hungarian btw \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E). \u003C/p\u003E\u003Cp\u003EI always used FAR, as stock aero was so unintuitive, I could not even build anything that could properly lift off. There are just a few things that bugged me all along while using FAR. Sorry if any of these ideas appeared somewhere above (or are added to NuFAR already \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EWhile building the plane, is it possible to draw a graph that shows the maximum speed the craft can achieve with level flight, at different altitudes? It could even have some switches, to count air breathing engines and/or rocket engines during calculation or not. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt could really be a hard-to-implement feature, maybe impossible, but it would be nice if FAR could show somehow what the maximum stable climb rate is at different speeds/altitudes. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIs it possible to add a \u0022Level flight\u0022 button to the flight assistance? I dunno if it was my horrible design, or a problem of SAS, but I always had to fight to keep a plane in level flight, especially at higher speeds / altitudes. \u003Cbr\u003EMy idea is something like this: If you activate level flight, control surfaces orientate themselves so that they try to achieve level flight (keep level flight AoA), while hitting controls will change the orientation of the surfaces relative to the configuration the FA sets. This way, the plane stays controllable, and input damping can also be utilized without losing altitude. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt would be extremely nice if the flight assistance options disabled themselves when the aerodynamic forces become negligible... Somehow, one time I\u0027ve almost torn a spacestation apart with FlightAssistance after docking my SSTO to it. \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThank you all for your work, I can\u0027t wait to finish my finals and try 1.0 (and maybe NuFAR too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E).\u003C/p\u003E\n"},{"CreatedByName":"Bakase","CreatedById":134737,"CreatedDateTime":"2015-05-03T13:41:06Z","Content":"\n\u003Cp\u003ENone of my old SSTOs work in NuFAR! They all undergo aerodynamic failure. This is great!\u003C/p\u003E\u003Cp\u003E(they never reached orbit in OldFAR, but they were capable of supersonic velocities)\u003C/p\u003E\n"},{"CreatedByName":"ola","CreatedById":82138,"CreatedDateTime":"2015-05-03T13:45:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bakase\u0022 data-cite=\u0022Bakase\u0022\u003E\u003Cdiv\u003ENone of my old SSTOs work in NuFAR! They all undergo aerodynamic failure. This is great!\u003Cp\u003E(they never reached orbit in OldFAR, but they were capable of supersonic velocities)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo...your old ideas won\u0027t work, and you\u0027re happy. Only in KSP, people! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI might give nuFAR a swirl later tonight, it seems awesome. I wonder if I might just check out the git repo at the Right place and update it as stuff changes.\u003C/p\u003E\n"},{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2015-05-03T14:32:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hodo\u0022 data-cite=\u0022Hodo\u0022\u003E\u003Cdiv\u003EIs it just procedural parts or Pwings and Pwings B9?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t tested Procedural Wings, but I suspect that Procedural Wings will also not work.\u003C/p\u003E\u003Cp\u003EFerram, the voxels show the original model, not the model which was scaled. I think that a way to solve this would be to generate the voxels through the active colliders? I\u0027m not a coder, I\u0027m a modeler and config\u0027r, so I might not understand how it works. But I think that if you generated the voxels based on colliders rather than the mesh, or maybe the scaled mesh, then procedural, scaled, etc parts would work. I think. Good luck, and great work so far. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, I report that the airspeed settings changes are not persistent. For example, if I set it to KPH IAS and then fly around, land and recover, and then launch again, I will have to set it to KPH IAS again because speed would be displayed in the default surf. m/s.\u003C/p\u003E\n"},{"CreatedByName":"FennexFox","CreatedById":111279,"CreatedDateTime":"2015-05-03T14:44:42Z","Content":"\n\u003Cp\u003EActually not a FAR problem, but it\u0060s about FAR stock plane, so I\u0060m here...\u003C/p\u003E\u003Cp\u003EFAR Firehound had MK2 fuselage beneath its main fuselage as engine section.\u003C/p\u003E\u003Cp\u003EI want to imitate that but it seems that MK2 fuselage doesn\u0060t attach radially.\u003C/p\u003E\u003Cp\u003EHow could you attach that without any structural parts?\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-05-03T14:54:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FennexFox\u0022 data-cite=\u0022FennexFox\u0022\u003E\u003Cdiv\u003EActually not a FAR problem, but it\u0060s about FAR stock plane, so I\u0060m here...\u003Cp\u003EFAR Firehound had MK2 fuselage beneath its main fuselage as engine section.\u003C/p\u003E\u003Cp\u003EI want to imitate that but it seems that MK2 fuselage doesn\u0060t attach radially.\u003C/p\u003E\u003Cp\u003EHow could you attach that without any structural parts?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1) Mk2 fuselage pieces do attach radially. Mk2 cargo bays don\u0027t (and don\u0027t like to be radially attached to, either).\u003C/p\u003E\u003Cp\u003E2) When all else fails, cubic octagonal struts. Instant attachment node wherever you need it.\u003C/p\u003E\n"},{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2015-05-03T16:33:23Z","Content":"\n\u003Cp\u003EHuh, CoL is broken. Wings seem to be ridiculously underpowered as well.\u003C/p\u003E\u003Cp\u003EKeep up the great work, Ferram. I think the stock jets need a re-nerf, too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}