{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":5,"Articles":[{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-04-21T23:08:11Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@cardgame: \u003C/strong\u003EThat could simply be the result of overspeeding; post a video soon, it should be helpful.\u003C/p\u003E\u003Cp\u003EMy response to the other problem is fairly snarky: So when you decide to break physics you end up with behavior that breaks physics? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E The fact is that when you start engaging in serious part clipping the FAR code (which makes the assumption that you aren\u0027t clipping parts) can get fairly messed up. Also, the control surfaces shouldn\u0027t be activating by themselves; it\u0027s possible that you left one of the autopilots on and that it did something unexpected during take-off.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Camacha: \u003C/strong\u003EThat looks good, though hopefully the latest release of FAR should remove the need to do that.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Van Disaster: \u003C/strong\u003ENormally flap deployment causes the plane to have to be re-trimmed. This is why flaps get deployed well before the final approach to landing, so that the pilot has time to balance it. This is a normal problem in airplane design and is one of the things that needs to be accounted for in the design.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Noc: \u003C/strong\u003EIf you mean adding lift modules like the wings have, then no, that won\u0027t work well. Instead you would be better off modifying the Cl curve for the standard drag model; most of those numbers are taken from real-world data. You might want to look at the command pods, since it includes the non-wing modules explicitly stated for those.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@xau: \u003C/strong\u003EKnown issue; will be fixed in the next release.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-04-22T02:43:33Z","Content":"\n\u003Cp\u003EI have had a little success using flaps on swept wings split between forwards \u0026amp; aft of what one might call the average lift axis in an attempt to balance moments, but it\u0027s hugely awkward trying to build wings like that with the stock bits - I just wondered if someone had found a nice solution already. Would FAR flaps still behave if they were only attached to lifting surfaces second-hand? like if they were attached to a mounting bracket of some sort, or a hydraulic ram?\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-04-22T02:56:18Z","Content":"\n\u003Cp\u003EIs this fun or does it make things too hard?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-22T03:00:21Z\u0022 title=\u002204/22/2013 03:00  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 22, 2013\u003C/time\u003E by SalmonellaDingDong\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-04-22T03:45:24Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Van Disaster: \u003C/strong\u003EThey would still work, but some of the interactions might not be properly accounted for. You might not get as much lift as you wanted, for example.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@SalmonellaDingDong: \u003C/strong\u003EWell, \u003Cem\u003EI\u003C/em\u003E think it makes things more fun, as do many other users of this mod. The increase in realism means that you can use lessons from real life aerodynamics to build your vehicles; if you build a plane that looks like a Boeing 747, it\u0027ll probably fly like a 747. There\u0027s also the fact that for a properly streamlined vehicle you can actually reach some pretty fast speeds in the lower atmosphere (like you should be able to do).\u003C/p\u003E\u003Cp\u003EAs for whether it makes things too hard there are (IMO) three attitudes on this:\u003C/p\u003E\u003Cp\u003E1. The need to consider aerodynamics when building rockets makes it too hard; these people have rockets tumble and spin out during launch because of poor design.\u003C/p\u003E\u003Cp\u003E2. The reduced drag due to proper aerodynamics makes it too easy to reach orbit; these people complain that they aren\u0027t losing as much delta-V to drag as they\u0027re used.\u003C/p\u003E\u003Cp\u003E3. The need to consider aerodynamics combined with the reduced drag for streamlined vehicles adds new design constraints to launching a certain payload into orbit; whether it is harder or easier depends on the mission.\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-04-22T06:54:54Z","Content":"\n\u003Cp\u003EInstalled it, I love it!\u003C/p\u003E\u003Cp\u003EI\u0027m having issues with the FAR windows not appearing though. How do I get it to show in flight?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-04-22T07:12:22Z","Content":"\n\u003Cp\u003ECurrently it only has the windows appear on command pods that have the FARControlSys module defined in their part.cfg. Check to make sure that the command module you\u0027re using has that defined in the part.cfg; then it should work.\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-04-22T07:16:07Z","Content":"\n\u003Cp\u003ECan I add it to pods that do not have it? I\u0027m asking because I\u0027m looking to use it with B9.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-04-22T08:01:22Z","Content":"\n\u003Cp\u003EYeah, sure. Just look at the code for the stock pods; when you installed FAR those should have been overwritten with the proper data.\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-04-22T08:07:00Z","Content":"\n\u003Cp\u003EOkay, thanks!\u003C/p\u003E\n"},{"CreatedByName":"Amaroq","CreatedById":57607,"CreatedDateTime":"2013-04-22T22:55:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@SalmonellaDingDong: \u003C/strong\u003E\u003Cp\u003E1. The need to consider aerodynamics when building rockets makes it too hard; these people have rockets tumble and spin out during launch because of poor design.\u003C/p\u003E\u003Cp\u003E2. The reduced drag due to proper aerodynamics makes it too easy to reach orbit; these people complain that they aren\u0027t losing as much delta-V to drag as they\u0027re used.\u003C/p\u003E\u003Cp\u003E3. The need to consider aerodynamics combined with the reduced drag for streamlined vehicles adds new design constraints to launching a certain payload into orbit; whether it is harder or easier depends on the mission.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPersonally, I seriously love this mod. You will encounter some of the problems above, though!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETumble\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhen you first experience \u0022tumble\u0022, your intuitive feeling will be \u0022It felt like my rocket got top heavy\u0022. In reality, it tends to be one of the following:\u003C/p\u003E\u003Cp\u003EGravity Turn - the primary cause of tumble, for me, is making my gravity turn too sharply. You can\u0027t just nose over sharply, or you get to a point where the lateral force from drag overcomes the ability of your aerodynamic surfaces to straighten out. However, I\u0027ve also had it come up for the following reasons:\u003C/p\u003E\u003Cp\u003EStructural Integrity - if I\u0027ve built a vessel that is too tall, and has a ton of flex along it, I get myself into trouble with the entire rocket developing oscillations. This is especially true using ASAS to keep your rocket on-heading, as the vanilla ASAS system tends to \u0022overcorrect\u0022, and doesn\u0027t understand the FAR model, so it gets into real trouble really quickly - you can get a Tacoma Narrows resonating oscillation thing going. The first place you\u0027ll want to go with this is struts and tail fins, essentially, giving yourself additional forces to keep yourself rigid and on-course.\u003C/p\u003E\u003Cp\u003EASAS - Some of my designs that felt \u0022unflyable\u0022 with ASAS turned out to be as simple as \u0022turn ASAS off and manage heading by hand,\u0022 and they were really easy. If you\u0027d rather use ASAS, I\u0027ve found that the best way to integrate ASAS with FAR is by limiting its inputs. Turn off engine gimbaling for your bottom-stage launch engines. Use the FAR control panel in the VAB to limit the maximum deflection of the control surfaces -- values between 2 and 6 degrees seem to work pretty well. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EToo Easy\u003C/strong\u003E - really, the only thing I had here was the discovery that it was pretty much trivial to get a Sputnik orbit -- this is due to the reduced scale height of the atmosphere. In particular, it makes building \u003Cstrong\u003Esmall\u003C/strong\u003E easier than building \u003Cstrong\u003Elarge\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDesign Constraints\u003C/strong\u003E - you will almost certainly want one of the Fairing mods from somewhere. Personally, I\u0027ve been using the KW Rocketry ones, and have been quite happy with them.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-04-23T16:39:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Amaroq\u0022 data-cite=\u0022Amaroq\u0022\u003E\u003Cdiv\u003EPersonally, I seriously love this mod. You will encounter some of the problems above, though!\u003Cp\u003EASAS - Some of my designs that felt \u0022unflyable\u0022 with ASAS turned out to be as simple as \u0022turn ASAS off and manage heading by hand,\u0022 and they were really easy. If you\u0027d rather use ASAS, I\u0027ve found that the best way to integrate ASAS with FAR is by limiting its inputs. Turn off engine gimbaling for your bottom-stage launch engines. Use the FAR control panel in the VAB to limit the maximum deflection of the control surfaces -- values between 2 and 6 degrees seem to work pretty well. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI personally like to fly most craft by hand; ASAS just introduces way too many unwanted oscillations and movement. Even when turning it on for a short period of time it can be a pain to correct and iron out all the movement. It is also sort of a check whether I built a decent craft; with anything that is really hard to control by hand is usually something wrong. Most craft only show some minor rotation, but that is easily corrected by hand. Limiting inputs sometimes helps a lot indeed if you do want to use ASAS; some fiddling round with what motors gimbal and which do not usually fixes a lot of problems.\u003C/p\u003E\u003Cp\u003EThat being said, I am having a problem I have not quite found the cause of. In the lower atmosphere, but after reaching some decent speed, some rockets start squirreling out on me. Most notably, when I try to correct course with W and S, the things start rolling like crazy without me ever touching Q or E. I have tested quite extensively and systematically broke down my rockets into separate parts to test, but it seems that some very basic rockets show this behavior. First I thought my somewhat odd payloads might be at fault, but that does not seem to be the case. For instance, FAR doesn\u0027t seem to like the tricoupler at all. Pretty much anything I build with that shows aforementioned behavior.\u003C/p\u003E\u003Cp\u003EI might upload some stock rockets to illustrate the problem. I usually do get into orbit, but controlling the heading and thus inclination accurately is nearly impossible.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EDesign Constraints\u003C/strong\u003E - you will almost certainly want one of the Fairing mods from somewhere. Personally, I\u0027ve been using the KW Rocketry ones, and have been quite happy with them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI use Faring Factory a lot, since I like nice, compact payloads.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-23T18:06:35Z\u0022 title=\u002204/23/2013 06:06  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 23, 2013\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-04-24T09:04:17Z","Content":"\n\u003Cp\u003EI have determined FAR to be the cause of this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=RX4bLs6H0dk\u0026amp;feature=player_detailpage\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=RX4bLs6H0dk\u0026amp;feature=player_detailpage\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt spams \u0022[Exception]:NullReferenceException: Object reference not set to an instance of an object\u0022 in the debug log.\u003C/p\u003E\u003Cp\u003EThe game is unplayable with FAR installed, how do I fix this?\u003C/p\u003E\u003Cp\u003EEspecially bad considering how much I\u0027ve been enjoying using it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-24T09:17:48Z\u0022 title=\u002204/24/2013 09:17  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 24, 2013\u003C/time\u003E by SalmonellaDingDong\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hyratel","CreatedById":4486,"CreatedDateTime":"2013-04-24T16:23:51Z","Content":"\n\u003Cp\u003Eis there a way to get a deployable flap with an upward cut? I need this for a \u0027shuttle\u0027 type vehicle but I don\u0027t want to tie it to brakes for other reasons\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-04-24T16:27:48Z","Content":"\n\u003Cp\u003EHyratel - use negative angles. I\u0027ve used those as large trim tabs when deploying enormous flaps.\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-04-24T21:56:09Z","Content":"\n\u003Cp\u003EAfter installing FAR, KER has the wrong terminal velocity, but the right altitude. It gives me a terminal velocity of 2.239 km/s on the pad at KSC.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-24T21:58:09Z\u0022 title=\u002204/24/2013 09:58  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 24, 2013\u003C/time\u003E by dlrk\u003C/strong\u003E\n\u003Cbr\u003Ewrong infoposted previously\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-04-24T22:24:19Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@SalmonellaDingDong: \u003C/strong\u003ECause it again and post a copy of the output_log.txt; you can find it in the KSP_Data folder. That will help me track down the source of the error.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@dlrk: \u003C/strong\u003EWell, Kerbal Engineer uses the stock drag model to calculate terminal velocity; it doesn\u0027t know how to deal with FAR at all. Previous to the forum reset there was some discussion about whether setting up a system to allow FAR data to be accessible to Kerbal Engineer would be worthwhile, and the resulting conclusion was that it would result in too many dependencies and instabilities in the plugins, at least for now.\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-04-24T22:44:48Z","Content":"\n\u003Cp\u003EFerram, \u003C/p\u003E\u003Cp\u003EWhat\u0027s the best way to find terminal velocity with FAR? Also, with FAR installed, I keep losing control of my rockets during the gravity turn at 10k. Any ideas?\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-04-24T22:45:38Z","Content":"\n\u003Cp\u003EAlso, does FAR work with KW Rocketry?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-04-24T22:58:11Z","Content":"\n\u003Cp\u003EIt does work with KW.\u003C/p\u003E\u003Cp\u003EI assume that you\u0027re doing the standard fly straight up 10km before pitching over to continue your ascent, right? You don\u0027t wanna do that. Instead, start pitching over when you reach ~60 m/s and just keep aiming prograde. You\u0027ll run a proper gravity turn trajectory (what you\u0027ve described is not a gravity turn, look up the term if you want more info) and that will allow you to keep more control of your vehicle.\u003C/p\u003E\u003Cp\u003EIf that doesn\u0027t help I\u0027d advise adding fins to the bottom of the rocket and /or designing your rocket so you don\u0027t have a series-staging event until you\u0027re up at about 20 - 25km; that should help it be more stable.\u003C/p\u003E\u003Cp\u003EIf you need more help, post a picture of the rocket and I should be able to help more.\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-04-24T23:04:42Z","Content":"\n\u003Cp\u003EFerram, thanks, I\u0027ll try your suggested method.\u003C/p\u003E\n"},{"CreatedByName":"aquilux","CreatedById":23859,"CreatedDateTime":"2013-04-24T23:07:51Z","Content":"\n\u003Cp\u003EFerram, I posted some counterpoints to your arguments and suggestions as comments on your drag experiment mod so that I do not clutter up this thread. I would be grateful if you took the time, at your leisure, to read over my points and respond to them.\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-04-24T23:19:04Z","Content":"\n\u003Cp\u003EI added fins to the bottom of my rocket, and it works good using the pitch over at 60 m/s method. I appreciate your help, and I do have a couple more questions. \u003C/p\u003E\u003Cp\u003EHow far should I pitch over? Is there a way to find my terminal velocity?\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-04-24T23:22:14Z","Content":"\n\u003Cp\u003EIs there a guide to the proper pitch technique anywhere?\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-04-25T01:46:52Z","Content":"\n\u003Cp\u003EFerram, the lag only happened when there was crashed craft debris being loaded around me, just like that other guy. I wiped my output logs when I did my latest reinstall.\u003C/p\u003E\n"},{"CreatedByName":"Glaucus","CreatedById":14664,"CreatedDateTime":"2013-04-25T01:57:35Z","Content":"\n\u003Cp\u003Eis there a save way to remove this?\u003C/p\u003E\u003Cp\u003EI love it for planes, but rockets I seem to have the same issue as a lot of people and well im bored of launching the same old rocket by hand all the time.\u003C/p\u003E\n"}]}