{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":25,"Articles":[{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-06-13T04:53:50Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@grom: \u003C/strong\u003EDo you mean that it\u0027s losing control only in the north-south plane regardless of how the rocket is oriented, or that it is only unstable in the pitch-control plane despite the radial symmetry of the rocket?\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@MR4Y: \u003C/strong\u003EI assume you\u0027re talking about the way that with FAR, your plane flies like it\u0027s in air? Keep in mind that jet engines in KSP are overpowered and the last release of FAR didn\u0027t update that. Yes, real jet fighters can fly supersonic at sea level, there\u0027s nothing weird with what you\u0027re seeing. You\u0027re just used to the stock drag model. Don\u0027t worry, that\u0027ll wear off.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Van Disaster: \u003C/strong\u003EThat might be a problem caused by pWings. Try out the new version of FAR and see if it still happens. I also believe that I\u0027ve fixed the B9 cargo bay bug, so you should try it out now.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVersion 0.9.5\u003C/strong\u003E is out now, fixing incompatibilities with B9 Aerospace, handling drag due to the tapering of parts (command pods don\u0027t require part.cfg overrides anymore!), some optimizations and switching over to a ModuleManager based system.\u003C/p\u003E\u003Cp\u003EPeople updating from FAR 0.9.4 to 0.9.5 should overwrite GameData/Squad/Parts with the GameData/Squad/Parts folder from their KSP download. Otherwise, bad things may happen.\u003C/p\u003E\n"},{"CreatedByName":"Clamps","CreatedById":70484,"CreatedDateTime":"2013-06-13T06:34:37Z","Content":"\n\u003Cp\u003ESo what do we do if we don\u0027t have a clean part folder?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-06-13T06:53:18Z","Content":"\n\u003Cp\u003ESQUAD hasn\u0027t released a patcher, and so everyone running 0.20.2 should have a copy of the zip somewhere on their computer. Re-extract the proper folder and overwrite the modified files.\u003C/p\u003E\u003Cp\u003EI also mentioned in the first post (prior to this update) to keep a backup of the Parts folder for the purpose of clearing out FAR\u0027s part.cfg overwrites.\u003C/p\u003E\u003Cp\u003EIf you haven\u0027t kept a backup of the Parts folder (as instructed) or you deleted the 0.20.2 zip file, you\u0027ll have to re-download KSP to get access to the files.\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-06-13T07:19:45Z","Content":"\n\u003Cp\u003EHey, is there somewhere I can grab your latest source code for 0.9.5?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-06-13T08:04:15Z","Content":"\n\u003Cp\u003EDownload the FAR zip and look in the Source folder.\u003C/p\u003E\n"},{"CreatedByName":"Silenvo","CreatedById":70503,"CreatedDateTime":"2013-06-13T08:50:55Z","Content":"\n\u003Cp\u003EI require assistance with installation or configuration.\u003C/p\u003E\u003Cp\u003ESymptoms: When I enter the building hanger there is no sign of the FAR screen (as I have seen on TheWinterOwl\u0027s Let\u0027s Fly), when I turn on the \u0022Center of Lift\u0022 the\u003C/p\u003E\u003Cp\u003Eblue ball is in the center of the floor. Lastly, when I launch to the runway, none of the control surfaces respond, no matter what aircraft I chose to operate; the dials\u003C/p\u003E\u003Cp\u003Eat the bottom left are moving, but the control surfaces are not.\u003C/p\u003E\u003Cp\u003EI do not understand why it is malfunctioning, and I have examined installation suggestions from three different locations and even watched a few YouTube videos\u003C/p\u003E\u003Cp\u003E(of the few that there are) on installing mods. Despite following to the letter, still yielded the same results. Other mods have successfully installed - mostly, being parts\u003C/p\u003E\u003Cp\u003Eand ships - the mods ships do show up, but the interface adjustments and helpers do not. I have tried every single key on my keyboard in hopes of some undocumented\u003C/p\u003E\u003Cp\u003Ehotkey, again to no avail. After wasting my day failing on this, my only chance of getting help is asking here.\u003C/p\u003E\u003Cp\u003EIt would appear that I am either fundamentally missing an important detail, or that the mod is conflicting with the game. I really want this to work, but I\u0027m getting\u003C/p\u003E\u003Cp\u003Enowhere; can someone explain what I\u0027m doing wrong?\u003C/p\u003E\u003Cp\u003EGame Specs: (Steam Version) - v0.20.2.186\u003C/p\u003E\u003Cp\u003EComputer Specs: Windows 7 Home Premium, i7 CPU 975 @ 3.33 GHz 3.33 GHz, 6.00GB RAM, 64-bit Operating System.\u003C/p\u003E\u003Cp\u003EControls: Razor Lycosa Keyboard, and Razor Death Adder Mouse. (These two only, no joystick.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-13T18:30:21Z\u0022 title=\u002206/13/2013 06:30  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 13, 2013\u003C/time\u003E by Silenvo\u003C/strong\u003E\n\u003Cbr\u003EEdit #0: Fixing ugly text and pondering when a response will come. [11:29 AM]\n\u003C/span\u003E\n"},{"CreatedByName":"Chestburster","CreatedById":69476,"CreatedDateTime":"2013-06-13T09:14:52Z","Content":"\n\u003Cp\u003EWith 0.9.5 my log gets flooded with \u0022Look rotation viewing vector is zero\u0022 and some planes cant start without getting \u0022sucked\u0022 into the nether, what means screen turning black, altimeter freaking out, navball and icons disappearing. Restarted the game multiple times to make sure its not just a hickup. Reverting back to 0.9.4 fixed the flood and the craft starts again fine.\u003C/p\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2013-06-13T10:38:13Z","Content":"\n\u003Cp\u003EOkay, so my aerodynamics skillz are crap. I need help. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeet the Lancer light personnel shuttle:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imghost.autochton.org/KSP/LancerView.png\u0022 alt=\u0022LancerView.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow meet my enemy: the Lancer\u0027s stability derivatives. Particularly Xw.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imghost.autochton.org/KSP/LancerCAS.png\u0022 alt=\u0022LancerCAS.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow the tooltip tells me that it ought to be negative. I have on occasion managed to get it marginally below zero - but never very far. I can\u0027t seem to find anything that has meaningful effect on this particular derivative - negative Xw basically means that upward wind pushes the plane backward, right? I have inclined my wings (pWings) every which way, swept or unswept them, shifted them back, forth, up or down, tried to find some way to make sense of it. But no. I have images with the centers of the plane visible, if that helps - but I figured I\u0027d leave off spamming images in the thread for now.\u003C/p\u003E\u003Cp\u003EHelp? How do I control my Xw?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-13T10:51:44Z\u0022 title=\u002206/13/2013 10:51  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 13, 2013\u003C/time\u003E by Autochton\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Weatherman159","CreatedById":48008,"CreatedDateTime":"2013-06-13T11:35:53Z","Content":"\n\u003Cp\u003EErm..just noticed that v 0.9.5 has removed all control surface management...they don\u0027t register or something...possible bug?\u003C/p\u003E\u003Cp\u003EEdit: Oh hell, it\u0027s the incompatibility of ModuleManager with the B9 pack. Ferram, could you possibly create a version that doesn\u0027t use MM? Or should I just edit the config files myself?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-13T13:39:55Z\u0022 title=\u002206/13/2013 01:39  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 13, 2013\u003C/time\u003E by Weatherman159\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"m4ti140","CreatedById":67296,"CreatedDateTime":"2013-06-13T11:39:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003ESQUAD hasn\u0027t released a patcher, and so everyone running 0.20.2 should have a copy of the zip somewhere on their computer. Re-extract the proper folder and overwrite the modified files.\u003Cp\u003EI also mentioned in the first post (prior to this update) to keep a backup of the Parts folder for the purpose of clearing out FAR\u0027s part.cfg overwrites.\u003C/p\u003E\u003Cp\u003EIf you haven\u0027t kept a backup of the Parts folder (as instructed) or you deleted the 0.20.2 zip file, you\u0027ll have to re-download KSP to get access to the files.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you mean by \u0022Squad hasn\u0027t released a patcher\u0022? I used the patcher I had in my download of 0.20 to update to 0.20.1 (which failed) and than to 0.20.2, which seems to have worked - my version number changed to 0.20.2 and there were no errors. Does it mean it didn\u0027t actually update and I should redownload the game? It seems to work correctly so far.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-06-13T12:54:49Z","Content":"\n\u003Cp\u003EAutochon: I must admit I\u0027m terrible at using the data, I only generally go check when something is really wrong. I will note your tail surface\u0027s \u0022neutral\u0022 position appears not to be end on to the airflow though, I can\u0027t see from that angle if that is going to result in any pitch-up force or no but it does kinda look like it might.\u003C/p\u003E\n"},{"CreatedByName":"Spanier","CreatedById":57247,"CreatedDateTime":"2013-06-13T13:48:35Z","Content":"\n\u003Cp\u003EFAR 0.9.5 has broken the SABRE engines from B9 and it makes atmospheric VTOL impossible.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-06-13T14:03:10Z","Content":"\n\u003Cp\u003ESABRE S works ok, M model not. I don\u0027t appear to be able to edit any stock control surfaces either ( after reinstalling the stock cfgs, yes ) - the FAR-enabled ones from other places are still working fine. Note the CoL marker too, that ought to be inside the CoM but I presume the SPH is using the default aero for the canards \u0026amp; tail \u0026amp; messing it up. Oddly the plane flies just fine!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.flickr.com/photos/64324284@N05/9034285506/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7291/9034285506_49d4676af6_c.jpg\u0022 alt=\u00229034285506_49d4676af6_c.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit: having checked other threads I suspect it\u0027s modulemanager itself having problems with the B9 engines, that\u0027s been reported before. I would guess it may not be loading Squad part edits or even FAR ones, given they\u0027re probably loaded later.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-13T14:30:13Z\u0022 title=\u002206/13/2013 02:30  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 13, 2013\u003C/time\u003E by Van Disaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2013-06-13T14:32:54Z","Content":"\n\u003Cp\u003EOkay, so I\u0027m back on the KSP scene after exams and I\u0027ve built a new modset using B9 aerospace and FAR as the centrepoint. And I want to build big - I love airliners and cargo planes. But I have a big engineering question to ask you experts: How do aeronautical engineers counter the pitch-up torque generated by engines slung below the centre of mass? I\u0027m having real trouble getting a plane that\u0027s aerodynamically stable with an offset CoT but I know it\u0027s possible because the evidence is in every airliner for the last 40-some years.\u003C/p\u003E\n"},{"CreatedByName":"Weatherman159","CreatedById":48008,"CreatedDateTime":"2013-06-13T14:47:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Van Disaster\u0022 data-cite=\u0022Van Disaster\u0022\u003E\u003Cdiv\u003Ehaving checked other threads I suspect it\u0027s modulemanager itself having problems with the B9 engines, that\u0027s been reported before. I would guess it may not be loading Squad part edits or even FAR ones, given they\u0027re probably loaded later.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is indeed the cause. I can\u0027t figure out why Ferram converted over to module manager (maybe it\u0027s easier to create one big config instead of editing some 15 different files), but hopefully he\u0027ll release a fix.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-06-13T15:37:35Z","Content":"\n\u003Cp\u003EI can see why - it means he never has to edit stock cfgs and we don\u0027t run the risk of half a dozen mods installing the same cfgs. Of course now one mod can break another in different ways, and I don\u0027t know what would happen if two mods tried editing the same section of cfg now, but it is a sensible idea.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-06-13T16:45:36Z","Content":"\n\u003Cp\u003EOk, as detailed \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25241-0-20-2-B9-Aerospace-Pack-R3-1-New-pods-IVAs-engines-fuselages-structures?p=449001\u0026amp;viewfull=1#post449001\u0022 rel=\u0022external nofollow\u0022\u003Ein this post\u003C/a\u003E using the ExsurgentEngineering bundled with Deadly Reentry has fixed all issues. Note you don\u0027t need DR itself, just the EE dll.\u003C/p\u003E\n"},{"CreatedByName":"Weatherman159","CreatedById":48008,"CreatedDateTime":"2013-06-13T18:15:33Z","Content":"\n\u003Cp\u003EHmm. I thought flaps where supposed to make a plane easier to control at lower speeds, making landing easier (and shorter). All mine seem to do is make the aircraft stall sooner and pitch it forward a lot. What am I doing wrong?\u003C/p\u003E\n"},{"CreatedByName":"s20dan","CreatedById":1080,"CreatedDateTime":"2013-06-13T18:30:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Weatherman159\u0022 data-cite=\u0022Weatherman159\u0022\u003E\u003Cdiv\u003EHmm. I thought flaps where supposed to make a plane easier to control at lower speeds, making landing easier (and shorter). All mine seem to do is make the aircraft stall sooner and pitch it forward a lot. What am I doing wrong?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Your flaps sound like they are too far behind the CoM. But tbh I hardly ever use them unless I\u0027m building a completely conventional aircraft.\u003C/p\u003E\n"},{"CreatedByName":"Weatherman159","CreatedById":48008,"CreatedDateTime":"2013-06-13T18:56:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022s20dan\u0022 data-cite=\u0022s20dan\u0022\u003E\u003Cdiv\u003EYour flaps sound like they are too far behind the CoM. But tbh I hardly ever use them unless I\u0027m building a completely conventional aircraft.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey ARE a fair bit behind the CoM, but to put them closer I\u0027d basically have to place them in the middle of the wing, and that would look weird.\u003C/p\u003E\n"},{"CreatedByName":"s20dan","CreatedById":1080,"CreatedDateTime":"2013-06-13T19:07:09Z","Content":"\n\u003Cp\u003EAs a test you could try slapping something pretty heavy on the back to move the CoM back towards the flaps, then you at least know if thats the problem. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2013-06-13T20:24:44Z","Content":"\n\u003Cp\u003EDamn. I just spent 20 minutes setting up for a mission with my new A400 Atlas-type plane, and the kerbals in the seats inside are spamming NaN errors to hell. Any help, ferram?\u003C/p\u003E\u003Cp\u003EEdit: I can\u0027t post a log file but the error was something like \u0027FAR Aerodynamic error\u0027 and listed the kerbal\u0027s names, one per log entry. Also worth noting is that when I tried to pitch up and down the elevators alternated like ailerons... bad results for said kerbals during a lagstorm. I tested again with the same conditions but without the kerbals in seats and there were no errors, so I assume it\u0027s a bug with FAR and seats.\u003C/p\u003E\u003Cp\u003EEdit#2: Nope, I\u0027m actually getting errors for any kerbals in the scene, at all times, moving or not. Same error as when in a seat.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-13T20:45:01Z\u0022 title=\u002206/13/2013 08:45  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 13, 2013\u003C/time\u003E by Volt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"g_audio","CreatedById":59063,"CreatedDateTime":"2013-06-13T21:09:10Z","Content":"\n\u003Cp\u003EWhy does the Vonnegut from the B9 pack become so uncontrollable for me? Atleast pitch wise. No matter what, it\u0027s extremely sensitive to pitch controls. Its like a see-saw flying through the air until I cant keep up with pressing W \u0026amp; S back and forth, then it begins spinning out of control. I don\u0027t even have any cargo in it, either.\u003C/p\u003E\n"},{"CreatedByName":"777-300ER","CreatedById":35729,"CreatedDateTime":"2013-06-13T21:12:41Z","Content":"\n\u003Cp\u003EWhenever I load FAR it never shows any control surfaces to configure when I have control surfaces on the aircraft. Any help guys?\u003C/p\u003E\n"},{"CreatedByName":"Weatherman159","CreatedById":48008,"CreatedDateTime":"2013-06-13T21:17:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022777-300ER\u0022 data-cite=\u0022777-300ER\u0022\u003E\u003Cdiv\u003EWhenever I load FAR it never shows any control surfaces to configure when I have control surfaces on the aircraft. Any help guys?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUsing the B9 pack I presume...find the Deadly Reentry mod, download newest version, overwrite the ExurgentEnginnering folder in your GameData with the one from Deadly Reentry.\u003C/p\u003E\n"}]}