{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":242,"Articles":[{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-10-11T01:32:10Z","Content":"\n\u003Cp\u003EHmmm. I knew their values had been tweaked, but what threw me off, and I failed to make clear earlier, is that they took off and flew rather well at low speeds. It was only when the speed was poured on, that they started fighting me. Glad to know a fix is in the works. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"IvanTehFennec","CreatedById":26927,"CreatedDateTime":"2014-10-11T03:08:08Z","Content":"\n\u003Cp\u003EHow about giving us a way to run this on the win64 build, regardless of instability? What if we don\u0027t care about it at all? I want to use x64, and don\u0027t care about the bugs.\u003C/p\u003E\n"},{"CreatedByName":"AetherGoddess","CreatedById":115971,"CreatedDateTime":"2014-10-11T03:27:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IvanTehFennec\u0022 data-cite=\u0022IvanTehFennec\u0022\u003E\u003Cdiv\u003EHow about giving us a way to run this on the win64 build, regardless of instability? What if we don\u0027t care about it at all? I want to use x64, and don\u0027t care about the bugs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe disable is not to protect you from bugs, it\u0027s to protect ferram when you come back and complain about squad bugs as if they were ferram\u0027s fault. \u003C/p\u003E\u003Cp\u003Ewhat you sugguest is exactly what a lot of mod makers did in .24, but 1) it didn\u0027t stop them getting complained at, and 2)the problem has gotten worse in .25. Linux x64 seems to be operating normally, and all the crashy is on the squad side of the wall, so modders just stopped letting their mods run at all in win x64.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-11T04:39:21Z","Content":"\n\u003Cp\u003EI tried leaving it open. I also tried allowing mods to run on KSP versions that they weren\u0027t intended for, so long as the user acknowledged that they were broken. In both cases, people ignored it and proceeded to make supporting the mod more difficult. So no more of that now, I\u0027d rather spend time working on issues that I can fix rather than issues that are from older builds or that are Squad / Unity\u0027s fault that I can\u0027t do a damn thing about. I\u0027m not going to help support something as broken as win64 KSP; that should have never gotten out of experimentals in the first place.\u003C/p\u003E\n"},{"CreatedByName":"coldblade2000","CreatedById":104385,"CreatedDateTime":"2014-10-11T04:55:43Z","Content":"\n\u003Cp\u003EI found a bug, don\u0027t know if it has been posted yet:\u003C/p\u003E\u003Cp\u003EIn the SPH, when you go to the data \u0026amp; stability derivatives screen and set mach number to 0, the window glitches out and stops working, but the game itself is unaffected. Picture here: \u003Ca href=\u0022http://i.imgur.com/ZPMN0XI.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ZPMN0XI.png\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-11T05:25:53Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@coldblade2000: \u003C/strong\u003EAnd nothing else? Using stock parts? Wings needed or just anything will do?\u003C/p\u003E\u003Cp\u003EEdit: Oh wait, this makes sense. Mach 0 corresponds to V = 0. Okay, I\u0027ll add something to prevent that.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-10-11T05:45:03Z","Content":"\n\u003Cp\u003EWith regard to some removed posts, you folks need to express yourself without resorting to insults.\u003C/p\u003E\n"},{"CreatedByName":"IvanTehFennec","CreatedById":26927,"CreatedDateTime":"2014-10-11T06:50:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EWith regard to some removed posts, you folks need to express yourself without resorting to insults.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, forgot we\u0027re not allowed to be angry at each other. I\u0027ll be a good little goy, I promise.\u003C/p\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2014-10-11T07:07:41Z","Content":"\n\u003Cp\u003EI think this whole saga is a good indication that Squad should never have released the x64 version in its current state.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2014-10-11T08:24:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voculus\u0022 data-cite=\u0022Voculus\u0022\u003E\u003Cdiv\u003EHmmm. I knew their values had been tweaked, but what threw me off, and I failed to make clear earlier, is that they took off and flew rather well at low speeds. It was only when the speed was poured on, that they started fighting me. Glad to know a fix is in the works. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not weight. I had a spaceplane from the earlier versions, which was 260t with cargo, and it flew wonderfully at almost all speeds and heights. New FAR update without cargo is 250t, and the instability doesn\u0027t make sense (at least considering the old FAR\u0027s working), even with a shifted CoM. You can just test old craft with almost empty fuel tanks.\u003C/p\u003E\u003Cp\u003ETaking a close look with a new plane, the issue seems to be excessive stalling at ~20k and mach 4\u002B, sometimes even lower at 15k/mach 2. Even going up 5 degrees from apoapsis can cause wings to stall. I\u0027m not saying it has to be the mods/games fault, but there has to be a huge change inside of FAR.\u003C/p\u003E\u003Cp\u003EMaybe someone can help with more information. This plane is something i threw together and modified it a bit. All stability derivates are green above Mach 2/3, at all heights. Also a mach 5 AoA sweep, i\u0027m not sure i could read critical failures out of it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/u7LimfQ.jpg\u0022 alt=\u0022u7LimfQ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-11T08:36:15Z\u0022 title=\u002210/11/2014 08:36  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 11, 2014\u003C/time\u003E by Temeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Senshi","CreatedById":57692,"CreatedDateTime":"2014-10-11T08:57:40Z","Content":"\n\u003Cp\u003ERegardless of x64 being buggy, I hate being patronized by a mod \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E . I personally simply don\u0027t experience a lot of issues with x64 (certainly less than with a x32 always bloating to the memory limit), and it allows me to utilize all the mods I like.\u003C/p\u003E\u003Cp\u003EI now compiled the .dll privately with the 64bit check removed and am enjoying FAR just as before. But it obviously would be nicer to just be able to toggle a flag somewhere. In the cfg maybe? With a capital letter comment that enabling x64 support void all support requests? So users have to do a manual change to activate 64bit, should make it more apparent they are venturing in the experimental area.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-10-11T09:01:26Z","Content":"\n\u003Cp\u003ESenshi: part of the lockout is it is a filter: those who can recompile it themselves will anyway. However, they take on the responsibility. More importantly, they take on the responsibility of providing support should they distribute the modified version.\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-10-11T09:34:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@DaMichel: \u003C/strong\u003EWing mass is computed using the \u0022supported area\u0022 of the joint, which is calculated from that wing\u0027s area and the area of all wing parts that are children of it. This supported area is then multiplied by a constant (in FARAeroData.cfg) to calculate the wing mass. I picked a number that I calculated for the wing mass per unit area of a MD-83 for that, but perhaps it should be lower.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks Ferram4. I do however suspect that this is bugged. See here. The multi part wing is heavier.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KGYyXo2.jpg\u0022 alt=\u0022KGYyXo2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewhere m means mass, obviously. I used the current dev version, commit fc25444.\u003C/p\u003E\u003Cp\u003EP.S. Ferram4, would you mind uploading some of your plane creations? Now that the former examples are gone i would genuinely love to see what you come up with using the new parts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-11T10:37:19Z\u0022 title=\u002210/11/2014 10:37  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 11, 2014\u003C/time\u003E by DaMichel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-10-11T10:26:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temeter\u0022 data-cite=\u0022Temeter\u0022\u003E\u003Cdiv\u003EIt\u0027s not weight. I had a spaceplane from the earlier versions, which was 260t with cargo, and it flew wonderfully at almost all speeds and heights. New FAR update without cargo is 250t, and the instability doesn\u0027t make sense (at least considering the old FAR\u0027s working), even with a shifted CoM. You can just test old craft with almost empty fuel tanks.\u003Cp\u003ETaking a close look with a new plane, the issue seems to be excessive stalling at ~20k and mach 4\u002B, sometimes even lower at 15k/mach 2. Even going up 5 degrees from apoapsis can cause wings to stall. I\u0027m not saying it has to be the mods/games fault, but there has to be a huge change inside of FAR.\u003C/p\u003E\u003Cp\u003EMaybe someone can help with more information. This plane is something i threw together and modified it a bit. All stability derivates are green above Mach 2/3, at all heights. Also a mach 5 AoA sweep, i\u0027m not sure i could read critical failures out of it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/u7LimfQ.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/u7LimfQ.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis does match with my experience since the update. I don\u0027t know if it\u0027s due to heavy wings or not, but I am struggling to control pretty much anything above 25,000m, regardless of what the analysis screens say. Lack of lift and dangerous stalls at small AoA\u0027s. I can get to orbit, but it\u0027s a chore. It almost feels like flying in stock aero again.\u003C/p\u003E\u003Cp\u003EI\u0027m pretty much focussed on rockets and career mode until this shakes out. \u003Cstrong\u003E\u003Cem\u003EKerbodyne SSTO Division\u003C/em\u003E\u003C/strong\u003E is taking a temporary holiday.\u003C/p\u003E\u003Cp\u003EThe dev build looks promising, though.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2014-10-11T11:09:03Z","Content":"\n\u003Cp\u003EJep, i\u0027m also trying the devbuild (the 250t plane was the normal 14.2). The modifiable wing mass is great! Can\u0027t wait to see to what extremes i can drive my spaceplanes.\u003C/p\u003E\u003Cp\u003EAlso thx to ferram for making the general wing weight a bit less extreme. Just adding a few wings was a bit to simple before, but i feel the now adjusted way is better than throwing winged stones at the sky.^^\u003C/p\u003E\u003Cp\u003Eedit: Huh, I just brought a stone into stable orbit. Interesting point: EDIT: Nope, nvm. There seems to go on more than i understand... Oo\u003C/p\u003E\u003Cp\u003EAlso, very light wings might be a bit to stable. Might have been a procedural wings thing, but even big B9-stabilisators did withstand some crazy stuff. Hard stall including incontrollable spiral (at ~15k), and nothing happened to 0.2 to 0.4 mass stuff.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-11T12:55:00Z\u0022 title=\u002210/11/2014 12:55  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 11, 2014\u003C/time\u003E by Temeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wingnutspeed","CreatedById":120008,"CreatedDateTime":"2014-10-11T13:10:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EBe prepared to wait for a long time then. x64 is unstable because of underlying Unity issues and sloppy programming from squad. You\u0027ll probably have to wait for Unity 5 to be released before you see a stable x64 KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei dont care about stable my .24.2 crashes all the time bot thats becouse allot of mods that i use i just dont want to use incompatible mods so when all mods all compatible i go to .25 if it is stable or not\u003C/p\u003E\n"},{"CreatedByName":"JackCY","CreatedById":111233,"CreatedDateTime":"2014-10-11T13:41:52Z","Content":"\n\u003Cp\u003EWhere can I find the devbuild? Or do I have to compile myself from latest source?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003ETry setting the gains. It doesn\u0027t automatically do it for you, because tuning those values automatically will always go badly.\u003Cp\u003ETry setting the AoA limit lower?\u003C/p\u003E\u003Cp\u003EIt\u0027s to prevent you from overcontrolling the plane during high-dynamic pressure maneuvers. Maybe you should mess with the options.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will try some more but so far I think reducing the power my me control surfaces would work better than guessing random numbers.\u003C/p\u003E\u003Cp\u003EOften I get oscillation when I use anything else but stock SAS, I do turn off SAS when trying the FAR helpers, it seemed to me they fight each other otherwise.\u003C/p\u003E\u003Cp\u003ESo far I had to resort to use stock SAS for stabilization of roll/pitch and couple it with DCA while changing the Scaling Velocity mid flight to get proper control force. The Scaling Altitude didn\u0027t seem to have any effect at all on the Control Factor, trying it again, it does have an effect but the number put there are different by thousands of times to have any effect on the control factor.\u003C/p\u003E\u003Cp\u003ERight now I got on runway and the plane oscillates, opened FAR and the helpers are turned on, stock SAS is off, MJ is not present on this craft.\u003C/p\u003E\u003Cp\u003EIt does this even when flying most of the time.\u003C/p\u003E\u003Cp\u003EThe AoA limiter, I have it set to 1 degree but it will happily do 10-15 degree anyway.\u003C/p\u003E\u003Cp\u003EChanged helpers to 0.01 from default 0.1 but they still oscillate the same way as before when landed.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Ca href=\u0022http://imgur.com/RrIHNwr\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/RrIHNwrl.png\u0022 alt=\u0022RrIHNwrl.png\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://imgur.com/cdigCn4\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/cdigCn4l.png\u0022 alt=\u0022cdigCn4l.png\u0022\u003E\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EEven when flying the FAR helpers like to oscillate no matter what and usually do overshoot instead of lower the input a little they like to shoot all the way to the other side so instead of going less up it turns it all the way to going down for example and then back up and down and up again ... And when I manage to get rid of oscillation from the helpers it also turns out that their power is negligible and I might just turn them off as it has the same effect.\u003C/p\u003E\u003Cp\u003ECaused me many stalls when trying the helpers, the dampening instead of reducing oscillations introduces them even when I lower the forces ten times.\u003C/p\u003E\u003Cp\u003ETried a leveler now, instead of turning the short way around, it turned the long way, another large stall as it rotated out of control.\u003C/p\u003E\u003Cp\u003EGlad I took my cargo version and not the heavy passenger version of the plane. This one is much more recoverable.\u003C/p\u003E\u003Cp\u003EThe AoA limiter so I set it to 5 but it happily keeps going 10-15 AoA and if I increase the force it will oscillate. It helps but not very much, have it at 5 degrees and k=0.05 to get 15 degree turn at this moment of my flight. But some other time in the flight I might have to reset this again so it corrects AoA desirably. That is not very practical as all I do is change values in helpers AoA and DCA instead of flying and before any important steering I have to reset the helpers so I can steer well and am not limited too much or too little.\u003C/p\u003E\u003Cp\u003EWhen I want to recover, turn off all FAR helpers, hit stock SAS ON and keep it moving usually down or to the direction closest of prograde if it can move close to it that easily.\u003C/p\u003E\u003Cp\u003EI think bill and jeb must have thrown out in the cockpit by now because that was so far at least 6 spinning stalls. 10t plane, doing 1-2 mach at 10-20km.\u003C/p\u003E\u003Cp\u003EIt\u0027s quite a challenge to make the helpers work well and set them up for one plane. None will hold altitude though. Have to use stock SAS or MJ for that.\u003C/p\u003E\u003Cp\u003EIf I use stock SAS and couple them with the helpers, they don\u0027t have enough power or get overridden by SAS.\u003C/p\u003E\u003Cp\u003EGuess my plane could be a bad design or 0.25 is harder flying than 0.24. Just flew FAR Jet Liner and that\u0027s a piece of cake even landing on first try, no stalls, impossible to stall even without helpers, nothing really needed apart from something to keep height locked. All the example planes in 0.24 seem to have very different graph and most use wings up above to keep CoL above CoM, usually heavy with little amount of control surfaces. With no apparent stall curve in the graph and with Cm always in graph shooting up which I cannot achieve in 0.25. Maybe having a huge tail wing helps?\u003C/p\u003E\u003Cp\u003EA simple, small example craft would be great to have. Don\u0027t need zillions of them like there were in 0.24. A basic one, just one is enough so we can see ok these is what is stable with FAR and it looks like this and that in the graph.\u003C/p\u003E\u003Cp\u003EI bet my plane is too short and since it has all lift at the middle it makes it easy to stall compared to planes that have front and rear wings more similar in lift.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou only have to click one button. You don\u0027t need to update the CoL before the sweep; the button is there for if any errors occur for the indicator alone. I\u0027ll make sure to remove it to reduce confusion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me try again. My bad, it had me confused. The CoL marker/indicator for me updates fine and graph seems to update OK without the Update CoL. I don\u0027t mind the button, keep it, I just couldn\u0027t find explanation while in game in the help for what it does and it wrongly seemed to have helped to update before doing a sweep.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt actually remembers three different values, but I\u0027m not sure what you want: another entire window for the settings for each sweep type?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll illustrate on my silly Kerbal carrier that I use for testing purposes:\u003C/p\u003E\u003Cp\u003EI would say it remembers 4 values: Lower, Upper, Num Pts (precision), Mach/AoA\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ESo I do a sweep for AoA with values: 0, 25, 50, 0.2, the default ones I think. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThen I do a sweep for Mach but the values used are again 0, 25, 50, 0.2, which is not very useful so I change them to: 0, 5, 50, 15 \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eand sweep Mach again. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u0022Now I have made changes to the plane.\u0022 And proceed to do AoA sweep, click and the values used are not 0, 25, 50, 0.2 as I used for AoA before but it uses the new modified values I have used for Mach sweep the 0, 5, 50, 15 so I get again a not very useful graph \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eand have to change the values again and resweep once more, every time I do different type of sweep. \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Ca href=\u0022http://imgur.com/dl3yOEU\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/dl3yOEUl.png\u0022 alt=\u0022dl3yOEUl.png\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://imgur.com/rttuNWO\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/rttuNWOl.png\u0022 alt=\u0022rttuNWOl.png\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://imgur.com/YsTQ512\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/YsTQ512l.png\u0022 alt=\u0022YsTQ512l.png\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://imgur.com/C4q15G8\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/C4q15G8l.png\u0022 alt=\u0022C4q15G8l.png\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://imgur.com/Xz1mX1K\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Xz1mX1Kl.png\u0022 alt=\u0022Xz1mX1Kl.png\u0022\u003E\u003C/a\u003E \u003C/blockquote\u003E\u003Cp\u003EIt would be useful if it remembered the values for the type of sweep it is doing. It should not be hard to detect what values to use:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPrevious sweep/next sweep/values to use:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Enone/AoA/default useful values for AoA or remembered from previous AoA sweep if possible\u003C/p\u003E\u003Cp\u003Enone/Mach/default useful values for Mach or remembered from previous Mach sweep if possible\u003C/p\u003E\u003Cp\u003EAoA/AoA/those entered in the text fields\u003C/p\u003E\u003Cp\u003EAoA/Mach/those remembered from last Mach sweep or default if no previous Mach sweep was done\u003C/p\u003E\u003Cp\u003EMach/Mach/those entered in the text fields\u003C/p\u003E\u003Cp\u003EMach/AoA/those remembered from last AoA sweep or default if no previous AoA sweep was done\u003C/p\u003E\u003Cp\u003EIt would then remember 4 values for each type, 8 values total. Precision is not important so it could as well be 3 and 6.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThere \u003Cem\u003Ewas\u003C/em\u003E. Then Squad updated the plane parts and they were all broken.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see, I might check 0.24 then and see what is there. Thanks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-11T16:30:07Z\u0022 title=\u002210/11/2014 04:30  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 11, 2014\u003C/time\u003E by JackCY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-10-11T13:57:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EThere \u003Cem\u003Ewas\u003C/em\u003E. Then Squad updated the plane parts and they were all broken.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can help making planes that could be made stock far planes, several people who start with the mod need them to remember how an actual plane flies before building their own.\u003C/p\u003E\n"},{"CreatedByName":"Baughn","CreatedById":107565,"CreatedDateTime":"2014-10-11T18:28:36Z","Content":"\n\u003Cp\u003ENope, can\u0027t seem to make a stable plane. :-(\u003C/p\u003E\u003Cp\u003EIf this is fixed in the dev build, could someone please point me at it? I can\u0027t seem to find one.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-11T19:11:46Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Temeter: \u003C/strong\u003EThere were some changes to the raycasts used by wing interaction stuff to get around some issues with the SP\u002B wings. I guess I\u0027ll just have to recode the whole damn thing.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Senshi: \u003C/strong\u003EGood to hear! Now you\u0027re on your own, until win64 is stable. Have fun, and don\u0027t complain.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Da Michel: \u003C/strong\u003EOkay... I guess I\u0027ll need to recode that then.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@wingnutspeed: \u003C/strong\u003ENo, win64 is unstable because win64 is busted. The number of mods just exacerbates an already-existing stock issue. There are also pretty much no incompatibilities between mods; I don\u0027t know where you even got that idea.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@JackY: \u003C/strong\u003EIf changing the gains and limits did nothing, then you didn\u0027t click the update values button. I think that you are expecting an autopilot rather than minor control assistance from the control assistants; perhaps you should code one of those up.\u003C/p\u003E\u003Cp\u003ELanded and stopped control oscillations are known; it\u0027s caused by the velocity vector changing direction like crazy, because you\u0027re never perfectly stopped.\u003C/p\u003E\u003Cp\u003ENone of the control assistants are intended to hold attitude. As I said, they are assistants, not autopilots.\u003C/p\u003E\u003Cp\u003EI\u0027m not building example craft again. They quickly become out-of-date if I update the physics to be more realistic and I expect that the spaceplane parts will get another pass anyway.\u003C/p\u003E\u003Cp\u003ESo... you do want a different window with each value for the sweeps. Yeah, not going to bother.\u003C/p\u003E\u003Cp\u003EAs a side note, I\u0027ll bet that plane of yours has really stupidly high wing loading.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Baughn: \u003C/strong\u003EA completed build can always be found in the github repo.\u003C/p\u003E\n"},{"CreatedByName":"JackCY","CreatedById":111233,"CreatedDateTime":"2014-10-11T20:56:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@JackY: \u003C/strong\u003EIf changing the gains and limits did nothing, then you didn\u0027t click the update values button. I think that you are expecting an autopilot rather than minor control assistance from the control assistants; perhaps you should code one of those up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do click it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve made minor changes to the plane and now it flies almost perfect with stock SAS, no need for FAR helpers or anything, not even DCA or AoA.\u003C/p\u003E\u003Cp\u003EThe plane is small and the control surfaces were strong, so strong that FAR helpers were oscillating when trying to correct the plane and when \u0022k\u0022 changed they don\u0027t they lost all steering ability altogether. I\u0027ve lowered the power of control surfaces and now it flies fine.\u003C/p\u003E\u003Cp\u003EBoth slow speed \u0026lt;0.5 and mach 4.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ELanded and stopped control oscillations are known; it\u0027s caused by the velocity vector changing direction like crazy, because you\u0027re never perfectly stopped.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes but why make any corrections if the velocity vector is tiny? It must have a value something like direction, don\u0027t care about that one for this but also speed at which it is moving in that direction, now if that speed is tiny do not try to correct the steering. Should remove oscillations when landed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENone of the control assistants are intended to hold attitude. As I said, they are assistants, not autopilots.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, they dampen yaw, pitch, one does hold roll to 0 and the rest limits steering.\u003C/p\u003E\u003Cp\u003EGuess I will have to look elsewhere for a hold pitch.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo... you do want a different window with each value for the sweeps. Yeah, not going to bother.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot a different window but a smarter way the values are remembered is all as described in previous post. Store one extra variable of what was the previous type of sweep done, store 6 values total and a few if/else, done.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs a side note, I\u0027ll bet that plane of yours has really stupidly high wing loading.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould be, it\u0027s 10-20t and FAR says reference area 35m2 if that means wing area.\u003C/p\u003E\u003Cp\u003EAt current 11t and 35m2 that puts it to 315kg/m2 a little over Eurofighter Typhoon\u0027s 313kg/m2.\u003C/p\u003E\u003Cp\u003EAt 20t that would be 571kg/m2 which is less than A380 with around 663kg/m2. F22 has 376kg/m2.\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003EI\u0027ve made a different plane that is similar to the 0.24 example planes but it does not take off very well. Has wings placed up top with a large area. It\u0027s much heavier since it has many fuel tanks. Flies ok but is slow despite having higher TWR, the wings must give it quite some drag.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-11T21:03:25Z\u0022 title=\u002210/11/2014 09:03  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 11, 2014\u003C/time\u003E by JackCY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-10-11T21:26:16Z","Content":"\n\u003Cp\u003EFAR reference area is for *all* wings, including horizontal and vertical tails. In real life, only main wings\u0027 wing area is used. So your wing loading is more like 400-450kg/m^2\u003C/p\u003E\n"},{"CreatedByName":"DundraL","CreatedById":118705,"CreatedDateTime":"2014-10-11T21:47:28Z","Content":"\n\u003Cp\u003EHey just another lurker here....\u003C/p\u003E\u003Cp\u003EAfter finding my wing parts much too heavy with the recent update, I read this thread and found the dev/master version on github...\u003C/p\u003E\u003Cp\u003EAfter which I found that the default strength for wings is much heavier than stock counterparts....\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003EAny way I would ask that you consider making the default position for the \u0022mass/strength\u0022 slider at a point where the mass would match with the part description. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003EA step further and you might even allow a config file to change the default slider position for those who find themselves constantly tweaking every wing surface higher/lower.\u003C/p\u003E\u003Cp\u003EOther concerns with this is that some challenges may start disallowing FAR \u0022because it can change the mass of stock parts\u0022... that\u0027s not something I want but again, the decisions are yours to make.\u003C/p\u003E\u003Cp\u003EAlso, I have noticed some changes to stability in existing craft, but I\u0027ll come back to this later as I expect there will be further changes to both stock and FAR that would prb render any fine tuning obsolete...\u003C/p\u003E\u003Cp\u003EAny way, thanks for the time- DundraL\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-11T21:53:51Z\u0022 title=\u002210/11/2014 09:53  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 11, 2014\u003C/time\u003E by DundraL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Baughn","CreatedById":107565,"CreatedDateTime":"2014-10-11T22:16:19Z","Content":"\n\u003Cp\u003EI didn\u0027t expect binaries to be checked into github... but that works.\u003C/p\u003E\u003Cp\u003EI found the dev build, and it works fine, in the sense that my planes now fly. This feels like a major achievement. ^^;\u003C/p\u003E\u003Cp\u003EHowever, the analysis system appears to be broken; the graphs all go up and to the right, stability derivatives suggest my airplane should go into a spin and tear itself apart on takeoffÃ¢â‚¬â€possibly without movingÃ¢â‚¬â€and the displayed wing area is 1 m^2 regardless of actual area. Maybe I installed something wrong?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-11T22:27:38Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@DundraL: \u003C/strong\u003EI can\u0027t do that though. The stock wing masses are so low that the wings would rip off under tiny forces if I tried to get them close, and considering that the mass of the root of a wing will always be heavier than the mass of a similar piece placed at the tip of a wing. The best I can do is to have the wing mass appear in the tweakables readout.\u003C/p\u003E\u003Cp\u003EAlso, I don\u0027t care if challenges disallow FAR. Most already do because of the lower dV to orbit. No skin off my nose.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Baughn: \u003C/strong\u003EI suspect a bad install. Nothing has changed there for that to be the case, and it works fine for me.\u003C/p\u003E\n"}]}