{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":165,"Articles":[{"CreatedByName":"thorfinn","CreatedById":8349,"CreatedDateTime":"2014-05-03T20:44:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAnything above ~200 m/s near SL is asking for trouble.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIsn\u0027t that a bit too harsh? Strike fighters like the F111 can go (barely) supersonic on the deck in real life... then again, I suspect their ailerons aren\u0027t commanded by keystrokes to flap wildly around. Flying with a joystick should make things easier?\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-05-03T20:54:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003ENo what I mean when I say \u0022realistic gravity turn\u0022 Is a pitch maneuver at 200 meters. Not 10km. Its the main reason I use FAR. Not for the flight dynamics.. I don\u0027t build planes much if at all.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnless you think a gravity turn is from 90 to 40 degrees in 5 seconds, there is no reason why your gravity turns would not work. Follow the velocity indicator.\u003C/p\u003E\u003Cp\u003EOne of the best ways I have found to stay stable is to pitch only as far as the end of the velocity vector indicator circle. Sort of like you are pulling it. This way you are never reaching ridiculously unrealistic AoA and Sideslip degrees.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-05-03T21:50:00Z","Content":"\n\u003Cp\u003EUhm.. sorry to cause the confusion. Ascent is not the problem I was having my pitch maneuver with FAR is as good as it gets. The issue I posted was with my craft disassembling on reentry. Which has been solved. I think.. I had a craft break apart that did NOT flip over on reentry. But as long as I can disable this feature then there\u0027s no worries.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-05-03T21:58:59Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@thorfinn: \u003C/strong\u003EOf course, and it\u0027s possible to build planes that fly much faster at SL. Hell, the example FAR Hypersonic Demon can manage Mach 2.2 at SL if you fly it right. The problem is that above 200 m/s full control deflections are often enough to exceed the maximum forces on the vehicle and make it break apart. I suspect that taking an F111 supersonic at SL and then pulling back hard won\u0027t end well for the plane, just as it won\u0027t end well here.\u003C/p\u003E\u003Cp\u003EBut it\u0027s asking for trouble, since there\u0027s almost no time to prevent the plane from flying apart if you start to lose control or you make too aggressive a maneuver. Everything\u0027s happening too fast for normal reaction times.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-05-04T00:35:28Z","Content":"\n\u003Cp\u003EMach 2 at SL is very possible, yes. So is maintaining control then.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/PPV50xc.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/PPV50xcl.jpg\u0022 alt=\u0022PPV50xcl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPulled up slowly to \u002B20, hit Mach 2.7 by 12km (accelerating all the way, Avon 301R is a *beast*)\u003C/p\u003E\n"},{"CreatedByName":"bludclot","CreatedById":102393,"CreatedDateTime":"2014-05-04T05:22:18Z","Content":"\n\u003Cp\u003EHELP! I installed new versions of stuff and now all my designs that flew awesome before just disintegrate soon as they leave the runway.. Game is unplayable for me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-05-04T05:44:37Z","Content":"\n\u003Cp\u003ESlower takeoff speed.\u003C/p\u003E\u003Cp\u003EMore wing area.\u003C/p\u003E\u003Cp\u003ELess vehicle mass.\u003C/p\u003E\u003Cp\u003ELower thrust.\u003C/p\u003E\u003Cp\u003EWithout seeing a picture of your vehicles, I can only assume what you\u0027re doing wrong and give you those general tips.\u003C/p\u003E\n"},{"CreatedByName":"bludclot","CreatedById":102393,"CreatedDateTime":"2014-05-04T08:06:26Z","Content":"\n\u003Cp\u003EThank you @ferram4! \u003C/p\u003E\u003Cp\u003EAs long as I know this added destruction isn\u0027t a bug I am happy.\u003C/p\u003E\u003Cp\u003ESince I love everything else about FAR and it is kind of essential to my enjoying the game I decided to start of fresh any way with new designs.... This is my first one. It works great!\u003C/p\u003E\u003Cp\u003EPics and .craft files up in here!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/gallery/BOPgk\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gallery/BOPgk\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe upper atmosphere from 40- to 100km seems very different to me.... Is this right? I had an RTG fall off because of FAR at 90km.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ccQNePw.jpg\u0022 alt=\u0022ccQNePw.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Read have Read","CreatedById":60863,"CreatedDateTime":"2014-05-04T09:25:54Z","Content":"\n\u003Cp\u003E@Ferram,\u003C/p\u003E\u003Cp\u003EI guess I conflated the concept of \u0027the sound barrier\u0027 with Max Q, removed it from my earlier post.\u003C/p\u003E\u003Cp\u003EAbout the Eclipse III: It seems you have a pair of the Aerodynamic Junctions near the middle of the craft just ahead of the COM, what do they do, are they for Area Ruling? \u003C/p\u003E\u003Cp\u003EThe Wedge tail I found on the X-15, but I can\u0027t seem a word for the cut in near the intakes. The wing seems like a Cranked delta like the F-16LX but elongated in the rear, but otherwise I can\u0027t find anything similar except for \u003Ca href=\u0022http://media.moddb.com/images/articles/1/149/148120/auto/1389382044loadout_fb-22a.jpg\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E. Are there terms for these aspects that are escaping me?\u003C/p\u003E\u003Cp\u003EAlso, I notice a lack of lighting on the plane and that it always wants to roll to the right, at all speeds for some reason \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LzmkQuR.png\u0022 alt=\u0022LzmkQuR.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-04T21:50:06Z\u0022 title=\u002205/04/2014 09:50  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 4, 2014\u003C/time\u003E by Read have Read\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-05-04T19:28:20Z","Content":"\n\u003Cp\u003E@bludclod: this craft looks really nice!\u003C/p\u003E\u003Cp\u003E@ferram4: Hey Ferram, i just used the B9 SABER S Engines after a long time again and i found them to be monstrous compared to the nerfed RAPIERS, still delivering 150kN @25km. I\u0027m a bit confused. I assume you haven\u0027t nerfed the SABERs (yet)? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DivisionByZero","CreatedById":62591,"CreatedDateTime":"2014-05-04T19:51:25Z","Content":"\n\u003Cp\u003EOk. So reentry with a space plane is really hard now (especially with DRE). Are there any tutorials or guides on this?\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-05-04T19:59:06Z","Content":"\n\u003Cp\u003EHow is it hard? Just keep the nose above the prograde indicator and don\u0027t make a steep reentry. I am reentering with an apo of about 15 km(stock DRE settings), nose at about 25-30 deg.\u003C/p\u003E\u003Cp\u003EThe craft position makes all the difference in temperatures. I had a save at 45 km, at first try I destroyed half of the SSTO because it was pointing too close to the velocity vector. 5 degrees more on the next try gave me the chance to reenter without ever exceeding 1000C on the cockpit.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-05-05T00:27:18Z","Content":"\n\u003Cp\u003Esmunisto: while your advice is mostly good (15km?!? typo?), your terms are a little messed up: apo(apsis) is your high point, not your low point.\u003C/p\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-05-05T04:35:14Z","Content":"\n\u003Cp\u003EFerram, \u003C/p\u003E\u003Cp\u003ECould you make FARAeroStress based on PartModule? It would be very interesting to set custom parameters to different types of parts, for example the FS rotor blades I\u0027ve been working on. Another idea is to reduce the mass of procedural wings at the expense of aero stress tolerance.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-05-05T05:15:37Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@DaMichel: \u003C/strong\u003EI\u0027m not touching mod engines. Ever. If I start having to making tweaks to 3rd party mods I\u0027ll end up spending more time on \u003Cem\u003Ethat\u003C/em\u003E then on FAR itself. Beyond that, since B9 isn\u0027t compatible out-of-the-box for KSP 0.23\u002B I\u0027ll have to make sure that whatever I would come up with works with all the possible ways that someone could fix them, and I\u0027d prefer not to try and troubleshoot that as well.\u003C/p\u003E\u003Cp\u003EAnd besides that, thrust is only a function of altitude if you\u0027re running low on IntakeAir, so using thrust at altitude is a poor comparison. I also know that I tweaked the turbojet and RAPIER engines so that their thrust falls off at about the same velocity as the B9 SABREs fall off, so they should perform somewhat similarly.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@DivisionByZero: \u003C/strong\u003EPut your spaceplane in a draggy, high AOA configuration. The space shuttle reentered at ~40 degrees AoA, you should be around 20 at least. Anything below that and you\u0027re not going to bleed off velocity fast enough.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@camlost: \u003C/strong\u003EAnother entry for FARAeroStress... fine, I can do that. However, scaling mass with stress tolerance isn\u0027t going to happen, entirely because all the wing parts in game are 1/10-1/5 the mass they should be, so first I\u0027d have to scale all the masses up properly. Lots of balancing work for other mods, and I\u0027m not dealing with that.\u003C/p\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-05-05T05:36:13Z","Content":"\n\u003Cp\u003ENot asking you to balance all wings, just asking access to YmaxStress and XZmaxStress in game,which seems impossible currently? Then other mods can balance wings for different purposes ranging from solar planes to space shuttles \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-05-05T06:16:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003Esmunisto: while your advice is mostly good (15km?!? typo?), your terms are a little messed up: apo(apsis) is your high point, not your low point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it was way too late.\u003C/p\u003E\u003Cp\u003E15 km was not a typo, like Ferram said - with a 15-20km Pe it is completely possible to reenter if your craft can support a high AoA. I have tried multiple reentries with 30km Pe and it is too slow, to get anywhere near the KSC you have to put the Periapsis on the other side of the planet roughly. \u003C/p\u003E\u003Cp\u003EBy the way, technically when you reenter your Pe becomes your Ap \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-05-05T07:12:34Z","Content":"\n\u003Cp\u003EHm. Okay, it was probably more an matter of plane design. Either that or it\u0027s the intakes because it had only one of those shock cone intakes per engine and also the RAPIERS performed pretty well with them. Will have to make sure the B9 stuff has really all the fixes ...\u003C/p\u003E\n"},{"CreatedByName":"MunMun","CreatedById":110323,"CreatedDateTime":"2014-05-05T11:53:38Z","Content":"\n\u003Cp\u003EHelp, I recently installed this mod and all the parts are gone, even the default ones! The game launches fine but there are no parts, my ships are gone too!\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-05-05T12:11:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MunMun\u0022 data-cite=\u0022MunMun\u0022\u003E\u003Cdiv\u003EHelp, I recently installed this mod and all the parts are gone, even the default ones! The game launches fine but there are no parts, my ships are gone too!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you have in your Gamedata folder? Sounds like the contents of that have gone missing/been replaced by the FAR folder.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-05T12:14:48Z\u0022 title=\u002205/05/2014 12:14  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 5, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2014-05-05T12:13:09Z","Content":"\n\u003Cp\u003EProbably on Mac, when you paste on Mac it replaces the folder (your case, GameData). You need to merge the contents, so verify integrity with steam and just paste the FAR folder/module manager dll instead of replacing all of GameData.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-05-05T13:31:05Z","Content":"\n\u003Cp\u003EHas anything changed in the new versions other then the structural failures? I\u0027ve got this rocket with a 1.5 TWR on the pad. Thing flew like a dream last week. I started my pitch maneuver at 250 meters and continued on a shallow ascent profile to the point where my circularization burn was only 50m/s or so. \u003C/p\u003E\u003Cp\u003ENo longer is this possible. Now it feels like the rocket is dragging a parachute. The same ascent profile on the same rocket causes a stall and the rocket falls back to Kerbin. I need to now perform a much steeper ascent with a circularization burn of 450m/s. My thrid stage meant for TMI now has to burn all of its fuel to get the payload to orbit instead of to the Mun. I was so proud of how well this rocket worked last week when I first made it, but now it needs to be completely redesigned. And.. how in the hell am I fighting gravity with a 1.5 twr? Hell the second stage has a 1.68 twr and the thing still limps to orbit. So.. what changed?\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2014-05-05T15:04:35Z","Content":"\n\u003Cp\u003EIs FAR actually working? That sounds almost like stock performance!\u003C/p\u003E\n"},{"CreatedByName":"ayana","CreatedById":105618,"CreatedDateTime":"2014-05-05T15:14:02Z","Content":"\n\u003Cp\u003EI made a launch pad TWR of 1.2 work perfectly. So I doubt FAR is at fault.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-05-05T15:20:17Z","Content":"\n\u003Cp\u003EI\u0027d check to see if FAR is installed correctly..\u003C/p\u003E\n"}]}