{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":34,"Articles":[{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-06-26T15:51:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Van Disaster\u0022 data-cite=\u0022Van Disaster\u0022\u003E\u003Cdiv\u003EI did movable wings ( well, wingtips ) with Damned Robotics a while back and it did work as it was meant to, to shift the CoL a little, so I suspect we just need a better hinge part. Wings attached to DR hinges are not terribly stable.\u003Cp\u003EFor supersonic craft especially you really want the CoL ball inside the CoM ball in the SPH, and preferably at the balance point of the tanks, although all you really need is enough tankage either side so you can pump fuel around a little to trim for various parts of a mission ( mainly referring to spaceplanes at this point ). Don\u0027t forget once you go supersonic the CoL is going to move backwards.\u003C/p\u003E\u003Cp\u003EI like this:\u003C/p\u003E\u003Cp\u003E-snip-\u003C/p\u003E\u003Cp\u003EAnd for spaceplanes I don\u0027t think I\u0027ve ever got better than this:\u003C/p\u003E\u003Cp\u003E-snip-\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only reason I keep my CoL back a bit (especially with my HL Cargo setups B9) is that usually I\u0027m dealing with a lot of fuel tanks, and since KSP likes to drain the front tanks first, I like to give myself a bit of leeway. Back in .19 I think, I had an SSTO for moving crew around my stations. Well one particular mission I was bringing 12 Kerbals back to the KSC from orbit in a newish, somewhat untested version of said ship and due to the front tanks being drained and the CoM shifting (and no way for me to see it outside of the SPH/VAB), I ended up in an unrecoverable spin as soon as I hit the dense atmo. Hence, I keep my CoL back a bit, just in case. Mind you, for most of my SSTO craft I tend to take quite a high exit trajectory to orbit, thereby quickly bypassing what to me has become that dreaded transition area between atmo and space.\u003C/p\u003E\u003Cp\u003EEDIT: I did some moveable wings with Damned Robotics myself, but I could never get the aesthetic I wanted. I either had to offset the wings vertically, or do a biplane-style front wing section with a single sweepable wing, or visa-versa.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-26T15:55:32Z\u0022 title=\u002206/26/2013 03:55  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 26, 2013\u003C/time\u003E by espm400\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-06-26T16:01:09Z","Content":"\n\u003Cp\u003ETAC fuel balancer is an essential part of all my spaceplanes. I tend to drain the front tanks on the way up to cover transonic issues where I don\u0027t have enough front lift, then balance them all until I want to re-enter - maybe pump a bit around if I\u0027m having issues transferring to orbit, sometimes the plane goes a bit odd when I finish my AP burn. At re-entry I usually pump one of the front tanks as full as it can go until I\u0027m back in normal atmospheric flight, and then balance them again. Being able to pump fuel about is wonderful.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-06-26T19:39:05Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Black-Talon: \u003C/strong\u003ETrying to set up the FARControllableSurface module to work on wings with control surfaces causes some very weird things to happen, primarily because it acts as if the entire wing part is rotating. FAR can zero out the values for Winglet and ControlSurface parts in-game, so changing that is unnecessary. Further, the FSwingletRangeAdjustment can only affect the stock ControlSurface part, not FAR parts. The extra values in the Firespitter configs are old fields and are unnecessary.\u003C/p\u003E\u003Cp\u003EFinally, if only Cl is appearing on you AoA sweep then that means that something is wrong in the drag / moment calculations and those values are being pushed off the chart.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Asdefjak: \u003C/strong\u003EThe \u0022isShielded\u0022 field only applies to parts in cargo bays and payload fairings. Everything is functioning properly. I guess I\u0027ll just remove the visibility of that field to reduce confusion.\u003C/p\u003E\n"},{"CreatedByName":"theflyingfish","CreatedById":17741,"CreatedDateTime":"2013-06-26T19:47:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MR4Y\u0022 data-cite=\u0022MR4Y\u0022\u003E\u003Cdiv\u003EI can never land my planes, but all of them take off at more than 100 m/s. \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003ESome even break the sound barrier before leaving the runway, like my SpaceShipOne \u002B White Knight build.\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait, WHAT.\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-06-26T19:49:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@asdefjak: \u003C/strong\u003Ethe \u0022isshielded\u0022 field only applies to parts in cargo bays and payload fairings. Everything is functioning properly. I guess i\u0027ll just remove the visibility of that field to reduce confusion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethank you.\u003C/p\u003E\n"},{"CreatedByName":"Spanier","CreatedById":57247,"CreatedDateTime":"2013-06-27T18:22:36Z","Content":"\n\u003Cp\u003EIs there a incompatibilty with some other mods using modulemanager? Because I have a weird bug that causes to eliminate air resistance on my rocket as it moves. While still on the launch pad it gives me a terminal velocity of 1,244 m/s (measured by MechJeb).\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-06-27T18:45:16Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Spanier: \u003C/strong\u003EIt is addressed \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/20451-0-20-Ferram-Aerospace-Research-v0-9-5-1-Aerodynamics-Fixes-For-Planes-Rockets?p=464619#post464619\u0022 rel=\u0022external nofollow\u0022\u003Ehere.\u003C/a\u003E The error is due to MechJeb calculating things using the old drag model, which has been zeroed out.\u003C/p\u003E\n"},{"CreatedByName":"Spanier","CreatedById":57247,"CreatedDateTime":"2013-06-27T18:54:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Spanier: \u003C/strong\u003EIt is addressed \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/20451-0-20-Ferram-Aerospace-Research-v0-9-5-1-Aerodynamics-Fixes-For-Planes-Rockets?p=464619#post464619\u0022 rel=\u0022external nofollow\u0022\u003Ehere.\u003C/a\u003E The error is due to MechJeb calculating things using the old drag model, which has been zeroed out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, ok so MechJeb does a wrong calculation, but temporarily it worked fine, so why it does no more?\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2013-06-27T19:07:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SchroedingersHat\u0022 data-cite=\u0022SchroedingersHat\u0022\u003E\u003Cdiv\u003EThank you ferram, that works wonderfully. I can now reenter in the 3 man pod directly from leaving the mun. Periapsis 18-21km seems to be the sweet spot (18km and using angle of attack between 35 and 25 degrees got me down in one orbit) and somewhere in that range is the apollo style double skip maneuver (I\u0027ve yet to find it).\u003Cp\u003EEdit: Do you know what we should do with the expandable 6.25m shield? It goes from 2.5m to 6.25m and currently has node size 2.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tried kicking it to 2, but I still get next to no drag as compared to an unshielded pod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-06-27T20:31:11Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Spanier: \u003C/strong\u003EMechJeb should never \u0022work fine\u0022 with FAR, as it is unable to determine the drag forces that FAR applies to the vehicle. If it was \u0022working\u0022 in anyway then that means that you were using a vehicle that either:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:upper-alpha;\u0022\u003E\u003Cli\u003EHad a large number of intakes \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHad a large number of parachutes \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBoth of those still apply drag through the stock drag model.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@foamyesque: \u003C/strong\u003EAre you talking about the shield for the 3-man pod or the expandable heat shield? If it\u0027s the former, make sure that both attach Nodes have the proper values and that they are not overriden by modulemanager at any point. If it\u0027s the latter, I don\u0027t know what to tell you, I don\u0027t have the math of that set up yet.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-27T22:40:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theflyingfish\u0022 data-cite=\u0022theflyingfish\u0022\u003E\u003Cdiv\u003EWait, WHAT.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI made a SpaceShipOne replica along with it\u0027s lifter aircraft, called White Knight. the SpaceShipOne was the first space plane made by a company not affiliated with the government, like NASA.\u003C/p\u003E\u003Cp\u003EHere it is, attached to the White Knight plane, which was used by NASA to carry some payloads to higher altitudes for testing, including some of their X-Planes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm3.staticflickr.com/2641/4117222754_3d501550ed_o.jpg\u0022 alt=\u00224117222754_3d501550ed_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd here\u0027s is my SpaceShipOne \u002B White Knight:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fmqrQOM.png\u0022 alt=\u0022fmqrQOM.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cxg2827","CreatedById":57380,"CreatedDateTime":"2013-06-28T05:12:41Z","Content":"\n\u003Cp\u003EI\u0027m having a bit of trouble with a SSTO spaceplane. I made a craft, got it into orbit, but then messed up the save file in the SPH. I\u0027ve tried recreating it as close as possible, but now when I\u0027m at 1,700m/s and transition the sabers to rocket mode, it causes the craft to flatspin.\u003C/p\u003E\u003Cp\u003Eany clue what i can do with this to fix the issue?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fVra82P.jpg\u0022 alt=\u0022fVra82P.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vDxGcg5.jpg\u0022 alt=\u0022vDxGcg5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AOkr5NH.jpg\u0022 alt=\u0022AOkr5NH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ehere is the one currently in orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tJmVhyZ.jpg\u0022 alt=\u0022tJmVhyZ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-28T06:01:52Z\u0022 title=\u002206/28/2013 06:01  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 28, 2013\u003C/time\u003E by cxg2827\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-06-28T05:38:23Z","Content":"\n\u003Cp\u003EDid you check both engines and nosecones are actually in the action group to switch mode? it doesn\u0027t save across edits using symmetry.\u003C/p\u003E\n"},{"CreatedByName":"cxg2827","CreatedById":57380,"CreatedDateTime":"2013-06-28T06:05:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Van Disaster\u0022 data-cite=\u0022Van Disaster\u0022\u003E\u003Cdiv\u003EDid you check both engines and nosecones are actually in the action group to switch mode? it doesn\u0027t save across edits using symmetry.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eboth engines and intakes highlighted when I selected one for the action group. I\u0027ll take a look to make sure both are actually toggling and not one side.\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-06-28T06:37:22Z","Content":"\n\u003Cp\u003EHighlighting, even for grouped parts in actions groups is notorious for being glitchy and not actually toggling all parts. Check it again and try.\u003C/p\u003E\u003Cp\u003EAlso...how does this thing even fly with such a difference between CoM and CoL?\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2013-06-28T08:00:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003E@foamyesque: \u003C/strong\u003EAre you talking about the shield for the 3-man pod or the expandable heat shield? If it\u0027s the former, make sure that both attach Nodes have the proper values and that they are not overriden by modulemanager at any point. If it\u0027s the latter, I don\u0027t know what to tell you, I don\u0027t have the math of that set up yet.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s the 3-man one, and the nodes are sized to 2 in the VAB, as seen here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://awesome.redial.net/KSP%20-%20Heatshield%20VAB.png\u0022 alt=\u0022KSP - Heatshield VAB.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI wonder: Is it a MM conflict or something? When I installed DRE it asked me to overwrite a previously existing MM, which I believe was the one that was bundled with FAR. I said yes. I haven\u0027t noticed any issues with the normal parts, though.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-06-28T09:49:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smunisto\u0022 data-cite=\u0022smunisto\u0022\u003E\u003Cdiv\u003EHighlighting, even for grouped parts in actions groups is notorious for being glitchy and not actually toggling all parts. Check it again and try.\u003Cp\u003EAlso...how does this thing even fly with such a difference between CoM and CoL?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s fine, it\u0027s if the CoT is off from CoM ( and CoDrag, albeit that\u0027s guesswork ) that you start getting horrible issues. I don\u0027t see what all that dihedral is doing though.\u003C/p\u003E\n"},{"CreatedByName":"Monkthespy","CreatedById":7644,"CreatedDateTime":"2013-06-28T14:54:53Z","Content":"\n\u003Cp\u003ESomething occurred to me, due to simulation of fairings, would it work putting a small shuttle in a large fairing? Would the wings still work or would that fairing negate all that aerodynamic lift?\u003C/p\u003E\n"},{"CreatedByName":"theflyingfish","CreatedById":17741,"CreatedDateTime":"2013-06-28T16:02:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MR4Y\u0022 data-cite=\u0022MR4Y\u0022\u003E\u003Cdiv\u003EI made a SpaceShipOne replica along with it\u0027s lifter aircraft, called White Knight. the SpaceShipOne was the first space plane made by a company not affiliated with the government, like NASA.\u003Cp\u003E-shnip-\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E I know what the White Knight \u002B SS1 combo is. I was referring to the fact that you said that your replica takes off at over Mach 1. And looking at the smoke trails and condensation effects in your second picture, it does indeed look like it\u0027s moving along at a substantial clip.\u003C/p\u003E\u003Cp\u003EHow did you get a captive-carry cargo aircraft to Mach 1 in the first place, much less take off with it?\u003C/p\u003E\n"},{"CreatedByName":"cxg2827","CreatedById":57380,"CreatedDateTime":"2013-06-28T17:12:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smunisto\u0022 data-cite=\u0022smunisto\u0022\u003E\u003Cdiv\u003EAlso...how does this thing even fly with such a difference between CoM and CoL?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts a bit nose heavy, so full deflection of the surfaces for pitching is very slow reacting, and only causes it to have a \u0022minor stall detected\u0022 under Mach 1.0 when at full control throws. I kind of like it this way since maneuverability isnt an objective with this plane. But, there is definite room for improvement.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Van Disaster\u0022 data-cite=\u0022Van Disaster\u0022\u003E\u003Cdiv\u003EThat\u0027s fine, it\u0027s if the CoT is off from CoM ( and CoDrag, albeit that\u0027s guesswork ) that you start getting horrible issues. I don\u0027t see what all that dihedral is doing though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIve added the dihedral to help stabilize the rolling a bit. much more stable at higher mach numbers, but I still get a bit of dutch rolling when I\u0027m pointing about 5 degrees above the prograde marker. letting go of the stick allows it to get back to the prograde direction and stops the wagging.\u003C/p\u003E\u003Cp\u003EMight need to tone it down though.\u003C/p\u003E\n"},{"CreatedByName":"s20dan","CreatedById":1080,"CreatedDateTime":"2013-06-28T19:34:30Z","Content":"\n\u003Cp\u003EThis aircraft can\u0027t seem to carry any cargo in it\u0027s hold due to added drag from the cargo.(Everything is unshielded):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/XOUcG18\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/XOUcG18l.jpg\u0022 alt=\u0022XOUcG18l.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/oBr5KMK\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/oBr5KMKl.png\u0022 alt=\u0022oBr5KMKl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnyone know how to fix that?\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-06-28T20:38:36Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@foamyesque: \u003C/strong\u003EMake sure you\u0027re using the latest ModuleManager, although I doubt that would affect the drag of that part. I woul;d suggest actually updating to 0.9.5.1 since the difference in aerodynamics between the version you\u0027re using and the latest version could be causing the issue.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Monkthespy: \u003C/strong\u003EThe payload fairing will cancel out all of the aerodynamic forces on the shuttle. It wouldn\u0027t be a useful payload fairing if it didn\u0027t.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@s20dan: \u003C/strong\u003EThere is a known issue with parts at the very edges of cargo bays not being shielded properly, although I think that any parts placed more in the middle of the bay will still be shielded properly.\u003C/p\u003E\n"},{"CreatedByName":"s20dan","CreatedById":1080,"CreatedDateTime":"2013-06-28T21:23:15Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@ferram4:\u003C/strong\u003E I\u0027ve seen that bug, but this is a little different. Anyway it seems its solved by opening and then closing all cargo bays, then the cargo is correctly shielded. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2013-06-29T10:07:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@foamyesque: \u003C/strong\u003EMake sure you\u0027re using the latest ModuleManager, although I doubt that would affect the drag of that part. I woul;d suggest actually updating to 0.9.5.1 since the difference in aerodynamics between the version you\u0027re using and the latest version could be causing the issue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUpdated and with size 2 nodes on the heatshield, Cd is roughly 0.04; that\u0027s 4x higher than before, but still 1/10th the bare backside of the pod. =/\u003C/p\u003E\n"},{"CreatedByName":"Punk","CreatedById":45205,"CreatedDateTime":"2013-06-29T10:51:22Z","Content":"\n\u003Cp\u003EI am having issues with fairings. With them I can only control an angle of attack of less than 2 degrees but without them it is far more lenient. I am using an ssto lifter that looks a lot like a russian Soyuz with four outer columns with 2 LV-T30 and an LV-T45 under each around a center tank stack that narrows down at the bottom (I would post an image but can\u0027t work out how using this site). The fairing makes up the top 1/3 of the craft. It has a TWR at launch of 1.75 with smaller payloads. With the fairings I struggle to control attitude and end up flipping out of control soon after beginning a grav turn (3-4000m). The CoL indicator is above the CoM and pointing perpendicular to the central axis of the rocket, as though the fairings act like a vertical wing. Should I try using all LV-T45\u0027s for more authority or do FairingFactory fairings just not work with FAR yet? I will try to upload an image in a bit. Cheers.\u003C/p\u003E\n"}]}