{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":135,"Articles":[{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-08T22:42:23Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@bs1110101: \u003C/strong\u003ETry doing this:\u003C/p\u003E\u003Cp\u003EMeasure the chord of one of the sections for the fin (so that\u0027s the distance from the front to the back; it should be very, very small). Then measure the span of one of the sections (the side of one of those grid squares). Figure out how many sections there are, and multiply chord and span by those; use those values for MAC and B_2, respectively. Set MidChordSweep to 0. Set taperRatio to 1. Set e to 0.85. See if that sort-of works.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@bulletrhli: \u003C/strong\u003EIt\u0027ll be awhile. I think I\u0027ve figured out an algorithm that can remove my dependency on attach nodes being the correct size that still works with pretty much any mod part I can think of (especially fairings), but I haven\u0027t started implementing that, so that might take a few days. It\u0027s especially critical with the new, larger stock size parts we\u0027ll be getting in 0.24; everyone speculates that they\u0027ll be some multiple of 1.25m wide, but I don\u0027t see any compelling reason for that myself; if that\u0027s the case then FAR will be completely wrong at simulating even stock part aerodynamics, and that will not do.\u003C/p\u003E\u003Cp\u003EI\u0027ve also just implemented the exact equations for the wave drag around slender bodies with conical sections, along with a little bit of a fudge to make it more accurate at hypersonic velocities. That works well, but there are quite a few parts in KSP that violate slender body theory, so I\u0027m going to have to implement proper conical shock relations to handle that sort of thing; unfortunately, the values I need are not the type that can be calculated using an explicit formula and instead have to be either read off of a graph (which means I\u0027ll have to rig up an approximate equation or look-up table) or solved numerically (which will be fairly slow, even if I only have to do it on part loading.\u003C/p\u003E\u003Cp\u003EThere\u0027s still a lot to do.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Dragon01: \u003C/strong\u003ESo basically, a way to set the zero-input angle of the control surfaces? I think I can do that.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@ANWRocketMan: \u003C/strong\u003EProbably the best way to do it is a flight test, where you\u0027re going to keep track of the BC at various Mach numbers. Basically, boost the craft (unmanned, I would hope) into space on a sub-orbital trajectory and then boost it down into the atmosphere. While that\u0027s happening, take a look at the BC at Mach ~5, ~2, ~1.2, ~0.8, and ~0.5 and record them. Make sure that it has the mass that you expect it will have on atmospheric entry. From that, you can figure out terminal velocity at any gravity and air density based on this equation:\u003C/p\u003E\u003Cp\u003EV\u003Csub\u003Eterm\u003C/sub\u003E = SQRT(2 * BC * g / density)\u003C/p\u003E\u003Cp\u003EYou can look up g for a planet. Density is a little more difficult, since you\u0027ll have to use the ideal gas equation to calculate it from pressure, temperature and the molar mass of the gas; I\u0027d approximate it using atmospheric pressure in atm and assuming that\u0027s density in kg/m^3; it\u0027ll be low, but that gives you margin to work with. If you want more exact, send an atmospheric probe in to get better pressure, density and temperature data to use. BC will vary a bit with gas composition at any Mach number, but it shouldn\u0027t be by much. You\u0027ll select your BC based on what you think your Mach number will be when you have to start the burn; there\u0027s no need for Mach number data above 5, since it doesn\u0027t change too much above there.\u003C/p\u003E\u003Cp\u003EThat should give you the amount of velocity you need to get rid of, but you\u0027ll need to add some for gravity losses and for margin. Of course, adding a lot of dV to that will increase the mass of the vehicle enough to mess up the BC, so you\u0027ll want to scale BC up or down to compensate; it\u0027s just mass divided by drag area, so you just need to multiply it by the ratio of the current mass to the original tested mass to get the new BC, but then you need to run the terminal velocity numbers again.\u003C/p\u003E\n"},{"CreatedByName":"MAKC","CreatedById":57186,"CreatedDateTime":"2014-03-09T02:35:43Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/zvuoA9i\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/zvuoA9il.png\u0022 alt=\u0022zvuoA9il.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI roughly tallied the drag for each part on the plane and got ~55 kN of drag. It\u0027s the drag that\u0027s eating all the thrust! Nothing wrong with the TWR, it\u0027s almost 1. Maybe a problem with excessive PWing drag?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-09T03:03:21Z","Content":"\n\u003Cp\u003EExcept the numbers I get (from using the Cd, reference area and Q values) that you\u0027re dealing with 65 kN; I think the difference is due to the intakes, which might not be set up correctly. Now it\u0027s possible that the cockpit is making too much drag due to the approximations used, but I don\u0027t think the pWings would be making too much drag.\u003C/p\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-03-09T03:20:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EExcept the numbers I get (from using the Cd, reference area and Q values) that you\u0027re dealing with 65 kN; I think the difference is due to the intakes, which might not be set up correctly. Now it\u0027s possible that the cockpit is making too much drag due to the approximations used, but I don\u0027t think the pWings would be making too much drag.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight now the intake drags are just what FAR calculates. The stock \u0022dynamic drag\u0022 is disabled if you use AJE. I\u0027ve tested all the B9 intakes and the ones with excessive drag are SABRE M and S. The one shown in the picture is not very draggy.\u003C/p\u003E\n"},{"CreatedByName":"MAKC","CreatedById":57186,"CreatedDateTime":"2014-03-09T04:29:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EExcept the numbers I get (from using the Cd, reference area and Q values) that you\u0027re dealing with 65 kN; I think the difference is due to the intakes, which might not be set up correctly. Now it\u0027s possible that the cockpit is making too much drag due to the approximations used, but I don\u0027t think the pWings would be making too much drag.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe intakes had really low drag, I don\u0027t think they are the problem. Unless they\u0027re causing some behind the scenes drag?\u003C/p\u003E\u003Cp\u003EThe main wings were 10 kN each. JFYI\u003C/p\u003E\u003Cp\u003EEdit: Velocity was topped out and the thrust was 55 kN so the drag had to be 55 kN as well since the plane was neither accelerating nor slowing down. Right?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-09T16:30:31Z\u0022 title=\u002203/09/2014 04:30  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 9, 2014\u003C/time\u003E by MAKC\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dirt_Merchant","CreatedById":69465,"CreatedDateTime":"2014-03-10T23:45:43Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@ferram4:\u003C/strong\u003E In reagrds to Dragon01\u0027s request for more control surface configuration options, I\u0027d first like to second his request, so many new possibilities would result from this. Additionally I\u0027d like to humbly request the ability to manually enter control surface deflection ranges, I\u0027ve some interesting ideas (which I\u0027d keep to myself for the moment) I\u0027d like to try which require the ability to set negative deflections... The ability to configure the control surfaces on an individual basis would be rad as well. Essentially, I\u0027d enjoy a return of the old control surface interface in addition to keeping all the fun new sliders and such. As always, your work inspires and motivates my projects in KSP, without your work, I\u0027d not be playing! \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://dirt66merchant.imgur.com/\u0022 rel=\u0022external nofollow\u0022\u003EA Few Selected FAR powered Projects/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-11T00:11:44Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@MAKC: \u003C/strong\u003EI\u0027ve made some changes that will reduce the basic skin friction drag (it was ~50% too high) and the transonic and supersonic drag of wings. My F-15 had no problem getting up to speed using those settings, but the F100 apparently overheats at really low speeds, or it\u0027s stuck using a normal shock inlet, since getting it past Mach 1.6 quickly led to burning off. It seems about right now, though you still kind of need to go into a dive to get through Mach 1 efficiently. So wait until FAR v0.13.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@DirtMerchant: \u003C/strong\u003ENegative deflections should also appear in the next update, but I\u0027d prefer not to bring back the old GUI, since that GUI always kind of annoyed me. It was just a necessary evil since I didn\u0027t have something like tweakables to use.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-03-11T00:23:03Z","Content":"\n\u003Cp\u003EHi ferram.\u003C/p\u003E\u003Cp\u003EI spoke with you recently about excessive drag from a piece from the LLL mod. (Where I went from a narrow section to a wider section).\u003C/p\u003E\u003Cp\u003EA redesign recently with a much more tapered design still exhibits huge drag on the tapering part. (So much so that the craft actually flies backwards!)\u003C/p\u003E\u003Cp\u003EAny chance I could send a craft file? (You would need LLL installed too). The way it acts, its almost at though the part is actually broken somehow and exhibits behaviour as though its just a flat surface.\u003C/p\u003E\u003Cp\u003EIf it is a part issue, I can ask Lack to look into it. If it\u0027s my design then you can smack me upside the head.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-11T00:45:24Z","Content":"\n\u003Cp\u003EIf it\u0027s the part I\u0027m thinking of, that single part tapers too quickly for its own good. Now, that said the numbers will probably drop a bit in the next FAR update, since I\u0027ve got a somewhat better algorithm for that sort of thing partly-worked up. For the most part, it\u0027s a part issue, and it\u0027s an issue that\u0027s shared with almost all the tapering parts that exist in KSP; they\u0027re designed to look cool, not to be aerodynamic.\u003C/p\u003E\u003Cp\u003EGo ahead, post the craft and a picture of the problem part so I know that I\u0027m checking the right thing. I\u0027ll see how it plays out in the dev build and make sure nothing truly horrible happens.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-03-11T01:48:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@MAKC: \u003C/strong\u003EI\u0027ve made some changes that will reduce the basic skin friction drag (it was ~50% too high) and the transonic and supersonic drag of wings. My F-15 had no problem getting up to speed using those settings, but the F100 apparently overheats at really low speeds, or it\u0027s stuck using a normal shock inlet, since getting it past Mach 1.6 quickly led to burning off. It seems about right now, though you still kind of need to go into a dive to get through Mach 1 efficiently. So wait until FAR v0.13.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is in part why I didn\u0027t redo the JRC Mk III to use AJE for its engine, and, I think, why I was getting some weirdness with the HARC. Looking forward to it.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-03-11T04:46:14Z","Content":"\n\u003Cp\u003EHere is the \u003Ca href=\u0022https://moc-per.micromine.com/owncloud/public.php?service=files\u0026amp;t=4555cdc6e185f7331061cec368bcd641\u0022 rel=\u0022external nofollow\u0022\u003Ecraft file\u003C/a\u003E, though you can whip one up with LLL installed in no time.\u003C/p\u003E\u003Cp\u003EDrag peaks near about 175kN at 20,000m (on the one offending part). (It\u0027s almost like a parachute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\u003Cp\u003EI really want the rectangular section at the back, the front of the craft I\u0027m not really fussed about the design, but it needs to hold 5 Kerbals, which this one can.\u003C/p\u003E\u003Cp\u003EI have experimented with pure square cross section and it works great, the only issue then is the craft is too long. (It\u0027s designed to go on top of a lander).\u003C/p\u003E\u003Cp\u003EThe part is the tapering section behind the cockpit \u002B SAS unit, (both LLL parts).\u003C/p\u003E\u003Cp\u003EPS: when I launch the whole ship, that tapered part generates 4-5x the drag than the rectangular fuel tanks flying sideways to direction of travel!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://moc-per.micromine.com/owncloud/public.php?service=files\u0026amp;t=f8aa58e9428e6feede156afc421ff749\u0026amp;download\u0022 alt=\u0022public.php?service=files\u0026amp;t=f8aa58e9428e6feede156afc421ff749\u0026amp;download\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://moc-per.micromine.com/owncloud/public.php?service=files\u0026amp;t=b737caa88b4bf4bb87de9de950360a7c\u0026amp;download\u0022 alt=\u0022public.php?service=files\u0026amp;t=b737caa88b4bf4bb87de9de950360a7c\u0026amp;download\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://moc-per.micromine.com/owncloud/public.php?service=files\u0026amp;t=c26e0cbb7c58e4df11a116821e1973c5\u0026amp;download\u0022 alt=\u0022public.php?service=files\u0026amp;t=c26e0cbb7c58e4df11a116821e1973c5\u0026amp;download\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-11T13:26:02Z\u0022 title=\u002203/11/2014 01:26  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 11, 2014\u003C/time\u003E by SSSPutnik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Boamere","CreatedById":68058,"CreatedDateTime":"2014-03-11T18:50:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dirt_Merchant\u0022 data-cite=\u0022Dirt_Merchant\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@ferram4:\u003C/strong\u003E In reagrds to Dragon01\u0027s request for more control surface configuration options, I\u0027d first like to second his request, so many new possibilities would result from this. Additionally I\u0027d like to humbly request the ability to manually enter control surface deflection ranges, I\u0027ve some interesting ideas (which I\u0027d keep to myself for the moment) I\u0027d like to try which require the ability to set negative deflections... The ability to configure the control surfaces on an individual basis would be rad as well. Essentially, I\u0027d enjoy a return of the old control surface interface in addition to keeping all the fun new sliders and such. As always, your work inspires and motivates my projects in KSP, without your work, I\u0027d not be playing! \u003Cp\u003E\u003Ca href=\u0022http://dirt66merchant.imgur.com/\u0022 rel=\u0022external nofollow\u0022\u003EA Few Selected FAR powered Projects/\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see you have alternis kerbol, I\u0027ve always wanted to download this, but I have some questions: Does it take up lots of space? (i\u0027ve heard it takes up less) Does it cause more lag? and does it delete saves? \u003C/p\u003E\u003Cp\u003EThanks in advance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kenken244","CreatedById":36865,"CreatedDateTime":"2014-03-13T04:54:53Z","Content":"\n\u003Cp\u003EI have been having a consistent problem with my plane designs since using this mod. All of my planes have, after flying perfectly for a while, gaining altitude and velocity, suddenly decide to rapidly pitch up and flip out. I cannot seem to determine the cause of this problem. I have tried adjusting the center of lift versus center of mass, adjusting control surfaces, tried different ascent paths, but nothing seems to avoid this problem. Furthermore, there seems to be no definite cause of the issue as far as I can see. This will happen at wildly varying altitudes and speeds, across a variety of plane designs. is there some common mistake that I might be making? What generally is the cause of such losses of control, and how can I avoid them? I really seem to be at a loss here.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-13T05:15:25Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@SSPutnik: \u003C/strong\u003EI can look into it, but if the drag on the part is \u003Cem\u003Ethat\u003C/em\u003E bad then I wonder if there\u0027s something wacky going on with the model.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Kenken244: \u003C/strong\u003EWithout more information on each case there\u0027s no way to diagnose what\u0027s going on. The most accurate thing I can say is that something is causing your plane to become unstable, but if there\u0027s no consistent thread through all of it then it\u0027s probably completely different things happening.\u003C/p\u003E\u003Cp\u003EOne possibility is that you\u0027re causing the plane to stall, and it\u0027s not capable of coming out of a stall. Stalls happen above ~15 degrees angle of attack (for each wing), so if you\u0027re trying to fly the plane like in stock you might cause that to happen.\u003C/p\u003E\u003Cp\u003EAnother possibility is that the plane is particularly susceptible to Mach tuck and it becomes highly unstable near Mach 1. If that\u0027s the case you might have to move your wings up or down on the plane in order to deal with the drag and possibly shift the wings further back and compensate with more control surfaces.\u003C/p\u003E\u003Cp\u003EIt could be that your planes just have some stupidly un-aerodynamic thing stuffed on the front that makes it unstable, in which case that\u0027s the source of your problem.\u003C/p\u003E\u003Cp\u003EYou might just be dealing with a shifting CoM as fuel drains and you\u0027re not used to the way the fact that drag isn\u0027t dependent on mass with FAR, in which case you need to redesign your vehicles to account for the fuel drain.\u003C/p\u003E\u003Cp\u003EPosting pictures will make it a lot easier to diagnose what\u0027s going on with each case, but for until you do that I can\u0027t tell you what you\u0027re doing wrong.\u003C/p\u003E\n"},{"CreatedByName":"MAKC","CreatedById":57186,"CreatedDateTime":"2014-03-13T05:22:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kenken244\u0022 data-cite=\u0022Kenken244\u0022\u003E\u003Cdiv\u003EI have been having a consistent problem with my plane designs since using this mod. All of my planes have, after flying perfectly for a while, gaining altitude and velocity, suddenly decide to rapidly pitch up and flip out. I cannot seem to determine the cause of this problem. I have tried adjusting the center of lift versus center of mass, adjusting control surfaces, tried different ascent paths, but nothing seems to avoid this problem. Furthermore, there seems to be no definite cause of the issue as far as I can see. This will happen at wildly varying altitudes and speeds, across a variety of plane designs. is there some common mistake that I might be making? What generally is the cause of such losses of control, and how can I avoid them? I really seem to be at a loss here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis sounds like a case of changing CoM due to fuel consumption.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EGet \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/35996-0-23-RCS-Build-Aid-v0-4-4-New-average-center-of-mass-marker\u0022 rel=\u0022external nofollow\u0022\u003ERCS Build Aid\u003C/a\u003E if you don\u0027t have it\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEnable empty CoM along with normal CoM and aerodynamic center\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETake a screenshot from dead above so we can see your control configuration as well\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-13T05:39:31Z\u0022 title=\u002203/13/2014 05:39  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 13, 2014\u003C/time\u003E by MAKC\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guiltyspark","CreatedById":105295,"CreatedDateTime":"2014-03-13T21:01:57Z","Content":"\n\u003Cp\u003EIs there a reliable way to predict orbit after aerobraking with FAR installed? (I\u0027m not sure if someone has asked this before but reading a 337 page thread is painful.) MechJeb (even with the FAR compatibility installed) can\u0027t give anything nearly accurate and \u003Ca href=\u0022http://alterbaron.github.io/ksp_aerocalc/?inputDir=prograde\u0022 rel=\u0022external nofollow\u0022\u003Ethis online calculator\u003C/a\u003E does not adjust for FAR either.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-13T21:11:06Z","Content":"\n\u003Cp\u003EUnfortunately, the most reliable way of \u0022predicting\u0022 is F5, aerobrake, F9 if unsatisfied. Whenever MJ can actually manage simulating FAR stuff even that won\u0027t be perfectly accurate because it will heavily vary with how the vehicle is oriented during aerobraking. Aerobraking is fuzzy and not perfect with FAR, just as it should be, unlike in the stock game where you can reliably predict exactly what will happen down to the meter.\u003C/p\u003E\u003Cp\u003EFWIW, aerocapture with FAR generally ends badly due to heating or aerodynamics tearing the ship apart.\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2014-03-14T17:16:34Z","Content":"\n\u003Cp\u003EI\u0027m experiencing an interesting form of RUD and before I go talk about it on video I\u0027d really like to clarify what\u0027s going on.\u003C/p\u003E\u003Cp\u003EI\u0027m trying to launch the largest microwave transmitter from KSP interstellar, now this thing is huge but folds up enough to fit inside a 3.75m faring. Outside of the fairing it appears to make drag calculations based on its deployed state which is so huge you can actually use it as a parachute, so you need to stick it inside the an aerodynamic structure to make it move, but quite often during launches it appears that FAR decides that it\u0027s no longer protected by the shroud, whenever this happens the sudden addition of drag will tear the rocket apart. So I\u0027m wondering how FAR is making this decision, is it just that the payload is wobbling too far laterally and pokes just a little bit of the model through the shroud and suddenly making it calculate drag for the whole object or, is the faring perhaps splitting apart at the nose a little and drag being applied that way, or is this another hilarious bug.\u003C/p\u003E\u003Cp\u003EIt\u0027s pretty spectacular when it happens, and it\u0027ll make for good video, but I\u0027m really curious for the mechanics.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-03-14T17:41:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boamere\u0022 data-cite=\u0022Boamere\u0022\u003E\u003Cdiv\u003EI see you have alternis kerbol, I\u0027ve always wanted to download this, but I have some questions: Does it take up lots of space? (i\u0027ve heard it takes up less) Does it cause more lag? and does it delete saves? \u003Cp\u003EThanks in advance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell this is my personal experience. Alternis broke FAR to hell and back. I am not sure why... Or if was another mod maybe, buy I noticed with Alternis that EVERY craft I made acted like it was dragging a parachute. No TWR in the world could get my craft past 250m/s. So i deleted it and never looked back. ( I only wanted Alternis for the lighting ) But by all means try it and see how it works for you. \u003C/p\u003E\u003Cp\u003EYes you\u0027ll want a fresh save and yes it takes up just a bit of memory, but nothing over the top like planet factory. It just reorganizes the existing planets.\u003C/p\u003E\n"},{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2014-03-15T13:22:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boamere\u0022 data-cite=\u0022Boamere\u0022\u003E\u003Cdiv\u003EIt really doesn\u0027t matter to me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I have rockets powerful enough to get to space with their first stage (depending on what they\u0027re carrying) so I don\u0027t mind what the ascent is like\u003Cp\u003E(but when I do I just use SAS and turn when it \u0022feels right\u0022)\u003C/p\u003E\u003Cp\u003EAnd yeah rockets do seem to \u0022Fly\u0022 through the air, very smooth, nice feeling\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E.-.\u003C/p\u003E\u003Cp\u003Eboamere, you\u0027re everywhere. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyways, I\u0027ve been playing with FAR and ProcFairings and it\u0027s the best combo. EVAR.\u003C/p\u003E\u003Cp\u003EI love the whole idea of \u0022Wow, this would work in real life! :D\u0022 instead of \u0022Well, it\u0027s a plane... Maybe if it had no wings, then it would work like real life...\u0022\u003C/p\u003E\u003Cp\u003EThanks Ferram! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-03-15T14:36:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Naten\u0022 data-cite=\u0022Naten\u0022\u003E\u003Cdiv\u003E\u0022Wow, this would work in real life! :D\u0022 Thanks Ferram! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. I had a lot of fun recently with lightweight prop planes. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TTOT5AC.jpg\u0022 alt=\u0022TTOT5AC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E^ can pull 15g\u0027s for rapid self disassembly as well as fly super slowly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ibpr1yl.jpg\u0022 alt=\u0022ibpr1yl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETBH, probably i wouldn\u0027t have noticed that stock aerodynamics are wrong if i hadn\u0027t read about it. However if at all possible i perfer physics to be like in real life. And it is great to be able to basically play a flight sim with DIY planes knowing that it isn\u0027t too far off from RL \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Boamere","CreatedById":68058,"CreatedDateTime":"2014-03-15T17:27:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Naten\u0022 data-cite=\u0022Naten\u0022\u003E\u003Cdiv\u003E.-.\u003Cp\u003Eboamere, you\u0027re everywhere. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeedy I am Naten \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-15T19:15:18Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@illectro: \u003C/strong\u003EYeah, unfortunately FAR\u0027s drag calculation seems to grab the deployed state of those transmitters, I\u0027m not sure exactly \u003Cem\u003Ewhy\u003C/em\u003E though.\u003C/p\u003E\u003Cp\u003EAs for the fairing thing, what FAR does ever time the vessel part list is updated is it goes through all of the fairing parts, calculates their bounds, and then goes through the list of every part in the vessel to see if that part\u0027s origin is inside the fairing (for wings it also checks the wingtip for thoroughness, or it\u0027s supposed to; that doesn\u0027t seem to work either for some reason). So the only way the issue you\u0027re seeing should happen is if the transmitter wobbles outside the fairing at the same time as you\u0027re ditching a stage. FAR isn\u0027t calculating if something is inside the fairing every single frame, that would add lots of vector math, comparisons and iterating through part lists that are simply unnecessary. Try right-clicking on the transmitter and making sure that it stays \u0022isShielded = true\u0022 the whole way, since that needs to be false in order for FAR to apply drag parameters; it acts the same as FAR detecting zero density and it simply stops running the rest of the code at that point.\u003C/p\u003E\u003Cp\u003EIf the payload is wobbling too much, I\u0027d make sure you\u0027re running KJR v2.0 rather than an earlier version if you don\u0027t want to wait until the official joint fixes. Things have gotten a lot better since the earlier versions of KJR.\u003C/p\u003E\u003Cp\u003EBut anyway, the video will be good; video documentation of bugs is great, because then I can actually see everything that went wrong.\u003C/p\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-03-15T20:55:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@MAKC: \u003C/strong\u003EI\u0027ve made some changes that will reduce the basic skin friction drag (it was ~50% too high) and the transonic and supersonic drag of wings. My F-15 had no problem getting up to speed using those settings, but the F100 apparently overheats at really low speeds, or it\u0027s stuck using a normal shock inlet, since getting it past Mach 1.6 quickly led to burning off. It seems about right now, though you still kind of need to go into a dive to get through Mach 1 efficiently. So wait until FAR v0.13.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf v0.13 is going to be long then could you release a preview version? 50% reduction in skin friction drag seems a lot and I really need this to test AJE.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-15T21:37:54Z","Content":"\n\u003Cp\u003EAlright, there\u0027s an experimental that\u0027s out that gets a lot of the features out there. Still haven\u0027t adjusted the attach node drag system or all of the control surface stuff, but there\u0027s enough there to play with.\u003C/p\u003E\n"}]}