{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":403,"Articles":[{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2015-06-08T11:46:00Z","Content":"\n\u003Cp\u003EHi guys, I got a question about spaceplane engine choice\u003C/p\u003E\u003Cp\u003EI am wondering if 4 RAPIER are the best choice for 70-80T spaceplane under FAR.\u003C/p\u003E\u003Cp\u003EHere is mine: \u003Ca href=\u0022http://kerbalx.com/gilflo/FAR-Avenger-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalx.com/gilflo/FAR-Avenger-3\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI am trying to find a combination giving the best DV option with enough TWR for orbit.\u003C/p\u003E\u003Cp\u003EI need 4 turbo to be able to take off from runway, so 4 turbojets \u002B another combination of Closed cycle engine will add more weight and I need more than 0.5 TWR to make orbit from 20.000m where turbojets become inefficient.\u003C/p\u003E\u003Cp\u003EA combination of 2 turbo, 2 rapier and 2 nuclear or 2 other engines.... i am not sure that the weight added gives me more DV on final.\u003C/p\u003E\u003Cp\u003EThen once in vacuum if you want to transit on Mun you can light 2 or 4 engines, you don\u0027t get more DV, you just do it faster or lower.....\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-06-08T12:23:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003ENo, I made it for me. I released it, because it gets me bug reports and more references to data to improve it \u003Cem\u003Efor me\u003C/em\u003E. You are not a customer, I do not work for you, and frankly, out of all the things that you\u0027ve argued, \u003Cem\u003Ethis\u003C/em\u003E is the one that insults me. The implication that modders are supposed to care about nothing but the whims of whatever random user (or non-user) happens to demand ticks me off, especially given that every user can get the mod for no cost whatsoever. If I did this for \u003Cem\u003Eyou\u003C/em\u003E or any other random faceless post on the internet, I would have quit a long time ago because you\u0027re all impossible to please and frequently enforce feels \u0026gt; reals.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s unfortunate that most people don\u0027t get this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I have had to educate people in a similar manner on at least \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/111157-1-0-2-Tarsier-Space-Technology-with-Galaxies-Continued-%28V5-2%29-3rd-June-2015?p=1904476\u0026amp;viewfull=1#post1904476\u0022 rel=\u0022external nofollow\u0022\u003Etwo\u003C/a\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/51037-1-02-KW-Rocketry-v2-7-Available-1-02-Compatibility%21-16-05-2015?p=2003222\u0026amp;viewfull=1#post2003222\u0022 rel=\u0022external nofollow\u0022\u003Eoccasions\u003C/a\u003E but it would be nice if more people understood this. The problem I think mostly stems from the fact that you, Ferram, and several other mods create such quality extensions of the game it\u0027s natural for people who don\u0027t really think about it to think about them as products \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E The price of fame and all that, heh. Keep up the good work\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-06-08T12:35:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gilflo\u0022 data-cite=\u0022gilflo\u0022\u003E\u003Cdiv\u003EHi guys, I got a question about spaceplane engine choice\u003Cp\u003EI am wondering if 4 RAPIER are the best choice for 70-80T spaceplane under FAR.\u003C/p\u003E\u003Cp\u003EHere is mine: \u003Ca href=\u0022http://kerbalx.com/gilflo/FAR-Avenger-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalx.com/gilflo/FAR-Avenger-3\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI am trying to find a combination giving the best DV option with enough TWR for orbit.\u003C/p\u003E\u003Cp\u003EI need 4 turbo to be able to take off from runway, so 4 turbojets \u002B another combination of Closed cycle engine will add more weight and I need more than 0.5 TWR to make orbit from 20.000m where turbojets become inefficient.\u003C/p\u003E\u003Cp\u003EA combination of 2 turbo, 2 rapier and 2 nuclear or 2 other engines.... i am not sure that the weight added gives me more DV on final.\u003C/p\u003E\u003Cp\u003EThen once in vacuum if you want to transit on Mun you can light 2 or 4 engines, you don\u0027t get more DV, you just do it faster or lower.....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERepost this in the FAR design thread (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/121176-Official-FAR-Craft-Repository\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/121176-Official-FAR-Craft-Repository\u003C/a\u003E) and you\u0027ll get plenty of detailed answers.\u003C/p\u003E\u003Cp\u003EHowever, from a quick glance at the ship...something that size should be able to manage on two or three engines. Your major problem is excessive drag rather than insufficient power. Lose the extra intakes (one shock cone per engine is plenty, and those orphan intakes you\u0027ve got clipped through the wings must be generating insane amounts of drag) and try to rationalise the wing and stabiliser surfaces.\u003C/p\u003E\n"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-08T15:14:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KillerRaccoon\u0022 data-cite=\u0022KillerRaccoon\u0022\u003E\u003Cdiv\u003EHello Ferram,\u003Cp\u003EI am getting into kOS right now, and was wondering if there is any way to retrieve values such as coefficient of drag and reference area from FAR. Dynamic pressure would be nice too, but that\u0027s easy enough to calculate. Right now I\u0027m working on a PID for the throttle, but if there is such an interface I\u0027m sure it would be useful to know about for other projects as well.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame goal for me on roadmap for KSP gameplay \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI asked similar question in kOS thread and it should be manageable. In general kOS will alow you to read data that any mod can provide and set data to any value that some other mod alows to be changed in flight.\u003C/p\u003E\u003Cp\u003ESorry, I can\u0027t be more specific, how exactly you can read those data in kOS, but yes, I got similar idea to track down dynamic pressure. Adjusting throttle/craft pitch based on that to have more fuel efficient ascent slope to orbit without destroying craft in process.\u003C/p\u003E\n"},{"CreatedByName":"4plains","CreatedById":69284,"CreatedDateTime":"2015-06-08T17:12:18Z","Content":"\n\u003Cp\u003EFinally made a nuFAR tutorial. Hope you\u0027ll all enjoy it.\u003C/p\u003E\u003Cp\u003E4plains\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/IqbU9aSUrGA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-08T17:19:08Z\u0022 title=\u002206/08/2015 05:19  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by 4plains\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RyanRising","CreatedById":79932,"CreatedDateTime":"2015-06-08T18:37:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E Looks like some very strange kind of voxelization error. Not sure why it would fail on the payload fairings, it normally voxelizes those fine. Can you reproduce it with the latest dev build, and what steps did you take to cause it? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere would I find that latest dev build? Is it from the GitHub \u0022master\u0022 branch? Once I\u0027ve got it and I\u0027m home, I\u0027ll try it on my install, try the current version of FAR with Stock\u002BVen\u0027s Revamp, and the new dev build with Stock\u002BVSR. At any rate, thanks for letting me know that I\u0027m not just bad at fairings.\u003C/p\u003E\u003Cp\u003EEDIT: Also, I posted this at 13:37! Woohoo!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-08T18:40:09Z\u0022 title=\u002206/08/2015 06:40  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by RyanRising\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gryphon","CreatedById":58513,"CreatedDateTime":"2015-06-08T20:14:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RyanRising\u0022 data-cite=\u0022RyanRising\u0022\u003E\u003Cdiv\u003EWhere would I find that latest dev build? Is it from the GitHub \u0022master\u0022 branch?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s correct.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://codeload.github.com/ferram4/Ferram-Aerospace-Research/zip/master\u0022 rel=\u0022external nofollow\u0022\u003EDownload this\u003C/a\u003E, then transfer the Gamedata folder to your own KSP Gamedata\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-06-08T23:56:54Z","Content":"\n\u003Cp\u003EI should clarify that that\u0027s the \u003Cem\u003Econtents\u003C/em\u003E of that Gamedata to your own KSP Gamedata that need to be transferred. Don\u0027t have nested Gamedatas.\u003C/p\u003E\n"},{"CreatedByName":"Gryphon","CreatedById":58513,"CreatedDateTime":"2015-06-09T01:12:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EI should clarify that that\u0027s the \u003Cem\u003Econtents\u003C/em\u003E of that Gamedata to your own KSP Gamedata that need to be transferred. Don\u0027t have nested Gamedatas.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what I get for copying lazily.\u003C/p\u003E\n"},{"CreatedByName":"Solar71","CreatedById":140993,"CreatedDateTime":"2015-06-09T01:45:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gryphon\u0022 data-cite=\u0022Gryphon\u0022\u003E\u003Cdiv\u003EFirst of all, he didn\u0027t disagree with them, he just explained what your desired settings meant, and asked WHY you wanted to use a setting that was very unrealistic - especially when you describe it as realistic.\u003Cp\u003ESecond, if you take the time to read back through some of Ferram\u0027s previous posts in this thread, you will see the discussion of why he decided to get rid of that tab.\u003C/p\u003E\u003Cp\u003EI don\u0027t think anyone refused to help you - certainly, you ALREADY got help in this thread to resolve another issue, so that FAR would work for you.\u003C/p\u003E\u003Cp\u003ENow, I can\u0027t tell you what the realistic terminal velocity of a \u00221 meter long SRB\u0022 should be. I am not even certain what KSP part you are describing, so I\u0027ll just skip that part of your post for now.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat is wrong here seems to be your attitude.\u003C/strong\u003E Ferram is just a player of KSP as well. He has spent exceedingly large amounts of his time and copious knowledge putting a good aerodynamics simulation into KSP, and he has chosen to share that with the rest of us. Beyond even that, he chooses to support us in using his mod. You, I, and all the rest of the FAR users aren\u0027t entitled to ANYTHING from him.\u003C/p\u003E\u003Cp\u003EYou \u003Cstrong\u003Ecan\u003C/strong\u003E make changes to FAR settings, in the config files.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYou\u003C/strong\u003E certainly seem to be getting both pissed and defensive, not anyone else. Personally, I think you will find it easier to receive the help you desire if you chill out.\u003C/p\u003E\u003Cp\u003EIf you take the time to read back through some of Ferram\u0027s posts in the last few weeks, you will learn that some mod parts, both procedural and not procedural, DO have problems working with FAR - typically because there is a hole or other issues with the model, that weren\u0027t exposed by stock aerodynamics.\u003C/p\u003E\u003Cp\u003EIf I understand your previous posts, it seems like you are possibly having two issues: one, with changing FAR settings in the config files; and two, with some unspecific procedural SRB part.\u003C/p\u003E\u003Cp\u003EI am hopeful that you did not intend for your post to sound so rude, and that you are only frustrated with trying to integrate FAR with your game of KSP.\u003C/p\u003E\u003Cp\u003EI recommend that you ask for assistance with details about what config file entries you are trying to change (that aren\u0027t working for you), and specifically what part from what mod that you are using and not getting the desired results with. For the part, issue, I recommend a screenshot showing the VAB graph for that part (like what RyanRising just posted), as well as with the debug voxelization enabled, so that it is more clear what is going on.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELOL, be realistic dude. This thread is 1000\u002B pages long. You are \u0022realistically\u0022 expecting someone to read through that?\u003C/p\u003E\u003Cp\u003EI came here for help with a feature in FAR that is not working correctly. In response I got \u0022WHY DO YOU WANT TO DO THAT?\u0022\u003C/p\u003E\u003Cp\u003EBut that is a DODGING of my question. Not an answer. \u003C/p\u003E\u003Cp\u003Esecondly I don\u0027t want anything from this FAR dude. In fact I never asked for anything from him, except to read my bug report, and either FIX IT or NOT.\u003C/p\u003E\u003Cp\u003EI don\u0027t really care either way.\u003C/p\u003E\u003Cp\u003ELet me tell you something, only good users report bugs. Bad users don\u0027t report bugs, but instead just stop using the software without giving the DEV a chance to fix it.\u003C/p\u003E\u003Cp\u003ESecondly fluid dynamics are very complicated. The only reason in FAR that they have the atmospheric viscosity set to 0.00002 (accurate)\u003C/p\u003E\u003Cp\u003Eis because they don\u0027t understand that the atmosphere must be much thicker to \u0022COMPENSATE\u0022 for the fluid dynamic pseudo simulation that KSP uses.\u003C/p\u003E\u003Cp\u003EYou see, KSP \u0022TRIES\u0022 to simulate a fluid dynamic called atmosphere. But to do this correctly, all our PC\u0027s would need to be 100 x faster to achieve a minimum 30 fps. You see, if we try to accurately simulate true fluid dynamic, all our KSP\u0027s would turn to 1 fps slide shows.\u003C/p\u003E\u003Cp\u003ESo what KSP does is cut corners... LOTS of corners!!! This is so that our PC\u0027s can give us that 30-120 fps that we require for having fun...\u003C/p\u003E\u003Cp\u003ESo to COMPENSATE ksp thickens the atmosphere to simulate a true atmosphere. Its not accurate, maybe too thick...\u003C/p\u003E\u003Cp\u003ESo FAR comes out and improves the fluid simulation, but its still NOT EVEN CLOSE to realistic... Yes its MUCH BETTER than stock, but its still a LONG way off.\u003C/p\u003E\u003Cp\u003ESo FAR also needs to compensate by possibly thickening up the atmosphere as well. Maybe not as much, but still it needs some help.\u003C/p\u003E\u003Cp\u003ESo in FAR when they set the atmosphere to 0.00002 viscosity, its actually NOT correct. Because the only way for it to be perfectly accurate would be for the ENTIRE FLUID simulation to be 100% accurate. But its not. so you NEED that compensation to correct for the short comings of our PC\u0027s.\u003C/p\u003E\u003Cp\u003ESo in this case, less accurate = more accurate. ie: 0.02 is more realistic \u0022FEELING\u0022 then 0.00002 Because we can never achieve true realism with our current PC\u0027s. They\u0027re just too slow.\u003C/p\u003E\u003Cp\u003EI hope this clearifies things for you.\u003C/p\u003E\u003Cp\u003EGood day.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-09T02:09:33Z","Content":"\n\u003Cp\u003EOh, I see. Because KSP can\u0027t handle n-body mechanics, that\u0027s why 1G is rounded to 10m/s^2, right? Makes perfect sense.\u003C/p\u003E\u003Cp\u003ESeriously, your post is making clear that you literally have no idea what FAR \u003Cem\u003Eis.\u003C/em\u003E Please try again.\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-06-09T02:11:55Z","Content":"\n\u003Cp\u003EA reminder to please keep it polite and calm here - we all enjoy ferram\u0027s hard work on nuFAR and we should give him credit for what he has done rather than what he is still working on.\u003C/p\u003E\n"},{"CreatedByName":"smartdummies","CreatedById":112718,"CreatedDateTime":"2015-06-09T02:14:42Z","Content":"\n\u003Cp\u003EThere seems to be an issue when grappler causing parachutes to think that they are in fairings. I was attempting to complete a retrieve debris from orbit contract and with FAR the parachutes do not activate because they report being inside a fairing after grabbing the debris piece. I have tried reentries without grabbing and the parachutes activate properly (I have no fairings on the vessel), I tried again after arming the grappler and the parachutes worked appropriately. But when I grab the part the parachutes start reporting that they are in a fairing and cannot deploy. When removing FAR I can retrieve the debris and still have my parachutes activate. I have tried both stock chutes and RealChutes and both have the same behavior. I had this using Ferri and also the current dev build of 9f7d5b2 (I hope this is correct - I just downloaded from the link in Gryphon\u0027s post above so I assume your commit today is what I got I do apologize if it is not, I do hate to give incorrect information)\u003C/p\u003E\u003Cp\u003EOutput log here \u003Ca href=\u0022https://www.dropbox.com/s/hnvebmbl1bd8cl7/output_log.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/hnvebmbl1bd8cl7/output_log.zip?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECraft file here \u003Ca href=\u0022https://www.dropbox.com/s/ok6jy3480dwaqb7/LKO%20Retriever.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ok6jy3480dwaqb7/LKO%20Retriever.zip?dl=0\u003C/a\u003E (this one has stock parachutes)\u003C/p\u003E\u003Cp\u003ESave file used in testing (LKO Retriever in orbit ready for rendezvous - this one has RealChutes) \u003Ca href=\u0022https://www.dropbox.com/s/d2n674cd05cjply/FAR%20Issue%20Test.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/d2n674cd05cjply/FAR%20Issue%20Test.zip?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDuplicated with the save using only\u003C/p\u003E\u003Cp\u003E- MechJeb 2.5.1 (not the dev builds)\u003C/p\u003E\u003Cp\u003E- RealChute 1.3.2.3\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-06-09T02:28:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Solar71\u0022 data-cite=\u0022Solar71\u0022\u003E\u003Cdiv\u003ELOL, be realistic dude. This thread is 1000\u002B pages long. You are \u0022realistically\u0022 expecting someone to read through that?\u003Cp\u003EI came here for help with a feature in FAR that is not working correctly. In response I got \u0022WHY DO YOU WANT TO DO THAT?\u0022\u003C/p\u003E\u003Cp\u003EBut that is a DODGING of my question. Not an answer. \u003C/p\u003E\u003Cp\u003Esecondly I don\u0027t want anything from this FAR dude. In fact I never asked for anything from him, except to read my bug report, and either FIX IT or NOT.\u003C/p\u003E\u003Cp\u003EI don\u0027t really care either way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich you have conveniently ignored the response to how I would be fixing it, by removing the malfunctioning feature entirely.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ELet me tell you something, only good users report bugs. Bad users don\u0027t report bugs, but instead just stop using the software without giving the DEV a chance to fix it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood users report bugs. Bad users demand that devs do exactly as their whims desire and fill up their thread with complaints without basis. Most users are apathetic and don\u0027t have enough stake to be interested, and that\u0027s ok. Being disinterested enough to not want to go to the trouble of making a bug report isn\u0027t evil.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESecondly fluid dynamics are very complicated. The only reason in FAR that they have the atmospheric viscosity set to 0.00002 (accurate)\u003Cp\u003Eis because they don\u0027t understand that the atmosphere must be much thicker to \u0022COMPENSATE\u0022 for the fluid dynamic pseudo simulation that KSP uses.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUmmm.... what? Are you trying to tell me that you need to put completely wrong numbers in to get realistic numbers out? Citations? Where is the math and theory that you are basing this on?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou see, KSP \u0022TRIES\u0022 to simulate a fluid dynamic called atmosphere. But to do this correctly, all our PC\u0027s would need to be 100 x faster to achieve a minimum 30 fps. You see, if we try to accurately simulate true fluid dynamic, all our KSP\u0027s would turn to 1 fps slide shows.\u003Cp\u003ESo what KSP does is cut corners... LOTS of corners!!! This is so that our PC\u0027s can give us that 30-120 fps that we require for having fun...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, simulating full CFD for an entire vehicle or the atmosphere would be a slideshow. No flight simulator does that. Incidentally, they use realistic values, like an air viscosity near 0.00002 kg/m*s and a sea level density of 1.225 kg/m^3 (just like on Kerbin) and they get correct numbers out.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo to COMPENSATE ksp thickens the atmosphere to simulate a true atmosphere. Its not accurate, maybe too thick...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECitation? Kerbin\u0027s atmosphere is 1.225 kg/m^3 at SL, just like Earth, and has a approximate scale height of ~5 km, which is only slightly smaller than Earth\u0027s 7.5 km. Of the many things you could say about Kerbin\u0027s atmosphere, too thick is not one of them. This was even true back with the massdrag model, where the error as entirely in the drag coefficients. All things considered, KSP\u0027s atmospheric models are really quite accurate all things considered.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo FAR comes out and improves the fluid simulation, but its still NOT EVEN CLOSE to realistic... Yes its MUCH BETTER than stock, but its still a LONG way off.\u003Cp\u003ESo FAR also needs to compensate by possibly thickening up the atmosphere as well. Maybe not as much, but still it needs some help.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConsidering that virtually everything I\u0027ve implemented has been out of the literature, I\u0027d find it really difficult that it still manages \u0022NOT EVEN CLOSE to realistic.\u0022 If anything, most of the errors in FAR are actually in the opposite direction; from NathanKell\u0027s tests, drag in FAR is ~30-80% too high for prop planes in flight, and I can see it being too high for a few other things as well.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo in FAR when they set the atmosphere to 0.00002 viscosity, its actually NOT correct. Because the only way for it to be perfectly accurate would be for the ENTIRE FLUID simulation to be 100% accurate. But its not. so you NEED that compensation to correct for the short comings of our PC\u0027s.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...you don\u0027t make fluid dynamics simulations more accurate by feeding garbage numbers into them. That\u0027s not how it work for anything else, that\u0027s certainly not how it works for fluids.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo in this case, less accurate = more accurate. ie: 0.02 is more realistic \u0022FEELING\u0022 then 0.00002 Because we can never achieve true realism with our current PC\u0027s. They\u0027re just too slow.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...you\u0027re arguing that putting garbage in is more accurate than putting the proper values in? Do tell! How are you ensuring that the math works out properly in the end? What theories are you citing? NACA, NASA, and most of the aerospace contractors have all worked on fast approximations of simplified aerodynamics for these kinds of applications, and never in any of my research have I come across a model that uses incorrect values as finagles to get more accurate outcomes... which one are you basing your decision on, so that I can take a look at it?\u003C/p\u003E\u003Cp\u003ESurely you\u0027ve got some data to cite, something beyond feelings, right? Because I\u0027m not interested in what feels right, I\u0027m interested in what \u003Cem\u003Eis\u003C/em\u003E right, and so far, all your data points to adjustments going the wrong way.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI hope this clearifies things for you.\u003Cp\u003EGood day.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt did, in the most... enlightening... way possible.\u003C/p\u003E\u003Cp\u003EAs a final note, this post has been heavily modified to stick with the sensibilities of our current moderators, as actually stating my current value-judgments on this is not allowed here.\u003C/p\u003E\n"},{"CreatedByName":"RyanRising","CreatedById":79932,"CreatedDateTime":"2015-06-09T02:48:31Z","Content":"\n\u003Cp\u003EOkay, so the latest dev build of FAR seemed to fix this odd voxelization. And as an added bonus, there\u0027s a cool blue line too. Hm.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/JdKgI\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EShould I still test the stock\u002BVSR configurations? It would seem a bit redundant.\u003C/p\u003E\u003Cp\u003EEDIT: Wait, no, darnit. I posted the wrong area ruling screenshot. The dev build screenie is below:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Jxo50Xd.jpg\u0022 alt=\u0022Jxo50Xd.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EEDIT2: Also, and this is completely unrelated, the KSP forums seems to have a lot more internet-style arguments popping up lately. Although, this could be just my perspective.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-09T04:09:27Z\u0022 title=\u002206/09/2015 04:09  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 9, 2015\u003C/time\u003E by RyanRising\u003C/strong\u003E\n\u003Cbr\u003EHaha. I went back in this thread for perspective, and saw Ferram saying not to use ASAS in-atmo. ASAS! I remember ASAS.\n\u003C/span\u003E\n"},{"CreatedByName":"rakutenshi","CreatedById":40086,"CreatedDateTime":"2015-06-09T05:42:46Z","Content":"\n\u003Cp\u003E1st .. just wanting to say I\u0027m one of the great masses that feels FAR/nuFAR are almost required to play KSP happily, even with the new (massively improved) stock aero model. \u003C/p\u003E\u003Cp\u003E2nd, I\u0027m nothing close to a computational fluid dynamicist, but I get the feeling that Ferram4 is, or has at least had several courses worth of exposure to it, so often when things go wrong for me in a save where I\u0027m using FAR, even when it goes horribly wrong, my first assumption is that I did something wrong and honestly I don\u0027t know enough to differentiate between user error and an actual bug. \u003C/p\u003E\u003Cp\u003E3rd. KSP Forums celebrates we love Ferram4 day and enters a golden age. \u003C/p\u003E\u003Cp\u003E@RyanRising, re:edit2, probably related to official release, it\u0027s no longer a super scary early access title, so your perspective probably has merit.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-06-09T14:31:38Z","Content":"\n\u003Cp\u003EI\u0027m kinda coming back to FAR, have a couple of questions for you guys especially those with good experience of this mod, ideally ferram4:\u003C/p\u003E\u003Cp\u003EAbout NuFAR and aerodynamics in general, \u003C/p\u003E\u003Cp\u003E0) Since the voxel model is discarded at craft launch and only the aero values are stored, how does FAR recaclulate aero values on the fly if a craft\u0027s wings move or all the bits flying everywhere when it explodes. Also if a craft is just rotated in the editor 3 times and saved on 3 files, will each of these craft have slightly different aero stats when loading? (since voxel dont model exactly the same way depending on the angle towards horizon 0Ã‚Â° of SPH)\u003C/p\u003E\u003Cp\u003E1) What\u0027s best and why? Center of lift above, below or perfectly in line with the center of mass?\u003C/p\u003E\u003Cp\u003E2) Is it important that the center of thrust passes exactly through the center of mass? If not why do some planes still fly straight SAS disabled when it\u0027s not the case? Do these designs compensate with a center of lift misplacement? If so isn\u0027t it subject to evolve at different speeds due to mach effects?\u003C/p\u003E\u003Cp\u003E3) How can I retain good AoA passed mach1 without blowing up the wings? It seems everything just blow up now almost too easily. \u003C/p\u003E\u003Cp\u003EIn other words is it possible to make a supersonic supermaneuverable jet in FAR? Would be so much fun to fly it..\u003C/p\u003E\u003Cp\u003E4) Do crash tolerance values affect resistance to aero failure or is it negligible compared to geometry?\u003C/p\u003E\u003Cp\u003E5) What is cross sectional area?\u003C/p\u003E\u003Cp\u003E6) It looks like the structural intake and the XMG50 intake\u0027s internal cavity is modeled by voxels correctly but not the one of the ram air intake which is weird. Is it intentional or a bug?\u003C/p\u003E\u003Cp\u003EI really like the Firehound in the mod\u0027s craft pack, how it turns and handles.\u003C/p\u003E\u003Cp\u003EA couple specific question about it:\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of the small Oscar-B tanks below the body with nose cones at the tips? Does it reduce drag / add stability?\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of having flaps on the front of the wings (and why are they not enabled)?\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of setting flaps on spoiler mode constantly? Is it just for airbraking?\u003C/p\u003E\u003Cp\u003EAny help appreciated\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-09T14:51:20Z\u0022 title=\u002206/09/2015 02:51  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 9, 2015\u003C/time\u003E by RevanCorana\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bakase","CreatedById":134737,"CreatedDateTime":"2015-06-09T14:51:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RevanCorana\u0022 data-cite=\u0022RevanCorana\u0022\u003E\u003Cdiv\u003EI\u0027m kinda coming back to FAR, have a couple of questions for people with good experience of this mod, ideally ferram4:\u003Cp\u003EAbout NuFAR and aerodynamics in general, \u003C/p\u003E\u003Cp\u003E0) Since the voxel model is discarded at craft launch and only the aero values are stored, how does FAR recaclulate aero values if a craft moves its wings in flight or explodes. Also if a craft is just rotated in the editor 3 times and saved on 3 files, will each of these craft have slightly different aero stats when loading? (since voxel dont model exactly the same depending on the angle towards horizon 0Ã‚Â° of SPH)\u003C/p\u003E\u003Cp\u003E1) What\u0027s best and why? Center of lift above, below or perfectly in line with the center of mass?\u003C/p\u003E\u003Cp\u003E2) Is it important that the center of thrust passes exactly through the center of mass? If not why do plane still fly straight SAS disabled when it\u0027s not the case? Do these designs compensate with a center of lift misplacement? If so isn\u0027t it subject to evolve at different speeds due to mach effects?\u003C/p\u003E\u003Cp\u003E3) How can I retain good AoA passed mach1 without blowing up the wings? It seems everything just blow up now almost too easily. \u003C/p\u003E\u003Cp\u003EIn other words is it possible to make a supersonic supermaneuverable jet in FAR? Would be so much fun to fly it..\u003C/p\u003E\u003Cp\u003E4) Do crash tolerance values affect resistance to aero failure or is it negligible compared to geometry?\u003C/p\u003E\u003Cp\u003E5) What is cross sectional area?\u003C/p\u003E\u003Cp\u003EI really like the Firehound in the mod\u0027s craft pack, how it turns and handles.\u003C/p\u003E\u003Cp\u003EA couple specific question about it:\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of the small Oscar-B tanks below the body with nose cones at the tips? Does it reduce drag / add stability?\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of having flaps on the front of the wings (since they\u0027re not enabled)?\u003C/p\u003E\u003Cp\u003EWhat\u0027s the point of setting flaps on spoiler mode constantly? Is it just for airbraking?\u003C/p\u003E\u003Cp\u003EAny help appreciated\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52080-Basic-Aircraft-Design-Explained-Simply-With-Pictures\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/52080-Basic-Aircraft-Design-Explained-Simply-With-Pictures\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis should help you with 1 and 2.\u003C/p\u003E\u003Cp\u003EFor 3, have you tried increasing wing strength using the tweakables in the hangar? Making high-G maneuvers past mach 1 is always going to be a bit sketchy, though... Also consider how force is applied to the wings (thin wide wings will snap easily, but thick short ones will be more resilient).\u003C/p\u003E\u003Cp\u003E5. If you took a thin slice of the aircraft at one point on its length, the area of that slice (the cross-section) is the cross-sectional area.\u003C/p\u003E\u003Cp\u003EYour first two questions about the firehound have the same answer. This is for area ruling. Basically, to minimise something called wave drag (which occurs at transonic speeds), you have to minimise the second derivative of the cross-sectional area with respect to distance along the plane\u0027s principle axis. More simply, you need the cross-sectional area to vary smoothly. Adding parts can help to do this.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-06-09T15:02:33Z","Content":"\n\u003Cp\u003E1) It depends. Use FAR\u0027s graphs and simulations. The CoL is, at best, a hint.\u003C/p\u003E\u003Cp\u003E2) Misaligned CoT always produces torque, no matter what, but aerodynamics can create a countering torque and thus planes can still fly straight. In fact, this can be taken advantage of to make the throttle an extra orientation control input.\u003C/p\u003E\u003Cp\u003E3) More wing area, less mass to hold up.\u003C/p\u003E\u003Cp\u003E4) For non-wing parts, no idea, but for wing parts, it\u0027s mass (which FAR sets and you can tweak via the right-click menu).\u003C/p\u003E\u003Cp\u003E5) Treat your plane as solid, slice it along a plane perpendicular to the fore/aft axis of your plane... how much paint do you need to cover the new surfaces?\u003C/p\u003E\u003Cp\u003E6) sorry, I can\u0027t answer.\u003C/p\u003E\u003Cp\u003EThe bumps are for \u0022area ruling\u0022, a method of reducing trans-sonic drag. I don\u0027t know the details of forward flaps (slats?). Spoilers \u003Cem\u003Eare\u003C/em\u003E airbrakes as such: when deployed, they reduce the lift of the wing requiring a higher AoA to maintain the same lift and thus causing the whole vessel to become an airbrake.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-06-09T15:16:31Z","Content":"\n\u003Cp\u003ERevanCorana, you might try looking at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/111541-Thinking-about-making-the-switch-to-FAR\u0022 rel=\u0022external nofollow\u0022\u003Emy own shenanigans with FAR\u003C/a\u003E; the meaty stuff starts on page four and the recent stuff begins on page 29. I asked a lot of the same questions and got some good answers.\u003C/p\u003E\n"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-09T15:45:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00224plains\u0022 data-cite=\u00224plains\u0022\u003E\u003Cdiv\u003EFinally made a nuFAR tutorial. Hope you\u0027ll all enjoy it.\u003Cp\u003E4plains\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/IqbU9aSUrGA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B1 on reputation for effort. Although yelow line by itself is not \u0022stability line\u0022 at all. Will some craft will be stable or not depends on things how other lines look like in area where yelow line cross X axis of graph.\u003C/p\u003E\u003Cp\u003EYou have probably figured out from expirience in craft building that if yelow line goes smoothly close to X axis that and falls down all the way that craft will behave good enough in flight.\u003C/p\u003E\u003Cp\u003EHowever, calling that \u0022stability line\u0022 by itself without other lines on graph is wrong and misleading. You need to look all of those lines at once, to figure out optimal behaviour of your craft.\u003C/p\u003E\u003Cp\u003EBut I must admit that I disregarded \u0022pitch\u0022 thing on graph. \u00221\u0022 means 100% of pitching from pilot input while \u00220\u0022 is without pilot input at all.\u003C/p\u003E\u003Cp\u003EFinally I am able to fine tune controls to pinpoint accuracy, so you can pitch up plane all day without pushing craft in dangerous stall AoA area.\u003C/p\u003E\n"},{"CreatedByName":"kineticPull","CreatedById":117047,"CreatedDateTime":"2015-06-09T22:42:19Z","Content":"\n\u003Cp\u003EMy craft are having an issue. When I add wings to a vehicle, the center of lift remains stationary relative to the original center of mass (sans wings). This issue does not occur in stock.\u003C/p\u003E\u003Cp\u003EI\u0027m running ksp 64 bit linux (gentoo to be exact)\u003C/p\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2015-06-10T03:36:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kineticPull\u0022 data-cite=\u0022kineticPull\u0022\u003E\u003Cdiv\u003EMy craft are having an issue. When I add wings to a vehicle, the center of lift remains stationary relative to the original center of mass (sans wings). This issue does not occur in stock.\u003Cp\u003EI\u0027m running ksp 64 bit linux (gentoo to be exact)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECoL is more or less meaningless in FAR now. Use static analysis instead to determine stability.\u003C/p\u003E\n"},{"CreatedByName":"Solar71","CreatedById":140993,"CreatedDateTime":"2015-06-10T04:25:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EOh, I see. Because KSP can\u0027t handle n-body mechanics, that\u0027s why 1G is rounded to 10m/s^2, right? Makes perfect sense.\u003Cp\u003ESeriously, your post is making clear that you literally have no idea what FAR \u003Cem\u003Eis.\u003C/em\u003E Please try again.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyes you are totally correct. 1g = 9.82 m/s per second.\u003C/p\u003E\u003Cp\u003Ebut AERODYNAMICS is MUCH more then acceleration.\u003C/p\u003E\u003Cp\u003Einfinite numbers of finite forces, turbulence, to be calculated. Its literally impossible for a home PC to do this at 30 fps \u002B\u003C/p\u003E\u003Cp\u003ELITTERALLY IMPOSSIBLE!!!\u003C/p\u003E\u003Cp\u003EThat\u0027s why these fluid simulations have to cut corners...\u003C/p\u003E\u003Cp\u003ELook dude, I think FAR is a wonderful mod, That\u0027s why im in here trying to figure out a fix.\u003C/p\u003E\u003Cp\u003EIf I didn\u0027t like FAR, I would just delete it and move on. But since I do VERY much like FAR, I would love to see it fixed. \u003C/p\u003E\u003Cp\u003EI don\u0027t really care that much, if the DEV made FAR for himself or for others. The point is, HE released it to the general public.\u003C/p\u003E\u003Cp\u003EThe General public absolutely SHOULD report bugs. If this DEV cant emotionally handle constructive criticism, then I don\u0027t know what to tell him.\u003C/p\u003E\u003Cp\u003EIf the DEV doesn\u0027t want to fix his mod, that\u0027s totally ok, its his choice. FAR, will just have to join the dodo bird.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DuoDex\u0022 data-cite=\u0022DuoDex\u0022\u003E\u003Cdiv\u003EA reminder to please keep it polite and calm here - we all enjoy ferram\u0027s hard work on nuFAR and we should give him credit for what he has done rather than what he is still working on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I wasn\u0027t trying to be rude. I really didn\u0027t expect so much hostility from reporting a \u0022non-working\u0022 feature.\u003C/p\u003E\u003Cp\u003EI thought someone would reply with \u0022ok the bug is know, and hopefully someone will fix it soon\u0022\u003C/p\u003E\u003Cp\u003EOnce again I apologize.\u003C/p\u003E\n"},{"CreatedByName":"Flashblade","CreatedById":99058,"CreatedDateTime":"2015-06-10T05:34:11Z","Content":"\n\u003Cp\u003E@Solar71 maybe you can\u0027t help it but you have a very aggressive posting style that really doesn\u0027t help matters at all. Why do you keep harping on how ferram is unwilling to fix things? He answered you that it would be fixed by removing the feature because it is not being used as intended.\u003C/p\u003E\n"}]}