{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":427,"Articles":[{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2015-07-25T15:41:13Z","Content":"\n\u003Cp\u003EIs relaxed stability a good idea for a maneuverable plane? I\u0027ve tried it and even with AoA limits on many different values it\u0027s too uncontrollable to be practical.\u003C/p\u003E\u003Cp\u003ETo increase maneuverability on a stable aircraft, can I just increase wing area so it brings the prograde vector towards the nose\u0027s position faster? I\u0027m working on fighter planes right now, so tips would be much appreciated! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-25T17:32:20Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Gigeran: \u003C/strong\u003EI can reproduce the exception, but no crash. I suspect the crash is from something else in your install, not FAR, because exceptions being thrown shouldn\u0027t cause crashes.\u003C/p\u003E\u003Cp\u003EEdit: Fixed in dev build, still dunno what the crash is about though.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@steve_v: \u003C/strong\u003EAnd every time I update there seems to be a new CKAN screwup with metadata or with figuring out the version number... I think it\u0027s safe to just treat it as permanently broken rather than hope it doesn\u0027t screw up.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Naten: \u003C/strong\u003ERelaxed stability is a good idea, but outright uncontrollable instability isn\u0027t. There\u0027s a fine line there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-25T17:40:28Z\u0022 title=\u002207/25/2015 05:40  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 25, 2015\u003C/time\u003E by ferram4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MugWanaBe","CreatedById":148523,"CreatedDateTime":"2015-07-25T21:37:42Z","Content":"\n\u003Cp\u003EFerram I am running the latest versions I was just using the older post for reference. Anyway at about 4800 meters 257ms and mach .7ish makes and un controllable turn putting the rocket on its side and braking apart in the proses. The SAS can fight past the flip a 100ms but you can see an the navball an the way the thrusters gimbal that the rocket is swaying in a mall circle around the prograde marker. If I touch the controls to try to fix the swaying the rocket will make a large turn an put the vassal an its side. But the rocket can get through the swaying by gong straight up but as listed above at 257ms the goes to its side an breaks up. There seems to be a large amount of drag on the side on the rocket that the shorter tank extension is on. If there is a fix for this I am not smart enough to figure it out on my own. That is why I bring up post #2352 because it seems to house a fix to this problem but I cant figure it out.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2015-07-25T22:05:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MugWanaBe\u0022 data-cite=\u0022MugWanaBe\u0022\u003E\u003Cdiv\u003EFerram I am running the latest versions I was just using the older post for reference. Anyway at about 4800 meters 257ms and mach .7ish makes and un controllable turn putting the rocket on its side and braking apart in the proses. The SAS can fight past the flip a 100ms but you can see an the navball an the way the thrusters gimbal that the rocket is swaying in a mall circle around the prograde marker. If I touch the controls to try to fix the swaying the rocket will make a large turn an put the vassal an its side. But the rocket can get through the swaying by gong straight up but as listed above at 257ms the goes to its side an breaks up. There seems to be a large amount of drag on the side on the rocket that the shorter tank extension is on. If there is a fix for this I am not smart enough to figure it out on my own. That is why I bring up post #2352 because it seems to house a fix to this problem but I cant figure it out.\u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like your rocket is just aerodynamically unstable. So not a problem with FAR, but a problem with your design. Put some fins on the bottom and make sure the center of lift is close to the center of mass in the VAB\u003C/p\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2015-07-25T22:48:13Z","Content":"\n\u003Cp\u003ECenter of lift is meaningless in FAR.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-25T23:00:52Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@MugWanaBe: \u003C/strong\u003EThere is no fix, this is all proper behavior, and the ancient post has a fix for very, \u003Cem\u003Every\u003C/em\u003E abnormal behavior from an ancient version of FAR. This is why you should \u003Cem\u003Enever\u003C/em\u003E use 2 year old posts as reference for something in active development, because now you\u0027re confused and looking to implement a fix for a system that doesn\u0027t even exist anymore. That fix was implemented for the drag system in FAR v0.12, before all of that system was ripped out in favor of the current voxel-based system.\u003C/p\u003E\u003Cp\u003EFor now, you need to use active control to maintain stability. Everything is being simulated correctly, you simply need to adjust and handle it.\u003C/p\u003E\n"},{"CreatedByName":"Amedee","CreatedById":134429,"CreatedDateTime":"2015-07-26T00:42:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022steve_v\u0022 data-cite=\u0022steve_v\u0022\u003E\u003Cdiv\u003EWhile I completely understand Ferrams stance on CKAN, after a bit of wrangling with it there\u0027s only one major issue I can see: CKAN doesn\u0027t clean up old files or directories properly (specifically when files are created \u003Cem\u003Eafter\u003C/em\u003E install), which can confuse ModuleManager horribly. \u003Cp\u003ESo make sure you completely remove mod directories on uninstall/reinstall - manually. \u003C/p\u003E\u003Cp\u003EIf you\u0027re having issues with a CKAN installed FAR, wander over to the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127492-FAR-via-CKAN-Support-Thread\u0022 rel=\u0022external nofollow\u0022\u003Eappropriate thread\u003C/a\u003E. I\u0027m seeing far less than the expected traffic volumes over there. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, be aware that you may still experience issues even with a manual FAR install - if you have other mods that were installed/uninstalled via CKAN.\u003C/p\u003E\u003Cp\u003EYour best bet for getting in on the support racket here is to reproduce your issues in a simple stock\u002BFAR install, no CKAN in sight.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have my entire KSP directory in Git, so it is *extremely* easy for me to compare different versions of files.\u003C/p\u003E\u003Cp\u003EI had FAR installed with CKAN, version 0.15.4. I uninstalled that and then made sure that the directories FerramAerospaceResearch and ModularFlightIntegrator were gone. Then I installed FAR 0.15.4 manually, from a zip file I downloaded from kerbalstuff. Finally I did a git status, to see if there were any changes. Result:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eamedee@kerbol:~/Games/KerbalSpaceProgram$ git status \u003Cbr\u003EOn branch develop\u003Cbr\u003Enothing to commit, working directory clean\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis means that, at least for FAR 0.15.4 and at least on my machine, CKAN FAR and manual FAR are identical.\u003C/p\u003E\u003Cp\u003EI understand that this may have been different in the past and that it may be different again in the future, but as far as current evidence tells me, the two ways of installing FAR are byte-per-byte identical.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Amedee: \u003C/strong\u003ENeed reproduction steps and craft file, along with full list of all mods. If any of this involves CKAN though, I can\u0027t help you; CKAN is known to cause installation issues with FAR and possibly other mods, so there\u0027s no support for CKAN users here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just spent a day replacing over 200 mods from CKAN installation to manual installation, and verifying that the CKAN and manual installs were identical. They were - verified with git status because I have my entire KSP directory in Git. The only differences are config files that are created after install, but I also have them under version control so rollback is trivial.\u003C/p\u003E\u003Cp\u003ESteps to reproduce: I hope this Youtube vid is ok:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/QHcNyLuaW04?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ECraft file: \u003Ca href=\u0022http://pastebin.com/Te24hv6g\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/Te24hv6g\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFull list of installed mods, as exported from CKAN before I reinstalled them manually: \u003Ca href=\u0022http://pastebin.com/R7eP6RfY\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/R7eP6RfY\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat was the easiest way to also get the version numbers. To be very clear: my current KSP install is CKAN-free. Or to be precise: CKAN is in my master branch and CKAN-free is in my develop branch, and I can now switch between the two with a simple \u0060git checkout\u0060.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-07-26T01:43:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Amedee\u0022 data-cite=\u0022Amedee\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eamedee@kerbol:~/Games/KerbalSpaceProgram$ git status \u003Cbr\u003EOn branch develop\u003Cbr\u003Enothing to commit, working directory clean\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis means that, at least for FAR 0.15.4 and at least on my machine, CKAN FAR and manual FAR are identical.\u003C/p\u003E\u003Cp\u003EI understand that this may have been different in the past and that it may be different again in the future, but as far as current evidence tells me, the two ways of installing FAR are byte-per-byte identical.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat test is valid only if you ran \u0022git status\u0022 before committing the changes from installing FAR. \u0022git status\u0022 tells you only whether you have uncommitted changes.\u003C/p\u003E\u003Cp\u003EA more correct method would be:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EInstall FAR via CKAN.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECommit changes to git.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Egit tag far-ckan-install\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eremove all FAR and FAR dependency files and directories.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ecommit changes\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInstall FAR and its dependencies by hand.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ecommit changes\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Emake sure FAR is working fixing anything you missed and commiting along the way\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Egit tag far-hand-install\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Egit diff far-ckan-install far-hand-install\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf \u0022git diff\u0022 comes up blank, then you know there are no changes.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-26T02:21:43Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Amedee: \u003C/strong\u003EFirst, the craft you linked is not the craft from your video; I can\u0027t even get it to lift off the pad. Second, the behavior in the video is behavior that has never been caused by FAR; the camera moving away from the vehicle above 6 km implicates another mod. FAR may be the cause of everything flying apart during staging, but the camera indicates that something else breaks first and is the true initial cause of any issues. Work through your mods and find that one, because FAR doesn\u0027t do anything different at the 6 km origin shift.\u003C/p\u003E\u003Cp\u003EAlso, I don\u0027t particularly care whether any individual CKAN install is identical to a manual installation; one correct installation is not proof of future correctness, especially considering that several months of it correctly installing FAR didn\u0027t prevent it from screwing up so royally lately.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2015-07-26T02:59:05Z","Content":"\n\u003Cp\u003EHey Ferram,\u003C/p\u003E\u003Cp\u003EIs there a point at which you expect FAR to be able to work independently of cfg file edits? I ask because a few of my favorite mods don\u0027t have FAR configs.\u003C/p\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2015-07-26T03:07:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mekan1k\u0022 data-cite=\u0022Mekan1k\u0022\u003E\u003Cdiv\u003EHey Ferram,\u003Cp\u003EIs there a point at which you expect FAR to be able to work independently of cfg file edits? I ask because a few of my favorite mods don\u0027t have FAR configs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only thing that definitely requires custom FAR configs at this point is wings.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2015-07-26T03:28:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blowfish\u0022 data-cite=\u0022blowfish\u0022\u003E\u003Cdiv\u003EThe only thing that definitely requires custom FAR configs at this point is wings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly! Any plans to phase that out? Eventually?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-26T04:19:28Z","Content":"\n\u003Cp\u003EIn an ideal world, it would already be gone. The problem is getting the computer to properly classify what is and isn\u0027t a wing and get all the geometric data from it, and do it all perfectly. This is basically aero-DeepDream, that has to be perfect, and run fast. This is obviously probably not going to happen soon, if ever. If it was a nice, simple problem, it would be long, long gone.\u003C/p\u003E\u003Cp\u003EAnd even if something like that worked, it would be imperfect and probably require some amount of configs to deal with those situations.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-07-26T05:03:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EAnd even if something like that worked, it would be imperfect and probably require some amount of configs to deal with those situations.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFerram is the \u003Ca href=\u0022https://github.com/ferram4/Ferram-Aerospace-Research/wiki/Deriving-FAR-values-for-a-wing-using-Blender-2.7\u0022 rel=\u0022external nofollow\u0022\u003EWiki tutorial on wing data\u003C/a\u003E still accurate? I haven\u0027t done anything for 1.x.x yet so I\u0027m unsure. Since it\u0027s understandably not feasible to have FAR handle wings automatically anyone looking to do wing configs should be pointed to the wiki. If it\u0027s not up to date though...\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-26T05:06:08Z","Content":"\n\u003Cp\u003EIt should be, the config definitions haven\u0027t changed in a long, long time.\u003C/p\u003E\n"},{"CreatedByName":"sashan","CreatedById":98897,"CreatedDateTime":"2015-07-26T08:57:12Z","Content":"\n\u003Cp\u003EWell, here am I again with revoxelization problems.\u003C/p\u003E\u003Cp\u003EI don\u0027t have a very powerful processor, so the procedure is quite noticeable in form of small stuttering. It isn\u0027t an issue with one craft, but when I have a full scene with BDarmory... Like 10 missiles, two planes, 5 ground vehicles and such, it becomes a pain.\u003C/p\u003E\u003Cp\u003ESo, small suggestion: Decrease frequency of update significantly for one-part ships, it would increase performance for those missiles, and debris.\u003C/p\u003E\u003Cp\u003EAlso, maybe it would be easier to check for part positions change being in certain marigin and animation states not changed and then abort revoxelization? Should save some cycles.\u003C/p\u003E\n"},{"CreatedByName":"Gigeran","CreatedById":133801,"CreatedDateTime":"2015-07-26T09:14:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Gigeran: \u003C/strong\u003EI can reproduce the exception, but no crash. I suspect the crash is from something else in your install, not FAR, because exceptions being thrown shouldn\u0027t cause crashes.\u003Cp\u003EEdit: Fixed in dev build, still dunno what the crash is about though.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you and I will try to trace it further.\u003C/p\u003E\u003Cp\u003ETried removing infernal robotics, tac, alarm clock, etc. before I posted here.\u003C/p\u003E\u003Cp\u003EProbably your error report is the only one catching something happening somewhere else earlier on.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-26T20:21:03Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@sashan: \u003C/strong\u003EI see no voxelization problems in your report; those are all things that need to be done to simulate aerodynamics. It already delays 600 ms between updates on the same vessel, I don\u0027t see how I can increase that any more without basically giving up on any attempt at actually simulating aerodynamics. None of this should even be a problem at all; you will only have revoxelization during missile launches (required to get changes in aero due to changes in external loadout) or during vehicle animations (required unless we\u0027ve decided that swing wings shouldn\u0027t affect aerodynamics). Anything else won\u0027t happen unless another mod forces FAR to re-voxelize more often, and at that point it\u0027s out of my hands.\u003C/p\u003E\n"},{"CreatedByName":"natan","CreatedById":123237,"CreatedDateTime":"2015-07-27T04:46:55Z","Content":"\n\u003Cp\u003Ehey, im getting some inconsistent ablator usage, about the same periapsis on two reentriess, one from low orbit, other from mun return, two slight different vessels, the mun one with some universal storage modules between capsule and heat sheild, and the heat shield was the stock one, while on the low orbit, i used the heat shield that comes with the corvus mod, i dont think that this is the problem because heat shields use the ablator resource, which is the same for both. So, on the mun return, i got 0 usage, thats right, pretty much a bug, on the low orbit i got about 98% usage, on others reentries, mostly low orbit, i got about 10% to 20% usage. The only mod that changes physics that i have installed is far, every other is parts or utilities, i always use around the same periapsis on my reentries and the vessels most of the time are capsules only, with one or other experiment part.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-27T05:19:30Z","Content":"\n\u003Cp\u003EYou\u0027re trying to compare two completely different parts that likely have two completely different thermal masses and ablator configs. Of course they\u0027re going to have different usages; this doesn\u0027t sound like a bug anywhere in FAR, if it\u0027s a bug at all.\u003C/p\u003E\n"},{"CreatedByName":"Sady1969","CreatedById":148866,"CreatedDateTime":"2015-07-27T10:41:56Z","Content":"\n\u003Cp\u003EI\u0027m interested in learning more about how FAR calculates drag in subsonic flight. How can I find out quantitatively how much drag is coming from \u0022short and fat\u0022 vs \u0022long and thin\u0022, how much from changes in surface area etc?\u003C/p\u003E\n"},{"CreatedByName":"nimaroth","CreatedById":148350,"CreatedDateTime":"2015-07-27T18:01:38Z","Content":"\n\u003Cp\u003EHi Ferram !\u003C/p\u003E\u003Cp\u003EFirst, let me thank you for your mod ... it\u0027s really well done !\u003C/p\u003E\u003Cp\u003ENow, the issue at hand ... I\u0027ve actually some troubles with a rotor engine for chopper. After talking with Blowfish, I\u0027ve made another set of test with your latest dev version but sadly, not the result expected.\u003C/p\u003E\u003Cp\u003EThe engine is from KAX pack. I used KAX, AJE and of course FAR, AJE and FAR with the last dev version.\u003C/p\u003E\u003Cp\u003EThe engine name is Bell UH-1 Huey Engine\u0026amp;Rotor. And now, the steps :\u003C/p\u003E\u003Cp\u003E - Activating SAS\u003C/p\u003E\u003Cp\u003E - Activating the engine\u003C/p\u003E\u003Cp\u003E - Cutting the engine with [X]\u003C/p\u003E\u003Cp\u003E =\u0026gt; Sent to space\u003C/p\u003E\u003Cp\u003EMessages from the log (those messages are repeated endlessly) :\u003C/p\u003E\u003Cp\u003E[LOG 19:51:20.349] Look rotation viewing vector is zero\u003C/p\u003E\u003Cp\u003E[LOG 19:51:20.350] Look rotation viewing vector is zero\u003C/p\u003E\u003Cp\u003E[LOG 19:51:20.350] Look rotation viewing vector is zero\u003C/p\u003E\u003Cp\u003E[ERR 19:51:20.353] Actor::setAngularDamping: The angular damping must be nonnegative!\u003C/p\u003E\u003Cp\u003E[ERR 19:51:20.353] Actor::setAngularDamping: The angular damping must be nonnegative!\u003C/p\u003E\u003Cp\u003E[ERR 19:51:20.354] Actor::setAngularDamping: The angular damping must be nonnegative!\u003C/p\u003E\u003Cp\u003E[ERR 19:51:20.354] Actor::setAngularDamping: The angular damping must be nonnegative!\u003C/p\u003E\u003Cp\u003E[ERR 19:51:20.355] Actor::setAngularDamping: The angular damping must be nonnegative!\u003C/p\u003E\u003Cp\u003E[ERR 19:51:20.355] Actor::setAngularDamping: The angular damping must be nonnegative!\u003C/p\u003E\u003Cp\u003E[ERR 19:51:20.356] Actor::setAngularDamping: The angular damping must be nonnegative!\u003C/p\u003E\u003Cp\u003E[ERR 19:51:20.356] Actor::setAngularDamping: The angular damping must be nonnegative!\u003C/p\u003E\u003Cp\u003E[EXC 19:51:20.357] ArithmeticException: NAN\u003C/p\u003E\u003Cp\u003E System.Math.Sign (Double value)\u003C/p\u003E\u003Cp\u003E SolverEngines.EngineThermodynamics.FromChangeReferenceFrame (SolverEngines.EngineThermodynamics t, Double speed, Boolean forward)\u003C/p\u003E\u003Cp\u003ESecond test :\u003C/p\u003E\u003Cp\u003E - Activating the engine\u003C/p\u003E\u003Cp\u003E - Cutting the engine with [X]\u003C/p\u003E\u003Cp\u003E =\u0026gt; No trouble\u003C/p\u003E\u003Cp\u003EHoping it\u0027ll help ! (I have notified all three mods concerned)\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-07-27T18:48:37Z","Content":"\n\u003Cp\u003ELooks like it\u0027s entirely under AJE, (or technically, the SolverEngines dependency), because that\u0027s what the error points to.\u003C/p\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2015-07-27T19:08:49Z","Content":"\n\u003Cp\u003EThat method will only throw an exception once speed is already NaN. I was able to replicate the black screen, but it seems to be fixed after adjusting AJE\u0027s wildcards.\u003C/p\u003E\n"},{"CreatedByName":"natan","CreatedById":123237,"CreatedDateTime":"2015-07-27T19:54:21Z","Content":"\n\u003Cp\u003Eok sounds silly compare the two now looking the configs, but, by it self the mun return reentry with zero ablator usage doesn\u0027t look strange?\u003C/p\u003E\n"}]}