{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":169,"Articles":[{"CreatedByName":"andqui","CreatedById":93107,"CreatedDateTime":"2014-05-09T19:31:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003E@andqui: \u003C/strong\u003EMake sure that the payload is symmetrical and that there is nothing interfering with the fins. It is always possible that you have some type of inertial coupling going on, in which case, it\u0027s part of the physics engine and is realistic.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, I took off the fins entirely leaving only an engine, which shouldn\u0027t provide any roll authority. When I hit the q/e keys to roll with that setup, and no fins at all, the rocket does the same thing and begins to pitch, so it\u0027s an issue with the gimbals, not with FAR, my apologies.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-05-09T19:41:58Z","Content":"\n\u003Cp\u003EAh. You\u0027re using a gimbal mod then. The engine on the central core will try to contribute to rolling the rocket if you don\u0027t switch off roll control, but since it\u0027s not balanced by another engine it adds a lot of yaw / pitch. Switch the center engine off for roll control and it should be fine.\u003C/p\u003E\n"},{"CreatedByName":"andqui","CreatedById":93107,"CreatedDateTime":"2014-05-09T20:31:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EAh. You\u0027re using a gimbal mod then. The engine on the central core will try to contribute to rolling the rocket if you don\u0027t switch off roll control, but since it\u0027s not balanced by another engine it adds a lot of yaw / pitch. Switch the center engine off for roll control and it should be fine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHope you don\u0027t mind me asking about something not part of your mod, but would you know how to do that? I\u0027m not using tweakable gimbals or Space Shuttle Engines- just whatever comes with RO/Engine Igniter/Real Fuels/RFTS/Exurgent Engineering. The engines have an attribute that says \u0022smarter gimbal\u0022, with values for pitch and yaw range, but I can\u0027t adjust them or turn off roll by right clicking the engine or by going into action groups- the only thing I can do is lock the gimbal entirely as a tweakable.\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-05-09T21:22:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andqui\u0022 data-cite=\u0022andqui\u0022\u003E\u003Cdiv\u003EHope you don\u0027t mind me asking about something not part of your mod, but would you know how to do that? I\u0027m not using tweakable gimbals or Space Shuttle Engines- just whatever comes with RO/Engine Igniter/Real Fuels/RFTS/Exurgent Engineering. The engines have an attribute that says \u0022smarter gimbal\u0022, with values for pitch and yaw range, but I can\u0027t adjust them or turn off roll by right clicking the engine or by going into action groups- the only thing I can do is lock the gimbal entirely as a tweakable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESmarter Gimbal is a module from the Exsurgent Engineering plugin, which RFTS applies to a lot of its engine configurations. It makes engines gimbal in roll, but it doesn\u0027t give you individual control of that axis.\u003C/p\u003E\u003Cp\u003EQuickest fix I can think of: How does the rocket fly if you allow the fins to deflect in pitch and yaw? That would at least give SAS more control authority to counter-balance the incorrect gimbaling.\u003C/p\u003E\u003Cp\u003ESomeone on the RFTS thread might have more ideas. A centerline engine with pitch/yaw gimbal is pretty common in historical rockets, and you can\u0027t be the first to try to apply roll input to one.\u003C/p\u003E\n"},{"CreatedByName":"Tarantulae","CreatedById":76135,"CreatedDateTime":"2014-05-09T23:31:05Z","Content":"\n\u003Cp\u003EApologies if this has come up before, but I noticed that when I had a FT200 fuel tank radially mounted, it was fine. When I mounted it axially sideways with the side facing forward, it would break off. I am confused, as being mounted frontways, it had a flat surface presented to the wind, which should cause more force than when it is sideways with the curved tank side toward the wind.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ORQSTK7.png\u0022 alt=\u0022ORQSTK7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fL8ooLQ.png\u0022 alt=\u0022fL8ooLQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2bkypDp.png\u0022 alt=\u00222bkypDp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ezPSfip.png\u0022 alt=\u0022ezPSfip.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MAKC","CreatedById":57186,"CreatedDateTime":"2014-05-10T09:26:41Z","Content":"\n\u003Cp\u003EFeature request:\u003C/p\u003E\u003Cp\u003ETSFC \u0026amp; range estimations that work with Real Fuels \u0026amp; AJE. Pretty please? Occasionally I like to try my hand at designing cruise missiles \u0026amp; long distance cargo planes and it would be interesting to see how far theoretically they could get without actually spending the hours upon hours of time it takes for the fuel to run out.\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-05-10T10:02:17Z","Content":"\n\u003Cp\u003EFerram4, sorry i have to bother you again :\u0026gt;\u003C/p\u003E\u003Cp\u003EThis time i encountered a problem with the spoiler setting. The direction of deflection is sometimes reversed. It may be shown correctly in the editor but in flight it can still be wrong. I think i encountered this in particular with spoilers which deploy downwards or to the sides.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d62OA7f.jpg\u0022 alt=\u0022d62OA7f.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-05-10T20:07:13Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Tarantulae: \u003C/strong\u003EThat\u0027s because you\u0027re mounting a rocket fuel tank so that it takes all the forces laterally, even though rocket fuel tanks don\u0027t like taking lateral forces at all. In addition, the surfaces presented are about the same size, and a cylinder that size in cross flow is about as draggy as if it were in axial flow without any ends on it. Try this: take a soda can and see how much force it takes to squish the top down into the bottom. Now take another can and see how much force it takes to crush it from the side. Same principle here.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@MAKC: \u003C/strong\u003ETSFC already works with AJE. All the numbers that come out of it are correct and are in good agreement with the literature. Range and endurance are different problems, since those rely on a constant L/D and V * L/D ratio to function properly.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@DaMichel: \u003C/strong\u003EI know about that, it\u0027s because the spoilers try to deflect upwards, and when the part is mounted sideways it can\u0027t figure out what \u0022up\u0022 is. I can try recoding the algorithm, but no promises.\u003C/p\u003E\n"},{"CreatedByName":"Tarantulae","CreatedById":76135,"CreatedDateTime":"2014-05-10T20:37:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Tarantulae: \u003C/strong\u003EThat\u0027s because you\u0027re mounting a rocket fuel tank so that it takes all the forces laterally, even though rocket fuel tanks don\u0027t like taking lateral forces at all. In addition, the surfaces presented are about the same size, and a cylinder that size in cross flow is about as draggy as if it were in axial flow without any ends on it. Try this: take a soda can and see how much force it takes to squish the top down into the bottom. Now take another can and see how much force it takes to crush it from the side. Same principle here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess my confusion is that the curved side of a fuel tank should be more aerodynamic and reduce the force applied by a decent amount. Also, the fuel tank isn\u0027t breaking itself, the axial connection was breaking. I would think an axial connection would be stronger than the radial space glue connections that are normally made when placing things radially. Which of these is actually stronger? Axial or radial connections?\u003C/p\u003E\n"},{"CreatedByName":"Aeon-Phoenix","CreatedById":96954,"CreatedDateTime":"2014-05-10T21:38:33Z","Content":"\n\u003Cp\u003EOkay i\u0027m officially stumped.\u003C/p\u003E\u003Cp\u003EWhile i love the mod and the airframe stress simulation. I fail to survive the re-entry no matter what spaceplane i use. \u003C/p\u003E\u003Cp\u003EAnd i thought i do everything right. shallow reentry with an pergee of around 30km. healthy pitch and the occasional S-maneuver to reduce speed. But i simply fail to reduce enough speed, before i hit the denser part of the athmosphere and i get torn apart by the aerodynamic stress.\u003C/p\u003E\u003Cp\u003EAny pointers?\u003C/p\u003E\n"},{"CreatedByName":"Dirt_Merchant","CreatedById":69465,"CreatedDateTime":"2014-05-10T21:42:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaMichel\u0022 data-cite=\u0022DaMichel\u0022\u003E\u003Cdiv\u003EFerram4, sorry i have to bother you again :\u0026gt;\u003Cp\u003EThis time i encountered a problem with the spoiler setting. The direction of deflection is sometimes reversed. It may be shown correctly in the editor but in flight it can still be wrong. I think i encountered this in particular with spoilers which deploy downwards or to the sides.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/d62OA7f.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/d62OA7f.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy solution to this problem has traditionally been to set the deployment values to the negative when the spoilers are to deploy downwards. I maybe have allowed myself some extra negative deflection than is normally available in release versions of FAR....\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-05-10T21:59:07Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Tarantulae: \u003C/strong\u003EThe pressure on the front face is going to be about the same, and there\u0027s going to be separated, low pressure flow over the rearward side in both cases. The effect would be much more differnet if you picked a cylinder that didn\u0027t have the same length as diameter, but overall it doesn\u0027t matter for this size part. Granted, it should be slightly less draggy in cross flow at Mach 1 compared to being in axial flow, but you\u0027re never getting that fast for that to happen.\u003C/p\u003E\u003Cp\u003EIt\u0027s the internal part structure failing that causes it to break off, not the joint itself. I\u0027m not looking at the size of the joint, just the size of the part relative to the forces that it gets in a particular direction. FWIW, if I used the actual visible connection area between parts (so, a connection area of 0, since it\u0027s just a line where the cylinders meet) all parts would break off radially immediately, so I have to overestimate that.\u003C/p\u003E\u003Cp\u003ERegardless, your design is aerodynamically terrible. If the fuel tanks didn\u0027t shear off, the SAS units would, since they\u0027re in high-drag orientations as well. It also has no wing area for its mass, and that\u0027s causing you to try and take off at nearly half the speed of sound; come on, even the F-104 took off at Mach 0.4, and most planes take off below Mach 0.2.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Aeon-Phoenix: \u003C/strong\u003EYou\u0027re still losing altitude too aggressively, or you\u0027re not putting your vehicle in a high drag orientation like you should. An AoA of \u0026gt;25 degrees is generally needed to slow a spaceplane down effectively. I\u0027ve actually found that if you can get enough lift out of the vehicle a slightly steeper initial reentry (periapsis underground) is quit effective, and you use the vehicle\u0027s lift to level it out around ~40 km. If you can\u0027t get your spaceplane up to those AoAs, or it\u0027s too unstable at those AoAs, you need to redesign or pump fuel around to balance it.\u003C/p\u003E\n"},{"CreatedByName":"Tarantulae","CreatedById":76135,"CreatedDateTime":"2014-05-10T22:37:01Z","Content":"\n\u003Cp\u003EThanks for the quick replies. I do appreciate it.\u003C/p\u003E\u003Cp\u003EI understand over estimating the strength of the radial connection, since they are basically just stuck together along a line, but I don\u0027t see why axial is so much weaker in comparison. I\u0027ll learn to live with it though.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-05-10T22:45:15Z","Content":"\n\u003Cp\u003EIf you want an understanding, take a soda can and tape it something first using the side, and then using the base. Then push on the far end of the can and see how much force it takes to make it fail in each orientation. It\u0027s that the structural design of the fuel tank is designed to handle forces along its axis, not perpendicular to it, in the same way that a tree branch can take simple compression fine but then fail suddenly under bending.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2014-05-11T05:06:00Z","Content":"\n\u003Cp\u003EOh Ferram, as it turns out, the wing-rotor thing\u0027s drag...it has ModuleResourceIntake, so it wasn\u0027t using FAR at all the entire time, as it turns out.\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-05-11T07:42:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EI know about that, it\u0027s because the spoilers try to deflect upwards, and when the part is mounted sideways it can\u0027t figure out what \u0022up\u0022 is. I can try recoding the algorithm, but no promises.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would probably add a checkbox to the tweakable settings for radial deflection. By that i mean that spoilers would try to deflect away from the center of the parent part. Alternatively i would try to obtain the surface normal where the spoiler is attached and deflect away from that. The checkbox option is certainly easier and more robust so take this as a feature request.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dirt_merchand\u0022 data-cite=\u0022dirt_merchand\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMy solution to this problem has traditionally been to set the deployment values to the negative when the spoilers are to deploy downwards. I maybe have allowed myself some extra negative deflection than is normally available in release versions of FAR.... \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup. I tried that but FAR still decides sometimes to reverse the deflection of symmetrical counterparts.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Eou\u0027re still losing altitude too aggressively, or you\u0027re not putting your vehicle in a high drag orientation like you should. An AoA of \u0026gt;25 degrees is generally needed to slow a spaceplane down effectively. I\u0027ve actually found that if you can get enough lift out of the vehicle a slightly steeper initial reentry (periapsis underground) is quit effective, and you use the vehicle\u0027s lift to level it out around ~40 km. If you can\u0027t get your spaceplane up to those AoAs, or it\u0027s too unstable at those AoAs, you need to redesign or pump fuel around to balance it. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is how i do it. Periapsis slightly underground so that the trajectory intersects the start of the continent where KSC is on. My vehicles usually have plenty of lift or to be more precise low wing loading since they come in almost dry. While high up i brake a bit more by going at an AoA of 90 deg. After that, the vehicle must have enough control authority to pull out of the dive which i found not too hard to achieve. I had some close calls though due to the new aerodynamic disintegration (awesome!). I fly with somewhat lower AoA even. Maybe up to 20 deg but i think its mostly closer to 15 deg. I switch to the map screen a lot to see where my trajectory ends up and bleed off speed as needed by flying turns (following the teachings of Scott Manly). It is easy to fling yourself up out of the atmosphere again but it is to be avoided because then you lose control authority and thus cannot brake any further. So go sideways when you see your vertical speed increase. After some practice i found it possible to make unpowered approaches and landings regularly (provided that the craft behaves properly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Aeon-Phoenix","CreatedById":96954,"CreatedDateTime":"2014-05-11T08:06:42Z","Content":"\n\u003Cp\u003EThanks for the reply Ferram.\u003C/p\u003E\u003Cp\u003EYeah on the paper (in the spaceplane hangar) high AOAs should not be a problem. But in space i get the yellow marker coming up: high AOA. That still in the okay range? (cause it got me worried)\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-05-11T08:23:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Tiron: \u003C/strong\u003EOh. Yeah, FAR won\u0027t touch that at all, just because I\u0027ve had trouble getting intake modeling with FAR to work well.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@DaMichel: \u003C/strong\u003EWill look into it. I\u0027d prefer to do the surface normal (probably really just using the vector from the spoiler position to the position of the part it\u0027s attached to).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Aeon-Phoenix: \u003C/strong\u003EWarnings are warnings, to be disregarded at the pilot\u0027s discretion if needed. The high AoA warning only goes off if you\u0027re ~20 degrees off, which is where planes tend to stall and rockets are too far gone to save. It\u0027s a tool and an alert to the unaware that they\u0027re doing something quite dangerous when they go that far off prograde, but for reentry you can generally ignore that, since there\u0027s a much more pressing danger to deal with.\u003C/p\u003E\n"},{"CreatedByName":"Aeon-Phoenix","CreatedById":96954,"CreatedDateTime":"2014-05-11T08:51:06Z","Content":"\n\u003Cp\u003EOh i know about warnings and disregarding them... hurp (Flaming Cliffs: OVER-G OVER-G OVER-G!)\u003C/p\u003E\u003Cp\u003EThat brings me an idea. how about a \u0022*****ing Betty\u0022, \u0022Hank the Yank\u0022 or \u0022Nagging Nadja\u0022? Generally an GPWS of sorts?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-05-11T09:00:29Z","Content":"\n\u003Cp\u003EAt least two mods exist for that. Search for GPWS?\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-05-11T09:03:45Z","Content":"\n\u003Cp\u003EAll right thanks Ferram4. \u003C/p\u003E\u003Cp\u003EHere is yet another issue. I tried to make a piece of fuselage using the interstage adapter from procedural fairings. The problem is that parts within the fairings are not properly shielded. This occurs only if the fairing pieces are added individually *without* symmetry. In the VAB as shown here nobody would do that. But in SPH i cannot get that kind of symmetry. In fact i cannot even place fairing pieces with left/right symmetry. Anyway, symmetry on or off, the resulting mesh appears to be the same so i bring this up here.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NCm3LR8.jpg\u0022 alt=\u0022NCm3LR8.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-11T12:21:33Z\u0022 title=\u002205/11/2014 12:21  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 11, 2014\u003C/time\u003E by DaMichel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-11T09:16:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EAt least two mods exist for that. Search for GPWS?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, except both are out-of-date by about two versions of KSP, and the download link for one of them is dead. I\u0027ve been contemplating making one myself. It\u0027d be an excuse to learn C# at least.\u003C/p\u003E\n"},{"CreatedByName":"Aeon-Phoenix","CreatedById":96954,"CreatedDateTime":"2014-05-11T10:41:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003ESure, except both are out-of-date by about two versions of KSP, and the download link for one of them is dead. I\u0027ve been contemplating making one myself. It\u0027d be an excuse to learn C# at least.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you want to give it a shot. I do got a selection of sounds for both the female betty and the russian nadja. including stall, roll, pitch and altitude calls as wellas landing gear calls and flaps etc. well everything they got.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2014-05-11T10:54:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Tiron: \u003C/strong\u003EOh. Yeah, FAR won\u0027t touch that at all, just because I\u0027ve had trouble getting intake modeling with FAR to work well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt turned out that either something with the intake was the source of the drag, or just that removing it lets FAR give it a drag model (although it still doesn\u0027t show a drag force indicator, so I\u0027m not sure it did.) It also turns out FSLiftsurface turning itself off in the presence of FAR actually works, and without a FAR wing module in the file, the part in question simply loses all lift generating ability entirely.\u003C/p\u003E\u003Cp\u003EI\u0027m working on trying to add the hacky-FAR-Wing along the lines of what you said right now, but I think I\u0027m doing something wrong(or it\u0027s a problem with the model orientation, which I can\u0027t fix). It\u0027s constantly stalled in forward flight (crabbing unstalls it), and seems to break off quite easily (doing severe damage to the plane as it flies backwards.) For the mo\u0027 I think I might just leave it in \u0027no lift at all\u0027 mode.\u003C/p\u003E\u003Cp\u003EEdit: well now it\u0027s showing a drag force indicator with the intake gone, musta missed it earlier.\u003C/p\u003E\u003Cp\u003EEdit2: I\u0027m just gonna have to write the bloody thing off. It\u0027s a neat idea and cute, but it\u0027s got major issues at the moment.\u003C/p\u003E\u003Cp\u003EThe drag in level flight is fine, no big deal. Put the nose up even the tiniest bit, however, and it goes titanic. I saw it spike over 100 kN once. There\u0027s something weird with it too, because when the drag shoots up it induces a massive right roll, the combined effect of which is to make high speed, high altitude runs difficult to maintain.\u003C/p\u003E\u003Cp\u003EOddly, the unmodified double-rotor works better than this thing, even after I\u0027ve chopped it down and hacked at it.\u003C/p\u003E\u003Cp\u003EAnd I\u0027ve *still* yet to find a way to STOL this thing other than \u0027stick a helo rotor on top\u0027, which is so absurd it\u0027s not even funny. TT\u0027s engines come close but there\u0027s some pretty serious issues getting everything aligned properly, which the extreme non-uniformity doesn\u0027t help(the scorpions having different thrust and a faster spool up time, for example). The fact that all the pitch vector engines only generate half thrust on the runway doesn\u0027t help, either.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-11T12:15:04Z\u0022 title=\u002205/11/2014 12:15  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 11, 2014\u003C/time\u003E by Tiron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Flayer","CreatedById":109391,"CreatedDateTime":"2014-05-11T12:19:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Flayer: \u003C/strong\u003ELower TWR. Start gravity turn early. Stay pointed prograde. Don\u0027t put really light fluffy payloads on top of big heavy rockets. Fairings. Fins if you need them. Pictures help with diagnosis.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the hints. It took me a while, but I am here to report success. I started out a new career savegame with some mods such FAR, DRE and TAC so I had to relearn a bunch of stuff starting from 0 research.\u003C/p\u003E\u003Cp\u003EBut, since my last post I have managed to get a rocket into space and brought back some surface samples from the Mun. I even managed to get an SSTO into stable orbit around Kerbin once I unlocked the 2nd tier jet engines. I have yet to bring it back, but I feel confident I can do it (and otherwise the pod can eject and chute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\n"}]}