{"TopicId":19321,"ForumId":34,"TopicTitle":"[1.3.1] Ferram Aerospace Research: v0.15.9.1 \u0026quot;Liepmann\u0026quot; 4/2/18","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-09-14T23:22:36Z","PageNum":86,"Articles":[{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2013-11-25T21:41:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@LORDPrometheus: \u003C/strong\u003ENo, rockets only flip if their center of mass is too \u003Cem\u003Elow\u003C/em\u003E, which puts it behind the aerodynamic center. I really don\u0027t understand where this idea that the center of mass has to be low for rockets comes from; haven\u0027t any of you people played with darts before?\u003Cp\u003E\u003Cstrong\u003E@awdAvenger: \u003C/strong\u003ESure, it should make a lot of drag. It\u0027s a sudden decrease in cross-sectional area; in the configuration that it\u0027s in, that part will cause an area of very, very low pressure to form behind it, which is what drag is primarily caused by for shapes like that. Frankly, for that design the short Rockomax adapter isn\u0027t the worst; it\u0027s the other adapters above it that are further from the CoM that will cause it to flip over.\u003C/p\u003E\u003Cp\u003ESecond \u0022isShielded\u0022 is for parts in cargo bays / payload fairings. I should probably make that clearer.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@ANWRocketMan: \u003C/strong\u003EYeah, that\u0027s been fixed for such low speeds in v0.11. Granted, you can still get things like that to happen at higher speeds, but that\u0027s because at high speeds everything makes a decent amount of lift.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m glad I\u0027ve gotten behind my design flaws and control attitudes for rockets flipping out.\u003C/p\u003E\u003Cp\u003EI always thought \u0022isShielded\u0022 was a DRE check, which at the start bothered me quite a bit, but I eventually learned to ignore it.\u003C/p\u003E\u003Cp\u003EAh, ok. Thanks for the info. Will update as soon as possible.(during the SpaceX launch most probably).\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-25T21:53:57Z","Content":"\n\u003Cp\u003EIt used to be they both showed up. DRE switched to a new method before I took over, though.\u003C/p\u003E\n"},{"CreatedByName":"Bluegobln","CreatedById":59640,"CreatedDateTime":"2013-11-25T22:40:48Z","Content":"\n\u003Cp\u003EI just wanted to say that quite some time ago I had major issues with this mod. I could not launch rockets without them tumbling and I hardly even tried planes because no design I made could get off the ground for more than a few seconds. I recently launched a rocket and performed a decent gravity turn, not even touching the controls except the throttle, and made my first successful SSTO space plane while using FAR.\u003C/p\u003E\u003Cp\u003EIn other words, I wish to apologize for my rather angry posts here. I took a long break from KSP after my PC died and I lost all my work, both in game and my parts development, and now that I am returning somewhat I felt it might be worth going again.\u003C/p\u003E\u003Cp\u003ESorry for being a jerk. Thank you for this great mod. Glad it works now, or that *I* work now... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2013-11-26T02:39:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@mhoram: \u003C/strong\u003EForbidding the use of payload fairings with FAR basically makes designing a properly stable payload above ~50 tonnes almost impossible; a payload fairing is much more aerodynamic than slapping radially-attached fuel tanks with nosecones on either end. You could allow payload fairings but require that they be jettisoned before figuring out the total mass of the payload, effectively balancing out whatever aerodynamic dV benefits that might come from them by reducing the payload fraction. Don\u0027t require them, but don\u0027t forbid them either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59595-Payload-Fairing-Comparison?p=803339\u0026amp;viewfull=1#post803339\u0022 rel=\u0022external nofollow\u0022\u003Eplaying around\u003C/a\u003E a bit with Procedural Fairings, Anvil Rockets, KW Rocketry and Novapunch I tested them with 20-ton payloads in FAR and have the impression that they function quite well with FAR, because I managed to get all of them into orbit on the first try (in two cases thanks to a big Delta-V reserve \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E).\u003C/p\u003E\u003Cp\u003EIf there is no concern about these four fairings, I will allow them in the challenge - although they don\u0027t seem to be perfectly comparable.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-26T02:52:45Z","Content":"\n\u003Cp\u003EI saw your conclusions, and think that you should probably set them up with different leaderboards for procedural fairings and other fairings. That would allow you to separate the differences in payload fraction with size and the ability to be able to stuff most anything into a procedural fairing.\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2013-11-26T03:23:33Z","Content":"\n\u003Cp\u003EThanks for the suggestion. I think I will start with a single leaderboard and split it up, once there are enough entries.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-11-26T19:08:01Z","Content":"\n\u003Cp\u003EI\u0027m loving the new flight data window. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-11-26T22:30:25Z","Content":"\n\u003Cp\u003EI\u0027m curious as to whether ground effect could be accurately portrayed... E.g. high pressure air cushioning a hovercraft or specially designed plane...\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-11-26T22:44:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pds314\u0022 data-cite=\u0022Pds314\u0022\u003E\u003Cdiv\u003EI\u0027m curious as to whether ground effect could be accurately portrayed... E.g. high pressure air cushioning a hovercraft or specially designed plane...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis should also make lading large aircraft easier. Pilots report that the 747 practically lands itself, purely because of its size.\u003C/p\u003E\u003Cp\u003EIf I remember correctly FAR does not model this.\u003C/p\u003E\n"},{"CreatedByName":"s20dan","CreatedById":1080,"CreatedDateTime":"2013-11-26T22:46:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EThis should also make lading large aircraft easier. Pilots report that the 747 practically lands itself, purely because of its size.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven in a small light aircraft like a PA-28 you really feel the ground effect as you land.\u003C/p\u003E\u003Cp\u003E It\u0027s cool :-)\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-11-26T22:51:55Z","Content":"\n\u003Cp\u003EStrange issue with B9:\u003C/p\u003E\u003Cp\u003EB9 Aerospace HW21 heavy wings (The really big ones that allow you to make airliners with single-piece wings) have an infiniglide-like bug.\u003C/p\u003E\u003Cp\u003EAbove ~230 m/s, they resonate and move at about mach 1.\u003C/p\u003E\u003Cp\u003ESo as long as you stay below about 3-5 km, a ship mostly composed of said wings can sustain indefinite un-powered flight.\u003C/p\u003E\u003Cp\u003EHowever, going above the maximum altitude in such a craft causes the wings to exert bizarre aerodynamic forces powerful enough to tear some planes apart (16.4 G in one test)\u003C/p\u003E\u003Cp\u003ESimple test, put a small stock SRB below a command pod mk I, attach 8 HW21 heavy wings to it, you now have a controllable high-subsonic low-altitude infiniglider (that can\u0027t be turned off.)\u003C/p\u003E\u003Cp\u003EIt is also recommended that such a vehicle have control surfaces behind the wings to keep it oriented correctly.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-26T23:40:43Z","Content":"\n\u003Cp\u003EEvery time I\u0027ve tried to model ground effect it ends up being unnoticeable in any form other than the extra performance cost.\u003C/p\u003E\u003Cp\u003EThe B9 huge wings twitching seems to be more related to the flap code; I think I\u0027m going to have to rewrite it again. That said, it isn\u0027t showing any infinigliding; large wings with small payloads results in a very high L/D ratio, which means that it will fly for a very long time before coming down.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-11-26T23:46:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EEvery time I\u0027ve tried to model ground effect it ends up being unnoticeable in any form other than the extra performance cost.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would be less than desirable, yes. Do you mean that it is unnoticable because it really is that small, or because it is troublesome to model it fully?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-26T23:57:42Z","Content":"\n\u003Cp\u003EIt\u0027s difficult to model properly. I admit, it would be funny to see people build planes that can just barely fly along the runway, but they get to the end and drop like a brick because the runway falls away from them, but every attempt at modeling ground effect either resulted in physics glitches, or what appeared to be very inconsistent amounts of lift that didn\u0027t vary properly with wingspan or wing loading. The only way that resulted in anything that made any sense also resulted in only tiny increases in lift. So basically, it seems to be more trouble than it\u0027s worth, at least for now.\u003C/p\u003E\n"},{"CreatedByName":"Selgald","CreatedById":75221,"CreatedDateTime":"2013-11-27T00:29:33Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI need some help here, without FAR this thing flys. With FAR something strange happens.\u003C/p\u003E\u003Cp\u003EI made a short Video. Link:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/hNcJoCYrado?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThanks for help.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-27T01:15:48Z","Content":"\n\u003Cp\u003EIs it supposed to have one control surface missing on one side? I think the problem might be related to the issue with the B9 huge wings \u002B control surface, where the code freaks out with tiny flaps attached to large wings.\u003C/p\u003E\n"},{"CreatedByName":"Selgald","CreatedById":75221,"CreatedDateTime":"2013-11-27T01:28:21Z","Content":"\n\u003Cp\u003EThe control surface was gone before i started recording, but with it there was no difference. Its not B9 its Taverio\u0027s Pizza and Aerospace v1.5.1 , maybe those parts don\u0027t work with FAR?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-27T01:49:39Z","Content":"\n\u003Cp\u003EPerhaps it\u0027s not stable enough in yaw? Try adding a larger vertical tail further back and see if that helps. Your design doesn\u0027t look particularly stable in yaw.\u003C/p\u003E\u003Cp\u003EHow does this behavior start? What are the forces on each of the wings (you can check by right-clicking)?\u003C/p\u003E\u003Cp\u003EWhat I meant was that someone recently posted about an issue where very tiny control surfaces attached to very large wings caused some lift / drag issues, in a similar situation to what you have going on. That\u0027s why I asked about the uneven control surfaces, since I think that might cause enough of a difference for weird things to happen.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-11-27T04:39:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat said, it isn\u0027t showing any infinigliding; large wings with small payloads results in a very high L/D ratio, which means that it will fly for a very long time before coming down.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, this is definitely infiniglide. I can circumnavigate, turn at 13 G, accelerate upward, etc. For example, say I pitch 3 degrees up and am moving 289 m/s, If I engage SAS, I slow down by about 3 m/s. If I then proceed to disengage SAS, I accelerate back up. I have now gained both kinetic and potential energy, thus proving that it is actually accelerating against gravity, that is to say, generating thrust.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-11-27T04:43:54Z","Content":"\n\u003Cp\u003EAlso, when I crash my prototype 700-kerbal airliner at 160 m/s during takeoff, the 12 HW21 wings fly forward at supersonic speeds with no explicable cause (all engines are gone).\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-27T05:54:10Z","Content":"\n\u003Cp\u003EI want to see a video of this. Either there is something wrong with your FAR install, or you\u0027re running into a bug in the physics simulation that I can\u0027t fix. There are only two forces applied to a wing by FAR: lift and drag. Drag is in the direction opposite of movement, while lift is applied completely perpendicular to movement, which by definition can\u0027t increase the magnitude of the wing\u0027s velocity. Based on that, the wing \u003Cem\u003Emust\u003C/em\u003E lose energy.\u003C/p\u003E\u003Cp\u003EGo into the B9 files, find the HW21 wing and remove the winglet parameters from it. Then try again and see if the error persists.\u003C/p\u003E\u003Cp\u003EEdit: You\u0027re certain that you\u0027re using control surfaces that are FAR-compatible, correct? If they aren\u0027t, then infiniglide will still be caused by those surfaces.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T07:22:42Z\u0022 title=\u002211/27/2013 07:22  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by ferram4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2013-11-27T20:39:31Z","Content":"\n\u003Cp\u003EDear Ferram,\u003C/p\u003E\u003Cp\u003EI like to copy edit (\u003Ca href=\u0022https://en.wikipedia.org/wiki/Copy_editing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Copy_editing\u003C/a\u003E) and I\u0027ve noticed that your README could be better written. Would you like me to copy edit it and send you the new version?\u003C/p\u003E\u003Cp\u003EI rewrote the advice section:\u003C/p\u003E\u003Cp\u003E-- ROCKETS --\u003C/p\u003E\u003Cp\u003EConsider aerodynamic forces lest they sunder your vehicle or render it uncontrollable.\u003C/p\u003E\u003Cp\u003EGeneral troubleshooting suggestions:\u003C/p\u003E\u003Cp\u003E -- Research gravity turns. With stock KSP, a gravity turn means \u0022go straight up and then pitch over 45 degrees all at once\u0022 whereas with FAR, it means a gentler, smoother turning over: throughout it stay within 5 degrees of the surface prograde marker (slightly more than the size of the circle on the marker). WARNING: Large angles of attack can cause a loss of control in many designs.\u003C/p\u003E\u003Cp\u003E -- Reduce your TWR. Old stock KSP designs can replace every Mainsail with a Skipper and still fly. Large TWRs tend to cause overspeeding in the lower atmosphere, which can cause aerodynamic forces to overpower control authority.\u003C/p\u003E\u003Cp\u003E -- Use more serial staging and less parallel staging because with FAR installed, achieving orbit requires less dV and longer rockets usually are more aerodynamically stable. Also, as the mass drains out of the first stage\u0027s tanks, so the CoM moves forward, further stabilizing the rocket.\u003C/p\u003E\u003Cp\u003E -- Make your first stage last until the upper atmosphere; early staging events can suddenly change the launch vehicle\u0027s dynamics and, by Murphy\u0027s Law, at an inopportune time.\u003C/p\u003E\u003Cp\u003E -- Add fins to the bottom if you need an extra little bit of control. Their effectiveness will drop near Mach 1 due to transonic effects, but they can help on some troublesome designs.\u003C/p\u003E\u003Cp\u003E -- ASAS in the atmosphere can cause flexing oscillations that reduce control due to uneven aerodynamic effects. \u003C/p\u003E\u003Cp\u003E -- Instead of launching entire bases and space station sections, launch them in pieces and assembles them in orbit.\u003C/p\u003E\u003Cp\u003E-- AIRPLANES AND SPACEPLANES --\u003C/p\u003E\u003Cp\u003EPlanes have much larger lateral aerodynamic forces on them than have rockets and therefore are more difficult to design in KSP. Let real planes inspire you and while in the SPH remember each planes\u0027s purpose, be it subsonic heavy transport, supersonic fighter, or stunt special.\u003C/p\u003E\u003Cp\u003EGeneral troubleshooting suggestions:\u003C/p\u003E\u003Cp\u003E -- If the CoL is before the CoM, then increasing the plane\u0027s angle of attack (which increases lift) causes the plane to pitch up and thereby gain more lift and therefore pitch up, and so on unto many, many flips. Check where the CoL is located in the editor: in the static analysis tab in the FAR GUI, a negative slope for the moment coefficient (Cm, the yellow line on the graph) indicates a stable plane.\u003C/p\u003E\u003Cp\u003E -- Aerodynamic forces change with Mach number; a plane that was perfectly stable at subsonic speeds could become unstable at supersonic speeds (or vice versa, depending on the design). Use the static analysis tab in the FAR GUI in the VAB / SPH to determine how its performance changes with Mach number. Consider sweeping angle of attack at all Mach numbers at which you expect to fly.\u003C/p\u003E\u003Cp\u003E -- The CoM will shift when fuel drains; your plane can become unstable (or too stable to be controlled) if the CoM shifts too much.\u003C/p\u003E\u003Cp\u003E -- So design your plane\u0027s wings that the frontmost lifting surface stalls first, whereafter stall (in order) the canards, main wing, and horizontal tail. The plane therefore will downward pitch if it begins to stall.\u003C/p\u003E\u003Cp\u003E -- A larger vertical tail (placed further back) will dampen yaw and ease landing.\u003C/p\u003E\u003Cp\u003E -- Sweeping a supersonic plane\u0027s wings proportionally to its speed reduces supersonic drag.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T20:59:08Z\u0022 title=\u002211/27/2013 08:59  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Duxwing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2013-11-27T20:51:42Z","Content":"\n\u003Cp\u003EI don\u0027t always recognize the improvements every update but it still feels like christmas every time!\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-11-27T20:55:08Z","Content":"\n\u003Cp\u003EThe problem listed has been found to not be with FAR, as previously thought.\u003C/p\u003E\u003Cp\u003ESo that is why original post is gone....\u003C/p\u003E\u003Cp\u003Ethanks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T21:31:29Z\u0022 title=\u002211/27/2013 09:31  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by drtedastro\u003C/strong\u003E\n\u003Cbr\u003ENew Information\n\u003C/span\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-11-27T21:30:20Z","Content":"\n\u003Cp\u003EThat\u0027s because MJ\u0027s landing autopilot thinks you are using stock KSP\u0027s aerodynamics. FAR makes you reenter differently if you haven\u0027t noticed, so MJ can\u0027t do what it wants to. Try landing on the mun for example, it should work as usual, but on bodies with atmospheres it won\u0027t work. (The landing and aerobreaking predictions won\u0027t work either)\u003C/p\u003E\n"}]}