{"TopicId":22166,"ForumId":34,"TopicTitle":"Kethane Pack 0.9.2 - New cinematic trailer! - 1.0 compatibility update","CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2012-10-14T12:08:20Z","PageNum":143,"Articles":[{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2013-11-19T16:07:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RenatsMC\u0022 data-cite=\u0022RenatsMC\u0022\u003E\u003Cdiv\u003EHi im looking for kethane space craft can someone help ?\u003Cp\u003EThanks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUh, yeah, hit the big building at KSC, choose the parts you want in the right, enter the name of your craft, save it, hit launch ;-)\u003C/p\u003E\n"},{"CreatedByName":"Thourion","CreatedById":47430,"CreatedDateTime":"2013-11-19T16:48:09Z","Content":"\n\u003Cp\u003EHey Majiir, dunno what you did with this update, but yeah its as smooth as silk. The map change speed is day and night compated to the previus release.\u003C/p\u003E\u003Cp\u003EI also have the idea of a more smooth operation. Dunno if its my imagination, or if its the new grid code, or other fixes you may did. \u003C/p\u003E\u003Cp\u003EAnyway cheers.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-19T17:00:54Z","Content":"\n\u003Cp\u003ECan I simply delete the old folder and copy over the new without loosing my Kethane deposits as they are?\u003C/p\u003E\u003Cp\u003EThey are saved in the save file, yes?\u003C/p\u003E\u003Cp\u003EJust to be sure.\u003C/p\u003E\n"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2013-11-19T17:33:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan\u003EPlease note that donations go to \u003C/span\u003E\u003Cstrong\u003E\u003Cspan\u003EMajiir\u003C/span\u003E\u003C/strong\u003E\u003Cspan\u003E and not any other participant in the Kethane project.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003EI will buy things that make me personally happy, like good coffee beans and k-pop socks.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003ERemember: \u003C/span\u003E\u003Cem\u003E\u003Cspan\u003Ea programmer is a tool for converting caffeine into code.\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMmmm good coffee beans... What kind of beans do you like getting? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks for the great mod, it really adds a lot to the game for me and I love that you are continuing to add and expand it.\u003C/p\u003E\n"},{"CreatedByName":"Thourion","CreatedById":47430,"CreatedDateTime":"2013-11-19T17:49:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003ECan I simply delete the old folder and copy over the new without loosing my Kethane deposits as they are?\u003Cp\u003EThey are saved in the save file, yes?\u003C/p\u003E\u003Cp\u003EJust to be sure.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, they are saved in the persistence, Go ahead.\u003C/p\u003E\n"},{"CreatedByName":"LORDPrometheus","CreatedById":61414,"CreatedDateTime":"2013-11-19T18:09:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XbasmanX\u0022 data-cite=\u0022XbasmanX\u0022\u003E\u003Cdiv\u003Eyou have to add it to the settings.cfg your self\u003Cp\u003EDebug = True\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk how do I run the in game GUI then?\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-11-19T19:58:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frederf\u0022 data-cite=\u0022Frederf\u0022\u003E\u003Cdiv\u003EIn future releases can you include settings.cfg in the package with default values? It\u0027s needlessly esoteric to have to look up what the filename is, that it even exists, and what the values are before customizing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/Majiir/Kethane/issues/199\u0022 rel=\u0022external nofollow\u0022\u003ESure thing.\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowstar\u0022 data-cite=\u0022Arrowstar\u0022\u003E\u003Cdiv\u003ENice! What sort of possibilities does the new grid open up?\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Psycix\u0022 data-cite=\u0022Psycix\u0022\u003E\u003Cdiv\u003EI can see a shroud of mystery... what kind of treasures do you have in mind for us? Can we get a hint?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the subject of my blog series in the works, so I\u0027ll try to summarize:\u003C/p\u003E\u003Cp\u003EThe old grid was represented internally as five rectangular grids that get stitched together. Neighbors on the rectangular grid are also neighbors on the geodesic, which makes neighbor lists easy to compute, but things get weird near the edges and \u003Ca href=\u0022https://github.com/Majiir/Kethane/blob/ab5cae15ca85857d24606cbaec3963c0858e48fc/Plugin/GeodesicGrid.cs#L131-L209\u0022 rel=\u0022external nofollow\u0022\u003Ea whole mess of code\u003C/a\u003E was required to handle that. (Neighbor lists are essential for constructing the vertices of the grid cells.) Each cell was indexed by three numbers: two for the location on the rectangle and one to identify the rectangle itself. The two polar cells aren\u0027t actually in any rectangle, so they get these weird negative indices which, you guessed it, require more special-case code.\u003C/p\u003E\u003Cp\u003EInflexibility is the main problem with this structure. In order to store data, those three-dimensional indices are converted into a one-dimensional array index, but if you increase the level of detail on a grid, those indices will be all shuffled around. The structure of the grid dictates that you\u0027re locked in to a single level of detail. It also makes some important algorithms difficult to implement. For Kethane, a common query asks for the cell underneath a given position. With the old grid, the best technique was a hill-climbing approach which ran in exponential time with respect to the number of grid subdivisions. More complex search methods (which I\u0027ll describe in a minute) simply weren\u0027t possible.\u003C/p\u003E\u003Cp\u003EIcosahedral geodesic grids are inherently recursive structures, so the new grid code was built to reflect that. (It uses a tree structure internally.) Indexing starts at the twelve \u0022level 0\u0022 cells which form the grid with the lowest possible level of detail. (This is just an icosahedron.) From there on, each level of detail fully populates the index space after the previous level. In other words, a cell in a given position will never change its index. This means you can change the level of detail of a grid as much as you want, and you can even do it asymmetrically. So, for example, you could have a level 5 grid (like the current Kethane map) and then pick a few cells to draw at level 8.\u003C/p\u003E\u003Cp\u003ESearching for neighbors is now much, \u003Cem\u003Emuch\u003C/em\u003E more complicated, and an additional layer of caching was needed to solve some performance issues. That said, searching for neighbors is also more powerful on the new grid. Whereas previously there was only one set of neighbors for a given cell, the new grid lets you get a cell\u0027s neighbors at \u003Cem\u003Eany level of detail\u003C/em\u003E. For example, cell #0 is the north pole, and we might want to get its level-0 neighbors, which are also pentagons; we might want its level-1 neighbors for performing a search algorithm; or we might want its level-5 neighbors for building the Kethane grid mesh. Although the code is more complex, it\u0027s a more elegant system structurally speaking, and it\u0027s much easier to reason about the new grid mathematically. The recursive structure makes searching for a cell (given a line) much faster (asymptotically speaking) because we can start at the lowest level of detail and progressively increase it as we search. This is the \u0022obvious\u0022 way to perform search, but it wasn\u0027t possible with the old system.\u003C/p\u003E\u003Cp\u003EThis last update takes advantage of the new grid to solve a performance issue. To make mouseover work in the map view, the plugin casts a ray from the screen to the mouse position, and if that ray intersects a grid cell, we show the tooltip. When I added the terrain-conforming grid, I used a MeshCollider to identify the cell hit by the ray, and I took extra care to ensure the raycast operations wouldn\u0027t hurt performance. What I didn\u0027t realize at the time is that mesh colliders take a long time to initialize, and this was happening every time you switch planets in the map view. To solve this, I created a raycasting algorithm specifically for the geodesic grid. At each step, the algorithm tests a group of cells, and for the ones it hits, it generates more cells at a higher level of detail. When casting straight at the grid, about 50 cell tests are required, and for complicated areas with valleys and peaks near a horizon, up to 250 tests are needed. Modern CPUs are fast, so several \u003Cem\u003Ethousand\u003C/em\u003E full raycasts can be done per second. There\u0027s still an initialization routine, but this is okay for a few reasons: (1) it\u0027s a lot faster than before, (2) the data set is small and could potentially be cached, and (3) it\u0027s all my own code, so I can control when it runs.\u003C/p\u003E\u003Cp\u003ESo, on the future of Kethane: The raycasting algorithm is essentially a generalization of the cell-from-line search algorithm, so it could be used for things like scanning at an angle to the surface. Raycasting is efficient, so something like a ground-based pulse which reveals visible cells is now easy to implement. The recursive grid could allow for progressively refined scans, or individual cells could be broken down into \u0022subcells\u0022 to get very detailed information about the surface. A few months ago, I suggested that this grid (which was still a work-in-progress at the time) could be useful for generating detailed altitude maps, and I still think it has applications there.\u003C/p\u003E\u003Cp\u003E\u0022When all you have is a hammer, everything looks like a nail\u0022 and I have a really, really nice hammer.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thourion\u0022 data-cite=\u0022Thourion\u0022\u003E\u003Cdiv\u003EHey Majiir, dunno what you did with this update, but yeah its as smooth as silk. The map change speed is day and night compated to the previus release.\u003Cp\u003EI also have the idea of a more smooth operation. Dunno if its my imagination, or if its the new grid code, or other fixes you may did.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did a lot of performance testing, and it definitely loads faster, although there\u0027s still a substantial delay which could be removed with aggressive caching. I left it out for now because it would have increased memory consumption by up to 15-20MB, and I want to make sure there\u0027s some kind of option to disable that. I also wanted to get some feedback on the changes as they exist currently.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nori\u0022 data-cite=\u0022Nori\u0022\u003E\u003Cdiv\u003EMmmm good coffee beans... What kind of beans do you like getting? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just finished a can of Nicaraguan Maragogype. I cold brew my coffee, and I\u0027ve found darker roasts come out well. With so much less acidity, they sometimes come out more like chocolate than coffee. I\u0027ve only been paying attention to the coffee I buy for about a year, so I\u0027m open to suggestions. Some have generously donated this last week, so I\u0027ll be sure to share what I\u0027m drinking!\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-11-19T20:16:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI just finished a can of Nicaraguan Maragogype. I cold brew my coffee, and I\u0027ve found darker roasts come out well. With so much less acidity, they sometimes come out more like chocolate than coffee. I\u0027ve only been paying attention to the coffee I buy for about a year, so I\u0027m open to suggestions. Some have generously donated this last week, so I\u0027ll be sure to share what I\u0027m drinking!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlmost any bean from Hawaii kicks ass, though not sure about cold brewing.\u003C/p\u003E\u003Cp\u003EAwesome update, the slight delay when opening the map is basically gone (not that I found it very bothersome in the first place). Looking forward to what the new grid code will bring.\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-11-19T21:39:51Z","Content":"\n\u003Cp\u003EThanks, that was a good read!\u003C/p\u003E\n"},{"CreatedByName":"RenatsMC","CreatedById":67531,"CreatedDateTime":"2013-11-19T21:47:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003EUh, yeah, hit the big building at KSC, choose the parts you want in the right, enter the name of your craft, save it, hit launch ;-)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks man \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E , no what i ment , where i can download pre-made space crafts ?\u003C/p\u003E\n"},{"CreatedByName":"Draft","CreatedById":72633,"CreatedDateTime":"2013-11-19T23:16:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003ESo, for example, you could have a level 5 grid (like the current Kethane map) and then pick a few cells to draw at level 8.\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EThe recursive grid could allow for progressively refined scans, or individual cells could be broken down into \u0022subcells\u0022 to get very detailed information about the surface.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo now you could, for example, have low-resolution scanners that can only determine the presence of a resource in a large area, shown on a less-sided grid, followed by more focused ones that work like the current ones and scan smaller cells within those larger ones?\u003C/p\u003E\u003Cp\u003EThat\u0027s a really nice hammer indeed.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-11-19T23:36:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Draft\u0022 data-cite=\u0022Draft\u0022\u003E\u003Cdiv\u003ESo now you could, for example, have low-resolution scanners that can only determine the presence of a resource in a large area, shown on a less-sided grid, followed by more focused ones that work like the current ones and scan smaller cells within those larger ones?\u003Cp\u003EThat\u0027s a really nice hammer indeed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, although rendering that could be tricky. It\u0027s certainly easy to compute and represent in memory. While it would be possible to have many levels of detail, it\u0027s probably easier if there are just two views, low- and high-detail, where each low-detail cell has its own high-detail view. This is similar to the \u0022sub-hex scanning\u0022 concept that\u0027s been discussed before. The neat thing is that even if they\u0027re rendered in different views, the data can be stored in the same structure which opens options for querying high-detail data for the low-detail representation. If this is all a little vague, it\u0027s because there are a lot of options and it\u0027s not clear what would best enhance the game. I\u0027d like to begin experimenting soon, especially with that mapping prototype I promised a while back.\u003C/p\u003E\n"},{"CreatedByName":"Litar","CreatedById":9063,"CreatedDateTime":"2013-11-19T23:37:54Z","Content":"\n\u003Cp\u003EUpdate is great, map loads way faster now, but theres one minor bug - under a certain angle of camera, the grid disappears.\u003C/p\u003E\u003Cp\u003EScreenies:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/rSU8zH8,XY8eRxT#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/rSU8zH8,XY8eRxT#0\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-19T23:40:42Z\u0022 title=\u002211/19/2013 11:40  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 19, 2013\u003C/time\u003E by Litar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2013-11-19T23:39:28Z","Content":"\n\u003Cp\u003EIt\u0027s done that since at least 0.8.0\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-11-19T23:41:40Z","Content":"\n\u003Cp\u003EWill it now be possible to have a \u0022wide angle\u0022 scanner that covers more than one cell at a time?\u003C/p\u003E\n"},{"CreatedByName":"Litar","CreatedById":9063,"CreatedDateTime":"2013-11-19T23:44:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EIt\u0027s done that since at least 0.8.0\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eand could you view it from an inside of a planet since 0.8.0 as well?;p \u003Ca href=\u0022http://imgur.com/CVQvTRP\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/CVQvTRP\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-11-20T00:05:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Litar\u0022 data-cite=\u0022Litar\u0022\u003E\u003Cdiv\u003EUpdate is great, map loads way faster now, but theres one minor bug - under a certain angle of camera, the grid disappears.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve fixed this on my end and it\u0027ll be in the next update.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galane\u0022 data-cite=\u0022Galane\u0022\u003E\u003Cdiv\u003EWill it now be possible to have a \u0022wide angle\u0022 scanner that covers more than one cell at a time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, in theory, but that\u0027s also true of the old grid. I\u0027d like to make changes to scanning that make it a little more involved and a bit less waiting. It might become a two-step process where a high-altitude, wide-area scan is required in conjunction with a more local scan in order to efficiently locate deposits. It\u0027s all up in the air until I can finish new deposit generators. (Since the API is now open, I encourage everyone to experiment with those!) One key capability afforded by the new grid code is the ability to raycast sideways, so an airplane or low-orbiting scanner could sweep side-to-side and find cells. This wasn\u0027t really possible before. I don\u0027t think I want to make it \u003Cem\u003Eeasier\u003C/em\u003E to scan, but it should feel more like a game and involve more decision making. Again, it\u0027s hard to pin down specifics without experimenting. Something like a seismic charge that finds Kethane could be really fun (and it\u0027s possible now!) or it could be under/overpowered and boring.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-11-20T01:08:14Z","Content":"\n\u003Cp\u003EIs the seismic charge something you fire like a ground penetrator from orbit or is it something you do on the ground?\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-11-20T01:10:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Litar\u0022 data-cite=\u0022Litar\u0022\u003E\u003Cdiv\u003Eand could you view it from an inside of a planet since 0.8.0 as well?;p \u003Ca href=\u0022http://imgur.com/CVQvTRP\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/CVQvTRP\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure about versions, but yes. Yes you could \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nemesis24","CreatedById":84198,"CreatedDateTime":"2013-11-20T02:54:05Z","Content":"\n\u003Cp\u003EWhen I start up the game, it says Kethane isn\u0027t installed correctly. I\u0027m not sure what I\u0027m doing wrong, but it says the plugin paths are incorrect. I don\u0027t know if this has been answered before, but can someone give me a hint with this one? I\u0027ve got very bad luck with mods.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-11-20T04:57:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003ESomething like a seismic charge that finds Kethane could be really fun (and it\u0027s possible now!) or it could be under/overpowered and boring.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIIRC you didn\u0027t want to do something like that with Kethane itself? Is the new system making you rethink that? Anyway, that\u0027d be a great thing to see in the game.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-11-20T05:09:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EIIRC you didn\u0027t want to do something like that with Kethane itself? Is the new system making you rethink that? Anyway, that\u0027d be a great thing to see in the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI certainly don\u0027t want to do it with the current scan system, and I\u0027d prefer to do it with some other resource in order to keep Kethane consistent. But like I said: experimentation is key.\u003C/p\u003E\n"},{"CreatedByName":"Thourion","CreatedById":47430,"CreatedDateTime":"2013-11-20T07:30:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E ...I\u0027d like to make changes to scanning that make it a little more involved and a bit less waiting....It might become a two-step process where a high-altitude, wide-area scan is required in conjunction with a more local scan in order to efficiently locate deposits....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts pretty hard to find the sweet spot between involvment and grind, but yeah i couldnt agree more with the involved part.\u003C/p\u003E\u003Cp\u003EI also think that, the initial concept behind the two-step procedure, is a wanted thing for this mod, at least imo. It could prettify Game-flow, like for example you send a probe to search for traces of resources, more likely to determine if that body has the resources you need to see if its worth to plan a base for example.\u003C/p\u003E\u003Cp\u003EAnd if found you initiate the more thorough scan, that obviously takes more time.\u003C/p\u003E\u003Cp\u003EAnyway your stuff is solid, i cant wait to see how you going to implement them.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-20T08:18:04Z","Content":"\n\u003Cp\u003EHope I did not miss it while reading.\u003C/p\u003E\u003Cp\u003EBut did you take a look at the MAPscan mod and how it keeps scanning in the background as long as the active vessel has the scanning MODULE at least in passive mode?\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-11-20T13:39:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EBut did you take a look at the MAPscan mod and how it keeps scanning in the background as long as the active vessel has the scanning MODULE at least in passive mode?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESCANsat does nothing revolutionary. It\u0027s able to scan while unfocused because it doesn\u0027t consume electricity. It also doesn\u0027t interpolate between time steps. To solve the first problem, I\u0027ve started working on a cross-plugin resource architecture to allow for offline resource consumption and high-timewarp resource handling. I\u0027m cautiously optimistic about the potential for such a system. In any case, Kethane scanning will see some changes, but it probably won\u0027t have offline scanning until I can draw power or someone finally models that self-powered concept I wrote about a while ago.\u003C/p\u003E\n"}]}