{"TopicId":22166,"ForumId":34,"TopicTitle":"Kethane Pack 0.9.2 - New cinematic trailer! - 1.0 compatibility update","CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2012-10-14T12:08:20Z","PageNum":33,"Articles":[{"CreatedByName":"Jeep","CreatedById":68948,"CreatedDateTime":"2013-06-13T21:11:04Z","Content":"\n\u003Cp\u003Ewhats best way to get kethane from the mun to my space station orbiting the moon ?\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-13T21:19:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jeep\u0022 data-cite=\u0022Jeep\u0022\u003E\u003Cdiv\u003Ewhats best way to get kethane from the mun to my space station orbiting the moon ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is actually how I mine moons, really no point keeping it on surface. I\u0027ve found little reusable jumpships, just enough to get down and back up full, seems to be most resource effective. I drop the wellhead first, this drills and stores. Then a small tanked rover to transfer kethane into jumpship. Jumpship goes back and forth between surface and orbital refinery. Keep in mind I only do this on moons, planets I typicaly have permanent large bases, so my logistics chain is a bit different there.\u003C/p\u003E\n"},{"CreatedByName":"Fyrem","CreatedById":57131,"CreatedDateTime":"2013-06-13T21:21:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jeep\u0022 data-cite=\u0022Jeep\u0022\u003E\u003Cdiv\u003Ewhats best way to get kethane from the mun to my space station orbiting the moon ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ea rocket.....\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-13T21:32:56Z","Content":"\n\u003Cp\u003EI have a dedicated mining lander with its own engines and crew pods and power supply, it lands at the chosen site after the moon is mapped and behind drilling. Next I land a large tanker beside it and connect them with one of many different available fuel transfer methods (using KAS currently) then start to move the fuel over to the tanker. The tanker is built specifically for whichever planet or mood it\u0027s landing on so it\u0027s TWR is matched to the gravity so that I\u0027m carrying only as much engine as I need (LVN\u0027s naturally). The tanker then brings the load of fuel to orbit and drops it at the orbital fuel depot and returns to the surface to get another load. The key to this method is to bring as little dead weight up from the surface as possible. This includes mono propellant. If your fuel depot has a full mono load don\u0027t bring another full load up every trip your just wasting 3 tonnes and several hundred dV\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-13T22:04:59Z","Content":"\n\u003Cp\u003ESounds like your doing the conversions on the moons yes HoY?\u003C/p\u003E\u003Cp\u003EI do mine a little different, I export raw kethane off the moons, store it, and don\u0027t convert it till its actively needed. I like doing it this way because its more versatile, also allows my jumpship to be rather small.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-13T22:12:29Z","Content":"\n\u003Cp\u003EYes I store it in orbit as refined fuels. Up until the most recent update that it was the most efficient method for getting the fuel where you need it. Even now I\u0027m not 100% convinced moving raw kethane off the surface is more efficient with the exception of using it in the kethane engine. \u003C/p\u003E\u003Cp\u003EI\u0027m sure people will test this to death in the near future, and even if it proves better it won\u0027t likely be much better and will require a more complicated tanker setup, and with the volumes of fuel I like to move in each launch it would start to raise my part count unreasonably high.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-13T22:14:46Z\u0022 title=\u002206/13/2013 10:14  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 13, 2013\u003C/time\u003E by HoY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-13T22:16:01Z","Content":"\n\u003Cp\u003EI like exporting raw kethane simply for flexability....if my orbital refineries have kethane in them then I can dock and get any fuel I need. Honestly I been doing it like this since before the latest changes, though now I actually wont be losing my tail doing it this way haha!\u003C/p\u003E\n"},{"CreatedByName":"Jeep","CreatedById":68948,"CreatedDateTime":"2013-06-13T22:17:37Z","Content":"\n\u003Cp\u003Eshow some examples and tutorials I just cant figure out the best way. I have the drilling unit there with large fuel tank to take off to meet back up at space station but dont have enough fuel to get there. I can orbit and thats about it. I can convert the 8000 kethane into more fuel but only leaves me maybe 2000 left so no point in wasting more fuel and time to dock at space station with so little fuel and kethane.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-13T22:23:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jeep\u0022 data-cite=\u0022Jeep\u0022\u003E\u003Cdiv\u003Eshow some examples and tutorials I just cant figure out the best way. I have the drilling unit there with large fuel tank to take off to meet back up at space station but dont have enough fuel to get there. I can orbit and thats about it. I can convert the 8000 kethane into more fuel but only leaves me maybe 2000 left so no point in wasting more fuel and time to dock at space station with so little fuel and kethane.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like maybe you did your TWR math on the ship empty of kethane? Kethane is not super heavy, but I wouldn\u0027t go so far as to call it lightweight either. Make sure your TWR calculation account for the weight of the ship totally full\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-13T22:27:58Z","Content":"\n\u003Cp\u003EJeep do you use mechjeb or engineer? Design your tanker to have enough deltaV on the launch pad to get it to orbit and back with an empty kethane tank. Use engineer to show your TWR on your planned moon, then launch to the launch pad and use hyperedit to fill your kethane tank. Now using engineer or mechjeb you make sure you have enough deltaV to launch, rendezvous and land again with a full tank. You\u0027ll be a little over fueled this way because your mass will lower once you dump the kethane in orbit. \u003C/p\u003E\u003Cp\u003ERegardless of wether you want to being up fuel or kethane this part stays the same. Don\u0027t bring up extra mass on each launch. Leave your drills and processors on the surface or in orbit, and only move your drills if you dry up the deposit. Having the drilling rig on wheels instead of rockets is more efficient also, if you don\u0027t mind the drive between deposits (mechjeb will be adding a true rover autopilot in a future update if that influences your decision)\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-06-13T22:46:03Z","Content":"\n\u003Cp\u003EThat sounds a bit overcomplicated. Kethane is 2 kg/L, or 2 tons / 1000 units. So just stack a bunch of fuel on top of your tanker in the VAB to simulate the mass of a full kethane tank. Then engineer or mechjeb should give you accurate values for delta-v.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-13T23:16:13Z","Content":"\n\u003Cp\u003EYou can do it that way too, but launching and pressing refill ship resources seems a little quicker than adding up pieces to make up the target mass, but whichever floats your boat \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spoo","CreatedById":62914,"CreatedDateTime":"2013-06-13T23:24:14Z","Content":"\n\u003Cp\u003EI\u0027d like to see the option for infinite kethane deposits, but with differing extraction efficiency. In that setup, any given deposit never runs out, but some deposits produce more kethane per unit time.\u003C/p\u003E\n"},{"CreatedByName":"LegyPlegy","CreatedById":70647,"CreatedDateTime":"2013-06-13T23:29:28Z","Content":"\n\u003Cp\u003EHi everyone! I\u0027m new to the forums, and I have a small grasp on KSP. I\u0027ve finally refined my knowledge of Delta-V, (wish I had found flight engineer before studying all of the equations and such ._.) TWR, piloting and such to where I\u0027ve built a launcher that can successfully (and quite easily, actually, with plenty of fuel left over in the last stage) put a satellite/lander in orbit with the Mun.\u003C/p\u003E\u003Cp\u003ENow, my question is this; Does the orientation of the space craft affect the overall quality of the scanner? I currently have a satellite (below) orbiting the mun and scanning for kethane. Does the scanner have to be pointed at the surface? And if so, how can I do that? The satellite for some reason always moves away from where I\u0027ve aimed it, and this makes it a pain to keep it pointed at the surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/DsH38IN\u0022 alt=\u0022DsH38IN\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, my satellite scanner only shows me a small 1 pixel line, though, instead of a large map. Is this intended, or do I have to go down to the surface and scan there for a better map?\u003C/p\u003E\u003Cp\u003EThanks for your input, and please keep working on this great mod! Very useful and overall fun to use \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, does Kethane weigh the same as liquid fuel? I don\u0027t see any stats on the weight, and the fuel tanks ingame are obviously empty, so I just want to know now before I facepalm afterwards on the Mun... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-14T00:08:30Z\u0022 title=\u002206/14/2013 12:08  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 14, 2013\u003C/time\u003E by Aphox\u003C/strong\u003E\n\u003Cbr\u003EMerged double post\n\u003C/span\u003E\n"},{"CreatedByName":"Pontiac","CreatedById":62216,"CreatedDateTime":"2013-06-14T00:08:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003EDone and done, well not quite done, but I\u0027ll add more pictures to illustrate things better a little later. \u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/35664-Kethane-Usage-and-Proper-Fuel-Routing\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/35664-Kethane-Usage-and-Proper-Fuel-Routing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf anyone wants to add a section on detectors that would be great. I haven\u0027t really used them much and so don\u0027t have the greatest understanding of how they work and the ideal way to set them up.\u003C/p\u003E\u003Cp\u003EEdit: Anyone else feel free to add to it or correct me if I made any mistakes. I\u0027ll fix the original post or you can add a reply.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBetter than I would have done. Bookmarked, so I don\u0027t become an idiot again after 13 hours.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-14T00:33:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LegyPlegy\u0022 data-cite=\u0022LegyPlegy\u0022\u003E\u003Cdiv\u003Esnip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWelcome. Firstly yes the map is supposed to look like that. You need to move your mapping satellite to a near polar orbit, then have it orbit the mun many times with its scanner activated. (Time warp helps a LOT, 50-100x time warp recommended)\u003C/p\u003E\u003Cp\u003EThe orientation only matters if you need to keep your solar panels pointed at Kerbol (the sun) otherwise the scanner will automatically orient itself at the surface of the mun.\u003C/p\u003E\n"},{"CreatedByName":"Redwork Studios-Redwork1","CreatedById":58938,"CreatedDateTime":"2013-06-14T00:33:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LegyPlegy\u0022 data-cite=\u0022LegyPlegy\u0022\u003E\u003Cdiv\u003EHi everyone! I\u0027m new to the forums, and I have a small grasp on KSP. I\u0027ve finally refined my knowledge of Delta-V, (wish I had found flight engineer before studying all of the equations and such ._.) TWR, piloting and such to where I\u0027ve built a launcher that can successfully (and quite easily, actually, with plenty of fuel left over in the last stage) put a satellite/lander in orbit with the Mun.\u003Cp\u003ENow, my question is this; Does the orientation of the space craft affect the overall quality of the scanner? I currently have a satellite (below) orbiting the mun and scanning for kethane. Does the scanner have to be pointed at the surface? And if so, how can I do that? The satellite for some reason always moves away from where I\u0027ve aimed it, and this makes it a pain to keep it pointed at the surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/DsH38IN.png\u0022 alt=\u0022DsH38IN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, my satellite scanner only shows me a small 1 pixel line, though, instead of a large map. Is this intended, or do I have to go down to the surface and scan there for a better map?\u003C/p\u003E\u003Cp\u003EThanks for your input, and please keep working on this great mod! Very useful and overall fun to use \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, does Kethane weigh the same as liquid fuel? I don\u0027t see any stats on the weight, and the fuel tanks ingame are obviously empty, so I just want to know now before I facepalm afterwards on the Mun... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom All of my experimenting and stuff, I have found that, no, the orientation of a spacecraft does not affect the scanners quality, quantity, or efficiency. The Kethane weighs about as much as liquid fuel, and I think that the kethane tanks have the same volume as the normal tanks. \u003C/p\u003E\u003Cp\u003ESources: my experience \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-06-14T01:22:27Z","Content":"\n\u003Cp\u003EKethane tanks hold 2.5x the \u0022volume\u0022 of regular tanks, but kethane is 0.4x as massive, so it balances out to being the same. Rather handing for designing kethane freighters: build the ship with regular tanks to get delta-v and TWR, then replace the tanks with kethane tanks. You then know you\u0027ve got a ship that will do the job.\u003C/p\u003E\n"},{"CreatedByName":"LegyPlegy","CreatedById":70647,"CreatedDateTime":"2013-06-14T01:29:17Z","Content":"\n\u003Cp\u003EI feel bad for asking so many questions in one day, but thanks for your earlier help! \u003C/p\u003E\u003Cp\u003ENow, being the stupid person I am at KSP, I decided a lander would be the best idea for mining kethane on the Mun.\u003C/p\u003E\u003Cp\u003EThis didn\u0027t work out too well.\u003C/p\u003E\u003Cp\u003EFor starters, I have to lift my ship and manually land it everywhere, but I have (had...) plenty of fuel. The real problem, though, is I have no idea how to navigate using the detector map. I see that my \u002B is right next to a deposit, but no matter how far I move it barely moves over the kethane deposit... I guess I\u0027ll keep trying to look with infinite fuel on, but how does one officially find kethane on the surface with the detectors? :l\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/OByUnux\u0022 alt=\u0022OByUnux\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-06-14T01:53:59Z","Content":"\n\u003Cp\u003EIt\u0027s worth noting that Kethane tanks are \u003Cem\u003Eslightly\u003C/em\u003E smaller (shorter) and have a slightly better mass ratio. The wet mass is basically equivalent; the largest Kethane tank holds fuel that weighs the same as the large orange rocket fuel tank\u0027s fuel. The Kethane tank ends up being slightly lighter because of its dry mass. Trivia: Kethane tanks have a mass ratio that improves as tanks get larger.\u003C/p\u003E\u003Cp\u003EAlso, I coded up a wet mass indicator for the Kethane tanks, and that\u0027ll be in the next release.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-14T01:57:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LegyPlegy\u0022 data-cite=\u0022LegyPlegy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThanks for your input, and please keep working on this great mod! Very useful and overall fun to use \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, does Kethane weigh the same as liquid fuel? I don\u0027t see any stats on the weight, and the fuel tanks ingame are obviously empty, so I just want to know now before I facepalm afterwards on the Mun... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe way the satellite sits in its orbit does not matter. However your orbital parameters are everything to how your map comes out. Orbital altitude and inclination are the 2 most important things to look at for scanning satellite. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27999-ISA-Mapsat-Ideal-and-Non-Ideal-Altitudes\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/27999-ISA-Mapsat-Ideal-and-Non-Ideal-Altitudes\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis thread was made in regards to ISA mapsat, but the math is good for any scan really. First step is figuring out at what time warp speed you wanna run the scanner at. From there you can work out how many scanners youl need in the sat, how high it should be, and inclination.\u003C/p\u003E\n"},{"CreatedByName":"Redwork Studios-Redwork1","CreatedById":58938,"CreatedDateTime":"2013-06-14T03:00:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LegyPlegy\u0022 data-cite=\u0022LegyPlegy\u0022\u003E\u003Cdiv\u003EI feel bad for asking so many questions in one day, but thanks for your earlier help! \u003Cp\u003ENow, being the stupid person I am at KSP, I decided a lander would be the best idea for mining kethane on the Mun.\u003C/p\u003E\u003Cp\u003EThis didn\u0027t work out too well.\u003C/p\u003E\u003Cp\u003EFor starters, I have to lift my ship and manually land it everywhere, but I have (had...) plenty of fuel. The real problem, though, is I have no idea how to navigate using the detector map. I see that my \u002B is right next to a deposit, but no matter how far I move it barely moves over the kethane deposit... I guess I\u0027ll keep trying to look with infinite fuel on, but how does one officially find kethane on the surface with the detectors? :l\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/OByUnux.png\u0022 alt=\u0022OByUnux.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts a bit tricky finding a place for the detector, but it usually ends up stuck on a radial fuel tank on my landers. Now, for landing at a deposit. Usually I go in a low orbit, around 5000-6000 meters over Minmus, that way I have the least amount of velocity, then, when I have a deposit, I kill off My horizontal velocity, and attempt to land. Its a bit tricky finding a place for the detector, but it usually ends up stuck on a radial fuel tank on my landers. I suppose that would work at the mun too, but you would need more power to kill the velocity, but not that much more. I always begin landing/killing velocity, as soon as I find a deposit, as they seem to go for a kilometer or two, so I have enough time to kill off the velocity. Now I know all of this from experience, and the only mission failures using this method are... (A) Running out of fuel. (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Crashing, or © Missing the Kethane Entirely.\u003C/p\u003E\u003Cp\u003EHope this all helps!\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-14T03:18:32Z","Content":"\n\u003Cp\u003EHonestly your method of landing sounds kinda reckless bud. It takes a tiny more Dv but I always start my deorbit from higher. Gives you more time to dial in on your target LZ. Not to mention more time to correct problems if they arise. 5000meter deorbit burn.....you let Jeb drive, don\u0027t you =P\u003C/p\u003E\u003Cp\u003EEither way works really, that\u0027s more of a pilot preference kinda thing. \u003C/p\u003E\u003Cp\u003EAs for your mission Legy, do you have a separate scanner in orbit at the Mun. When it comes to kethane mining you really want to make each part of the process have its own dedicated ship. Personaly I don\u0027t even put scanners on my landing/mining craft. I make notes of Lat/Long for the deposits and then use map to target my LZ.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-06-14T04:08:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EHonestly your method of landing sounds kinda reckless bud. It takes a tiny more Dv but I always start my deorbit from higher. Gives you more time to dial in on your target LZ. Not to mention more time to correct problems if they arise. 5000meter deorbit burn.....you let Jeb drive, don\u0027t you =P\u003Cp\u003EEither way works really, that\u0027s more of a pilot preference kinda thing. \u003C/p\u003E\u003Cp\u003EAs for your mission Legy, do you have a separate scanner in orbit at the Mun. When it comes to kethane mining you really want to make each part of the process have its own dedicated ship. Personaly I don\u0027t even put scanners on my landing/mining craft. I make notes of Lat/Long for the deposits and then use map to target my LZ.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI always put scanners on my landers, nice to get the verification during decent also nice to be able to fly over the deposit and verify you has not mined it dry. \u003C/p\u003E\u003Cp\u003EI also convert as I mine, keep some kerthane for making monoprop if I use a lot or I use it to fuel the miner on the way back.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-06-14T09:17:04Z","Content":"\n\u003Cp\u003EI\u0027ve been working on multiple-resources support, and most of the hard stuff is done. All that\u0027s left now is scanning and a bit of cleanup, so to those ends, I\u0027ve been \u003Ca href=\u0022http://i.imgur.com/S38YLkc.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eplaying with the UI\u003C/a\u003E. The arrows are for selecting which resource to view. With the current scanning system, it would be difficult to support multiple resources overlayed, so a selector will have to do.\u003C/p\u003E\u003Cp\u003EOnce multiple-resources is in a stable state, I\u0027ll see about getting other mod developers to test it to work out all the kinks, since initially, Kethane won\u0027t itself support multiple resources. During that time I\u0027ll work on the new generator part and other miscellaneous improvements.\u003C/p\u003E\n"}]}