{"TopicId":22166,"ForumId":34,"TopicTitle":"Kethane Pack 0.9.2 - New cinematic trailer! - 1.0 compatibility update","CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2012-10-14T12:08:20Z","PageNum":49,"Articles":[{"CreatedByName":"Pontiac","CreatedById":62216,"CreatedDateTime":"2013-06-22T21:20:59Z","Content":"\n\u003Cp\u003EFirst, ENJOY YOUR VACATION Majiir. The time off is great, first off, second, I can actually start playing with the new toys you\u0027ve put in. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve read from post 1118 to here to see if anyone else has commented on this issue. I JUST downloaded 6.1 and installed/extracted. I have a positioning issue with the electric converter. The problem is that where my mouse cursor is versus where the converter should sit. The converter is way off center from where the mounting point should be.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://content.screencast.com/users/Pontiac76/folders/Snagit/media/28ad6fee-772e-4130-b08d-3afb07620227/06.22.2013-17.12.54.png\u0022 alt=\u002206.22.2013-17.12.54.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe cursor is near the edge of the orange tank, but the converter isn\u0027t sitting on the node.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://content.screencast.com/users/Pontiac76/folders/Snagit/media/3921503a-5da6-48a0-bbaf-c4dec651f83d/06.22.2013-17.14.35.png\u0022 alt=\u002206.22.2013-17.14.35.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt centers properly off on its own. The orange tank rim is at the bottom of this image.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://content.screencast.com/users/Pontiac76/folders/Snagit/media/9a961e8b-0f2b-4053-b7e3-165548b5847f/06.22.2013-17.16.02.png\u0022 alt=\u002206.22.2013-17.16.02.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother shot with the off-centeredness.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://content.screencast.com/users/Pontiac76/folders/Snagit/media/74e01313-6cfd-471f-813e-74fa6254651e/06.22.2013-17.22.32.png\u0022 alt=\u002206.22.2013-17.22.32.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis one is just plain old weird. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI thought the issue might be due to just overwriting the Kethane directory, so before posting this, I delete the GameData/Kethane directory (Actually moved it to my desktop just in case) then re-extracted, same effect on my old ship. Then decided to try a brand new ship with just an orange tank and a command module. Same effect. Fixing this is above my pay grade, as I have NO idea where the decision is made for mount points. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI should also mention that the nodes don\u0027t snap together when trying to attach this to something, but, the on other side, the small kethane scanner does snap in place.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T21:28:22Z\u0022 title=\u002206/22/2013 09:28  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by Pontiac\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-22T21:30:17Z","Content":"\n\u003Cp\u003EAre you trying to stack mount it on the green node? If so change your camera angle to view the tank from the side then move the green node on the generator down till they touch. It will snap the nodes together. All objects that both stack mount and radially mount behave like this\u003C/p\u003E\n"},{"CreatedByName":"Pigbear","CreatedById":68791,"CreatedDateTime":"2013-06-22T23:05:46Z","Content":"\n\u003Cp\u003Ewhat is this \u0022KSP tv\u0022?\u003C/p\u003E\u003Cp\u003EI want to see the geodesic part.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-06-22T23:26:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pigbear\u0022 data-cite=\u0022Pigbear\u0022\u003E\u003Cdiv\u003Ewhat is this \u0022KSP tv\u0022?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA group that does live streams lead by Squad on TwitchTV. last night there was a stream in which the Kethane mod was showcased and we could see that Majiir is working on. An awesome Hexmap!\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-06-22T23:44:24Z","Content":"\n\u003Cp\u003EMan, it\u0027s showing impossible to extract kethane from Laythe. first the Kethane is showing on water places, Second, i can\u0027t land on water to extract...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter all the effort to build a STAR Galaxy MjK Ship!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm3.staticflickr.com/2894/9112571324_a260c322a7_o.png\u0022 alt=\u00229112571324_a260c322a7_o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7454/9110358077_9b3fe109b3_o.png\u0022 alt=\u00229110358077_9b3fe109b3_o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm6.staticflickr.com/5494/9112581092_ed343bac4b_o.png\u0022 alt=\u00229112581092_ed343bac4b_o.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T23:46:46Z\u0022 title=\u002206/22/2013 11:46  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by Climberfx\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-22T23:51:49Z","Content":"\n\u003Cp\u003ELook back a couple paged Climber, look at Kaos\u0027s posts about deep sea drilling rigs\u003C/p\u003E\n"},{"CreatedByName":"Mechrior","CreatedById":57987,"CreatedDateTime":"2013-06-23T12:07:57Z","Content":"\n\u003Cp\u003Ei think my post got swallowed, is there any way to make the detectors map window bigger please?!\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-23T14:25:19Z","Content":"\n\u003Cp\u003ENot yet, but read the past 2-3 pages and you\u0027ll see that there\u0027s a new map coming in 0.7\u003C/p\u003E\n"},{"CreatedByName":"Pontiac","CreatedById":62216,"CreatedDateTime":"2013-06-23T14:47:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003EAre you trying to stack mount it on the green node? If so change your camera angle to view the tank from the side then move the green node on the generator down till they touch. It will snap the nodes together. All objects that both stack mount and radially mount behave like this\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt worked if I aimed the camera along the horizon, twisted the generator in some odd fashion. Eventually it did manage to get it on and snapped into place, but 5 minutes of this kind of work, not to mention the gut wrenching annoyance levels I was feeling, just to put an attachment on shouldn\u0027t be this hard. I can\u0027t think of another component that is off set like this, and I have to manage camera angles to get it to work.\u003C/p\u003E\u003Cp\u003ENeedless to say, its attached, I\u0027m happy for this particular config, but don\u0027t look forward to the next time I need to do this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E@Majiir, how does this thing balance itself out? What \u0022window\u0022 does it keep the electrical balance at? I was going to say about 75%, but I noticed it was dipping at times closer to 60%. Can I ask though that these generators try and always put a \u002B0.1% of juice into the system? Anything less than 100% in the electrical makes me nervous even if it is holding steady. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-23T15:26:44Z","Content":"\n\u003Cp\u003EAlmost everything that has surface and node attach behaves like this....angle your looking at things has always played a big role in building.\u003C/p\u003E\u003Cp\u003EAnd the generator operates like it does to keep from burning kethane it does not need to.\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-06-23T15:54:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003ELook back a couple paged Climber, look at Kaos\u0027s posts about deep sea drilling rigs\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank\u0027s for the tip Roy! I will find it!\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-23T15:54:44Z","Content":"\n\u003Cp\u003EThe generator seems to power up and keep your battery storage from dipping below 75%, and if it spikes lower than that the generators will power up higher to recharge them to around 75-80% capacity before they lower down again. I only actually noticed this when I was driving a test rover from the runway to the launch pad trying to get KAS to pipe LFO.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-06-23T15:55:39Z","Content":"\n\u003Cp\u003EI didn\u0027t have any issues with the generator, but my method of attaching parts is always to view the craft from the side so I can plop the part straight down. I\u0027ll play with it when I\u0027m back. I suspect it\u0027s not fixable by anyone except Keptin, at least not without some fancy plugin voodoo. In his defense, the generator is still an in-development part; it\u0027s missing an animation and presumably the centering is all part of testing that would happen before he gives the final certification. It did have two of its animations working and looked damn gorgeous to boot, so I released it anyway.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pontiac\u0022 data-cite=\u0022Pontiac\u0022\u003E\u003Cdiv\u003E@Majiir, how does this thing balance itself out? What \u0022window\u0022 does it keep the electrical balance at? I was going to say about 75%, but I noticed it was dipping at times closer to 60%. Can I ask though that these generators try and always put a \u002B0.1% of juice into the system? Anything less than 100% in the electrical makes me nervous even if it is holding steady. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe generator has a few different mechanics.\u003C/p\u003E\u003Cp\u003EFirst, a demand ratio is computed from the current percentage of ElectricCharge using a logistic curve. \u003Ca href=\u0022http://www.wolframalpha.com/input/?i=plot\u002B1\u002B%2F\u002B%28e%5E%2815x\u002B-\u002B10.5%29\u002B%2B\u002B1%29%2C\u002Bx%3D0..1\u0022 rel=\u0022external nofollow\u0022\u003EThe function looks like this.\u003C/a\u003E The X axis is the current level of ElectricCharge and the Y axis is the demand ratio. There will only be demand if it comes out to 10% or higher, so the generator won\u0027t try to run above about 85% capacity. By the time you\u0027re at 40-50% capacity, it\u0027s trying to run at full speed.\u003C/p\u003E\u003Cp\u003EI say \u003Cem\u003Etrying\u003C/em\u003E because the demand doesn\u0027t directly translate into power output. The demand is used to consume Kethane, and each frame, the demand is multiplied by the ratio of Kethane we were able to draw. (This just accounts for situations when we\u0027re running out of fuel.) The resulting value is fed into a 3-second moving average. Waste XenonGas is produced immediately after Kethane is consumed.\u003C/p\u003E\u003Cp\u003ESimultaneously, the moving average is sampled to give the output ratio. This is used to produce the actual electricity and scale the exhaust effect.\u003C/p\u003E\u003Cp\u003EThe intake fan has its own 1-second moving average. The input to this average is \u003Ca href=\u0022http://www.wolframalpha.com/input/?i=plot\u002B%282x%29\u002B%2F\u002B%28x%5E2\u002B%2B\u002B1%29%2C\u002Bx%3D0..5\u0022 rel=\u0022external nofollow\u0022\u003Ethis function\u003C/a\u003E of atmospheric pressure. The result of the average animates the fan and reduces the quantity of Kethane required. (It doesn\u0027t affect output, though, so it\u0027s an efficiency mechanism only.) The value of the average is multiplied by the current atmospheric pressure to figure the actual efficiency gain, which gives \u003Ca href=\u0022http://www.wolframalpha.com/input/?i=plot\u002Bx\u002B*\u002B%28%282x%29\u002B%2F\u002B%28x%5E2\u002B%2B\u002B1%29%29%2C\u002Bx%3D0..5\u0022 rel=\u0022external nofollow\u0022\u003Ethis function\u003C/a\u003E under constant pressure conditions.\u003C/p\u003E\u003Cp\u003EThere are a couple things I could do to make it feel a bit better. I could replace the demand controller with a PID, but that would introduce another source of latency; or I could make the demand function scale off something other than total battery capacity. (Instead, it could scale off something like fifteen seconds worth of full power output.)\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-23T15:56:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Climberfx\u0022 data-cite=\u0022Climberfx\u0022\u003E\u003Cdiv\u003EThank\u0027s for the tip Roy! I will find it!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn short he uses some boat parts from the R3 pack and a modified KAS winch to lower the drills to the sea floor over a kethane deposit. From what he said his biggest holdup is how long it takes to sink the drills down that deep for the deepest ones.\u003C/p\u003E\n"},{"CreatedByName":"Kenobi McCormick","CreatedById":57254,"CreatedDateTime":"2013-06-23T16:23:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI could replace the demand controller with a PID, but that would introduce another source of latency\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe latency seems just fine to me. A real-world genset like this takes a few moments to spool up anyway assuming a torquey piston engine of some sort. I\u0027m assuming due to its shape and the fact that for the life of me I cannot even come close to maxing one out on a reasonable rover that the generator is a gas turbine engine, which would take forever to spool up \u003Cem\u003Ewithout\u003C/em\u003E a load...and mine\u0027s a quarter the size and output it was originally!\u003C/p\u003E\u003Cp\u003E I could see up to a second of lag time between demand and peak output as being quite applicable, and in even my most demanding rovers I can\u0027t drain a decent battery that fast so I don\u0027t see it causing most players any issues. I\u0027m betting most people would be using these on rovers, and as a rule you need a few batteries on those for the wheels to function properly anyway since wheels hate drawing directly from a generator for some reason.\u003C/p\u003E\u003Cp\u003EI\u0027ve also noticed something else: The generator does not seem to get hot. This I find a bit odd...I\u0027m assuming it\u0027s burning the kethane to produce the electricity yet I cannot get one to overheat even if I overload it with a horde of kethane drills. I\u0027m assuming that is because the genset is still WIP and not complete, aye?\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-06-23T17:39:05Z","Content":"\n\u003Cp\u003ELatency is intended, even; that\u0027s what the moving average is for (that and smoothing). Adding a PID controller would add latency on the consumption side as well, but I could tune it to have a pretty quick response. At the very least, I think it should ignore total battery capacity and instead set throttle based on how much energy has been drained relative to peak output.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kenobi McCormick\u0022 data-cite=\u0022Kenobi McCormick\u0022\u003E\u003Cdiv\u003EI\u0027ve also noticed something else: The generator does not seem to get hot. This I find a bit odd...I\u0027m assuming it\u0027s burning the kethane to produce the electricity yet I cannot get one to overheat even if I overload it with a horde of kethane drills. I\u0027m assuming that is because the genset is still WIP and not complete, aye?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI hadn\u0027t even thought to make the generator create heat. Its exhaust is hot, but I\u0027m not sure the generator needs a heat mechanic; since you can\u0027t throttle it manually, it would be obnoxious for the thing to blow up on you just because you dock with a discharged battery.\u003C/p\u003E\u003Cp\u003EIt also may not be burning the Kethane completely; it could be working like a fuel cell for much of the energy and burning some of the products. It definitely puts out heat, but it\u0027s not going to heat up like the turbine.\u003C/p\u003E\u003Cp\u003EI\u0027ll take a look at all this at some point along with the mass and reaction stats. I\u0027d like the generator to be competitive with solar panels when running at high load for relatively short periods of time. I think it\u0027s already competitive with RTGs; it\u0027s much more compact and even including fuel requires a lot less mass for certain loads.\u003C/p\u003E\n"},{"CreatedByName":"HGGundamReviews","CreatedById":57099,"CreatedDateTime":"2013-06-23T17:54:36Z","Content":"\n\u003Cp\u003EJust kinda want to show off my Keth mining rig. Ground based and assembled using Docking Port Sr.\u0027s \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1133.photobucket.com/albums/m593/HGGundamReviews/screenshot8.png\u0022 alt=\u0022screenshot8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1133.photobucket.com/albums/m593/HGGundamReviews/screenshot10-1.png\u0022 alt=\u0022screenshot10-1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1133.photobucket.com/albums/m593/HGGundamReviews/screenshot11.png\u0022 alt=\u0022screenshot11.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1133.photobucket.com/albums/m593/HGGundamReviews/screenshot9.png\u0022 alt=\u0022screenshot9.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kenobi McCormick","CreatedById":57254,"CreatedDateTime":"2013-06-23T18:37:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Eit would be obnoxious for the thing to blow up on you just because you dock with a discharged battery.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E I agree. I\u0027m thinking it should take a 200% or higher, constant, overload to get it to overheat at all, and 300%\u002B to actually explode it.\u003Cp\u003EIt should be possible but highly unlikely under normal use, basically.\u003C/p\u003E\n"},{"CreatedByName":"Gaius","CreatedById":66495,"CreatedDateTime":"2013-06-23T19:02:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kenobi McCormick\u0022 data-cite=\u0022Kenobi McCormick\u0022\u003E\u003Cdiv\u003EI agree. I\u0027m thinking it should take a 200% or higher, constant, overload to get it to overheat at all, and 300%\u002B to actually explode it.\u003Cp\u003EIt should be possible but highly unlikely under normal use, basically.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes the generator actually deliver 300% power under those circumstances? If you ask it to deliver more power than it should, and it does, then yes, it should overheat. If you ask it to deliver power for more drills than it should and instead of doing so, it just delivers its rated maximum power and no more, it should not overheat either. It should only overheat at \u0026gt;100% capacity if it\u0027s actually doing \u0026gt;100% work, or where\u0027s the extra heat coming from? It\u0027s not actually doing any more work, despite your demands, so...\u003C/p\u003E\u003Cp\u003EBasically, if the amount of power it delivers is dependent on the number of drills you connect, then yes, it should overheat if you connect too many. But if the amount of power it delivers caps out, and does not increase when you turn on more drills, it shouldn\u0027t burn any hotter when you do, it ain\u0027t doing any more work regardless of how many drills you try to split the insufficient power between...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-23T19:08:45Z\u0022 title=\u002206/23/2013 07:08  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 23, 2013\u003C/time\u003E by Gaius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arrowstar","CreatedById":2521,"CreatedDateTime":"2013-06-23T20:11:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EI\u0027ll be developing live. Since I\u0027ll be working with particles, it\u0027ll be a lot more interesting than just staring at code.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice, I look forward to watching! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pigbear","CreatedById":68791,"CreatedDateTime":"2013-06-23T21:38:17Z","Content":"\n\u003Cp\u003EI want to see the Geodesic map. Can I get a picture?\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-06-23T21:47:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EFat chance!\u003C/span\u003E\u003C/strong\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i6.minus.com/iijJweM9KKh5h.png\u0022 alt=\u0022iijJweM9KKh5h.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s a shot. I missed the stream because the twitch iOS app SUCKS\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-06-24T00:08:30Z","Content":"\n\u003Cp\u003ETwitch app don\u0027t suck\u0027s, it never work.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-24T00:56:19Z","Content":"\n\u003Cp\u003EDid someone order some Kethane storage?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/okQ5PeJ.png\u0022 alt=\u0022okQ5PeJ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"XbasmanX","CreatedById":57708,"CreatedDateTime":"2013-06-24T03:49:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EIt sounds like you may have installed Kethane in the wrong location. You should copy the GameData folder directly into the KSP root directory and allow the folders to merge. Upload your output log if reinstalling the mod doesn\u0027t solve the issue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere do you find the output log?\u003C/p\u003E\u003Cp\u003EP.S. My Kethane is is installed correctly.\u003C/p\u003E\n"}]}